Repository: django/django-docs-translations
Catalog: translations/*/index.po
Languages: ru

source: Django documentation
ru: Документация Django

source: Everything you need to know about Django.
ru: Все что нужно знать о Django

source: Getting help
ru: Получить подсказку

source: Having trouble? We'd like to help!
ru: Испытываете сложности? Мы будем рады вам помоч!

source: Try the :doc:`FAQ <faq/index>` -- it's got answers to many common questions.
ru: Загляните в :doc:`ЧаВо <faq/index>` -- здесь имеются ответы на большинство общих вопросов.

source: Looking for specific information? Try the :ref:`genindex`, :ref:`modindex` or the :doc:`detailed table of contents <contents>`.
ru: Ищите определенную информацию? Загляните в :ref:`genindex`, :ref:`modindex` или обратитесь к :doc:`подробному содержанию <contents>`.

source: Search for information in the `archives of the django-users mailing list`_, or `post a question`_.
ru: Поищите информацию в `архивах переписки django-пользователей`_, или `задайте свой вопрос`_.

source: Ask a question in the `#django IRC channel`_, or search the `IRC logs`_ to see if it's been asked before.
ru: Задайте вопрос на `IRC канале #django`_ или может быть кто-то уже задавал такой вопрос просмотрите `IRC логи`_

source: Report bugs with Django in our `ticket tracker`_.
ru: Сообщите об ошибке в Django с помощью `системы отслеживания заявок`_.

source: First steps
ru: Первые шаги

source: Are you new to Django or to programming? This is the place to start!
ru: Вы новичёк в Django или вообще в программировании? Начните отсюда!

source: **From scratch:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
ru: **Для начала:** :doc:`Обзор <intro/overview>` | :doc:`Установка <intro/install>`

source: **Tutorial:** :doc:`Part 1 <intro/tutorial01>` | :doc:`Part 2 <intro/tutorial02>` | :doc:`Part 3 <intro/tutorial03>` | :doc:`Part 4 <intro/tutorial04>` | :doc:`Part 5 <intro/tutorial05>` | :doc:`Part 6 <intro/tutorial06>`
ru: **Краткое руководство:** :doc:`Часть 1 <intro/tutorial01>` | :doc:`Часть 2 <intro/tutorial02>` | :doc:`Часть 3 <intro/tutorial03>` | :doc:`Часть 4 <intro/tutorial04>` | :doc:`Часть 5 <intro/tutorial05>` | :doc:`Часть 6 <intro/tutorial06>`

source: **Advanced Tutorials:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
ru: **Расширенное руководство:** :doc:`Как написать переносимое приложение <intro/reusable-apps>` | :doc:`Создайте первый патч для Django <intro/contributing>`

source: The model layer
ru: Уровень модели

source: Django provides an abstraction layer (the "models") for structuring and manipulating the data of your Web application. Learn more about it below:
ru: Django предоставляет абстрактный уровень( "модель") для структурирования и управления данными вашего Web-приложения. Узнайте об этом более подробно:

source: **Models:** :doc:`Model syntax <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Meta options <ref/models/options>`
ru: **Модель:** :doc:`Синтаксис описания модели <topics/db/models>` | :doc:`Типы полей <ref/models/fields>` | :doc:`Метаданные <ref/models/options>`

source: **QuerySets:** :doc:`Executing queries <topics/db/queries>` | :doc:`QuerySet method reference <ref/models/querysets>`
ru: **Объект QuerySet:** :doc:`Выполнение запросов <topics/db/queries>` | :doc:`Справочник методов QuerySet <ref/models/querysets>`

source: **Model instances:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
ru: **Реализация модели:** :doc:`Реализация методов <ref/models/instances>` | :doc:`Доступ к связанным объектам <ref/models/relations>`

source: **Advanced:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>`
ru: **Расширенные возможности:** :doc:`Менеджеры <topics/db/managers>` | :doc:`Чистый SQL <topics/db/sql>` | :doc:`Транзакции <topics/db/transactions>` | :doc:`Агрегирование <topics/db/aggregation>` | :doc:`Настраиваемые поля <howto/custom-model-fields>` | :doc:`Работа с несколькими базами данных <topics/db/multi-db>`

source: **Other:** :doc:`Supported databases <ref/databases>` | :doc:`Legacy databases <howto/legacy-databases>` | :doc:`Providing initial data <howto/initial-data>` | :doc:`Optimize database access <topics/db/optimization>`
ru: **Прочее:** :doc:`Поддерживаемые СУБД <ref/databases>` | :doc:`Устаревшие СУБД <howto/legacy-databases>` | :doc:`Ввод первичных данных <howto/initial-data>` | :doc:`Оптимизация доступа к базам данных <topics/db/optimization>`

source: The view layer
ru: Уровень представления

source: Django has the concept of "views" to encapsulate the logic responsible for processing a user's request and for returning the response. Find all you need to know about views via the links below:
ru: Django придерживается концепции "представлений(views)" для объединений логики ответственной за обработку пользовательских запросов и возврата ответов сервера. Всю необходимую вы можете получить по следующим ссылкам:

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
ru: **Основы:** :doc:`Настройка URL <topics/http/urls>` | :doc:`Функции представления <topics/http/views>` | :doc:`Псевдонимы <topics/http/shortcuts>` | :doc:`Декораторы <topics/http/decorators>`

source: **Reference:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
ru: **Справочная информация:** :doc:`Встроенные представления <ref/views>` | :doc:`Объектная модель Запрос/Ответ objects <ref/request-response>` | :doc:`Объекты TemplateResponse <ref/template-response>`

source: **File uploads:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
ru: **Загрузка файлов:** :doc:`Обзор <topics/http/file-uploads>` | :doc:`Файловые объекты <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Управление файлами <topics/files>` | :doc:`Настраиваемые хранилища <howto/custom-file-storage>`

source: **Class-based views:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
ru: **Предствления основанные на классах:** :doc:`Обзор <topics/class-based-views/index>` | :doc:`Отображение встроенных представлений <topics/class-based-views/generic-display>` | :doc:`Редактирование встроенных представлений <topics/class-based-views/generic-editing>` | :doc:`Использование подмешанных классов <topics/class-based-views/mixins>` | :doc:`Справочник API <ref/class-based-views/index>` | :doc:`Упрощенный список методов <ref/class-based-views/flattened-index>`

source: **Advanced:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
ru: **Расширенные возможности:** :doc:`Создание CSV файла <howto/outputting-csv>` | :doc:`Создание PDF файла <howto/outputting-pdf>`

source: **Middleware:** :doc:`Overview <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
ru: **Промежуточный слой:** :doc:`Обзор <topics/http/middleware>` | :doc:`Встроенные промежуточные классы <ref/middleware>`

source: The template layer
ru: Уровень шаблона

source: The template layer provides a designer-friendly syntax for rendering the information to be presented to the user. Learn how this syntax can be used by designers and how it can be extended by programmers:
ru: Уровень шаблонов предоставляет синтаксис, ориентированный на дизайнеров, для рендеринга информации и последующего представления ее пользователю. Здесь вы можете более подробно узнать как данный синтаксис может быть использован дизайнерами и о том как программист может расширить данный синтаксис:

source: **For designers:** :doc:`Syntax overview <topics/templates>` | :doc:`Built-in tags and filters <ref/templates/builtins>` | :doc:`Web design helpers <ref/contrib/webdesign>` | :doc:`Humanization <ref/contrib/humanize>`
ru: **Для дизайнера:** :doc:`Обзор синтаксиса <topics/templates>` | :doc:`Встроенные теги и фильтры <ref/templates/builtins>` | :doc:`Вспомогательные средства для Web дизайна <ref/contrib/webdesign>` | :doc:`Интерфейс ориентированный на пользователя <ref/contrib/humanize>`

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
ru: **Для прграммиста:** :doc:`Template API <ref/templates/api>` | :doc:`Настраиваемые теги и фильтры <howto/custom-template-tags>`

source: Forms
ru: Формы

source: Django provides a rich framework to facilitate the creation of forms and the manipulation of form data.
ru: Django предоставляет мощный фреймворк для упрощенного создания форм и обработки введенных в них данных.

source: **The basics:** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
ru: **Основы:** :doc:`Обзор <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Встроенные поля <ref/forms/fields>` | :doc:`Встроенные виджеты <ref/forms/widgets>`

source: **Advanced:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
ru: **Расширенные возможности:** :doc:`Использование форм в моделях <topics/forms/modelforms>` | :doc:`Работа с различными устройствами <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Настраиваемая проверка <ref/forms/validation>`

source: **Extras:** :doc:`Form preview <ref/contrib/formtools/form-preview>` | :doc:`Form wizard <ref/contrib/formtools/form-wizard>`
ru: **Дополнительно:** :doc:`Предварительный просмотр данных введенных в форму <ref/contrib/formtools/form-preview>` | :doc:`Мастер-фомы <ref/contrib/formtools/form-wizard>`

source: The development process
ru: Процесс разработки

source: Learn about the various components and tools to help you in the development and testing of Django applications:
ru: Описание различных инструментов и компонентов для упрощения разработки и тестирования приложений для Django:

source: **Settings:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
ru: **Работа с настройками:** :doc:`Обзор <topics/settings>` | :doc:`Полный список настроек <ref/settings>`

source: **Exceptions:** :doc:`Overview <ref/exceptions>`
ru: **Исключения:** :doc:`Обзор <ref/exceptions>`

source: **django-admin.py and manage.py:** :doc:`Overview <ref/django-admin>` | :doc:`Adding custom commands <howto/custom-management-commands>`
ru: **django-admin.py и manage.py:** :doc:`Обзор <ref/django-admin>` | :doc:`Добавление пользовательских комманд <howto/custom-management-commands>`

source: **Testing:** :doc:`Introduction <topics/testing/index>` | :doc:`Writing and running tests <topics/testing/overview>` | :doc:`Advanced topics <topics/testing/advanced>` | :doc:`Doctests <topics/testing/doctests>`
ru: **Тестирование:** :doc:`Введение <topics/testing/index>` | :doc:`Разработка и запуск тестов <topics/testing/overview>` | :doc:`Расширенное руководство <topics/testing/advanced>` | :doc:`Doctests <topics/testing/doctests>`

source: **Deployment:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`FastCGI/SCGI/AJP <howto/deployment/fastcgi>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>`
ru: **Развертывание:** :doc:`Обзор <howto/deployment/index>` | :doc:`Серверы WSGI <howto/deployment/wsgi/index>` | :doc:`FastCGI/SCGI/AJP <howto/deployment/fastcgi>` | :doc:`Развертывание статических файлов <howto/static-files/deployment>` | :doc:`Отслеживание кодов ошибок по email <howto/error-reporting>`

source: The admin
ru: Административные функции

source: Find all you need to know about the automated admin interface, one of Django's most popular features:
ru: Подробные данные об автоматическом интерфейсе администратора, одной из самых популярных функций Django:

source: :doc:`Admin site <ref/contrib/admin/index>`
ru: :doc:`Интерфейс администратора <ref/contrib/admin/index>`

source: :doc:`Admin actions <ref/contrib/admin/actions>`
ru: :doc:`Функции администратора <ref/contrib/admin/actions>`

source: :doc:`Admin documentation generator<ref/contrib/admin/admindocs>`
ru: :doc:`Система генерации документации администратора <ref/contrib/admin/admindocs>`

source: Security
ru: Безопасность

source: Security is a topic of paramount importance in the development of Web applications and Django provides multiple protection tools and mechanisms:
ru: Безопасность является наиважнейшей темой при разработке Web-приложений, и Django предоставляет для этого множество инструментов и механизмов:

source: :doc:`Security overview <topics/security>`
ru: :doc:`Обзор безопасности <topics/security>`

source: :doc:`Disclosed security issues in Django <releases/security>`
ru: Проблемы безопасности обнаруженные в Django

source: :doc:`Clickjacking protection <ref/clickjacking>`
ru: :doc:`Защита от накруток <ref/clickjacking>`

source: :doc:`Cross Site Request Forgery protection <ref/contrib/csrf>`
ru: :doc:`Защита от подделки межсайтовых запросов(CSRF) <ref/contrib/csrf>`

source: :doc:`Cryptographic signing <topics/signing>`
ru: :doc:`Криптографическая подпись <topics/signing>`

source: Internationalization and localization
ru: Интернационализация и локализация

source: Django offers a robust internationalization and localization framework to assist you in the development of applications for multiple languages and world regions:
ru: Django предлагает вам мощный фреймворк для интернационализации и локализации, который способствует в разработке многоязычных приложений для всех уголков мира:

source: :doc:`Overview <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>`
ru: :doc:`Обзор <topics/i18n/index>` | :doc:`Интернационализация <topics/i18n/translation>` | :ref:`Локализация <how-to-create-language-files>`

source: :doc:`"Local flavor" <ref/contrib/localflavor>`
ru: :doc:`"Локальные разновидности" <ref/contrib/localflavor>`

source: :doc:`Time zones </topics/i18n/timezones>`
ru: :doc:`Временные зоны </topics/i18n/timezones>`

source: Python compatibility
ru: Совместимость с версиями Python

source: Django aims to be compatible with multiple different flavors and versions of Python:
ru: Django стремится быть совместимым с множеством различных версий и реализаций языка Python:

source: :doc:`Jython support <howto/jython>`
ru: :doc:`Поддержка Jython <howto/jython>`

source: :doc:`Python 3 compatibility <topics/python3>`
ru: :doc:`Совместимость с Python 3 <topics/python3>`

source: Geographic framework
ru: Фреймворк Geographic

source: :doc:`GeoDjango <ref/contrib/gis/index>` intends to be a world-class geographic Web framework. Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.
ru: :doc:`GeoDjango <ref/contrib/gis/index>` является географическим Web-фреймворком мирового каласса. Его цель упростить, насколько это возможно, построение GIS Web-приложений при этом используя всю мощь данных о местоположении.

source: Common Web application tools
ru: Общие инструменты для Web-приложений

source: Django offers multiple tools commonly needed in the development of Web applications:
ru: Django предлагает множество инструментов, обычно необходимых при разработке Web-приложений.

source: :doc:`Authentication <topics/auth/index>`
ru: :doc:`Аутентификация <topics/auth/index>`

source: :doc:`Caching <topics/cache>`
ru: :doc:`Кэширование <topics/cache>`

source: :doc:`Logging <topics/logging>`
ru: :doc:`Журналирование <topics/logging>`

source: :doc:`Sending emails <topics/email>`
ru: :doc:`Отправка сообщений по e-mail <topics/email>`

source: :doc:`Syndication feeds (RSS/Atom) <ref/contrib/syndication>`
ru: :doc:`Новостные ленты (RSS/Atom) <ref/contrib/syndication>`

source: :doc:`Comments <ref/contrib/comments/index>`, :doc:`comment moderation <ref/contrib/comments/moderation>` and :doc:`custom comments <ref/contrib/comments/custom>`
ru: :doc:`Комментарии <ref/contrib/comments/index>`, :doc:`модерация комментариев <ref/contrib/comments/moderation>` и :doc:`пользовательские комментарии <ref/contrib/comments/custom>`

source: :doc:`Pagination <topics/pagination>`
ru: :doc:`Постраничная разбивка <topics/pagination>`

source: :doc:`Messages framework <ref/contrib/messages>`
ru: :doc:`Фреймворк для отправки сообщений <ref/contrib/messages>`

source: :doc:`Serialization <topics/serialization>`
ru: :doc:`Сериализация <topics/serialization>`

source: :doc:`Sessions <topics/http/sessions>`
ru: :doc:`Механизм сессий <topics/http/sessions>`

source: :doc:`Sitemaps <ref/contrib/sitemaps>`
ru: :doc:`Создание карты сайта <ref/contrib/sitemaps>`

source: :doc:`Static files management <ref/contrib/staticfiles>`
ru: :doc:`Управление статическими файлами <ref/contrib/staticfiles>`

source: :doc:`Data validation <ref/validators>`
ru: :doc:`Проверка данных <ref/validators>`

source: Other core functionalities
ru: Дополнительная базовая функциональность

source: Learn about some other core functionalities of the Django framework:
ru: Здесь описана дополнительная базовая функциональность предоставляемая ядром фреймворка Django

source: :doc:`Conditional content processing <topics/conditional-view-processing>`
ru: :doc:`Условная обработка содержимого <topics/conditional-view-processing>`

source: :doc:`Content types and generic relations <ref/contrib/contenttypes>`
ru: :doc:`Типы контента и общие взаимосвязи <ref/contrib/contenttypes>`

source: :doc:`Databrowse <ref/contrib/databrowse>` (deprecated)
ru: :doc:`Просмотр данных <ref/contrib/databrowse>` (устаревший)

source: :doc:`Flatpages <ref/contrib/flatpages>`
ru: :doc:`Статические страницы <ref/contrib/flatpages>`

source: :doc:`Redirects <ref/contrib/redirects>`
ru: :doc:`Пренаправления <ref/contrib/redirects>`

source: :doc:`Signals <topics/signals>`
ru: :doc:`Сигналы <topics/signals>`

source: :doc:`The sites framework <ref/contrib/sites>`
ru: :doc:`Мультисайтинг <ref/contrib/sites>`

source: :doc:`Unicode in Django <ref/unicode>`
ru: :doc:`Unicode в Django <ref/unicode>`

source: The Django open-source project
ru: Django - проект с открытым исходным кодом

source: Learn about the development process for the Django project itself and about how you can contribute:
ru: Информация о процессе разработки проекта Django и о том каким образом вы можете принять в нем участие:

source: **Community:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team of committers <internals/committers>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>`
ru: **Сообщество:** :doc:`Как принять участие? <internals/contributing/index>` | :doc:`Процесс выпуска <internals/release-process>` | :doc:`Комманда разработчиков <internals/committers>` | :doc:`Репозитарий исходного кода Django <internals/git>` | :doc:`Политики безопасности <internals/security>`

source: **Design philosophies:** :doc:`Overview <misc/design-philosophies>`
ru: **Принципы проектирования:** :doc:`Обзор <misc/design-philosophies>`

source: **Documentation:** :doc:`About this documentation <internals/contributing/writing-documentation>`
ru: **Документация:** :doc:`Описание данной документации <internals/contributing/writing-documentation>`

source: **Third-party distributions:** :doc:`Overview <misc/distributions>`
ru: **Пакеты распространяемые сторонними разрабочиками:** :doc:`Обзор <misc/distributions>`

source: **Django over time:** :doc:`API stability <misc/api-stability>` | :doc:`Release notes and upgrading instructions <releases/index>` | :doc:`Deprecation Timeline <internals/deprecation>`
ru: **Хронология развития Django:** :doc:`Стабильное API <misc/api-stability>` | :doc:`Описание релизов и upgrading instructions <releases/index>` | :doc:`Хронология устаревших функций <internals/deprecation>`
