Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: Django grew from a very practical need: World Online, a newspaper web operation, is responsible for building intensive web applications on journalism deadlines. In the fast-paced newsroom, World Online often has only a matter of hours to take a complicated web application from concept to public launch.
pl: Django wyrosło z bardzo praktycznej potrzeby: World Online, projekt gazety internetowej, jest odpowiedzialne za budowanie rozległych aplikacji WWW na dziennikarskich deadline'ach. W dynamicznym newsroomie, World Online ma często tylko kilka godzin, aby skomplikowaną aplikację webową przeprowadzić od pomysłu do publicznego uruchomienia.

source: At the same time, the World Online web developers have consistently been perfectionists when it comes to following best practices of web development.
pl: Jednocześnie deweloperzy World Online Web stale są perfekcjonistami, jeśli chodzi o realizowanie najlepszych praktyk web dewelopmentu.

source: In fall 2003, the World Online developers (Adrian Holovaty and Simon Willison) ditched PHP and began using Python to develop its websites. As they built intensive, richly interactive sites such as Lawrence.com, they began to extract a generic web development framework that let them build web applications more and more quickly. They tweaked this framework constantly, adding improvements over two years.
pl: Jesienią 2003 deweloperzy World Online (Adrian Holovaty i Simon Willison) porzucili PHP i zaczęli używać Pythona do rozwijania swoich stron. Tworząc rozległe, bardzo interaktywne witryny, takie jak Lawrence.com, zaczęli ekstrahować ogólny web-deweloperski framework, który pozwalał im budować aplikacje WWW coraz to szybciej. Usprawniali stale ten framework, przez dwa lata dodając poprawki.

source: In summer 2005, World Online decided to open-source the resulting software, Django. Django would not be possible without a whole host of open-source projects -- `Apache`_, `Python`_, and `PostgreSQL`_ to name a few -- and we're thrilled to be able to give something back to the open-source community.
el: Το καλοκαίρι του 2005, η World Online αποφάσισε να μετατρέψει αυτό το λογισμικό σε ανοιχτού κώδικα, το Django. Το Django δεν θα ήταν δυνατόν να δημιουργηθεί χωρίς την πληθώρα ανοικτού λογισμικού projects -- όπως `Apache`_, `Python`_, και `PostgreSQL`_ -- και είμαστε ενθουσιασμένοι που μπορέσαμε να δώσουμε κάτι πίσω στην κοινότητα.
id: Di musim panas 2005, World Online memutuskan sumber-terbuka perangkat lunak yang dihasilkan, Django. Django mungkin tidak memungkinkan tanpa seluruh rumah dari proyek sumber-terbuka -- `Apache`_, `Python`_, dan `PostgreSQL`_ dan kami senang dapat memberikan sesuatu kembali ke komunitas sumber-terbuka.
it: Nell'estate 2005, World Online decise di rendere open-source il software risultante: Django. Django non sarebbe stato possibile senza un intero gruppo di progetti open-sorce -- `Apache`_, `Python`_, e `PostgreSQL`_ per nominarne alcuni -- e siamo orgogliosi di essere in grado a nostra volta di restituire qualcosa alla comunità open-source.
pl: Latem 2005 World Online postanowiło z-open-source'ować wynikowe oprogramowanie, Django. Django nie byłoby możliwe bez mnóstwa projektów open-source'owych – `Apache`_\a, `Python`_\a i `PostgreSQL`_\-a, wymieniając tylko kilka – i jesteśmy zachwyceni mogąc oddać coś społeczności open-source.

source: What does "Django" mean, and how do you pronounce it?
el: Τι σημαίνει "Django" και πως προφέρεται;
id: Apakah arti "Django", dan bagaimana anda mengucapkannya?
it: Cosa significa "Django" e come si pronuncia?
pl: Co znaczy „Django” i jak wymawiać tę nazwę?

source: Django is named after `Django Reinhardt`_, a jazz manouche guitarist from the 1930s to early 1950s. To this day, he's considered one of the best guitarists of all time.
el: Το Django ονομάστηκε έτσι από τον `Django Reinhardt`_, έναν κιθαρίστα της jazz manouche σκηνής από τη δεκαετία του 1930 μέχρι τις αρχές της δεκαετίας του 1950. Μέχρι σήμερα θεωρείται ένας από τους μεγαλύτερους κιθαρίστες όλων των εποχών.
id: Django dinamai setelah `Django Reinhardt`_, gitaris jazz manouche dari 1930 sampai awal 1950. Sampai hari ini, dia dianggap satu dari gitaris terbaik sepanjang masa.
it: Django deriva il suo nome da `Django Reinhardt`_, un chitarrista jazz tzigano che si è esibito dagli anni '30 agli anni '50. Attualmente è considerato uno dei migliori chitarristi di tutti i tempi.
pl: Django zostało nazwane imieniem `Django Reinhardta`_, gitarzysty gypsy jazz z lat 30. do wczesnych 50. XX wieku. Do dnia dzisiejszego jest on uważany za jednego z najlepszych gitarzystów jazzowych wszechczasów.

source: Listen to his music. You'll like it.
el: Ακούστε τη μουσική του. Θα σας αρέσει.
id: Dengarkan musik dia. Anda akan menyukainya.
it: Ascolta la sua musica, ti piacerà.
pl: Posłuchaj jego muzyki. Spodoba ci się.

source: Django is pronounced **JANG**-oh. Rhymes with FANG-oh. The "D" is silent.
el: Το Django προφέρεται ως **JANG**-oh. Κάνει ρίμα με το FANG-oh. Το "D" δεν προφέρεται.
id: Django diucapkan **JANG**-oh. Irama dengan FANG-oh. "D" adalah senyap.
it: Django si pronuncia **JANG**-oh. Fa rima con FANG-oh. La "D" è silenziata.
pl: Django wymawia się jako **dżan**-go. Rymuje się z tan-go. Akcentujemy pierwszą sylabę.

source: We've also recorded an `audio clip of the pronunciation`_.
el: Έχουμε, επίσης, ηχογραφήσει `την προφορά του <http://red-bean.com/~adrian/django_pronunciation.mp3>`_.
id: Kami juga merekam sebuah `klip suara dari pengucapan`_.
it: Abbiamo anche registrato una `clip audio della pronuncia`_.
pl: Nagraliśmy też `klip audio z wymową`_.

source: Is Django stable?
el: Είναι το Django σταθερό;
id: Apakah Django stabil?
it: Django è stabile?
pl: Czy Django jest stabilne?

source: Yes, it's quite stable. Companies like Disqus, Instagram, Pinterest, and Mozilla have been using Django for many years. Sites built on Django have weathered traffic spikes of over 50 thousand hits per second.
el: Ναι, είναι αρκετά σταθερό. Εταιρίες όπως Disqus, Instagram, Pinterest, και Mozilla χρησιμοποιούν το Django για πολλά χρόνια. Οι ιστοσελίδες που χτίστηκαν βάση του Django έχουν επισκεψιμότητα σε ώρα αιχμής πάνω από 50 χιλιάδες requests το δευτερόλεπτο.
id: Ya, dia cukup stabil. Perusahaan seperti Disqus, Instagram, Pinterest, dan Mozilla telah menggunakan Django selama bertahun-tahun. Situs yang dibangun di Django telah mengalami lonjakan lalu lintas lebih 50 ribu pukulan per detik.
it: Sì, è abbastanza stabile. Alcune aziende come Disqus, Instagram, Pinterest e Mozilla hanno usato Django per diversi anni. Alcuni siti fatti con Django hanno sopportato picchi di traffico di oltre 50 mila richieste al secondo.
pl: Tak, jest całkiem stabilne. Firmy takie jak Disqus, Instagram, Pinterest i Mozilla używają Django od wielu lat. Strony budowane na Django przetrwały skoki odwiedzin rzędu ponad 50 tysięcy odsłon na sekundę.

source: Does Django scale?
el: Κλιμακώνεται το Django;
id: Apakah Django luas?
it: Django è adatto per scalare?
pl: Czy Django jest skalowalne?

source: Yes. Compared to development time, hardware is cheap, and so Django is designed to take advantage of as much hardware as you can throw at it.
el: Φυσικά. Εν συγκρίσει με το χρόνο ανάπτυξης, το hardware είναι φθηνό και επομένως το Django είναι σχεδιασμένο να εκμεταλλεύεται όσο hardware του προσθέσετε.
id: Ya. Dibandingkan pada wakt pengembangan, perangkat keras adalah murah, dan Django dirancang untuk mengambil keuntungan sebanyak perangkat lunak anda dapat adakan.
it: Sì. Comparato al tempo di sviluppo, l'hardware è economico, quindi Django è progettato per utilizzare il più possibile quanto più hardware gli puoi dare.
pl: Tak. W porównaniu z czasem developmentu, sprzęt jest tani. Właśnie dlatego Django jest zaprojektowane tak, aby wykorzystać jego potencjał tak bardzo, jak to możliwe.

source: Django uses a "shared-nothing" architecture, which means you can add hardware at any level -- database servers, caching servers or web/application servers.
pl: Django używa architektury „shared-nothing”, co oznacza, że możesz dodać zasoby sprzętowe na każdym poziomie – serwery baz danych, serwery cache'owania, czy serwery Web/aplikacji.

source: The framework cleanly separates components such as its database layer and application layer. And it ships with a simple-yet-powerful :doc:`cache framework </topics/cache>`.
el: Το framework ξεχωρίζει πολύ καθαρά τα components μεταξύ τους όπως το επίπεδο του database και του application. Επίσης, δίνεται με ένα πολύ απλό αλλά και ισχυρό παράλληλα :doc:`cache framework </topics/cache>`.
id: Kerangka secara bersih memisahkan komponen seperti lapisan basisdatanya dan lapisan aplikasi. Dan dia dibungkus dengan sederhana namun kuat :doc:`kerangka tembolok </topics/cache>`.
it: L'ambiente separa chiaramente le componenti come l'interfaccia al database e quella applicativa. E fornisce un semplice, ma potente :doc:`cache framework </topics/cache>`.
pl: Framework czysto oddziela komponenty takie jak warstwa bazy danych i warstwa aplikacji. I dostarcza je w prostym-ale-potężnym :doc:`frameworku cache'owania </topics/cache>`.

source: Who's behind this?
el: Ποιος είναι πίσω απ' αυτό;
id: Siapa dibelakang ini?
it: Chi c'è dietro a tutto questo?
pl: Kto za tym stoi?

source: Django was originally developed at World Online, the web department of a newspaper in Lawrence, Kansas, USA. Django's now run by an international `team of volunteers <https://www.djangoproject.com/foundation/teams/>`_.
pl: Django został pierwotnie napisany w World Online, internetowym wydziale gazety w Lawrence w Kansas, w Stanach Zjednoczonych. Teraz Django jest tworzone przez międzynarodowy `zespół wolontariuszy <https://www.djangoproject.com/foundation/teams/>`_.

source: How is Django licensed?
it: Com'è concesso in licenza Django ?
pl: Jak licencjonowane jest Django?

source: Django is distributed under :source:`the 3-clause BSD license <LICENSE>`. This is an open source license granting broad permissions to modify and redistribute Django.
it: Django è distribuito con :source:`the 3-clause BSD license <LICENSE>`. Questa è una licenza open source che garantisce ampi permessi di modifica e ridistribuzione di Django
pl: Django udostępniony jest na :source:`3-klauzulowej licencji BSD`. Jest to licencja tzw. open source, która przydziela szeroki wachlarz uprawnień do modyfikacji i redystrybuowania Django.

source: Why does Django include Python's license file?
it: Perchè Django include il file di licenza di Python ?
pl: Dlaczego Django zawiera pliki licencyjne samego Pythona?

source: Django includes code from the Python standard library. Python is distributed under a permissive open source license. :source:`A copy of the Python license <LICENSE.python>` is included with Django for compliance with Python's terms.
it: Django utilizza codice della libreria standard di Python. Python viene distribuito con una licenza open source permissiva. Una copia della licenza di Python viene inclusa in Django nel rispetto dei termini e condizioni di Python.
pl: Django zawiera kod pochodzący z biblioteki standardowej Pythona. Python z kolei dystrybuowany jest na zasadach własnej licencji open source. :source:`Kopia licencji Pythona <LICENSE.python>` zawarta jest w Django dla zgodności z zasadami Pythona.

source: Which sites use Django?
el: Ποιες ιστοσελίδες χρησιμοποιούν το Django;
id: Situs mana menggunakan Django?
it: Quali siti usano Django?
pl: Jakie strony używają Django?

source: `DjangoSites.org`_ features a constantly growing list of Django-powered sites.
el: Η ιστοσελίδα `DjangoSites.org`_ προβάλλει μια ολοένα αυξανόμενη λίστα με ιστοσελίδες που χρησιμοποιούν το Django ως backend.
id: `DjangoSites.org`_ menampilkan selalu tumbuh daftar dari situs ditenagai-Django.
it: `DjangoSites.org`_ contiene una lista crescente di siti che usano Django.
pl: `DjangoSites.org`_ posiada stale rosnącą listę stron działających dzięki Django.

source: Django appears to be a MVC framework, but you call the Controller the "view", and the View the "template". How come you don't use the standard names?
el: Το Django φαίνεται να είναι ένα MVC framework, αλλά εσείς καλείτε τον Controller ως "view" και το View ως "template". Γιατί δεν χρησιμοποιείτε τα συνήθη ονόματα;
id: Django muncul menjadi kerangka MVC, tetapi anda memanggil Controller "view", dan View "template". Bagaimana bisa anda tidak menggunakan nama standar?
it: Django sembra essere un framework di tipo MVC ma chiamate le view Controller, mentre la View corrisponde ai "template". Come mai non usate i nomi standard?
pl: Django wygląda, jakby było frameworkiem MVC, ale Kontroler nazywacie „widokiem” a Widok „szablonem”. Dlaczego nie używacie standardowych nazw?

source: Well, the standard names are debatable.
el: Ξέρετε, τα συνήθη ονόματα είναι διαπραγματεύσιμα.
id: Baiklah, nama standar masih diperdebatkan.
it: Bè, i nomi standard sono opinabili.
pl: Cóż, standardowe nazwy są sporne.

source: In our interpretation of MVC, the "view" describes the data that gets presented to the user. It's not necessarily *how* the data *looks*, but *which* data is presented. The view describes *which data you see*, not *how you see it.* It's a subtle distinction.
el: Στη δική μας ερμηνεία του MVC, το "view" περιγράφει τα δεδομένα τα οποία προβάλλονται στον χρήστη. Δεν είναι απαραίτητα το *πως δείχνουν* τα δεδομένα αλλά *ποια* δεδομένα προβάλλονται. Το view περιγράφει *ποια data βλέπετε*, όχι *το πως τα βλέπετε.* Αποτελεί μια λεπτή διάκριση.
id: Dalam tafsiran kami dari MVC, "view" menggambarkan data yang mendapatkan dihadirkan ke pengguna. Itu tidak perlu *bagaimana* data *kelihatan*, tetapi *yang mana* data dihadirkan. View menggambarkan *data mana anda lihat*, bukan *bagaimana anda melihatnya.* Ini adalah perbedaan yang halus.
it: Nella nostra interpretazione di MVC, la "view" descrive il dato che viene presentato all'utente. Non necessariamente *come appare* il dato, ma *quale* dato viene presentato. La view descrive *che dato vedi*, non *come lo vedi*. E' una distinzione sottile.
pl: W naszej interpretacji MVC „widok” opisuje dane, które zostaną zaprezentowane użytkownikowi. Nie jest istotne *jak* dane *wyglądają*, ale *kiedy* są one prezentowane. Widok opisuje *jakie dane widzisz*, nie *jak je zobaczyć.* To subtelna różnica.

source: So, in our case, a "view" is the Python callback function for a particular URL, because that callback function describes which data is presented.
el: Επομένως, στη δικιά μας περίπτωση, ένα "view" είναι μια Python callback συνάρτηση για ένα συγκεκριμένο URL, επειδή αυτή η callback συνάρτηση περιγράφει ποια data θα προβληθούν.
id: Jadi, di kasus kami, sebuah "view" adalah fungsi panggilan kembali Python untuk URL khusus, karena fungsi panggilan kembali menggambarkan data mana yang dihadirkan.
it: Così, nel nostro caso, una "view" è la funzione Python richiamata per una particolare URL, perché quella funzione di servizio descrive quali dati vengono presentati.
pl: Zatem w naszym przypadku „widok” to pythonowa funkcja callbackowa dla poszczególnego URL-a, gdyż ta właśnie funkcja definiuje, jakie dane są prezentowane.

source: Furthermore, it's sensible to separate content from presentation -- which is where templates come in. In Django, a "view" describes which data is presented, but a view normally delegates to a template, which describes *how* the data is presented.
el: Επιπροσθέτως, είναι λογικό να διαχωρίζουμε το περιεχόμενο από την παρουσίαση – όπου κάπου εδώ έρχεται η έννοια των templates. Στο Django, το "view" περιγράφει ποια data θα προβληθούν, αλλά ένα view συνήθως αναθέτει σε ένα template την προβολή των δεδομένων – το *πως*, δηλαδή, θα προβληθούν τα data.
id: Lebih jauh, ini adalah bijaksana untuk memisahkan dari penyajian -- yaitu dimana cetakan masuk. Di Django, sebuah 'view" menggambarkan data mana dihadirkan, tetapi view umumnya menugaskan ke sebuah cetakan, yang menggambarkan *bagaimana* data dihadirkan.
it: Inoltre, è ragionevole separare i contenuti dalla presentazione -- che è l'ambito in cui intervengono i template. In Django, una "view" descrive quale dato viene presentato, ma una view normalmente delega ad un template, che descrive *come* il dato è presentato.
pl: Ponadto, rozsądne jest odseparowanie zawartości od prezentacji – co realizowane jest przez szablony. W django „widok” opisuje, jakie dane są prezentowane, ale widok standardowo odwołuje się do szablonu, który opisuje *jak* dane są prezentowane.

source: Where does the "controller" fit in, then? In Django's case, it's probably the framework itself: the machinery that sends a request to the appropriate view, according to the Django URL configuration.
el: Σύμφωνα με τα παραπάνω, που κολλάει ο "controller"; Στην περίπτωση του Django, είναι μάλλον το ίδιο το framework: ο μηχανισμός που στέλνει το request στο κατάλληλο view, σύμφωνα με τη διαμόρφωση των Django URLs.
id: Dimana "controller" cocok, lalu? Dalam kasus Django, itu mungkin kerangka kerja itu sendiri; mesin-mesin yang mengirim sebuah permintaan ke tampilan yang sesuai, menurut konfigurasi URL Django.
it: Quindi, il "controller" come si identifica? Nel caso di Django, probabilmente è l'ambiente stesso: il meccanismo che invia una richiesta alla view appropiata, in accordo alla configurazione delle URL di Django.
pl: Gdzie w takim razie pasuje „kontroler”? W przypadku Django to najprawdopodobniej sam framework: machineria, która wysyła zapytanie do odpowiedniego widoku, na podstawie konfiguracji URL Django.

source: If you're hungry for acronyms, you might say that Django is a "MTV" framework -- that is, "model", "template", and "view." That breakdown makes much more sense.
el: Αν διψάτε για ακρωνύμια, θα λέγατε μάλλον ότι το Django είναι ένα "MTV" framework -- δηλαδή, "model", "template", και "view." Αυτή η ανάλυση είναι πιο κατανοητή.
id: Jika anda sedang lapar untuk singkatan, anda mungkin berkata bahwa Django adalah kerangka kerja "MTV" -- yaitu "model", "template", dan "view." Perincian tersebut jauh lebih masuk akal.
it: Se sei affamato di acronimi, puoi dire che Django è un ambiente "MTV" -- cioè: "model", "template", e "view". Questa ripartizione ha molto più senso.
pl: Jeśli jesteś żądny akronimów, możesz mówić, że Django to framework „MTV” – to znaczy „model”, „szablon” („template”) i „widok” („view”). Taki podział nadaje o wiele więcej sensu.

source: At the end of the day, it comes down to getting stuff done. And, regardless of how things are named, Django gets stuff done in a way that's most logical to us.
it: Alla fine della fiera, si tratta di fare delle cose. E, a prescindere da quali siano queste cose, Django le fa nel modo più logico per noi.
pl: W końcu chodzi o wykonywanie swojej roboty. I, niezależnie jak to nazwiemy, Django wykonuje robotę w sposób, który jest dla nas najlogiczniejszy.

source: <Framework X> does <feature Y> -- why doesn't Django?
el: Το <Framework X> κάνει το <feature Y> -- γιατί όχι το Django?
id: <Kerangka X> melakukan <fitur Y> -- kenapa Django tidak?
it: Il <Framework X> ha la <caratteristica Y> -- perché Django non ce l'ha?
pl: <Framework X> posiada <funkcję Y> – dlaczego Django nie?

source: We're well aware that there are other awesome web frameworks out there, and we're not averse to borrowing ideas where appropriate. However, Django was developed precisely because we were unhappy with the status quo, so please be aware that "because <Framework X> does it" is not going to be sufficient reason to add a given feature to Django.
pl: Wszyscy jesteśmy świadomi, że są dooko‭‭ła inne niesamowite frameworki webowe i nie mamy awersji do pożyczania pomys‭łów tam, gdzie jest to w‭łaściwe. Jednakże Django powsta‭ło w‭‭łaśnie z powodu naszego niezadowolenia ze status quo, więc, prosimy, miej świadomość, że „dlatego, że <Framework X>to robi” nie jest wystarczającym powodem, aby dodać do Django daną funkcję.

source: Why did you write all of Django from scratch, instead of using other Python libraries?
el: Γιατί γράψατε το Django από την αρχή, αντί να χρησιμοποιήσετε ήδη υπάρχουσες Python βιβλιοθήκες;
id: Kenapa anda menulis semua Django dari goresan, daripada menggunakan pustaka lain Django?
it: Perchè avete scritto Django da zero invece di utilizzare altre biblioteche per Python?
pl: Dlaczego napisaliście całość Django od podstaw zamiast użyć innych bibliotek Pythona?

source: When Django was originally written, Adrian and Simon spent quite a bit of time exploring the various Python web frameworks available.
pl: Gdy Django było pisane, Adrian i Simon spędzili trochę czasu przeszukując różne dostępne frameworki webowe.

source: In our opinion, none of them were completely up to snuff.
el: Κατά τη γνώμη μας, κανένα από αυτά δεν μας κάλυπτε.
id: Menurut pendapat kami, tidak satupun dari mereka benar-benar sampai tidak berguna
it: Secondo noi nessuna di esse era idonea.
pl: Naszym zdaniem żaden z nich nie był wystarczająco dobrej jakości.

source: We're picky. You might even call us perfectionists. (With deadlines.)
el: Είμαστε επιλεκτικοί. Μπορείτε, επίσης, να μας προσφωνείτε τελειομανείς. (με προθεσμίες.)
id: Kami pilih-pilih. Anda mungkin bahkan memanggil kami perfeksionis. (Dengan tenggat waktu.)
it: Siamo esigenti. Puoi anche chiamarci perfezionisti (con le scadenze).
pl: Jesteśmy ostrożni. Możesz nawet nazwać nas perfekcjonistami. (Z deadline'ami.)

source: Over time, we stumbled across open-source libraries that did things we'd already implemented. It was reassuring to see other people solving similar problems in similar ways, but it was too late to integrate outside code: We'd already written, tested and implemented our own framework bits in several production settings -- and our own code met our needs delightfully.
el: Με τον καιρό,συναντήσαμε κάποιες ανοικτού λογισμικού βιβλιοθήκες οι οποίες έκαναν πράγματα τα οποία είχαμε ήδη υλοποιήσει. Ήταν καθησυχαστικό να βλέπεις άλλους ανθρώπους να λύνουν παρόμοια προβλήματα με παρόμοιους τρόπους αλλά ήταν ήδη αργά: είχαμε ήδη γράψει, τεστάρει και υλοποιήσει τα δικά μας κομμάτια του framework με ποικίλες ρυθμίσεις σε παραγωγικό περιβάλλον -- και ο κώδικας μας ικανοποιούσε τις ανάγκες μας εξαιρετικά.
id: Berkali-kali, kami tersandung terhadap pustaka sumber-terbuka yang melakukan hal-hal kami telah terapkan. Itu sangat menenangkan untuk melihat orang lain mengatasi masalah-masalah yang mirip dalam cara yang mirip, tetapi itu terlambat untuk digabungkan diluar kode: Kami telah menulis, menguji dan menerapkan kerangka kerja kami sendiri dalam beberapa pengaturan produksi -- dan kode milik kami memenuhi kebutuhan kami dengan penuh kegembiraan.
it: Nel tempo, ci siamo imbattuti in librerie open-source che facevano cose che avevamo già implementato. E' stato rassicurante vedere altre persone risolvere problemi simili in modi simili, ma era troppo tardi per integrare codice esterno: avevamo già scritto, provato e implementato i nostri pezzetti d'ambiente in parecchi contesti di produzione -- e il nostro codice serviva egregiamente le nostre necessità.
pl: Z czasem natknęliśmy się na otwarte biblioteki, które robiły rzeczy, które już zaimplementowaliśmy. Uspokajający był fakt, że inni rozwiązują podobne problemy w podobny sposób, ale było za późno, aby integrować zewnętrzny kod: już napisaliśmy, przetestowaliśmy i zaimplementowaliśmy fragmenty naszego frameworka w kilku produkcyjnych rozwiązaniach – i nasz własny kod w sposób wyśmienity spełniał nasze oczekiwania.
