Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: There *may* be minor stylistic differences between supported browsers—for example, some browsers may not support rounded corners. These are considered acceptable variations in rendering.
el: Υπάρχει *πιθανότητα* να υπάρχουν κάποιες μικρές στυλιστικές διαφορές μεταξύ των υποστηριζόμενων browsers. Για παράδειγμα, μερικοί μπορεί να μην υποστηρίζουν τις στρογγυλεμένες γωνίες. Αυτά θεωρούνται αποδεκτές διαφοροποιήσεις στο rendering.
