Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: Django grew from a very practical need: World Online, a newspaper Web operation, is responsible for building intensive Web applications on journalism deadlines. In the fast-paced newsroom, World Online often has only a matter of hours to take a complicated Web application from concept to public launch.
el: Το Django αναπτύχθηκε από μια ανάγκη πρακτικής φύσεως: Το τμήμα του Web – World Online – της εταιρίας World Company που διατηρεί τρεις εφημερίδες, είναι υπεύθυνο για το χτίσιμο εντατικών Web applications μέσα σε δημοσιογραφικές προθεσμίες. Σε ένα γρήγορα μεταβαλλόμενο περιβάλλον η World Online έχει, συχνά, μόνο μερικές ώρες για να μετατρέψει ένα Web application από μια έννοια σε κάτι που να ανέβει στο internet για το ευρύ κοινό.
id: Django tumbuh dari kebutuhan yang sangat praktis: World Online, operasi Jaringan surat kabar, bertanggung jawab untuk membangun aplikasi Jaringan instensif pada tenggat waktu jurnalisme. Dalam ruang berita serba cepat, World Online sering mempunyai hanya masalah jam untuk mengambil aplikasi Jaringan rumit dari konsep ke peluncuran umum.
it: Django è nato da una necessità pratica: World Online, un progetto Web per un giornale, è responsabile della costruzione di applicazioni Web intensive con scadenze di pubblicazione. Nella concitazione della redazione, World Online spesso ha solo poche ore per portare una complessa applicazione Web dalla concettualizzazione alla sua messa in produzione.

source: At the same time, the World Online Web developers have consistently been perfectionists when it comes to following best practices of Web development.
el: Την ίδια στιγμή, οι Web developers της World Online είναι τελειομανείς όταν πρόκειται να ακολουθήσουν καλές πρακτικές του Web development.
id: Pada saat bersamaan, pengembang Jaringan World Online secara konsisten telah sempurna ketika dia datang untuk mengikuti latihan terbaik dari pengembangan Jaringan.
it: Allo stesso tempo, gli sviluppatori Web di World Online sono stati costantemente dei perfezionisti quando si è trattato di seguire le migliori pratiche di sviluppo Web.

source: In fall 2003, the World Online developers (Adrian Holovaty and Simon Willison) ditched PHP and began using Python to develop its websites. As they built intensive, richly interactive sites such as Lawrence.com, they began to extract a generic Web development framework that let them build Web applications more and more quickly. They tweaked this framework constantly, adding improvements over two years.
el: Το φθινόπωρο του 2003, οι developers της World Online (Adrian Holovaty και Simon Willison) άφησαν πίσω τους την PHP και ξεκίνησαν να χρησιμοποιούν την Python για να αναπτύσσουν ιστοσελίδες. Καθώς έχτιζαν εντατικές, interactive ιστοσελίδες, όπως το Lawrence.com, ξεκίνησαν σιγά-σιγά να δημιουργούν ένα γενικό Web development framework το οποίο τους βοήθησε να χτίζουν Web applications όλο και πιο γρήγορα. Άρχισαν να ασχολούνται όλο και πιο εντατικά με το framework προσθέτοντας του βελτιώσεις και features για πάνω από δύο χρόνια.
id: Di musim gugur 2003, pengembang World Online (Adrian Holovaty dan Simon Willison) menyingkirkan PHP dan mulai menggunakan Python untuk mengembangkan situs jaringannya. Saat mereka dibangun intensif, situs kaya interaktif seperti Lawrence.com, mereka mulai mengeluarkan kerangka pengembangan Jaringan umum yang membiarkan mereka membangun jaringan Jaringan lebih dan lebih cepat. Mereka mengulik kerangka ini secara tetap, menambahkan perbaikan selama dua tahun.
it: Nell'autunno 2003, gli sviluppatori di World Online (Adrian Holovaty e Simon Willison) abbandonarono PHP e cominciarono ad usare Python per sviluppare il suo sito Web. mentre sviluppavano siti intensivi, riccamente interattivi, come Lawrence.com, cominciarono ad estrarre un ambiente di sviluppo Web che li metteva in grado di sviluppare applicazioni Web sempre più rapidamente. Affinarono questo ambiente costantemente, aggiungendo potenziamenti ogni due anni.

source: Django uses a "shared-nothing" architecture, which means you can add hardware at any level -- database servers, caching servers or Web/application servers.
el: Το Django χρησιμοποιεί μια αρχιτεκτονική "τίποτα κοινόχρηστο", που σημαίνει ότι μπορείτε να προσθέσετε hardware σε οποιοδήποτε επίπεδο -- database servers, caching server ή Web/application servers.
id: Django menggunakan arsitektur "tidak ada-berbagi", yang berarti anda dapat menambahkan perangkat keras pada tingkatan apapun -- peladen basisdata, peladen tombolok atau peladen Jaringan/aplikasi.
it: Django usa una architettura "senza condivisione"; significa che puoi aggiungere hardware ad ogni livello -- server di database, server di cache o server Web/applicativi.

source: Django was originally developed at World Online, the Web department of a newspaper in Lawrence, Kansas, USA. Django's now run by an international `team of volunteers <https://www.djangoproject.com/foundation/teams/>`_.
el: Το Django αναπτύχθηκε, αρχικά, στο World Online, το Web τμήμα μιας εφημερίδας στο Lawrence, στην πολιτεία Kansas, στις ΗΠΑ. Τώρα, πίσω από το Django είναι μια ομάδα από :doc:`διεθνείς εθελοντές <https://www.djangoproject.com/foundation/teams/>`_.
id: Django aslinya dikembangkan pada World Online, departemen jaringan koran di Lawrence, Kansas, USA. Django sekarang berjalan oleh sebuah internasional `team of volunteers <https://www.djangoproject.com/foundation/teams/>`_.
it: Django fu inizialmente sviluppato presso World Online, l'area Web di un giornale situato a Lawrence, Kansas, USA. Django ora vive grazie ad un team internazionale di volontari <https://www.djangoproject.com/foundation/teams/>`_

source: We're well aware that there are other awesome Web frameworks out there, and we're not averse to borrowing ideas where appropriate. However, Django was developed precisely because we were unhappy with the status quo, so please be aware that "because <Framework X> does it" is not going to be sufficient reason to add a given feature to Django.
el: Γνωρίσουμε πολύ καλά ότι πέρα από το Django, υπάρχουν καταπληκτικά Web frameworks εκεί έξω και ότι δεν είμαστε αντίθετοι στην ιδέα να δανειστούμε ιδέες. Ωστόσο, το Django αναπτύχθηκε ακριβώς επειδή δεν είμασταν ικανοποιημένοι με το ήδη υπάρχον καθεστώς, γι' αυτό παρακαλούμε να ξέρετε ότι η λογική του "αφού το <Framework X> το κάνει αυτό" δεν είναι αρκετή για να υλοποιηθεί το συγκεκριμένο feature στο Django.
id: Kami menyadari bahwa ada kerangka kerja Jaringan mengagumkan lainnya diluar sana, dan kami tidak menolak untuk meminjam ide dimana yang sesuai. Bagaimanapun, Django telah dikembangkan sangat tepat karena kami tidak senang dengan status quo, jadi tolong sadari bahwa "because <Framework X> does it" tidak akan menjadi alasan cukup untuk menambahkan fitur pada Django.
it: Siamo consapevoli che ci sono altri ottimi web framework lì fuori e non siamo contrari a prendere in prestito alcune idee quando sono appropriate. Comunque Django è stato sviluppato precisamente perchè non eravamo contenti dello status quo, quindi tieni a mente che "perchè il <Framework X> fa questo" non sarà una motivazione valida per aggiungere una data caratteristica a Django.

source: When Django was originally written, Adrian and Simon spent quite a bit of time exploring the various Python Web frameworks available.
el: Πριν μερικά χρόνια, όταν πρωτοξεκίνησε να γράφεται το Django, ο Adrian και ο Simon αφιέρωσαν αρκετό χρόνο εξερευνώντας τα διάφορα Python Web frameworks τα οποία ήταν διαθέσιμα.
id: Ketika Django aslinya ditulis, Adrian dan Simon menghabiskan sedikit waktu menjelajahi beragam kerangka Jaringan Phyton yang tersedia.
it: Quando Django fu scritto, Adrian e Simon passarono molto tempo a valutare i web frameworks scritti in Python disponibili.

source: No, Django is not a CMS, or any sort of "turnkey product" in and of itself. It's a Web framework; it's a programming tool that lets you build websites.
el: Όχι, το Django δεν είναι ένα CMS ή κάποιο είδος του στυλ "με το κλειδί στο χέρι". Είναι ένα Web framework. Όπερ σημαίνει ότι είναι ένα προγραμματιστικό εργαλείο το οποίο σας επιτρέπει να χτίζετε ιστοσελίδες.
id: Bukan, Django bukan sebuah CMS, atau semacam "turnkey product" di dan dia sendiri. Dia adalah sebuah kerangka kerja Jaringan; dia adalah alat pemrograman yang membuat anda membangun situs jaringan.
it: No, Django non è un CMS, o un qualunque tipo di "prodotto chiavi in mano". E' un ambiente di sviluppo Web; uno strumento di programmazione che ti permette di costruire siti web.

source: The Django docs are available in the ``docs`` directory of each Django tarball release. These docs are in reST (reStructuredText) format, and each text file corresponds to a Web page on the official Django site.
el: Τα Django docs είναι διαθέσιμα στο φάκελο ``docs`` κάθε Django tarball διανομής. Αυτά τα έγγραφα είναι γραμμένα σε reST (reStructuredText) μορφή και κάθε αρχείο κειμένου αντιστοιχεί σε μια σελίδα στην επίσημη ιστοσελίδα του Django.
id: Dokumen Django tersedia di direktori ``docs`` dari setiap terbitan tarball Django. Dokumen ini berada di bentuk (reStructuredText), dan setiap berkas teks berhubungan ke halaman Jaringan di situs Django resmi.
it: La documentazione di Django è disponibile nella directory ``docs`` di ogni archivio di rilascio di Django. Questi documenti sono in formato reST (reStructuredText), e ogni file di testo corrisponde a una pagina Web del sito ufficiale di Django.

source: For example, `APA style`_, would dictate something like::
el: Για παράδειγμα, το `APA style`_, θα υπαγόρευε την αναφορά κάπως έτσι::
id: Sebagai contoh, `gaya APA`_, akan mendikte sesuatu seperti::
it: Per esempio, `APA style`_, potrebbe indicare qualcosa come::

source: For a development environment -- if you just want to experiment with Django -- you don't need to have a separate Web server installed or database server.
it: Per l'ambiente di sviluppo -- se vuoi solo sperimentare con Django -- non devi avere un server Web separato installato o un server di database.

source: 3.5, 3.6, 3.7, 3.8 (added in 2.2.8), 3.9 (added in 2.2.17)
it: 3.5, 3.6, 3.7, 3.8 (aggiunto in 2.2.8), 3.9 (aggiunto in 2.2.17)

source: 3.6, 3.7, 3.8, 3.9 (added in 3.0.11)
it: 3.6, 3.7, 3.8, 3.9 (aggiunto in 3.0.11)

source: 3.6, 3.7, 3.8, 3.9 (added in 3.1.3)
it: 3.6, 3.7, 3.8, 3.9 (aggiunto in 3.1.3)

source: Generally, if you're using code in production, you should be using a stable release. The Django project publishes a full stable release every nine months or so, with bugfix updates in between. These stable releases contain the API that is covered by our backwards compatibility guarantees; if you write code against stable releases, you shouldn't have any problems upgrading when the next official version is released.
el: Γενικά, αν χρησιμοποιείτε κώδικα ο οποίος θα βγει στην παραγωγή (δηλαδή στο internet) θα πρέπει να χρησιμοποιείτε την σταθερή έκδοση (stable release). Το Django project εκδίδει μια πλήρης σταθερή διανομή κάθε εννέα μήνες περίπου, όπου κάθε μια περιέχει διορθώσεις σφαλμάτων (bugfixes). Αυτές οι σταθερές διανομές περιέχουν το API για το οποίο εγγυόμαστε τη λειτουργία του. Αν γράφετε κώδικα με βάση τις σταθερές διανομές δεν θα έχετε κανένα πρόβλημα όταν αναβαθμίζετε σε κάποια επόμενη επίσημη διανομή, αρκεί βέβαια να διαβάζετε τις ανακοινώσεις της καινούργιας διανομής (release notes) γιατί μερικά πράγματα μπορεί αν έχουν αλλάξει.
id: Umumnya, jika anda sedang menggunakan kode di produksi, anda harus menggunakan terbitan stabil. Proyek Django menerbitkan terbitan stabil penuh setiap sembilan bukan atau lebih, dengan pembaharuan perbaikan kesalahan diantaranya. Terbitan stabil ini mengandung API yang melingkupi jaminan kesesuaian kebelakang; jika anda menulis kode terhadap terbitan stabil, anda tidak harus mempunyai masalah mengingkatkan ketika versi resmi selanjutnya terbit.
it: In generale, se userai codice in produzione, devi usare una release stabile. Il progetto Django pubblica una release stabile e completa più o meno ogni nove mesi, infammezzati da aggiornamenti di bugfix. Queste release stabili contengono la API coperta dalla nostra garanzia di retrocompatibilità; se scrivi codice con una release stabile, non avrai problemi ad effettuare gli aggiornamenti quando sarà rilasciata la prossima versione ufficiale.

source: Make sure your Django :setting:`DEBUG` setting is set to ``True``. Then do this::
it: Assicurati che l'impostazione Django :setting:`DEBUG` sia impostata a ``True``. Quindi fai questo::

source: ``connection.queries`` is only available if :setting:`DEBUG` is ``True``. It's a list of dictionaries in order of query execution. Each dictionary has the following::
el: Το ``connection.queries`` είναι διαθέσιμο μόνο αν η ρύθμιση :setting:`DEBUG` είναι ``True``. Στην ουσία είναι μια λίστα από dictionaries με την σειρά που θα εκτελεστούν τα ερωτήματα. Κάθε dictionary περιέχει τα ακόλουθα::
id: ``connection.queries`` hanya tersedia jika :setting:`DEBUG` adalah ``True``. Itu adalah daftar dari kamus-kamus dalam rangka menjalankan permintaan. Setiap kamus mempunyai berikut::
it: ``connection.queries`` è disponibile solo se :setting:`DEBUG` è ``True``. E' una lista di dizionari ordinati come l'esecuzione delle query. Ogni dizionario ha i seguenti::

source: If you are using :doc:`multiple databases</topics/db/multi-db>`, you can use the same interface on each member of the ``connections`` dictionary::
el: Αν χρησιμοποιείτε :doc:`πολλαπλές βάσεις δεδομένων </topics/db/multi-db>`, μπορείτε να χρησιμοποιείτε την ίδια μέθοδο αλλά αλλάζοντας το key του ``connections`` dictionary ούτως ώστε να ταιριάζει με το όνομα της βάσης δεδομένων σας::
id: Jika anda sedang menggunakan :doc:`multiple databases</topics/db/multi-db>`, anda dapat menggunakan antarmuka sama pada setiap anggota dari kamus ``connections``::
it: Se stai usando :doc:`multiple databases</topics/db/multi-db>`, puoi utilizzare la stessa interfaccia per ogni membro del dizionario delle ``connessioni``::

source: Can I use Django with a pre-existing database?
el: Μπορώ να χρησιμοποιήσω το Django με μια ήδη υπάρχουσα βάση δεδομένων;
id: Dapatkah Saya menggunakan Django dengan basisdata sudah ada?
it: Posso utilizzare Django con un database esistente?

source: For example, if you're using MySQL and want your tables to use the MyISAM table type, use the following SQL::
el: Για παράδειγμα, αν χρησιμοποιείτε τη MySQL και θέλετε οι πίνακες σας να χρησιμοποιήσουν τον τύπο πίνακα MyISAM, χρησιμοποιήστε την ακόλουθη SQL εντολή::
id: Sebagai contoh, jika anda sedang menggunakan MySQL dan ingin tabel anda menggunakan jenis tabel MyISAM, gunakan SQL berikut::
it: Per esempio, se stai usando MySQL e vuoi che le tue tabelle usino il tipo MyISAM, usa il seguente codice SQL::

source: ``command not found: django-admin``
it: ``comando non trovato: django-admin``

source: This class of errors happen when a bytestring containing non-ASCII sequences is transformed into a Unicode string and the specified encoding is incorrect. The output generally looks like this::
el: Αυτού του είδους τα σφάλματα προκύπτουν όταν μια ακολουθία από bytes (bytestring) η οποία περιέχει ακολουθίες χαρακτήρων εκτός του ASCII κώδικα μετατρέπεται σε μια ακολουθία χαρακτήρων Unicode και η προσδιοριζόμενη κωδικοποίηση που χρησιμοποιήθηκε είναι λάθος. Η έξοδος, γενικά, μοιάζει με::
id: Kelas kesalahan ini terjadi ketika sebuah bytestring mengandung urutan bukan-ASCII dirubah menjadi deretan karakter Unicode dan penyandian ditentukan tidak benar. Keluaran umumnya kelihatan seperti ini::
it: Questo tipo di errori avviene quando una stringa di byte contenente sequenze non-ASCII viene trasformata in stringa Unicode e il meccanismo di encoding indicato non è corretto. L'output generalmente si presenta come segue::

source: The environment variable :envvar:`DJANGO_SETTINGS_MODULE` is set to a fully-qualified Python module (i.e. "mysite.settings").
it: La variabile d'ambiente :envvar:`DJANGO_SETTINGS_MODULE` è impostata in un modulo Python completo (ad esempio "miosito.settings").

source: In your settings file, you'll need to define :setting:`MEDIA_ROOT` as the full path to a directory where you'd like Django to store uploaded files. (For performance, these files are not stored in the database.) Define :setting:`MEDIA_URL` as the base public URL of that directory. Make sure that this directory is writable by the Web server's user account.
el: Μέσα στο γενικό αρχείο ρυθμίσεων του project σας (settings file), θα χρειαστεί να ορίσετε το :setting:`MEDIA_ROOT` ως ένα μονοπάτι στο φάκελο που θα αποθηκεύονται τα αρχεία που ανεβαίνουν (uploaded). (Για λόγους καλύτερης απόδοσης, αυτά τα αρχεία δεν αποθηκεύονται στη βάση δεδομένων). Δηλώστε το :setting:`MEDIA_URL` ως το βασικό δημόσιο URL αυτού του φακέλου. Βεβαιωθείτε ότι αυτός ο φάκελος έχει δικαιώματα εγγραφής από το λογαριασμό χρήστη στο Web server. Αν δουλεύετε τοπικά στον υπολογιστή σας, τότε το πιο πιθανόν είναι να έχετε δικαιώματα εγγραφής στο φάκελο που ορίσατε.
id: Dalam berkas pengaturan anda, anda akan butuh menentukan :setting:`MEDIA_ROOT` sebagai jalur penuh ke direktori dimana anda ingin menyimpan berkas terunggah. (Untuk penampilan, berkas-berkas ini tidak disimpan di basisdata.) Tentukan :setting:`MEDIA_URL` sebagai dasar URL umum dari direktori itu. pastikan bahwa direktori ini dapat ditulis oleh Jaringan akun pengguna peladen.
it: Nel tuo file di configurazione, devi impostare :setting:`MEDIA_ROOT` con il path assoluto ad una directory in cui vuoi che Django salvi i file caricati. (A causa delle prestazioni, questi file non sono salvati nel database.) Imposta :setting:`MEDIA_URL` come la URL pubblica di base di quella directory. Sii sicuro che questa directory abbia il permesso di scrittura da parte dell'utenza del Web server.

source: Inconsistent row counts may be caused by missing foreign key values or a foreign key field incorrectly set to :attr:`null=False <django.db.models.Field.null>`. If you have a record with a :class:`~django.db.models.ForeignKey` pointing to a non-existent object and that foreign key is included is :attr:`~django.contrib.admin.ModelAdmin.list_display`, the record will not be shown in the admin changelist because the Django model is declaring an integrity constraint that is not implemented at the database level.
id: Tidak konsisten jumlah baris dapat disebabkan oleh nilai foreign key yang hilang atau bidang foreign key tidak benar disetel ke :attr:`null=False <django.db.models.Field.null>`. Jika anda mempunyai rekaman dengan :class:`~django.db.models.ForeignKey` menunjuk ke obyek tidak-ada dan bahwa foreign key disertakan adalah :attr:`~django.contrib.admin.ModelAdmin.list_display`, rekaman tidak akan ditampilkan di daftar rubah admin karena model Django dinyatakan sebuah kesatuan pembatas yang tidak diterapkan pada tingkatan basisdata.

source: If you want more flexibility than simply tweaking the auto-generated forms, feel free to write custom views for the admin. The admin is powered by Django itself, and you can write custom views that hook into the authentication system, check permissions and do whatever else they need to do.
el: Αν θέλετε περισσότερη ελευθερία από το να πειράξετε την αυτόματα παραγόμενη φόρμα, μπορείτε να γράψετε δικά σας views για το admin. Το admin υποστηρίζεται από το ίδιο το Django και γι' αυτό το λόγο μπορείτε να γράψετε δικά σας views τα οποία μπορούν να “πατήσουν” π.χ πάνω στο authentication system ή να ελέγξουν για permissions ή οτιδήποτε άλλο μπορείτε να φανταστείτε.
id: Jika anda ingin lebih fleksibel daripada menarik formulir otomatis-dibangkitkan, silahkan bebas menulis tampilan sesuaian untuk admin. Admin ditenagai oleh Django itu sendiri, dan anda dapat menulis tamilan sesuaian yang mengkait ke dalam sistem pembuktian keaslian dan lakukan apapun mereka butuh lakukan.

source: The admin provides a fully-functional experience to `YUI's A-grade`_ browsers, with the notable exception of IE6, which is not supported.
el: Το admin παρέχει πλήρη λειτουργικότητα για τους `YUI's A-grade`_ browsers, με εξαίρεση τον IE6, ο οποίος δεν υποστηρίζεται.
id: Admin menyediakan pengalaman fungsional-penuh kepada perambah `Tingkatan-A YUI`_, dengan pengecualian penting dari IE 6, yang tidak didukung.

source: There *may* be minor stylistic differences between supported browsersâ€”for example, some browsers may not support rounded corners. These are considered acceptable variations in rendering.
id: Ada *mungkin* gaya sedikit berbeda diantara perambah yang didukung-sebagai contoh, beberapa perambah mungkin tidak mendukunh sudut bundar. Ini dianggap macam yang dapat diterima dalam membangun.

source: Another reason that bugs might be ignored for while is if the bug is a symptom of a larger problem. While we can spend time writing, testing and applying lots of little patches, sometimes the right solution is to rebuild. If a rebuild or refactor of a particular component has been proposed or is underway, you may find that bugs affecting that component will not get as much attention. Again, this is just a matter of prioritizing scarce resources. By concentrating on the rebuild, we can close all the little bugs at once, and hopefully prevent other little bugs from appearing in the future.
el: Ένας άλλος λόγος που ένα bug μπορεί να αγνοηθεί είναι η περίπτωση που το ίδιο αποτελεί ένα σύμπτωμα ενός μεγαλύτερου προβλήματος. Παρόλο που ξοδεύουμε χρόνο για να γράψουμε, τεστάρουμε και εφαρμόσουμε πολλά μικρά patches, μερικές φορές είναι πιο φρόνιμο να το χτίσουμε από την αρχή (rebuild). Αν έχει προταθεί ή είναι καθοδόν κάποιο rebuild ή κάποιο refactor ενός συγκεκριμένου component, θα διαπιστώσετε ότι τα bugs που επηρεάζουν αυτό το component δε θα λάβουν τη δέουσα προσοχή. Για ακόμη μια φορά, αυτό είναι θέμα προτεραιοτήτων. Συγκεντρώνοντας την προσοχή μας σε κάποιο rebuild, μπορούμε να κλείσουμε, μονομιάς, όλα τα μικρά bugs και να ελπίζουμε ότι άλλα bugs μικρής κλίμακας δεν θα εμφανιστούν στο μέλλον.
id: Alasan lain yang kesalahan mungkin diabaikan untuk sementara adalah jika kesalahan adalah gejala dari masalah besar. Selama kami dapat menghabiskan waktu menulis, mencoba dan memberlakukan banyak tambalan kecil, terkadang pemecahan terbaik adalah membangun kembali. Jika membangun kembali atau mengurai kembali dari komponen khusus telah diajukan atau sedang berjalan, anda mungkin menemukan kesalahan itu mempengaruhi komponen itu tidak akan mendapatkan perhatian banyak. kembali, ini hanya masalah prioritas sumber daya yang langka. Dengan berkonsentrasi dalam membangun kembali, kami dapat menutup semua kesalahan kecil sekaligus, dan berharap mencegah kesalahan kecil lain muncul di masa depan.
