Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: FAQ: Contributing code
el: Συχνές Ερωτήσεις: Συνεισφέροντας κώδικα
id: FAQ: Kode Bantuan
it: FAQ: contribuire al codice
pl: Często zadawane pytania: Współtworzenie kodu

source: How can I get started contributing code to Django?
el: Πως μπορώ να ξεκινήσω να συνεισφέρω κώδικα στο Django;
id: Bagaimana dapat Saya mulai membantu kode ke Django?
it: Come posso iniziare a contribuire al codice di Django?
pl: Jak mogę zacząć współtworzyć kod Django?

source: Thanks for asking! We've written an entire document devoted to this question. It's titled :doc:`Contributing to Django </internals/contributing/index>`.
el: Ευχαριστούμε για την ερώτηση! Έχουμε γράψει ολόκληρο άρθρο αφιερωμένο για αυτήν ακριβώς την ερώτηση. Έχει τον τίτλο :doc:`Συνεισφέροντας στο Django </internals/contributing/index>`.
id: Terima kasih untuk bertanya! Kami telah menulis seluruh dokumen setia untuk pertanyaan ini. Itu adalah berjudul :doc:`Contributing to Django </internals/contributing/index>`.
it: Grazie di avere chiesto! Abbiamo scritto un intero documento dedicato a questa domanda. E' intitolato :doc:`Collaborare a Django </internals/contributing/index>`.
pl: Dzięki, że pytasz! Napisaliśmy cały dokument poświęcony temu pytaniu. Jest zatytułowany :doc:`Współtworzenie Django </internals/contributing/index>`.

source: I submitted a bug fix in the ticket system several weeks ago. Why are you ignoring my patch?
el: Κατέθεσα ένα fix για ένα bug μέσω του ticket system πριν από πολλές εβδομάδες. Γιατί αγνοείτε το patch μου;
id: Saya mengajukan perbaikan kesalahan di sistem tiket beberapa minggu lalu. mengapa anda mengabaikan tambalan saya?
it: Ho inoltrato un fix per un bug nel sistema di monitoraggio dei ticket diverse settimane fa, perchè state ignorando la mia patch?
pl: Złożyłem zgłoszenie dotyczące naprawy błędu kilka tygodni temu. Dlaczego ignorujecie moją łatkę?

source: Don't worry: We're not ignoring you!
el: Μην ανησυχείτε: Δε σας αγνοούμε!
id: Jangan khawatir: Kami tidak mengabaikan anda!
it: Non preoccuparti, non ti stiamo ignorando!
pl: Bez obaw: Nie ignorujemy Cię!

source: It's important to understand there is a difference between "a ticket is being ignored" and "a ticket has not been attended to yet." Django's ticket system contains hundreds of open tickets, of various degrees of impact on end-user functionality, and Django's developers have to review and prioritize.
el: Είναι σημαντικό να καταλάβετε τη διαφορά μεταξύ "ενός ticket το οποίο αγνοείται" και "ενός ticket στο οποίο δεν έχει δοθεί προσοχή ακόμα". Το ticket system του Django περιέχει εκατοντάδες ανοικτά tickets (open tickets), πάνω σε διάφορους τομείς που οι developers του Django πρέπει να τα επιθεωρήσουν (review) και να τους αναθέσουν τις κατάλληλες προτεραιότητες (prioritize).
id: Itu adalah penting untuk memahami ada perbedaan diantara "sebuah tiket yang diabaikan" dan "sebuah tiket yang belum dihadiri." Sistem tiket Django mengandung ratusan tiket terbuka, dari beragam tingkatan dari dampak pada kegunaan pengguna-akhir, dan pengembang Django harus meninjau kembali dan mengutamakan
it: E' importante capire che è diverso tra "un ticket sarà ignorato" e "un ticket ancora non è stato gestito". Il sistema di ticket di Django contiene centinaia di ticket aperti, che gli sviluppatori di Django devono recensire e applicare priorità.
pl: To ważne, żeby rozumieć różnicę pomiędzy „zgłoszenie jest ignorowane” a „zgłoszenie nie zostało jeszcze rozpatrzone”. System zgłoszeń Django zawiera setki otwartych zgłoszeń z różnymi poziomami skutków na funkcjonalność dla użytkownika końcowego. Programiści Django muszą je przejrzeć i nadać im priorytet.

source: On top of that: the people who work on Django are all volunteers. As a result, the amount of time that we have to work on the framework is limited and will vary from week to week depending on our spare time. If we're busy, we may not be able to spend as much time on Django as we might want.
el: Εκτός αυτού, οι άνθρωποι που δουλεύουν για το Django είναι όλοι εθελοντές. Ως αποτέλεσμα αυτού, ο χρόνος που απαιτείται για την αφιέρωση στο framework είναι περιορισμένος και θα διαφέρει από βδομάδα σε βδομάδα αναλόγως τον ελεύθερο χρόνο μας. Αν είμαστε απασχολημένοι, ίσως να μην μπορέσουμε να αφιερώσουμε τον χρόνο που θέλουμε στο Django.
id: Di atas semua itu: orang yang bekerja pada Django adalah semuanya sukarelawan. Sebagai hasilnya, sejumlah waktu yang kami harus kerjakan di kerangka adalah terbatas dan akan beragam dari minggu ke minggu tergantung waktu lenggang kami. Jika kami sibuk, kami mungkin tidak dapat menghabiskan waktu pada Django seperti yang kita inginkan.
it: E, soprattutto: le persone che lavorano su Django sono tutti volontari. Di conseguenza, la la quantità di tempo che abbiamo per lavorare sul framework è limitata e varia di settimana in settimana a seconda del nostro tempo libero. Se siamo impegnati, potremmo non essere in grado di dedicare a Django il tempo che vorremmo.
pl: Ponad wszystko: ludzie, którzy pracują nad Django to wolontariusze. W efekcie ilość czasu, który posiadamy do pracy nad frameworkiem jest ograniczony i będzie różnił się z tygodnia na tydzień w zależności od naszego wolnego czasu. Jeśli jesteśmy zajęci, nie jesteśmy w stanie poświęcać wystarczająco dużo czasu na Django, nawet jeśli byśmy chcieli.

source: The best way to make sure tickets do not get hung up on the way to checkin is to make it dead easy, even for someone who may not be intimately familiar with that area of the code, to understand the problem and verify the fix:
el: Ο καλύτερος τρόπος να σιγουρευτείτε ότι τα tickets δεν “κρεμάνε” κατά το checkin είναι να κάνετε πολύ κατανοητό, ακόμη και γι' αυτούς που δεν είναι εξοικειωμένοι με αυτό το κομμάτι του κώδικα, το πρόβλημα και να επιβεβαιώσετε το fix:
id: Cara terbaik untuk memastikan tiket tidak menutup dalam perjalanan untuk memeriksa adalah membuatnya mudah mati, bahkan untuk seseorang yang tidak ingin dengan baik sekali akrab dengan kawasan dari kode, untuk memahami masalah dan memeriksa perbaikan:
it: Il miglior modo per essere sicuri che i ticket non rimangano bloccati durante il controllo è di renderli semplici nel capire il problema e nel verificare la soluzione, anche per qualcuno che può non avere familiarità con quell'area di codice:
pl: Najlepszym sposobem, aby uniknąć zawieszania się zgłoszeń w drodze do ich wykonania, jest uczynić banalnie prostym, nawet dla kogoś, kto może nie być zaznajomiony z tym obszarem kodu, zrozumienie problemu i weryfikację rozwiązania:

source: Are there clear instructions on how to reproduce the bug? If this touches a dependency (such as Pillow), a contrib module, or a specific database, are those instructions clear enough even for someone not familiar with it?
el: Υπάρχουν ξεκάθαρες οδηγίες για το πως να αναπαραχθεί το σφάλμα (bug); Αν το σφάλμα επηρεάζει κάποιο dependency (όπως το Pillow), ένα contrib module, ή κάποια συγκεκριμένη βάση δεδομένων, είναι οι οδηγίες αρκετά ξεκάθαρες ούτως ώστε να τις διαβάσει κάποιος ο οποίος δεν είναι εξοικειωμένος με αυτό;
id: Apakah ada perintah jelas bagaimana memproduksi kembali kesalahan? Jika ini menyentuh ketergantungan (seperti Pillow), modul kontribusi, atau basisdata khusus, perintah tersebut cukup jelas bahkan untuk seseorang tidak akrab dengannya?
it: Ci sono istruzioni chiare su come riprodurre il guasto? Se questo riguarda una dipendenza (come Pillow), un modulo aggiuntivo, o un database specifico, queste istruzioni sono abbastanza chiare anche per qualcuno che non sia familiare con esso?
pl: Czy są wyraźne instrukcje jak odtworzyć błąd? Jeśli dotyka on zależności (na przykład Pillow), modułu contrib, albo specyficznej bazy danych, czy instrukcje są wystarczająco wyraźne, nawet dla osoby niezaznajomionej z tematem?

source: If there are several patches attached to the ticket, is it clear what each one does, which ones can be ignored and which matter?
el: Αν υπάρχουν αρκετά patches για ένα ticket, είναι ξεκάθαρο το τι κάνει το καθένα, ποια μπορούν να αγνοηθούν και ποια είναι μένουν;
id: Jika ada beberapa tambalan dilampirkan ke tiket, apakah jelas apa setiap satu lakukan, yang mana dapat diabaikan dan hal apa?
it: Se vi sono più patch attaccate al ticket, è chiaro cosa fa ciascuna? e quali possono essere ignorate? e quali sono importanti?
pl: Jeśli zgłoszenie zawiera wiele załączonych łatek, czy jasne jest co która robi, która może być pominięta a która ma znaczenie?

source: Does the patch include a unit test? If not, is there a very clear explanation why not? A test expresses succinctly what the problem is, and shows that the patch actually fixes it.
el: Το patch περιέχει κάποιο unit test; Αν όχι, υπάρχει κάποια σαφής εξήγηση γιατί; Ένα τεστ εκφράζει ευκρινώς ποιο είναι το πρόβλημα και δείχνει ότι το patch στην πραγματικότητα το διορθώνει.
id: Apakah tambalan menyertakan satuan percobaan? Jika tidak, apakah ada penjelasan sangat jelas kenapa tidak? Sebuah percobaan mengungkapkan dengan ringkas apa masalahnya, dan tampilkan yang tambalan sebenarnya diperbaiki.
it: La patch include uno unit test? Se no, vi è una chiara spiegazione del perché? Un test esprime sinteticamente qual'è il problema, e mostra che la patch lo risolve realmente.
pl: Czy do łatki dołączony jest test jednostkowy? Jeśli nie, czy jest jasny powód dlaczego? Test wyraża krótko na czym polega problem i pokazuje, że łatka faktycznie go naprawia.

source: If your patch stands no chance of inclusion in Django, we won't ignore it -- we'll just close the ticket. So if your ticket is still open, it doesn't mean we're ignoring you; it just means we haven't had time to look at it yet.
el: Αν το patch σας δεν συμπεριληφθεί στο Django, δεν το αγνοούμε -- απλά κλείνουμε το ticket (close ticket). Οπότε, αν το ticket σας είναι ακόμη ανοικτό, αυτό δε σημαίνει ότι σας αγνοούμε. Απλά ότι δεν είχαμε χρόνο να το κοιτάξουμε.
id: Jika tambalan anda tidak mempunyai kesempatan penyertaan di Django, kami tidak akan mengabaikannya -- kami akan menutup tiket. Jadi jika tiket anda masih terbuka, tidak berarti kami akan mengabaikan anda; itu berarti kami belum mempunyai waktu untuk melihatnya.
it: Se la tua patch non ha alcuna possibilità di inclusione in Django, non la ignoreremo -- semplicemente chiuderemo il ticket. Quindi se il tuo ticket è ancora aperto, non significa che ti stiamo ignorando; significa solo che ancora non abbiamo avuto tempo di guardarlo.
pl: Jeśli twoja łatka nie ma szans na dołączenie do Django, nie ignorujemy jej – po prostu zamykamy zgłoszenie. Dlatego jeśli twoje zgłoszenie jest nadal otwarte, nie oznacza to, że cię ignorujemy. Oznacza po prostu, że nie mieliśmy jeszcze czasu się mu przyjrzeć.

source: When and how might I remind the team of a patch I care about?
el: Πότε και πως μπορώ να υπενθυμίσω στην core ομάδα ένα patch το οποίο με ενδιαφέρει;
id: kapan dan bagaimana mungkin Saya mengingat tim dari sebuah tambalan Saya pedulikan?
it: Quando e come posso ricordare al team una patch di cui mi preoccupo?
pl: Kiedy i jak mogę przypomnieć głównemu zespołowi o łatce, która mnie interesuje?

source: A polite, well-timed message to the mailing list is one way to get attention. To determine the right time, you need to keep an eye on the schedule. If you post your message right before a release deadline, you're not likely to get the sort of attention you require.
el: Ένας τρόπος να σας δώσουμε προσοχή είναι ένα ευγενικό και επίκαιρο μήνυμα στη mailing list. Αυτό που θα καθορίσει το πόσο επίκαιρο είναι το μήνυμα σας είναι να παρακολουθείτε το schedule. Αν στείλετε το μήνυμα σας όταν οι core developers προσπαθούν να διεκπεραιώσουν ένα feature εντός κάποιου deadline ή βρίσκονται υπό τη φάση κάποιου σχεδιασμού, τότε δεν θα έχετε την προσοχή που περιμένατε. Ωστόσο, όταν στείλετε το μήνυμα σας κατά τη διάρκεια που οι core developers ασχολούνται με τα bugs -- ακριβώς πριν το διορθώσουν ή βρίσκεται πριν την beta έκδοση του -- τότε είναι πολύ πιο πιθανό να έχετε την πολύτιμη ανταπόκριση τους.
id: Sopan, pesan di waktu baik ke daftar penyuratan adalah satu cara untuk mendapatkan perhatian. Untuk menentukan waktu tepat, anda butuh menjaga mata pada jadwal. Jika anda memasang pesan tepat sebelum tenggat waktu terbitan, anda sepertinya tidak akan mendapatkan perhatian anda butuhkan.
it: Un messaggio cortese e tempestivo alla mailing list è un modo per attirare l'attenzione. Per determinare il momento giusto, è necessario tenere d' occhio il programma. Se pubblichi il tuo messaggio subito prima della scadenza del termine di rilascio, probabilmente non riceverai il tipo di attenzione che desideri.
pl: Miła, wysłana w odpowiedniej chwili wiadomość na listę mailingową jest jednym ze sposobów na zwrócenie na siebie uwagi. Aby rozpoznać odpowiedni czas, musisz mieć oko na harmonogram. Jeśli wyślesz swoją wiadomość tuż przed deadlinem wydania, prawdopodobnie nie zdobędziesz tego rodzaju uwagi, którego potrzebujesz.

source: Gentle IRC reminders can also work -- again, strategically timed if possible. During a bug sprint would be a very good time, for example.
el: Ένας άλλος τρόπος που μπορεί να δουλέψει είναι οι ευγενικές υπενθυμίσεις μέσω του IRC -- και πάλι, δώστε προσοχή στην περίοδο που στέλνετε το μήνυμα σας. Μία καλή χρονική στιγμή είναι κατά τη διάρκεια του bug sprint (η περίοδος που οι core developers ασχολούνται με την επιδιόρθωση σφαλμάτων).
id: Pengingat Gentle IRC dapa juga bekerja -- kembali, menurut rencana waktu jika memungkinkan. Selama sebuah kesalahan berlari cepat akan menjadi waktu bagus, sebagai contoh.
it: Anche garbati promemoria su IRC possono essere efficaci -- di nuovo, se possibile con una temporizzazione strategica. Per esempio, durante uno sprint per la soluzione di bug sarebbe un'ottima scelta.
pl: Delikatne przypomnienia na IRC mogą również zadziałać -- ponownie, strategicznie skoordynowane czasowo, jeśli możliwe. Bardzo dobry czas to na przykład okres bug sprintu.

source: Another way to get traction is to pull several related tickets together. When someone sits down to review a bug in an area they haven't touched for a while, it can take a few minutes to remember all the fine details of how that area of code works. If you collect several minor bug fixes together into a similarly themed group, you make an attractive target, as the cost of coming up to speed on an area of code can be spread over multiple tickets.
pl: Innym sposobem na uzyskanie przyczepności jest umieszczenie razem kilku powiązanych zgłoszeń. Kiedy ktoś siada do przyjrzenia się błędowi w obszarze kodu, którego nie dotykał przez chwilę, może zająć mu kilka minut przypomnienie sobie wszystkich drobnych szczegółów, jak działa ten obszar. Jeśli zbierzesz kilka mniejszych poprawek błędów w grupę o podobnym temacie, możesz stworzyć atrakcyjny cel, jako że koszt wgryzienia się w obszar kodu może zostać rozłożony na wiele zgłoszeń.

source: Please refrain from emailing anyone personally or repeatedly raising the same issue over and over again. This sort of behavior will not gain you any additional attention -- certainly not the attention that you need in order to get your issue addressed.
pl: Prosimy wystrzegać się pisania do kogokolwiek osobistych e-maili lub powtarzania zgłoszeń w kółko tego samego. Taki sposób zachowania nie przysporzy ci żadnej dodatkowej uwagi – na pewno nie takiej uwagi, której potrzebujesz, aby twoje zgłoszenie zostało rozwiązane.

source: But I've reminded you several times and you keep ignoring my patch!
el: Αλλά σας το έχω επισημάνει αρκετές φορές και εσείς συνεχίζετε να αγνοείτε το patch μου!
id: Tetapi saya telah mengingatkan anda beberapa kali dan tetap mengabaikan tambalan saya!
it: Ve l'ho ricordato più volte e continuate a ignorare la mia patch!
pl: Ale przecież przypominałem Ci kilka razy a Ty nadal ignorujesz moją łatkę!

source: Seriously - we're not ignoring you. If your patch stands no chance of inclusion in Django, we'll close the ticket. For all the other tickets, we need to prioritize our efforts, which means that some tickets will be addressed before others.
el: Σοβαρά τώρα - δεν σας αγνοούμε. Αν το patch σας δεν έχει καμία πιθανότητα να ενσωματωθεί στο Django, θα κλείσουμε το ticket. Για όλα τα άλλα tickets, χρειάζεται να θέσουμε κάποιες προτεραιότητες και επομένως μερικά να διευθετηθούν νωρίτερα από κάποια άλλα.
id: Sungguh - kami tidak mengabaikan anda. Jika tambalan anda berdiri tidak ada kesempatan penyertaan di Django, kami akan menutup tiket. Untuk semua tiket lainnnya, kami butuh mengutamakan usaha kami, yang berarti beberapa tiket akan dialamatkan sebelum lainnya.
it: Seriamente - non ti ignoreremo. Se la tua patch non ha possibilità di inclusione in Django, chiuderemo il ticket. Per tutti gli altri ticket, abbiamo la necessità di gestire le nostre attività tramite priorità, il che vuol dire che alcuni ticket saranno gestiti prima di altri.
pl: Poważnie - nie ignorujemy cię. Jeśli Twoja łatka nie ma szans na dołączenie do Django, zamkniemy zgłoszenie. Dla wszystkich innych zgłoszeń musimy ustalić priorytety naszych działań, co oznacza, że niektóre zgłoszenia zostaną rozpatrzone przed innymi.

source: One of the criteria that is used to prioritize bug fixes is the number of people that will likely be affected by a given bug. Bugs that have the potential to affect many people will generally get priority over those that are edge cases.
el: Ένα από τα κριτήρια τα οποία χρησιμοποιούμε για να θέσουμε προτεραιότητες στα bug fixes είναι ο αριθμός των ανθρώπων που θα επηρεαστούν από το συγκεκριμένο bug. Τα bugs που ενδεχομένως να επηρεάζουν αρκετό κόσμο θα πάρουν προτεραιότητα εν συγκρίσει με τις ακραίες περιπτώσεις.
id: Satu dari kriteria yang digunakan untuk mengutamakan perbaikan kesalahan adalah jumlah orang yang akan dipengaruhi oleh kesalahan yang diberikan. Kesalahan yang mempunyai kemungkinan untuk mempengarui banyak orang akan umumnya mendapatkan keutamaan disamping orang-orang yang kasusnya dipinggirkan.
it: Uno dei criteri utilizzato per dare priorità ai bug fix è il numero di persone che sarà probabilmente colpito da un determinato bug. Bug che potenzialmente riguardano molte persone generalmente avranno priorità rispetto quelli che sono casi limite.
pl: Jednym z kryteriów, które jest używane to priorytetyzowania poprawek błędów, jest liczba osób, na którą może mieć wpływ dany błąd. Błędy, które potencjalnie mogą wpłynąć na pracę wielu ludzi, zazwyczaj dostają priorytet nad tymi, które są przypadkami brzegowymi.

source: Another reason that a bug might be ignored for a while is if the bug is a symptom of a larger problem. While we can spend time writing, testing and applying lots of little patches, sometimes the right solution is to rebuild. If a rebuild or refactor of a particular component has been proposed or is underway, you may find that bugs affecting that component will not get as much attention. Again, this is a matter of prioritizing scarce resources. By concentrating on the rebuild, we can close all the little bugs at once, and hopefully prevent other little bugs from appearing in the future.
it: Un altro motivo per cui un bug potrebbe essere ignorato è se il bug è un sintomo di un problema più grande. Sebbene possiamo dedicare del tempo a scrivere, testare e applicare molte piccole patch, a volte la soluzione giusta è riscrivere da capo. Se una riscrittura o una modica di un particolare componente è stata proposta o è in corso, potresti scoprire che i bug che interessano quel componente non riceveranno la stessa attenzione degli altri. Ancora una volta, si tratta di dare delle priorità con risorse scarse. Concentrandoci sulla riscrittura, possiamo chiudere tutti i piccoli bug contemporaneamente e, si spera, impedire che altri piccoli bug compaiano in futuro.
pl: Innym powodem, dla którego błąd może być przez chwilę ignorowany, może być sytuacja, w której błąd jest symptomem większego problemu. Mimo że możemy poświęcić czas pisaniu, testowaniu i aplikowaniu wielu małych łat, czasem dobrym rozwiązaniem jest przebudować funkcjonalność. Jeśli została zaproponowana albo jest w toku przebudowa lub refaktoring konkretnego komponentu, może się okazać, że zgłoszenia dotyczące tego komponentu nie przyciągną tak wiele uwagi. Znów, to kwestia priorytetyzowania ograniczonych zasobów. Koncentrując się na przebudowie, możemy naprawić wszystkie małe błędy za jednym razem i być może uniknąć pojawienia się innych małych błędów w przyszłości.

source: Whatever the reason, please keep in mind that while you may hit a particular bug regularly, it doesn't necessarily follow that every single Django user will hit the same bug. Different users use Django in different ways, stressing different parts of the code under different conditions. When we evaluate the relative priorities, we are generally trying to consider the needs of the entire community, instead of prioritizing the impact on one particular user. This doesn't mean that we think your problem is unimportant -- just that in the limited time we have available, we will always err on the side of making 10 people happy rather than making a single person happy.
it: Qualunque sia il motivo, tieni presente che sebbene ti possa colpire regolarmente un particolare bug, non necessariamente colpirà ogni singolo utente di Django. Utenti diversi usano Django in modi diversi, usando diverse parti del codice in condizioni diverse. Quando valutiamo le priorità relative, generalmente cerchiamo di considerare le esigenze dell'intera comunità, invece di dare la priorità all'impatto su un particolare utente. Ciò non significa che pensiamo che il tuo problema non sia importante, ma solo che nel tempo limitato che abbiamo a disposizione è preferibile rendere felici 10 persone piuttosto che renderne felice una sola.
pl: Cokolwiek jest przyczyną, prosimy pamiętaj, że podczas gdy ty możesz napotykać szczególny błąd regularnie, nie znaczy to koniecznie, że każdy użytkownik Django się z nim zetknie. Różni użytkownicy używają Django na różne sposoby, obciążając różne części kodu w różnych warunkach. Kiedy szacujemy priorytety, w ogólności staramy się brać pod uwagę potrzeby całej społeczności, zamiast priorytetyzować wpływ na jednego wybranego użytkownika. To nie znaczy, że myślimy, iż twój problem jest nieważny – myślimy tylko, że w dostępnym ograniczonym czasie, zawsze przychylimy się do uczynienia szczęśliwymi 10 osób, ponad uczynienie szczęśliwą tylko jednej.

source: I'm sure my ticket is absolutely 100% perfect, can I mark it as "Ready For Checkin" myself?
it: Sono sicuro che il mio ticket è assolutamente perfetto al 100%, posso contrassegnarlo da solo come "Ready For Checkin"?
pl: Jestem pewien(-wna), że moje zgłoszenie jest w 100% perfekcyjne. Czy mogę sam(a) oznaczyć je jako „Ready For Checkin”?

source: Sorry, no. It's always better to get another set of eyes on a ticket. If you're having trouble getting that second set of eyes, see questions above.
it: Scusa no. È sempre meglio avere un altro parerei su un ticket. Se hai problemi a ottenere il secondo parere, guarda le domande precedenti.
pl: Przepraszam, ale nie. Zawsze lepiej spojrzeć na zgłoszenie jeszcze jedną parę oczu. Jeśli masz problemy z uzyskaniem drugiej pary oczu, zapoznaj się z pytaniami powyżej.

source: FAQ: General
el: Συχνές Ερωτήσεις: Γενικά
id: FAQ: Umum
it: FAQ: Generale
pl: Często zadawane pytania: Ogólne

source: Why does this project exist?
el: Γιατί υπάρχει το Django;
id: Mengapa proyek ini ada?
it: Perché esiste questo progetto?
pl: Dlaczego ten projekt istnieje?
