Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: In most cases, however, we found that existing frameworks/tools inevitably had some sort of fundamental, fatal flaw that made us squeamish. No tool fit our philosophies 100%.
el: Σε πολλές περιπτώσεις, ωστόσο, βρήκαμε ότι κάποια frameworks/tools είχαν αναπόφευκτα μερικά θεμελιώδη μοιραία ελαττώματα που μας έφεραν τάση προς εμετό. Κανένα εργαλείο δεν ταιριάζει στις φιλοσοφίες μας 100%.
id: Dalam kebanyakan kasus, bagaimanapun, kami menemukan bahwa kerangka kerja/alat yang ada pasti mempunyai beberapa macam dasar, kesalahan fatal yang membuat kami mudah tersinggung. Tidak ada alat yang cocok dengan filosofi kami 100%
it: Comunque, nella maggior parte dei casi abbiamo scoperto che inevitabilmente gli ambienti/strumenti esistenti avevano qualche tipo di fondamentale, fatale difetto. Nessuno strumento si adatta al 100% alle nostre filosofie.
pl: W większości przypadków jednak okazywało się, że istniejące frameworki/narzędzia nieuchronnie miały jakieś fundamentalne, fatalne błędy, które uczyniły nas przeczulonymi. Żadne narzędzie nie pasuje do naszych filozofii w 100%.

source: Like we said: We're picky.
el: Όπως είπαμε: είμαστε επιλεκτικοί.
id: Seperti kami katakan: Kami pemilih.
it: Come abbiamo già detto: siamo esigenti.
pl: Tak jak mówiliśmy: Jesteśmy ostrożni.

source: We've documented our philosophies on the :doc:`design philosophies page </misc/design-philosophies>`.
el: Έχουμε τεκμηριώσει τις φιλοσοφίες μας στο άρθρο :doc:`φιλοσοφίες σχεδιασμού </misc/design-philosophies>`.
id: Kami telah mendokumentasikan filosofi kami di :doc:`halaman rancangan filosofi </misc/design-philosophies>`.
it: Abbiamo documentato le nostre filosofie in :doc:`design philosophies page </misc/design-philosophies>`.
pl: Udokumentowaliśmy nasze filozofie na :doc:`stronie filozofii projektowych </misc/design-philosophies>`.

source: Is Django a content-management-system (CMS)?
el: Είναι το Django ένα content-management-system (CMS);
id: Apakah Django content-management-system (CMS)?
it: Django è un CMS (content-management-system)?
pl: Czy Django jest systemem zarządzania treścią (CMS-em)?

source: No, Django is not a CMS, or any sort of "turnkey product" in and of itself. It's a web framework; it's a programming tool that lets you build websites.
pl: Nie, Django nie jest sam w sobie CMS-em, ani żadnym rodzajem „produktu pod klucz”. Jest frameworkiem webowym; narzędziem programistycznym, które pozwala ci budować witryny internetowe.

source: For example, it doesn't make much sense to compare Django to something like Drupal_, because Django is something you use to *create* things like Drupal.
el: Για παράδειγμα, δεν βγάζει και πολύ νόημα να συγκρίνετε π.χ το Django με το Drupal_, επειδή το Django είναι κάτι που χρησιμοποιείς για να *δημιουργήσεις* πράγματα όπως το Drupal.
id: Sebagai contoh, tidak masuk akal untuk membandingkan Django pada sesuatu seperti Drupal_, karena Django adalah sesuatu anda gunakan untuk *membuat* hal-hal seperti Drupal.
it: Per esempio, non ha molto senso comparare Django a qualcosa come Drupal_, perché Django è qualcosa che tu usi per *creare* oggetti come Drupal.
pl: Na przykład nie ma wiele sensu porównywać Django do czegoś podobnego do Drupala_, ponieważ Django jest czymś, co używasz, by *tworzyć* rzeczy takie jak Drupal.

source: Yes, Django's automatic admin site is fantastic and timesaving -- but the admin site is one module of Django the framework. Furthermore, although Django has special conveniences for building "CMS-y" apps, that doesn't mean it's not just as appropriate for building "non-CMS-y" apps (whatever that means!).
it: Sì, la sezione di amministrazione automatica di Django è fantastica e fa risparmiare tempo, ma la sezione di amministrazione è un modulo del framework Django. Inoltre, sebbene Django abbia vantaggi speciali per la creazione di app "CMS-y", ciò non significa che non sia altrettanto appropriato per la creazione di app "non-CMS-y" (qualunque cosa significhi!).
pl: Tak, automatyczny panel administracyjny Django jest fantastyczny i pozwala oszczędzić czas – ale panel jest jednym modułem frameworka Django. Co więcej, pomimo że Django ma udogodnienia do budowania „CMS-owych” aplikacji, nie znaczy to, że jest mniej odpowiednie do budowania „nie-CMS-owych” aplikacji (cokolwiek to znaczy!).

source: How can I download the Django documentation to read it offline?
el: Πως μπορώ να κατεβάσω το Django documentation για να το διαβάζω εκτός δικτύου;
id: Bagaimana dapat Saya mengunduh dokumentasi Django untuk membacanya tanpa jaringan?
it: Come posso scaricare la documentazione di Django così da averla disponibile senza accesso a internet?
pl: Jak mogę pobrać dokumentację Django, aby czytać ją offline?

source: The Django docs are available in the ``docs`` directory of each Django tarball release. These docs are in reST (reStructuredText) format, and each text file corresponds to a web page on the official Django site.
pl: Dokumentacja Django jest dostępna w katalogu ``docs`` każdego wydania Django w archiwum tara. Ta dokumentacja jest w formacie reST (reStructuredText) i każdy plik tekstowy odpowiada stronie w oficjalnej witrynie Django.

source: Because the documentation is :source:`stored in revision control <docs>`, you can browse documentation changes just like you can browse code changes.
it: Dal momento che la documentazione viene tenuta in un sistema di versionamento, puoi controllare i cambiamenti e sfogliarla come puoi farlo con i cambiamenti di un codice sorgente.
pl: Jako że dokumentacja jest :source:`przechowywana w kontroli wersji <docs>`, możesz przeglądać zmiany dokumentacji tak samo jak zmiany w kodzie.

source: Technically, the docs on Django's site are generated from the latest development versions of those reST documents, so the docs on the Django site may offer more information than the docs that come with the latest Django release.
el: Τεχνικώς, τα docs της ιστοσελίδας του Django παράγονται από τις τελευταίες development εκδόσεις αυτών των reST αρχείων, επομένως τα docs στο revision control προσφέρουν περισσότερη πληροφορία από αυτή που έρχεται με την τελευταία διανομή του Django.
id: Secara teknis, dokumen pada situs Django dibangkitkan dari versi pengembangan terakhir dari dokumen reST itu, jadi dokumen pada situs Django mungkin menawarkan informasi lebih daripada dokumen yang datang dengan terbitan Django terakhir.
it: Tecnicamente, i documenti nel sito di Django sono generati dalle ultime versioni di sviluppo di quei documenti reST, perciò i documenti nel sito di Django possono avere più informazione dei documenti che accompagnano l'ultimo rilascio di Django.
pl: Technicznie rzecz biorąc, dokumentacja na stronie Django jest generowana z ostatnich wersji rozwojowych tych dokumentów reST, więc dokumentacja na stronach Django może oferować więcej informacji niż dokumentacja, która jest załączona do najnowszego wydania Django.

source: How do I cite Django?
el: Πως μπορώ να αναφερθώ στο Django;
id: Bagaimana Saya mengutip Django?
it: Come posso citare Django?
pl: Jak mogę cytować Django?

source: It's difficult to give an official citation format, for two reasons: citation formats can vary wildly between publications, and citation standards for software are still a matter of some debate.
el: Είναι δύσκολο να δώσουμε μία επίσημη μορφή αναφοράς για δύο λόγους: οι μορφές αναφοράς διαφέρουν σημαντικά ανάμεσα σε εκδόσεις και τα στάνταρντ των αναφορών για το λογισμικό είναι ακόμη υπό διαπραγμάτευση.
id: Sangatlah sulit memberikan bentuk kutipan resmi, untuk dua alasan: bentuk kutipan dapat beragam liar diantara pengumuman, dan standar kutipan untuk perangkat lunak masih masalah dari beberapa perdebatan.
it: E' difficile dare un formato ufficiale per le citazioni, per due motivi: i formati per le citazioni possono variare largamente tra le pubblicazioni, e gli standard per le citazioni del software sono ancora materia di dibattito.
pl: Trudno jest podać oficjalny format cytowania z dwóch powodów: formaty cytowań mogą różnić się ogromnie między publikacjami, oraz standardy cytowania oprogramowania wciąż są przedmiotem pewnej debaty.

source: For example, `APA style`_, would dictate something like:
pl: Na przykład `styl APA`_, narzuciłby coś takiego:

source: However, the only true guide is what your publisher will accept, so get a copy of those guidelines and fill in the gaps as best you can.
el: Ωστόσο, ο μόνος αληθινός οδηγός είναι αυτό που θα αποδεχόταν ο εκδότης σας. Οπότε, δημιουργήστε ένα αντίγραφο από αυτές τις κατευθυντήριες γραμμές και γεμίστε τα κενά στο μέγιστο των δυνατοτήτων σας.
id: Bagaimanapun, panduan sebenarnya adalah apa yang penerbit anda akan terima, jadi dapatkan salinan dari panduan tersebut dan isi jarak sebaik anda bisa.
it: Comunque, l'unica vera linea guida è ciò che sarà accettato dal tuo editore, quindi prendi una copia delle sue linee guida e riempi le mancanze come meglio puoi.
pl: Jedynym prawdziwym przewodnikiem jest to, co zaakceptuje twój wydawca. Zdobądź więc kopię wskazówek wydawcy i wypełnij puste pola najlepiej jak możesz.

source: If your referencing style guide requires a publisher name, use "Django Software Foundation".
el: Αν ο οδηγός του στυλ αναφοράς σας απαιτεί όνομα εκδότη, τότε χρησιμοποιήστε το "Django Software Foundation".
id: Jika panduan gaya pemberian petunjuk anda membutuhkan sebuah nama penerbit, gunakan "Django Software Foundation".
it: Se le linee guida cui fai riferimento richiedono il nome dell'editore, usa "Django Software Foundation".
pl: Jeśli wskazówki stylu cytowań wymagają nazwy wydawcy, użyj „Django Software Foundation”.

source: If you need a publishing location, use "Lawrence, Kansas".
el: Αν χρειάζεστε τοποθεσία έκδοσης, χρησιμοποιήστε την "Lawrence, Kansas".
id: Jika anda butuh tempat penerbitan, gunakan "Lawrence, Kansas".
it: Se hai necessità del luogo della pubblicazione, usa "Lawrence, Kansas".
pl: Jeśli potrzebujesz lokalizacji publikacji, użyj „Lawrence, Kansas”.

source: If you need a web address, use https://www.djangoproject.com/.
it: Se hai bisogno di un indirizzo web, usa https://www.djangoproject.com/.
pl: Jeśli potrzebujesz adresu strony internetowej, użyj https://www.djangoproject.com/.

source: If you need a name, just use "Django", without any tagline.
el: Αν χρειάζεστε όνομα, χρησιμοποιήστε απλά το "Django".
id: Jika anda butuh hanya nama, gunakan "Django", tanpa ucapan apapun.
it: Se hai bisogno di un nome usa "Django", senza nessuno slogan.
pl: Jeśli potrzebujesz nazwy, po prostu użyj „Django” bez żadnego sloganu.

source: If you need a publication date, use the year of release of the version you're referencing (e.g., 2013 for v1.5)
el: Αν χρειάζεστε ημερομηνία έκδοσης, χρησιμοποιήστε το έτος της διανομής της έκδοσης Django που χρησιμοποιείτε (πχ 2016 για την έκδοση v1.10)
id: Jika anda butuh tanggal penerbitan, gunakan tahun terbitan dari versi anda sedang acukan (sebagai contoh, 2013 untuk v1.5)
it: Se ti serve la data di pubblicazione, usa l'anno di rilascio della versione cui fai riferimento (ad esempio, 2013 per v1.5)
pl: Jeśli potrzebujesz daty publikacji, użyj roku wydania wersji do której się odnosisz (np. 2013 dla v1.5)

source: FAQ: Getting Help
el: Συχνές Ερωτήσεις: Λαμβάνοντας βοήθεια
id: FAQ: Mendapatkan Bantuan
it: FAQ: Come ricevere aiuto
pl: Często zadawane pytania: Uzyskiwanie pomocy

source: How do I do X? Why doesn't Y work? Where can I go to get help?
el: Πως κάνω το X; Γιατί το Y δεν δουλεύει; Που να βρω βοήθεια;
id: Bagaimana Saya melakukan X? Mengapa Y tidak bekerja? Dimana Saya mendapatkan bantuan?
it: Come posso fare X? Perchè Y non funziona? Dove posso trovare aiuto?
pl: Jak zrobić X? Dlaczego Y nie działa? Gdzie mogę szukać pomocy?

source: First, please check if your question is answered on the :doc:`FAQ </faq/index>`. Also, search for answers using your favorite search engine, and in `the forum`_.
it: Per prima cosa, controlla se la tua domanda trova risposta in: doc: `FAQ </faq/index>`. Inoltre, cerca le risposte utilizzando il tuo motore di ricerca preferito e nel `forum`_.
pl: Najpierw sprawdź, prosimy, czy odpowiedź na twoje pytanie nie znajduje się w :doc:`Często zadawanych pytaniach </faq/index>`. Poszukaj też odpowiedzi używając ulubionej wyszukiwarki oraz na `forum`_.

source: If you can't find an answer, please take a few minutes to formulate your question well. Explaining the problems you are facing clearly will help others help you. See the StackOverflow guide on `asking good questions`_.
it: Se non riesci a trovare una risposta, dedica qualche minuto a formulare bene la tua domanda. Spiegare chiaramente i problemi che stai affrontando aiuterà gli altri ad aiutarti. Vedi la guida di StackOverflow: `asking good questions`_.
pl: Jeśli nie znajdziesz odpowiedz, poświęć kilka minut, aby dobrze sformułować swoje pytanie. Jasne wyjaśnienie problemu, który cię spotkał, pomoże innym pomóc tobie. Zobacz przewodnik StackOverflow na temat `zadawania dobrych pytań`_.

source: Then, please post it in one of the following channels:
it: Quindi, pubblicalo in uno dei seguenti canali:
pl: Następnie, opublikuj je w jednym z poniższych kanałów:

source: The Django Forum section `"Using Django"`_. This is for web-based discussions.
it: Usate la sezione del forum Django: `"Using Django"`_ per discussioni via web.
pl: Sekcja `„Using Django”`_ forum Django. Do komunikacji w przeglądarce internetowej.

source: The |django-users| mailing list. This is for email-based discussions.
it: Usate la mailing list |django-users| per le discussioni via email.
pl: Lista mailingowa |django-users|. Do rozmowy opartej na wiadomościach e-mail.

source: The `#django IRC channel`_ on the Libera.Chat IRC network. This is for chat-based discussions. If you're new to IRC, see the `Libera.Chat documentation`_ for different ways to connect.
it: Il `canale IRC #django`_ sulla rete IRC Libera.Chat, per le discussioni via chat. Se non conosci IRC, vedi la `documentazine Libera.Chat`_ per conoscere tutti i modi per connetterti.
pl: `Kanał IRC #django`_ w Libera. Sieci czatów IRC. Do rozmowy na czacie. Jeśli nie masz doświadczenia z IRC, sposoby na połączenie znajdziesz w `dokumentacji Libera`_.

source: In all these channels please abide by the `Django Code of Conduct`_. In summary, being friendly and patient, considerate, respectful, and careful in your choice of words.
it: In tutti questi canali segui il `Django Code of Conduct`_. In breve, sii paziente e amichevole, cosciente, rispettoso, e attento nella scelta delle tue parole.
pl: We wszystkich tych kanałach przestrzegaj, prosimy, `Django Code of Conduct`_. W skrócie, bądź przyjazny i cierpliwy, taktowny, rozmawiaj z szacunkiem i uważnie wybieraj słowa.

source: Why hasn't my message appeared on *django-users*?
it: Come mai il mio messaggio non è apparso su *django-users*?
pl: Dlaczego moja wiadomość nie pojawiła się na *django-users*?

source: |django-users| has a lot of subscribers. This is good for the community, as it means many people are available to contribute answers to questions. Unfortunately, it also means that |django-users| is an attractive target for spammers.
el: Η λίστα των |django-users| έχει πολλούς συνδρομητές. Αυτό είναι καλό για την κοινότητα γιατί σημαίνει ότι πολλοί άνθρωποι είναι διαθέσιμοι να συνεισφέρουν με την απάντηση τους σε ερωτήσεις. Από την άλλη μεριά, σημαίνει, επίσης, ότι |django-users| είναι ένας ελκυστικός στόχος για τους spammers.
id: |django-users| mempunyai banyak pelanggan. Ini bagus untuk komunitas, seperti dia berarti banyak orang tersedia untuk membantu jawaban pada pertanyaan. Sayangnya, dia juga berarti bahwa |django-users| adalah sasaran menarik untuk penyepam.
it: |django-users| ha molti iscritti. Ciò è un bene per la comunità, vuol dire che molte persone sono disponibili per contribuire a dare risposte alle tue domande. Sfortunamtamente, significa anche che |django-users| è un obiettivo attraente per gli spammers.
pl: |django-users| ma wielu subskrybentów. To dobrze dla społeczności, jako że znaczy to, że wiele osób jest gotowych udzielać odpowiedzi na pytania. Niestety znaczy to też, że |django-users| jest atrakcyjnym celem dla spamerów.

source: In order to combat the spam problem, when you join the |django-users| mailing list, we manually moderate the first message you send to the list. This means that spammers get caught, but it also means that your first question to the list might take a little longer to get answered. We apologize for any inconvenience that this policy may cause.
el: Για την καταπολέμηση του προβλήματος spam, όταν συμμετέχετε στη mailing list των |django-users|, ελέγχουμε χειροκίνητα το πρώτο μήνυμα το οποίο στείλατε στη λίστα. Αυτό σημαίνει ότι, από τη μια, με αυτό τον τρόπο εντοπίζουμε τους spammers αλλά, από την άλλη, ο χρόνος που θα απαιτηθεί να απαντηθεί η πρώτη σας ερώτηση ίσως διαρκέσει λίγο. Ζητάμε συγνώμη για οποιαδήποτε ταλαιπωρία προκαλεί αυτή η πολιτική.
id: Untuk memberantas masalah spam, ketika anda bergabung daftar penyuratan |django-users|, kami secara manual melerai pesan pertama anda kirim ke daftar. Ini berarti bahwa penyepam tertangkap, tetapi itu juga berarti bahwa pertanyaan pertama anda pada daftar mungkin sedikit lama untuk dijawab. Kami meminta maaf untuk ketidaknyamanan yang disebabkan kebijakan ini.
it: Per combattere il problema dello spam, quando ti iscrivi alla mailing list |django-users|, moderiamo manualmente il primo messaggio che invii alla lista. Questo significa che intercettiamo gli spammers, ma significa anche che la tua prima domanda può impiegare più tempo per ottenere una risposta. Ci scusiamo per ogni inconveniente che questo tipo di comportamento può causare.
pl: Aby walczyć z problemem spamu, kiedy dołączasz do listy mailingowej |django-users|, ręcznie moderujemy pierwszą wiadomość, którą wysyłasz na listę. To znaczy, że spamerzy są wyłapywani, ale to znaczy też, że twoje pierwsze pytanie na listę może poczekać chwilę dłużej, zanim ktoś na nie odpowie. Przepraszamy za niedogodności, które może spowodować ta polityka.

source: Nobody answered my question! What should I do?
it: Nessuno ha risposto alla mia domanda! Cosa dovrei fare ?
pl: Nikt nie odpowiedział na moje pytanie! Co powinienem zrobić?

source: Try making your question more specific, or provide a better example of your problem.
el: Προσπαθήστε να κάνετε την ερώτηση σας πιο συγκεκριμένη ή να δώσετε μια καλύτερη εξήγηση του προβλήματος σας.
id: Coba buat pertanyaan anda lebih jelas, atau sediakan contoh lebih baik dari masalah anda.
it: Prova a rendere la domanda più specifica, o fornisci un esempio migliore del problema.
pl: Spróbuj sprecyzować swoje pytanie, albo podać lepszy przykład swojego problemu.

source: As with most open-source projects, the folks on these channels are volunteers. If nobody has answered your question, it may be because nobody knows the answer, it may be because nobody can understand the question, or it may be that everybody that can help is busy.
it: Come in molti progetti open-source, le persone su questi canali sono volontari. Se nessun ha risposto alla tua domanda, probabilmente nessuna sa la risposta, oppure nessun riesce a capire la tua domanda o sono tutti occupati al momento per poterti aiutare.
pl: Tak jak w większości open-source'owych projektów, ludzie na takich kanałach są wolontariuszami. Jeśli nikt nie odpowiedział na Twoje pytanie, może nikt nie zna odpowiedzi, albo nikt go nie rozumie. A może wszyscy, którzy mogą pomóc, są aktualnie zajęci.

source: You can also try asking on a different channel. But please don't post your question in all three channels in quick succession.
it: Puoi anche provare a chiedere su un canale diverso. Ti prego, non fare domande su tutti e tre i canali in successione ed in tempi ristretti. Puoi anche provare a chiedere su un canale diverso. Ma per favore, non pubblicare la tua domanda in tutti e tre i canali inondandoli.
pl: Możesz spróbować również na innych kanałach. Jednak prosimy o nie publikowanie pytania we wszystkich trzech kanałach w krótkim odstępie czasu.

source: You might notice we have a second mailing list, called |django-developers|. This list is for discussion of the development of Django itself. Please don't email support questions to this mailing list. Asking a tech support question there is considered impolite, and you will likely be directed to ask on |django-users|.
it: Postresti notare che abbiamo una seconda mailing list, chiamata |django-developers|. Questa lista è per discutere dello sviluppo di Django. Per favore non inviare email di aiuto a questa mailing list. Chiedere un supporto tecnico in quella lista, viene considerato maleducato and ti verrà chiesto di spostarti su |django-users|.
pl: Jak mogłeś już zauważyć, posiadamy drugą listę mailingową zwaną |django-developers|. Ta lista służy dyskusjom na temat rozwijania samego Django. Prosimy, nie wysyłaj na nią wiadomości dotyczących wsparcia. Zadanie pytania dotyczącego wsparcia technicznego jest tu uważane za bardzo niegrzeczne i najprawdopodobniej będziesz skierowany by pytać na |django-users|.

source: I think I've found a bug! What should I do?
el: Νομίζω ότι βρήκα ένα bug! Τι να κάνω;
id: Saya pikir saya telah menemukan kesalahan! Apa yang harus Saya lakukan?
it: Penso di aver trovato un bug! Cosa dovrei fare ora?
pl: Chyba znalazłem błąd! Co powinienem zrobić?

source: Detailed instructions on how to handle a potential bug can be found in our :ref:`Guide to contributing to Django <reporting-bugs>`.
el: Υπάρχουν αναλυτικές οδηγίες στην αναφορά :ref:`Οδηγός συνεισφοράς στο Django <reporting-bugs>`, σχετικά με το τι να κάνετε σε περίπτωση που βρήκατε κάποιο bug.
id: Rincian perintah pada bagaimana menangani kesalahan potensial dapat ditemukan di :ref:`Guide to contributing to Django <reporting-bugs>` kami.
it: Istruzioni dettagliate su come gestire un potenziale bug si possono trovare in :ref:`Guide to contributing to Django <reporting-bugs>`.
pl: Szczegółowe instrukcje na temat radzenia sobie z potencjalnym błędem możesz znaleźć w naszym :ref:`Poradniku współtworzenia Django <reporting-bugs>`.

source: I think I've found a security problem! What should I do?
el: Νομίζω ότι βρήκα ένα πρόβλημα σχετικά με την ασφάλεια! Τι να κάνω;
id: Saya pikir saya telah menemukan masalah keamanan! Apa yang harus Saya lakukan?
it: Penso di aver trovato un problema di sicurezza! Cosa dovrei fare ora?
pl: Chyba znalazłem problem bezpieczeństwa! Co powinienem zrobić?

source: If you think you've found a security problem with Django, please send a message to security@djangoproject.com. This is a private list only open to long-time, highly trusted Django developers, and its archives are not publicly readable.
el: Αν νομίζετε ότι βρήκατε ένα πρόβλημα που να αφορά την ασφάλεια του Django, παρακαλούμε στείλτε ένα μήνυμα στο security@djangoproject.com. Αυτή είναι μια ιδιωτική λίστα η οποία είναι ανοιχτή μόνο σε μακροχρόνιους και έμπιστους Django developers και τα αρχεία της δεν είναι διαθέσιμα δημοσίως.
id: Jika anda berpikir anda telah menemukan sebuah masalah keamanan dengan Django, silahkan kirim sebuah pesan ke security@djangoproject.com. Ini adalah daftar pribadi hanya dibuka untuk waktu-panjang, sangat dipercaya pengembang Django, dan arsipnya tidak dibaca secara umum.
it: Se pensi di avere trovato un problema di sicurezza con Django, invia un messaggio a security@djangoproject.com. Questa è una lista privata, aperta solo a sviluppatori noti da lungo tempo e altamente attendibili, e i suoi archivi non sono consultabili pubblicamente..
pl: Jeśli uważasz, że znalazłeś błąd bezpieczeństwa w Django, wyślij wiadomość na security@djangoproject.com. To prywatna lista otwarta tylko dla godnych zaufania programistów związanych z Django od długiego czasu, a jej archiwa nie są dostępne publicznie.
