Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: Whatever the reason, please keep in mind that while you may hit a particular bug regularly, it doesn't necessarily follow that every single Django user will hit the same bug. Different users use Django in different ways, stressing different parts of the code under different conditions. When we evaluate the relative priorities, we are generally trying to consider the needs of the entire community, not just the severity for one particular user. This doesn't mean that we think your problem is unimportant -- just that in the limited time we have available, we will always err on the side of making 10 people happy rather than making 1 person happy.
el: Οποιοσδήποτε και αν είναι ο λόγος, παρακαλούμε έχετε υπόψιν σας ότι αν κάποιο συγκεκριμένο bug, εμφανίζεται συχνά στον κώδικα σας, αυτό δεν σημαίνει ότι εμφανίζεται και σε όλους τους άλλους Django χρήστες. Διαφορετικοί χρήστες χρησιμοποιούν το Django με διαφορετικούς τρόπους και υπό διαφορετικές συνθήκες. Όταν αξιοποιούμε τις σχετικές προτεραιότητες, προσπαθούμε, γενικά, να εξετάσουμε τις ανάγκες του συνόλου της κοινότητας και όχι αυστηρά κάποιον συγκεκριμένο χρήστη. Αυτό δεν σημαίνει ότι το πρόβλημα σας είναι ασήμαντο -- αλλά ότι στον ήδη περιορισμένο χρόνο που έχουμε, θα βάλουμε τα δυνατά μας να κάνουμε 10 ανθρώπους χαρούμενους παρά έναν.
id: Apapun alasannya, harap diingat bahwa selama anda mungkin menemukan kesalahan tertentu secara teratur, itu tidak selalu mengikuti setiap bahwa setiap pengguna Django tunggal akan menemukan kesalahan yang sama. Pengguna berbeda menggunakan Django dalam cara berbeda, menekankan bagian berbeda dari kode dibawah kondisi berbeda. ketika kami menilai prioritas relatif, kami umumnya mencoba menganggap kebutuhan dari komunitas keseluruhan, bukan hanya satu pengguna khusus. Ini tidak berarti bahwa kami pikir masalah anda tidak penting -- hanya saja terbatas waktu yang kami punya, kami akan selalu berbuat salah di sisi membuat 10 orang senang daripada membuat 1 orang senang.

source: At the end of the day, of course, it comes down to getting stuff done. And, regardless of how things are named, Django gets stuff done in a way that's most logical to us.
el: Τελικώς, το μόνο που μετράει είναι να γίνει η δουλειά. Ανεξαρτήτως το πως ονομάζονται τα πράγματα, το Django κάνει τη δουλειά με τέτοιο τρόπο που είναι ο πιο λογικός σε εμάς.
id: Pada akhir hari, tentu saja, dia datang untuk mendapatkan barang selesai. Dan, tanpa memperhatikan bagaimana hal-hal dinamai, Django mendapatkan barang selesai di cara yang paling masuk akal bagi kami.

source: Of course, Django's automatic admin site is fantastic and timesaving -- but the admin site is one module of Django the framework. Furthermore, although Django has special conveniences for building "CMS-y" apps, that doesn't mean it's not just as appropriate for building "non-CMS-y" apps (whatever that means!).
el: Φυσικά, το αυτοματοποιημένο admin site του Django είναι φανταστικό και σας γλυτώνει από απίστευτο χρόνο – αλλά το admin site είναι ένα module του Django framework. Επιπροσθέτως, παρόλο που το Django έχει ιδιαίτερες ανέσεις για να χτίζει κανείς εφαρμογές που θυμίζουν "CMS", αυτό δε σημαίνει ότι δεν μπορεί να χρησιμοποιηθεί για εφαρμογές που δεν θυμίζουν "CMS" (οτιδήποτε και αν σημαίνει αυτό!).
id: Tentu saja, situs admin otomatis Django hebat dan menghemat waktu -- tetapi situs admin adalah satu modul dari kerangka kerja Django. Lebih lanjut, meskipun Django mempunyai kemudahan khusus untuk membangun aplikasi "CMS-y", yang tidak berarti dia tidak hanya sewajarnya untuk membangun aplikasi "non-CMS-y" (apapun artinya itu!).

source: Because the documentation is `stored in revision control`_, you can browse documentation changes just like you can browse code changes.
el: Επειδή το documentation `είναι αποθηκευμένο σε revision control <https://github.com/django/django/tree/master/docs/>`_, μπορείτε να περιηγηθείτε στις αλλαγές που γίνονται στο documentation όπως ακριβώς συμβαίνει και με τις αλλαγές που γίνονται στον κώδικα.
id: Karena dokumentasi `disimpan di kendali pembetulan`_, anda dapat menjelajahi perubahan dokumentasi seperti anda dapat menjelajahi perubahan kode.

source: If you need a web address, use https://djangoproject.com.
el: Αν χρειάζεστε τοποθεσία ιστοσελίδας, χρησιμοποιήστε την https://djangoproject.com.
id: Jika anda butuh alamat jaringan, gunakan https://djangoproject.com.

source: If this FAQ doesn't contain an answer to your question, you might want to try the |django-users| mailing list. Feel free to ask any question related to installing, using, or debugging Django.
el: Αν αυτές οι συχνές ερωτήσεις δεν περιέχουν την απάντηση στην ερώτηση σας, μπορείτε να προσπαθήσετε στην mailing list των |django-users|. Εκεί μπορείτε να ρωτήσετε σχετικά με την εγκατάσταση, χρησιμοποίηση ή αποσφαλμάτωση (debugging) του Django.
id: Jika FAQ ini tidak mengandung sebuah jawaban pada pertanyaan anda, anda mungkin ingin mencoba daftar penyuratan |django-users|. Silahkan bebas bertanya pertanyaan apapun terhubung ke pemasangan, penggunaan, atau mencari kesalahan Django.

source: If you prefer IRC, the `#django IRC channel`_ on the Freenode IRC network is an active community of helpful individuals who may be able to solve your problem.
el: Αν προτιμάτε το IRC, το κανάλι `#django IRC channel`_ στο δίκτυο Freenode IRC αποτελείται από μια ενεργή κοινότητα με εξυπηρετικούς ανθρώπους οι οποίοι μπορεί να λύσουν το πρόβλημα σας.
id: Jika anda memilih IRC, `#django IRC channel`_ di jaringan Freenode IRC adalah komunitas aktif dari pribadi yang sangat membantu mungkin dapat mengatasi masalah anda.

source: Why hasn't my message appeared on `django-users`?
el: Γιατί το μήνυμα μου δεν εμφανίστηκε στους `django-users`;
id: Mengapa pesan saya belum muncul di `django-users`?

source: Nobody on `django-users` answered my question! What should I do?
el: Κανείς ανάμεσα στους `django-users` δεν απάντησε την ερώτηση μου! Τι κάνω τώρα;
id: Tidak seorangpun di `django-users` menjawab pertanyaan saya! Apa harus Saya lakukan?

source: As with most open-source mailing lists, the folks on |django-users| are volunteers. If nobody has answered your question, it may be because nobody knows the answer, it may be because nobody can understand the question, or it may be that everybody that can help is busy. One thing you might try is to ask the question on IRC -- visit the `#django IRC channel`_ on the Freenode IRC network.
el: Όπως με τις περισσότερες ανοικτού λογισμικού mailing lists, οι |django-users| είναι εθελοντές. Αν κανείς δεν έχει απαντήσει στην ερώτηση σας είναι ίσως επειδή κανείς δεν ξέρει την απάντηση ή κανείς δε μπορεί να καταλάβει την ερώτηση σας ή ακόμη γιατί όσοι μπορούν να βοηθήσουν είναι απασχολημένοι. Μπορείτε, εναλλακτικά, να δοκιμάσετε να ρωτήσετε στο IRC -- επισκεφτείτε το `#django IRC channel`_ στο δίκτυο Freenode IRC.
id: Seperti kebanyakan daftar penyuratan sumber-terbuka, orang-orang di |django-users| adalah sukarelawan. Jika tidak seorangpun menjawab pertanyaan anda, itu mungkin karena tidak seorangpun tahu jawabannya, itu mungkin tidak seorangpun dapat mengerti pertanyaannya, atau itu mungkin semua orang yang dapat membantu sedang sibuk. Satu hal anda mungkin coba adalah untuk menanyakan pertanyaan pada IRC -- kunjungi `#django IRC channel`_ pada jaringan Freenode IRC.

source: You might notice we have a second mailing list, called |django-developers| -- but please don't email support questions to this mailing list. This list is for discussion of the development of Django itself. Asking a tech support question there is considered quite impolite.
el: Ίσως να παρατηρήσατε ότι έχουμε μια δεύτερη mailing list, με το όνομα |django-developers|. Παρακαλούμε να μη στέλνετε ερωτήσεις υποστήριξης σε αυτή τη mailing list. Αυτή η λίστα είναι για συζητήσεις σχετικά με την ανάπτυξη του ίδιου του Django. Ρωτώντας μια τεχνικής φύσεως ερώτηση εκεί θα θεωρηθεί αρκετά αγενές.
id: Anda mungkin menyadari kami mempunyai daftar penyuratan kedua, dipanggil |django-developers| -- tetapi silahkan jangan surel pertanyaan dukungan ke daftar penyuratan ini. Daftar ini untuk obrolan dari pengembangan Django itu sendiri. Bertanya pertanyaan dukungan teknis dianggap sangat tidak sopan.

source: Due to the sensitive nature of security issues, we ask that if you think you have found a security problem, *please* don't send a message to one of the public mailing lists. Django has a :ref:`policy for handling security issues <reporting-security-issues>`; while a defect is outstanding, we would like to minimize any damage that could be inflicted through public knowledge of that defect.
el: Λόγω της ευαίσθητης φύσεως των θεμάτων ασφαλείας, σε περίπτωση που βρήκατε κάποιο πρόβλημα ασφαλείας, *παρακαλούμε* μη στείλετε μήνυμα σε μια από τις δημόσιες mailing lists. Το Django ακολουθεί μια :ref:`πολιτική για τον χειρισμό θεμάτων ασφαλείας <reporting-security-issues>`. Όσο κάποιο πρόβλημα παραμένει ανεπίλυτο, θα θέλαμε να ελαχιστοποιήσουμε τυχόν ζημιά που θα επιφέρει στο ευρύ κοινό, αν ανακοινωθεί δημοσίως.
id: Karena sifat sensitif dari masalah-masalah keamanan, kami menanyakan bahwa jika anda pikir anda telah menemukan sebuah masalah keamanan, *harap* jangan mengirim pesan ke satu dari daftar penyuratan umum. Django mempunyai :ref:`policy for handling security issues <reporting-security-issues>`; selagi kekurangan belum terselesaikan, kami akan meminimalkan kerusakan apapun yang dapat ditimbulkan melalui pengetahuan umum dari kerusakan tersebut.

source: Django requires Python. See the table in the next question for the versions of Python that work with each version of Django. Other Python libraries may be required for some uses, but you'll receive an error about it as they're needed.
el: Τα Django χρειάζεται την γλώσσα προγραμματισμού Python. Δείτε τον πίνακα στην επόμενη ερώτηση για το ποιες εκδόσεις της Python είναι συμβατές με τις διάφορες εκδόσεις του Django. Άλλες Python βιβλιοθήκες ίσως χρειαστούν για συγκεκριμένες περιπτώσεις αλλά θα λάβετε σχετικό μήνυμα λάθους όταν θα χρειαστούν και δεν τις έχετε εγκατεστειμένες.
id: Django mewajibkan Python. Lihat tabel di pertanyaan selanjutnya untuk versi dari Python yang bekerja dengan setiap versi dari Django. Pustaka Python lainnya mungkin dibutuhkan untuk beberapa pengguna, tetapi anda akan menerima sebuah kesalahan tentangnya sesuai kebutuhan mereka.

source: For a development environment -- if you just want to experiment with Django -- you don't need to have a separate Web server installed; Django comes with its own lightweight development server. For a production environment, Django follows the WSGI spec, :pep:`3333`, which means it can run on a variety of server platforms. See :doc:`Deploying Django </howto/deployment/index>` for some popular alternatives.
el: Σε αναπτυξιακά περιβάλλοντα -- αν θέλετε να πειραματιστείτε με το Django -- δεν χρειάζεται να έχετε κάποιον ξεχωριστό Web server εγκατεστημένο. Το Django έχει προεγκατεστημένο έναν ελαφρύ αναπτυξιακό server. Για παραγωγικά περιβάλλοντα (production environments), το Django ακολουθεί την προδιαγραφή WSGI :pep:`3333`, που σημαίνει ότι μπορεί να τρέξει σε μια πληθώρα server. Δείτε το άρθρο :doc:`Deploying Django </howto/deployment/index>` για μερικές δημοφιλής εναλλακτικές.
id: Untuk lingkungan pengembangan -- jika anda hanya ingin mencoba dengan Django -- anda tidak ingin mempunyai peladen Jaringan terpisah dipasang; Django datang dengan peladen pengembangan ringan sendiri. Untuk lingkungan produksi, Django mengikuti spesifikasi WSGI, :pep:`3333`, yang berarti dia dapat berjalan pada beragam serambi paladen. Lihat :doc:`Deploying Django </howto/deployment/index>` untuk beberapa cara lain terkenal.

source: If you want to use Django with a database, which is probably the case, you'll also need a database engine. PostgreSQL_ is recommended, because we're PostgreSQL fans, and MySQL_, `SQLite 3`_, and Oracle_ are also supported.
el: Αν θέλετε να χρησιμοποιήσετε το Django παρέα με κάποια βάση δεδομένων, που είναι και το πιο πιθανό, θα χρειαστείτε, επίσης, και την αντίστοιχη μηχανή της βάσης δεδομένων (database engine) που θα χρησιμοποιήσετε. Προτείνεται η PostgreSQL_, καθώς είμαστε φαν αυτής αλλά υποστηρίζονται, επίσης και οι MySQL_, `SQLite 3`_ και η Oracle_.
id: Jika anda ingin menggunakan Django dengan basisdata, yang kemungkinan terjadi, anda akan juga butuh mesin basisdata. PostgreSQL_ dianjurkan, karena kami penggemar PostgreSQL, dan MySQL_, `SQLite 3`_, dan Oracle_ juga didukung.

source: 2.7, 3.2 (until the end of 2016), 3.3, 3.4, 3.5
el: 2.7, 3.2 (μέχρι τέλος του 2016), 3.3, 3.4, 3.5
id: 2.7, 3.2 (sampai akhir 2016), 3.3, 3.4, 3.5

source: Typically, we will support a Python version up to and including the first Django LTS release whose security support ends after security support for that version of Python ends. For example, Python 3.3 security support ends September 2017 and Django 1.8 LTS security support ends April 2018. Therefore Django 1.8 is the last version to support Python 3.3.
el: Τυπικά, θα υποστηρίξουμε όποια έκδοση της Python της οποίας η υποστήριξη ασφάλειας λήγει πριν την διανομή του Django LTS (Long Time Support) του οποίου η υποστήριξη ασφάλειας λήγει μετά από αυτή της Python. Ας δούμε ένα παράδειγμα, η υποστήριξη σχετικά με θέματα ασφαλείας της Python 3.3 λήγει τον Σεπτέμβριο του 2017 και η υποστήριξη σχετικά με θέματα ασφαλείας του Django 1.8 LTS λήγει τον Απρίλιο του 2018. Επομένωνς, το Django 1.8 είναι η τελευταία έκδοση Django που θα υποστηρίξει την Python 3.3.
id: Secara khusus, kami akan mendukung versi Phyton sampai dan termasuk terbitan LTS Django pertama yang dukungan keamanan berakhir setelah dukungan keamanan untuk versi tersebut dari Phyton berakhir. Sebagai contoh, dukungan keamanan Python 3.3 berakhir September 2017 dan dukungan keamanan Django 1.8 LTS berakhir April 2018. Karena itu Django 1.8 adalah versi terakhir untuk mendukung Phyton 3.3.

source: As of Django 1.6, Python 3 support is considered stable and you can safely use it in production. See also :doc:`/topics/python3`. However, the community is still in the process of migrating third-party packages and applications to Python 3.
id: Sebagai Django 1.6, dukungan Python 3 dipertimbangkan stabil dan anda dapat aman menggunakannya dalam produksi. Lihat juga :doc:`/topics/python3`. Bagaimanapun, komunitas masih dalam proses dari memindahkan paket pihak-ketiga dan aplikasi ke Python 3.

source: If you're starting a new project, and the dependencies you plan to use work on Python 3, you should use Python 3. If they don't, consider contributing to the porting efforts, or stick to Python 2.
id: Jika anda sedang memulai proyek baru, dan ketergantungan anda berencana menggunakan bekerja pada Python 3, anda harus menggunakan Python 3. Jika mereka tidak, pertimbangkan membantu usaha penghubungan, atau melekatkan ke Python 2.

source: Since newer versions of Python are often faster, have more features, and are better supported, all else being equal, we recommend that you use the latest 2.x.y or 3.x.y release.
id: Sejak versi terbaru dari Python sering tercepat, mempunyai fitur lebih, dan dukungan terbaik, semua menjadi sama, kami menganjurkan bahwa anda menggunakan terbitan 2.x.y atau 3.x.y terakhir.

source: You don't lose anything in Django by using an older release, but you don't take advantage of the improvements and optimizations in newer Python releases. Third-party applications for use with Django are, of course, free to set their own version requirements.
el: Δεν χάνετε τίποτα χρησιμοποιώντας μια παλαιότερη έκδοση της Python στο Django, αλλά δεν επωφελείστε των βελτιώσεων και των νέων χαρακτηριστικών στην τελευταία έκδοση της Python. Οι εφαρμογές τρίτων οι οποίες δουλεύουν με το Django είναι, φυσικά, ελεύθερες να θέσουν τις δικές τους απαιτήσεις σχετικά με το ποιες εκδόσεις της Python ή όχι υποστηρίζουν.
id: Anda tidak kehilangan apapun di Django dengan menggunakan sebuah terbitan lama, tetapi anda tidak dapat mengambil keuntungan dari perbaikan dan optimalisasi di terbitan Python terbaru. Aplikasi pihak-ketiga untuk digunakan dengan Django, tentu saja, bebas menyetel persyaratan versi mereka sendiri.

source: Make sure your Django :setting:`DEBUG` setting is set to ``True``. Then, just do this::
el: Σιγουρευτείτε ότι η ρύθμιση του Django :setting:`DEBUG` είναι ``True``. Έπειτα, τρέξτε την εντολή `python manage.py shell` και γράψτε::
id: Pastikan pengaturan :setting:`DEBUG` Django anda disetel ke ``True``. Lalu, lakukan ini::

source: If you need to clear the query list manually at any point in your functions, just call ``reset_queries()``, like this::
el: Αν χρειαστεί να αδειάσετε χειροκίνητα τη λίστα με τα ερωτήματα δεν έχετε παρά να καλέσετε τη συνάρτηση ``reset_queries()``, ως εξής::
id: Jika anda butuh membersihkan daftar permintaan secara manual pada titik manapun di fungsi anda, cukup panggil ``reset_queries()``, seperti ini::

source: But this isn't an issue in practice, because there's nothing stopping you from adding other constraints (using the ``unique_together`` model option or creating the constraint directly in your database), and enforcing the uniqueness at that level. Single-column primary keys are needed for things such as the admin interface to work; e.g., you need a simple way of being able to specify an object to edit or delete.
el: Αλλά αυτό δεν αποτελεί σοβαρό θέμα στη πράξη, επειδή κανείς δε θα σας εμποδίσει από το να προσθέσετε και άλλα constraints (χρησιμοποιώντας την επιλογή του μοντέλου ``unique_together`` ή δημιουργώντας ένα constraint απ’ ευθείας στη βάση δεδομένων), ενισχύοντας στην ουσία την μοναδικότητα σε αυτό το επίπεδο. Τα μοναδικής-στήλης primary keys χρειάζονται για να δουλέψει το admin interface του Django, π.χ χρειάζεστε έναν απλό τρόπο προκειμένου να καθορίσετε ένα object για να το επεξεργαστείτε ή να το διαγράψετε.
id: Tetapi ini bukan sebuah masalah dalam praktiknya, karena tidak ada yang menghentikan anda dari menambahkan pembatas (menggunakan pilihan model ``unique_together`` atau membuat pembatas secara langsung dalam basisdata anda), dan memaksa keunikan pada tingkatan itu. Primary-key kolom tunggal dibutuhkan untuk hal-hal seperti antarmuka admin untuk bekerja; sebagai contoh, anda butuh jalan mudah dari dapat menentukan sebuah obyek untuk disunting atau dihapus.

source: NoSQL databases are not officially supported by Django itself. There are, however, a number of side project and forks which allow NoSQL functionality in Django, like `Django non-rel`_.
el: Οι βάσεις δεδομένων NoSQL δεν υποστηρίζονται επισήμως από το ίδιο το Django. Υπάρχουν, ωστόσο, αρκετά projects τρίτων όπως και forks τα οποία επιτρέπουν τη λειτουργία NoSQL με το Django, όπως είναι το `Django non-rel`_.
id: Basisdata NoSQL tidak secara resmi didukung oleh Django itu sendiri. Ada, bagaimanapun, sejumlah proyek samping dan cabang yang mengizinkan fungsi NoSQL di Django, seperti `Django non-rel`_.

source: You can also take a look on `the wiki page`_ which discusses some alternatives.
el: Μπορείτε, επίσης, να ρίξετε μια ματιά στη `σελίδα του wiki <https://code.djangoproject.com/wiki/NoSqlSupport>`_ η οποία συζητά μερικές εναλλακτικές λύσεις.
id: Anda dapat juga melihat di `halaman wiki`_ yang mengobrolkan beberapa alternatif.

source: :doc:`django-admin </ref/django-admin>` should be on your system path if you installed Django via ``python setup.py``. If it's not on your path, you can find it in ``site-packages/django/bin``, where ``site-packages`` is a directory within your Python installation. Consider symlinking to :doc:`django-admin </ref/django-admin>` from some place on your path, such as :file:`/usr/local/bin`.
el: Η εντολή :doc:`django-admin </ref/django-admin>` θα πρέπει να βρίσκεται στο system path του υπολογιστή σας, αν έχετε εγκαταστήσει το Django μέσω της εντολής ``python setup.py``. Αν δεν βρίσκεται στο system path, τότε μπορείτε να το βρείτε στο φάκελο ``site-packages/django/bin``, όπου το ``site-packages`` είναι ένας φάκελος μέσα στον φάκελο εγκατάστασης της Python. Δοκιμάστε να κάνετε symlink το :doc:`django-admin </ref/django-admin>` από κάποιο σημείο που βρίσκεται ήδη στο path σας, όπως είναι το :file:`/usr/local/bin`.
id: :doc:`django-admin </ref/django-admin>` harus di jalur sistem anda jika anda memasang Django melalui ``python setup.py``. Jika itu tidak di jalur anda, anda dapat menemukannya di ``site-packages/django/bin``, dimana ``site-packages`` adalah direktori didalam pemasangan Python anda. Pertimbangkan tautan simbolis pada :doc:`django-admin </ref/django-admin>` dari beberapa tempat di jalur anda, seperti :file:`/usr/local/bin`.

source: If ``django-admin`` doesn't work but ``django-admin.py`` does, you're probably using a version of Django that doesn't match the version of this documentation. ``django-admin`` is new in Django 1.7.
el: Αν το ``django-admin`` δε δουλεύει αλλά το ``django-admin.py`` δουλεύει, τότε ίσως χρησιμοποιείτε μια έκδοση του Django η οποία δεν ταιριάζει με το παρών documentation. Το ``django-admin`` είναι καινούργιο στο Django 1.7.
id: Jika ``django-admin`` tidak bekerja tetapi ``django-admin.py`` bekerja, anda mungkin menggunakan versi Django yang tidak cocok versi dari dokumentasi ini. ``django-admin`` adalah baru di Django 1.7.

source: You created raw bytestrings, which is easy to do on Python 2::
id: Anda membuat bytestring mentah, yang mudah melakukannya pada Python 2::

source: Either use the ``u''`` prefix or even better, add the ``from __future__ import unicode_literals`` line at the top of your file so that your code will be compatible with Python 3.2 which doesn't support the ``u''`` prefix.
id: Salah satu gunakan awalan ``u''`` atau bahkan lebih baik, tambahkan baris ``from __future__ import unicode_literals`` pada atas dari berkas anda sehingga kode anda akan menjadi cocok dengan Python 3.2 yang tidak mendukung awalan ``u''``.

source: Why do I get an error about importing DJANGO_SETTINGS_MODULE?
el: Γιατί λαμβάνω σφάλμα σχετικά με το import του DJANGO_SETTINGS_MODULE;
id: Kenapa saya mendapatkan kesalahan tentang mengimpor DJANGO_SETTINGS_MODULE?

source: The environment variable DJANGO_SETTINGS_MODULE is set to a fully-qualified Python module (i.e. "mysite.settings").
el: Η environment variable DJANGO_SETTINGS_MODULE είναι ρυθμισμένη ως ένα Python module (π.χ "mysite.settings") και όχι ως π.χ "mysite/settings/".
id: Variabel lingkungan DJANGO_SETTINGS_MODULE disetel ke modul Phyton sepenuhnya-berkualitas (yaitu "mysite.settings").

source: The module doesn't contain syntax errors (of course).
el: Το module δεν περιέχει συντακτικά λάθη (βεβαίως).
id: Modul tidak mengandung kesalahan sintaks (tentu saja).

source: Sometimes your templates just all need the same thing. A common example would be dynamically-generated menus. At first glance, it seems logical to simply add a common dictionary to the template context.
el: Μερικές φορές τα templates σας χρειάζονται τα ίδια πράγματα. Ένα συνηθισμένο παράδειγμα είναι τα δυναμικά παραγόμενα μενού. Στην αρχή, μπορεί να φανεί λογικό να προσθέσετε ένα κοινό dictionary στο template context.
id: Terkadang cetakan anda hanya semua butuh hal sama. Sebuah contoh umum akan membangkitkan-dinamis menu. Pada pandangan pertama, kelihatannya logis untuk menambah kamus umum ke cetakan konteks.

source: The correct solution is to use a ``RequestContext``. Details on how to do this are here: :ref:`subclassing-context-requestcontext`.
el: Η σωστή λύση είναι να χρησιμοποιήσετε ένα ``RequestContext``. Λεπτομέρειες στο πως να το χρησιμοποιήσετε μπορείτε να βρείτε στην αναφορά :ref:`κάνοντας subclassing to context <subclassing-context-requestcontext>`.
id: Pemecahan benar adalah menggunakan ``RequestContext``. Rincian pada bagaimana melakukan ini adalah disini: :ref:`subclassing-context-requestcontext`.
