Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: FAQ: The admin
el: Συχνές Ερωτήσεις: Το admin site
id: FAQ: Admin
it: FAQ: Amministrazione
pl: Często zadawane pytania: Panel administracyjny

source: I can't log in. When I enter a valid username and password, it just brings up the login page again, with no error messages.
el: Δε μπορώ να συνδεθώ. Όταν εισάγω τα σωστά username και password, επαναφορτώνεται η ίδια login σελίδα, χωρίς μηνύματα σφάλματος.
id: Saya tidak dapat masuk. Ketika saya memasukkan nama pengguna dan sandi yang valid, saya dibawa ke halaman masuk kembali, tanpa pesan kesalahan.
it: Non riesco ad accedere. Quando inserisco un nome utente e una password validi, viene visualizzata nuovamente la pagina di accesso, senza messaggi di errore.
pl: Nie mogę się zalogować. Kiedy wprowadzam poprawne nazwę użytkownika i hasło, pokazuje się tylko znów strona logowania, bez powiadomień o błędzie.

source: The login cookie isn't being set correctly, because the domain of the cookie sent out by Django doesn't match the domain in your browser. Try setting the :setting:`SESSION_COOKIE_DOMAIN` setting to match your domain. For example, if you're going to "https://www.example.com/admin/" in your browser, set ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.
el: Το cookie που αφορά το login δεν έχει σεταριστεί σωστά, επειδή το domain του cookie που έστειλε το Django δεν ταιριάζει με το domain στον browser σας. Δοκιμάστε να θέσετε τη ρύθμιση :setting:`SESSION_COOKIE_DOMAIN` μέσα στο γενικό αρχείο ρυθμίσεων ούτως ώστε να ταιριάζει με το domain σας. Για παράδειγμα, αν επισκέπτεστε τη σελίδα "https://www.example.com/admin/" με τον browser, τότε στο γενικό αρχείο ρυθμίσεων του project σας, "myproject.settings", θα θέσετε τη ρύθμιση :setting:`SESSION_COOKIE_DOMAIN` = 'www.example.com'.
id: Kue masuk tidak disetel dengan benar, karena ranah dari kue dikirim oleh Django tidak cocok ranah di perambah anda. Coba mengatur pengaturan :setting:`SESSION_COOKIE_DOMAIN` untuk mencocokkan ranah anda. Sebagai contoh, jika anda akan ke "https://www.example.com/admin/" di perambah anda, setel ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.
it: Il cookie di login non è settato correttamente perchè il dominio del cookie generato da Django non corrisponde con il dominio nel tuo browser. Prova ad impostare l'opzione :setting:`SESSION_COOKIE_DOMAIN` corrispondente al tuo dominio. Per esempio, se stai andando a "https://www.example.com/admin/" nel tuo browser, imposta ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.
pl: Ciasteczko logowania nie jest ustawiane poprawnie, ponieważ domena ciasteczka wysyłana przez Django nie pasuje do domeny w twojej przeglądarce. Spróbuj zmienić ustawienie :setting:`SESSION_COOKIE_DOMAIN`, aby zgadzało się z twoją domeną. Na przykład jeśli używasz adresu "https://www.example.com/admin/" w swojej przeglądarce, ustaw ``SESSION_COOKIE_DOMAIN = 'www.example.com'``.

source: I can't log in. When I enter a valid username and password, it brings up the login page again, with a "Please enter a correct username and password" error.
el: Δε μπορώ να συνδεθώ. Όταν εισάγω τα σωστά username και password, επαναφορτώνεται η ίδια login σελίδα, με ένα σφάλμα που λέει "Παρακαλώ εισάγετε το σωστό username και κωδικό".
id: Saya tidak dapat masuk. Ketika Saya memasukkan nama pengguna dan sandi sah, itu hanya membawa ke halaman masuk kembali dengan kesalahan "SIlahkan masukkan nama pengguna dan sandi yang benar".
it: Non posso fare log in. Quando inserisco nome utente e password validi, ripropone di nuovo la pagina di login con l'errore: "Please enter a correct username and password".
pl: Nie mogę się zalogować. Kiedy wprowadzam poprawne nazwę użytkownika i hasło, pokazuje się znów strona logowania, z błędem „Proszę wprowadzić poprawną nazwę użytkownika i hasło”.

source: If you're sure your username and password are correct, make sure your user account has :attr:`~django.contrib.auth.models.User.is_active` and :attr:`~django.contrib.auth.models.User.is_staff` set to True. The admin site only allows access to users with those two fields both set to True.
el: Εάν είστε σίγουροι ότι το όνομα χρήστη και ο κωδικός σας είναι σωστά, σιγουρευτείτε ότι η τιμή της ρύθμισης :attr:`~django.contrib.auth.models.User.is_active` και :attr:`~django.contrib.auth.models.User.is_staff`, του λογαριασμού σας, είναι True. Το admin site επιτρέπει την είσοδο μόνο σε άτομα που η τιμή και των δύο αυτών πεδίων είναι True.
id: Jika anda yakin nama pengguna dan sandi anda benar, pastikan akun pengguna anda telah :attr:`~django.contrib.auth.models.User.is_active` dan :attr:`~django.contrib.auth.models.User.is_staff` disetel ke True. Situs admin hanya mengizinkan akses ke pengguna dengan kedua bidang disetel ke True.
it: Se sei sicuro che il tuo nome utente e la tua password sono corretti, controlla che il tuo account utente abbia gli attributi :attr:`~django.contrib.auth.models.User.is_active` e :attr:`~django.contrib.auth.models.User.is_staff` impostati a True. Il sito di Amministrazione permette l'accesso solo agli utenti con entrambi questi campi impostati a True.
pl: Jeśli jesteś pewien, że twoja nazwa użytkownika i hasło są poprawne, upewnij się czy twoje konto ma :attr:`~django.contrib.auth.models.User.is_active` i :attr:`~django.contrib.auth.models.User.is_staff` ustawione na True. Panel administracyjny pozwala na dostęp jedynie takim użytkownikom, którzy te dwa pola mają ustawione na True.

source: How do I automatically set a field's value to the user who last edited the object in the admin?
el: Πως μπορώ να σετάρω μια τιμή ενός πεδίου πάνω στον χρήστη που αλληλεπίδρασε τελευταίος με κάποιο object μέσω του admin;
id: Bagaimana Saya otomatis menyetel nilai bidang ke pengguna yang menyunting terakhir obyek di admin?
it: Come imposto automaticamente il valore di un campo all'utente che ha modificato per ultimo l'oggetto in Amministrazione?
pl: Jak automatycznie ustawić wartość pola na użytkownika, który ostatni edytował obiekt w panelu administracyjnym?

source: The :class:`~django.contrib.admin.ModelAdmin` class provides customization hooks that allow you to transform an object as it saved, using details from the request. By extracting the current user from the request, and customizing the :meth:`~django.contrib.admin.ModelAdmin.save_model` hook, you can update an object to reflect the user that edited it. See :ref:`the documentation on ModelAdmin methods <model-admin-methods>` for an example.
el: Η κλάση :class:`~django.contrib.admin.ModelAdmin` παρέχει παραμετροποιήσιμα hooks τα οποία σας επιτρέπουν να επιδράσετε με ένα object πριν και μετά την αποθήκευση του, χρησιμοποιώντας πληροφορίες από το request. Αντλώντας τον τρέχον χρήστη από το request και κάνοντας override τη μέθοδο (ή hook, αν θέλετε) :meth:`~django.contrib.admin.ModelAdmin.save_model`, μπορείτε να αλλάξετε το object προκειμένου να δείχνει στον user που το άλλαξε. Δείτε στο :ref:`εγχειρίδιο σχετικά με τις μεθόδους του ModelAdmin <model-admin-methods>` για παραδείγματα.
id: Kelas :class:`~django.contrib.admin.ModelAdmin` menyediakan kaitan penyesuaian yang mengizinkan anda merubah sebuah obyek ketika dia disimpan, menggunakan rincian dari permintaan. Dengan mengeluarkan pengguna saat ini dari permintaan, dan menyesuaikan kaitan :meth:`~django.contrib.admin.ModelAdmin.save_model`, anda dapat memperbaharui sebuah obyek untuk mencerminkan bahwa yang disunting itu. Lihat :ref:`the documentation on ModelAdmin methods <model-admin-methods>` untuk sebuah contoh.
it: La classe :class:`~django.contrib.admin.ModelAdmin` fornisce metodi di personalizzazione che permettono di trasformare un oggetto quando viene salvato, usando dettagli dalla richiesta. Estraendo l'utente corrente dalla richiesta, e personalizzando il metodo :meth:`~django.contrib.admin.ModelAdmin.save_model`, puoi aggiornare un oggetto in modo da riflettere l'utente che lo ha modificato. Per un esempio, vedi :ref:`la documentazione sui metodi della classe ModelAdmin <model-admin-methods>`.
pl: Klasa :class:`~django.contrib.admin.ModelAdmin` daje customizacyjne zaczepy, które pozwolą ci zmieniać obiekt zapisując go, przy użyciu szczegółowych danych z żądania. Wyjmując bieżącego użytkownika z żądania i zmieniając „zaczep” :meth:`django.contrib.admin.ModelAdmin.save_model`, możesz zaktualizować obiekt tak, aby miał powiązanie z użytkownikiem, który go edytował. W :ref:`dokumentacji metod ModelAdmin <model-admin-methods>` znajdziesz przykład.

source: How do I limit admin access so that objects can only be edited by the users who created them?
el: Πως μπορώ να περιορίσω την πρόσβαση στο admin site ούτως ώστε τα objects να τα επεξεργάζονται μόνο οι χρήστες που τα δημιούργησαν;
id: Bagaimana Saya membatasi akses admin sehingga obyek hanya dapat disunting oleh pengguna yang membuatnya?
it: Come è possibile limitare l'accesso per gli admin in modo da rendere gli oggetti modificabili solamente dagli utenti che li hanno creati?
pl: Jak mogę ograniczyć dostęp administratora tak, by obiekty mogły być edytowane tylko przez użytkowników, którzy je stworzyli?

source: The :class:`~django.contrib.admin.ModelAdmin` class also provides customization hooks that allow you to control the visibility and editability of objects in the admin. Using the same trick of extracting the user from the request, the :meth:`~django.contrib.admin.ModelAdmin.get_queryset` and :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` can be used to control the visibility and editability of objects in the admin.
el: Η κλάση :class:`~django.contrib.admin.ModelAdmin` παρέχει, επίσης, επιπλέον hooks (μεθόδους, αν θέλετε) τα οποία σας επιτρέπουν να ελέγχετε την προβολή ή όχι καθώς και την δυνατότητα επεξεργασίας των objects στο admin. Χρησιμοποιώντας την ίδια μέθοδο άντλησης του user από το request, οι μέθοδοι :meth:`~django.contrib.admin.ModelAdmin.get_queryset` και :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` μπορούν να χρησιμοποιηθούν προκειμένου να ελέγξετε την προβολή ή όχι καθώς και την δυνατότητα επεξεργασίας των objects στο admin.
id: Kelas :class:`~django.contrib.admin.ModelAdmin` juga menyediakan kaitan penyesuaian yang mengizinkan anda mengendalikan penampakan dan penyuntingan dari obyek di admin. Menggunakan trik sama dari mengeluarkan pengguna dari permintaan, :meth:`~django.contrib.admin.ModelAdmin.get_queryset` dan :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` dapat digunakan untuk mengendalikan penampakan dan penyuntingan dari obyek di admin.
it: La classe :class:`~django.contrib.admin.ModelAdmin` fornisce anche metodi per la personalizzazione che ti permettono di controllare la visibilità e la modificabilità di oggetti in amministrazione. Usando lo stesso stratagemma di estrarre l'utente dalla richiesta, i metodi :meth:`~django.contrib.admin.ModelAdmin.get_queryset` e :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` possono essere usati per controllare la visibilità e modificabilità di oggetti in amministrazione.
pl: Klasa :class:`~django.contrib.admin.ModelAdmin` daje również customizacyjne zaczepy, któe pozwalają na kontrolę widoczności i edytowalności obiektów w adminie. Używając tego samego triku wyjęcia użytkownika z żądania, :meth:`~django.contrib.admin.ModelAdmin.get_queryset` i :meth:`~django.contrib.admin.ModelAdmin.has_change_permission` mogą być użyte do kontroli widoczności i edytowalności obiektów w adminie.

source: My admin-site CSS and images showed up fine using the development server, but they're not displaying when using mod_wsgi.
el: Τα αρχεία CSS και οι εικόνες δουλεύουν στο admin-site μου χρησιμοποιώντας τον development server, αλλά όχι όταν χρησιμοποιώ το mod_wsgi.
id: CSS dan gambar situs-admin saya menunjukkan baik menggunakan peladen pengembangan, tetapi mereka tidak tampil ketika menggunakan mod_wsgi.
it: I CSS e le immagini del sito di amministrazione funzionano bene utilizzando il server di sviluppo, ma non vengono mostrate quando si usa mod_wsgi.
pl: CSS i grafiki mojego panelu administracyjnego wyświetliły się poprawnie na serwerze deweloperskim, ale nie wyświetlają się, kiedy używam mod_wsgi.

source: See :ref:`serving the admin files <serving-the-admin-files>` in the "How to use Django with mod_wsgi" documentation.
el: Δείτε στο :ref:`εξυπηρετώντας τα αρχεία του admin <serving-the-admin-files>` μέσα στο εγχειρίδιο "Πως να χρησιμοποιήσω το Django με το mod_wsgi".
id: Lihat :ref:`serving the admin files <serving-the-admin-files>` di dokumentasi "How to use Django with mod_wsgi".
it: Consulta :ref:`serving the admin files <serving-the-admin-files>` nella documentazione "Come usare Django con mod_wsgi".
pl: Przeczytaj :ref:`serwowanie plików panelu administracyjnego <serving-the-admin-files>` w dokumentacji „Jak używać Django z mod_wsgi”.

source: My "list_filter" contains a ManyToManyField, but the filter doesn't display.
el: Η επιλογή "list_filter" περιέχει ένα πεδίο τύπου ManyToManyField, αλλά το φίλτρο δεν εμφανίζεται.
id: "list_filter" saya mengandung ManyToManyField, tetapi saringan tidak tampil.
it: Il mio "list_filter" contiene un ManyToManyField, but non viene mostrato alcun filtro.
pl: Moje „list_filter” zawiera ManyToManyField, ale filtr się nie wyświetla.

source: Django won't bother displaying the filter for a ``ManyToManyField`` if there are no related objects.
pl: Django nie zawraca sobie głowy wyświetlaniem filtru dla ``ManyToManyField`` jeśli nie ma powiązanych obiektów.

source: For example, if your :attr:`~django.contrib.admin.ModelAdmin.list_filter` includes :doc:`sites </ref/contrib/sites>`, and there are no sites in your database, it won't display a "Site" filter. In that case, filtering by site would be meaningless.
pl: Na przykład jeśli twoje :attr:`~django.contrib.admin.ModelAdmin.list_filter` zawiera :doc:`sites </ref/contrib/sites>` a w bazie danych nie masz obiektów site, nie wyświetli filtru „Site”. W tym przypadku filtrowanie byłoby bez sensu.

source: Some objects aren't appearing in the admin.
el: Μερικά objects δεν εμφανίζονται στο admin.
id: Beberapa obyek tidak muncul di admin.
it: Alcuni degli oggetti non appaiono nella sezione admin.
pl: Niektóre obiekty nie pojawiają się w panelu administracyjnym.

source: Inconsistent row counts may be caused by missing foreign key values or a foreign key field incorrectly set to :attr:`null=False <django.db.models.Field.null>`. If you have a record with a :class:`~django.db.models.ForeignKey` pointing to a nonexistent object and that foreign key is included is :attr:`~django.contrib.admin.ModelAdmin.list_display`, the record will not be shown in the admin changelist because the Django model is declaring an integrity constraint that is not implemented at the database level.
it: Il conteggio di righe incongruente potrebbe essere causato da mancate valori delle foreign key oppure da un field foreign key incorretto impostato a :attr:`null=False <django.db.models.Field.null>`. Se hai un record con una :class:`~django.db.models.ForeignKey` che punta ad un oggetto inesistente e quella foreign key è inclusa in :attr:`~django.contrib.admin.ModelAdmin.list_display`, il record non potrà essere visualizzato nella changelist admin a causa del fatto che modello Django richiede un vincolo di integrità che non è implementato a livello database.
pl: Niezgodne liczby wierszy mogą wynikać z brakujących wartości kluczy obcych lub polem klucza obcego niepoprawnie ustawionym na :attr:`null=False <django.db.models.Field.null>`. Jeśli masz wpis z :class:`~django.db.models.ForeignKey` wskazującym na nieistniejący obiekt i ten klucz obcy jest zawarty w :attr:`~django.contrib.admin.ModelAdmin.list_display`, wpis nie będzie widoczny na changeliście panelu administracyjnego, ponieważ model Django deklaruje wiąz spójności, który nie jest zaimplementowany na poziomie bazy danych.

source: How can I customize the functionality of the admin interface?
el: Πως μπορώ να παραμετροποιήσω τη λειτουργία του admin interface;
id: Bagaimana dapat Saya menyesuaikan fungsi dari antarmuka admin?
it: Come posso personalizzare la funzionalità dell'interfaccia di amministrazione?
pl: Jak mogę dostosować funkcjonalność interfejsu panelu administratora?

source: You've got several options. If you want to piggyback on top of an add/change form that Django automatically generates, you can attach arbitrary JavaScript modules to the page via the model's class Admin :ref:`js parameter <modeladmin-asset-definitions>`. That parameter is a list of URLs, as strings, pointing to JavaScript modules that will be included within the admin form via a ``<script>`` tag.
el: Έχετε πολλές επιλογές. Αν θέλετε να ενεργήσετε πάνω στη φόρμα προσθήκη/αλλαγή που το Django δημιουργεί αυτόματα, μπορείτε να εφαρμόσετε δικά σας JavaScript modules στη σελίδα, μέσω της παραμέτρου :ref:`js parameter <modeladmin-asset-definitions>` της κλάσης Admin του μοντέλου. Αυτή η παράμετρος είναι στην ουσία μια λίστα με URLs, σαν strings, τα οποία δείχνουν σε JavaScript modules τα οποία θα συμπεριληφθούν στην φόρμα του admin μέσω του tag ``<script>``.
id: Anda telah mendapatkan beberapa pilihan. Jika anda ingin mendukung di atas dari sebuah formulir tambah/rubah yang Django otomatis bangkitkan, anda dapat melampirkan modul JavaScript berubah ke halaman melalui kelas model Admin :ref:`js parameter <modeladmin-asset-definitions>`. Parameter itu adalah daftar dari URL, sebagai string, menunjuk modul JavaScript yang akan disertakan dalam bentuk admin melalui etiket ``<script>``.
it: Hai parecchie possibilità. Se ti vuoi appoggiare su una form di aggiunta/cambiamento che Django genera automaticamente, puoi collegare alla pagina moduli JavaScript qualunque, tramite la classe del modello Admin :ref:`js parameter <modeladmin-asset-definitions>`. Questo parametro è una lista di URL, in forma di stringhe, che puntano a moduli JavaScript che saranno inclusi nella form di amministrazione tramite un tag ``<script>``.
pl: Masz kilka możliwości. Jeśli chcesz wskoczyć na barana formularzowi add/change, który Django generuje automatycznie, możesz załączyć dodatkowy moduł JavaScript do strony przez :ref:`parametr js <modeladmin-asset-definitions>` klasy Admin modelu. Ten parametr jest listą URL-i, jako ciągów znaków, wskazujących na moduły JavaScript, które będą włączone do formularza admina przez tag ``<script>``.

source: If you want more flexibility than is feasible by tweaking the auto-generated forms, feel free to write custom views for the admin. The admin is powered by Django itself, and you can write custom views that hook into the authentication system, check permissions and do whatever else they need to do.
it: Se vuoi più flessibilità di quanto sia possibile modificando le form autogenerate, sei libero di scrivere viste personalizzate per l'amministrazione. L'amministrazione è attuata da Django e puoi scrivere viste personalizzate che si agganciano al sistema di autenticazione, controllare le autorizzazioni e fare quant'altro sia necessario.
pl: Jeśli chcesz więcej elastyczności niż przez szczypanie automatycznie wygenerowanych formularzy, czuj się wolny, aby pisać własne widoki w adminie. Admin jest napędzany przez samo Django i możesz pisać własne widoki, które wpinają się w system uwierzytelniania, sprawdzają uprawnienia i robią wszystko, co potrzebują zrobić.

source: If you want to customize the look-and-feel of the admin interface, read the next question.
el: Αν θέλετε να αλλάξετε την εμφάνιση του, διαβάστε την επόμενη ερώτηση.
id: Jika anda ingin menyesuai tampilan-dan-perasaan dari antarmuka admin, baca pertanyaan selanjutnya.
it: Se vuoi personalizzare l'aspetto dell'interfaccia di amministrazione, leggi la prossima domanda.
pl: Jeśli chcesz dostosować look-and-feel interfejsu admina, przeczytaj następne pytanie.

source: The dynamically-generated admin site is ugly! How can I change it?
el: Το δυναμικά παραγόμενο admin site είναι άσχημο! Πως μπορώ να το αλλάξω;
id: Situs admin dibangkitkan-dinamis buruh! Bagaimana dapat Saya merubahnya?
it: La parte di amministrazione auto generata è bruttina! Come posso modificarla?
pl: Dynamicznie generowana strona panelu administracyjnego jest brzydka! Jak mogę ją zmienić?

source: We like it, but if you don't agree, you can modify the admin site's presentation by editing the CSS stylesheet and/or associated image files. The site is built using semantic HTML and plenty of CSS hooks, so any changes you'd like to make should be possible by editing the stylesheet.
el: Μας αρέσει, αλλά αν διαφωνείτε, μπορείτε να αλλάξετε την εμφάνιση του επεξεργάζοντας τα αρχεία CSS και/ή τις εικόνες. Το site χτίστηκε χρησιμοποιώντας semantic HTML και πολλά CSS hooks κάτι το οποίο σημαίνει ότι όποιες αλλαγές θελήσετε να κάνετε δεν έχετε παρά να επεξεργαστείτε τα αρχεία CSS.
id: Kami menyukainya, tetapi jika anda tidak setuju, anda dapat merubah penyajian situs admin dengan menyunting stylesheet CSS dan/atau berkas gambar terhubung. Situs dibangun menggunakan HTML dan cukup kaitan CSS, jadi setiap perubahan anda ingin buat harus mungkin dengan menyunting stylesheet.
it: A noi piace, ma se non sei daccordo, puoi modificare l'aspetto del sito di amministrazione cambiando i fogli stile CSS e/o i file delle immagini associate. Il sito è costruito usando HTML semantico e un sacco di agganci a CSS, perciò ogni cambiamento che desideri fare è possibile tramite i fogli stile.
pl: Nam się podoba, ale jeśli tobie nie, możesz zmodyfikować prezencję panelu administracyjnego zmieniając arkusz stylów i/lub związane z nim pliki grafik. Strona jest zbudowana przy użyciu sematycznego HTML-a i wielu hooków CSS, więc każda zmiana, którą chciałbyś zrobić, powinna być możliwa przez zmianę arkusza stylów.

source: What browsers are supported for using the admin?
el: Ποιους browsers υποστηρίζει το admin;
id: Perambah apa yang didukung untuk menggunakan admin?
it: Quali browser sono supportati durante l'utilizzo della parte di amministrazione?
pl: Jakie przeglądarki internetowe są wspierane przez panel administracyjny?

source: The admin provides a fully-functional experience to the recent versions of modern, web standards compliant browsers. On desktop this means Chrome, Edge, Firefox, Opera, Safari, and others.
it: La sezione di amministrazione fornisce una completa compatibilità con le versioni più recenti dei browser e conforme agli standard del web. In ambiente Desktop questo significa: Chrome, Edge, Firefox, Opera, Safari e altri.
pl: Panel administracyjny zapewnia w pełni funkcjonalne doświadczenie na bieżących wersjach nowoczesnych, zgodnych ze standardami, przeglądarkach. Na desktopie oznacza to przeglądarki Chrome, Edge, Firefox, Opera, Safari i inne.

source: On mobile and tablet devices, the admin provides a responsive experience for web standards compliant browsers. This includes the major browsers on both Android and iOS.
it: Su dispositivi mobili e tablet, la sezione di amministrazione fornisce un'interfaccia responsive per i browser conformi agli standard web. Ciò include i principali browser su Android e iOS.
pl: Na komórkach i tabletach, panel administracyjny wspiera responsywne doświadczenie dla przeglądarek zgodnych ze standardami. Wliczają się w to główne przeglądarki zarówno na Androida jak i iOS.

source: Depending on feature support, there *may* be minor stylistic differences between browsers. These are considered acceptable variations in rendering.
it: A seconda delle funzionalità, *potrebbero* esserci piccole differenze stilistiche tra i browser. Queste sono considerate variazioni accettabili nella visualizzazione.
pl: W zależności od cech przeglądarki *mogą* występować mniejsze różnice w stylistyce pomiędzy przeglądarkami. Te różnice są uważane za dopuszczalne w renderingu.
