Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: Problems running ``django-admin``
el: Προβλήματα στην εκτέλεση της εντολής ``django-admin``
id: Masalah menjalankan ``django-admin``
it: Problemi nell'esecuzione di ``django-admin``
pl: Problemy z uruchomieniem ``django-admin``

source: :doc:`django-admin </ref/django-admin>` should be on your system path if you installed Django via ``pip``. If it's not in your path, ensure you have your virtual environment activated and you can try running the equivalent command ``python -m django``.
it: :doc:`django-admin </ref/django-admin>` dovrebbe essere nella path di sistema se hai installato Django tramite ``pip``. Se non è nella path, assicurati di avere il tuo ambiente virtuale attivato e puoi provare a eseguire il comando equivalente ``python -m django``.
pl: :doc:`django-admin </ref/django-admin>` powinno być na twojej ścieżce systemowej, jeśli zainstalowałeś Django ``pip``-em. Jeśli nie ma go na twojej ścieżce, upewnij się, że aktywowałeś swoje wirtualne środowisko. Możesz też spróbować ekwiwalentnej komendy ``python -m django``.

source: macOS permissions
id: perizinan macOS
it: Permessi macOs
pl: Uprawnienia MacOS

source: If you're using macOS, you may see the message "permission denied" when you try to run ``django-admin``. This is because, on Unix-based systems like macOS, a file must be marked as "executable" before it can be run as a program. To do this, open Terminal.app and navigate (using the ``cd`` command) to the directory where :doc:`django-admin </ref/django-admin>` is installed, then run the command ``sudo chmod +x django-admin``.
id: Jika anda sedang menggunakan macOS, anda mungkin melihat pesan "perizinan ditolak" ketika anda mencoba menjalankan ``django-admin``. Ini karena, pada sistem berbasis Unix seperti macOS, sebuah berkas harus ditandai sebagai "executable" sebelum dia dapat dijalankan sebagai sebuah program. Untuk melakukan ini, buka Terminal.app dan navigasikan (menggunakan perintah ``cd``) ke direktori dimana :doc:`django-admin </ref/django-admin>` terpasang, kemudian jalankan perintah ``sudo chmod +x django-admin``.
it: Se stai usando Mac OS X, puoi ricevere il messaggio "permesso negato" quando tenti di usare ``django-admin``. Questo è dovuto al fatto che, nei sistemi basati su Unix, come OS X, un file deve essere marcato come "eseguibile" prima di poter essere usato come programma. Per fare ciò, apri Terminal.app e naviga (usando il comando ``cd``) fino alla directory dove è installato :doc:`django-admin ` , quindi esegui il comando ``sudo chmod +x django-admin``.
pl: Jeśli używasz MacOS, przy próbie uruchomienia ``django-admin`` może się wyświetlić komunikat „permission denied”. To dlatego, że w systemach uniksowych takich jak macOS, plik musi być oznaczony jako „wykonywalny” zanim będzie mógł zostać uruchomiony jako program. Aby to zrobić otwórz Terminal.app i wejdź (używając komendy ``cd``) do katalogu, gdzie jest zainstalowany :doc:`django-admin </ref/django-admin>`, następnie uruchom komendę ``sudo chmod +x django-admin``.

source: Miscellaneous
el: Διάφορα
id: Bermacam-macam
it: Miscellanea
pl: Rozmaite

source: I'm getting a ``UnicodeDecodeError``. What am I doing wrong?
el: Λαμβάνω το σφάλμα ``UnicodeDecodeError``. Τι κάνω λάθος;
id: Saya mendapatkan ``UnicodeDecodeError``. Apa yang saya lakukan salah?
it: Sto ricevendo un ``UnicodeDecodeError``. Cosa sto sbagliando?
pl: Otrzymuję ``UnicodeDecodeError``. Co robię źle?

source: This class of errors happen when a bytestring containing non-ASCII sequences is transformed into a Unicode string and the specified encoding is incorrect. The output generally looks like this:
pl: Ta klasa błędów występuje, gdy ciąg bitów zawierający sekwencje spoza ASCII jest przekształcany w ciąg znaków Unicode i wskazane kodowanie jest niepoprawne. Wyjście zazwyczaj wygląda w ten sposób:

source: The resolution mostly depends on the context, however here are two common pitfalls producing this error:
el: Βέβαια αυτό διαφέρει ανά περίπτωση αλλά θα δούμε παρακάτω δύο κοινές παγίδες που παράγουν αυτό το σφάλμα:
id: Resolusi itu sebagian besar tergantung pada konteks, namun ada dua kesalahan umum menghasilkan kesalahan ini:
it: La soluzione dipende molto dal contesto, comunque vi sono due trappole abituali che producono questo errore:
pl: Rozwiązanie przede wszystkim zależy od kontekstu, jednakże są dwie pułapki powszechnie powodujące ten błąd:

source: Your system locale may be a default ASCII locale, like the "C" locale on UNIX-like systems (can be checked by the ``locale`` command). If it's the case, please refer to your system documentation to learn how you can change this to a UTF-8 locale.
el: Οι ρυθμίσεις locale του συστήματος σας ίσως είναι προεπιλεγμένες στο ASCII locale, όπως το "C" locale στα UNIX συστήματα (αυτό μπορεί να ελεγχεί από κονσόλα με την εντολή ``locale``). Αν ισχύει κάτι τέτοιο, παρακαλούμε αναφερθείτε στο documentation του συστήματος σας για να δείτε πως να το αλλάξετε σε UTF-8 locale.
id: Sitem lokal anda mungkin awalnya ASCII lokal, seperti lokal "C" pada sistem seperti-UNIX (dapat diperiksa dengan perintah ``locale``). Jika itu kasusnya, silahkan mengacu ke dokumentasi sistem anda untuk mempelajari bagaimana anda dapat merubah ini menjadi lokal UTF-8.
it: La localizzazione del tuo sistema può essere una localizzazione ASCII predefinita, come la localizzazione "C" nei sistemi basati su Unix (può essere controllata tramite il comando ``locale``). Se è questo il caso, fai riferimento alla documentazione del tuo sistema per imparare come puoi cambiarla in una localizzazione UTF-8.
pl: Twoim systemowym locale może być domyślne locale ASCII, takie jak locale „C” w systemach uniksopodobnych (można to sprawdzić poleceniem ``locale``). Jeśli tak jest, sprawdź w dokumentacji swojego systemu jak możesz je zmienić na locale UTF-8.

source: Related resources:
el: Σχετικές πηγές:
id: Sumber daya terkait:
it: Risorse correlate:
pl: Powiązane zasoby:

source: :doc:`Unicode in Django </ref/unicode>`
el: :doc:`Το unicode στο Django </ref/unicode>`
id: :doc:`Unicode di Django </ref/unicode>`
pl: :doc:`Unicode w Django </ref/unicode>`

source: FAQ: Using Django
el: Συχνές Ερωτήσεις: Χρησιμοποιώντας το Django
id: FAQ: Menggunakan Django
it: FAQ: Utilizzare Django
pl: Często zadawane pytania: Używanie Django

source: Why do I get an error about importing :envvar:`DJANGO_SETTINGS_MODULE`?
it: Perché ricevo un errore all'importazione di :envvar:`DJANGO_SETTINGS_MODULE`?
pl: Dlaczego otrzymuję błąd dotyczący importu :envvar:`DJANGO_SETTINGS_MODULE`?

source: Make sure that:
el: Σιγουρευτείτε ότι:
id: Pastikan itu:
it: Assicurati che:
pl: Upewnij się, że:

source: The environment variable :envvar:`DJANGO_SETTINGS_MODULE` is set to a fully-qualified Python module (i.e. ``mysite.settings``).
pl: Zmienna środowiskowa :envvar:`DJANGO_SETTINGS_MODULE` jest ustawiona na w pełni kwalifikowany moduł Pythona (np. ``mysite.settings``).

source: Said module is on ``sys.path`` (``import mysite.settings`` should work).
el: Το παραπάνω module (π.χ "mysite.settings") βρίσκεται μέσα στο ``sys.path`` (το ``import mysite.settings`` θα πρέπει να δουλεύει).
id: Modul said ada di ``sys.path`` (``impor mysite.settings`` seharusnya bekerja).
it: Il modulo suddetto è nel ``sys.path`` (``import mysite.settings`` deve funzionare).
pl: Wspomniany moduł jest na ``sys.path`` (``import mysite.settings`` powinno zadziałać).

source: The module doesn't contain syntax errors.
it: Il modulo non contiene errori di sintassi.
pl: Moduł nie zawiera błędów składniowych.

source: I can't stand your template language. Do I have to use it?
el: Δεν αντέχω τη γλώσσα των templates σας. Είμαι υποχρεωμένος να τη χρησιμοποιώ;
id: Saya tidak tahan bahasa cetakan anda. Apakah Saya harus menggunakannya?
it: Non riesco a comprendere il vostro linguaggio dei template. Devo usarlo per forza?
pl: Nie mogę znieść waszego języka szablonów. Czy muszę go używać?

source: We happen to think our template engine is the best thing since chunky bacon, but we recognize that choosing a template language runs close to religion. There's nothing about Django that requires using the template language, so if you're attached to Jinja2, Mako, or whatever, feel free to use those.
el: Τυγχάνει να πιστεύουμε ότι η μηχανή των templates μας είναι ότι καλύτερο συνέβη μετά το μπέϊκον αλλά αναγνωρίζουμε την δυνατότητα επιλογής ανάμεσα σε γλώσσες templates η οποία είναι καθαρά υποκειμενική. Το Django δεν απαιτεί να χρησιμοποιήσετε τη δική του template γλώσσα, οπότε αν θέλετε μπορείτε να χρησιμοποιήσετε τις Jinja2, Mako, ή οποιαδήποτε άλλη επιθυμείτε.
id: Kami berpikir mesin cetakan kami adalah hal terbaik sejak chunky bacon, tetapi kami mengenali bahwa memilih sebuah bahasa cetakan berjalan dekat ke agama. Tidak ada tentang Django yang membutuhkan menggunakan bahasa cetakan, jadi jika anda sedang dilampirkan ke Jinja2, Mako, atau apapun, merasa bebas untuk menggunakan mereka.
it: Noi pensiamo che il nostro motore per il template sia la cosa migliore dopo il bacon a pezzetti, ma dobbiamo riconoscere che la scelta di un linguaggio di template è qualcosa di simile a una religione. In Django nulla richiede l'uso del suo linguaggio di template, quindi se siete attaccati a Jinja2, Mako, o qualunque altro, sentitevi liberi di usarlo.
pl: Zdarza nam się myśleć, że nasz silnik szablonów jest najlepszą rzeczą od czasu grubo krojonego bekonu, ale uznajemy, że wybór języka szablonów jest niemal kwestią religii. Nie ma nic w Django, co wymusza korzystanie z języka szablonów, więc jeśli jesteś przywiązany do Jinja2, Mako lub czegokolwiek innego, możesz ich używać.

source: Do I have to use your model/database layer?
el: Είναι υποχρεωτικό να χρησιμοποιώ το δικό σας επίπεδο μοντέλων/βάσεις δεδομένων;
id: Apakah saya harus menggunakan lapisan model/basisdata?
it: È necessario usare il livello di astrazione modello/database?
pl: Czy muszę używać waszej warstwy modelu/bazy danych?

source: Nope. Just like the template system, the model/database layer is decoupled from the rest of the framework.
el: Όχι. Όπως ακριβώς με το σύστημα των templates έτσι και το επίπεδο των μοντέλων/βάσεις δεδομένων είναι απόλυτα διαχωρισμένο από το υπόλοιπο framework.
id: Tidak, Hanya seperti sistem cetakan, lapisan model/basisdata dispisahkan dari sisa kerangka.
it: No, proprio come il sistema dei template, la parte modello/database non è in alcun modo legata al resto del framework.
pl: Nie. Tak jak system szablonów, warstwa modelu/bazy danych jest uniezależniona od reszty frameworka.

source: The one exception is: If you use a different database library, you won't get to use Django's automatically-generated admin site. That app is coupled to the Django database layer.
el: Η μοναδική εξαίρεση είναι η εξής: Αν χρησιμοποιήσετε μια διαφορετική βιβλιοθήκη βάσης δεδομένων, δε θα έχετε στη διάθεση σας το αυτόματα-παραγόμενο Django admin site. Αυτή η εφαρμογή (admin site) είναι συνδεδεμένη με το επίπεδο της βάσης δεδομένων του Django.
id: Satu pengecualian adalah: Jika anda menggunakan pustaka basisdata beda, anda tidak akan dapat menggunakan situs admin dibangkitkan-otomatis Django. Aplikasi itu berpasangan pada lapisan basisdata Django.
it: L'eccezione è: se usi una diversa libreria per database, non potrai usare il sito di amministrazione generato automaticamente da Django. Quella app è legata allo strato di gestione del database di Django.
pl: Jedynym wyjątkiem jest: jeśli używasz innej biblioteki bazodanowej, nie możesz używać automatycznie generowanego panelu administracyjnego Django. Ta aplikacja jest związana z warstwą bazodanową Django.

source: How do I use image and file fields?
el: Πως χρησιμοποιώ τα πεδία ImageField και FileField;
id: Bagaimana Saya menggunakan bidang gambar dan berkas?
it: Come si utilizzano i campi immagine e file?
pl: Jak używać pól grafik i plików?

source: Using a :class:`~django.db.models.FileField` or an :class:`~django.db.models.ImageField` in a model takes a few steps:
el: Απαιτούνται μερικά βήματα για να επωφεληθείτε των πεδίων :class:`~django.db.models.FileField` ή/και :class:`~django.db.models.ImageField` που είναι δηλωμένα σε ένα μοντέλο:
id: Menggunakan sebuah :class:`~django.db.models.FileField` atau sebuah :class:`~django.db.models.ImageField` di model memakan dua langkah:
it: Usare un :class:`~django.db.models.FileField` o un :class:`~django.db.models.ImageField` in un model richiede alcuni passaggi:
pl: Użycie klas :class:`~django.db.models.FileField` lub :class:`~django.db.models.ImageField` w modelu wymaga kilku kroków:

source: In your settings file, you'll need to define :setting:`MEDIA_ROOT` as the full path to a directory where you'd like Django to store uploaded files. (For performance, these files are not stored in the database.) Define :setting:`MEDIA_URL` as the base public URL of that directory. Make sure that this directory is writable by the web server's user account.
pl: W swoim pliku ustawień będziesz potrzebował określić :setting:`MEDIA_ROOT` jako pełną ścieżkę do katalogu, gdzie chciałbyś aby Django przechowywało załadowane pliki. (Dla wydajności te pliki nie są przechowywane w bazie danych.) Określ :setting:`MEDIA_URL` jako bazowy publiczny URL tego katalogu. Upewnij się, że konto użytkownika web-serwera ma prawo zapisu do tego katalogu.

source: Add the :class:`~django.db.models.FileField` or :class:`~django.db.models.ImageField` to your model, defining the :attr:`~django.db.models.FileField.upload_to` option to specify a subdirectory of :setting:`MEDIA_ROOT` to use for uploaded files.
el: Προσθέστε το πεδίο :class:`~django.db.models.FileField` ή/και το :class:`~django.db.models.ImageField` στο μοντέλο σας, προσδιορίζοντας το όρισμα :attr:`~django.db.models.FileField.upload_to` προκειμένου να προσδιοριστεί ο υπο-φάκελος του :setting:`MEDIA_ROOT` που θα χρησιμοποιηθεί για τα ανεβασμένα αρχεία σας. Αν π.χ έχετε ορίσει την επιλογή :setting:`MEDIA_ROOT` ως "mysite/media_remote/" και το όρισμα :attr:`~django.db.models.FileField.upload_to` ως "images/avatars/" τότε όλες οι εικόνες θα αποθηκευτούν στη τοποθεσία "mysite/media_remote/images/avatars/".
id: Tambah :class:`~django.db.models.FileField` atau :class:`~django.db.models.ImageField` ke model anda, menetapkan pilihan :attr:`~django.db.models.FileField.upload_to` untuk menentukan sebuah subdirektori dari :setting:`MEDIA_ROOT` untuk digunakan untuk berkas terunggah.
it: Aggiungi il :class:`~django.db.models.FileField` o :class:`~django.db.models.ImageField` al tuo model, definendo l'opzione :attr:`~django.db.models.FileField.upload_to` per specificare una sottodirectory di :setting:`MEDIA_ROOT` da usare per i file inviati al server.
pl: Dodaj :class:`~django.db.models.FileField` lub :class:`~django.db.models.ImageField` do swojego modelu, ustawiając opcję :attr:`~django.db.modelsFileField.upload_to` na podkatalog :setting:`MEDIA_ROOT`, aby używać go dla załadowanych plików.

source: All that will be stored in your database is a path to the file (relative to :setting:`MEDIA_ROOT`). You'll most likely want to use the convenience :attr:`~django.db.models.fields.files.FieldFile.url` attribute provided by Django. For example, if your :class:`~django.db.models.ImageField` is called ``mug_shot``, you can get the absolute path to your image in a template with ``{{ object.mug_shot.url }}``.
el: Το μόνο που θα αποθηκευτεί στη βάση δεδομένων σας είναι το μονοπάτι στο αρχείο (σχετικό του :setting:`MEDIA_ROOT`). Το πιο πιθανό είναι να χρησιμοποιήσετε το βολικό attribute :attr:`~django.db.models.fields.files.FieldFile.url` που σας παρέχει το Django. Για παράδειγμα, αν το :class:`~django.db.models.ImageField` ονομάζεται ``mug_shot``, μπορείτε να δείτε το απόλυτο μονοπάτι (absolute path) της εικόνας σας, στο template, ως ``{{ object.mug_shot.url }}``.
id: Semua itu akan disimpan dalam basisdata anda adalah jalur ke berkas (tergantung ke :setting:`MEDIA_ROOT`). Anda akan ingin menggunakan atribut :attr:`~django.db.models.fields.files.FieldFile.url` meyakinkan disediakan oleh Django. Sebagai contoh, jika :class:`~django.db.models.ImageField` anda dipanggil ``mug_shot``, anda dapat mendapatkan jalur mutlak ke gambar anda di cetakan dengan ``{{ object.mug_shot.url }}``.
it: Tutto ciò che sarà memorizzato nel tuo database è un path al file (relativo a :setting:`MEDIA_ROOT`). Probabilmente vorrai usare la comodità dell'attributo :attr:`~django.db.models.fields.files.FieldFile.url` fornito da Django. Per esempio, se il tuo :class:`~django.db.models.ImageField` si chiama ``mug_shot``, in un template puoi avere il path assoluto alla tua immagine con ``{{ object.mug_shot.url }}``.
pl: Wszystkim, co będzie przechowywane w twojej bazie danych jest ścieżka do pliku (względna do :setting:`MEDIA_ROOT`). Najprawdopodobniej zechcesz używać wygodnego atrybutu :attr:`~django.db.models.fields.files.FieldFile.url` Django. Na przykład jeśli twoje :class:`~django.db.models.ImageField` nazywa się ``portret``, możesz uzyskać bezwzględną ścieżkę do swojego zdjęcia w szablonie przez ``{{ object.portret.url }}``.

source: How do I make a variable available to all my templates?
el: Πως μπορώ να κάνω μια μεταβλητή ορατή σε όλα τα templates;
id: Bagaimana Saya membuat variabel tersedia ke semua cetakan saya?
it: Come faccio a rendere disponibile una variabile a tutti i miei template?
pl: Jak stworzyć zmienną dostępną we wszystkich moich szablonach?

source: Sometimes your templates all need the same thing. A common example would be dynamically generated menus. At first glance, it seems logical to add a common dictionary to the template context.
it: A volte i tuoi templates hanno tutti bisogno della stessa cosa. Un esempio sono i menu generati dinamicamente. A prima vista, sembra logico aggiungere un dizionario comune al contesto del template.
pl: Czasem wszystkie twoje szablony potrzebują tej samej rzeczy. Powszechnym przykładem mogą być dynamicznie generowane menu. Na pierwszy rzut oka wydaje się logiczne dodać wspólny słownik do kontekstu szablonu.

source: The best way to do this in Django is to use a ``RequestContext``. Details on how to do this are here: :ref:`subclassing-context-requestcontext`.
it: Il modo migliore per farlo in Django è usare: `` RequestContext``. I dettagli su come farlo sono qui: :ref:`subclassing-context-requestcontext`.
pl: Najlepszym sposobem, by zrobić to w Django, jest użycie ``RequestContext``. Szczegóły jak to zrobić znajdziesz tutaj: :ref:`subclassing-context-requestcontext`.

source: Django won't bother displaying the filter for a ``ManyToManyField`` if there are fewer than two related objects.
el: Το Django δεν θα εμφανίσει το φίλτρο για πεδία τύπου ``ManyToManyField`` αν υπάρχουν λιγότερα από δύο συσχετισμένα objects.
id: Django tidak akan mengganggu menampilkan saringan untuk ``ManyToManyField`` jika terdapat sedikit dari dua obyek terhubung.
it: Django non si preoccupa di visualizzare il filtro per un ``ManyToManyField`` se ci sono meno di due oggetti correlati.

source: For example, if your :attr:`~django.contrib.admin.ModelAdmin.list_filter` includes :doc:`sites </ref/contrib/sites>`, and there's only one site in your database, it won't display a "Site" filter. In that case, filtering by site would be meaningless.
el: Για παράδειγμα, αν η επιλογή :attr:`~django.contrib.admin.ModelAdmin.list_filter` περιέχει τα :doc:`sites </ref/contrib/sites>` και υπάρχει μόνο ένα site στη βάση δεδομένων σας, το φίλτρο "Ιστότοποι" δεν θα εμφανιστεί. Δεν έχει νόημα να φιλτράρετε κάτι αν υπάρχει μόνο ένα αποτέλεσμα!
id: Sebagai contoh, jika :attr:`~django.contrib.admin.ModelAdmin.list_filter` anda menyertakan :doc:`sites </ref/contrib/sites>`, dan hanya ada satu situs di basisdata anda, dia tidak akan menampilkansaringan "Situs". Di kasus itu, penyaringan berdasarkan situs akan tidak berarti.
it: Per esempio, se il tuo :attr:`~django.contrib.admin.ModelAdmin.list_filter` include :doc:`sites </ref/contrib/sites>`, e c'è un solo sito nel tuo database, Django non visualizza il filtro "Sito". In questo caso, filtrare per sito non sarebbe significativo.

source: Another way to get traction is to pull several related tickets together. When the someone sits down to review a bug in an area they haven't touched for a while, it can take a few minutes to remember all the fine details of how that area of code works. If you collect several minor bug fixes together into a similarly themed group, you make an attractive target, as the cost of coming up to speed on an area of code can be spread over multiple tickets.
el: Άλλος ένας τρόπος είναι να κάνετε pull πολλά παρόμοια, μεταξύ τους, tickets. Όταν οι core developers ασχολούνται με την επιδιόρθωση ενός bug σε κάποιον τομέα που έχουν να ασχοληθούν καιρό, μπορεί να τους πάρει μερικά λεπτά για να θυμηθούν όλες τις λεπτομέρειες σχετικά με τη λειτουργία του κώδικα αυτού. Αν συγκεντρώσετε πολλές διορθώσεις που αφορούν τον ίδιο τομέα κώδικα (π.χ template tags ή model fields κλπ) σε ένα γκρουπ, δημιουργείτε έναν ελκυστικό στόχο αφού το όφελος διανέμεται σε πολλαπλά tickets και έτσι επιταχύνονται οι διαδικασίες.
id: Cara lain untuk mendapatkan daya tarik adalah menarik beberapa tiket terkait bersama-sama. ketika pengembang inti duduk untuk meninjau masalah di sebuah kawasan mereka tidak sentuh beberapa saat, itu dapat memakan beberapa menit untuk mengingat semua rincian dari bagaimana kawasan kode bekerja. Jika anda memilih beberapa perbaikan kesalahan kecil bersama-sama kedalam kelompok tema yang mirip, anda membuat sebuah sasaran atraktif, ketika biaya yang datang ke kecepatan di kawasan kode dapat disebar melalui banyak tiket.
it: Un altro modo per ottenere "influenza", è aggregare insieme parecchi ticket correlati. Quando gli sviluppatori del core si siedono per risolvere un bug in un'area su cui non lavorano da un po', possono servire alcuni minuti prima di ricordare tutti i dettagli di come funziona quell'area di codice. Se collezioni insieme più soluzioni di bug in un gruppo dello stesso tipo, crei un obiettivo interessante, perché il costo necessario per muoversi rapidamente su un'area di codice viene ripartito su più ticket.

source: Please refrain from emailing anyone personally or repeatedly raising the same issue over and over. This sort of behavior will not gain you any additional attention -- certainly not the attention that you need in order to get your issue addressed.
el: Παρακαλούμε αποφύγετε να στέλνετε προσωπικά email στους core developers ή να κάνετε raise το ίδιο issue επανειλημμένως. Με αυτού του είδους τη συμπεριφορά δεν θα τραβήξετε την προσοχή -- πόσο μάλλον την προσοχή που ζητάτε για να διευθετηθεί το bug σας.
id: Silahkan menahan dari men surel siapapun secara pribadi, atau berulang menampilan masalah sama lagi dan lagi. Kebiasaan pendek ini tidak akan mendapatkan perhatian tambahan -- pasti bukan perhatian yang anda butuhkan agar mendapatkan masalah anda dialamatkan.
it: Astieniti dall'inviare email personalmente agli sviluppatori del core, o sollevare lo stesso problema ripetitivamente. Questo tipo di comportamento non ti porterà maggiore attenzione -- certamente non l'attenzione che ti serve per ottenere la soluzione del tuo bug preferito.
