Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/faq.po
Languages: el, id, it, pl

source: Due to the sensitive nature of security issues, we ask that if you think you have found a security problem, *please* don't post a message on the forum, IRC, or one of the public mailing lists. Django has a :ref:`policy for handling security issues <reporting-security-issues>`; while a defect is outstanding, we would like to minimize any damage that could be inflicted through public knowledge of that defect.
it: Data la riservatezza dei problemi di sicurezza, ti chiediamo di non pubblicare il messaggio sul forum IRC o una delle mailing list pubbliche, quando trovi un problema di sicurezza. Django ha una :ref:`policy per la gestione di problemi di sicurezza 1`; Noi vorremmo minimizzare ogni rischio che potrebbe essere causato dalla pubblicazione di questo problema.
pl: W związku z wrażliwą naturą problemów bezpieczeństwa, gdy myślisz, że znalazłeś problem z bezpieczeństwem, *prosimy*, abyś nie publikował wiadomości na forum, IRC ani żadnej z publicznych list mailingowych. Django ma :ref:`politykę obsługi problemów bezpieczeństwa <reporting-security-issues>`; podczas gdy defekt jest niepospolity, chcielibyśmy zminimalizować wszystkie szkody, które mógłaby spowodować publicznie dostępna wiedza na temat defektu.

source: Django FAQ
el: Συχνές Ερωτήσεις για το Django
id: FAQ Django
pl: Często zadawane pytania odnośnie Django

source: FAQ: Installation
el: Συχνές Ερωτήσεις: Εγκατάσταση
id: FAQ: Pemasangan
it: FAQ: Installazione
pl: Często zadawane pytania: Instalacja

source: How do I get started?
el: Πως ξεκινώ;
id: Bagaimana Saya memulai?
it: Come posso iniziare?
pl: Jak mogę zacząć?

source: `Download the code`_.
el: `Κατεβάστε τον κώδικα <https://www.djangoproject.com/download/>`_.
id: `Unduh kode`_.
it: `Scarica il codice`_.
pl: `Pobierz kod`_.

source: Install Django (read the :doc:`installation guide </intro/install>`).
el: Εγκαταστήστε το Django (δείτε το άρθρο :doc:`οδηγός εγκατάσταση </intro/install>`).
id: Pasang Django (baca :doc:`installation guide </intro/install>`).
it: Installa Django (leggi :doc:`guida all'installazione </intro/install>`).
pl: Zainstaluj Django (przeczytaj :doc:`poradnik instalacji </intro/install>`).

source: Walk through the :doc:`tutorial </intro/tutorial01>`.
el: Περιηγηθείτε μέσα στον :doc:`οδηγό μας </intro/tutorial01>`.
id: Berjalan melalui :doc:`tutorial </intro/tutorial01>`.
it: Consulta il :doc:`tutorial </intro/tutorial01>`.
pl: Przejdź przez :doc:`samouczek </intro/tutorial01>`.

source: Check out the rest of the :doc:`documentation </index>`, and `ask questions`_ if you run into trouble.
el: Δείτε το υπόλοιπο :doc:`documentation </index>` του Django και `ρωτήστε την κοινότητα <https://www.djangoproject.com/community/>`_ αν έχετε κάποιο πρόβλημα.
id: Periksa sisanya dari :doc:`documentasi </index>`, dan `tanyakan pertanyaan`_ jika anda berjalan kedalam masalah.
it: Se hai un problema, controlla il resto della :doc:`documentation </index>`, e `ask questions`_ .
pl: Sprawdź pozostałą część :doc:`dokumentacji </index>`, i `zadawaj pytania`_, jeśli wpadniesz w tarapaty.

source: What are Django's prerequisites?
el: Ποια είναι τα απαιτούμενα για το Django;
id: Apa itu prasyarat Django?
it: Quali sono i prerequisiti di Django?
pl: Jakie są wymagania wstępne Django?

source: Django requires Python. See the table in the next question for the versions of Python that work with each version of Django. Other Python libraries may be required for some use cases, but you'll receive an error about them as they're needed.
it: Django richiede Python. Leggi la tabella nella prossima domanda per le versioni di Python supportate per ogni versione di Django. Altre librerie Python potrebbero essere richieste per alcuni casi d'uso, ma riceverai un errore a riguardo se sono necessarie.
pl: Django wymaga Pythona. Obejrzyj tabelę z następnego pytania, aby sprawdzić, które wersje Pythona działają z określoną wersją Django. Inne biblioteki Pythona mogą być wymagane przez niektórych użytkowników. O ich potrzebie zostaniesz poinformowany błędem.

source: For a development environment -- if you just want to experiment with Django -- you don't need to have a separate web server installed or database server.
pl: W środowisku deweloperskim – jeśli chcesz tylko eksperymentować z Django – nie potrzebujesz zainstalowanego oddzielnie serwera WWW ani serwera bazy danych.

source: Django comes with its own :djadmin:`lightweight development server<runserver>`. For a production environment, Django follows the WSGI spec, :pep:`3333`, which means it can run on a variety of web servers. See :doc:`Deploying Django </howto/deployment/index>` for more information.
it: Django viene fornito con il proprio :djadmin: `server di sviluppo leggero <runserver>`. Per un ambiente di produzione, Django segue le specifiche WSGI, :pep:`3333`, il che significa che può essere eseguito su vari server web. Vedere :doc:`Deploying Django </howto/deployment/index>` per maggiori informazioni.
pl: Django ma wbudowany własny :djadmin:`lekki serwer deweloperski <runserver>`. W środowisku produkcyjnym Django wypełnia specyfikację WSGI, :pep:`3333`, co znaczy, że może być uruchamiane na rozmaitych serwerach WWW. Zobacz :doc:`Deployment Django </howto/deployment/index>` po więcej informacji.

source: Django runs `SQLite`_ by default, which is included in Python installations. For a production environment, we recommend PostgreSQL_; but we also officially support MariaDB_, MySQL_, `SQLite`_, and Oracle_. See :doc:`Supported Databases </ref/databases>` for more information.
it: Django esegue di default `SQLite`_ , che è incluso nelle installazioni di Python. Per un ambiente di produzione, consigliamo PostgreSQL_; ma supportiamo ufficialmente anche MariaDB_, MySQL_, `SQLite`_ e Oracle_. Vedere :doc: `Database supportati </ref/databases>` per maggiori informazioni.
pl: Django domyślnia używa `SQLite`_, które jest zawarte w instalacjach Pythona. Do środowiska produkcyjnego zalecamy PostgreSQL_; lecz oficjalnie wspieramy też MariaDB_, MySQL_, `SQLite`_ i Oracle_. Zobacz :doc:`wspierane bazy danych </ref/databases>` po więcej informacji.

source: What Python version can I use with Django?
el: Ποια έκδοση της Python να χρησιμοποιήσω με το Django;
id: Versi Phyton apa dapat Saya gunakan dengan Django?
it: Che versione di Python posso usare con Django?
pl: Której wersji Pythona mogę użyć z Django?

source: Django version
el: Django έκδοση
id: Versi Django
it: Versione di Django
pl: Wersja Django

source: Python versions
el: Python εκδόσεις
id: Versi Python
it: Versioni di Python
pl: Wersje Pythona

source: 3.6, 3.7, 3.8, 3.9, 3.10 (added in 3.2.9)
it: 3.6, 3.7, 3.8, 3.9, 3.10 (aggiunto nella 3.2.9)
pl: 3.6, 3.7, 3.8, 3.9, 3.10 (dodana w 3.2.9)

source: 3.8, 3.9, 3.10, 3.11 (added in 4.1.3)
pl: 3.8, 3.9, 3.10, 3.11 (dodana w 4.1.3)

source: 3.8, 3.9, 3.10, 3.11, 3.12 (added in 4.2.8)
pl: 3.8, 3.9, 3.10, 3.11, 3.12 (dodane w 4.2.8)

source: For each version of Python, only the latest micro release (A.B.C) is officially supported. You can find the latest micro version for each series on the `Python download page <https://www.python.org/downloads/>`_.
el: Για κάθε έκδοση της Python, μόνο η τελευταία micro release (A.B.C) υποστηρίζεται επισήμως. Μπορείτε να βρείτε την τελευταία micro version για κάθε σειρά της Python στην `επίσημη σελίδα της <https://www.python.org/downloads/>`_.
id: Untuk setiap versi dari Phyton, hanya terbitak mikro terakhir (A.B.C) adalah resmi yang didukung. Anda dapat menemukan versi mikro terakhir untuk setiap seri pada `Halaman unduh Python <https://www.python.org/downloads/>`_.
it: Per ogni versione di Python, è ufficialmente supportata solo l'ultima micro release (A.B.C). Puoi trovare l'ultima micro release di ogni serie nella `Python download page <https://www.python.org/downloads/>`_.
pl: Dla każdej wersji Pythona, tylko ostatnie wydanie mikro (A.B.C) jest oficjalnie wspierane. Możesz znaleźć najnowsze wersje mikro każdej serii na `stronie pobrań Pythona <https://www.python.org/downloads/>`_.

source: Typically, we will support a Python version up to and including the first Django LTS release whose security support ends after security support for that version of Python ends. For example, Python 3.3 security support ended September 2017 and Django 1.8 LTS security support ended April 2018. Therefore Django 1.8 is the last version to support Python 3.3.
it: In genere, supporteremo una versione di Python fino alla prima versione di Django LTS inclusa, il cui supporto per la sicurezza termina al termine del supporto per la sicurezza per quella versione di Python. Ad esempio, il supporto per la sicurezza di Python 3.3 è terminato a settembre 2017 e il supporto per la sicurezza di Django 1.8 LTS è terminato ad aprile 2018. Pertanto Django 1.8 è l'ultima versione a supportare Python 3.3.
pl: Zazwyczaj wspieramy wersję Pythona włącznie do wersji, którą zawiera pierwsze wydanie Django LTS (long term support), którego wsparcie bezpieczeństwa kończy się po wygaśnięciu wsparcia bezpieczeństwa do tej wersji Pythona. Na przykład wsparcie bezpieczeństwa do Pythona 3.3 skończyło się we wrześniu 2017 i wsparcie bezpieczeństwa Django 1.8 LTS skończyło się w kwietniu 2018. Stąd Django 1.8 jest ostatnią wersją, która wspiera Pythona 3.3.

source: What Python version should I use with Django?
el: Ποια έκδοση της Python θα πρέπει να χρησιμοποιήσω με το Django;
id: Versi Phyton apa harus Saya gunakan dengan Django?
it: Quale versione di Python dovrei usare con Django?
pl: Jakiej wersji Pythona powinienem używać z Django?

source: Since newer versions of Python are often faster, have more features, and are better supported, the latest version of Python 3 is recommended.
it: A partire dalle ultime versioni di Python sono solitamente più veloci, hanno più features, e sono meglio sopportate, quindi l'ultima versione di Python 3 è raccomandata
pl: Jako że nowsze wersje Pythona często są szybsze, mają więcej funkcjonalności i są lepiej wspierane, rekomendujemy najnowszą wersję Pythona 3.

source: You don't lose anything in Django by using an older release, but you don't take advantage of the improvements and optimizations in newer Python releases. Third-party applications for use with Django are free to set their own version requirements.
it: Non si perde nulla in Django utilizzando una versione precedente, ma non si trae vantaggio dai miglioramenti e dalle ottimizzazioni nelle versioni più recenti di Python. Le applicazioni di terze parti da utilizzare con Django sono libere di impostare i propri requisiti di versione.
pl: Nic nie tracisz w Django używając starszego wydania, ale nie masz korzyści z poprawek i optymalizacji w nowszych wydaniach Pythona. Zewnętrzne aplikacje do użytku z Django są wolne, aby ustalać własne wymagania co do wersji.

source: Should I use the stable version or development version?
el: Να χρησιμοποιώ τη σταθερή έκδοση ή την αναπτυξιακή;
id: Haruskah Saya menggunakan versi stabil atau versi pengembangan?
it: Devo usare una versione stabile, o di sviluppo?
pl: Powinienem użyć wersji stabilnej czy rozwojowej?

source: Generally, if you're using code in production, you should be using a stable release. The Django project publishes a full stable release every eight months or so, with bugfix updates in between. These stable releases contain the API that is covered by our backwards compatibility guarantees; if you write code against stable releases, you shouldn't have any problems upgrading when the next official version is released.
pl: W ogólności, jeśli używasz kodu na produkcji, powinieneś używać stabilnego wydania. Projekt Django publikuje pełne stabilne wydanie co około dziewięć miesięcy, w międzyczasie publikując aktualizacje z poprawkami. Te stabilne wydania zawierają API, które pokryte jest przez nasze gwarancje kompatybilności wstecznej; jeśli piszesz kod dla stabilnych wydań, nie powinieneś mieć żadnych problemów podczas upgrade'u do następnej oficjalnej wersji.

source: FAQ: Databases and models
el: Συχνές Ερωτήσεις: Βάσεις δεδομένων και Μοντέλα
id: FAQ: Basisdata dan model
it: FAQ: Database e modelli
pl: Często zadawane pytania: Bazy danych i modele

source: How can I see the raw SQL queries Django is running?
el: Πως μπορώ να δω το SQL ερώτημα που κάνει το Django στο παρασκήνιο;
id: Bagaimana dapat Saya melihat permintaan SQL mentah sedang berjalan?
it: Come posso vedere le query in puro SQL mentre Django sta funzionando?
pl: Jak mogę zobaczyć surowe zapytania SQL uruchamiane przez Django?

source: Make sure your Django :setting:`DEBUG` setting is set to ``True``. Then do this:
pl: Upewnij się, że Twoje ustawienie Django :setting:`DEBUG` jest ustawione na ``True``. Następnie zrób to:

source: ``connection.queries`` is only available if :setting:`DEBUG` is ``True``. It's a list of dictionaries in order of query execution. Each dictionary has the following:
pl: ``connection.queries`` jest dostępne tylko jeśli :setting:`DEBUG` jest ustawione na ``True``. Jest to lista słowników w kolejności wykonania zapytania. Każdy słownik zawiera:

source: ``sql`` - The raw SQL statement
pl: ``sql`` – surowe zapytanie SQL

source: ``time`` - How long the statement took to execute, in seconds.
pl: ``time`` – ile czasu trwało wykonanie polecenia, w sekundach.

source: ``connection.queries`` includes all SQL statements -- INSERTs, UPDATES, SELECTs, etc. Each time your app hits the database, the query will be recorded.
el: Το ``connection.queries`` περιλαμβάνει όλες τις SQL εντολές -- INSERTs, UPDATES, SELECTs, κλπ. Κάθε φορά που η εφαρμογή σας (ο κώδικας, αν θέλετε) αλληλεπιδρά με τη βάση δεδομένων η εντολή θα καταγράφεται.
id: ``connection.queries`` termasuk semua pernyataan SQL -- INSERTs, UPDATES, SELECT, dll. Setiap kali aplikasi anda mengenai basisdata, permintaan akan direkam.
it: ``connection.queries`` include tutti gli statement SQL -- INSERT, UPDATES, SELECT, etc. Ogni volta la tua applicazione tocca il database, la query viene registrata.
pl: ``connections.queries`` zawiera wszystkie operacje SQL – INSERT-y, UPDATE-y, SELECT-y itp. Każde zapytanie twojej aplikacji do bazy danych zostanie zapisane.

source: If you are using :doc:`multiple databases</topics/db/multi-db>`, you can use the same interface on each member of the ``connections`` dictionary:
pl: Jeśli używasz :doc:`wielu baz danych</topics/db/multi-db>`, możesz użyć tego samego interfejsu na każdym elemencie słownika ``connections``:

source: If you need to clear the query list manually at any point in your functions, call ``reset_queries()``, like this::
it: Se hai bisogno di cancellare manualmente l'elenco delle query in qualsiasi punto delle tue funzioni, chiama ``reset_queries()``, in questo modo::
pl: Jeśli potrzebujesz wyczyścić ręcznie listę kwerend w dowolnym momencie w swoich funkcjach, wywołaj ``reset_queries()``, w ten sposób::

source: Can I use Django with a preexisting database?
pl: Czy mogę użyć Django z istniejącą bazą danych?

source: Yes. See :doc:`Integrating with a legacy database </howto/legacy-databases>`.
el: Βεβαίως. Δείτε στο άρθρο :doc:`Χρησιμοποιώντας μια υπάρχουσα βάση δεδομένων </howto/legacy-databases>`.
id: Ya. Lihat :doc:`memadukan dengan warisan basisdata </howto/legacy-databases>`.
it: Sì. Vedi :doc:`Integrating with a legacy database </howto/legacy-databases>`.
pl: Tak. Zobacz :doc:`Integracja ze starszą bazą danych </howto/legacy-databases>`.

source: If I make changes to a model, how do I update the database?
el: Αν κάνω αλλαγές σε κάποιο μοντέλο, πως ενημερώνω τη βάση δεδομένων;
id: Jika Saya membuat perubahan pada model, bagaimana Saya memperbaharui basisdata?
it: Se faccio dei cambiamenti a un modello, come posso aggiornare il database?
pl: Jeśli dokonam zmian w modelu, jak mogę zaktualizować bazę danych?

source: Take a look at Django's support for :mod:`schema migrations <django.db.migrations>`.
el: Ρίξτε μια ματιά στην υποστήριξη του Django για τα :mod:`schema migrations <django.db.migrations>`.
id: Lihatlah pada dukungan Django untuk :mod:`schema migrations <django.db.migrations>`.
it: Dai uno sguardo al supporto di Django per :mod:`schema migrations <django.db.migrations>`.
pl: Zajrzyj do pomocy Django na temat :mod:`migracji schematu <django.db.migrations>`.

source: If you don't mind clearing data, your project's ``manage.py`` utility has a :djadmin:`flush` option to reset the database to the state it was in immediately after :djadmin:`migrate` was executed.
el: Αν δεν ενδιαφέρεστε να διαγραφούν τα δεδομένα, το ``manage.py`` έχει την επιλογή :djadmin:`flush` η οποία επαναφέρει τη βάση δεδομένων στη κατάσταση που ήταν αμέσως μετά την εκτέλεση του :djadmin:`migrate`.
id: Jika anda tidak keberatan membersihkan data, kegunaan ``manage.py`` proyek anda mempunyai pilihan :djadmin:`flush` untuk mengatur kembali basisdata ke keadaan nya dengan segera setelah :djadmin:`migrate` dijalankan.
it: Se non ti preoccupa cancellare i dati, l'utility ``manage.py`` del tuo progetto ha una opzione :djadmin:`flush` per resettare il database allo stato in cui era immediatamente dopo l'esecuzione di :djadmin:`migrate` .
pl: Jeśli chcesz wyczyścić dane, narzędzie ``manage.py`` twojego projektu ma opcję :djadmin:`flush`, służącą do resetowania bazy danych do stanu, w którym była bezpośrednio po wykonaniu :djadmin:`migrate`.

source: Do Django models support multiple-column primary keys?
el: Υποστηρίζουν τα Django μοντέλα primary keys πολλαπλών-στηλών;
id: Apakah model Django mendukung primary key banyak kolom?
it: I modelli di Django supportano le chiavi primarie multicolonna?
pl: Czy modele Django wspierają wielokolumnowe klucze główne?

source: No. Only single-column primary keys are supported.
el: Όχι. Υποστηρίζονται μόνο τα primary keys που ανήκουν σε μια στήλη.
id: Tidak. Hanya primary key kolom-tunggal yang didukung.
it: No, solo le chiavi primarie a colonna singola sono supportate.
pl: Nie. Obsługiwane są jedynie jednokolumnowe klucze główne.

source: But this isn't an issue in practice, because there's nothing stopping you from adding other constraints (using the ``unique_together`` model option or creating the constraint directly in your database), and enforcing the uniqueness at that level. Single-column primary keys are needed for things such as the admin interface to work; e.g., you need a single value to specify an object to edit or delete.
it: Ma questo in pratica non è un problema, perché non c'è nulla che ti impedisca di aggiungere altri vincoli (usando l'opzione ``unique_together`` o creando il vincolo direttamente nel tuo database) e di imporre l'unicità a quel livello. Le chiavi primarie a colonna singola sono necessarie per far funzionare cose come l'interfaccia di amministrazione; ad esempio, è necessario un singolo valore per specificare un oggetto da modificare o eliminare.
pl: Ale w praktyce nie jest to problemem, ponieważ możesz dodać inne constrainty (używając opcji modelu ``unique_together`` lub tworząc constraint bezpośrednio w bazie danych) i wymusić unikalność na tym poziomie. Jednokolumnowe klucze obce są potrzebne do funkcjonowania rzeczy takich jak interfejs admina; na przykład potrzebujesz jednej wartości, by wskazać obiekt do edycji lub usunięcia.

source: Does Django support NoSQL databases?
el: Υποστηρίζονται οι βάσεις δεδομένων NoSQL στο Django;
id: Apakah Django mendukung basisdata NoSQL?
it: Django supporta i database NoSQL?
pl: Czy Django obsługuje bazy danych NoSQL?

source: NoSQL databases are not officially supported by Django itself. There are, however, a number of side projects and forks which allow NoSQL functionality in Django.
it: I database NoSQL non sono ufficialmente supportati da Django stesso. Esistono, tuttavia, numerosi progetti terzi e fork che consentono la funzionalità NoSQL in Django.
pl: NoSQL-owe bazy danych nie są oficjalnie wspierane przez Django jako takie. Jednakże jest kilka projektów pobocznych oraz forków, które wprowadzają funkcjonalność NoSQL w Django.

source: You can take a look on `the wiki page`_ which discusses some projects.
it: Si Può dare un'occhiata a: `the wiki page`_ che discute di alcuni progetti.
pl: Możesz spojrzeć na `stronę wiki`_, która omawia niektóre projekty.

source: How do I add database-specific options to my CREATE TABLE statements, such as specifying MyISAM as the table type?
el: Πως προσθέτω δικές μου επιλογές στις εντολές της βάσης δεδομένων CREATE TABLE, όπως προσδιορίζοντας το MyISAM ως τύπο πίνακα;
id: Bagaimana Saya menambah pilihan khusus-basisdata ke pernyataan CREATE TABLE saya, seperti menentukan MyISAM sebagai jenis tabel?
it: Come aggiungo opzioni specifiche del database ai mie statement CREATE TABLE, come ad esempio per specificare il tipo della tabella come MyISAM?
pl: Jak mogę dodać do wyrażenia CREATE TABLE specyficzne opcje dla bazy danych takie jak np. wskazanie typu tabeli jako MyISAM?

source: We try to avoid adding special cases in the Django code to accommodate all the database-specific options such as table type, etc. If you'd like to use any of these options, create a migration with a :class:`~django.db.migrations.operations.RunSQL` operation that contains ``ALTER TABLE`` statements that do what you want to do.
el: Προσπαθούμε να αποφύγουμε την εισαγωγή ειδικών περιπτώσεων στο κώδικα του Django όπως είναι ο τύπος του πίνακα κλπ, οι οποίες αφορούν επιλογές συγκεκριμένων βάσεων δεδομένων. Αν θέλετε να χρησιμοποιήσετε τέτοιου είδους επιλογές, δημιουργήστε ένα migration με τη λειτουργία :class:`~django.db.migrations.operations.RunSQL` η οποία θα περιέχει τις δηλώσεις του τύπου ``ALTER TABLE`` οι οποίες θα κάνουν αυτό που θέλετε.
id: Kami mencoba menghidnari menambahkan kasus khusus di kode Django untuk menampung semua pilihan basisdata-khusus seperti jenis tabel, dll. Jika anda ingin menggunakan salah satu pilihan ini, buat perpindahan dengan operasi :class:`~django.db.migrations.operations.RunSQL` yang mengandung pernyataan ``ALTER TABLE`` yang melakukan apa anda ingin lakukan.
it: Noi cerchiamo di evitare di aggiungere casi speciali nel codice di Django per permettere tutte le opzioni specifiche dei database, come il tipo di tabella, etc. Se vuoi usare alcune di queste opzioni, crea una migrazione :class:`~django.db.migrations.operations.RunSQL` con una operazione che contiene gli statement ``ALTER TABLE`` che fanno ciò che richiedi.
pl: Staramy się nie dodawać do Django obsługi specyficznych dla danej bazy danych opcji, np. typu tabeli itp. Jeśli chcesz użyć takich parametrów, stwórz migrację przy użyciu klasy :class:`~django.db.migrations.operations.RunSQL` zawierającej polecenie ``ALTER TABLE``, które możesz dowolnie skonfigurować.

source: For example, if you're using MySQL and want your tables to use the MyISAM table type, use the following SQL:
pl: Na przykład, jeśli korzystasz z MySQL-a i chcesz skorzystać z tabel typu MyISAM, użyj następującego zapytania SQL:

source: Troubleshooting
el: Αντιμετώπιση προβλημάτων
id: Menyelesaikan masalah
it: Risoluzione di problemi
pl: Rozwiązywanie problemów

source: This page contains some advice about errors and problems commonly encountered during the development of Django applications.
el: Αυτή η σελίδα περιέχει μερικές συμβουλές για σφάλματα και προβλήματα που προκύπτουν συχνά κατά τη διάρκεια ανάπτυξης των Django εφαρμογών.
id: Halaman ini mengandung beberapa saran tentang kesalahan dan masalah umum dihadapi selama pengembangan aplikasi Django.
it: Questa pagina contiene alcune avvertenze riguardo errori e problemi che si incontrano comunemente durante lo sviluppo di applicazioni Django.
pl: Ta strona zawiera porady dotyczące często występujących błędów i problemów podczas rozwijania aplikacji w Django.
