Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/glossary.po
Languages: it, pl, zh_hans

source: Glossary
it: Glossario
pl: Słownik
zh_hans: 术语

source: concrete model
it: modello reale
pl: model konkretny
zh_hans: 具体的模型

source: A non-abstract (:attr:`abstract=False <django.db.models.Options.abstract>`) model.
it: Un modello non astratto (:attr:`abstract=False <django.db.models.Options.abstract>`).
pl: Nieabstrakcyjny (:attr:`abstract=False <django.db.models.Options.abstract>`) model.
zh_hans: 一个非抽象 (:attr:`abstract=False <django.db.models.Options.abstract>`) 模型。

source: field
it: campo
pl: pole
zh_hans: 字段

source: An attribute on a :term:`model`; a given field usually maps directly to a single database column.
it: Un attributo di un a :term:`model`; un determinato campo di solito viene associato direttamente ad una singola colonna del database.
pl: Atrybut :term:`model`\u; pole zazwyczaj jest mapowane bezpośrednio na pojedynczą kolumnę bazy danych.
zh_hans: 一个属性在 :term:`model` 中; 一个给定的字段通常被映射到数据库表的一列上。

source: See :doc:`/topics/db/models`.
it: Vedi :doc:`/topics/db/models`.
pl: Zobacz :doc:`/topics/db/models`.
zh_hans: 参见 :doc:`/topics/db/models`。

source: generic view
it: vista generica
pl: widok generyczny
zh_hans: 通用视图

source: A higher-order :term:`view` function that provides an abstract/generic implementation of a common idiom or pattern found in view development.
it: Una funzione di :term:`view` di ordine superiore che fornisce un'implementazione astratta/generica di un idioma o schema diffuso nello sviluppo vista.
pl: Funkcja :term:`view` wyższego rzędu, która dostarcza abstrakcyjną lub generyczną implementację wspólnego idiomu lub wzorca dostępnego w dewelopmencie widoków.
zh_hans: 高阶的 :term:`view` 函数针对开发中常见的习惯用法或模式，提供了一种抽象/通用的实现。

source: See :doc:`/topics/class-based-views/index`.
it: Vedi :doc:`/topics/class-based-views/index`.
pl: Zobacz :doc:`/topics/class-based-views/index`.
zh_hans: 参见 :doc:`/topics/class-based-views/index`。

source: model
it: modello
zh_hans: 模型

source: Models store your application's data.
it: I modelli memorizzano i dati della tua applicazione.
pl: Modele przechowują dane aplikacji
zh_hans: 模型存储你的应用程序的数据。

source: "Model-template-view"; a software pattern, similar in style to MVC, but a better description of the way Django does things.
it: "Model-template-view"; un modello software, simile a MVC, che descrive però in modo migliore il funzionamento di Django.
pl: „Model-template-view”; wzorzec oprogramowania, podobny do MVC, ale w lepszy sposób opisuje, w jaki sposób robi to Django.
zh_hans: "模型-模板-数据"("Model-template-view"); 一种软件模式，风格类似于MVC，但是更好地描述了 Django 所做的事。

source: See :ref:`the FAQ entry <faq-mtv>`.
it: Vedi :ref:`voce FAQ <faq-mtv>`.
pl: Zobacz :ref:`wpis w FAQ <faq-mtv>`.
zh_hans: 参见 :ref:`the FAQ entry <faq-mtv>`。

source: `Model-view-controller`__; a software pattern. Django :ref:`follows MVC to some extent <faq-mtv>`.
it: `Model-view-controller`__; un modello software. Django :ref:`segue in qualche misura MVC <faq-mtv>`.
pl: `Model-view-controller`__; wzorzec w oprogramowaniu. Django :ref:`w pewnym stopniu spełnia MVC <faq-mtv>`.
zh_hans: `模型-视图-控制器`__; 一种软件开发模式。Django :ref:`基于 MVC 做了某些扩展 <faq-mtv>`。

source: project
it: progetto
pl: projekt
zh_hans: 项目

source: A Python package -- i.e. a directory of code -- that contains all the settings for an instance of Django. This would include database configuration, Django-specific options and application-specific settings.
it: Un pacchetto Python, ovvero una directory del codice, che contiene tutte le impostazioni relative ad un'istanza Django. Questo include la configurazione del database, le opzioni specifiche di Django e le impostazioni relative all'applicazione.
pl: Pakiet Pythona -- na przykład katalog z kodem -- który zawiera wszystkie ustawienia dla instancji Django. Zawiera się w tym konfiguracja bazy danych, ustawienia Django i ustawienia aplikacji.
zh_hans: 一个 Python 包 —— 即一个代码目录 -- 它包含 Django 的一个实例中所有的设置。这包括数据库配置，Django 的特定选项和特定应用程序设置。

source: property
it: proprietà
pl: właściwość
zh_hans: 属性

source: Also known as "managed attributes", and a feature of Python since version 2.2. This is a neat way to implement attributes whose usage resembles attribute access, but whose implementation uses method calls.
it: Anche conosciuta con il nome di "attributi gestiti", e una funzionalità di Python integrata a partire dalla versione 2.2. È un buon modo per implementare attributi, che assomiglia nel suo uso all'accesso attributi, ma la quale implementazione si serve di invocazioni di un metodo.
pl: Znana też jako „zarządzany atrybut” i funkcjonalność Pythona od wersji 2.2. To sprytna metoda, aby zaimplementować atrybuty, których użycie przypomina dostęp do atrybutów, ale których implementacja wykorzystuje wywołania metod.
zh_hans: 也被称为 "管理属性"，自 Python 2.2 版本起支持的功能。这是用一个巧妙的方法来实现的属性，其用法类似于属性的访问，但实现是调用方法。

source: See :class:`property`.
it: Vedi :classe:'proprietà'.
pl: Patrz :class:`property`.
zh_hans: 参见 :class:`property`。

source: queryset
zh_hans: 查询结果集

source: An object representing some set of rows to be fetched from the database.
it: Un oggetto che rappressenta un insieme di linee da estrarre dal database.
pl: Obiekt reprezentujący pewien zestaw wierszy do pobrania z bazy danych.
zh_hans: 一个对象表示了从数据库中取到的某些行。

source: See :doc:`/topics/db/queries`.
it: Vedi :doc:`/topics/db/queries`.
pl: Patrz :doc:`/topics/db/queries`.
zh_hans: 参见 :doc:`/topics/db/queries`。

source: slug
zh_hans: 斜杠

source: A short label for something, containing only letters, numbers, underscores or hyphens. They're generally used in URLs. For example, in a typical blog entry URL:
it: Una breve etichetta che identifica un oggetto e che contiene solo caratteri alfanumerici, trattini bassi o trattini d'unione. Sono generalmente utilizzate negli URLs. Per esempio in un tipico URL di un articolo di blog:
pl: Krótka etykieta dla czegoś, zawierająca tylko litery, cyfry, podkreślniki lub dywizy. Zazwyczaj używana w URL-ach. Na przykład w typowym URL-u wpisu na blogu:
zh_hans: 作为某些东西的简短标签，只能包含字母，数字，下划线或连字符。他们一般被用于 URL。例如，在一个典型的博客文章的网址：

source: the last bit (``spring``) is the slug.
it: l'ultimo elemento (``spring``) è lo slug.
pl: ostatni kawałek (``spring``) to slug.
zh_hans: 最末尾 (``spring``) 是一个斜杠。

source: template
pl: szablon
zh_hans: 模板

source: A chunk of text that acts as formatting for representing data. A template helps to abstract the presentation of data from the data itself.
it: Un pezzo di testo che agisce da base di formattazione per rappresentare i dati. Un modello aiuta a estrapolare i dati dalla loro rappresentazione.
pl: Kawałek tekstu, który zachowuje się jak formatowanie dla reprezentacji danych. Szablon pomaga wyodrębnić prezentację danych od samych danych.
zh_hans: 一个文本块，作为用来表示数据的格式。模板有助于从数据本身抽象地展示数据。

source: See :doc:`/topics/templates`.
it: Vedi :doc:`/topics/templates`.
pl: Zobacz :doc:`/topics/templates`.
zh_hans: 参见 :doc:`/topics/templates`。

source: view
it: vista
pl: widok
zh_hans: 视图

source: A function responsible for rendering a page.
it: Una funzione responsabile del rendering di una pagina.
pl: Funkcja odpowiedzialna za wyrenderowanie strony.
zh_hans: 负责渲染页面的函数。
