Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If you need to provide custom file storage -- a common example is storing files on some remote system -- you can do so by defining a custom storage class. You'll need to follow these steps:
it: Se necessiti di utilizzare un file storage personalizzato -- un esempio comune è salvare files su un sistema remoto -- puoi farlo definendo una classe di storage personalizzata. Dovrai seguire i seguenti passi:
ja: たとえばリモートシステム上にファイルを保存する場合、カスタムストレージクラスを定義することで、カスタムファイルストレージを作成することが可能です。使用するには以下の手順に従ってください。
ko: 만일 사용자 정의 파일 스토리지를 제공하고자 하는 경우 -- 흔한 예로 원격 시스템에 파일을 저장할 때 -- 사용자 정의 스토리지 클래스를 정의하면 됩니다. 다음 단계들을 진행해주세요.
pt_br: Se você precisa de um armazenador de arquivos customizados -- um exemplo comum é armazenar arquivos em algum sistema remoto -- você pode faze-lo definido uma classe de armazenamento customizada. Você precisará seguir estes passos:
zh_hans: 如果你需要提供自定义文件储存功能——一个普通的例子是，把文件储存在远程系统中——自定义一个存储类可以完成这一任务来完成。下面是需要完成的具体步骤：

source: Your custom storage system must be a subclass of ``django.core.files.storage.Storage``::
it: Il tuo sistema di storage personalizzato deve essere una sottoclasse di ``django.core.files.storage.Storage``::
ja: カスタムストレージシステムは ``django.core.files.storage.Storage`` のサブクラスでなければなりません。
ko: 당신의 커스텀 저장소 시스템은 ``django.core.files.storage.Storage``\의 하위 클래스여야만 합니다.
pt_br: O seu Sistema de armazenamento customizado deve ser uma subclasse de ``django.core.files.storage.Storage``::
zh_hans: 你自定义的存储系统必须为 ``Django.core.files.storage.Storage`` 的一个子类::

source: Django must be able to instantiate your storage system without any arguments. This means that any settings should be taken from ``django.conf.settings``::
it: Django deve essere in grado di istanziare il tuo sistema di storage senza nessun argomento. Ciò significa che qualsiasi impostazione deve essere reperita da ``django.conf.settings``::
ja: Django は引数なしでストレージシステムをインスタンス化できなければなりません。これは、次のように ``django.conf.settings`` からすべての設定を取る必要があることを意味します。
ko: Django는 어떤 인자없이도 너의 저장 시스템을 인스턴스화 할 수 있습니다. 이는 "django.conf.settings"로 부터 설정을 받아 사용한다는 것을 의미합니다.
pt_br: Django deve ser capaz de instanciar o seu sistema de armazenamento sem nenhum argumento. Isso significa que quaisquer definições devem ser tomada a partir de ``django.conf.settings``::
zh_hans: Django 必须能以无参数实例化你的存储系统。意味着所有设置都应从 ``dango.conf.settings`` 中获取::

source: Your storage class must implement the :meth:`_open()` and :meth:`_save()` methods, along with any other methods appropriate to your storage class. See below for more on these methods.
it: La tua classe di storage deve implementare i metodi :meth:`_open()` e :meth:`_save()`, insieme ad ogni altro metodo appropriato per la tua classe di storage. Vedi di seguito per sapere di più su questi metodi.
ja: カスタムストレージクラスには :meth:`_open()` と :meth:`_save()` メソッドが必要です。さらにストレージに必要なメソッドが他にもあれば定義します。こういったメソッドに関しては以降を参照してください。
ko: 당신의 저장 클래스는 적절한 다른 메소드와 함께 :meth:'_open()'과 :meth:'_save()' 메소드로 구현돼야합니다. 더 많은 메소드를 아래에서 볼 수 있습니다.
pt_br: A classe de armazenamento deve implementar os métodos :meth:`_open()` e :meth:`_save()`, além de qualquer outro método apropriado a sua classe. Veja abaixo mais sobre estes métodos.
zh_hans: 在你的存储类中，除了其他自定义的方法外，还必须实现 :meth:`_open()` 以及 :meth:`_save()` 方法。关于这些方法，详情请查看下面的信息。

source: In addition, if your class provides local file storage, it must override the ``path()`` method.
it: In aggiunta, se la tua classe fornisce un file storage locale, deve sovrascrivere il metodo ``path()``.
ja: さらにカスタムクラスがローカルファイルストレージを提供する場合は、 ``path()`` メソッドをオーバーライドする必要があります。
ko: 추가적으로, 만약 당신의 클래스가 로컬 파일 저장을 하면 "path()" 메소드로 오버라이드 되어야만 합니다.
pt_br: E mais, se sua classe permite armazenamento local de arquivo, esta deve sobrescrever o método ``path()``.
zh_hans: 另外，如果你的类提供了本地文件存储，它必须重写 ``path()`` 方法。

source: Your storage class must be :ref:`deconstructible <custom-deconstruct-method>` so it can be serialized when it's used on a field in a migration. As long as your field has arguments that are themselves :ref:`serializable <migration-serializing>`, you can use the ``django.utils.deconstruct.deconstructible`` class decorator for this (that's what Django uses on FileSystemStorage).
it: La tua classe di storage deve essere :ref:`deconstructible <custom-deconstruct-method>` così che possa essere serializzata quando è utilizzata in un campo all'interno di una migrazione. Fintanto che i tuoi campi hanno argomenti che sono essi stessi :ref:`serializable <migration-serializing>`, puoi usare il class decorator ``django.utils.deconstruct.deconstructible`` (è ciò che usa Django nel FileSystemStorage).
ja: ストレージクラスは :ref:`deconstructible <custom-deconstruct-method>` でなければならないので、マイグレーションのフィールドで使われたときにそれはシリアライズすることができます。フィールドがそれ自身 :ref:`serializable <migration-serializing>` である引数を持つ限り、これのために ``django.utils.deconstruct.deconstructible`` クラスデコレータを使うことができます (それが FileSystemStorage で Django が使うものです)。
ko: 너의 기억장치 클래스는:ref: '불변` 이여야 하는데, 이로 인해 마이그레이션내의 필드에서 기억장치 클래스가 직렬화되기 때문이다. 필드에 인수가 남아있는한:ref:'직렬가능한', 당신은 ``django.utils.deconstruct.deconstructible`` 클래스 데커레이터를 사용할 수 있다.(이 데커레이터가 Django가 파일체계기억장치에서 사용하는 것이다)
pt_br: Sua classe de armazenamento deve ser :ref:`"desconstruível" <custom-deconstruct-method>` para que possa ser "serializado" quando usado em um campo na "migration". Uma vez que seus campos têm argumentos que são eles mesmos :ref:`serializáveis <migration-serializing>`, é possível usar o "decorator"de classe ``django.utils.deconstruct.deconstructible`` para isso (que é usado pelo Django no FileSystemStorage).
zh_hans: 您的存储类必须是 :ref:`deconstructible <custom-deconstruct-method>`，以便在迁移中的字段上使用它时可以序列化。 只要你的字段有自己的参数 :ref:`serializable <migration-serializing>`，你可以使用 ``django.utils.deconstruct.deconstructible`` 类装饰器（这是 Django 在 FileSystemStorage 上使用的）。

source: By default, the following methods raise ``NotImplementedError`` and will typically have to be overridden:
it: Di default, i metodi seguenti sollevano un "NotImplementedError" e devono essere sovrascritti.
ja: デフォルトにおいて、以下に示すメソッドは ``NotImplementedError`` を発生させます。したがって一般的にオーバーライドする必要があります。
ko: 디폴트로, 다음의 메소드는 ``NotImplementedError``를 일으키고, 일반적으로 오버라이드 되어야 합니다.

source: Note however that not all these methods are required and may be deliberately omitted. As it happens, it is possible to leave each method unimplemented and still have a working Storage.
it: Nota comunque che non tutti questi metodi sono necessari a posso essere deliberatamente omessi. Come succede, è possibile lasciare tutti i metodi non implementati e avere uno Storage funzionante.
ja: ただし上のメソッドはすべてが必要というわけでもないため、意図的に省略することもできます。もし例外が発生してもそのメソッドを未実装のままにしておくことも可能であり、それでもストレージを動作させることはできます。
ko: 하지만 앞의 모든 메소드들이 필수적인 것은 아니며, 자율적으로 생략될 수 있다는 것을 유의하십시오. 그럴 경우에 각 메소드를 미구현 상태로 내버려 두면서도 작동하는 저장소를 만들 수 있습니다.
pt_br: Note porém que nem todos estes métodos são requeridos e talvez deliberadamente omitidos. Caso isso ocorra, é possível deixar cada método não implementado e ainda ter um armazenamento que funcione.
zh_hans: 可是，记住并非所有这些方法都是需要的，并且可能故意被省略。正因为如此，让每个方法未实现并仍然拥有一个可用储存是可能的。

source: By way of example, if listing the contents of certain storage backends turns out to be expensive, you might decide not to implement ``Storage.listdir()``.
it: A titolo di esempio, se fare la lista dei contenuti di alcuni backend di storage risulta dispendioso, potresti decidere di non implementare ``Storage.listdir()``.
ja: 特定のストレージバックエンドにおける内容一覧の取得には相当な手間がかかる、ということがわかったとします。その場合は ``Storage.listdir()`` の実装をしなくても構いません。
ko: 한 예시로, 만약 특정 콘텐츠를 지니고 있는 리스트를 백엔드에 저장하는게 고비용이 될 경우 당신은 ``Storage.listdir()``을 구현하지 않아도 된다.

source: Another example would be a backend that only handles writing to files. In this case, you would not need to implement any of the above methods.
it: Un altro esempio potrebbe essere un backend che scrive solamente su file. In questo caso potrebbe non essere necessario implementare nessuno dei metodi sopracitati.
ja: バックエンドとして、単にファイル出力だけを扱うものであったとします。この場合は、上のメソッドをすべて実装する必要がありません。
ko: 다른 예시로 파일을 쓰기만 하는 백엔드가 있는 경우 당신은 위의 메소드를 구현할 필요가 없을 수 있다.
pt_br: Outro exemplo seria um backend que só lida com a escrita de arquivos. Neste caso, não seria necessário implementar qualquer um dos métodos acima.
zh_hans: 另一个例子是只处理写入文件的后端。在这种情况下，你不需要实现上述任何方法。

source: Ultimately, which of these methods are implemented is up to you. Leaving some methods unimplemented will result in a partial (possibly broken) interface.
it: In ultimo, l'implementazione di questi metodi dipende da te. Lasciare alcuni metodi non implementati risulterà in un'interfaccia parziale (probabilmente non funzionante).
ja: 結局、上のメソッドを実装するかどうかは開発者次第です。メソッドのどれかを未実装のままにしておくというのは、一部分のみの (場合によっては壊れたままの) インターフェースとするということです。
ko: 궁극적으로, 어떠한 메소드가 구현될 것인가는 당신이 정할 수 있습니다. 몇 몇의 메소드를 미구현 상태로 내버려둔다면 완전하지 않은(혹은 망가진) 인터페이스를 낳을 것입니다.
pt_br: Em última análise, quais destes métodos são implementados depende de você. Deixando de implementar alguns métodos irá resultar em uma interface parcial (possivelmente quebrada).
zh_hans: 最终，你决定实现这些方法中的哪一个。一些方法未实现结果会生成部分（可能会损坏的）接口。

source: You'll also usually want to use hooks specifically designed for custom storage objects. These are:
it: Generalmente vorrai anche usare un hook disegnato appositamente per gli oggetti del custom storage. Questi sono:
ja: カスタムストレージオブジェクトに固有のフックメソッドを用意することもあるでしょう。以下があります。
ko: 당신은 또한 커스텀 저장 객체를 위해 특별히 제작된 훅을 사용하고 싶을 것입니다. 이것들은:
pt_br: Você também pode querer usar hooks feitos especificamente para objetos de storage personalizados. Estes são os seguintes:
zh_hans: 你可能也经常会用到专为自定义存储对象设计的钩子函数。他们是：

source: **Required**.
it: **Richiesto**.
ja: **必須**
ko: **필수**.
pt_br: **Obrigatório**.
zh_hans: **要求**。

source: Called by ``Storage.open()``, this is the actual mechanism the storage class uses to open the file. This must return a ``File`` object, though in most cases, you'll want to return some subclass here that implements logic specific to the backend storage system. The :exc:`FileNotFoundError` exception should be raised when a file doesn't exist.
ja: ``Storage.open()`` から呼び出されます。このストレージクラスにとって、ファイルを開くために実際に用いられる機能となります。バックエンドストレージシステムに固有のロジックを実装して、特定サブクラスのオブジェクトを戻り値としたい場合も多くありますが、このメソッドは必ず ``File`` オブジェクトを戻り値としなければなりません。ファイルが存在しない場合は、 :exc:`FileNotFoundError` 例外が発生します。

source: Called by ``Storage.save()``. The ``name`` will already have gone through ``get_valid_name()`` and ``get_available_name()``, and the ``content`` will be a ``File`` object itself.
it: Chiamato da ``Storage.save()``. ``name`` sarà già passato attraverso ``get_valid_name()`` e ``get_available_name()``, e ``content`` sarà un oggetto ``File`` .
ja: ``Storage.save()`` から呼び出されます。``name`` は ``get_valid_name()`` や ``get_available_name()`` を通じて得られたものであり、``content`` は ``File`` オブジェクトそのものです。
ko: ``Storage.save()``으로 호출되다. "name" 은 ``get_valid_name()`` 과 ``get_available_name()`` 을 이미 통과했을 것이고, ``content`` 는 ``파일`` 객체 자신이 될 것이다.
pt_br: Chamado por `` Storage.save () ``. O `` name`` já terá passado por `` get_valid_name ()`` e ``get_available_name ()``, e o` `content`` será ele mesmo um objeto ``File``.
zh_hans: 被称为 ``Storage.save()``。这个 ``name`` 会早已经历 ``get_valid_name()`` 和 ``get_available_name()``，并且 ``content`` 将会成为 ``File`` 对象自身。

source: Should return the actual name of the file saved (usually the ``name`` passed in, but if the storage needs to change the file name return the new name instead).
ja: 戻り値は、実際に保存されたファイルの名前です (通常は処理された ``name`` ですが、ストレージがファイル名を変更する必要がある場合には、新たな名前を返す必要があります)。

source: Returns a filename suitable for use with the underlying storage system. The ``name`` argument passed to this method is either the original filename sent to the server or, if ``upload_to`` is a callable, the filename returned by that method after any path information is removed. Override this to customize how non-standard characters are converted to safe filenames.
it: Restituisce un nome di file idoneo all'uso con il sottostante sistema di memorizzazione. L'argomento ``name`` passato a questo metodo o è il nome del file inviato al server o, se ``upload_to`` è un metodo richiamabile, è il nome del file restituito da quel metodo dopo avere rimosso ogni informazione sul path. Effettua l'override di questo per personalizzare il modo di convertire i caratteri non-standard in nomi di file sicuri.
ja: ベースとなるストレージシステムで使用するのに適したファイル名を返します。このメソッドに渡される ``name`` 引数は、サーバに送信された元のファイル名か、 ``upload_to`` が呼び出し可能オブジェクトの場合、そのメソッドがパス情報を削除した後に返すファイル名です。非標準文字を安全なファイル名に変換する方法をカスタマイズするには、これをオーバーライドします。
ko: 기본 저장 시스템에 사용할 수 있는 파일 이름을 반환합니다. 이 메서드에 전달된 "name" 호출 인자는 서버에 전송된 원래의 파일 이름이거나 "Upload_to"가 호출 가능한 경우 경로 정보가 제거된 후 해당 메서드에 의해 반환된 파일 이름입니다. 표준 문자가 아닌 문자가 안전한 파일 이름으로 변환되는 방법을 커스터마이즈하려면 이 옵션을 재정의하십시오.
pt_br: Retorna um nome de arquivo adequado para uso com o sistema de armazenamento subjacente. O argumento ``name`` passado para esse método é o nome do arquivo original enviado para o servidor ou, se `` upload_to`` é um "callable" (método), o nome do arquivo retornado por esse método depois de qualquer informação de caminho é removido. Substitua isso para customizar como caracteres fora de padrão são convertidos para nomes de arquivos seguros.
zh_hans: 返回适用于底层存储系统的文件名。 传递给此方法的 ``name`` 参数既不是发送给服务器的原始文件名，如果 ``upload_to`` 是可调用的，则在删除任何路径信息后由该方法返回的文件名。 重写此操作可以自定义如何将非标准字符转换为安全文件名。

source: The code provided on ``Storage`` retains only alpha-numeric characters, periods and underscores from the original filename, removing everything else.
it: Il codice fornito in ``Storage`` conserva dai nomi originali dei file solo i caratteri alfanumerici, i punti e i trattini bassi, rimuovendo qualunque altra cosa.
ja: ``Storage`` において実装されているコードにおいては、元々のファイル名の中から、アルファベット、数字、ピリオド、アンダースコアのみが保持され、それ以外は取り除かれます。
ko: "Storage"에 제공된 코드는 원래 파일 이름에서 영숫자, 마침표 및 밑줄만 유지하며 다른 모든 것을 제거한다.
pt_br: O código fornecido em `` Storage`` guarda apenas os caracteres alfanuméricos, períodos e "underscore" do nome do arquivo original, removendo qualquer outra cosa.
zh_hans: “Storage”上提供的代码仅保留原始文件名中的字母数字字符，句点和下划线，并删除其他所有内容。

source: Returns an alternative filename based on the ``file_root`` and ``file_ext`` parameters. By default, an underscore plus a random 7 character alphanumeric string is appended to the filename before the extension.
it: Restituisce un nome del file alternativo basato sui parametrio ``file_root`` e ``file_ext``. Di default, al nome del file viene appesa una stringa con un underscore e 7 caratteri casuali, prima dell'estensione.
ja: "file_root"と"file_ext"のパラメーターを基に新たなファイルネームを返します。デフォルトでは、ファイルネームの拡張子の前にアンダーバーとランダムな7文字の英数字の文字列を加えます。
ko: "file_root" 및 "file_ext" 매개 변수를 기준으로 대체 파일 이름을 반환합니다. 기본적으로 확장명 앞에 밑줄과 임의의 7자 영숫자 문자열이 파일 이름에 추가됩니다.

source: Returns a filename that is available in the storage mechanism, possibly taking the provided filename into account. The ``name`` argument passed to this method will have already cleaned to a filename valid for the storage system, according to the ``get_valid_name()`` method described above.
it: Restituisce un nome di file che sia disponibile nel sistema di memorizzazione, possibilmente prendendo in considerazione il nome del file fornito. L'argomento ``name`` passato a questo metodo dovrà essere già trasformato per essere un nome di file valido per il sistema di memorizzazione, in accordo al metodo ``get_valid_name()`` descritto precedentemente.
ja: ストレージシステムにおいて利用可能なファイル名を返します。これは指定されたファイル名をできるかぎり考慮に入れた名称です。本メソッドに受け渡される ``name`` 引数は、上に示した ``get_valid_name()`` メソッドを用いて、ストレージシステムが扱うファイル名として正常化されたものにします。
ko: 저장 메커니즘에서 사용할 수 있는 파일 이름을 반환합니다. 제공된 파일 이름을 고려할 수 있습니다. 위에서 설명한 "get_valid_name()" 방법에 따르면 이 방법에 전달된 "name" 인수는 이미 스토리지 시스템에 유효한 파일 이름으로 정리될 것입니다.
pt_br: Retorna um nome de arquivo que está disponível no mecanismo de armazenamento, possivelmente levando em conta o nome do arquivo fornecido. O argumento ``name`` passado para este método já terá sido limpo para um nome de arquivo válido para o sistema de armazenamento, de acordo com o `` get_valid_name () `` método descrito acima.
zh_hans: 返回存储机制中可用的文件名，可能会考虑提供的文件名。 根据上述 ``get_valid_name()`` 方法，传递给此方法的 ``name`` 参数已经被清除为一个对存储系统有效的文件名。

source: The length of the filename will not exceed ``max_length``, if provided. If a free unique filename cannot be found, a :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` exception is raised.
it: La lunghezza del nome del file non supererà ``max_length``, se indicata. Se non sarà trovato un nome di file univoco libero, verrà sollevata una eccezione :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` .
ja: ``max_length`` を指定した場合、ファイル名の長さはそれを越えないようにします。適切に一致するファイル名が見つからなかった場合は、例外 :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` が発生します。
ko: 파일 이름의 길이는 제공되는 경우 "max_length"를 초과하지 않는다. 사용 가능한 고유 파일 이름을 찾을 수 없는 경우 a:exc:의심스러운 파일 작업 <django.core.exceptions.SuspiciousOperation >의 예외가 발생했습니다.
pt_br: O comprimento do nome do arquivo não será superior a `` max_length``, se informado. Se um nome de arquivo único não pode ser encontrado, a: exc: `SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation> `Exceção é gerada.
zh_hans: 返回的文件名的长度不会超过 ``max_length``，如果该参数被提供的话。若找不到一个可用的独一无二的文件名，则抛出一个 :exc:`SuspiciousFileOperation <django.core.exceptions.SuspiciousOperation>` 异常。

source: If a file with ``name`` already exists, ``get_alternative_name()`` is called to obtain an alternative name.
it: se un file con "nome" esiste già, viene chiamato "get_alternative_name()" per ottenere un nome alternativo
ja: ``name`` というファイルが既に存在する場合、 ``get_alternative_name()`` が代わりの名前を得るために呼び出されます。
ko: ``name``이 이미 존재하는 파일일 경우``get_alternative_name ()``가 호출되어 대체이름을 얻습니다.

source: Use your custom storage engine
ja: カスタムのストレージエンジンを使用する

source: The first step to using your custom storage with Django is to tell Django about the file storage backend you'll be using. This is done using the :setting:`STORAGES` setting. This setting maps storage aliases, which are a way to refer to a specific storage throughout Django, to a dictionary of settings for that specific storage backend. The settings in the inner dictionaries are described fully in the :setting:`STORAGES` documentation.
ja: Django でカスタムストレージを使うための最初のステップは、利用するファイルストレージバックエンドを Django に伝えることです。これは :setting:`STORAGES` 設定で行います。この設定は、Django を通して特定のストレージを参照するためのエイリアスを、ストレージバックエンドを定義する辞書にマッピングします。この辞書の内部的な設定については、 :setting:`STORAGES` ドキュメントで詳しく説明しています。

source: How to write custom lookups
it: Come scrivere lookup personalizzati
ja: カスタムのルックアップを書く

source: Django offers a wide variety of :ref:`built-in lookups <field-lookups>` for filtering (for example, ``exact`` and ``icontains``). This documentation explains how to write custom lookups and how to alter the working of existing lookups. For the API references of lookups, see the :doc:`/ref/models/lookups`.
it: Django offre una ampia varietà di :ref:`built-in lookups <field-lookups>` per la selezione (per esempio, ``exact`` e ``icontains``). Questo documento spiega come scrivere criteri di ricerca personalizzati e come modificare il comportamento di quelli esistenti. Per i riferimenti alle API dei criteri di ricerca, vedi :doc:`/ref/models/lookups`.
ja: Django には (たとえば ``exact`` や ``icontains`` などの) フィルタリングを行う :ref:`組み込みのルックアップ<field-lookups>` がたくさんあります。このドキュメントでは、カスタムルックアップを作る方法や、既存のルックアップの動作を変更する方法について説明します。ルックアップの API リファレンスについては :doc:`/ref/models/lookups` を参照してください。
ko: django는 필터링(예: "exeact" 및 "icontains")을 위한 다양한 ref:'내장 검색'을 제공한다. 이 문서에서는 사용자 정의 룩업을 작성하는 방법과 기존 조회의 작업을 변경하는 방법에 대해 설명합니다. 조회에 대한 API 참조는 :doc:'/ref/models/lookups'를 참조하십시오.
pt_br: Django oferece uma grande variedade de: ref: `pesquisas embutidos <field-lookups> `Para filtragem (por exemplo,` `e` `exact`` icontains``). Esta documentação explica como escrever lookups personalizadas e como alterar o funcionamento de lookups existentes. Para as referências da API de lookups, consulte o: doc: `/ ref / models / lookups`.
zh_hans: Django 提供了各种各样的 :ref:`内置查询器 <field-lookups>` （例如， ``exact`` 和 ``icontains`` ）。本文档解释了如何编写自定义查询器以及如何更改已有查询器的工作方式。 有关 lookup 的 API 参考，请参阅 :doc:`/ref/models/lookups`。

source: A lookup example
it: Un esempio di criterio di ricerca
ja: ルックアップの例
ko: 조회 예제

source: Let's start with a small custom lookup. We will write a custom lookup ``ne`` which works opposite to ``exact``. ``Author.objects.filter(name__ne='Jack')`` will translate to the SQL:
it: Iniziamo con un piccolo lookup custom. Scriveremo un lookup custom ``ne`` che lavora in modo opposto ad ``exact``. ``Author.objects.filter(name__ne='Jack')`` si tradurrà nell'SQL:
ja: 簡単なカスタムルックアップから始めましょう。``exact`` と逆の動作をするカスタムルックアップ ``ne`` を実装していきます。 ``Author.objects.filter(name__ne='Jack')`` は次の SQL に変換されます。
ko: 소규모 사용자 맞춤 조회부터 시작하겠습니다. 우리는 "exact"와 상반되는 맞춤형 조회 "ne"을 작성할 것이다. "Author.objects.filter(name__ne = 'Jack')는 SQL로 변환됩니다.

source: This SQL is backend independent, so we don't need to worry about different databases.
it: Questo comando SQL è indipendente dal backend, non ci dobbiamo quindi preoccupare di differenti basi di dati.
ja: この SQL はバックエンドに依存しない書き方になっているため、別のデータベースについて心配する必要はありません。
ko: 이 SQL은 백엔드에 독립적이어서 다른 데이터베이스에 대해서 염려를 안해도 됩니다.
pt_br: Este SQL é independente, por isso, não precisa se preocupar com os bancos de dados diferentes.
zh_hans: SQL 会自动适配不同的后端，所以我们不需要为使用不同的数据库而担心。

source: There are two steps to making this work. Firstly we need to implement the lookup, then we need to tell Django about it::
it: Sono richiesti due passaggi per farlo funzionare. Primo devi implementare il criterio di ricerca, poi occorre dichiaralo in Django.
ja: カスタムルックアップを動作させるためには2つのステップが必要です。まず最初にルックアップを実装し、続いてDjangoに実装したルックアップを認識させる必要があります。
ko: 이 작업을 수행하는 데는 두 가지 단계가 있습니다. 먼저 조회를 구현한 후 Django에게 다음과 같이 알려야 합니다.

source: To register the ``NotEqual`` lookup we will need to call ``register_lookup`` on the field class we want the lookup to be available for. In this case, the lookup makes sense on all ``Field`` subclasses, so we register it with ``Field`` directly::
it: Per registrare il lookup ``NotEqual`` dovremo chiamare ``register_lookup`` sul campo della classe in cui vogliamo che il lookup sia disponibile. In questo caso, il lookup ha senso su tutte le sottoclassi ``Field``, così possiamo registrarlo direttamente con ``Field``::
ja: ``NotEqual`` ルックアップを登録するために、ルックアップを有効にしたいフィールドクラスの ``register_lookup`` を呼び出す必要があります。今回実装したルックアップは ``Field`` クラスの全てのサブクラスに適用できるため、 ``Field`` クラスに直接登録しましょう。
ko: ``NotEqual`` 조회를 등록하기 위해서는 우리가 원하는 현장수업을 ``register_lookup`` 라고 불러야 할 것이다. 이 경우, 모든 "Field" 하위 클래스에 대한 조회가 타당하므로 "Field"에 직접 등록한다.

source: Lookup registration can also be done using a decorator pattern::
it: La registrazione di un criterio di ricerca si puo' fare anche usando un modello decoratore::
ja: ルックアップの登録は、デコレーターパターンを使って行うこともできます。
ko: decorator 패턴을 사용하여 조회 등록을 수행 할 수 있습니다.
pt_br: O registro da "lookup" também pode ser feito usando um pattern decorador ::
zh_hans: 查询器注册也可以用修饰模式来完成::
