Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The function returns a ``CurrentTimeNode`` with everything the node needs to know about this tag. In this case, it passes the argument -- ``"%Y-%m-%d %I:%M %p"``. The leading and trailing quotes from the template tag are removed in ``format_string[1:-1]``.
it: La funzione restituisce un ``CurrentTimeNode`` con tutto ciò di cui il nodo ha bisogno di sapere circa questo tag. In questo caso, passa l'argomento --``"%Y-%m-%d %I:%M %p"``. Le virgolette in testa ed in coda dal tag di template sono rimosse in ``format_string[1:-1]``.
ja: この関数は、ノードがこのタグについて知る必要があるすべての情報を含む ``CurrentTimeNode`` を返します。この場合、引数 ``"%Y-%m-%d %I:%M %p"`` を渡します。 ``format_string[1:-1]`` では、テンプレートタグの先頭と末尾の引用符が取り除かれます。
ko: 이 기능은 노드가 이 태그에 대해 알아야 할 모든 것을 포함한 "Current TimeNode"를 반환합니다. 이 경우 이는 "%Y-%m-%I:%M"이라는 논리를 통과한다. 템플릿 태그의 선행 및 후행 따옴표는 ``format_string[1:-1]"에서 제거됩니다.

source: The parsing is very low-level. The Django developers have experimented with writing small frameworks on top of this parsing system, using techniques such as EBNF grammars, but those experiments made the template engine too slow. It's low-level because that's fastest.
it: Il parsing è molto di basso livello. Gli sviluppatori di Django hanno sperimentato nello scrivere piccoli framework su questo sistema di parsing, usando tecniche con le grammatiche EBNF, ma questi esperimenti hanno reso il motore di template troppo lento. E' di basso livello perchè in questo modo è più veloce.
ja: 構文解析は非常に低レベルです。Django の開発者は、 EBNF 文法などのテクニックを使って、この構文解析システムの上に小さなフレームワークを書く実験をしましたが、 その実験ではテンプレートエンジンが遅すぎました。 低レベルなのは、それが最速だからです。
ko: 구문 분석은 매우 낮은 수준입니다. Django 개발자들은 EBNF 문법과 같은 기술을 사용하여 이 구문 분석 시스템 위에 작은 프레임워크를 쓰는 것을 실험했지만, 그러한 실험들은 템플릿 엔진을 너무 느리게 만들었다. 가장 빠르기 때문에 낮은 수준입니다.
pt_br: O analisador é muito baixo nível. Os desenvolvedores do Django experimentaram escrever pequenos frameworks baseados no sistema analisador ("parser"), usando técnicas como a gramática EBNF, mas estes experimentos tornaram o motor de template muito lento. É baixo-nível porque é rápido.
zh_hans: 这种解析是很低级的。Django 开发者已试着在该解析系统之上编写小型解析框架，使用类似 EBNF 语法，但这些尝试使得模板引擎运行的很慢。低级意味着快。

source: Writing the renderer
it: Scrivere il renderer
ja: レンダラーの書き方
ko: 렌더러 작성
pt_br: Escrevendo o "renderizador"
zh_hans: 编写渲染器

source: The second step in writing custom tags is to define a ``Node`` subclass that has a ``render()`` method.
it: Il secondo passo nello scrivere tag personalizzati è definire una sottoclasse ``Node`` che ha un metodo ``render()``.
ja: カスタムタグを書く2つ目のステップは、 ``render()`` メソッドを持つ ``Node`` サブクラスを定義することです。
pt_br: O segundo passo para escrever uma tag personalizada é definir uma subclasse de ``Node`` que tenha um método ``render()``.
zh_hans: 编写自定义标签的第二步是定义一个 ``Node`` 子类，带有一个 ``render()`` 方法。

source: Continuing the above example, we need to define ``CurrentTimeNode``::
it: Continuando l'esempio precedente, dobbiamo definire ``CurrentTimeNode``::
ja: 上記の例の続きで、 ``CurrentTimeNode`` を定義する必要があります:
ko: 위의 예를 계속하면서 우리는 ``Current TimeNode"를 정의해야 한다.
pt_br: Continuando o exemplo acima, precisamso definir ``CurrentTimeNode``::
zh_hans: 承接上述例子，我们需要定义 ``CurrentTimeNode``::

source: ``__init__()`` gets the ``format_string`` from ``do_current_time()``. Always pass any options/parameters/arguments to a ``Node`` via its ``__init__()``.
it: ``__init__()`` prende ``format_string`` da ``do_current_time()``. Passa sempre qualsiasi opzione/parametro/argomento ad un ``Node`` tramite il suo ``__init__()``.
ja: ``__init__()`` は ``do_current_time()`` から ``format_string`` を取得します。オプションやパラメータ、引数は常に ``Node`` の ``__init__()`` から渡します。
ko: "_init__()"는 "do_current_time"로부터 "format_string"을 얻는다. 옵션/매개변수/논란을 항상 "_init__()"를 통해 "노드"에 전달한다.
pt_br: ``__init__()`` recebe o ``format_string`` do ``do_current_time()``. Sempre passar opções/parametros/argumentos para um ``Node`` através de seu ``__init__()``.
zh_hans: ``__init__()`` 从 ``do_current_time()`` 获取 ``format_string``。总是通过 ``节点`` 的 ``__init__()`` 方法为其传入 options/parameters/arguments。

source: The ``render()`` method is where the work actually happens.
it: Il metodo ``render()`` è dove viene fatto il lavoro vero e proprio.
ja: ``render()`` メソッドは、実際に処理が行われる場所です。
ko: "렌더() 방식"은 그 일이 실제로 일어나는 곳이다.
pt_br: O método ``render()`` é onde o trabalho realmente acontece
zh_hans: ``render()`` 方法是实际干活的地方。

source: ``render()`` should generally fail silently, particularly in a production environment. In some cases however, particularly if ``context.template.engine.debug`` is ``True``, this method may raise an exception to make debugging easier. For example, several core tags raise ``django.template.TemplateSyntaxError`` if they receive the wrong number or type of arguments.
it: ``render()`` generalmente dovrebbe fallire in modo silenzioso, in particolare in un ambiente di produzione. In qualche caso tuttavia, specialmente se ``context.template.engine.debug`` è impostato a ``True``, questo metodo può sollevare una eccezione per facilitare il debugging. Per esempio, molti tag core sollevano ``django.template.TemplateSyntaxError`` se ricevono un numero di argomenti sbagliato.
ja: 特に実運用環境では、 ``render()`` は通常は静かに失敗するべきです。しかし、場合によっては、特に ``context.template.engine.debug`` が ``True`` の場合、このメソッドはデバッグを容易にするために例外を発生させることがあります。例えば、いくつかのコアタグは、引数の数や型を間違えると ``django.template.TemplateSyntaxError`` を発生させます。
ko: ``고장"은 일반적으로, 특히 생산 환경에서 묵묵히 실패해야 한다. 그러나 경우에 따라서는 특히 ``context.template.engine.debug"가 "true"인 경우 이 방법은 디버깅을 쉽게 하기 위해 예외를 발생시킬 수 있다. 예를 들어 몇 개의 핵심 태그가 ``django.template"을 올린다.잘못된 인수 번호나 유형의 인수를 수신하는 경우 'TemplateSyntaxError'를 선택합니다.
pt_br: ``render()`` deve geralmente falhar silenciosamente, particularmente no ambiente de produção. Em alguns casos porém, particularmente se ``context.template.engine.debug`` for ``True``, este método pode indicar uma exceção para ficar mais fácil debugar. Por exemplo, muitas tags do core inviam ``django.template.TemplateSyntaxError`` se eles receberem o número errado ou tipo de argumentos.
zh_hans: ``render()`` 应该无声失败，尤其是在生产环境。不过，某些场景下，尤其是 ``context.template.engine.debug`` 为 ``True`` 时，该方法可能抛出一个异常，简化调式流程。例如，某些核心标签在接受个数不对的参数时抛出 ``django.template.TemplateSyntaxError``。

source: Ultimately, this decoupling of compilation and rendering results in an efficient template system, because a template can render multiple contexts without having to be parsed multiple times.
it: In ultimo, questo disaccoppiamento tra compilazione e rendering ha come risultato un sistema di template efficiente, perchè un template può fare render di diversi contesti senza dover essere analizzato più volte.
ja: 最終的に、コンパイルとレンダリングを切り離すことで、効率的なテンプレートシステムが実現します。なぜなら、テンプレートは何度もパースされることなく、複数のコンテキストをレンダリングできるからです。
ko: 결국, 컴파일과 렌더링의 이러한 디커플링은 효율적인 템플릿 시스템이 됩니다. 왜냐하면 템플릿은 여러 번 구문 분석할 필요 없이 여러 컨텍스트를 렌더링할 수 있기 때문입니다.
pt_br: Por último, este desacomplamento entre compilação e renderização resulta em um sistema de template mais eficiente, porque o template pode renderizar múltiplos contextos ser ter que ser analisado ("parsed") múltiplas vezes.
zh_hans: 最终，这种对编译和渲染的解耦会产生一个高效的模板系统，因为一个模板无需多次解析就能渲染多个上下文。

source: Auto-escaping considerations
it: Considerazioni sull'auto-escape
ja: 自動エスケープに関する注意点
ko: 자동 회피 고려 사항
pt_br: Considerações sobre auto-substituição
zh_hans: 自动转义的注意事项

source: The output from template tags is **not** automatically run through the auto-escaping filters (with the exception of :meth:`~django.template.Library.simple_tag` as described above). However, there are still a couple of things you should keep in mind when writing a template tag.
it: L'output da template tag **non è** automaticamente passato ai filtri di auto-escape (con l'eccezione di :meth:`~django.template.Library.simple_tag` come descritto sopra). Comunque, ci sono ancora un paio di cose che dovresti tenere a mente quando scrivi un tag di template.
ja: テンプレートタグからの出力は自動エスケープフィルタに自動的に通されることは **ありません** (上で説明した :meth:`~django.template.Library.simple_tag` は例外です)。しかし、テンプレートタグを書く際に注意すべき点がいくつかあります。
ko: 템플릿 태그의 출력은 ****가 아니며 자동 이스케이프 필터를 통해 자동으로 실행됩니다( :meth:'~django.template 제외).위에서 설명한 Library.simple_tag'입니다. 그러나 템플릿 태그를 작성할 때 기억해야 할 몇 가지 사항이 있습니다.
pt_br: A saída da tag de template *não* passa automaticamente pelos filtros de auto-substituição (com exceção do :meth:`~django.template.Library.simple_tag` como descrito acima). Porém, ainda existem algumas coisas para se ter em mente quando escrever uma tag de template.
zh_hans: 模板标签的输出 **不会** 自动通过自动转义过滤器（除了上述的 :meth:`~django.template.Library.simple_tag` 之外）。不过，在编写模板标签时，你仍需牢记几点。

source: If the ``render()`` method of your template tag stores the result in a context variable (rather than returning the result in a string), it should take care to call ``mark_safe()`` if appropriate. When the variable is ultimately rendered, it will be affected by the auto-escape setting in effect at the time, so content that should be safe from further escaping needs to be marked as such.
it: Se il metodo ``render()`` del tuo template tag immagazzina il risultato in una variabile di contesto (piuttosto che restituirlo in una stringa), dovrebbe fare attenzione a chiamare ``mark_safe()`` quando è opportuno. Quando la variabile viene resa, alla fine, in quel momento sarà influenzata dalle impostazioni di auto-escape, così il contenuto che dovrebbe essere sicuro rispetto ad un ulteriore escaping dovrebbe essere marcato come tale.
ja: テンプレートタグの ``render()`` メソッドが(結果を文字列で返すのではなく)コンテキスト変数に結果を格納する場合、適切であれば ``mark_safe()`` を呼び出すように注意しなければなりません。変数が最終的にレンダリングされるとき、その時点で有効な自動エスケープ設定の影響を受けます、そのため、さらなるエスケープから安全であるべきコンテンツは、そのようにマークされる必要があります。
ko: 템플릿 태그의 ''렌더()'' 방식이 결과를 문자열로 반환하는 것이 아니라 컨텍스트 변수에 저장한다면 적절하다면 ``mark_safe()"라고 부르는 것이 좋다. 변수가 궁극적으로 렌더링될 때, 그것은 그 당시에 유효한 자동 탈출 설정의 영향을 받게 되므로, 추가 탈출로부터 안전해야 하는 콘텐츠는 다음과 같이 표시해야 한다.

source: Also, if your template tag creates a new context for performing some sub-rendering, set the auto-escape attribute to the current context's value. The ``__init__`` method for the ``Context`` class takes a parameter called ``autoescape`` that you can use for this purpose. For example::
it: Inoltre, se il tuo tag di template crea un nuovo contesto per fare qualche sotto-rendering, imposta l'attributo di auto-escape al valore corrente di contesto. Il metodo ``__init__`` per la classe ``Context`` prende un parametro chiamato ``autoescape`` che puoi usare per questo scopo. Per esempio::
ja: また、テンプレートタグがサブレンダリングを行うために新しいコンテキストを作成する場合、auto-escape 属性に現在のコンテキストの値を指定します。 ``Context`` クラスの ``__init__`` メソッドはこの目的で使用できる ``autoescape`` というパラメータを受け取ります。例えば:
ko: 또한 템플릿 태그가 일부 하위 렌더링을 수행하기 위한 새 컨텍스트를 만드는 경우 자동 이스케이프 속성을 현재 컨텍스트 값으로 설정하십시오. ``_init__"의 문맥 계급 방법은 당신이 이 목적을 위해 사용할 수 있는 ``자동 탈출"이라는 매개 변수를 취한다. 예:
pt_br: Também, se sua tag cria um novo contexto para realizar algum sub renderização, defina o atributo de auto-substituição para o valor do contexto corrente. O método ``__init__`` da classe ``Context`` recebe um parâmetro chamado ``autoescape`` que pode ser usado para este propósito. Por exemplo::
zh_hans: 同理，如果你的模板标签为某些子渲染进程创建了新的上下文，那么就需要将当前上下文对应的自动转义属性传入。 ``Context`` 类的方法 ``__init__`` 的参数 ``autoescape`` 就是为此目的设计的。例如::

source: This is not a very common situation, but it's useful if you're rendering a template yourself. For example::
it: Non è una situazione molto comune, ma è utile se si fa rendering di un template da soli. Per esempio::
ja: これはあまり一般的な状況ではありませんが、テンプレートを自分でレンダリングする場合に便利です。例えば:
ko: 이는 매우 흔한 상황은 아니지만 만약 당신이 템플릿을 스스로 렌더링한다면 유용하다. 예를 들어::
pt_br: Isso não é uma situação muito comum, mas é útil se você está renderizando você mesmo o template. Por exemplo::
zh_hans: 该场景不常见，但在自助渲染模板时很有用。例如::

source: If we had neglected to pass in the current ``context.autoescape`` value to our new ``Context`` in this example, the results would have *always* been automatically escaped, which may not be the desired behavior if the template tag is used inside a :ttag:`{% autoescape off %}<autoescape>` block.
it: Se non ci fossimo curati di passare il valore ``context.autoescape`` al nostro nuovo ``Context`` in questo esempio, sui risultati sarebbe *sempre* stato fatto automaticamente escape, il che avrebbe potuto non essere il comportamento desiderato se il tag di template fosse stato usato in un blocco :ttag:`{% autoescape off %}<autoescape>`
ja: もしこの例で、現在の ``context.autoescape`` の値を新しい ``Context`` に渡すのを怠っていたら、結果は *常に* 自動的にエスケープされていたでしょう。これは、テンプレートタグが :ttag:`{% autoescape off %}<autoescape>` ブロックの中で使用されている場合、望ましい動作ではないかもしれません。
ko: 만약 우리가 현재의 ``상황"에서 통과를 소홀히 했다면 좋았을 것이다.이 예에서 우리의 새로운 "컨텍스트"에 대한 자동 이스케이프' 값은 *항상* 자동으로 이스케이프되었을 것이며, 템플릿 태그를 :ttag:'{% autoscape off %}' 블록 내에서 사용할 경우 바람직하지 않은 동작일 수 있다.
pt_br: Se negligenciássemos ao passar o valor no corrente ``context.autoescape`` para ao novo ``Context`` neste exemplo, os resultados seriam *sempre* automaticamente substituidos, o que pode não ser o comportamento desejável se a tg de template for usada dentro de um bloco :ttag:`{% autoescape off %}<autoescape>` .
zh_hans: 在本例中，如果我们忽略了将当前的 ``context.autoescape`` 值传递给新 ``Context``，结果 *总会* 被自动转义，这可能与期望不同，尤其是模板标签被用于 :ttag:`{% autoescape off %} <autoescape>` 块之内的时候。

source: Thread-safety considerations
it: Considerazioni sulla sicurezza
ja: スレッド安全性の考慮
ko: 나사산 안전 고려 사항
pt_br: Considerações sobre segurança de "thread"
zh_hans: 线程安全的注意事项

source: Once a node is parsed, its ``render`` method may be called any number of times. Since Django is sometimes run in multi-threaded environments, a single node may be simultaneously rendering with different contexts in response to two separate requests. Therefore, it's important to make sure your template tags are thread safe.
it: Una volta che un nodo viene analizzato, il suo metodo ``render`` può essere chiamato un numero indefinito di volte. Dal momento che Django ogni tanto gira in ambienti multi-threaded, un singolo nodo può essere simultaneamente reso con differenti contesti in risposta a richieste differenti. Quindi, è importante assicurarsi che i propri template tag siano thread safe.
ja: ノードがパースされると、その ``render`` メソッドは何度でも呼び出されます。Django はマルチスレッド環境で実行されることがあるので、1つのノードが2つのリクエストに応答して、異なるコンテキストで同時にレンダリングされることがあります。したがって、テンプレートタグをスレッドセーフにすることが重要です。
ko: 노드가 한번 구문 분석되면 "렌더" 방법은 얼마든지 호출할 수 있다. Django는 때때로 다중 스레드 환경에서 실행되므로, 단일 노드는 두 개의 개별 요청에 대응하여 서로 다른 컨텍스트로 동시에 렌더링될 수 있습니다. 따라서 템플릿 태그가 스레드에 안전한지 확인하는 것이 중요합니다.
pt_br: Uma vez que o nó tenha sido analisado, seu método ``render`` pode ser chamado qualquer número de vezes. Uma vez que o Django roda algumas vezes em ambientes multi-threaded, um nó pode ser renderizado simultaneamente com diferentes contextos em resposta a dois requests diferentes. Por isso, é importante que suas tags de templates são segurara para "threads".
zh_hans: 节点被解析后，其 ``render`` 方法可能被任意次地调用。由于 Django 有可能运行于多线程环境，一个节点可能同时以不同的上下文进行渲染，以相应不同的请求。因此，确保你的模板标签是线程安全就非常重要了。

source: To make sure your template tags are thread safe, you should never store state information on the node itself. For example, Django provides a builtin :ttag:`cycle` template tag that cycles among a list of given strings each time it's rendered:
it: Per essere sicuro che i template tag siano thread safe, non dovresti mai immagazzinare informazioni di stato sul nodo stesso. Per esempio, Django offre un template tag builtin :ttag:`cycle` che compie un ciclo lungo una lista di date stringhe ogni volta che viene visualizzato:
ja: テンプレートタグを常にスレッドセーフに保つため、ノード自体に状態情報を保存してはいけません。例えば、 Django にはレンダリングされる度に与えられた文字列のリストを循環させる :ttag:`cycle` テンプレートタグが用意されています:
ko: 템플릿 태그가 스레드 안전하도록 하려면 노드 자체에 상태 정보를 저장해서는 안 됩니다. 예를 들어, Django는 다음을 렌더링할 때마다 주어진 문자열 목록을 순환하는 내장 :ttag:'cycle' 템플릿 태그를 제공합니다.
pt_br: Para ter certeza que sua tag de template é segura para rodar em threads, nunca deve armazenar informação no próprio nó. Por exemplo, Django fornece a template tag :ttag:`cycle` que alterna os intens de uma lista de strings cada vez que é renderizada:
zh_hans: 为了确保你的模板标签是线程安全的，你应该永远不要在节点中存储状态信息。例如，Django 提供了一个内置的 :ttag:`cycle` 模板标签，每次渲染时它都在一个给定字符串列表间循环：

source: A naive implementation of ``CycleNode`` might look something like this::
it: Una implementazione naive di ``CycleNode`` può avere un aspetto simile::
ja: ナイーブな ``CycleNode`` の実装は次のようになります:
ko: "CycleNode"의 안일한 구현은 이와 같이 보일 것이다::
pt_br: Uma implementação ingênua do ``CycleNode`` talvez se pareça como algo assim::
zh_hans: ``CycleNode`` 的原生实现看起来可能像这样::

source: But, suppose we have two templates rendering the template snippet from above at the same time:
it: Ma, supponiamo di avere due template che visualizzano lo snippet di template qui sopra allo stesso tempo:
ja: しかし、上のテンプレートコードを同時にレンダリングする2つのテンプレートがあるとします:
ko: 그러나 위에서 템플릿 조각을 렌더링하는 두 개의 템플릿이 동시에 있다고 가정합니다.
pt_br: Mas, suponha que temos dois templates renderizando o pedaço de template acima ao mesmo tempo.
zh_hans: 但是，假设有两个模板渲染器同时渲染上述模板片段：

source: Thread 1 performs its first loop iteration, ``CycleNode.render()`` returns 'row1'
it: Il thread 1 esegue la sua prima iterazione di loop, ``CycleNode.render()`` restituisce 'row1'
ja: スレッド1が最初のループを実行し、 ``CycleNode.render()`` は 'row1' を返します。
ko: 스레드 1은 첫 번째 루프 반복 ''CycleNode.render()'' returns 'row1'을 수행합니다.
pt_br: Thread 1 realiza sua primeira iteração, ``CycleNode.render()`` returns 'row1'
zh_hans: 线程 1 执行其第一次迭代， ``CycleNode.render()`` 返回 'row1'

source: Thread 2 performs its first loop iteration, ``CycleNode.render()`` returns 'row2'
it: Il thread 2 esegue la sua prima iterazione di loop, ``CycleNode.render()`` restituisce 'row2'
ja: スレッド2が最初のループを実行し、 ``CycleNode.render()`` は 'row2' を返します。
ko: 스레드 2는 첫 번째 루프 반복 ""CycleNode.render()"를 반환하는 'row2'를 수행합니다.
pt_br: Thread 2 realiza sua primeira iteração, ``CycleNode.render()`` returns 'row2'
zh_hans: 线程 2 执行其第一次迭代， ``CycleNode.render()`` 返回 'row2'

source: Thread 1 performs its second loop iteration, ``CycleNode.render()`` returns 'row1'
it: Il thread 1 esegue la sua seconda iterazione di loop, ``CycleNode.render()`` restituisce 'row1'
ja: スレッド1が2回目のループを実行し、 ``CycleNode.render()`` は 'row1' を返します。
ko: 스레드 1은 두 번째 루프 반복 ""CycleNode.render()""는 '행1'을 반환합니다.
pt_br: Thread 1 realiza sua segunda iteração, ``CycleNode.render()`` returns 'row2'
zh_hans: 线程 1 执行其第二次迭代， ``CycleNode.render()`` 返回 'row1'

source: Thread 2 performs its second loop iteration, ``CycleNode.render()`` returns 'row2'
it: Il thread 2 esegue la sua seconda iterazione di loop, ``CycleNode.render()`` restituisce 'row2'
ja: スレッド2が2回目のループを実行し、 ``CycleNode.render()`` は 'row2' を返します。
ko: 스레드 2는 두 번째 반복 "CycleNode.render()"'returns 'row2'를 수행합니다.
pt_br: Thread 2 realiza sua segunda iteração, ``CycleNode.render()`` returns 'row2'
zh_hans: 线程 2 执行其第二次迭代， ``CycleNode.render()`` 返回 'row2'

source: The CycleNode is iterating, but it's iterating globally. As far as Thread 1 and Thread 2 are concerned, it's always returning the same value. This is not what we want!
it: CycleNode sta iterando, ma sta iterando globalmente. Per quel che ne sanno Thread 1 e Thread 2, sta restituendo sempre lo stesso valore. Non è quello che vogliamo!
ja: CycleNodeは反復していますが、グローバルに反復しています。スレッド1とスレッド2に関しては、常に同じ値を返しています。これは私たちが望んでいることではありません！
ko: CycleNode는 반복되고 있지만 전 세계적으로 반복되고 있습니다. 스레드 1과 스레드 2에 관한 한 항상 동일한 값을 반환합니다. 이건 우리가 원하는 게 아니야!

source: To address this problem, Django provides a ``render_context`` that's associated with the ``context`` of the template that is currently being rendered. The ``render_context`` behaves like a Python dictionary, and should be used to store ``Node`` state between invocations of the ``render`` method.
it: Per risolvere questo problema, Django offre un ``render_context`` che è associato con il ``context`` del template che si mostra in quel momento. ``render_context`` si comporta come un dizionario Python e dovrebbe essere usato per memorizzare lo stato di ``Node`` tra le invocazioni del metodo ``render``.
ja: この問題に対処するために、 Django は ``render_context`` を提供します。この ``render_context`` は、現在レンダリング中のテンプレートの ``context`` に関連付けられます。この ``render_context`` は Python の辞書のように動作し、 ``render`` メソッドを呼び出す間の ``Node`` の状態を保存するために使う必要があります。
ko: 이 문제를 해결하기 위해 장고는 현재 렌더링되고 있는 템플릿의 "컨텍스트"와 관련된 "렌더_컨텍스트"를 제공한다. "render_context"는 파이썬 사전처럼 동작하며 "node" 상태를 "render" 방식의 호출 사이에 저장하는 데 사용해야 한다.
pt_br: Para resolver o problema, o Django provê o ``render_context`` que associado com o ``context`` do template que está correntemente sendo renderizado. O ``render_context`` se comporta como um dicionário Python, e deve ser usado para armazenar os estados do ``Node`` entre chamadas do método ``render``.
zh_hans: 为了定位此问题，Django 提供了一个 ``render_context``，关联至当前正在渲染的模板的 ``context``。 ``render_context`` 表现的像一个 Python 字典，应该在其中保存多次同时调用 ``render`` 方法时的 ``Node`` 状态。

source: Let's refactor our ``CycleNode`` implementation to use the ``render_context``::
it: Rifattorizziamo la nostra implementazione di ``CycleNode`` per usare ``render_context``::
ja: ``CycleNode`` の実装を ``render_context`` を使うようにリファクタリングしましょう:
ko: 우리의 ``CycleNode" 구현을 "render_context"를 사용하기 위해 재구성해 보자.
pt_br: Vamos refatorar nosso implementação do ``CycleNode`` para usar o ``render_context``::
zh_hans: 让我们用 ``render_context`` 重构我们的 ``CycleNode`` 实现::

source: Note that it's perfectly safe to store global information that will not change throughout the life of the ``Node`` as an attribute. In the case of ``CycleNode``, the ``cyclevars`` argument doesn't change after the ``Node`` is instantiated, so we don't need to put it in the ``render_context``. But state information that is specific to the template that is currently being rendered, like the current iteration of the ``CycleNode``, should be stored in the ``render_context``.
it: Nota che è perfettamente sicuro memorizzare l'informazione globale che non cambierà attraverso il ciclo di vita del ``Node`` come attributo. Nel caso di ``CycleNode``, l'argomento ``cyclevars`` non cambia dopo che ``Node`` viene istanziato, quindi non abbiamo bisogno di metterlo in ``render_context``. Ma l'informazione di stato che è specifica del template che si sta presentando, come l'iterazione corrente di ``CycleNode``, dovrebbe essere memorizzata in ``render_context``.
ja: ``Node`` のライフサイクルを通して変化しないグローバルな情報を属性として保存することは完全に安全であることに注意してください。 ``CycleNode`` の場合、 ``Node`` がインスタンス化された後も ``cyclevars`` 引数は変化しないので、 ``render_context`` に格納する必要はありません。しかし、 ``CycleNode`` の現在の繰り返し処理のように、現在レンダリングされているテンプレートに固有の状態情報は ``render_context`` に格納する必要があります。
ko: 주의할 점은 "노드"의 수명 내내 변하지 않는 글로벌 정보를 속성으로 저장하는 것이 매우 안전하다는 것이다. "CycleNode"의 경우 "Node"가 인스턴스화된 후에도 "Cyclevars"의 주장은 변하지 않으므로 "render_context"에 넣을 필요가 없다. 그러나 현재 ``CycleNode"의 반복처럼 현재 렌더링되고 있는 템플릿에 특정한 국가 정보는 "render_context"에 저장되어야 한다.
pt_br: Note que é perfeitamente seguro armazenar informação global que não irá se alterar através da vida do ``Node`` como um atributo. No caso do ``CycleNode``, o argumento ``cyclevars`` não muda depois que ``Node`` é instanciado., então não precisamos colocá-lo no ``render_context``. Mas informações do estado que é específica para o template que está sendo renderizado no momento, como a citeração corrente do ``CycleNode``, deve ser armazenado no ``render_context``
zh_hans: 注意，将 ``Node`` 生命周期中都不会发生变化的全局信息保存为属性是非常安全的。在 ``CycleNode`` 例中， ``cyclevars`` 参数在 ``Node`` 初始化后就不会变了，所以无需将其放入 ``render_context``。但是当前正在渲染的模板的状态信息，类似 ``CycleNode`` 的当前迭代信息，就应该被保存在 ``render_context``。
