Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure Apache is configured to accept non-ASCII file names::
pt_br: Se houver um erro ``UnicodeEncodeError`` quando fizer o upload de arquivos que contenham caracteres não ASCII, tenha certeza que o Apache está configurado para aceitar arquivos com nomes não ASCII::
zh_hans: 上传名称包含非 ASCII 字符的文件时，若抛出 ``UnicodeEncodeError``，确认 Apache 是否被正确配置，能接受非 ASCII 文件名::

source: Using a ``virtualenv``
pt_br: Usando um ``virtualenv``

source: If you install your project's Python dependencies inside a `virtualenv`_, you'll need to add the path to this virtualenv's ``site-packages`` directory to your Python path as well. To do this, add an additional path to your ``WSGIPythonPath`` directive, with multiple paths separated by a colon (``:``) if using a UNIX-like system, or a semicolon (``;``) if using Windows. If any part of a directory path contains a space character, the complete argument string to ``WSGIPythonPath`` must be quoted:
pt_br: Se as dependências do seu projeto estão instaladas dentro de um `virtualenv`_, será necessário adicionar o path do diretório ``site-packages`` do virtualenv ao "Python path" também. Para fazer isso, adicione um caminho adicional a sua diretiva ``WSGIPythonPath``, com múltimplos caminhos separados por dois-pontos (``:``) se estiver usando um sistema UNIX-like, ou um ponto-e-vírgula (``;``) se estiver usando window. Se qualquer parte do caminho do diretório contiver um caracter espaço, o argumento string todo par ``WSGIPythonPath`` deve estar entre aspas:

source: Make sure you give the correct path to your virtualenv, and replace ``python3.X`` with the correct Python version (e.g. ``python3.4``).
pt_br: Assegure-se de dar o caminho correto para o seu virtualenv, e troque ``python3.x``com a versão correta do Python (ex.: ``Python3.4``).

source: Django doesn't serve files itself; it leaves that job to whichever Web server you choose.
pt_br: O Django não serve arquivos, deixa este trabalho para qualquer web server que você escolha.
zh_hans: Django 本身并不提供文件服务；他将这个职责交给了你选择的 Web 服务器。

source: We recommend using a separate Web server -- i.e., one that's not also running Django -- for serving media. Here are some good choices:
pt_br: Recomendamos usar um Web Server separado -- isto é, um que não esteja rodando o Django -- para servir media. Aqui algums boas escolhas:
zh_hans: 我们推荐使用一个独立的 Web 服务器，即其未运行 Django——仅用于媒体服务。以下是一些不错的选项：

source: If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
pt_br: Se estiver usando uma versão de Apache menor que 2.4, substitua ``Require all granted`` por ``Allow from all`` e também adicione a linha ``Order deny,allow`` acima deste.
zh_hans: 若使用早于 2.4 的 Apache，将 ``Require all granted`` 替换为 ``Allow from all`` ，并在其上添加 ``Order deny,allow``。

source: When :mod:`django.contrib.staticfiles` is in :setting:`INSTALLED_APPS`, the Django development server automatically serves the static files of the admin app (and any other installed apps). This is however not the case when you use any other server arrangement. You're responsible for setting up Apache, or whichever Web server you're using, to serve the admin files.
pt_br: Quando :mod:`django.contrib.staticfiles` está em :setting:`INSTALLED_APPS`, o servidor de desenvolvimento do Django serve automaticamente os arquivos estáticos da app admin (e de qualquer outra app instalada). Isso não é o caso quando é usado qualquer outro arranjo de servidor. Voc^é o responsável por configurar o Apache, ou qualquer outro servidor Web que esteja usando, para server arquivos do admin.
zh_hans: :setting:`INSTALLED_APPS` 中包含 :mod:`django.contrib.staticfiles` 时，Django 开发服务器自动为这些归属于后台应用（也包含其它已安装的应用）的静态文件提供服务。这与你使用其它服务器时不太一样。你需要正确配置 Apache 或其它你使用的 Web 服务器，另其正确的为后台文件提供服务。

source: We **strongly** recommend using :mod:`django.contrib.staticfiles` to handle the admin files (along with a Web server as outlined in the previous section; this means using the :djadmin:`collectstatic` management command to collect the static files in :setting:`STATIC_ROOT`, and then configuring your Web server to serve :setting:`STATIC_ROOT` at :setting:`STATIC_URL`), but here are three other approaches:
pt_br: **Fortemente** recomendamos usar :mod:`django.contrib.staticfiles` para tratar dos arquivos do admin (junto com um servidor Web como delineado na seção anterior; isso quer dizer usar o comando de gerenciamento :djadmin:`collectstatic` para coletar os arquivos estáticos em :setting:`STATIC_ROOT`, e então configurar seu servidor Web para servir :setting:`STATIC_ROOT` at :setting:`STATIC_URL`), mas aqui estão três outras maneiras:
zh_hans: 我们 **强烈** 建议用 :mod:`django.contrib.staticfiles` 处理后台文件（连同上一节所述的 Web 服务器；这意味着用 :djadmin:`collectstatic` 管理命令收集 :setting:`STATIC_ROOT` 中的静态文件，然后配置 Web 服务器，使其在 :setting:`STATIC_URL` 为 :setting:`STATIC_ROOT` 提供服务），不过，这还有几个方法：

source: Some distributions, including Debian and Ubuntu, ship an outdated version of uWSGI that does not conform to the WSGI specification. Versions prior to 1.2.6 do not call ``close`` on the response object after handling a request. In those cases the :data:`~django.core.signals.request_finished` signal isn't sent. This can result in idle connections to database and memcache servers.
pt_br: Algumas distribuições, incluindo o Debian e Ubuntu, trazem uma versão desatualizada do uWSGI que não está em conformidade com as especificação uWSGI. Versões anteriores a 1.2.6 não chamam o ``close`` do objeto response após tratar uma requisição. Nestes caso o :data:`~django.core.signals.request_finished` não é enviado. Isso pode resultar em conexões inativas com o banco de dados e servidores memcache.

source: uWSGI operates on a client-server model. Your Web server (e.g., nginx, Apache) communicates with a django-uwsgi "worker" process to serve dynamic content. See uWSGI's `background documentation`_ for more detail.
pt_br: o uWSGI opera em um modelo cliente-servidor. Seu servidor Web (ex.: nginx, Apache) se comunica com um processo "worker" django-uwsgi para servir conteúdo dinâmico. Veja a uWSGI `background documentation`_ para mais detalhes.

source: uWSGI supports multiple ways to configure the process. See uWSGI's `configuration documentation`_ and `examples`_.
pt_br: uWSGI fornece múltiplas maneiras de configurar os processos. Veja uWSGI's `configuration documentation`_ e `examples`_.

source: ``env``: Should probably contain at least ``DJANGO_SETTINGS_MODULE``.
pt_br: ``env``: deve provavelmente conter pelo menos o ``DJANGO_SETTINGS_MODULE``.
zh_hans: ``env``：至少要包括 ``DJANGO_SETTINGS_MODULE``。

source: ``home``: Optional path to your project virtualenv.
pt_br: ``home``: caminho opcional para o virtualenv do projeto.
zh_hans: ``home``: 可选的路径，指向你工程的 virtualenv。

source: However, running with :setting:`DEBUG` set to ``False`` means you'll never see errors generated by your site -- everyone will just see your public error pages. You need to keep track of errors that occur in deployed sites, so Django can be configured to create reports with details about those errors.
pt_br: Contudo, rodar com :setting:`DEBUG` definido como ``False``quer dizer que você nunca verá os erros gerados pelo seu site -- todos verão somente sua página pública de erro. É necessário rastrear os erros que ocorrem em sites publicados, então o Django pode ser configurado para criar relatorios com detahes sobre este erros.
zh_hans: 然而，把 :setting:`DEBUG` 设置为 `False`， 这意味着你永远不会在你的网站上看到错误的细节，所有的人都只是看到你公开的错误页面。当你需要在部署的网页上追踪出现的错误，Django 可以通过设置去报告错误的细节。

source: When :setting:`DEBUG` is ``False``, Django will email the users listed in the :setting:`ADMINS` setting whenever your code raises an unhandled exception and results in an internal server error (HTTP status code 500). This gives the administrators immediate notification of any errors. The :setting:`ADMINS` will get a description of the error, a complete Python traceback, and details about the HTTP request that caused the error.
pt_br: Quando :setting:`DEBUG` é definido ``False``, Django irá enviar emails para os usuários listados na configuração :setting:`ADMINS` sempre que seu código gerar uma exceção não tratada e resulta em um erro interno do servidor (código de status HTTP 500). Isso dá aos administradores uma notificação imediata de qualquer erro. O :setting:`ADMINS` receberá uma descrição do erro, uma histórico Python completo, e detalhes sobre a requisição HTTP que causou o erro.
zh_hans: :setting:`DEBUG` 为 ``False`` 时，Django 会在代码抛出的异常未被捕获或导致一个内部的服务器错误（HTTP 状态码 500）时向 :setting:`ADMINS` 配置中列出的用户发送邮件。这让管理员立刻收到错误通知。 :setting:`ADMINS` 会收到详细的错误描述，完整的 Python 调用栈，引发此错误的 HTTP 请求的细节。

source: Your :setting:`MIDDLEWARE_CLASSES` setting includes :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
pt_br: Sua definição de :setting:`MIDDLEWARE_CLASSES` incluem :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.

source: If those conditions are met, Django will email the users listed in the :setting:`MANAGERS` setting whenever your code raises a 404 and the request has a referer. It doesn't bother to email for 404s that don't have a referer -- those are usually just people typing in broken URLs or broken Web bots. It also ignores 404s when the referer is equal to the requested URL, since this behavior is from broken Web bots too.
pt_br: Se estas condições são encontradas, o Django irá enviar emails aos usuários listados na definição de :setting:`MANAGERS` sempre que seu código gerar um 404 e o request possui um HTTP Referer. Ele não se preocupa em enviar email para 404 que não tenham um HTTP Referer -- estes são geralmente pessoas digitando URLs quebradas ou robôs Web quebrados. Ele também ignora 404s quando o referente é igual a URL requisitada, já que este comportamento provém também de robôs Web quebrados.
zh_hans: 如以上条件均满足，Django 会在代码抛出 404 错误且请求有对应来源时向 :setting:`MANAGERS` 配置项中的用户发送邮件。Django 并不会为没有来源的 404s 发送邮件——这些通常是人们或失效的网络爬虫直接输入无效链接。Django 还忽略来源于所请求的 URL 相同的 404s，因为这往往是失效的网络爬虫干的。

source: In older versions, 404s were not ignored when the referer was equal to the requested URL.
pt_br: Em versões mais antigas, 404s não eram ignorados quando o HTTP Referer era igual a URL de request.

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it towards the top of your :setting:`MIDDLEWARE_CLASSES` setting.
pt_br: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` deve aparecer antes de outros "middlewares" que interceptam 404, tal como :class:`~django.middleware.locale.LocaleMiddleware` ou :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Coloque-o na parte superior do seu :setting:`MIDDLEWARE_CLASSES` setting.

source: Filtering sensitive data is a hard problem, and it's nearly impossible to guarantee that sensitive won't leak into an error report. Therefore, error reports should only be available to trusted team members and you should avoid transmitting error reports unencrypted over the Internet (such as through email).
pt_br: Filtrar dados sensíveis é um problema difícil, e é quase impossível garantir que dados sensíveis não vão vazar dentro de um relatório de erro. Portanto, relatórios de erros soment devem ser disponibilizados para membros confiáveis do time e você deveria evitar transmitir relatórios de erros sem incriptação através da internet (tal como através de um e-mail).

source: However, sometimes certain types of information may be too sensitive and thus may not be appropriate to be kept track of, for example a user's password or credit card number. So Django offers a set of function decorators to help you control which information should be filtered out of error reports in a production environment (that is, where :setting:`DEBUG` is set to ``False``): :func:`sensitive_variables` and :func:`sensitive_post_parameters`.
pt_br: Entratanto, as vezes certos tipos de informação por ser tão delicada obviamente nao é apropriado expor seu conteudo, por exemplo uma senha de usuário ou um numero de cartão de crédito. Para isso o Django oferece um conjunto de decoradores de funções para ajudar voce a gerenciar quais informações devem ser deixadas de fora de relatórios de erro em ambiente de produção

source: In the above example, the values for the ``user``, ``pw`` and ``cc`` variables will be hidden and replaced with stars (`**********`) in the error reports, whereas the value of the ``name`` variable will be disclosed.
pt_br: No exemplo anterior, os valores de "user", "pw" e "cc" serão ocultados e trocados por asteríscos (`**********`) nos relatórios de erros, onde quer que o valor da variavel "name" seja exibido.
zh_hans: 上述例子中，错误报告中变量 ``user``， ``pw`` 和 ``cc`` 的值会被以星开头的字符串(`**********`)替换 ，不过 ``name`` 变量的值不会被屏蔽。

source: In the above example, the values for the ``pass_word`` and ``credit_card_number`` POST parameters will be hidden and replaced with stars (`**********`) in the request's representation inside the error reports, whereas the value of the ``name`` parameter will be disclosed.
pt_br: No exemplo acima, os valores dos para parâmetros ``pass_word`` e ``credit_card_number`` do POST serão escondidos e substituídos por asteríscos (`**********`) na representação da requisição dentro do relatório de erro, independente de onde o valor do parâmetro ``name`` seja mostrado.
zh_hans: 上文例子中，POST 参数 ``pass_word`` 和 ``credit_card_number`` 的值会被隐藏，通过在错误报告中展示请求信息的地方用星号开头的字符串 (`**********`) 替换，而参数 ``name`` 的值不会被屏蔽。

source: All :func:`sensitive_variables` and :func:`sensitive_post_parameters` do is, respectively, annotate the decorated function with the names of sensitive variables and annotate the ``HttpRequest`` object with the names of sensitive POST parameters, so that this sensitive information can later be filtered out of reports when an error occurs. The actual filtering is done by Django's default error reporter filter: :class:`django.views.debug.SafeExceptionReporterFilter`. This filter uses the decorators' annotations to replace the corresponding values with stars (`**********`) when the error reports are produced. If you wish to override or customize this default behavior for your entire site, you need to define your own filter class and tell Django to use it via the :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` setting::
pt_br: Tudo que :func:`sensitive_variables` e :func:`sensitive_post_parameters` fazem é, respectivamente, anota a função decorada com os nomes das variáveis sensíveis e anota o objeto ``HttpRequest`` com o nome dos parâmetros sensíveis do POST, tal que essa informação sensível pode mais tarde ser filtrada dos relatórios quando um erro ocorrer. O filtro é feito pelo filtro de relatório de erros padrão do Django : :class:`django.views.debug.SafeExceptionReporterFilter`. Este filtro usa a anotação de decoradores para substituir os valores correspondentes por asteríscos (`**********`) quando o relatório é produzido. Se quiser sobrescrever ou customizar o compartamento padrão para todo o site, é preciso definir sua própria classe de filtro e indicar ao Django para usá-la através da definição :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` ::
zh_hans: :func:`sensitive_variables` 和 :func:`sensitive_post_parameters` 所做的全部工作是，前者用敏感变量名注解被装饰的函数，后者用 POST 参数中的敏感变量名注解 ``HttpRequest`` 对象，所以敏感信息能在后续错误发生时从报告中过滤出去。这项过滤操作者实际上是由 Django 的默认错误报告处理器： :class:`django.views.debug.SafeExceptionReporterFilter`。该过滤器在错误报告生成时，利用装饰器注解以星号 (`**********`) 替换指定值。若你想在全站范围重写或自定义该默认行为，你需要定义你的过滤器类，并通过配置项 :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` 告诉 Django 启用它::

source: Your custom filter class needs to inherit from :class:`django.views.debug.SafeExceptionReporterFilter` and may override the following methods:
pt_br: A classe personalizada precisa herdar de :class:`django.views.debug.SafeExceptionReporterFilter` e talvez sobrescrever os seguintes métodos:
zh_hans: 自定义过滤器类需要继承自 :class:`django.views.debug.SafeExceptionReporterFilter` 并重写以下方法：

source: Returns ``True`` to activate the filtering operated in the other methods. By default the filter is active if :setting:`DEBUG` is ``False``.
pt_br: Retorna ``True`` para ativar a filtragem operada nos outros métodos. Por padrão o filtro é ativo se :setting:`DEBUG` é ``False``.
zh_hans: 返回 ``True`` 将激活其它方法中的过滤操作。 :setting:`DEBUG` 为 ``False`` 时，过滤器默认是激活的。

source: Returns the filtered dictionary of POST parameters. By default it replaces the values of sensitive parameters with stars (`**********`).
pt_br: Retorna o dicionário filtrado dos parâmetros do POST. Por padrão ele substitui os valores dos parâmetros sensíveis por asteríscos (`**********`).
zh_hans: 返回 POST 参数过滤后的字典。默认情况下，它将敏感参数的值替换成星号 (`**********`)。

source: Returns the filtered dictionary of local variables for the given traceback frame. By default it replaces the values of sensitive variables with stars (`**********`).
pt_br: Retorna o dicionário filtrado de variáveis globais para um dado quadro do "traceback". Por padrão ele substitui os valores de variáveis sensíveis por asteríscos (`**********`).
zh_hans: 返回给定的调用栈层中的局部变量经过过滤后的字段。默认情况下，它将敏感参数的值替换成星号 (`**********`)。

source: Providing initial data for models
pt_br: Fornecendo dados iniciais para modelos.
zh_hans: 为模型提供初始化的数据

source: It's sometimes useful to pre-populate your database with hard-coded data when you're first setting up an app. You can provide initial data via fixtures.
pt_br: Algumas vezes é útil pré-popular seu banco de dados com dados codificados no sistema quando se está configurando uma aplicação pela primeira vez. Você pode fornecer dados iniciais através das "fixtures".

source: Providing initial data with fixtures
pt_br: Fornecendo dados iniciais com "fixtures"

source: As an example, though, here's what a fixture for a simple ``Person`` model might look like in JSON:
pt_br: Como exemplo, no entanto, aqui o que uma "fixture" para um simples modelo ``Person`` se parece no formato json.
zh_hans: 例子，这有一个固定内容，描述了一个简单 ``Person`` 模型写成 JSON 后的样子：

source: Loading data is easy: just call :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, where ``<fixturename>`` is the name of the fixture file you've created. Each time you run :djadmin:`loaddata`, the data will be read from the fixture and re-loaded into the database. Note this means that if you change one of the rows created by a fixture and then run :djadmin:`loaddata` again, you'll wipe out any changes you've made.
pt_br: Carregar dados é simples: apenas chame :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, onde ``<fixturename>`` é o nome do arquivo de "fixture" que você criou. Cada vez que executar :djadmin:`loaddata`, os dados serão lidos da "fixture" e recarregados no banco de dados. Isso significa que se você alterar uma de suas linhas do banco de dados criadas por uma fixture e então executar :djadmin:`loaddata` denovo, você irá perder qualquer alteração que tenha feito.
zh_hans: 加载数据非常简单：只需调用 :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``， ``<fixturename>`` 是你刚创建的固定内容的文件名。每次你运行 :djadmin:`loaddata`，数据都会从固定内容读出，重新装入数据库。这意味着若你修改了某个固定内容创建的行，随后再次运行 :djadmin:`loaddata` ，你会丢掉所有的修改。

source: Running Django on Jython
pt_br: Rodando o Django no Jython

source: Jython_ is an implementation of Python that runs on the Java platform (JVM). This document will get you up and running with Django on top of Jython.
pt_br: O Jython_ é uma implmentação de Python que roda na plataforma Java (JVM). Este documento lhe colocará de pé rodando o Django com Jython.

source: Installing Jython
pt_br: instalando Jython

source: Django works with Jython versions 2.7b2 and higher. See the Jython_ website for download and installation instructions.
pt_br: O Django funciona com Jython nas versões 2.7b2 e superiores. Veja o website do Jython_ para instruções para baixar e instalar.

source: Creating a servlet container
pt_br: Criando um container servlet.

source: If you just want to experiment with Django, skip ahead to the next section; Django includes a lightweight Web server you can use for testing, so you won't need to set up anything else until you're ready to deploy Django in production.
pt_br: Se você quiser somente fazer um experimento com Django, vá direto para a próxima seção; o Django inclue um servidor Web leve que pode ser usado para teste, então você não precisa configurar mais nada até que esteja pronto para fazer a implantação em produção do Django.

source: If you want to use Django on a production site, use a Java servlet container, such as `Apache Tomcat`_. Full JavaEE applications servers such as `GlassFish`_ or `JBoss`_ are also OK, if you need the extra features they include.
pt_br: Se quer usar o Django em uma site em produção, use um container "servlet" Java, tal como `Apache Tomcat`_. Servidores de aplicações JavaEE completos como `GlassFish`_ ou `JBoss`_ são também OK, se você precisa das características extras que eles incluem.

source: Installing Django
pt_br: Instalando o Django

source: The next step is to install Django itself. This is exactly the same as installing Django on standard Python, so see :ref:`removing-old-versions-of-django` and :ref:`install-django-code` for instructions.
pt_br: O próximo passo é instalar o próprio Django. É o mesmo que instalar om Django no Python padrão, então veja :ref:`removing-old-versions-of-django` e :ref:`install-django-code` para instruções.

source: Installing Jython platform support libraries
pt_br: Instalando bibliotecas de suporte a plataforma Java

source: The `django-jython`_ project contains database backends and management commands for Django/Jython development. Note that the builtin Django backends won't work on top of Jython.
pt_br: O projeto `django-jython`_ contém "backends" de bancos de dados e comandos de gerenciamento para o desenvolvimento Django/Jython. Note que os backends embutidos do Django não funcionarão sob o Jython.

source: To install it, follow the `installation instructions`_ detailed on the project website. Also, read the `database backends`_ documentation there.
pt_br: Para instalá-los, siga a `installation instructions`_ detalhadas no website do projeto. Também, leia a documentação aqui `database backends`_.

source: Differences with Django on Jython
pt_br: Diferenças do Django no Jython

source: At this point, Django on Jython should behave nearly identically to Django running on standard Python. However, are a few differences to keep in mind:
pt_br: Até este ponto, Django sobre o Jython deve se comportar quase identico ao Django rodando em Python padrão. Embora, existam algumas diferenças para se manter em mente:

source: Remember to use the ``jython`` command instead of ``python``. The documentation uses ``python`` for consistency, but if you're using Jython you'll want to mentally replace ``python`` with ``jython`` every time it occurs.
pt_br: Lembre-se de usar o comando ``Jython`` invés do ``python``. A documentação usa ``python`` para consistência, mas se estiver usando Jython você irá querer substituir mentalmente ``python`` por ``jython`` toda vez que citado.

source: Similarly, you'll need to use the ``JYTHONPATH`` environment variable instead of ``PYTHONPATH``.
pt_br: Igualmente, irá querer usar a variável de ambiente ``JYTHONPATH`` no lugar de ``PYTHONPATH``.

source: Any part of Django that requires `Pillow`_ will not work.
pt_br: Qualquer parte do Django que use `Pillow`_ não irá funcionar.

source: Integrating Django with a legacy database
pt_br: Integrando o Django com banco de dados legados.
zh_hans: Django 使用旧有的数据库
