Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: There are a couple of notable things going on. First, ``AbsoluteValueLessThan`` isn't calling ``process_lhs()``. Instead it skips the transformation of the ``lhs`` done by ``AbsoluteValue`` and uses the original ``lhs``. That is, we want to get ``"experiments"."change"`` not ``ABS("experiments"."change")``. Referring directly to ``self.lhs.lhs`` is safe as ``AbsoluteValueLessThan`` can be accessed only from the ``AbsoluteValue`` lookup, that is the ``lhs`` is always an instance of ``AbsoluteValue``.
it: Ci sono un paio di cose che accadono e che vale la pena di notare. La prima è che ``AbsoluteValueLessThan`` non sta chiamando ``process_lhs()``. Piuttosto, salta la trasformazione di ``lhs`` fatta da ``AbsoluteValue`` e utilizza l' ``lhs`` originale. Cioè, vogliamo ottenere ``"experiments"."change"`` e non ``ABS("experiments"."change")``. Fare riferimento direttamente a ``self.lhs.lhs`` è sicuro perchè ``AbsoluteValueLessThan`` può essere acceduto solo dal lookup ``AbsoluteValue``, quindi ``lhs`` è sempre una istanza di ``AbsoluteValue``.
ja: 注目すべきことがいくつかあります。 まず、``AbsoluteValueLessThan`` は ``process_lhs()`` を呼び出していません。 代わりに、 ``AbsoluteValue`` によって行われた ``lhs`` の変換をスキップし、元の ``lhs`` を使用します。 つまり、``ABS("experiments"."change")`` ではなく、 ``"experiments"."change"`` を取得する必要があります。``AbsoluteValueLessThan`` は ``AbsoluteValue`` ルックアップからのみアクセスできるため、 ``self.lhs.lhs`` を直接参照することは安全です。つまり、 ``lhs`` は常に ``AbsoluteValue`` のインスタンスです 。
ko: 몇 가지 주목할 만한 일들이 벌어지고 있다. 첫째,"AbsoluteValueLessThan"은 ``process_lhs()"를 호출하지 않는다. 대신에 그것은 ``AbsoluteValue"가 행한 ``lhs"의 변형을 생략하고 원래의 "lhs"을 사용한다. 즉, 우리는 "ABS("experiments"."change")"가 아니라 "experiments""를 원한다. ``self.lhs.lhs"를 직접 지칭하는 것은 ``AbsouleValueLessThan"이라고 해도 무방하다.Than'은 ``AbsoluteValue" 조회에서만 접근할 수 있는데 그것은 ``lhs"은 항상 ``AbsoluteValue"의 한 예이다.
pt_br: Há algumas coisas notáveis ​​acontecendo. Em primeiro lugar, ``AbsoluteValueLessThan`` não está chamando ``process_lhs ()``. Em vez disso ele ignora a transformação do ``lhs`` feito por ``AbsoluteValue`` e usa o ``lhs`` original. Ou seja, queremos pegar `` "experiments"."change" `` não ``ABS( "experiments". "change") ``. Referindo-se diretamente a ``self.lhs.lhs`` é tão seguro quanto ``AbsoluteValueLessThan`` pode ser acessado diretamente da lookup ``AbsoluteValue``, que é a ``lhs`` é sempre uma instância de ``AbsoluteValue``.
zh_hans: 这里有几件值得注意的事情。首先，``AbsoluteValueLessThan`` 没有调用 ``process_lhs()``。 相反，它会跳过由 ``AbsoluteValue`` 完成的 ``lhs`` 的转换，并使用原始的 ``lhs``。也就是说，我们希望得到 ``"experiments"."change"``，而不是 ``ABS("experiments"."change")`` 。直接引用 ``self.lhs.lhs`` 是安全的，因为 ``AbsoluteValueLessThan`` 只能从 ``AbsoluteValue`` lookup 访问，即 ``lhs`` 总是 ``AbsoluteValue`` 的实例。

source: Notice also that as both sides are used multiple times in the query the params need to contain ``lhs_params`` and ``rhs_params`` multiple times.
it: Nota anche che poichè entrambe le parti sono utilizzate più volte nella query, i parametri devono contenere ``lhs_params`` e ``rhs_params`` più volte.
ja: また、クエリで両側が複数回使用されているので、paramsは ``lhs_params`` と ``rhs_params`` を複数回含む必要があることにも注意してください。
ko: 또한 양쪽이 쿼리에서 여러 번 사용되므로 "lhs_params"와 "rhs_params"를 여러 번 포함해야 한다.
pt_br: Note também que como ambos os lados são usados ​​várias vezes na consulta os parâmetros precisam conter ``lhs_params`` e ``rhs_params`` várias vezes.
zh_hans: 另请注意，由于在查询中多次使用两边，所以需要多次包含 ``lhs_params`` 和 ``rhs_params`` 参数。

source: The final query does the inversion (``27`` to ``-27``) directly in the database. The reason for doing this is that if the ``self.rhs`` is something else than a plain integer value (for example an ``F()`` reference) we can't do the transformations in Python.
it: La query finale fà l'inversione (``27`` a ``-27``) direttamente nel database. La ragione per cui fà così è che se ``self.rhs` non è un semplice valore intero (per esempio una ``F()`` reference) non possiamo fare la trasformazione in Python.
ja: 最後の問い合わせはデータベース内で直接反転（``27`` から ``-27``）を行います。これを行う理由は、 ``self.rhs`` が普通の整数値（例えば ``F()`` 参照）以外のものである場合、Pythonでは変換ができないためです。
ko: 마지막 쿼리는 데이터베이스에서 직접 반전("27"to "-27")을 수행합니다. 그 이유는 "self.rhs"가 단순한 정수 값(예: "F() reference)이 아니면 파이썬으로 변환을 할 수 없기 때문이다.
pt_br: A consulta final faz a inversão ( ``27`` para `` -27``) diretamente no banco de dados. A razão para isso é que, se o `` self.rhs`` é algo mais do que um valor inteiro simples (por exemplo, uma referência ``F()`` ) que não podemos fazer as transformações em Python.
zh_hans: 最后的查询直接在数据库中进行反转（ `27` 到 `-27` ）。 这样做的原因是，如果 ``self.rhs`` 不是普通的整数值（例如 `F()` 引用），我们就不能在 Python 中进行转换。

source: In fact, most lookups with ``__abs`` could be implemented as range queries like this, and on most database backends it is likely to be more sensible to do so as you can make use of the indexes. However with PostgreSQL you may want to add an index on ``abs(change)`` which would allow these queries to be very efficient.
it: In effetti, molti lookup con ``__abs`` potrebbero essere implementati con delle query range come questa e su molti database di backend sarebbe anche più ragionevole, perchè potrebbero usare gli indici. In ogni caso con PostgreSQL potresti voler aggiungere un indice su ``abs(change)`` che permetterebbe a queste query di essere molto efficienti.
ja: 実際のところ、 ``__abs`` を使ったルックアップは、このように範囲クエリとして実装することができます。そして、ほとんどのデータベースバックエンドでは、インデックスを利用できるようにするほうが賢明です。しかしPostgreSQLでは、 ``abs(change)`` にインデックスを追加することをお勧めします。これにより、これらのクエリは非常に効率的になります。
ko: 실제로 ``__abs"가 있는 대부분의 조회는 이와 같은 범위 쿼리로 구현될 수 있으며 대부분의 데이터베이스 백엔드에서는 인덱스를 사용할 수 있으므로 그렇게 하는 것이 더 현명할 것이다. 그러나 Postgre와 함께SQL ``abs(change)"에 인덱스를 추가할 수 있고 이러한 쿼리들은 매우 효율적일 것이다.
pt_br: Na verdade, a maioria das lookups com ``__abs`` poderias ser implementadas como consultas de intervalos como esta, e na maioria dos backends de banco de dados, é provável que seja mais sensato fazê-lo já que podería fazer uso dos índices. No entanto, com PostgreSQL você pode querer adicionar um índice em na ``abs(change)`` o que permitiria que essas consultas serem muito eficientes.
zh_hans: 实际上，大多数的利用 ``__abs`` 的查找都可以被转换为类似此的范围查找，且在大多数数据库后端来说，这样做能更好的利用索引。不过，对于 PostgreSQL，你可能会为 ``abs(change)`` 添加索引，这会使查找更加高效。

source: A bilateral transformer example
it: Un esempio di trasformatore bilaterale
ja: 双方向のトランスフォームの例
ko: 쌍방향 변압기 예제
pt_br: Um exemplo bilateral transformador
zh_hans: 一个双向转换器示例

source: The ``AbsoluteValue`` example we discussed previously is a transformation which applies to the left-hand side of the lookup. There may be some cases where you want the transformation to be applied to both the left-hand side and the right-hand side. For instance, if you want to filter a queryset based on the equality of the left and right-hand side insensitively to some SQL function.
it: L'esempio ``AbsoluteValue`` che abbiamo discusso in precedenza è una trasformazione che si applica al lato sinistro della ricerca. Potrebbero esserci alcuni casi in cui si desidera applicare la trasformazione sia al lato sinistro che al lato destro. Ad esempio, se si desidera filtrare un set di query in base all'uguaglianza del lato sinistro e destro in modo insensibile ad alcune funzioni SQL.
ja: 前に説明した ``AbsoluteValue`` の例は、ルックアップの左側に適用される変換です。 変換を左側と右側の両方に適用したい場合があります。 たとえば、一部のSQL関数に左右されない左側と右側の同等性に基づいてクエリセットをフィルタリングする場合です。
ko: 앞에서 논의한 "AbsoluteValue"의 예는 룩업의 왼쪽에 적용되는 변화이다. 변환을 왼쪽과 오른쪽 모두에 적용하려는 경우가 있을 수 있습니다. 예를 들어 일부 SQL 함수에 대해 왼쪽과 오른쪽의 동일성을 기준으로 쿼리 세트를 필터링하려는 경우
pt_br: O exemplo ``AbsoluteValue`` discutido anteriormente é uma transformação que se aplica para o lado esquerdo da lookup. Pode haver alguns casos onde você quer que a transformação seja aplicada tanto para o lado esquerdo quanto para o lado direito. Por exemplo, se você quiser filtrar um queryset com base em uma igualdade de lado esquerdo e direito inperseptível para alguma função SQL.
zh_hans: 前文所述的 ``AbsoluteValue`` 例子实现了左侧查询。在某些场景下，你期望转换器同时作用于左侧和右侧。例如，如果你想在左侧基于等式进行过滤，而右侧对于某些 SQL 函数不敏感。

source: Let's examine case-insensitive transformations here. This transformation isn't very useful in practice as Django already comes with a bunch of built-in case-insensitive lookups, but it will be a nice demonstration of bilateral transformations in a database-agnostic way.
it: Esaminiamo qui le trasformazioni senza distinzione tra maiuscole e minuscole. Questa trasformazione non è molto utile in pratica poiché Django viene già fornito con una serie di ricerche integrate senza distinzione tra maiuscole e minuscole, ma sarà una bella dimostrazione di trasformazioni bilaterali in modo indipendente dal database.
ja: ここで、大文字小文字を区別しないトランスフォームを試してみましょう。Djangoには既に大文字小文字を区別しないルックアップが多数組み込まれているので、プラクティスとしては良い例ではありません。しかし、データベースにとらわれない双方向のトランスフォームとしては良い例でしょう。
ko: 여기서는 대소문자를 구분하지 않는 변환을 살펴보겠습니다. 이러한 변환은 Django가 이미 여러 개의 대소문자를 구분하지 않는 검색 기능을 제공하므로 실제로 유용하지는 않습니다. 그러나 이는 데이터베이스에 구애받지 않는 방식으로 상호 변환의 좋은 예가 될 것입니다.

source: We define an ``UpperCase`` transformer which uses the SQL function ``UPPER()`` to transform the values before comparison. We define :attr:`bilateral = True <django.db.models.Transform.bilateral>` to indicate that this transformation should apply to both ``lhs`` and ``rhs``::
it: Definiamo un trasformatore ``Maiuscolo`` che utilizza la funzione SQL ``UPPER()`` per trasformare i valori prima del confronto. Definiamo :attr:`bilateral = True <django.db.models.Transform.bilateral>` per indicare che questa trasformazione dovrebbe applicarsi sia a ``lhs`` che a ``rhs``::
ja: SQL関数 ``UPPER()`` を使用して比較前に値を変換する ``UpperCase`` トランスフォーマーを定義します。 :attr:`bilateral = True <django.db.models.Transform.bilateral>` を定義して、この変換が ``lhs`` と ``rhs`` の両方に適用されることを示します:
ko: 우리는 SQL 함수 "UPPER()"를 사용하여 비교 전에 값을 변환하는 "UpperCase" 변압기를 정의한다. 우리는 다음과 같이 정의한다. :attr:`bilateral = True <django.db.models.Transform.bilateral>` 은 이러한 변환이 ``lhs"과 "rhs" 모두에 적용되어야 함을 나타낸다.
pt_br: Definimos um transformador ``UpperCase`` que usa a função SQL ``UPPER()`` para transformar os valores antes de comparação. Definimos :attr: `bilateral = True <django.db.models.Transform.bilateral>` para indicar que essa transformação deverá aplicar-se a ``lhs`` e ``rhs``::
zh_hans: 我们定义了一个 ``UpperCase`` 转换器，使用了 SQL 函数 ``UPPER()``，在比较之前转换值。我们定义了:attr:`bilateral = True <django.db.models.Transform.bilateral>` 指明此转换应同时用于 ``lhs`` 和 ``rhs``::

source: Next, let's register it::
it: Successivamente registriamolo::
ja: 次に、それを登録しましょう:
ko: 다음으로 등록하겠습니다::
pt_br: Em seguida, registre ::
zh_hans: 下一步, 让我们注册它::

source: Now, the queryset ``Author.objects.filter(name__upper="doe")`` will generate a case insensitive query like this:
it: Ora, il queryset ``Author.objects.filter(name__upper="doe")`` genererà una query senza distinzione tra maiuscole e minuscole come questa:
ja: これで、 ``Author.objects.filter(name__upper="doe")`` は次のような大文字小文字を区別しないクエリを生成するようになります。
ko: 이제 ``Author.objects.filter(name__upper="doe")``는 다음과 같은 대/소문자를 구분하지 않는 쿼리를 생성합니다.

source: Writing alternative implementations for existing lookups
it: Scrivendo implementazioni alternative per le ricerche esistenti
ja: 既存のルックアップに代替の実装を書く
ko: 기존 룩업에 대한 대체 구현 쓰기
pt_br: Escrever implementações alternativas para pesquisas existentes
zh_hans: 为现有的查找编写代替实现

source: Sometimes different database vendors require different SQL for the same operation. For this example we will rewrite a custom implementation for MySQL for the NotEqual operator. Instead of ``<>`` we will be using ``!=`` operator. (Note that in reality almost all databases support both, including all the official databases supported by Django).
it: A volte database vendor differenti richiedono SQL diverso per le stesse operazioni. Per questo esempio, riscriveremo una implementazione custom dell'operatore NotEqual per MySQL. Invece di ``<>`` useremo l'operatore ``!=``. (Nota che in realtà praticamente tutti i database li supportano entrambi, inclusi quelli supportati da Django).
ja: 異なるデータベースベンダーは、同じ操作に対して異なるSQLを必要とする場合があります。 この例では、MySQLのNotEqual演算子のカスタム実装を書き換えます。``<>`` の代わりに ``!=`` 演算子を使用します。 （実際には、Djangoがサポートするすべての公式データベースを含め、ほとんどすべてのデータベースが両方をサポートしていることに注意してください）。
ko: 데이터베이스 공급업체마다 동일한 작업을 수행하려면 서로 다른 SQL이 필요한 경우가 있습니다. 이 예에서는 NotEqual 연산자를 위해 MySQL에 대한 사용자 지정 구현을 다시 씁니다. 우리는 ``<>" 대신에"!="을 사용할 것이다. 피싱 오퍼레이터. (실제로 Django가 지원하는 모든 공식 데이터베이스를 포함하여 거의 모든 데이터베이스가 두 데이터베이스를 모두 지원합니다.)
pt_br: Às vezes, diferentes fornecedores de banco de dados requerem diferentes SQL para a mesma operação. Para este exemplo, vamos reescrever uma implementação personalizada para o MySQL para o operador NotEqual. Em vez de ``<>`` usaremos o operador ``!=``. (Note que, na realidade, quase todos os bancos de dados suportam ambos, incluindo todas as bases de dados oficiais apoiados por Django).
zh_hans: 有时候，不同的数据库提供商对相同的操作要求不同的 SQL 语句。针对此例子，我们会为 MySQL 重写 NotEqual 操作符。使用 ``!=`` 操作符替代 ``<>``。（注意，实际上几乎所有的数据两者都支持，包括 Django 支持的所有正式数据库）。

source: We can change the behavior on a specific backend by creating a subclass of ``NotEqual`` with an ``as_mysql`` method::
it: Puoi cambiare il comportamento di uno specifico backend creando una sottoclasse di "NotEqual" con un metodo "as_mysql"
ja: ``as_mysql`` メソッドで ``NotEqual`` のサブクラスを作成することで、特定のバックエンドの振る舞いを変えることができます。
ko: "as_mysql" 방식의 "NotEqual" 하위 클래스를 만들어 특정 백엔드에서 동작을 변경할 수 있다.
zh_hans: 我们可以通过使用 ``as_mysql`` 方法创建 ``NotEqual`` 的子类来更改特定后端的行为::

source: We can then register it with ``Field``. It takes the place of the original ``NotEqual`` class as it has the same ``lookup_name``.
it: Poi possiamo registrarlo con ``Field``. Prende il posto della classe ``NotEqual`` originale dal momento che ha lo stesso ``lookup_name``.
ja: そしてそれを ``Field`` に登録することができます。元の ``NotEqual`` クラスが同じ ``lookup_name`` を持つので代わりに使われます。
ko: 그런 다음 "Field"에 등록할 수 있다. 그것은 동일한 "lookup_name"을 가지고 있기 때문에 원래의 "Not Equal" 클래스를 대신한다.
pt_br: Podemos então registrá-lo com ``Field``. Ele toma o lugar da classe ``NotEqual`` original já que tem o mesmo ``lookup_name``.
zh_hans: 接着，我们可以里利用 ``Field`` 注册它。它会替换之前的 ``NotEqual`` 类，因为拥有相同的 ``lookup_name``。

source: When compiling a query, Django first looks for ``as_%s % connection.vendor`` methods, and then falls back to ``as_sql``. The vendor names for the in-built backends are ``sqlite``, ``postgresql``, ``oracle`` and ``mysql``.
it: Quando compila una query, Django prima cerca i metodi ``as_%s % connection.vendor`` e poi ricade su ``as_sql``. I nomi dei vendor per i backends built-in sono ``sqlite``, ``postgresql``, ``oracle`` e ``mysql``.
ja: クエリをコンパイルするとき、Djangoは最初に ``as_%s % connection.vendor`` メソッドを探し、それから ``as_sql`` にフォールバックします。組み込みのバックエンドのベンダ名は ``sqlite``、``postgresql``、``oracle`` および ``mysql`` です。
ko: 쿼리를 컴파일할 때, Django는 먼저 "as_%s" 연결을 찾는다.공급업체는 방법을 채택한 다음 다시 "as_sqlp"로 돌아간다. 내장된 백엔드의 벤더 이름은 "sqlite", "postgresql", "oracle" 및 "mysql"이다.
pt_br: Ao compilar uma consulta, Django primeiro procura pelos métodos ``as_%s % connection.vendor``, e depois para ``as_sql``. Os nomes de fornecedores para os back-ends suportador são ``sqlite``, ``postgresql``, ``oracle`` e ``mysql``.
zh_hans: 编译查询指令是，Django 先查找 ``as_%s % connection.vendor`` 方法，其次 ``as_sql``。内置后端的提供商名为 ``sqlite``，``postgresql``，``oracle`` 和 ``mysql``。

source: How Django determines the lookups and transforms which are used
it: Come Django determina le ricerche e trasforma quelle in uso
ja: Django はどうやってルックアップとトランスフォームのどちらを使うかを決定するのか？
ko: Django가 사용되는 룩업 및 변환을 결정하는 방법
pt_br: Como o Django determina as lookups e transformações que são usados
zh_hans: Django 是如何取舍查询器和转换器的

source: In some cases you may wish to dynamically change which ``Transform`` or ``Lookup`` is returned based on the name passed in, rather than fixing it. As an example, you could have a field which stores coordinates or an arbitrary dimension, and wish to allow a syntax like ``.filter(coords__x7=4)`` to return the objects where the 7th coordinate has value 4. In order to do this, you would override ``get_lookup`` with something like::
it: In alcuni casi potresti voler cambiare dinamicamente quale ``Transform`` o ``Lookup`` viene restituito a seconda del nome che gli passi, piuttosto che metterlo a posto. Per esempio, potresti avere un campo che contiene coordinate di una dimensione arbitraria e vorresti poter consentire una sintassi di tipo ``.filter(coords__x7=4)`` per restituire gli oggetti in cui la settima coordinata vale 4. Per fare questo, faresti override di ``get_lookup`` con qualcosa come::
ja: 場合によっては、修正するのではなく、渡された名前に基づいて、どの ``Transform`` または ``Lookup`` を返すかを動的に変更したい場合があります。 例として、座標または任意の次元を格納するフィールドがあり、 ``.filter(coords__x7=4)`` のような構文で、7番目の座標の値が4であるオブジェクトを返すことができます。 これを行うには、次のようなもので ``get_lookup`` をオーバーライドします:
ko: 어떤 경우에는 "Transform" 또는 "Lookup"이 반환되는 것을 고치는 것이 아니라 그 이름에 따라 동적으로 바꾸기를 원할 수도 있다. 예를 들어 좌표나 임의 차원을 저장하는 필드를 사용할 수 있으며,``.filter(coords__x7=4)``와 같은 구문이 7번째 좌표 값이 4인 객체를 반환하도록 허용할 수 있습니다. 이를 위해 당신은 다음과 같은 것으로 ``get_lookup"을 재정의할 것이다::
pt_br: Em alguns casos, talvez queira mudar dinamicamente qual ``Transform`` ou ``Lookup`` é devolvido com base no nome passado, em vez de corrigi-lo. Como exemplo, é possível ter um campo que armazena coordenadas ou uma dimensão arbitrária, e deseja permitir que uma sintaxe como ``.filter (coords__x7=4)`` para retornar os objetos onde a 7ª coordenada tem valor 4. Para fazer isso, substitua ``get_lookup`` com algo como::
zh_hans: 某些场景下，你可能期望基于传入的名字动态地返回 ``Transform`` 或 ``Lookup``，而不是指定。例如，有一个字段，存储了一些坐标或尺寸，期望使用以下语法 ``.filter(coords__x7=4)`` 返回第七个值为 4 的坐标。为此，你需要用以下内容重写 ``get_lookup``::

source: You would then define ``get_coordinate_lookup`` appropriately to return a ``Lookup`` subclass which handles the relevant value of ``dimension``.
it: Poi definiresti in modo appropriato ``get_coordinate_lookup`` per restituire una sottoclasse di ``Lookup`` che gestisce la dimensione rilevante di ``dimension``.
ja: それから、適切な ``dimension`` の値を扱う ``Lookup`` サブクラスを返すように ``get_coordinate_lookup`` を適切に定義します。
ko: 그런 다음 "get_cordinate_lookup"을 적절히 정의하여 "dimension"의 관련 가치를 다루는 ``Lookup" 하위 클래스를 반환하게 된다.
pt_br: Defina então o `` get_coordinate_lookup`` adequadamente para retornar uma subclasse ``Lookup`` que lida com o valor relevante da ``dimension``.
zh_hans: 随后你需要定义 ``get_coordinate_lookup`` 正确地返回一个 ``Lookup`` 子类，用于处理 ``dimension`` 的相关值。

source: There is a similarly named method called ``get_transform()``. ``get_lookup()`` should always return a ``Lookup`` subclass, and ``get_transform()`` a ``Transform`` subclass. It is important to remember that ``Transform`` objects can be further filtered on, and ``Lookup`` objects cannot.
it: Esiste un metodo che è chiamato ``get_transform()``, in modo simile. ``get_lookup()`` dovrebbe sempre restituire una sottoclasse ``Lookup`` e ``get_transform()`` una sottoclasse ``Transform``. E' importante ricordare che gli oggetti ``Transform`` possono essere ulteriormente filtrati, cosa che non possibile fare per gli oggetti ``Lookup``.
ja: ``get_transform()`` という似た名前のメソッドもあります。 ``get_lookup()`` は常に ``Lookup`` サブクラスを返し、 ``get_transform()`` は ``Transform`` サブクラスを返す必要があります。 ``Transform`` オブジェクトはさらにフィルタできますが、 ``Lookup`` オブジェクトはそれ以上フィルタできないことに注意してください。
ko: ``get_transform()"" ``get_lookup()""은 항상 ``Lookup" 하위 클래스를 반환하고 ``get_transform()"은 ``transform" 하위 클래스를 반환해야 한다. "Transform" 물체는 더 걸러질 수 있고 "Lookup" 물체는 걸러질 수 없다는 것을 명심해야 한다.
pt_br: Existe um método de nome semelhante chamado ``get_transform() ``. `` Get_lookup () `` deve sempre retornar uma subclasse de ``Lookup``, e ``get_transform()`` uma subclasse de ``Transform``. É importante lembrar que objetos do tipo ``Transform`` podem ainda ser filtrados, e objetos do tipo ``Lookup`` não podem.
zh_hans: 有个类似的名字叫做 ``get_transform()``。``get_lookup()`` 总是要返回 ``Lookup`` 子类，而 ``get_transform`` 要返回 ``Transform`` 子类。千万牢记，``Transform`` 对象能被进一步过滤，而 ``Lookup`` 对象不能。

source: When filtering, if there is only one lookup name remaining to be resolved, we will look for a ``Lookup``. If there are multiple names, it will look for a ``Transform``. In the situation where there is only one name and a ``Lookup`` is not found, we look for a ``Transform`` and then the ``exact`` lookup on that ``Transform``. All call sequences always end with a ``Lookup``. To clarify:
it: In fase di filtering, se rimane un solo lookup name da risolvere, cercheremo un ``Lookup``. Se ci sono più nomi, si cercherà per un ``Transform``. Nella situazione in cui ci sia solo un nome e non si trovi un ``Lookup``, cercheremo un ``Transform`` e poi il lookup ``exact`` su quel ``Transform``. Tutte le sequenze di chiamate terminano sempre con un ``Lookup``. Per fare chiarezza:
ja: フィルタリングする際に、解決すべきルックアップ名が1つしか残っていない場合は ``Lookup`` を探します。複数の名前がある場合は ``Transform`` を探します。名前が1つしかなく、 ``Lookup`` が見つからない場合は、 ``Transform`` を探し、その ``Transform`` に対して ``exact`` ルックアップを行います。すべての呼び出しシーケンスは常に ``Lookup`` で終わります。これは、以下のことを明確にするためです:
ko: 필터링을 할 때 한 개의 룩업 이름만 남아 있으면 "Lookup"를 찾을 것이다. 이름이 여러 개일 경우 'Transform'를 모색하게 된다. 이름이 하나밖에 없고 ``Lookup"이 없는 상황에서 우리는 ``Transform"을 찾고 그 ``Transform"에 대한 ``exact" 조회를 찾는다. 모든 호출 순서는 항상 "Lookup"로 끝난다. 명확히 하기 위해:
pt_br: Ao filtrar, se houver apenas um nome lookup remanescente a ser resolvido, olhamos para um ``Lookup``. Se houver vários nomes, ele irá procurar por um ``Transform``. Em uma situação onde há apenas um nome e um ``Lookup`` não é encontrado, procuramos por um ``Transform`` e então o lookup ``exact`` naquele ``Transform``. Todas as sequências de chamadas sempre terminam com um ``Lookup``. Para esclarecer:
zh_hans: 过滤时，若只能找到一个名字，我们会查找 ``Lookup``。如果有多个名字，将会寻找 ``Transform``。在某种情况下，仅有一个名字，且未找到 ``Lookup``，我们将查找 ``Transform``，并附加 ``exact`` 查询器。所以的系列调用都以一个 ``Lookup`` 结束。简单说明：

source: ``.filter(myfield__mylookup)`` will call ``myfield.get_lookup('mylookup')``.
it: ``.filter(myfield__mylookup)`` chiamera ``myfield.get_lookup('mylookup')``.
ja: ``.filter(myfield__mylookup)`` が ``myfield.get_lookup('mylookup')`` を呼び出すこと。
ko: ``.filter(myfield__mylookup)`` 는``myfield.get_lookup('mylookup')``을 호출할 것이다.
pt_br: ``.filter(myfield__mylookup)`` irá chamar `myfield.get_lookup('mylookup')``.
zh_hans: ``.filter(myfield__mylookup)`` 将会调用 ``myfield.get_lookup('mylookup')``。

source: ``.filter(myfield__mytransform__mylookup)`` will call ``myfield.get_transform('mytransform')``, and then ``mytransform.get_lookup('mylookup')``.
it: ``.filter(myfield__mytransform__mylookup)`` chimaerà ``myfield.get_transform('mytransform')``, e poi ``mytransform.get_lookup('mylookup')``.
ja: ``.filter(myfield__mytransform__mylookup)`` が ``myfield.get_transform('mytransform')`` を呼び出し、次に ``mytransform.get_lookup('mylookup')`` を呼び出すこと。
ko: ``.filter(myfield__mytransform__mylookup)`` 는``myfield.get_transform('mytransform')``, 을 호출하고 ``mytransform.get_lookup('mylookup')``을 호출할 것이다.
pt_br: ``.filter(myfield__mytransform__mylookup)`` irá chamar ``myfield.get_transform('mytransform')``, e em seguida ``mytransform.get_lookup('mylookup')``.
zh_hans: ``.filter(myfield__mytransform__mylookup)`` 将会调用 ``myfield.get_transform('mytransform')``, 接着调用 ``mytransform.get_lookup('mylookup')``。
