Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If you do want to allow Django to manage the table's lifecycle, you'll need to change the :attr:`~django.db.models.Options.managed` option above to ``True`` (or simply remove it because ``True`` is its default value).
pt_br: Se você quer permitir que o Django gerencie o ciclo de vida das tabelas, é necessário alterar a opção :attr:`~django.db.models.Options.managed` acima para ``True`` ( ou simplesmente removê-la porque ``True`` é o valor padrão).
zh_hans: 若你的确想要允许 Django 管理这些表格的生命周期，你需要将上面的 :attr:`~django.db.models.Options.managed` 选项的值改为 ``True`` （或者直接删掉它，因为 ``True`` 是默认值）。

source: Outputting CSV with Django
pt_br: Emitindo CSV com Django
zh_hans: 利用 Django 输出 CSV

source: Hooking into the CSV-generation API is easy: Just pass ``response`` as the first argument to ``csv.writer``. The ``csv.writer`` function expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
pt_br: Utilizar a API do CSV-generation é fácil: Apenas passe ``response``como o primeiro argumento para ``csv.writer``. A função ``csv.writer`` espera um objeto "file-like", e o objetos :class:`~django.http.HttpResponse` é um "file-loke".
zh_hans: 接入生成 CSV API 非常简单：仅需将 ``response`` 作为第一个参数传给 ``csv.writer``。 ``csv.writer`` 函数期望一个类文件对象，而 :class:`~django.http.HttpResponse` 对象满足该要求。

source: For each row in your CSV file, call ``writer.writerow``, passing it an iterable object such as a list or tuple.
pt_br: Para cada linha no seu arquivo CSV, chame ``writer.writerow``, passando-o para um objeto interável tal como uma lista ou tupla.

source: The CSV module takes care of quoting for you, so you don't have to worry about escaping strings with quotes or commas in them. Just pass ``writerow()`` your raw strings, and it'll do the right thing.
pt_br: O módulo CSV cuida das aspas pra você, então não tem que se preocupar em substituir strings com aspas ou vírgulas. Apenas passe as string para ``writerow()``, e ele fará a coisa certa.
zh_hans: CSV 模块为你处理了引号，所以你无需担心包含引号或逗号的字符串的转义问题。只需为 ``writerow()`` 传入原始字符串，它为你处理好一切。

source: Handling Unicode on Python 2
pt_br: Manipulando unicode no Python 2

source: Python 2's :mod:`csv` module does not support Unicode input. Since Django uses Unicode internally this means strings read from sources such as :class:`~django.http.HttpRequest` are potentially problematic. There are a few options for handling this:
pt_br: O móduo :mod:`csv` do Python 2's não suporta entrada unicode. E já que o Django usa Unicode internamente isso significa que strings lidas do código fonte tal como :class:`~django.http.HttpRequest` são potencialmente problemáticas. Existem algumas opções para lidar com isso:

source: Manually encode all Unicode objects to a compatible encoding.
pt_br: Manualmente encode todas os objetos Unicode para um encode compatível.

source: Use the ``UnicodeWriter`` class provided in the `csv module's examples section`_.
pt_br: Use a class ``UnicodeWriter`` fornecida no `csv module's examples section`_.

source: Use the `python-unicodecsv module`_, which aims to be a drop-in replacement for :mod:`csv` that gracefully handles Unicode.
pt_br: Use o `python-unicodecsv module`_, o qual objetiva ser um substituto para o :mod:`csv` que normalmente lida com Unicode.

source: For more information, see the Python documentation of the :mod:`csv` module.
pt_br: Para mais informação, veja a documentação Python do módulo :mod:`csv`.

source: This template is quite basic. It just iterates over the given data and displays a line of CSV for each row. It uses the :tfilter:`addslashes` template filter to ensure there aren't any problems with quotes.
pt_br: Este template é bem básico. Ele somente itera sobre o dado enviado e mostra uma linha de CSV para cada linha. Isso usa o filtro de template :tfilter:`addslashes` para se assegurar que não haverá nenhum problema com aspas.
zh_hans: 本例非常基础。它仅仅遍历所给的数据，并为每行生成一个 CSV 行。它利用 :tfilter:`addslashes` 模板过滤器确保引号不会引发任何问题。

source: Outputting PDFs with Django
pt_br: Gerando PDFs com o Django
zh_hans: 利用 Django 输出 PDF

source: The key to generating PDFs dynamically with Django is that the ReportLab API acts on file-like objects, and Django's :class:`~django.http.HttpResponse` objects are file-like objects.
pt_br: A chave para gerar PDF dinamicamente com Django é que a API do ReportLab atua como um objeto "file-like", e os :class:`~django.http.HttpResponse` do Django são objetos "file-like".

source: The response gets a special MIME type, :mimetype:`application/pdf`. This tells browsers that the document is a PDF file, rather than an HTML file. If you leave this off, browsers will probably interpret the output as HTML, which would result in ugly, scary gobbledygook in the browser window.
pt_br: A resposta HTTP tem um tipo MIME especial, :mimetype:`application/pdf`. Isso indica ao browser que o documento é um arquivo PDF, ao invés de arquivo HTML. Se deixar isso de fora, o browser provavelmente irá interpretar o ontúdo como HTML, o qual deve resultar em uma feia, assustadora "sopa de ltrinhas" no browser.

source: The response gets an additional ``Content-Disposition`` header, which contains the name of the PDF file. This filename is arbitrary: Call it whatever you want. It'll be used by browsers in the "Save as..." dialog, etc.
pt_br: A resposta HTTP também tem um cabeçalho adicional ``Content-Disposition``, o qual contém o nome do arquivo PDF. Este nome de arquivo é arbitrário: Chame como quizer. Isso será usado pelo browser na caixa de diálogo "Salvar como...", etc.

source: The ``Content-Disposition`` header starts with ``'attachment; '`` in this example. This forces Web browsers to pop-up a dialog box prompting/confirming how to handle the document even if a default is set on the machine. If you leave off ``'attachment;'``, browsers will handle the PDF using whatever program/plugin they've been configured to use for PDFs. Here's what that code would look like::
pt_br: O cabeçalho HTTP ``Content-Disposition`` começa com ``attachment;`` neste exemplo. Isso força o browser a mostrar uma caixa de diálogo perguntando/confirmando como manipular o documento mesmo que exista um padrão definido no computador. Se deixar sem o ``'attachment;'``, os browsers usarão qualquer programa/plugin que estejam configurados para usar com PDF. Aqui como o código se parece::

source: Hooking into the ReportLab API is easy: Just pass ``response`` as the first argument to ``canvas.Canvas``. The ``Canvas`` class expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
pt_br: Acessar a API do ReportLab é fácil: apenas passe o ``response`` como primeiro argumento para ``canvas.Canvas`. A classe ``Canvas`` espera um objeto "file-like", e os objetos :class:`~django.http.HttpResponse` se encaixam na definição.

source: Note that all subsequent PDF-generation methods are called on the PDF object (in this case, ``p``) -- not on ``response``.
pt_br: Note que todos os métodos subsequentes para geração do PDF são chamados a partir do objeto (neste caso , ``p``) -- e não do ``response``.

source: Complex PDFs
pt_br: PDFs complexos

source: If you're creating a complex PDF document with ReportLab, consider using the :mod:`io` library as a temporary holding place for your PDF file. This library provides a file-like object interface that is particularly efficient. Here's the above "Hello World" example rewritten to use :mod:`io`::
pt_br: Se estiver contruindo documentos PDFs complexos com o ReportLab, considere usar a bilioteca :mod:`io` como um lucar temporário de armazenamento do seu arquivo PDF. Essa biblioteca fornece uma objeto "file-like" como interface que é particularmente eficiente. Aqui o mesmo exemplo "Hello World" de antes, reescrito com uso do :mod:`io`::

source: Further resources
pt_br: Outras fontes

source: PDFlib_ is another PDF-generation library that has Python bindings. To use it with Django, just use the same concepts explained in this article.
pt_br: PDFlib_ é uma outra bibliotea de geração de PDF que tem API, ou "bindings" para Python. Para usá-lo com o Django, apenas use os mesmos conceitos explanados neste artigo.

source: `XHTML2PDF`_ is yet another PDF-generation library. It ships with an example of how to integrate it with Django.
pt_br: `XHTML2PDF`_ é ainda uma outra biblioteca para gerar PDF. Ele vêm com um exemplo de como integrá-lo com o Django.

source: HTMLdoc_ is a command-line script that can convert HTML to PDF. It doesn't have a Python interface, but you can escape out to the shell using ``system`` or ``popen`` and retrieve the output in Python.
pt_br: HTMLdoc_ é um script para a linha de comando que pode converter HTML para PDF. Ele nao tem uma interface para Python. Mas você pode usá-lo acessando o "shell" através do ``system`` ou ``popen`` e retornar a saída para o Python.

source: Deploying static files
pt_br: Deploy de arquivos estáticos
zh_hans: 部署静态文件

source: The basic outline of putting static files into production is simple: run the :djadmin:`collectstatic` command when static files change, then arrange for the collected static files directory (:setting:`STATIC_ROOT`) to be moved to the static file server and served. Depending on :setting:`STATICFILES_STORAGE`, files may need to be moved to a new location manually or the :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` method of the ``Storage`` class might take care of that.
pt_br: O esquama básico para colocar arquivos estáticos em produção é simples: execute o comando :djadmin:`collectstatic` quando houver mudanças nos arquivos estáticos, então faça os arranjos para que o diretório de arquivos estáticos (:setting:`STATIC_ROOT`) seja movido para o servidor de arquivos estátios e o sirva. Dependendo do :setting:`STATICFILES_STORAGE`, os arquivos talvez precisem ser movidos manualmente para um novo local ou o método :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` da classe ``Storage`` talvez o faça.
zh_hans: 在生产环境部署静态文件的要点很简单：在静态文件变化时，运行 :djadmin:`collectstatic`，然后将已收集的静态文件目录(:setting:`STATIC_ROOT`)移至静态文件服务器并提供服务。 :setting:`STATICFILES_STORAGE` 可能会要求手动将文件移动到新位置，不过 ``Storage`` 类的 :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` 方法可能会处理它。

source: Of course, as with all deployment tasks, the devil's in the details. Every production setup will be a bit different, so you'll need to adapt the basic outline to fit your needs. Below are a few common patterns that might help.
pt_br: Claro, como todas as tarefas de implantação, os problemas estão nos detalhes. Cada configuração de produção será um pouco diferente, então você irá precisar adaptar o esquema básico para atender suas necessidades. Abaixo estã alguns padrões que podem ajudar.
zh_hans: 当然，像所有的部署任务一样，细节决定成败。每个生成环境的配置可能都有点不同个，所以，需要调整配置以满足你的需求。以下是常见模式，可能对你有所帮助。

source: You'll probably want to automate this process, especially if you've got multiple web servers. There's any number of ways to do this automation, but one option that many Django developers enjoy is `Fabric <http://fabfile.org/>`_.
pt_br: Você provavelmente irá querer automatizar esse processo, principalmente se você tem múltiplos servidores web. Existem várias maneiras de fazer essa automação, mas uma opção que muitos desenvolvedores Django gostam é o `Fabric <http://fabfile.org/>`_.

source: Below, and in the following sections, we'll show off a few example fabfiles (i.e. Fabric scripts) that automate these file deployment options. The syntax of a fabfile is fairly straightforward but won't be covered here; consult `Fabric's documentation <http://docs.fabfile.org/>`_, for a complete explanation of the syntax.
pt_br: Abaixo, e nas seções seguintes, mostraremos alguns exemplos de "fabfiles" (isto é scripts fabric) que automatizam essas opções para colocar arquivos em produção. A sintaxe de um fabfile é bastante simples más não será coberto aqui; consulte`a documentação do Fabric <http://docs.fabfile.org/>`_, para uma explicação completa sobre a sintaxe.

source: So, a fabfile to deploy static files to a couple of web servers might look something like::
pt_br: Então, um fabfile para implantar arquivos estáticos em alguns servidores web pode ser algo como::

source: Most larger Django sites use a separate Web server -- i.e., one that's not also running Django -- for serving static files. This server often runs a different type of web server -- faster but less full-featured. Some common choices are:
pt_br: A maioria dos grandes sites Django usam um servidor Web separado – isto é, um que não está servindo também um site Django – para servir arquivos estáticos. Este servidor roda um tipo diferente de servidor web – mais rápido, mas sem tantas funcionalidades. Algumas opções são:
zh_hans: 大多数大型 Django 站点使用一个独立的 Web 服务器——即，该服务器并未运行 Django，值提供静态文件服务。这种服务器一般运行一种不同的 Web 服务器——更快，更简单。常见选项如下：

source: Here's how this might look in a fabfile::
pt_br: Aqui está como isso pode parar no fabfile::

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading webpages (especially when using a CDN).
pt_br: Uma outra tática comum é servir arquivos estáticos de um fornecedor de armazenamento na "cloud" como o S3 da Amazom e/ou um CDN (Content delivery network). Isso deixa você ignorar os problemas de servir arquivos estáticos e pode muitas vezes fazer páginas web serem carregadas mais rapidamente (especialmente quando em uma CDN).

source: There's any number of ways you might do this, but if the provider has an API a :doc:`custom file storage backend </howto/custom-file-storage>` will make the process incredibly simple. If you've written or are using a 3rd party custom storage backend, you can tell :djadmin:`collectstatic` to use it by setting :setting:`STATICFILES_STORAGE` to the storage engine.
pt_br: Existem inúmeras maneiras para fazer isso, mas se o provedor tem uma API um :doc:`backend personalizado para armazenamento de arquivo </howto/custom-file-storage>` fará o processo incrivelmente simples. Se você escreveu ou está usando um "backend" de armazenamento personalizado de terceiros, você pode avisar o :djadmin:`collectstatic` para usá-lo definindo :setting:`STATICFILES_STORAGE` para o mecanismo de armazenamento.
zh_hans: 有很多中方法可以实现目的，但是若服务商提供一个 API :doc:`自定义文件存储后端 </howto/custom-file-storage>`，这将会使流程难以置信的简单。若你已编写或正在使用第三方的自定义存储后端，你可以通过将 :setting:`STATICFILES_STORAGE` 指向该存储引擎告诉 :djadmin:`collectstatic` 启用它。

source: Once that's done, all you have to do is run :djadmin:`collectstatic` and your static files would be pushed through your storage package up to S3. If you later needed to switch to a different storage provider, it could be as simple as changing your :setting:`STATICFILES_STORAGE` setting.
pt_br: Uma vez isso feito, tudo que tem a fazer é executar :djadmin:`collectstatic` e seus arquivos estáticos deveriam ser então colocados através do seu pacote de armazenamento no S3. Se você mais tarde precisar trocar para um provedor de armazenamento diferente, isso deveria ser tão fácil quanto alterar suas configurações no :setting:`STATICFILES_STORAGE`.
zh_hans: 只要完成了上述流程，你就只需运行 :djadmin:`collectstatic`，静态文件将通过存储包推送给 S3。如果稍后需要切换至另一个存储服务商，只需简单地修改 :setting:`STATICFILES_STORAGE` 配置。

source: For details on how you'd write one of these backends, see :doc:`/howto/custom-file-storage`. There are 3rd party apps available that provide storage backends for many common file storage APIs. A good starting point is the `overview at djangopackages.com <https://www.djangopackages.com/grids/g/storage-backends/>`_.
pt_br: Para detalhes sobre como escrever um destes backends, veja :doc:`/howto/custom-file-storage`. Existem aplicações de terceiros disponíveis que fornecem backends de armazenamento para muitas APIs de armazenamento comuns. Um bom começo é dar uma `olhada no djangopackages.com <https://www.djangopackages.com/grids/g/storage-backends/>`_.

source: Managing static files (e.g. images, JavaScript, CSS)
pt_br: Gerenciamento de arquivos estáticos (exemplo: imagens, JavaScript, CSS)
zh_hans: 管理静态文件（比如图片、JavaScript、CSS）

source: In your templates, either hardcode the url like ``/static/my_app/myexample.jpg`` or, preferably, use the :ttag:`static<staticfiles-static>` template tag to build the URL for the given relative path by using the configured :setting:`STATICFILES_STORAGE` storage (this makes it much easier when you want to switch to a content delivery network (CDN) for serving static files).
pt_br: Nos seus templates, ou coloque manualmente a url como ``/static/my_app/myexample.jpg`` ou, preferivelmente, use a tag de template :ttag:`static<staticfiles-static>` para construir a URL para o dado caminho relativo usando o armazenamento configurado em :setting:`STATICFILES_STORAGE` (isso torna mais fácil quando você quiser trocar para um CDN - (content delivery network) para servir arquivos estáticos).

source: Store your static files in a folder called ``static`` in your app. For example ``my_app/static/my_app/myimage.jpg``.
pt_br: Armazene seus arquivos estáticos no diretório chamado ``static`` dentro da sua app. Por exemplo ``my_app/static/my_app/myimage.jpg``.

source: Now we *might* be able to get away with putting our static files directly in ``my_app/static/`` (rather than creating another ``my_app`` subdirectory), but it would actually be a bad idea. Django will use the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
pt_br: Agora somos capazes de resolver isso colocando nossos arquivos diretamente em ``my_app/static/`` (ao invés de criar outro subdiretório ``my_app``), mas isso seria na verdade uma má idéia. O Django irá usar o primeiro arquivo estático que encontrar com o mesmo nome, e se você tiver um arquivo estático com o mesmo nome em uma outra aplicação, o Django será incapaz de distinguir entre eles. Precisamos ser capazes de apontar ao Django o arquivo correto, e a maneira mais fácil de fazer isso é *contextualizando* eles. Isso é, colocando aqueles arquivos estáticos dentro de um *outro* diretório nomeado para aquela aplicação específica.
zh_hans: 现在，我们 *也许* 能直接将静态文件放入 ``my_app/static/`` 目录（而不是创建另一个 ``my_app`` 子目录），不过这实际上是个坏主意。Django 会使用第一个名字匹配的静态文件，若你在 *不同的* 应用中有一个同名静态文件，Django 无力区分它们。我们需要为 Django 指出正确的那个，而最简单的方式就是使用 *命名空间*。也就是说，将这些静态文件放在 *另一个* 以应用名本身命名的目录下。

source: Serving static files during development.
pt_br: Servindo arquivos estáticos durante desenvolvimento.

source: If you use :mod:`django.contrib.staticfiles` as explained above, :djadmin:`runserver` will do this automatically when :setting:`DEBUG` is set to ``True``. If you don't have ``django.contrib.staticfiles`` in :setting:`INSTALLED_APPS`, you can still manually serve static files using the :func:`django.contrib.staticfiles.views.serve` view.
pt_br: Se você usa :mod:`django.contrib.staticfiles` como explicado acima, :djadmin:`runserver` irá fazer isso automaticamente quando o :setting:`DEBUG` está definido como ``True``. Se você não tem ``django.contrib.staticfiles`` no :setting:`INSTALLED_APPS`, você ainda pode servir arquivos estáticos manualmente usando a "view" :func:`django.contrib.staticfiles.views.serve`.

source: For example, if your :setting:`STATIC_URL` is defined as ``/static/``, you can do this by adding the following snippet to your urls.py::
pt_br: Por exemplo, se seu :setting:`STATIC_URL` está definido como ``/static/``, você pode fazê-lo adicionando o seguinte pedaço de código no seu urls.py::
zh_hans: 例如，若 :setting:`STATIC_URL` 为 ``/static/``，你能通过添加以下代码片段至 urls.py 完成目的::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/static/``) and not a URL (e.g. ``http://static.example.com/``).
pt_br: A função de auxílio funciona somente em mode de depuração e somente se o dado prefixo for local (ex.: ``/static/``) e não uma URL (ex.: ``http://static.example.com/``).
zh_hans: 该助手函数只能在 debug 模式下生效，且要求前缀是本地的（例如 ``/static/``），不是一个 URL (例如 ``http://static.example.com/``)。

source: Serving files uploaded by a user during development.
pt_br: Servindo arquivos enviados por um usuário durante o desenvolvimento.

source: During development, you can serve user-uploaded media files from :setting:`MEDIA_ROOT` using the :func:`django.contrib.staticfiles.views.serve` view.
pt_br: Durante o desenvolvimento, você pode servir arquivos de media dos usuários através do :setting:`MEDIA_ROOT` usando a "view" :func:`django.contrib.staticfiles.views.serve`.

source: For example, if your :setting:`MEDIA_URL` is defined as ``/media/``, you can do this by adding the following snippet to your urls.py::
pt_br: Por exemplo, se o seu :setting:`MEDIA_URL` está definido como ``/media/``, você pode faze-lo adicionando o seguinte pedaço de código no seu urls.py::
zh_hans: 例如，若 :setting:`MEDIA_URL` 定义为 ``/media/``，你可以通过将以下代码片段加入 urls.py 实现目的::

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``/media/``) and not a URL (e.g. ``http://media.example.com/``).
pt_br: Essa função de auxílio funciona somente em mode de depuração e somente se o dado prefixo for local (ex.: ``/media/``) e não uma URL (e.g. ``http://media.example.com/``).
zh_hans: 该助手函数只能在 debug 模式下生效，且要求前缀是本地的（例如 ``/static/``），不是一个 URL (例如 ``http://media.example.com/``)。

source: Upgrading Django to a newer version
pt_br: Atualizando o Django para uma nova versão
zh_hans: 升级 Django 到最新的版本

source: Older version of Django will eventually no longer receive security updates. (see :ref:`backwards-compatibility-policy`).
pt_br: Antigas versões do Django eventualmente não irão receber atualizações de segurança. (veja :ref:`backwards-compatibility-policy`).

source: Afterwards, you should familiarize yourself with the changes that were made in the new Django version(s):
pt_br: Depois você deveria familiarizar-se com as mudanças que foram feitas na(s) verõe(s) nova(s) do Django.
zh_hans: 随后，你要自主熟悉 Django 新版本的修改：

source: Once you're ready, it is time to :doc:`install the new Django version </topics/install>`. If you are using virtualenv_ and it is a major upgrade, you might want to set up a new environment with all the dependencies first.
pt_br: Uma vez que esteja pronto, é hora de :doc:`Instale a nova versão do Django </topics/install>`. Se estiver usando o virtualenv_ e for uma atualização grande, você talvez queira configurar um novo ambiente com todas as depoendências primeiro.
zh_hans: 准备好后，就是 :doc:`安装新版 Django </topics/install>` 的时候。若你正使用 virtualenv_ ，且这是一次关键性升级，你可能想要先配置一个包含所有依赖的环境。

source: Exactly which steps you will need to take depends on your installation process. The most convenient way is to use pip_ with the ``--upgrade`` or ``-U`` flag:
pt_br: Os passos exatos que serão necessários depende do seu processo de inatalação. O jeito mais conveniente é usar o pip_ com ``--upgrade`` ou o parametro ``-U``:

source: pip_ also automatically uninstalls the previous version of Django.
pt_br: O pip_ também automaticamente desinstala as versões anteriores do Django.
