Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The admin files live in (:source:`django/contrib/admin/static/admin`) of the Django distribution.
ja: admin ファイルは Django ディストリビューションの (:source:`django/contrib/admin/static/admin`) にあります。

source: We **strongly** recommend using :mod:`django.contrib.staticfiles` to handle the admin files (along with a web server as outlined in the previous section; this means using the :djadmin:`collectstatic` management command to collect the static files in :setting:`STATIC_ROOT`, and then configuring your web server to serve :setting:`STATIC_ROOT` at :setting:`STATIC_URL`), but here are three other approaches:
it: Noi consigliamo **fortemente** l'uso di :mod:`django.contrib.staticfiles` per gestire i file di admin ( insieme a un web server come sottolineato nella sezione precedente; questo significa utilizzare il :djadmin:`collectstatic` management command per raccogliere tutti i file statici dentro :setting:`STATIC_ROOT`, e poi configurare il tuo web server in modo da servire :setting:`STATIC_ROOT` su :setting:`STATIC_URL`), ma ecco altri tre approcci:
ja: **強く** 推奨される方法は、 :mod:`django.contrib.staticfiles` を使用して管理ファイルを処理することです（前のセクションで説明されているように、Webサーバーと併用します。これは、 :setting:`STATIC_ROOT` に静的ファイルを集めるために :djadmin:`collectstatic` 管理コマンドを使用し、その後、Webサーバーを設定して :setting:`STATIC_ROOT` を :setting:`STATIC_URL` で提供することを意味します）。しかし、他にも次の3つのアプローチがあります:

source: Create a symbolic link to the admin static files from within your document root (this may require ``+FollowSymLinks`` in your Apache configuration).
it: Crea un link simbolico ai file statici di admin dalla document root (può richiedere ``+FollowSymLinks`` nella configurazione di Apache).
ja: ドキュメントルートに admin の静的ファイルへのシンボリックを作ります。 (Apache の設定に ``+FollowSymLinks`` が必要になるでしょう)
ko: 문서 루트 내에서 관리 정적 파일에 대한 심볼 링크를 생성합니다(이 링크를 사용하려면 Apache 구성에서 "+FollowSymLinks"가 필요할 수 있음).
pt_br: Crie um link simbólico para os arquivos estáticos do admin de dentro do seu "document root"(isso talvez requeira ``+FollowSymLinks``na sua configuração do Apache).
zh_hans: 在文档根目录中创建一个指向后台静态文件的符号链接（Apache 配置中可能要添加 ``+FollowSymLinks``）。

source: Use an ``Alias`` directive, as demonstrated above, to alias the appropriate URL (probably :setting:`STATIC_URL` + ``admin/``) to the actual location of the admin files.
it: Utilizza una direttiva ``Alias``, come mostrato qui sopra, per fare un alias della URL appropriata (probabilmente :setting:`STATIC_URL` + ``admin/``) alla vera locazione dei file di admin.
ja: 上で示したように Alias ディレクティブを使って、適切な URL (おそらく :setting:`STATIC_URL` + ``admin/``) から admin ファイルがある実際の場所へのエ イリアスを作ります。
ko: 위에서 설명한 대로 "Alias" 지시문을 사용하여 적절한 URL(아마도 : setting: 설정)을 별칭으로 지정한다.STATIC_URL' + 관리 파일의 실제 위치에 "admin/".
pt_br: Use uma diretiva ``Alias``, como demonstrado acima, para apelidar a URL apropriada (provavelmente : settings:`SATTIC_URL`+ ``admin/``) para o local real dos arquivos do admin.
zh_hans: 使用前文介绍的 ``Alias`` 指令，为合适的 URL (可能是 :setting:`STATIC_URL` + ``admin/``) 取个别名，指向后台文件的实际位置。

source: Copy the admin static files so that they live within your Apache document root.
it: Copia i file statici di admin in modo che siano presenti nella cartella principale di Apache.
ja: admin の静的ファイルをコピーし、 Apache のドキュメントルートに置きます。
ko: 관리 정적 파일이 Apache 문서 루트 내에 있도록 복사합니다.
pt_br: Copie os arquivos estáticos do admin para que entã eles fiquem dentro do "document root" do Apache.
zh_hans: 直接将后台静态文件拷贝至 Apache 的文档根目录。

source: Authenticating against Django's user database from Apache
it: Autenticare da Apache verso il database utenti di Django
ja: Django のユーザーデータベースに対する Apache からの認証
ko: Apache에서 Django의 사용자 데이터베이스에 대해 인증
pt_br: Autenticação do usuário Django vindo do Apache.
zh_hans: Apache 利用 Django 的用户数据库进行验证

source: Django provides a handler to allow Apache to authenticate users directly against Django's authentication backends. See the :doc:`mod_wsgi authentication documentation </howto/deployment/wsgi/apache-auth>`.
it: Django fornisce un handler per permettere ad Apache di autenticare gli utenti direttamente sul backend di autenticazione Django. Vedi la :doc:`la documentazione di autenticazione mod_wsgi </howto/deployment/wsgi/apache-auth>`.
ja: DjangoはApacheがDjangoの認証バックエンドに対して直接ユーザを認証できるようにハンドラを提供します。 :doc:`mod_wsgi 認証ドキュメント </howto/deployment/wsgi/apache-auth>` を参照してください。
ko: Django는 Apache가 Django의 인증 백엔드에 대해 사용자를 직접 인증할 수 있도록 하는 핸들러를 제공합니다. :doc:'mod_wsgi 인증확인 문서'를 참조하십시오.
pt_br: O Django disponibiliza um facilitador para habilitar o Apache a autenticar usuários diretamente no backend de autenticação do Django. veja :doc:`documentação de autenticação do mod_wsgi </howto/deployment/wsgi/apache-auth>`.
zh_hans: Django 提供了一个处理器，允许 Apache 直接用 Django 的认证授权后端认证用户。参考文档 :doc:`mod_wsgi 认证授权文档 </howto/deployment/wsgi/apache-auth>`。

source: How to use Django with uWSGI
it: Come usare Django con uWSGI
ja: Django を uWSGI とともに使うには？
ko: uWSGI와 함께 django를 사용하는 방법
pt_br: Como usar Django com uWSGI
zh_hans: 如何用 uWSGI 托管 Django

source: uWSGI_ is a fast, self-healing and developer/sysadmin-friendly application container server coded in pure C.
it: uWSGI_ è un application server container veloce, autoriparante e developer/sysadmin-friendly programmato in C puro.
ja: uWSGI_ は高速かつ自己回復的、開発者やシステム管理者にとって使いやすいアプリケーションコンテナサーバーで、純粋な C 言語で記述されています。
ko: uWSGI_은(는) 빠르고 자가 치료 및 개발/sysadmin 친화적인 애플리케이션 컨테이너 서버로, 순수 C로 코딩되어 있습니다.
pt_br: uWSGI_ é um sevidor de container de aplicação feito em C puro, rápido, auto-ajustável e amigável a desenvolvedores e administradores de sistema.
zh_hans: uWSGI_ 是一个快速的，自我驱动的，对开发者和系统管理员友好的应用容器服务器，完全由 C 编写。

source: The uWSGI docs offer a `tutorial`_ covering Django, nginx, and uWSGI (one possible deployment setup of many). The docs below are focused on how to integrate Django with uWSGI.
it: Il documento uWSGI offre un `tutorial`_ che copre Django, nginx e uWSGI (un possibile setup di deployment tra molti). I documenti qui sotto sono focalizzati su come integrare Django con uWSGI.
ja: uWSGI のドキュメントは、Django、nginx および uWSGI をカバーした `tutorial`_ を提供しています (たくさんあるセットアップ方法の一例です)。以下のドキュメントは、Django を uWSGI と統合する方法に焦点を当てています。
ko: uWSGI 문서는 Django, nginx 및 uWSGI(다수의 배포 설정 중 하나)를 포함하는 '자습서'를 제공한다. 아래 문서는 Django를 uWSGI와 통합하는 방법에 초점을 맞추고 있습니다.
pt_br: A documentação do uWSGI oferecem um `tutorial`_ cobrindo Django, nginx e uWSGI (uma possível implantaçao dentre muitas). A documentação abaixo foca em como integrar o Django com uWSGI.
zh_hans: uWSGI 文档提供了一个覆盖 Django，nginx，和 uWSGI（一个配置，多种适配）。以下文档专注于如何用 uWSGI 集成 Django。

source: Prerequisite: uWSGI
it: Prerequisiti: uWSGI
ja: 前提条件: uWSGI
ko: 전제 조건 : uWSGI
pt_br: Prerequisito: uWSGI
zh_hans: 前置条件：uWSGI

source: The uWSGI wiki describes several `installation procedures`_. Using pip, the Python package manager, you can install any uWSGI version with a single command. For example:
it: Il wiki uWSGI descrive molte `procedure di installazione`_. Usando pip, il package manager di Python, puoi installare qualsiasi versione di uWSGI con un singolo comando. Per esempio:
ja: uWSGI の wiki には、いくつかの `installation procedures`_ が記載されています。Python のパッケージマネージャーであるpipを使って、あらゆるバージョンの uWSGI を一つのコマンドでインストールすることができます。たとえば:
ko: uWSGI 위키에는 여러 설치 절차가 설명되어 있다. Python 패키지 관리자 pip을 사용하면 단일 명령으로 uWSGI 버전을 설치할 수 있습니다. 예:
pt_br: A wiki uWSGI descreve vários `instalation procedures`_. Usando o pip, o gerenciador de pacotes do Python, é possível instalar o uWSGI com um único comando. Por exemplo:
zh_hans: uWSGI 百科介绍了几种 `安装流程`_。Pip （Python 包管理器）能让你仅用一行代码就安装任意版本的 uWSGI。例子：

source: uWSGI model
it: modello uWSGI
ja: uWSGI モデル
ko: uWSGI 모델
pt_br: Modelo uWSGI
zh_hans: uWSGI 模块

source: uWSGI operates on a client-server model. Your web server (e.g., nginx, Apache) communicates with a ``django-uwsgi`` "worker" process to serve dynamic content.
it: uWSGI oprera su un modello client-server. Il tuo web server (per es. Apache nginx) comunica con un processo "worker" ``django-uwsgi`` per servire il contenuto dinamico.
ja: uWSGI はクライアントサーバモデルで動作します。Web サーバー (nginx や Apache など) は ``djangoo-uwsgi`` "worker" プロセスと通信し、動的なコンテンツを提供します。

source: Configuring and starting the uWSGI server for Django
it: Configurare ed avviare il server uWSGI per Django
ja: Django に対して uWSGI サーバーを設定、開始する
ko: Django용 uWSGI 서버 구성 및 시작
pt_br: Configurando e iniciando o servidor uWSGI para o Django
zh_hans: 配置并启动用于 Django 的 uWSGI 服务器

source: uWSGI supports multiple ways to configure the process. See uWSGI's `configuration documentation`_.
it: uWSGi supporta diverse modalità di configurazione. Leggi la `configuration documentation`_ di uWSGI.
ja: uWSGI では、プロセスを設定する方法が複数提供されています。uWSGI's `configuration documentation`_ を参照してください。
ko: uWSGI는 프로세스를 구성하는 다양한 방법을 지원합니다. uWSGI의 '구성 설명서'를 참조하십시오.
zh_hans: uWSGI 支持多种配置进程的方式。参考 uWSGI 的 `配置文档`_。

source: Here's an example command to start a uWSGI server:
ja: 以下はuWSGIサーバーを起動するコマンドの例です:

source: This assumes you have a top-level project package named ``mysite``, and within it a module :file:`mysite/wsgi.py` that contains a WSGI ``application`` object. This is the layout you'll have if you ran ``django-admin startproject mysite`` (using your own project name in place of ``mysite``) with a recent version of Django. If this file doesn't exist, you'll need to create it. See the :doc:`/howto/deployment/wsgi/index` documentation for the default contents you should put in this file and what else you can add to it.
it: Si assume che tu abbia un top-level package denominato "mysite", ed all'interno un modulo :file`mysite\wsgi.py` contenente un oggetto WSGI ``application``. Questo è il layout che si ottiene eseguendo ``django-admin startproject mysite`` (utilizzando lo specifico nome del tuo progetto al posto di ``mysite``) con una versione recente di Django. Nel caso il file non esista, verrà creato. Vedi anche il documento :doc:`/howto/deployment/wsgi/index` per i contenuti di default che dovrai inserire in questo file e che cos'altro puoi aggiungere in esso.
ja: この例では、``mysite`` と名付けられたトップレベルのプロジェクトパッケージがあり、またその中に :file:`mysite/wsgi.py` という WSGI ``application`` オブジェクトを含むモジュールがあると仮定しています。これは、最近のバージョンの Django で ``django-admin startproject mysite`` (``mysite`` には自分のプロジェクト名が入ります) を実行した場合、自動生成されるファイル構成です。もしこのファイルが存在しない場合、自分自身で作る必要があります。このファイルに記述すべきデフォルトの内容と、自分で追加できる部分に関しては、:doc:`/howto/deployment/wsgi/index` ドキュメントを参照してください。
ko: 이것은 당신이 "mysite"라는 이름의 최고 수준의 프로젝트 패키지를 가지고 있고 그 안에 파일:mysite/wsgi라는 모듈이 있다고 가정한다.WSGI의 "응용프로그램"을 담고 있는 py. 최신 버전의 장고와 함께 ``장고 관리 시작 프로젝트 my site" (내 사이트 대신 자신의 프로젝트 이름을 사용함)를 실행하면 이렇게 배치된다. 이 파일이 없으면 파일을 만들어야 합니다. 이 파일에 넣어야 하는 기본 내용과 파일에 추가할 수 있는 내용은 :doc:'/how to/deploy/wsgi/index' 문서를 참조하십시오.
pt_br: Asume-se que tem um pacote do projeto no nível mais alto chamado ``mysite``, e dentro deste um módulo :file:`mysite/wsgi.py` que contém um objeto ``applicação`` WSGI. Este é o layout que terá se executar ``django-admin startproject mysite`` (usando so seu próprio nome de projeto do lugar do ``mysite``) com a recente versão do Django. Se este arquivo não existe, é necessário criá-lo. Veja a documentação em :doc:`/howto/deployment/wsgi/index` para o conteúdo padrão que deve ser colocado neste arquivo e que você pode adicionar.
zh_hans: 假设你有个叫做 ``mysite`` 的顶级项目包，期中包含一个模板 :file:`mysite/wsgi.py`，模块包含一个 WSGI ``application`` 对象。如果你使用的是较新的 Django，这就是你运行 ``django-admin startproject mysite`` （使用你的项目名替换 ``mysite``）后得到的目录结构。若该文件不存在，你需要创建它。参考文档 :doc:`/howto/deployment/wsgi/index` 看看你需要配置的默认内容，以及你还能添加什么。

source: The Django-specific options here are:
it: Le opzioni specifiche per Django sono qui:
ja: Django 特有のオプションは以下の通りです:
ko: 여기서 Django별 옵션은 다음과 같습니다.
pt_br: As opções específicas para o Django são:
zh_hans: Django 指定的参数如下：

source: ``chdir``: The path to the directory that needs to be on Python's import path -- i.e., the directory containing the ``mysite`` package.
it: ``chdir``: il percorso alla directory che necessita di essere sul percorso di importazione di Python -- cioè, la directory che contiene il package ``mysite``.
ja: ``chdir``: Python のインポートパス上で必要になるディレクトリへのパス -- つまり ``mysite`` パッケージを含むディレクトリです。
ko: "치디르: Python의 가져오기 경로에 있어야 하는 디렉터리(즉, "mysite" 패키지를 포함하는 디렉터리)의 경로입니다.
pt_br: ``chdir``: O caminho do diretório necessário estar no Python path -- isto é, o diretório que contém o pacote ``mysite``.
zh_hans: ``chdir``：需要包含于 Python 的导入路径的目录的路径——例如，包含 ``mysite`` 包的目录。

source: ``module``: The WSGI module to use -- probably the ``mysite.wsgi`` module that :djadmin:`startproject` creates.
it: ``module``: il modulo WSGI da usare -- probabilmente il modulo ``mysite.wsgi`` che :djadmin:`startproject` crea.
ja: ``module``: 使われる WSGI モジュール -- 通常は :djadmin:`startproject` によって生成される ``mysite.wsgi`` モジュールです。
ko: "말하자면: 사용할 WSGI 모듈 - 아마도 "내 사이트"일 것이다.假admin:'start project'가 만드는 wsgi² 모듈.
pt_br: ``module``: O módulo WSGI a ser usado -- provavelmente o módulo ``mysite.wsgi`` que o :djadmin:`startproject` cria.
zh_hans: ``module``：要使用的 WSGI 模块——可能是 :djadmin:`startproject` 创建的 ``mysite.wsgi`` 的模块。

source: ``env``: Should probably contain at least :envvar:`DJANGO_SETTINGS_MODULE`.
it: ``env``: dovrebbe probabilmente contenere almeno :envvar:`DJANGO_SETTINGS_MODULE`.
ja: ``env``: 少なくとも :envvar:`DJANGO_SETTINGS_MODULE` を含む必要があります。
ko: ``env``: 최소한은 :envvar:`DJANGO_SETTINGS_MODULE`. 을 포함해야 한다.

source: ``home``: Optional path to your project virtual environment.
it: ``home``: Path opzionale dell'ambiente virtuale del tuo progetto
ja: ``home``: プロジェクトの仮想環境へのパスを指定します。
ko: "홈": 프로젝트 가상 환경에 대한 옵션 경로입니다.

source: Example ini configuration file:
ja: ini 設定ファイルの例:

source: Example ini configuration file usage:
ja: ini 設定ファイルを使用する例:

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure uWSGI is configured to accept non-ASCII file names by adding this to your ``uwsgi.ini``:
ja: 非 ASCII 文字を含むファイル名でファイルをアップロードするときに ``UnicodeEncodeError`` が発生する場合は、 ``uwsgi.ini`` に以下の設定を追加して、uWSGI が非 ASCII ファイル名を受け付けるようにしてください:

source: See the uWSGI docs on `managing the uWSGI process`_ for information on starting, stopping and reloading the uWSGI workers.
it: Vedi la documentazione uWSGI su come `gestire il processo uWSGI`_ per informazioni su come avviare, fermare e ricaricare i worker uWSGI.
ja: uWSGI worker の開始、停止およびリロードに関する情報は、uWSGI ドキュメントの `managing the uWSGI process`_ を参照してください。
ko: uWSGI 작업자의 시작, 중지 및 재로드에 대한 내용은 uWSGI 프로세스 관리(uWSGI 프로세스 관리) 문서를 참조하십시오.
pt_br: Veja a documentação do uWSGI no `managing the uWSGI process`_ para informações sobre iniciar, parar e recarregar os uWSGI workers.
zh_hans: 参考 uWSGI 文档 `管理 uWSGI 进程`_ 获取更多关于开启，关闭和重载 uWSGI workers 的信息。

source: How to manage error reporting
it: Come gestire il report degli errori
ja: エラーレポートの管理

source: When you're running a public site you should always turn off the :setting:`DEBUG` setting. That will make your server run much faster, and will also prevent malicious users from seeing details of your application that can be revealed by the error pages.
it: Quando esponi un sito pubblico, dovresti sempre disattivare :setting:`DEBUG`. Questo renderà il tuo server molto più veloce, e inoltre previene di mostrare a utenti malevoli i dettagli della tua applicazione che possono essere rivelati dalle pagine di errore.
ja: サイトを公開している場合、:setting:`DEBUG` 設定は常にオフにしておかなければなりません。これにより、サーバー動作は高速になり、エラーページによって明らかになるアプリケーションの詳細が悪意あるユーザーに漏れるのを防ぎます。
ko: 공용 사이트를 실행할 때는 항상 :설정 기능을 해제해야 합니다.'DEBUG' 설정입니다. 이렇게 하면 서버가 훨씬 더 빨리 실행될 수 있으며, 악성 사용자가 오류 페이지에서 나타날 수 있는 응용프로그램의 세부 정보를 볼 수 없게 됩니다.
pt_br: Quando estiver rondando um site público você deve sempre desligar a definição :setting:`DEBUG` . Isso fará que seu servidor rode bem mais rápido, e também irá evitar que usuários maliciosos vejam detalhes da sua aplicação que podem ser revelados por erros em suas páginas.
zh_hans: 当您运行着公开的网页时，你应该把设置中的 :setting:`DEBUG` 选项设为关闭。 这将使您的服务器运行得更快，并且还可以防止恶意用户在错误页面中看到应用的详细信息。

source: However, running with :setting:`DEBUG` set to ``False`` means you'll never see errors generated by your site -- everyone will instead see your public error pages. You need to keep track of errors that occur in deployed sites, so Django can be configured to create reports with details about those errors.
it: Tuttavia, l'esecuzione con :setting:`DEBUG` impostato a ``False`` comporta che non saranno mai visibili gli errori generati dal tuo sito -- al loro posto chiunque vedrà solo le pagine pubbliche di errore. Per tenere traccia degli errori che si verificano in un sito pubblicato, Django può essere configurato per creare reports con dettagli su tali errori.
ja: しかし、 :setting:`DEBUG` を ``False`` にセットして実行すると、サイトによって生成されるエラーが見られなくなります――表示されるのは万人向けのエラーページだけです。そこで、本番サイトで起きたエラーを追跡するために、Django ではこれらのエラーに関する詳細なレポートを作成するように設定できます。
ko: 그러나 :설정으로 실행:디버그가 "거짓"으로 설정된 것은 당신의 사이트에서 발생한 오류를 절대 보지 못한다는 것을 의미하며, 그 대신 모든 사람이 당신의 공개 오류 페이지를 보게 될 것이다. 배포된 사이트에서 발생하는 오류를 추적해야 하므로 Django가 이러한 오류에 대한 세부 정보가 포함된 보고서를 생성하도록 구성할 수 있습니다.

source: Email reports
it: Rapporti email
ja: E メールのレポート
ko: 이메일 보고
pt_br: Relatórios por email.
zh_hans: 通过邮件方式报告

source: Server errors
it: Errori del server
ja: サーバーエラー
ko: 서버 오류
pt_br: Erros do servidors
zh_hans: 服务器错误

source: When :setting:`DEBUG` is ``False``, Django will email the users listed in the :setting:`ADMINS` setting whenever your code raises an unhandled exception and results in an internal server error (strictly speaking, for any response with an HTTP status code of 500 or greater). This gives the administrators immediate notification of any errors. The :setting:`ADMINS` will get a description of the error, a complete Python traceback, and details about the HTTP request that caused the error.
it: Quando :setting:`DEBUG` è False, Django invierà una mail agli utenti citati nel setting :setting:`ADMINS` ogni volta che il tuo codice lancerà un'eccezione non gestita e che risulterà come un error interno del server ( in poche parole, per ogni risposta con un codice HTTP 500 or maggiore ). Questo comporta un'immediata notifica agli amministratori di qualsiasi errore. Le persone specificate nel setting :setting:`ADMINS` riceveranno un descrizione dell'errore, un traceback Python completo, e i dettagli della richiesta HTTP che ha generato gli errori.
ja: :setting:`DEBUG` が ``False`` であるとき、コードがハンドリングされない例外を起こして内部サーバーエラーが起きると (厳密には、500 以上の HTTP ステータスコードを持つ全てのレスポンスが返ってくると)、Django は :setting:`ADMINS` 設定のリストに含まれるユーザーにメールを送信します。これにより、管理者はすぐにエラーの通知を受け取ることができます。メールには、:setting:`ADMINS` はエラーの説明、Python のトレースバック全体、エラーを引き起こした HTTP リクエストの詳細について書かれています。
ko: 시기:설정:DEBUG는 "False"이며, Django는 다음과 같은 설정에 나열된 사용자에게 e-메일을 보낼 것이다.코드가 처리되지 않은 예외를 발생시키고 내부 서버 오류가 발생할 때마다 'ADMIN'을 설정합니다( 엄밀히 말하면 HTTP 상태 코드가 500 이상인 응답의 경우). 이렇게 하면 관리자는 오류를 즉시 알 수 있습니다. :설정:'ADMIN'은 오류에 대한 설명, 완전한 Python 추적, 오류를 발생시킨 HTTP 요청에 대한 세부 정보를 얻을 것이다.

source: In order to send email, Django requires a few settings telling it how to connect to your mail server. At the very least, you'll need to specify :setting:`EMAIL_HOST` and possibly :setting:`EMAIL_HOST_USER` and :setting:`EMAIL_HOST_PASSWORD`, though other settings may be also required depending on your mail server's configuration. Consult :doc:`the Django settings documentation </ref/settings>` for a full list of email-related settings.
it: Per inviare e-mail, Django richiede alcune impostazioni che gli dicono come connettersi al tuo server di posta. Come minimo dovrai specificare :setting:`EMAIL_HOST` e presumibilmente :setting:`EMAIL_HOST_USER` e :setting:`EMAIL_HOST_PASSWORD`, anche se altre impostazioni potrebbero essere richieste a seconda della configurazione del tuo mail server. Consulta </ref/settings> per una lista completa delle impostazioni email
ja: メールを送信するために、Django はメールサーバーへの接続方法をいくつか設定する必要があります。最低限 :setting:`EMAIL_HOST` と、おそらく :setting:`EMAIL_HOST_USER` と :setting:`EMAIL_HOST_PASSWORD` を指定する必要がありますが、メールサーバーの設定によっては他の設定も必要かもしれません。メール関連の設定の一覧は :doc:`Django の設定のドキュメント </ref/settings>` を参照してください。
ko: 전자 메일을 보내기 위해 Django는 메일 서버에 연결하는 방법을 알려주는 몇 가지 설정이 필요합니다. 최소한 설정:을 지정해야 합니다.'E-MAIL_HOST' 및 가능한 설정:'EMAIL_HOST_USER' 및 :설정:메일 서버의 구성에 따라 다른 설정이 필요할 수도 있지만 'EMAIL_HOST_PASSWORD'입니다. 이메일 관련 설정의 전체 목록은 :doc:'Django 설정 설명서'를 참조하십시오.
pt_br: Para enviar o email, o Django requer algumas configurações dizendo a ele como se conectar ao seu servidor de email. No mínimo é necessário especificar :setting:`EMAIL_HOST` e possivelmente :setting:`EMAIL_HOST_USER` e :setting:`EMAIL_HOST_PASSWORD`, embora outras configurações tambem sejam requeridas dependendo da configuração do seu servidor de email. Consulte o :doc:`Documentação de configurações do Django </ref/settings>` para uma lista completa de configurações relacionadas a email.
zh_hans: 要发送邮件，Django 要求一些配置项，告诉它如何连接至邮件服务器。最小配置下，你需要指定 :setting:`EMAIL_HOST` 和 :setting:`EMAIL_HOST_USER` 和 :setting:`EMAIL_HOST_PASSWORD`，可能还有其它配置，这取决于邮件服务器的配置。查阅 :doc:`Django 配置文档 </ref/settings>` 获取邮件相关配置的完整列表。

source: By default, Django will send email from root@localhost. However, some mail providers reject all email from this address. To use a different sender address, modify the :setting:`SERVER_EMAIL` setting.
it: Di default, Django invierà le email da root@localhost. Ma, qualche mail provider rifiuta tutte le mail da questo indirizzo. Per utilizzare un indirizzo diverso, modifica il setting :setting:`SERVER_EMAIL`
ja: デフォルトでは、 Django は root@localhost からメールを送信します。しかし、メールプロバイダによっては、このアドレスからのメールを全て拒否します。別の送信者アドレスを使うには、 :setting:`SERVER_EMAIL` 設定を変更してください。
ko: 기본적으로 Django는 root@localhost에서 이메일을 전송합니다. 그러나 일부 메일 공급자는 이 주소의 모든 전자 메일을 거부합니다. 다른 발송인 주소를 사용하려면 :seting:'을 수정하십시오.SERVER_EMail' 설정입니다.
pt_br: Por padrão, o Django envia email do root@localhost. Contudo, alguns provedores de email rejeitam todos os email deste endereço. Para usar um endereço de remetente diferente, modifique a configuração :setting:`SERVER_EMAIL`
zh_hans: 默认情况下，Django 会从 root@localhost 发送邮件。然而，某些邮件服务商拒绝来自该地址的所有邮件。要使用不同的发件人地址，修改 :setting:`SERVER_EMAIL` 配置。

source: To activate this behavior, put the email addresses of the recipients in the :setting:`ADMINS` setting.
it: Per attivare questo comportamento, inserisci l'indirizzo email del destinatario nella configurazione :setting:`ADMINS` .
ja: この動作を有効にするには、受信者のメールアドレスを :setting:`ADMINS` 設定に含めます。
ko: 이 동작을 활성화하려면 수신자의 전자 메일 주소를 : 설정에 입력하십시오.'ADMIN' 설정.
pt_br: Para ativar este comportamento, coloque o endereço de email dos destinatários na definição do :setting:`ADMINS`
zh_hans: 要启动该行为，将收件人的邮箱地址放入 :setting:`ADMINS`。

source: Server error emails are sent using the logging framework, so you can customize this behavior by :doc:`customizing your logging configuration </topics/logging>`.
it: Le email di errori relativi al server sono inviate usando il framework di logging, puoi personalizzare questo comportamento in :doc:`personalizza la configurazione del sistema di logging </topics/logging>`.
ja: サーバーエラーのメールはロギングフレームワークを使って送信されるので、 :doc:`ロギングの設定をカスタマイズする</topics/logging>` ことで動作を変更できます。
ko: 서버 오류 전자 메일은 로깅 프레임워크를 사용하여 전송되므로 :doc:'로그 구성 사용자 지정'을 통해 이 동작을 사용자 지정할 수 있습니다.
pt_br: Emails de erros de servidores são enviados usando o framework de log, e você pode customizár seu comportamento por :doc:`customizando sua configuração de log </topics/logging>`.
zh_hans: 服务器错误邮件由 logging 框架发出，所以你能通过 :doc:`自定义 logging 配置 </topics/logging>` 自定义该行为。

source: 404 errors
it: Errori 404
ja: 404 エラー
ko: 404 오류
pt_br: Erros 404
zh_hans: 404 错误
