Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If your command defines mandatory positional arguments, you can customize the message error returned in the case of missing arguments. The default is output by :py:mod:`argparse` ("too few arguments").
it: Se il tuo comando definisce degli argomenti posizionali obbligatori, puoi personalizzare il messaggio di errore restituito in caso di argomenti mancanti. Quello di default è restituito da :py:mod:`argparse` ("too few arguments").
ja: コマンドが必須の位置引数を定義している場合、引数が足りない場合に返されるエラーメッセージをカスタマイズできます。デフォルトは :py:mod:`argparse` によって出力されます ("too few arguments")。
ko: 명령에서 필수 위치 인수를 정의하는 경우 인수가 누락된 경우 반환되는 메시지 오류를 사용자 정의할 수 있습니다. 기본값은 :py:mod:'argparse'("너무 적은 인수") 출력입니다.
pt_br: Se o seu comando define argumentos posicionais obrigatórios, você pode personalizar a mensagem de erro devolvida em caso de falta de argumentos. O padrão é a saída por :py:mod:`argparse` ("poucos argumentos").
zh_hans: 如果你的命令定义了必须的位置参数，你可以在缺失参数时返回自定义错误消息。默认输出由 :py:mod:`argparse` 打印("too few arguments")。

source: A boolean indicating whether the command outputs SQL statements; if ``True``, the output will automatically be wrapped with ``BEGIN;`` and ``COMMIT;``. Default value is ``False``.
it: Un booleano che indica se il comando mostra in output uno statement SQL; se ``True``, l'output sarà automaticamente inserito tra ``BEGIN;`` e ``COMMIT;``. Il valore predefinito è ``False``.
ja: コマンドが SQL 文を出力するかどうかを決めるブール値。``True`` の場合、出力文が自動的に ``BEGIN;`` と ``COMMIT;`` で囲まれます。デフォルトの値は ``False`` です。
ko: 명령어가 SQL 문을 출력하는지 여부를 나타내는 부울로, "True"일 경우 출력은 자동으로 "BEGIN"과 "COMIT"로 포장된다. 기본값은 "False"입니다.
pt_br: Um booleano que indica como os comandos retornam SQL "statements"; Se ``True``, a saída será automaticamente envolvido com ``BEGIN;`` e ``COMMIT;``. O valor padrão é ``False``.
zh_hans: 一个布尔值，决定命令是否暑输出 SQL 语句；若为 ``True``，输出内容会自动以 ``BEGIN;`` 和 ``COMMIT;`` 包裹。默认值为 ``False``。

source: A boolean; if ``True``, the command prints a warning if the set of migrations on disk don't match the migrations in the database. A warning doesn't prevent the command from executing. Default value is ``False``.
it: Un booleano; se ``True``, il comando stampa un messaggio di warning se il set di migrazioni su disco non corrisponde a quelle sul database. Un warning non impedisce l'esecuzione del comando. Il valore predefinito è ``False``.
ja: Boolean。``True`` の場合、ディスク上に存在する一連のマイグレーション定義がデータベース上に保存されたマイグレーション定義とマッチしない場合に警告を出力します。この警告はコマンドの実行を停止させる物ではありません。デフォルトの値は ``False`` です。
ko: 불. "True"인 경우 명령은 디스크의 마이그레이션 집합이 데이터베이스의 마이그레이션과 일치하지 않을 경우 경고를 인쇄합니다. 경고는 명령 실행을 차단하지 않습니다. 기본값은 "False"입니다.
zh_hans: 一个布尔值；若为 ``True``，命令会在硬盘上存储的 migrations 与 数据库中的不一致时打印警告。警告不会阻止命令执行。默认值为 ``False``。

source: A list or tuple of tags, e.g. ``[Tags.staticfiles, Tags.models]``. System checks :ref:`registered in the chosen tags <registering-labeling-checks>` will be checked for errors prior to executing the command. The value ``'__all__'`` can be used to specify that all system checks should be performed. Default value is ``'__all__'``.
it: Un lista di tuple di tag, per esempio ``[Tags.staticfiles, Tags.models]``. Il sistema controlla che :ref:`la registrazione nei tag scelti` sia sottoposta a controllo di errori prima di eseguire il comando. Il valore ``'__all__'`` può essere usato per specificare che tutti i controlli siano eseguiti. Il valore predefinito è ``'__all__'``.
ja: 例えば ``[Tags.staticfiles, Tags.models]`` のようなタグのリストやタプル。 :ref:`指定したタグに登録された <registering-labeling-checks>` システムチェックは、コマンドを実行する前にエラーがないかチェックされます。 ``'__all__'`` を使用することで、すべてのシステムチェックを実行するように指定することができます。デフォルトでは ``'__all__'`` に設定されています。

source: An instance attribute that helps create colored output when writing to ``stdout`` or ``stderr``. For example::
it: Un attributo di istanza che aiuta a creare output colorato quando si scrive su ``stdout`` o ``stderr``. Per esempio::
ja: ``stdout`` や ``stderr`` を記述した際にカラー出力を補助するインスタンス変数です。以下の利用例を参照ください::
ko: "stdout" 또는 "stderr"에 쓸 때 컬러 출력을 생성하는 데 도움이 되는 인스턴스 속성이다. 예를 들어:
pt_br: Um atributo de instância que ajuda a criar uma saída colorida quando se escreve no ``stdout`` ou ``stderr``. Por exemplo::
zh_hans: 一个实例属性，用于向 ``stdout`` 或 ``stderr`` 输出彩色内容。例如::

source: See :ref:`syntax-coloring` to learn how to modify the color palette and to see the available styles (use uppercased versions of the "roles" described in that section).
it: Vedi :ref:`syntax-coloring` per imparare come modificare la palette di colori e visualizzare gli stili disponibili (usa le versioni maiuscole dei "ruoli" descritti in quella sezione).
ja: カラーパレットの調整と利用可能なスタイルについては :ref:`syntax-coloring` を参照してください (このセクションに記述されている "roles" のアルファベットを大文字にすると利用できます)。
ko: 색상표를 수정하는 방법과 사용 가능한 스타일을 보려면 :ref:`syntax-coloring` 을 참조하십시오(이 절에서 설명하는 "roles"의 대문자 버전 사용).
pt_br: Veja :ref:`sintaxe-coloring` para aprender como modificar a paleta de cores e ver os estilos disponíveis (use caixa-alta das versões das opções descritas nessa seção).
zh_hans: 参考 :ref:`syntax-coloring` 了解如何修改调色板与现成的样式（使用本节介绍的大写字母版本的 "roles"）。

source: If you pass the :option:`--no-color` option when running your command, all ``self.style()`` calls will return the original string uncolored.
it: Se passi l'opzione :option:`--no-color` quando lanci il comando, tutte le chiamate ``self.style()`` restituiranno la stringa originale senza colori.
ja: :option:`--no-color` オプションを渡してコマンドを実行した場合、全ての ``self.style()`` 呼び出しはオリジナルのカラー分けされていない出力を行います。
ko: 명령을 실행할 때 "-no-color" 옵션을 통과하면 모든 ``self.style()" 호출이 원래 문자열을 무색하게 반환됩니다.
pt_br: Se você passar a opção :option:`--no-color` ao executar o seu comando, todas as chamadas ``self.style()`` retornarão a string original sem colorir.
zh_hans: 如果运行命令时传递了 :option:`--no-color` 选项，所有的 ``self.style()`` 调用会返回未染色的原始字符串。

source: The default command options to suppress in the help output. This should be a set of option names (e.g. ``'--verbosity'``). The default values for the suppressed options are still passed.
it: Le opzioni dei comandi di default da sopprimere nell'output dell'help. Dovrebbe essere un set di nomi di opzione (per es. ``'--verbosity'``). I valori di default per tutte le opzioni soppresse vengono comunque passati.
ja: ヘルプ出力で抑制するデフォルトのコマンドオプション。これは、オプション名のセットでなければなりません（例：'--verbosity'）。抑制されたオプションのデフォルト値はそのまま渡されます。

source: Methods
it: Metodi
ja: メソッド
ko: 메소드
pt_br: Métodos
zh_hans: 方法

source: :class:`BaseCommand` has a few methods that can be overridden but only the :meth:`~BaseCommand.handle` method must be implemented.
it: La classe :class:`BaseCommand` ha pochi metodi che possono essere sovrascritti ma solo il metodo :meth:`~BaseCommand.handle` deve essere implementato.
ja: :class:`BaseCommand` には、いくつかのオーバーライド可能なメソッドが含まれています。しかし、:meth:`~BaseCommand.handle` メソッドだけは、実装する必要があります。
ko: :class:'BaseCommand'에는 무시할 수 있는 몇 가지 방법이 있지만 :meth:'~BaseCommand.handle' 방법만 구현하면 됩니다.
pt_br: :Class:`BaseCommand` tem alguns métodos que podem ser sobrescritos mas apenas o método :meth:`~BaseCommand.handle` deve ser implementado.
zh_hans: :class:`BaseCommand` 有很多方法可供重写，不过仅有 :meth:`~BaseCommand.handle` 是必须实现的。

source: Implementing a constructor in a subclass
it: Implementazione di un constructor in una subclasse
ja: サブクラス内でのコンストラクタの実装
ko: 하위 클래스에 생성자 구현
pt_br: Implementando um construtor em uma subclasse
zh_hans: 子类中实现构造器

source: If you implement ``__init__`` in your subclass of :class:`BaseCommand`, you must call :class:`BaseCommand`’s ``__init__``::
it: Se implementi ``__init__`` nella tua sottoclasse di :class:`BaseCommand`, devi chiamare ``__init__`` di :class:`BaseCommand`::
ja: :class:`BaseCommand` を継承したサブクラス内で ``__init__`` を実装する場合、:class:`BaseCommand` の ``__init__`` を呼び出す必要があります:
ko: __init__"을(를) :class:'BaseCommand'의 하위 클래스에서 구현할 경우 :classBaseCommand의 ``__init__":를 호출해야 합니다.
pt_br: Se você implementar ``__init__`` em sua subclasse de :class:`BaseCommand`, você deve chamar: o ``__init__`` do class:` BaseCommand`::
zh_hans: 若 :class:`BaseCommand` 的子类实现了 ``__init__`` 方法，那么就必须调用 :class:`BaseCommand` 的 ``__init__``::

source: Returns a ``CommandParser`` instance, which is an :class:`~argparse.ArgumentParser` subclass with a few customizations for Django.
it: Restituisce una istanza di ``CommandParser``, che è una sottoclasse di :class:`~argparse.ArgumentParser` con qualche personalizzazione per Django.
ja: ``CommandParser`` インスタンスを返します。これは :class:`~argparse.ArgumentParser` サブクラスで、Django用にいくつかカスタマイズされています。
ko: "CommandParser" 인스턴스를 반환하는데, 이 인스턴스는 Django에 대한 사용자 지정이 몇 가지 있는:class::class:`~argparse.ArgumentParser` 서브클래스이다
zh_hans: 返回一个 ``CommandParser`` 实例，它是 :class:`~argparse.ArgumentParser` 的子类，包含一些针对 Django 的个性化设计。

source: You can customize the instance by overriding this method and calling ``super()`` with ``kwargs`` of :class:`~argparse.ArgumentParser` parameters.
it: Puoi personalizzare l'istanza sovrascrivendo questo metodo e chiamando ``super()`` con parametri ``kwargs`` :class:`~argparse.ArgumentParser`.
ja: このメソッドをオーバーライドし、 :class:`~argparse.ArgumentParser` パラメータの ``kwargs`` を使って ``super()`` を呼び出すことでインスタンスをカスタマイズできます。
ko: "kwargs" 의 :class:`~argparse.ArgumentParser` 매개변수는 "super()" 를 호출하고 매소드를 오버라이드하면서 인스턴스를 커스터마이즈할 수 있다.
zh_hans: 你可以自定义这个实例，通过重写此方法，并为 ``super()`` 方法传入值为 :class:`~argparse.ArgumentParser` 的 ``kwargs`` 参数。

source: Entry point to add parser arguments to handle command line arguments passed to the command. Custom commands should override this method to add both positional and optional arguments accepted by the command. Calling ``super()`` is not needed when directly subclassing ``BaseCommand``.
it: L'entry point per aggiungere argomenti del parser per gestire gli argomenti della command line passati al comando. I comandi personalizzati dovrebbero sovrascrivere questo metodo per aggiungere sia argomenti facoltativi che posizionali che siano accettati dal comando. Non è necessario chiamare ``super()`` quando si utilizza una sottoclasse di ``BaseCommand``.
ja: コマンドに渡されたコマンドライン引数を操作するパーサーを追加するためのエントリポイントです。カスタム管理コマンドが受け取る位置引数およびオプション引数を追加するためにはこのメソッドをオーバーライドする必要があります。直接 ``BaseCommand`` を継承している場合は ``super()`` の呼び出しは必要ありません。
ko: 명령에 전달된 명령줄 인수를 처리할 구문 분석기 인수를 추가하는 진입점입니다. 사용자 지정 명령은 이 메서드를 재정의하여 명령에서 수락한 위치 및 선택적 인수를 모두 추가해야 합니다. "BaseCommand"를 직접 하위 분류할 때는 "super()"라고 부를 필요가 없다.
pt_br: Ponto de entrada que recebe argumentos do "parser" para manipular comandos passados pela linha de comando. Comandos personalizados devem sobrescrever este método para adicionar ambos argumentos posicionais ou opicionais que sejam aceitos pelo comando. Não é necessário chamar o ``super()`` quando for uma subclasse de ``BaseCommand``.
zh_hans: 添加命令行转换参数的入口，用于处理传给命令行的参数。自定义命令需要重写此方法，并同时添加命令接受的位置参数和可选参数。直接使用 ``BaseCommand`` 的子类时无需调用 ``super()``。

source: Returns the Django version, which should be correct for all built-in Django commands. User-supplied commands can override this method to return their own version.
it: Restituisce la versione di Django, che dovrebbe essere corretta per tutti i comandi Django built-in. I comandi forniti dall'utente possono sovrascrivere questo metodo per restituire la propria versione.
ja: Djangoのバージョンを返します。これはすべての組み込みDjangoコマンドに対して正しいはずです。 ユーザー指定のコマンドは、このメソッドをオーバーライドして独自のバージョンを返すことができます。
ko: 내장된 모든 Django 명령에 대해 정확해야 하는 Django 버전을 반환합니다. 사용자 제공 명령은 해당 버전을 반환하기 위해 이 방법을 재정의할 수 있습니다.
pt_br: Retorna a versão do Django, que deve estar correto para todos os comandos internos do Django. É possível sobrescrever este método para que comandos fornecidos pelo usuário possam retornar a sua própria versão.
zh_hans: 返回 Django 版本，内置 Django 命令必须正确返回。用户实现的命令可以重写此方法返回自己的版本。

source: Tries to execute this command, performing system checks if needed (as controlled by the :attr:`requires_system_checks` attribute). If the command raises a :exc:`CommandError`, it's intercepted and printed to ``stderr``.
it: Cerca di eseguire questo comando, facendo i controlli di sistema se necessario (come controllato con l'attributo :attr:`requires_system_checks`). Se il comando solleva :exc:`CommandError`, questo viene intercettato e stampato su ``stderr``.
ja: コマンドを実行し、必要とされた場合(:attr:`requires_system_checks` 属性によって設定可能)システムチェックを行います。コマンドが :exc:`CommandError` 例外を発生させた場合は、実行を中断して ``stderr`` に出力します。

source: Calling a management command in your code
it: Chiamata di un commando di ?gestione? nel tuo codice
ja: コード中での管理コマンドの呼び出し
ko: 코드에서 관리 명령 호출
pt_br: Chamando um comando de gestão dentro do seu código
zh_hans: 在你的代码中调用管理命令

source: ``execute()`` should not be called directly from your code to execute a command. Use :func:`~django.core.management.call_command` instead.
it: `execute()`` non dovrebbe essere chiamato direttamente dal tuo codice per eseguire un comando. Usa invece :func:`~django.core.management.call_command`.
ja: カスタム管理コマンドを実行するためにコード中から ``execute()`` を直接呼び出す事は避けてください。代わりに :func:`~django.core.management.call_command` を利用してください。
ko: 명령을 실행하기 위해 코드에서 직접 "execute"를 불러서는 안 된다. 대신 func:'~django.core.management.call_command'를 사용합니다.
pt_br: ``execute()`` não deve ser chamado diretamente do seu código para executar um comando. Ao invés disso, use :func:`~django.core.management.call_command` .
zh_hans: 执行命令时，不要从代码直接调用 ``execute()`` 方法。而是使用 :func:`~django.core.management.call_command`。

source: The actual logic of the command. Subclasses must implement this method.
it: La logica attuale del comando. Le sottoclassi devono implementare questo metodo
ja: コマンドにおける実際の処理内容。サブクラスはこのメソッドを実装しなければなりません。
ko: 명령의 실제 논리입니다. 하위 클래스는 이 방법을 구현해야 합니다.
pt_br: A lógica real do comando. Subclasses devem implementar este método.
zh_hans: 命令的实际逻辑处理。子类必须实现此方法。

source: It may return a string which will be printed to ``stdout`` (wrapped by ``BEGIN;`` and ``COMMIT;`` if :attr:`output_transaction` is ``True``).
it: Può restituire una stringa che sarà stampata su ``stdout`` (tra ``BEGIN;`` e ``COMMIT;`` se :attr:`output_transaction` è ``True``).
ja: ``stdout`` に出力される文字列を返すことができます (:attr:`output_transaction` が ``True`` の場合、文字列は ``BEGIN;`` と ``COMMIT;`` で挟まれて出力されます)。
ko: 그것은 "stdout"으로 인쇄될 문자열을 반환할 수도 있다. ('BEGIN'과 ''COMIT''로 포장된 문자열:attr:'output_transaction'이 "true"일 경우)
zh_hans: 此方法可能会返回一个字符串，输出至 ``stdout`` （若 :attr:`output_transaction` 为 ``True``，则由 ``BEGIN;`` 和 ``COMMIT`` 包裹）。

source: Uses the system check framework to inspect the entire Django project for potential problems. Serious problems are raised as a :exc:`CommandError`; warnings are output to ``stderr``; minor notifications are output to ``stdout``.
it: Usa il framework di controlli di sistema per ispezionare l'intero progetto Django in cerca di potenziali problemi. I problemi gravi sono segnalati cpme :exc:`CommandError`; i warning sono stampati su ``stderr``; le notifiche minori sono stampate su ``stdout``.
ja: 潜在的な問題のために Django プロジェクト全体を検証するシステムチェックフレームワークを利用します。致命的な問題は :exc:`CommandError` 例外を発生し、警告は ``stderr`` への出力、重要でない通知は ``stdout`` への出力となります。

source: If ``app_configs`` and ``tags`` are both ``None``, all system checks are performed except deployment and database related checks. ``tags`` can be a list of check tags, like ``compatibility`` or ``models``.
ja: ``app_configs`` および ``tags`` が共に ``None`` であった場合、デプロイメントとデータベース関連のチェック以外の全てのシステムチェックが実行されます。``tags`` はチェックタグ、例えば ``compatibility`` あるいは ``models`` 等、のリストとなります。

source: You can pass ``include_deployment_checks=True`` to also perform deployment checks, and list of database aliases in the ``databases`` to run database related checks against them.
ja: また、``include_deployment_checks=True`` を渡すとデプロイメントのチェックを行い、``databases`` にデータベースエイリアスのリストを渡すとデータベース関連のチェックを行います。

source: ``BaseCommand`` subclasses
it: sottoclassi ``BaseCommand``
ja: ``BaseCommand`` のサブクラス
ko: ``BaseCommand`` 하위 클래스
pt_br: Subclasses de ``BaseCommand``
zh_hans: ``BaseCommand`` 的子类

source: A management command which takes one or more installed application labels as arguments, and does something with each of them.
it: Un comando di gestione che accetta una o più etichette di applicazioni installate come argomenti e fa qualcosa con ciascuna di esse.
ja: 一つ以上のインストールされたアプリケーションラベルを引数として受け取り、それぞれに対して何らかの処理を行う管理コマンド。
ko: 하나 이상의 설치된 응용 프로그램 레이블을 인수로 사용하고 각 레이블로 작업을 수행하는 관리 명령입니다.
pt_br: Um comando de gestão que recebe como argumento um ou mais "labels" de aplicações instaladas, e faz alguma coisa com cada um deles.
zh_hans: 管理命令接受一个或多个应用标签参数，并对每项应用做某些事。

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~AppCommand.handle_app_config`, which will be called once for each application.
it: Piuttosto che implementare :meth:`~BaseCommand.handle`, le sottoclassi devono implementare :meth:`~AppCommand.handle_app_config`, che sarà chiamata una volta per ogni applicazione.
ja: :meth:`~BaseCommand.handle` を実装する代わりに、サブクラスでは、アプリケーション毎に一度ずつだけ呼び出される :meth:`~AppCommand.handle_app_config` を実装する必要があります。
ko: 서브클래스는 :meth:'~BaseCommand.handle'을 구현하기 보다는 :meth:'~AppCommand.handle_app_config'를 구현해야 하며, 각 애플리케이션마다 한 번씩 호출된다.
pt_br: Melhor que implementar :meth:`~ BaseCommand.handle`, as subclasses devem implementar :meth:` ~AppCommand.handle_app_config`, que será chamado uma vez para cada aplicação.
zh_hans: 子类必须实现 :meth:`~AppCommand.handle_app_config`，而不是 :meth:`~BaseCommand.handle`。此方法会为每个应用调用一次。

source: Perform the command's actions for ``app_config``, which will be an :class:`~django.apps.AppConfig` instance corresponding to an application label given on the command line.
it: Effettua le azioni del comando per ``app_config``, che sarà una istanza di :class:`~django.apps.AppConfig` corrispondente ad una etichetta di applicazione fornita sulla linea di comando.
ja: コマンドラインで渡されたアプリケーションラベル個々に対応している :class:`~django.apps.AppConfig` のインスタンスである ``app_config`` に応じたコマンドの処理を行います。
ko: "app_config"에 대한 명령의 작업을 수행합니다. 이 작업은 :class가 됩니다.'~django.the'AppConfig' 인스턴스는 명령줄에 지정된 애플리케이션 레이블에 해당합니다.
pt_br: Executar ações do comando para ``app_config``, o qual será uma instância de :class:`~django.apps.AppConfig` correspondente a um label do aplicativo informado na linha de comando.
zh_hans: 为 ``app_config`` 运行命令，这会是 :class:`~django.apps.AppConfig` 的实例，并指向命令行给定的应用标签。

source: A management command which takes one or more arbitrary arguments (labels) on the command line, and does something with each of them.
it: Un comando di gestione che accetta uno o più argomenti arbitrari (etichette) dalla linea di comando e fa qualcosa con ciascuno di essi.
ja: コマンドラインで1つ以上の任意の引数（ラベル）を受け取り、それぞれに対して何かを行う管理コマンド。
ko: 명령줄에서 하나 이상의 임의 인수(라벨)를 가져와 각 인수와 작업을 수행하는 관리 명령입니다.
pt_br: Um comando de gestão que recebe um ou mais argumentos arbitrários ("labels") na linha de comando, e faz alguma coisa com cada um deles.
zh_hans: 一个管理命令，从命令行接受一个或任意多个参数(labels)，并针对每项做些事情。

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~LabelCommand.handle_label`, which will be called once for each label.
it: Piuttosto che implementare :meth:`~BaseCommand.handle`, le sottoclassi devono implmentare :meth:`~LabelCommand.handle_label`, che sarà chiamato una volta per ogni etichetta.
ja: サブクラスは、:meth:`~BaseCommand.handle` を実装するのではなく、ラベルごとに1回呼び出される :meth:`~LabelCommand.handle_label` を実装する必要があります。
ko: 서브클래스는 :meth:'~BaseCommand.handle'을 구현하기 보다는 :meth:'~LabelCommand.handle_label'을 구현해야 하며, 각 레이블에 대해 한 번 호출된다.
pt_br: Em vez de implementar :meth:`~BaseCommand.handle`, subclasses devem implementar :meth:`~LabelCommand.handle_label`, que será chamado uma vez para cada etiqueta.
zh_hans: 子类必须实现 :meth:`~LabelCommand.handle_label`，而不是 :meth:`~BaseCommand.handle`。此方法会为每个应用调用一次。

source: A string describing the arbitrary arguments passed to the command. The string is used in the usage text and error messages of the command. Defaults to ``'label'``.
it: Una stringa che descrive gli argomenti arbitrari forniti al comando. La stringa viene usata nel testo di utilizzo e nei messaggi di errore del comando. Di default è pari a ``'label'``.
ja: コマンドに渡される任意引数について記述した文字列。この文字列はコマンドの使用法やエラーメッセージに利用します。デフォルトは ``'label'`` です。
ko: 명령에 전달된 임의 인수를 설명하는 문자열입니다. 문자열은 명령의 사용 텍스트 및 오류 메시지에 사용됩니다. 기본값은 "'label'"입니다.
zh_hans: 一个字符串，介绍了传递给命令的任意多个参数。此字符串用于命令的用法文本和错误消息。默认为 ``'label'``。

source: Perform the command's actions for ``label``, which will be the string as given on the command line.
it: Effettua le azioni del comando per ``label``, che sarà la stringa come è fornita dalla riga di comando.
ja: コマンドラインに渡された文字列である ``label`` に対応したコマンドの処理を行います。
ko: 명령줄에 지정된 문자열인 "라벨"에 대해 명령의 작업을 수행합니다.
pt_br: Executar ações do comando para ``label``, que será a string como informada na linha de comando.
zh_hans: 运行 ``label`` 指定的命令动作，由命令行传入的字符串指定。

source: Command exceptions
it: Eccezioni di comando
ja: コマンドが発生させる例外
ko: 예외적 명령
pt_br: Exceções de comando
zh_hans: 命令异常

source: Exception class indicating a problem while executing a management command.
it: Una classe di eccezione che indica un problema mentre si esegue un comando di gestione.
ja: 管理コマンド実行中に発生した問題について示した例外クラス。
ko: 관리 명령을 실행하는 동안 문제를 나타내는 예외 클래스입니다.
pt_br: classe de exceção que indica um problema ao executar um comando de gestão.
zh_hans: 异常类说明在运行管理命令时出错了。

source: If this exception is raised during the execution of a management command from a command line console, it will be caught and turned into a nicely-printed error message to the appropriate output stream (i.e., ``stderr``); as a result, raising this exception (with a sensible description of the error) is the preferred way to indicate that something has gone wrong in the execution of a command. It accepts the optional ``returncode`` argument to customize the exit status for the management command to exit with, using :func:`sys.exit`.
it: Se questa eccezione viene sollevata durante l'esecuzione di un comando di management da una console a linea di comando, sarà gestito e trasformato in un messaggio di errore stampato in modo gradevole verso lo stream di output appropriato (per es. ``stderr``); di conseguenza, sollevare questa eccezione (con una descrizione sensibile dell'errore) è la modalità preferita di indicare che qualcosa è andato storto durante l'esecuzione di un comando. Essa accetta l'argomento opzionale ``returncode`` per personalizzare l'exit status del comando di management, usando :func:`sys.exit`.
ja: この例外がコマンドラインコンソールからの管理コマンドの実行中に発生した場合、キャッチされて適切な出力ストリーム（つまり、``stderr``）に対して整形されたエラーメッセージに変換されます。そのため、コマンドの実行中に何かが間違っていることを示す場合は、この例外を（エラーの理にかなった説明とともに）発生させることを推奨します。任意で ``returncode`` 引数を受け入れて、:func:`sys.exit` で管理コマンドが終了する際の終了ステータスをカスタマイズできます。

source: If a management command is called from code through :func:`~django.core.management.call_command`, it's up to you to catch the exception when needed.
it: Se il comando di gestione è chiamato dal codice con :func:`~django.core.management.call_command`, è tuo compito catturare l'eccezione quando è necessario.
ja: :func:`~django.core.management.call_command` を介して管理コマンドが実行された場合は、例外の捕捉をするかどうかは実装に依存します。
ko: 코드에서 :func:'~django.core.management.call_command'까지 관리 명령이 호출되면 필요할 때 예외를 잡는 것은 사용자의 몫입니다.
pt_br: Se um comando de gestão é chamado do código através do :func:`~django.core.management.call_command`, cabe a você capturar a exceção quando necessário.
zh_hans: 如果管理命令是由 :func:`~django.core.management.call_command` 调用的，是否捕获异常取决于你。

source: How to create custom model fields
it: Come creare model field personalizzati
ja: カスタムのモデルフィールドを作成する

source: Introduction
it: Introduzione
ja: はじめに
ko: 도입
pt_br: Introdução
zh_hans: 介绍
