Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: ``.filter(myfield__mytransform)`` will first call ``myfield.get_lookup('mytransform')``, which will fail, so it will fall back to calling ``myfield.get_transform('mytransform')`` and then ``mytransform.get_lookup('exact')``.
it: ``.filter(myfield__mytransform)`` chiamerà prima ``myfield.get_lookup('mytransform')``, che fallirà, così farà fallback su ``myfield.get_transform('mytransform')`` e poi ``mytransform.get_lookup('exact')``.
ja: ``.filter(myfield__mytransform)`` が最初に ``myfield.get_lookup('mytransform')`` を呼び出そうとして失敗し、そのため ``myfield.get_transform('mytransform')`` 、次に ``mytransform.get_lookup('exact')`` をフォールバックとして呼び出すこと。
ko: ``.filter(myfield__mytransform)`` 는 우선 ``myfield.get_lookup('mytransform')``, 을 호출하는데 실패할것이고, 그 후 ``myfield.get_transform('mytransform')`` 을 호출한 다음 ``mytransform.get_lookup('exact')``을 호출할 것이다.
pt_br: ``.filter(myfield__mytransform)`` irá chamar primeiro ``myfield.get_lookup( 'mytransform')``, o qual irá falhar, por isso vai retornar e chamar ``myfield.get_transform('mytransform')`` e em seguida, ``mytransform.get_lookup( "exact")``.
zh_hans: ``.filter(myfield__mytransform)`` 会先调用 ``myfield.get_lookup('mytransform')``，失败，然后回滚调用 ``myfield.get_transform('mytransform')``，随后返回 ``mytransform.get_lookup('exact')``。

source: How to create custom ``django-admin`` commands
it: Come creare comandi ``django-admin`` personalizzati
ja: カスタム ``django-admin`` コマンドの作り方
ko: 커스텀 "django-admin" 명령을 만드는 방법

source: Applications can register their own actions with ``manage.py``. For example, you might want to add a ``manage.py`` action for a Django app that you're distributing. In this document, we will be building a custom ``closepoll`` command for the ``polls`` application from the :doc:`tutorial</intro/tutorial01>`.
it: Le applicazioni possono registrare le proprie azioni con ``manage.py``. Per esempio, potresti voler aggiungere una azione ``manage.py`` per una applicazione Django che stai distribuendo. In questo documento, costruiremo un comando personalizzato ``closepoll`` per l'applicazione ``polls`` dal :doc:`tutorial</intro/tutorial01>`.
ja: ``manage.py`` を用いることで独自のアクションを登録する事ができます。例として、あなたが配布している Django アプリケーションに ``manage.py`` アクションを追加したくなったとします。このドキュメントでは、:doc:`このチュートリアル</intro/tutorial01>` で作成した ``polls`` アプリケーションに独自の ``closepoll`` コマンドを追加します。
ko: 신청서는 자체 조치를 ``manage.py"에 등록할 수 있다. 예를 들어 "manage.py"액션을 Django 앱을 사용하면서 추가하고 싶을수도 있을것이다. "이 문서에서는 "조사" 신청에 대한 사용자 정의 ``closepoll`` 명령어를 :doc:'tutorial1에서 만들 것이다.
pt_br: Os aplicativos podem registrar suas próprias ações com ``manage.py``. Por exemplo, você pode querer adicionar uma ação ``manage.py`` para uma aplicação Django que você está distribuindo. Neste documento, construiremos um comando customizado ``closepoll`` para a aplicação ``polls`` do :doc:`tutorial</intro/tutorial01>`.
zh_hans: 应用能通过 ``manage.py`` 注册自定义活动。例如，你想为你发布的一个 Django 应用添加 ``manage.py`` 行为。我们将为 :doc:`教程 </intro/tutorial01>` 中的 ``polls`` 应用构建自定义 ``closepoll`` 命令。

source: To do this, add a ``management/commands`` directory to the application. Django will register a ``manage.py`` command for each Python module in that directory whose name doesn't begin with an underscore. For example:
ja: 独自のコマンドを追加するためには、 ``management/commands`` ディレクトリをアプリケーションに追加してください。Djangoは、そのディレクトリ内のアンダーバーで始まらないPythonモジュールすべてを ``manage.py`` コマンドに登録します。例えば:

source: In this example, the ``closepoll`` command will be made available to any project that includes the ``polls`` application in :setting:`INSTALLED_APPS`.
it: In questo esempio, il comando ``closepoll`` sarà reso disponibile a qualsiasi progetto che includa l'applicazione ``polls`` in :setting:`INSTALLED_APPS`.
ja: この例では、``closepoll`` コマンドは ``polls`` アプリケーションを :setting:`INSTALLED_APPS` に含むプロジェクト全てで利用できるようになります。
ko: 이 예에서 ``closepoll" 명령어는 "polls" 적용을 포함하는 모든 프로젝트에서 사용할 수 있게 된다 :setting:`INSTALLED_APPS`.
pt_br: Neste exemplo, o comando ``closepoll`` estará disponível a qualquer projeto que inclui a aplicativo ``polls`` em :setting: `INSTALLED_APPS`.
zh_hans: 在本例中，``closepoll`` 命令将对 :setting:`INSTALLED_APPS` 配置的所有包含 ``polls`` 应用的项目可用。

source: The ``_private.py`` module will not be available as a management command.
it: Il modulo ``_private.py`` non sarà disponibile come comando di management.
ja: ``_private.py`` モジュールは管理コマンドとして利用できません。
ko: ``_private.py" 모듈은 관리 명령으로 사용할 수 없습니다.
pt_br: O módulo ``_private.py`` não estará disponível como um "management command"
zh_hans: ``_private.py`` 模型不会以管理命令的形式提供。

source: The ``closepoll.py`` module has only one requirement -- it must define a class ``Command`` that extends :class:`BaseCommand` or one of its :ref:`subclasses<ref-basecommand-subclasses>`.
it: Il modulo ``closepoll.py`` ha un solo requisito -- deve definire una classe ``Command`` che estenda :class:`BaseCommand` o una delle sue :ref:`sottoclassi<ref-basecommand-subclasses>`.
ja: ``closepoll.py`` モジュールには一つだけ満たすべき要件があります。それは、 :class:`BaseCommand` クラスもしくはその :ref:`サブクラス<ref-basecommand-subclasses>` の一つを継承した ``Command`` クラスを定義することです。
ko: ``closepoll.py" 모듈은 다음과 같이 확장되는 "Command" 등급을 정의해야 하는 하나의 요건만 가지고 있다.Base Command 또는 그 중 하나인 ref:'subclasses.
pt_br: O módulo ``closepoll.py`` tem apenas uma exigência -- deve definir uma classe ``Command`` que se extende :class:`BaseCommand` ou um dos seus :ref:`subclasses<refbasecommandsubclasses>`.
zh_hans: ``closepoll.py`` 模块只有一个要求——必须定义 ``Command`` 类，继承自 :class:`BaseCommand` 或其子类。

source: Standalone scripts
it: Script standalone
ja: スタンドアロンのスクリプト
ko: 독립 실행형 스크립트
pt_br: scripts autônomos
zh_hans: 独立的脚本

source: Custom management commands are especially useful for running standalone scripts or for scripts that are periodically executed from the UNIX crontab or from Windows scheduled tasks control panel.
it: Il comandi di management personalizzati sono utili soprattutto per lanciare script standalone o per script che sono eseguiti periodicamente con il crontab di UNIX o dal pannello di controllo per la pianificazione dei task di Windows.
ja: カスタム管理コマンドはスタンドアロンのスクリプト、 UNIX の crontab や Windows のタスクスケジューラ管理パネルから定期的に実行されるスクリプトを処理する場合に特に有用です。
ko: 사용자 지정 관리 명령은 특히 독립 실행형 스크립트를 실행하거나 UNIX crontab 또는 윈도우즈 스케줄링된 태스크 제어판에서 정기적으로 실행되는 스크립트에 유용합니다.
pt_br: "Management-comands" customizados, são especialmente úteis para a execução de scripts independentes ou para scripts que são periodicamente executadas a partir do crontab do UNIX ou do painel de controle de tarefas agendadas do Windows.
zh_hans: 自定义管理命令在运行独立脚本命令方面十分有用，也可用于 UNIX 的周期性 crontab 任务，或是 Windows 的定时任务。

source: To implement the command, edit ``polls/management/commands/closepoll.py`` to look like this::
it: Per implementare il comando, modifica ``polls/management/commands/closepoll.py`` in questo modo :
ja: コマンドを実装するには、``polls/management/commands/closepoll.py`` を以下のように編集してください::
ko: 명령을 구현하려면 ``polls/management/commands/closepoll.py`` 를 편집하십시오
pt_br: Para implementar o comando, edite ``polls/management/command/closepoll.py`` para que fique assim::
zh_hans: 为实现此命令，像这样编辑 ``polls/management/commands/closepoll.py``::

source: When you are using management commands and wish to provide console output, you should write to ``self.stdout`` and ``self.stderr``, instead of printing to ``stdout`` and ``stderr`` directly. By using these proxies, it becomes much easier to test your custom command. Note also that you don't need to end messages with a newline character, it will be added automatically, unless you specify the ``ending`` parameter::
it: Quando utilizzi i comandi di management personalizzati e vuoi ottenere dell'output su console, dovresti scrivere su ``self.stdout`` e ``self.stderr``, invece che direttamente su `stdout`` and ``stderr``. Utilizzando questi proxy, diventa molto più facile testare il tuo comando personalizzato. Nota anache che non hai bisogno di terminare i messaggi con il carattere di newline, sarà aggiunto automaticamente, a meno che tu non specifichi il parametro ``ending``::
ja: 管理コマンドを使用してコンソール出力を提供したい場合は、直接 ``stdout`` と ``stderr`` に出力するのではなく、``self.stdout`` と ``self.stderr`` に書き込むべきです。これらのプロキシを使用することで、カスタムコマンドのテストがはるかに簡単になります。また、メッセージの終わりに改行文字を追加する必要はないことにも注意してください。``ending`` パラメータを指定しない限り、改行文字は自動的に追加されます:
ko: 관리 명령을 사용하고 콘솔 출력을 제공하려면 "stdout"과 "stderr"로 직접 인쇄하지 말고 "self.stdout"과 "self.stderr"로 써야 합니다. 이러한 프록시를 사용하면 사용자 지정 명령을 훨씬 쉽게 테스트할 수 있습니다. 또한 다음과 같은 "ending" 매개 변수를 지정하지 않으면 메시지를 새 줄 문자로 끝낼 필요가 없습니다.
pt_br: Quando estiver usando comandos de gerenciamento e desejar enviar a saída para console, deve se escrever para o `` self.stdout`` e ``self.stderr``, em vez de imprimir para o ``stdout`` e ``stderr`` diretamente. Ao usar esses proxies, torna-se muito mais fácil para testar o seu comando personalizado. Observe também que você não precisa terminar mensagens com um caractere de nova linha, este será adicionado automaticamente, a menos que você especifique o parâmetro ``ending``::
zh_hans: 当你使用管理命令时，期望在终端输出内容，你需要 write 至 ``self.stdout`` 和 ``self.stderr``，而不是直接 print 至 ``stdout`` 和 ``stderr``。利用这些代理，测试定义命令会更方便。也请注意下，你不需要为消息添加一个新行字符，它会自动添加，除非你指定了 ``ending`` 参数::

source: The new custom command can be called using ``python manage.py closepoll <poll_ids>``.
it: Il nuovo comando personalizzato potrà essere chiamato con ``python manage.py closepoll <poll_ids>``.
ja: 新たに作成したカスタムコマンドは ``python manage.py closepoll <poll_ids>`` と実行する事で利用できます。
ko: 새로운 커스텀 커맨드는 ``python manage.py closepoll 1``.를 사용하여 부를 수 있다
zh_hans: 这个新的自定义命令能用 ``python manage.py closepoll <poll_id>`` 调用。

source: The ``handle()`` method takes one or more ``poll_ids`` and sets ``poll.opened`` to ``False`` for each one. If the user referenced any nonexistent polls, a :exc:`CommandError` is raised. The ``poll.opened`` attribute does not exist in the :doc:`tutorial</intro/tutorial02>` and was added to ``polls.models.Question`` for this example.
it: Il metodo ``handle()`` prende uno o più ``poll_ids`` ed imposta ``poll.opened`` a ``False`` per ognuno di essi. Se l'utente fa riferimento ad un poll non esistente, viene sollevato un :exc:`CommandError`. L'attributo ``poll.opened`` non esiste nel :doc:`tutorial</intro/tutorial02>` ed è stato aggiunto a ``polls.models.Question`` per questo esempio.
ja: ``handle()`` メソッドは一つ以上の ``poll_ids`` を受け取り、それぞれに対応した ``poll.opened`` を ``False`` にセットします。もしコマンドの利用者が存在しない poll を指定した場合、:exc:`CommandError` 例外が発生します。``poll.opened`` 属性は元の :doc:`チュートリアル</intro/tutorial02>` には存在しないので、この例では ``polls.models.Question`` モデルに追加しました。
ko: ``handle()" 방식은 하나 이상의 ``poll_ids"를 가져다가 ``poll. opened"를 각각 "False"로 설정한다. 사용자가 존재하지 않는 폴링을 참조한 경우:exc:Command Error가 발생합니다. "poll.opened" 속성은 :doc:"tutorial"에 존재하지 않으며 이 예시에서는 "polls.models.example'에 추가되었다

source: Accepting optional arguments
it: Accetta argomenti opzionali
ja: 省略可能な引数を受け入れる
ko: 선택적 인수 수락
pt_br: Aceitando argumentos opcionais
zh_hans: 接受可选参数

source: The same ``closepoll`` could be easily modified to delete a given poll instead of closing it by accepting additional command line options. These custom options can be added in the :meth:`~BaseCommand.add_arguments` method like this::
it: Lo stesso ``closepoll`` può essere modificato facilmente per cancellare un dato poll invece che chiuderlo accettando opzioni sulla command line. Queste opzioni personalizzate possono essere aggiunte nel metodo :meth:`~BaseCommand.add_arguments` così::
ja: 上記の ``closepoll`` は、追加のコマンドラインオプションを受け入れることで、投票を閉じる代わりに削除するように簡単に変更できます。これらのカスタムオプションは、次のように :meth:`~BaseCommand.add_arguments` メソッドで追加できます:
ko: 동일한 ``closepoll"를 쉽게 수정해 추가 명령줄 옵션을 수용함으로써 해당 여론조사를 마감하는 대신 삭제할 수 있다. 이러한 사용자 지정 옵션은 다음과 같은 :meth:'~BaseCommand.add_arguments 메서드에 추가할 수 있습니다.
pt_br: O mesmo ``closepoll`` poderia ser facilmente modificado para excluir uma determinada "poll", ao invés de fechá-lo, aceitando as opções de linha de comando adicionais. Estas opções personalizadas podem ser adicionadas no método :meth:`~BaseCommand.add_arguments` como este::
zh_hans: ``closepoll`` 通过简单地添加几个命令选项，就能删除指定 poll，替代之前的关闭行为。这些自定义选项能被加入至 :meth:`~BaseCommand.add_arguments` 方法，就像这样::

source: The option (``delete`` in our example) is available in the options dict parameter of the handle method. See the :py:mod:`argparse` Python documentation for more about ``add_argument`` usage.
it: L'opzione (``delete`` nel nostro esempio) è disponibile nel dizionario di parametri delle opzioni del metodo handle. Vedi la documentazione di Python di :py:mod:`argparse` per saperne di più sull'utilizzo di ``add_argument``.
ja: オプション(例では ``delete``)は handle メソッドで辞書型変数の引数として利用可能です。``add_argument`` の利用についてより詳細な情報を得るには Python 公式ドキュメントの :py:mod:`argparse` を参照してください。
ko: 핸들 방법의 dict 매개변수의 옵션('delete')을 사용할 수 있습니다. "add_argument" 사용에 대한 자세한 내용은 :py:mod:'argparse' Python 문서를 참조하십시오.
pt_br: A opção ( ``delete`` no nosso exemplo) está disponível no parâmetro dict das opções do método "hanfle()". Veja :py:mod:`argparse` na documentaçao do Python para saber mais sobre o uso do ``add_argument``.
zh_hans: 选项（本例中 ``delete``）是由 handle 方法的 options 字典参数传入的。参见 Python 文档查询 :py:mod:`argparse`，获取更多 ``add_argument`` 的用法。

source: In addition to being able to add custom command line options, all :doc:`management commands</ref/django-admin>` can accept some default options such as :option:`--verbosity` and :option:`--traceback`.
it: Oltre ad essere in grado di aggiungere opzioni personalizzate per la command line, tutti i :doc:`comandi di management</ref/django-admin>` possono accettare alcune opzioni di default come :option:`--verbosity` e :option:`--traceback`.
ja: 独自のコマンドラインオプションを追加できるのに加え、:doc:`管理コマンド </ref/django-admin>` に定義された :option:`--verbosity` や :option:`--traceback` といったオプションも標準で利用できます。
ko: 사용자 지정 명령줄 옵션을 추가할 수 있을 뿐만 아니라 모든 :doc:'관리 명령'은 :option:'--verbity' 및 :option:'--traceback'과 같은 기본 옵션을 사용할 수 있습니다.
pt_br: Além de ser capaz de adicionar opções de linha de comando personalizada, todos :doc:`comandos de gereciamento</ref/django-admin>` aceitam algumas opções padrão, tais como :opção:`--verbosity` e :opção:`--traceback`.
zh_hans: 为了能添加自定义命令选项，所以的 :doc:`管理命令 </ref/django-admin>` 都能接受一些默认选项，例如 :option:`--verbosity` 和 :option:`--traceback`。

source: Management commands and locales
it: Commandi di gestione e traduzioni/locale
ja: 管理コマンドとロケール
ko: 관리 명령 및 로케일
pt_br: Comandos de Gerenciamento e localidades
zh_hans: 管理命令和地点(locales)

source: By default, management commands are executed with the current active locale.
it: Di default, i comandi di management sono eseguiti con il locale che è correntemente attivo.
ja: デフォルトでは、管理コマンドは現在アクティブなロケールで実行されます。
ko: 기본적으로 관리 명령은 현재 활성 로케일로 실행됩니다.
zh_hans: 默认情况下，管理命令以当前激活地点执行。

source: If, for some reason, your custom management command must run without an active locale (for example, to prevent translated content from being inserted into the database), deactivate translations using the ``@no_translations`` decorator on your :meth:`~BaseCommand.handle` method::
it: Se, per qualche ragione, il tuo comando di management personalizzato deve girare senza un locale attivo (per esempio, per evitare che il contenuto tradotto venga inserito nel database), disattiva le traduzioni usando il decoratore ``@no_translations`` sul tuo metodo :meth:`~BaseCommand.handle` ::
ja: 何らかの理由でカスタム管理コマンドをアクティブなロケールなしで実行する必要がある (たとえば、翻訳されたコンテンツがデータベースに挿入されないようにしたい) 場合は、 :meth:`~BaseCommand.handle` メソッドで ``@no_translations`` デコレータを使用して翻訳を無効にします。
ko: 어떤 이유로 사용자 지정 관리 명령이 활성 로케일 없이 실행되어야 하는 경우(예: 변환된 콘텐츠가 데이터베이스에 삽입되지 않도록 하려면, 다음 방법:meth:'~BaseCommand.handle'에서 "@no_translations' decorator"를 사용하여 변환을 비활성화하십시오.
zh_hans: 如果出于某些原因，自定义管理命令必须不以某个地点执行（比如，为了避免将已翻译的内容存入数据库），可在 :meth:`~BaseCommand.handle` 方法中利用 ``@no_translations`` 装饰器禁用翻译行为::

source: Since translation deactivation requires access to configured settings, the decorator can't be used for commands that work without configured settings.
it: Dal momento che la disattivazione della traduzione richiede l'accesso alle impostazioni di configurazione, il decoratore non può essere usato per comandi che funzionino senza impostazioni di configurazione.
ja: 翻訳の非アクティブ化には構成設定へのアクセスが必要なので、構成設定なしで機能するコマンドにデコレータを使用することはできません。
ko: 변환 비활성화에는 구성된 설정에 대한 액세스 권한이 필요하므로 구성된 설정 없이 작동하는 명령에는 장식자를 사용할 수 없습니다.
zh_hans: 由于禁用翻译需要使用配置文件，故装饰器不能用于那些不加载配置文件的命令。

source: Testing
ja: テスト
ko: 테스트중
pt_br: ensaio
zh_hans: 测试

source: Information on how to test custom management commands can be found in the :ref:`testing docs <topics-testing-management-commands>`.
it: Informazioni su come testare i comandi di management personalizzati possono essere trovate nei :ref:`documenti di testing <topics-testing-management-commands>`.
ja: カスタム管理コマンドのテストに関する情報は :ref:`テストに関するページ <topics-testing-management-commands>` で得ることができます。
ko: 사용자 지정 관리 명령의 테스트 방법에 대한 정보는 :ref:'testing documents'에서 확인할 수 있습니다.
pt_br: Informações sobre como testar comandos de gerenciamento personalizado pode ser encontrada no :ref:`documentação de teste <topics-testing-management-commands>`.
zh_hans: 关于如何测试自定义管理命令的内容可在 :ref:`测试文档 <topics-testing-management-commands>` 中找到。

source: Overriding commands
it: Override dei comandi
ja: コマンドのオーバーライド
ko: 명령 재정의
zh_hans: 覆盖命令

source: Django registers the built-in commands and then searches for commands in :setting:`INSTALLED_APPS` in reverse. During the search, if a command name duplicates an already registered command, the newly discovered command overrides the first.
it: Django registra i comandi built-in e poi cerca comandi in :setting:`INSTALLED_APPS` in senso inverso. Durante la ricerca, se un nome di comando duplica un comando già registrato, fa override su quello precedente.
ja: Djangoは、ビルトインコマンドを読み込んだ後に :setting:`INSTALLED_APPS` を逆順に検索してコマンドを登録します。この検索の際に、すでに登録済みのコマンド名と重複したコマンド名が見つかった場合、新しく見つかったコマンドで最初に見つけたコマンドをオーバーライドします。
ko: Django는 내장 명령을 등록한 다음 :seting:'에서 명령어를 검색한다.`INSTALLED_APPs는 역방향입니다. 검색 중에 명령 이름이 이미 등록된 명령을 중복하면 새로 검색된 명령이 첫 번째 명령을 재정의합니다.
zh_hans: Django 先注册内置命令，然后按相反的顺序在 :setting:`INSTALLED_APPS` 查找命令。在查找时，如果一个命令和已注册的命令重名，这个新发现的命令会覆盖第一个命令。

source: In other words, to override a command, the new command must have the same name and its app must be before the overridden command's app in :setting:`INSTALLED_APPS`.
it: In altre parole, per fare override di un comando, il nuovo comando deve avere lo stesso nome e la sua app deve trovarsi prima di quella del comando su cui fare override in :setting:`INSTALLED_APPS`.
ja: 別の言い方をすると、コマンドをオーバーライドするためには、新しいコマンドは、オーバーライドするコマンドと同じ名前でなければなりません。そして、そのアプリは、:setting:`INSTALLED_APPS` で、オーバーライドするコマンドのアプリよりも前にある必要があります。
ko: 즉, 명령을 재정의하려면 새 명령의 이름이 동일해야 하며 해당 앱은 재정의된 명령의 앱 앞에 있어야 합니다. setting:'`INSTALLED_APPS`.
zh_hans: 换句话说，为了覆盖一个命令，新命令必须有同样的名字并且它的 app 在 :setting:`INSTALLED_APPS` 中必须排在被覆盖命令 app 的前面。

source: Management commands from third-party apps that have been unintentionally overridden can be made available under a new name by creating a new command in one of your project's apps (ordered before the third-party app in :setting:`INSTALLED_APPS`) which imports the ``Command`` of the overridden command.
it: I comandi di management di app di terze parti che sono stati sovrascritti in modo non intenzionale posso essere resi disponibili con un nuovo nome creando un nuovo comando in una delle app del tuo progetto (che si trovi in ordine prima dell'app di terze parti in :setting:`INSTALLED_APPS`) che importi il ``Command`` del comando sovrascritto.
ja: 意図せずオーバーライドされたサードパーティアプリからの管理コマンドは、オーバーライドされたコマンドの ``Command`` をインポートするプロジェクトのアプリ（:setting:`INSTALLED_APPS` でサードパーティアプリの前に注文） の1つで新しいコマンドを作成することにより、新しい名前で使用可能にできます。
ko: 의도하지 않게 재정의된 타사 앱의 관리 명령은 오버라이드 커맨드의 "Command" 를 들여오는 프로젝트의 앱(:setting:`INSTALLED_APPS`으로 서드파티 앱 앞에 주문된 ) 중 하나에 새 명령을 만들어 새 이름으로 사용할 수 있습니다
zh_hans: 第三方应用提供的管理命令若被不小心重写，能通过在你项目中的某个应用（在 :setting:`INSTALLED_APPS` 配置在第三方应用之前）创建新命令的方式为其取个别名，另其能被调用。这个应用需要导入被重写的 ``Command``。

source: Command objects
it: Oggetti Command
ja: Command オブジェクト
ko: 커맨드 개체
pt_br: Objetos Command
zh_hans: 命令对象

source: The base class from which all management commands ultimately derive.
it: La classe di base da cui, in ultima analisi, tutti i comandi di management derivano.
ja: 全ての管理コマンドの派生元となる基底クラス。
ko: 모든 관리 명령이 궁극적으로 파생되는 기본 클래스입니다.
pt_br: A classe base a partir da qual todos os comandos de gestão, em última análise derivam.
zh_hans: 所有管理命令最终派生的基类。

source: Use this class if you want access to all of the mechanisms which parse the command-line arguments and work out what code to call in response; if you don't need to change any of that behavior, consider using one of its :ref:`subclasses<ref-basecommand-subclasses>`.
it: Usa questa classe se vuoi accedere a tutti i meccanismi che fanno parsing degli argomenti di command-line e cercano di capire quale codice chiamare in risposta; se non hai bisogno di cambiare questo comportamento, considera di usare una delle sue :ref:`sottoclassi<ref-basecommand-subclasses>`.
ja: コマンドライン引数を解析し、それに対してどのコードを呼び出すかを決定するすべてのメカニズムにアクセスしたい場合は、このクラスを使用してください。そのような動作を変更する必要がない場合は、 :ref:`サブクラス <ref-basecommand-subclasses>` のいずれかを使用することを検討してください。
ko: 명령줄 인수를 구문 분석하고 응답으로 호출할 코드를 알아내는 모든 메커니즘에 액세스하려면 이 클래스를 사용합니다. 이러한 동작을 변경할 필요가 없으면 ref:'subclasses' 중 하나를 사용하십시오.
pt_br: Use esta classe se você quer acesso a todos os mecanismos que realizam o parse dos argumentos da linha de comando e verificar que código chamar em resposta; se você não precisa mudar nada deste comportamento, considere usar um desses :ref:`subclasses<refbasecommand-subclasses>`.
zh_hans: 如果你想处理解析命令行参数，决定调用什么代码的过程，使用这个类。如果你不需要改变任何行为，考虑直接使用它的某个 :ref:`子类 <ref-basecommand-subclasses>`。

source: Subclassing the :class:`BaseCommand` class requires that you implement the :meth:`~BaseCommand.handle` method.
it: Fare una sottoclasse della classe :class:`BaseCommand` ti richiede di implementare il metodo :meth:`~BaseCommand.handle`.
ja: :class:`BaseCommand` クラスのサブクラス化には :meth:`~BaseCommand.handle` メソッドの実装が必要です。
ko: :클래스 하위 분류:'BaseCommand' 클래스는 :meth:'~BaseCommand.handle' 메소드를 구현해야 합니다.
pt_br: Subclasssing a classe :class:`BaseCommand` requer que você implemente o método :meth:`~BaseCommand.handle`.
zh_hans: 继承 :class:`BaseCommand` 要求你重写 :meth:`~BaseCommand.handle` 方法。

source: Attributes
it: Attributi
ja: 属性
ko: 속성
pt_br: Atributos
zh_hans: 属性

source: All attributes can be set in your derived class and can be used in :class:`BaseCommand`’s :ref:`subclasses<ref-basecommand-subclasses>`.
it: Tutti gli attributi possono essere impostati nella tua classe derivata e possono essere usati nelle :ref:`sottoclassi<ref-basecommand-subclasses>` di :class:`BaseCommand`.
ja: 全ての属性は派生クラスでセットでき、:class:`BaseCommand` クラスの :ref:`サブクラス<ref-basecommand-subclasses>` で利用可能です。
ko: 모든 속성은 파생 클래스에서 설정할 수 있으며:class:`BaseCommand`’s :ref:`subclasses1에서 사용할 수 있습니다.
pt_br: Todos os atributos podem ser definidos em sua classe derivada e pode ser usado nas :ref:`subclasses<ref-basecommand-subclasses>` de :class:`BaseCommand`
zh_hans: 能被你派生的子类设置的，且能被 :class:`BaseCommand` 的 :ref:`子类 <ref-basecommand-subclasses>` 使用的属性。

source: A short description of the command, which will be printed in the help message when the user runs the command ``python manage.py help <command>``.
it: Una breve descrizione del comando, che sarà stampata nel messaggio di aiuto quando l'utente lancia il comando ``python manage.py help <command>``.
ja: コマンドに関する短い説明。ユーザーが ``python manage.py help <command>`` を実行することでヘルプメッセージとして表示されます。
ko: 사용자가 ``python manage" 명령을 실행할 때 도움말 메시지에 표시되는 명령어에 대한 간단한 설명입니다 ``python manage.py help 1``.
pt_br: Uma breve descrição do comando, que será impresso na mensagem de ajuda quando o usuário executar o comando ``python manage.py help <command>``.
zh_hans: 命令简介，当用户运行命令 ``python manage.py help <command>`` 时包含在打印的帮助信息内。
