Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Since environment variables are process-wide, this doesn't work when you run multiple Django sites in the same process. This happens with mod_wsgi.
it: Dal momento che le variabili d'ambiente sono process-wide, questo non funziona quando fai girare più siti Django nello stesso processo. Questo accade con mod_wsgi.
ja: 環境変数は、同一プロセス内においては同じ値が使われます。このため、単一プロセスで複数の Django サイトを運用する場合は、適切に機能しません。これは mod_wsgi を使用する場合に起こります。
ko: 환경 변수가 공정 범위이기 때문에 동일한 공정에서 여러 D장고 사이트를 실행하는 경우에는 이 작업이 수행되지 않습니다. mod_wsgi에서는 이러한 현상이 발생합니다.
pt_br: Uma vez que as variáveis de ambiente são para todo o processo, isso não funciona quando você executa múltiplos Django sites no mesmo processo. Isso acontece com mod_wsgi.
zh_hans: 由于环境变量是进程级的，所以如果在同一进程运行多个 Django 站点将出错。这在使用 mod_wsgi 时会出现。

source: To avoid this problem, use mod_wsgi's daemon mode with each site in its own daemon process, or override the value from the environment by enforcing ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` in your :file:`wsgi.py`.
it: Per evitare questo problema, usa la modalità demone di mod_wsgi con ogni sito nel proprio processo demone o sovrascrivi il valore dall'ambiente forzando ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` nel tuo :file:`wsgi.py`.
ja: この問題を回避するためには、サイトごとに固有の daemon プロセスを mod_wsgi の daemon モードで運用するか、もしくは :file:`wsgi.py` ファイル内で ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` を実行して環境変数の値を上書きします。
ko: 이 문제를 방지하려면 mod_wsgi의 데몬 모드를 자체 데몬 프로세스에서 사용하거나 ``os.viron["를 적용하여 환경에서 값을 재정의하십시오.DJANGO_SETTINGS_MODULE"] " "my site".설정'은 : 파일에서:'wsgi'입니다.
pt_br: Para evitar este problema, use o daemon do mod_wsgi com cada site em seu próprio processo, ou substitua o valor do ambiente forçando ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` no seu :file:`wsgi.py`.
zh_hans: 要避免此问题，为每个站点在后台进程使用 mod_wsgi 的后台模式，或者在 :file:`wsgi.py` 中通过 ``os.environ["DJANGO_SETTINGS_MODULE"] = "mysite.settings"`` 重写来自环境变量的值。

source: Applying WSGI middleware
it: Applicare il middleware WSGI
ja: WSGIミドルウェアを適用する
ko: WSGI 미들웨어 적용방법
pt_br: Aplicando o middleware WSGI
zh_hans: 应用 WSGI 中间件

source: To apply :pep:`WSGI middleware <3333#middleware-components-that-play-both-sides>` you can wrap the application object. For instance you could add these lines at the bottom of :file:`wsgi.py`::
it: Per applicare :pep:`il middleware WSGI <3333#middleware-components-that-play-both-sides>` puoi includere l'application object. Per esempio, potresti aggiungere queste linee alla fine di :file:`wsgi.py`::
ja: :pep:`WSGI ミドルウェア <3333#middleware-components-that-play-both-sides>` を適用するには、アプリケーションオブジェクトをラップします。例えば、 :file:`wsgi.py` の一番下に以下の行を追加します:
ko: 적용 방법:pep:WSGI 미들웨어 <333# 미들웨어-구성 요소-저 양면 재생>은 애플리케이션 객체를 포장할 수 있습니다. 예를 들어 :file:'wsgi'의 맨 아래에 이러한 줄을 추가할 수 있습니다.

source: You could also replace the Django WSGI application with a custom WSGI application that later delegates to the Django WSGI application, if you want to combine a Django application with a WSGI application of another framework.
it: Puoi anche sostituire l'applicazione Django WSGI con un'applicazione WSGI personalizzata che deleghi successivamente all'applicazione Django WSGI, se desideri combinare un'applicazione Django con un'applicazione WSGI di un altro framework.
ja: DjangoのWSGIアプリケーションをカスタムWSGIアプリケーションに置き換え、その後でDjangoのWSGIアプリケーションに委譲することもできます。これは、Djangoアプリケーションを他のフレームワークのWSGIアプリケーションと組み合わせたい場合に有効です。
ko: 또한 Django WSGI 응용 프로그램을 다른 프레임워크의 WSGI 응용 프로그램과 결합하려면 Django WSGI 응용 프로그램을 나중에 Django WSGI 응용 프로그램으로 위임하는 사용자 지정 WSGI 응용 프로그램으로 대체할 수 있습니다.
pt_br: Poderia também substituir a aplicação WSGI Django por uma aplicação WSGI que mais tarde delega à aplicação WSGI Django, se quiser combinar uma aplicação Django com uma aplicação WSGI de um outro framework.
zh_hans: 如果你想将 Django 应用于一个 WSGI 应用或其它框架联合起来，可以用自定义 WSGI 应用替换 Django 的 WSGI 应用，前者会在稍晚时候将任务委托给 WSGI 应用。

source: How to use Django with Apache and ``mod_wsgi``
it: Come usare Django con Apache e ``mod_wsgi``
ja: Django を Apache と ``mod_wsgi`` とともに使うには？
ko: django와 아파치 사용법, mod_wsgi 사용법
pt_br: Como usar o Django com Apache e ``mod_wsgi``
zh_hans: 如何使用 Apache 和 ``mod_wsgi`` 托管 Django

source: Deploying Django with Apache_ and `mod_wsgi`_ is a tried and tested way to get Django into production.
it: Fare il deploy di Django con Apache_ e `mod_wsgi`_ è un modo provato e testato di portare Django in produzione.
ja: Apache_ と `mod_wsgi`_ と共にDjangoをデプロイすることは、Djangoを製品とする際に試され、テストされた方法です。
ko: django를 Apache_와 'mod_wsgi'와 함께 배치하는 것은 장고를 생산하기 위해 시도되고 시험된 방법이다.
pt_br: Implantar Django com Apache_ e `mod_wsgi`_ é uma forma testada e experimentada de colocar o Django em produção.
zh_hans: 利用 Apache_ 和 `mod_wsgi`_ 在生产环境部署已经过充分测试。

source: mod_wsgi is an Apache module which can host any Python WSGI_ application, including Django. Django will work with any version of Apache which supports mod_wsgi.
it: mod_wsgi è un modulo Apache che può fare hosting di ogni applicazione Python WSGI_, incluso Django. Django funzionerà con ogni versione di Apache che supporta mod_wsgi.
ja: mod_wsgi は、Djangoを含む任意のPythonの WSGI_ アプリケーションをホストできるApacheのモジュールです。 Djangoはmod_wsgiをサポートしているApacheのすべてのバージョンで動作します。
ko: mod_wsgi는 Django를 포함한 모든 Python WSGI_ 애플리케이션을 호스팅할 수 있는 Apache 모듈입니다. Django는 mod_wsgi를 지원하는 Apache의 모든 버전에서 작동합니다.
pt_br: O mod_wsgi é um módulo Apache o quam pode hospedar qualquer aplicação Python WSGI_, incluindo Django. Django irá funcionar com qualquer versão do Apache que suporte mod_wsgi.
zh_hans: mod_wsgi 是一个 Apache 模块，它可以管理任何 Python WSGI_ 应用，包括 Django。Django 支持所有支持 mod_wsgi 的 Apache 版本。

source: The `official mod_wsgi documentation`_ is your source for all the details about how to use mod_wsgi. You'll probably want to start with the `installation and configuration documentation`_.
it: La `documentazione ufficiale di mod_wsgi`_ è la fonte di dettagli su come usare mod_wsgi. Probabilmente vorrai iniziare con la `documentazione di installazione e configurazione`_.
ja: mod_wsgi の使い方の詳細については、`the official mod_wsgi documentation`_ を参照してください。`installation and configuration documentation`_ から始めるとよいでしょう。
ko: '공식 mod_wsgi 설명서'는 mod_wsgi 사용 방법에 대한 모든 세부 정보를 제공하는 자료이다. 설치 및 구성 설명서부터 시작해 보십시오.
zh_hans: `官方 mod_wsgi 文档`_ 介绍了如何使用 mod_wsgi 的全部细节。你可能更喜欢从 `安装和配置文档`_ 开始。

source: Basic configuration
it: Configurazione di base
ja: 基本設定
ko: 기본 구성
pt_br: Configuração Básica
zh_hans: 基础配置

source: Once you've got mod_wsgi installed and activated, edit your Apache server's `httpd.conf`_ file and add the following.
it: Una volta che hai installato ed attivato mod_wsgi, modifica il tuo file `httpd.conf`_ del server Apache ed aggiungi quanto segue.
ja: mod_wsgiをインストールして有効にしたら、Apacheサーバーの `httpd.conf`_ ファイルを編集して、以下を追加します。
ko: mod_wsgi가 설치되어 활성화되면 Apache 서버의 'httpd.conf'_ 파일을 편집하고 다음을 추가합니다.

source: The first bit in the ``WSGIScriptAlias`` line is the base URL path you want to serve your application at (``/`` indicates the root url), and the second is the location of a "WSGI file" -- see below -- on your system, usually inside of your project package (``mysite`` in this example). This tells Apache to serve any request below the given URL using the WSGI application defined in that file.
it: Il primo dato nella riga ``WSGIScriptAlias`` è il percorso dell'URL di base in cui vuoi servire la tua applicazione (``/`` indica l'URL di root) e il secondo è la posizione di un "file WSGI" -- vedi sotto -- sul tuo sistema, di solito all'interno del pacchetto del tuo progetto (``mysite`` in questo esempio). Questo dice ad Apache di servire qualsiasi richiesta sotto la URL specificata utilizzando l'applicazione WSGI definita in quel file.
ja: ``WSGIScriptAlias​​`` の行の最初の部分は、あなたがアプリケーションを提供したいベースとなるURLパスであり( ``/`` ルートURLを示している)、二番目の部分はシステムの ``WSGI file`` の場所 (下記参照) です。大抵はプロジェクトパッケージ (本例では ``mysite`` ) の内部です。これは、そのファイルで定義された WSGI アプリケーションを使用して、指定された URL 以下のすべての要求にサービスを提供するように Apache に指示します。
ko: "WSGIScriptAlias" 라인에 있는 첫 번째 비트는 애플리케이션을 서비스하려는 기본 URL 경로('/'는 루트 URL을 나타냄)이며, 두 번째 비트는 아래에서 참조하는 WSGI 파일의 위치(일반적으로 프로젝트 패키지 내 "my site")입니다. 그러면 Apache가 해당 파일에 정의된 WSGI 응용 프로그램을 사용하여 지정된 URL 아래의 모든 요청을 처리하라는 메시지가 표시됩니다.
pt_br: A primeira parte da linha ``WSGIScriptAlias`` é a URL base que você quer servir sua aplicação (``/`` indica a URL raiz), e a segunda é o local do arquivo "WSGI" -- veja abaixo -- no seu sistema, geralmente dentro do pacote do seu projeto (``mysite`` neste exemplo). Isso diz ao Apache para servir qualquer requisição abaixo da URL informada usando a aplicação WSGI definida naquele arquivo.
zh_hans: ``WSGIScriptAlias`` 行的第一项是你所期望的应用所在的基础 URL 路径（ ``/`` 根 url），第二项是 "WSGI 文件" 的位置——一般位于项目包之内（本例中是 ``mysite``）。这告诉 Apache 用该文件中定义的 WSGI 应用响应指定 URL 下的请求。

source: If you install your project's Python dependencies inside a :mod:`virtual environment <venv>`, add the path using ``WSGIPythonHome``. See the `mod_wsgi virtual environment guide`_ for more details.
it: Se installi le dipendenze Python del tuo progetto in un :mod:`virtual environment <venv>`, aggiungi il percorsi usando ``WSGIPythonHome``. Vedi `mod_wsgi virtual environment guide`_ per avere più dettagli.
ja: プロジェクトの Python 依存ファイルを :mod:`virtual environment <venv>` 内にインストールする場合は、 ``WSGIPythonHome`` を使ってパスを追加します。詳しくは `mod_wsgi virtual environment guide`_ を参照してください。
ko: 프로젝트의 Python 종속성을 :mod:'가상 환경'에 설치할 경우 "WSGiPython Home"을 사용하여 경로를 추가하십시오. 자세한 내용은 'mod_wsgi 가상 환경 가이드'를 참조하십시오.

source: The ``WSGIPythonPath`` line ensures that your project package is available for import on the Python path; in other words, that ``import mysite`` works.
it: La linea ``WSGIPythonPath`` assicura che il tuo package di progetto sia disponibile per l'importazione sul percorso di Python; in altre parole, che ``import mysite`` funzioni.
ja: ``WSGIPythonPath`` の行は、プロジェクトのパッケージは Python のパス上でインポートすることが可能であることを保証します。言い換えると、 ``import mysite`` が動作することを保証します。
ko: "WSG 파이톤 경로" 라인은 당신의 프로젝트 패키지를 파이썬 경로에서 가져올 수 있도록 보장하며, 다시 말해 "내 사이트 가져오기"는 효과가 있다.
pt_br: A linha ``WSGIPythonPath`` assegura que o pacote do seu projeto está disponível no Python path para ser importado; em outras palavras, que ``import mysite`` funcione.
zh_hans: ``WSGIPythonPath`` 行确保你的项目包能从 Python path 导入；换句话说， ``import mysite`` 能正常工作。

source: The ``<Directory>`` piece ensures that Apache can access your :file:`wsgi.py` file.
it: Il pezzo ``<Directory>`` assicura che Apache possa accedere al tuo file :file:`wsgi.py`.
ja: ``<Directory>`` の部分は Apache が :file:`wsgi.py` ファイルにアクセスできることを保証します。
ko: "1'"는 아파치가 당신의 :file:'wsgi에 접근할 수 있도록 보장한다.파이 파일

source: Next we'll need to ensure this :file:`wsgi.py` with a WSGI application object exists. As of Django version 1.4, :djadmin:`startproject` will have created one for you; otherwise, you'll need to create it. See the :doc:`WSGI overview documentation</howto/deployment/wsgi/index>` for the default contents you should put in this file, and what else you can add to it.
it: Successivamente, avremo bisogno di assicurarci che questo :file:`wsgi.py` con un application object esista. Nella versione Django 1.4, :djadmin:`startproject` ne creerà uno per te; altrimenti, ne devi creare uno. Vedi la :doc:`WSGI overview documentation</howto/deployment/wsgi/index>` per conoscere il contenuto standard che dovresti mettere in questo file e che altro potresti aggiungere.
ja: 次に、この :file:`wsgi.py` がWSGIアプリケーションのオブジェクトで存在することを確認する必要があります。 Djangoのバージョン1.4現在、 :djadmin:`startproject` を実行した際に作成されます ; それより前のバージョンでは、あなたはそれを作成する必要があります。 :doc:`WSGI概要ドキュメント</howto/deployment/wsgi/index>` を参照し、デフォルトのコンテンツや、その他の必要な記載をこのファイルに追加してください。
ko: 다음에는 파일:'wsgi'를 확인해야 합니다.WSGI 애플리케이션 객체가 있는 py가 존재합니다. Django 버전 1.4부터는 :djadmin:'start project'가 사용자를 위해 생성되며, 그렇지 않으면 사용자가 생성해야 합니다. :doc 참조:이 파일에 넣어야 할 기본 콘텐츠에 대한 WSGI 개요 문서와 그 밖에 추가할 수 있는 콘텐츠를 보기위해서는 :doc:`WSGI overview documentation 를 참조하세요
pt_br: Agora precisamos assegurar que este arquivo :file:`wsgi.py` com objeto de aplicação WSGI exista. Desde de o Django versão 1.4, :djadmin:`startproject` terá criado um para você; se não, você precisará criá-lo. Veja :doc:`Documentação geral WSGI </howto/deployment/wsgi/index>` para o conteúdo padrão que você deveria colocar neste arquivo, e o que mais você pode adicionar a ele.
zh_hans: 下一步，我们需要确认 :file:`wsgi.py` 文件包含一个 WSGI 应用对象。从 Django 1.4 起， :djadmin:`startproject` 会自动创建；换而言之，你无需手动创建。查阅 :doc:`WSGI 概述文档 </howto/deployment/wsgi/index>` 获取你需要配置的默认内容，以及其它可配置项。

source: If multiple Django sites are run in a single mod_wsgi process, all of them will use the settings of whichever one happens to run first. This can be solved by changing::
it: Se più siti Django girano su un singolo processo mod_wsgi, tutti useranno le impostazioni di quello che parte per primo. Questo può essere risolto cambiando::
ja: 複数の Django のサイトが単一の mod_wsgi プロセスで実行されている場合は、それらのすべては、最初に実行されたものの設定を使用します。これを解消するには、次の
ko: 여러 개의 Django 사이트가 단일 mod_wsgi 프로세스에서 실행되는 경우, 이들 사이트 모두 먼저 실행되는 사이트의 설정을 사용합니다. 이 문제는 다음을 변경하여 해결할 수 있습니다.
pt_br: Se multiplas instâncias de sites Django estão rodando em um único processo WSGI, todos eles irão usar as definições daquele que rodou primeiro. Isso pode ser resolvido mudando::
zh_hans: 如果多个 Django 站点运行在同一 mod_wsgi 进程，它们会共用最先启动的站点配置。能通过以下修改改变行为::

source: in ``wsgi.py``, to::
it: nel ``wsgi.py``, in::
ja: という ``wsgi.py`` 内のコードを、次のように変更します。
ko: ``wsgi.py``,를 어디로
pt_br: em ``wsgi.py``, para::
zh_hans: ``wsgi.py`` 中也这么改::

source: or by :ref:`using mod_wsgi daemon mode<daemon-mode>` and ensuring that each site runs in its own daemon process.
it: o :ref:`usando la modalità demone di mod_wsgi<daemon-mode>` ed assicurandosi che ogni sito giri nel proprio processo demone.
ja: もしくは、 :ref:`mod_wsgi のデーモンモード<daemon-mode>` を使用することで、各サイトをそれぞれ独立したデーモンプロセスで実行できるようにします。
ko: 또는 :ref:'mod_wsgi 데몬 모드 사용'을 통해 각 사이트가 자체 데몬 프로세스로 실행되도록 합니다.
pt_br: ou por :ref:`usando o mode daemon do mod_wsgi<daemon-mode>` e assegurando que cada site está rodando no seu próprio processo deamon.
zh_hans: 或通过 :ref:`使用 mod_wsgi 的后台模式 <daemon-mode>` 确保每个站点都运行于独立的后台进程。

source: Fixing ``UnicodeEncodeError`` for file uploads
it: Correggere ``UnicodeEncodeError`` per il caricamento di file
ja: ファイルアップロード時の ``UnicodeEncodeError`` を修正する
ko: 파일 업로드를 위한 "유니코드 인코딩 오류" 수정
pt_br: Arrumando o ``UnicodeEncodeError`` para uploads de arquivos
zh_hans: 为文件上传修复 ``UnicodeEncodeError``

source: If you get a ``UnicodeEncodeError`` when uploading or writing files with file names or content that contains non-ASCII characters, make sure Apache is configured to support UTF-8 encoding:
ja: 非 ASCII 文字を含むファイル名や内容のファイルをアップロードしたり書き込んだりするときに ``UnicodeEncodeError`` が発生する場合は、Apache が UTF-8 エンコーディングをサポートするように設定されていることを確認してください:

source: A common location to put this configuration is ``/etc/apache2/envvars``.
it: Una locazione comune dove mettere questa configurazione è ``/etc/apache2/envvars``.
ja: この設定はふつう ``/etc/apache2/envvars`` で可能です。
ko: 이 구성을 배치하는 공통 위치는 다음과 같습니다.``/etc/apache2/envvars``.
pt_br: Um lugar comum para colocar essa configuração é em ``/etc/apache2/envvars``.
zh_hans: 常见的配置文件路径是 ``/etc/apache2/envvars``。

source: Alternatively, if you are :ref:`using mod_wsgi daemon mode<daemon-mode>` you can add ``lang`` and ``locale`` options to the ``WSGIDaemonProcess`` directive:
ja: 代わりに、 :ref:`mod_wsgi のデーモンモード<daemon-mode>` を使用している場合は ``WSGIDaemonProcess`` ディレクティブに ``lang`` と ``locale`` オプションを追加できます:

source: See the :ref:`unicode-files` section of the Unicode reference guide for details.
it: Vedi la sezione :ref:`unicode-files` nella guida di riferimento Unicode per dettagli.
ja: 詳細については、Unicode リファレンスガイドの :ref:`unicode-files` セクションを参照してください。
ko: 자세한 내용은 유니코드 참조 안내서 :ref:`unicode-files` 의 섹션을 참조하십시오.
pt_br: Veja a seção :ref:`unicode-files` do guia de referência de unicode para detalhes.
zh_hans: 参考 Unicode 参考指引的 :ref:`unicode-files` 章节获取细节信息。

source: Using ``mod_wsgi`` daemon mode
it: Usare la modalità demone di ``mod_wsgi``
ja: ``mod_wsgi`` をデーモンモードで使用する
ko: ``mod_wsgi`` 데몬모드 사용법
pt_br: Usando ``mod_wsgi`` no modo deamon
zh_hans: 使用 ``mod_wsgi`` 后台模式

source: "Daemon mode" is the recommended mode for running mod_wsgi (on non-Windows platforms). To create the required daemon process group and delegate the Django instance to run in it, you will need to add appropriate ``WSGIDaemonProcess`` and ``WSGIProcessGroup`` directives. A further change required to the above configuration if you use daemon mode is that you can't use ``WSGIPythonPath``; instead you should use the ``python-path`` option to ``WSGIDaemonProcess``, for example:
it: "La modalità demone" è la modalità raccomandata per far girare mod_wsgi (su piattaforme non Windows). Per creare il gruppo del processo demone richiesto e delegare l'istanza di Django per girarvi, dovrai aggiungere le direttive ``WSGIDaemonProcess`` e ``WSGIProcessGroup`` appropriate. Un ulteriore cambiamento alla configurazione qui sopra se usi la modalità demone è che non puoi usare ``WSGIPythonPath``; invece dovresti usare l'opzione ``python-path`` per ``WSGIDaemonProcess``, per esempio::
ja: ``デーモンモード`` はmod_wsgiを (Windows以外のプラットフォーム上で) 実行するための推奨モードです。必要なデーモンプロセスグループを作成し、その中で起動するための Djangoのインスタンスを委任するためには、適切な ``WSGIDaemonProcess`` と ``WSGIProcessGroup`` ディレクティブを追加する必要があります。デーモンモードを使用する場合には ``WSGIPythonPath`` を使用できないため、上記設定にさらなる変更が求められます。代わりに ``WSGIDaemonProcess`` に ``python-path`` オプションを使用する必要があります。例えば、
ko: "데몬 모드"는 Windows가 아닌 다른 플랫폼에서 mod_wsgi를 실행하는 데 권장되는 모드입니다. 필요한 데몬 프로세스 그룹을 만들고 이를 실행할 Django 인스턴스를 위임하려면 적절한 ``WSG DaemonProcess"와 "WSGIP ProcessGroup" 지침을 추가해야 한다. 데몬 모드를 사용할 경우 위의 구성에 추가로 필요한 변경 사항은 ``WSGiPythonPath"를 사용할 수 없고 "WSGidaemonProcess"에 대한 "python-path" 옵션을 사용해야 한다는 것이다.
pt_br: "Modo Deamon" é o modo recomendado para rodar mod_wsgi (em plataforma não Windows). Para criar o grupo de processos deamon requerido e delegar o Django para rodar dentro, precisa adicionar as diretivas ``WSGIDaemonProcess`` e ``WSGIProcessGroup``. Um outra mudança requerida na configuração acima se usar deamon mode é que não se pode usar o ``WSGIPythonPath``; no lugar deve usar a opção ``python-path`` para ``WSGIDaemonProcess``, por exemplo:
zh_hans: "Daemon mode" 是运行 mod_wsgi 的推荐模式（在非 Windows 平台上）。为了创建必要的后台进程组并在其中运行 Django 实例，你需要添加合适的 ``WSGIDaemonProcess`` 和 ``WSGIProcessGroup`` 指令。上述配置在你使用后台模式时需要点小修改，即你不能使用 ``WSGIPythonPath``；作为替换，你要在 ``WSGIDaemonProcess`` 中添加 ``python-path`` 选项，例如：

source: If you want to serve your project in a subdirectory (``https://example.com/mysite`` in this example), you can add ``WSGIScriptAlias`` to the configuration above:
it: Se vuoi servire il tuo progetto in una sottodirectory (``https://example.com/mysite`` in questo esempio), puoi aggiungere ``WSGIScriptAlias`` alla configurazione qui sopra::
ja: サブディレクトリでプロジェクトを提供したい場合は(本例では ``https://example.com/mysite`` となります) 、 ``WSGIScriptAlias`` を設定の上部に追記します。
ko: 만약 당신이 당신의 프로젝트를 서브디렉토리(이 예에서 https://example.com/mysite로 제공하기를 원한다면, 당신은 위의 구성에 "WSGIScriptAlias"를 추가할 수 있다.
pt_br: Se quer servir seu projeto em um subdiretório (``https://example.com/mysite`` neste exemplo), você pode adicionar ``WSGIScriptAlias`` a configuração acima:
zh_hans: 如果你想在子目录中开放你的项目（本例中 ``https://example.com/mysite``），你可在上述配置中添加 ``WSGIScriptAlias``：

source: See the official mod_wsgi documentation for `details on setting up daemon mode`_.
it: Vedi la documentazione ufficiale mod_wsgi per `dettagli su come approntare la modalità demone`_.
ja: 詳細については、公式の mod_wsgi のドキュメント `details on setting up daemon mode`_ を参照してください。
ko: '데몬 모드 설정에 대한 세부 정보'는 공식 mod_wsgi 설명서를 참조하십시오.
pt_br: Veja a documentação oficial do mod_wsgi para `details on setting up daemon mode`_
zh_hans: 参考官方 mod_wsgi 文档获取 `配置后台模式的细节`_。

source: Serving files
it: Distribuire files
ja: ファイルを配信する
ko: 파일 저장법
pt_br: Servindo arquivos
zh_hans: 提供文件服务

source: Django doesn't serve files itself; it leaves that job to whichever web server you choose.
it: Django non distribuisce files direttamente; lascia questo lavoro a qualsiasi web server di tua scelta.
ja: Django 自体はファイルを配信せず、Web サーバにそのジョブを委ねます。

source: We recommend using a separate web server -- i.e., one that's not also running Django -- for serving media. Here are some good choices:
it: Raccomandiamo di usare un web server separato -- per esempio, uno che non sta facendo girare Django -- per servire i contenuti multimediali. Ecco alcune buone scelte::
ja: メディアの配信には、別の Web サーバー、つまり Django を動かしていないサーバを使うことをお勧めします。以下は良い選択です:

source: A stripped-down version of Apache_
it: Una versione ridotta di Apache_
ja: Apache_ の機能縮小版
ko: Apache_의 stripped-down 버전
pt_br: Uma versão mais enxuta do Apache_
zh_hans: 一个 Apache_ 的朴素版本

source: If, however, you have no option but to serve media files on the same Apache ``VirtualHost`` as Django, you can set up Apache to serve some URLs as static media, and others using the mod_wsgi interface to Django.
it: Se, comunque, non hai altra alternativa che servire i file multimediali sullo stesso ``VirtualHost`` di Apache di Django, puoi impostare Apache per servire alcune URL come media statici ed altre usando l'interfaccia mod_wsgi per Django.
ja: しかし、Django と同じ Apache の ``VirtualHost`` からメディアファイルを配信しなければならない場合には、一部の URL を静的メディアを配信するように設定し、その他の URL を Django への mod_wsgi のインターフェイスとして設定することができます。
ko: 그러나 만약 당신이 Django와 같은 Apache "VirtualHost"에서 미디어 파일을 제공하는 것 외에 다른 방법이 없다면, 당신은 Django에 mod_wsgi 인터페이스를 사용하여 일부 URL을 정적 미디어로 서비스하도록 Apache를 설정할 수 있다.
pt_br: Se, porém, você não tem opção de servir arquivos de media na mesmo VirtualHost Apache que está o Django, você pode configurar o Apache para servir algumas URLs como media estática, e outros usando a interface mod_wsgi para Django.
zh_hans: 然而，若你别无选择，只能在与 Django 相同的 Apache ``VirtualHost`` 上提供媒体文件，你可以让 Apache 为一些 URL 提供静态媒体服务，其它的用 mod_wsgi 接口传递给 Django。

source: This example sets up Django at the site root, but serves ``robots.txt``, ``favicon.ico``, and anything in the ``/static/`` and ``/media/`` URL space as a static file. All other URLs will be served using mod_wsgi:
it: Questo esempio appronta Django sulla root del sito ma serve ``robots.txt``, ``favicon.ico``, e tutto ciò che si trova nello spazio delle URL ``/static/`` e ``/media/`` come file statico. Tutte le altre URL saranno servite usando mod_wsgi:
ja: この例では、サイトのルートには Django を設定していますが、 ``robots.txt`` 、 ``favicon.ico`` 、 ``/static/`` 、そして ``/media/`` の URL 空間は静的ファイルとして配信しています。他のすべての URL は mod_wsgi を使用して配信されます。
ko: 이 예는 현지의 뿌리에 장고를 세우지만 ``로봇"을 취급한다.txt, ``favicon.ico" 그리고 ``/staticon/" 그리고 ``/media/" URL 공간에 있는 모든 것을 정적 파일로 저장한다. 다른 모든 URL은 mod_wsgi를 사용하여 제공됩니다.
pt_br: Este exemplo define o DJango como raiz do site, mas serve ``robots.txt``, ``favicon.ico``, e qualquer coisa nas URLs ``/static/`` e ``/media`` como arquivos estáticos. Todas as outra URLs serão servidas usando o mod_wsgi:
zh_hans: 本例在站点根目录配置 Django，但以静态文件的形式提供 ``robots.txt``， ``favicon.ico`` 以及 ``/static/`` 和 ``/media/`` 中的内容。其它所有 URL 以 mod_wsgi 提供服务：

source: Serving the admin files
it: Distribuire i files admin
ja: admin ファイルを配信する
ko: 관리자파일 제공
pt_br: Persistindo arquivos do admin
zh_hans: 服务后台文件

source: When :mod:`django.contrib.staticfiles` is in :setting:`INSTALLED_APPS`, the Django development server automatically serves the static files of the admin app (and any other installed apps). This is however not the case when you use any other server arrangement. You're responsible for setting up Apache, or whichever web server you're using, to serve the admin files.
it: Quando :mod:`django.contrib.staticfiles` viene settata in :setting:`INSTALLED_APPS`, il server di sviluppo di Django servirà automaticamente i file statici dell'app admin ( e di qualsiasi altra app ). Questo comunque non succede quando usi qualsiasi altra configurazione server. Sei responsabile della configurazione di Apache, o di qualsiasi server tu stia usando, per servire i file di admin.
ja: :mod:`django.contrib.staticfiles` が :setting:`INSTALLED_APPS` にある場合、 Django の開発サーバーは自動的に管理アプリ（や他のインストールされたアプリ）の静的ファイルを提供します。しかし、他のサーバを使う場合はそうはいきません。管理アプリの静的ファイルを提供するように、 Apache や、使っているWebサーバーを設定するのはあなたの責任です。
