Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: By default, the final log output contains the message part of each :class:`log record <logging.LogRecord>`. Use a formatter if you want to include additional data. First name and define your formatters - this example defines formatters named ``verbose`` and ``simple``:
it: Di default, l'output finale del log contiene la parte di messaggio di ogni :class:`record di log <logging.LogRecord>`. Usa un formattatore se vuoi includere dati aggiuntivi. Prima di tutto nomina e definisci i tuoi formattatori - questo esempio definisce formattatori di nome ``verbose`` e``simple``:
ja: デフォルトでは、最終的なログ出力には各 :class:`log record <logging.LogRecord>` のメッセージ部分が含まれます。追加データを含めたい場合はフォーマッタを使います。まずフォーマッタに名前を付けて定義します。この例では ``verbose`` と ``simple`` という名前のフォーマッタを定義しています:

source: The ``style`` keyword allows you to specify ``{`` for :meth:`str.format` or ``$`` for :class:`string.Template` formatting; the default is ``$``.
it: La keyword ``style`` ti permette di specificare ``{`` per :meth:`str.format` o ``$`` per la formattazione :class:`string.Template; quello predefinito è ``$``.
ja: ``style`` キーワードを使用すると、 :meth:`str.format` 用の ``{`` または :class:`string.Template` フォーマット用の ``$`` を指定できます。デフォルトは ``$`` です。

source: See :ref:`logrecord-attributes` for the :class:`~logging.LogRecord` attributes you can include.
it: Vedi :ref:`logrecord-attributes` per gli attributi di :class:`~logging.LogRecord` che puoi includere.
ja: 含めることができる :class:`~logging.LogRecord` 属性については :ref:`logrecord-attributes` を参照してください。

source: To apply a formatter to a handler, add a ``formatter`` entry to the handler's dictionary referring to the formatter by name, for example:
it: Per applicare un formattatore ad un gestore, aggiungi una voce ``formatter`` al dizionario del gestore, che faccia riferimento al formattatore per nome, per esempio:
ja: ハンドラにフォーマッタを適用するには、ハンドラの辞書に ``formatter`` エントリを追加します:

source: Use logger namespacing
it: Usa lo spazio dei nomi del logger
ja: ロガーの名前空間を使う

source: The unnamed logging configuration ``''`` captures logs from any Python application. A named logging configuration will capture logs only from loggers with matching names.
it: La configurazione di logging senza nome ``''`` cattura log da ogni applicazione Python. Una configurazione di logging con nome catturerà log solo dai logger con nomi che combaciano.
ja: 無名のロギング設定 ``""`` は任意の Python アプリケーションからログを取り込みます。名前付きロギング設定は、一致する名前のロガーからだけログを取得します。

source: The namespace of a logger instance is defined using :py:func:`~logging.getLogger`. For example in ``views.py`` of ``my_app``::
it: Il namespace di una istanza di un logger è definita usando :py:func:`~logging.getLogger`. Per esempio in ``views.py`` di ``my_app``::
ja: logger インスタンスの名前空間は :py:func:`~logging.getLogger` を使って定義します。例えば、 ``my_app`` の ``views.py`` で次のように定義します:

source: will create a logger in the ``my_app.views`` namespace. ``__name__`` allows you to organize log messages according to their provenance within your project's applications automatically. It also ensures that you will not experience name collisions.
it: creerà un logger nel namespace ``my_app.views`` namespace. ``__name__`` ti permette di organizzare i messaggi di log in accordo con la loro provenienza nelle applicazioni del tuo progetto in modo automatico. Assicura anche che non ci siano collisioni sui nomi.
ja: これは ``my_app.views`` 名前空間にロガーを作成します。 ``__name__`` を使うと、プロジェクト内のアプリケーションにおけるログメッセージの出所に基づいて、自動的にそれらを整理できます。また、それによって名前の衝突が起こらなくなります。

source: A logger mapping named ``my_app.views`` will capture records from this logger:
it: Un mapping di logger chiamato ``my_app.views`` catturerà record da questo logger::
ja: ``my_app.views`` という名前のロガーマッピングは、このロガーからレコードを取得します:

source: A logger mapping named ``my_app`` will be more permissive, capturing records from loggers anywhere within the ``my_app`` namespace (including ``my_app.views``, ``my_app.utils``, and so on):
it: Un mapping di logger chiamato ``my_app`` sarà più permissivo, catturando record dai logger che si trovino ovunque nel namespace ``my_app`` (incluso ``my_app.views``, ``my_app.utils`` e così via):
ja: ``my_app`` という名前のロガーマッピングはより広く、 ``my_app`` 名前空間内のロガー（``my_app.views``、``my_app.utils`` などを含む）からレコードを取得します:

source: You can also define logger namespacing explicitly::
it: Puoi anche definire esplicitamente i namespacing del logger::
ja: ロガーの名前空間を明示的に定義することもできます:

source: and set up logger mappings accordingly.
it: e impostare le mappature del logger di conseguenza.
ja: そして、それに応じてロガーマッピングを設定することもできます。

source: Using logger hierarchies and propagation
it: Utilizzo di gerarchie di logger e propagazione
ja: ロガーの階層と伝搬（propagation）を使う

source: Logger naming is *hierarchical*. ``my_app`` is the parent of ``my_app.views``, which is the parent of ``my_app.views.private``. Unless specified otherwise, logger mappings will propagate the records they process to their parents - a record from a logger in the ``my_app.views.private`` namespace will be handled by a mapping for both ``my_app`` and ``my_app.views``.
it: La nomenclatura dei logger è *gerarchica*. ``my_app`` è genitore di ``my_app.views``, che è genitore di ``my_app.views.private``. Finchè non specificato altrimenti, i mapping dei logger propagheranno i record che elaborano ai loro genitori - un record da un logger nel namespace ``my_app.views.private`` sarà gestito da entrambi i mapping di ``my_app`` e ``my_app.views``.
ja: ロガーの命名は *階層的* です。 ``my_app`` は ``my_app.views`` の親であり、 ``my_app.views`` は ``my_app.views.private`` の親です。特に指定がない限り、ロガーのマッピングは処理したレコードを親に伝播（propagate）します―― ``my_app.views.private`` 名前空間のロガーからのレコードは、 ``my_app`` と ``my_app.views`` の両方のマッピングで処理されます。

source: To manage this behavior, set the propagation key on the mappings you define::
it: Per gestire questo comportamento, imposta la chiave di propagazione sulle mappature che definisci::
ja: この動作を管理するには、定義したマッピングに ``"propagate"`` キーを設定します:

source: ``propagate`` defaults to ``True``. In this example, the logs from ``my_app.views.private`` will not be handled by the parent, but logs from ``my_app.views`` will.
it: ``propagate`` è di dafault a ``True``. In questo esempio, i log da ``my_app.views.private`` non saranno gestiti dal genitore, ma i log da ``my_app.views`` lo saranno.
ja: ``propagate`` のデフォルトは ``True`` です。この例では、``my_app.views.private`` のログは親プロセスでは処理されませんが、 ``my_app.views`` のログは親プロセスで処理されます。

source: Configure responsive logging
it: Configura logging reattivi
ja: レスポンシブなロギングを設定する

source: Logging is most useful when it contains as much information as possible, but not information that you don't need - and how much you need depends upon what you're doing. When you're debugging, you need a level of information that would be excessive and unhelpful if you had to deal with it in production.
it: Il logging è soprattutto utile quando contiene più informazioni possibili ma non le informazioni di cui non hai bisogno - e di quanto hai bisogno dipende da quel che stai facendo. Quando stai facendo debug, hai bisogno di un livello di informazioni che sarebbe eccessivo ed inutile se fossi in produzione.
ja: ロギングは、必要な情報ができるだけ多く含まれているときに最も有用であり、目的のために必要な情報だけが含まれているとなお嬉しいです。そして、必要な情報量は、あなたが何をしているかによって異なります。デバッグ中には、本番環境では過剰で役に立たないようなレベルの情報が必要になります。

source: You can configure logging to provide you with the level of detail you need, when you need it. Rather than manually change configuration to achieve this, a better way is to apply configuration automatically according to the environment.
it: Puoi configurare il loggin per fornirti il livello di dettaglio di cui necessiti, quando ne hai bisogno. Piuttosto che cambiare manualmente la configurazione per fare questo, un modo migliore è applicare la configurazione automaticamente a seconda dell'environment.
ja: 必要な時に必要な詳細レベルを提供するように、ロギングを設定できます。これを実現するために手動で設定を変更するよりも良い方法は、環境に応じて自動的に設定を適用することです。

source: For example, you could set an environment variable ``DJANGO_LOG_LEVEL`` appropriately in your development and staging environments, and make use of it in a logger mapping thus::
it: Per esempio, potresti impostare una variabile d'ambiente appropriata ``DJANGO_LOG_LEVEL`` nei tuoi ambienti di sviluppo e staging ed usarla nel mapping del logger, quindi::
ja: 例えば、開発環境とステージング環境で環境変数 ``DJANGO_LOG_LEVEL`` を適切に設定し、ロガーマッピングで次のように使用できます:

source: \- so that unless the environment specifies a lower log level, this configuration will only forward records of severity ``WARNING`` and above to its handler.
it: \- così che, fintanto che l'ambiente non specifica un livello di log più basso, questa configurazione girerà solo i record di severità ``WARNING`` e superiore al proprio gestore.
ja: \- 環境がより低いログレベルを指定しない限り、このコンフィギュレーションは重大度 ``WARNING`` 以上のレコードだけをハンドラに転送します。

source: Other options in the configuration (such as the ``level`` or ``formatter`` option of handlers) can be similarly managed.
it: Altre opzioni nella configurazione (come le opzioni del gestore ``level`` o ``formatter``) possono essere gestite in modo simile.
ja: 設定の他のオプション（ハンドラの ``level`` や ``formatter`` オプションなど）も同様に管理できます。

source: How to create CSV output
it: Come creare un output su CSV
ja: CSVを出力する

source: This document explains how to output CSV (Comma Separated Values) dynamically using Django views. To do this, you can either use the Python CSV library or the Django template system.
it: Questo documento spiega come fare output di CSV (Comma Separated Values) in modo dinamico usando Django. Per fare ciò, puoi sia usare la libreria CSV di Python che il sistema di template di Django.
ja: このドキュメントでは、Django のビューを使って動的に CSV (Comma Separated Values) を出力する方法を説明しています。そのためには、Python のCSV ライブラリか Django のテンプレートシステムを使います。
ko: 이 문서에서는 Django 보기를 사용하여 CSV(Comma Separated Values)를 동적으로 출력하는 방법에 대해 설명합니다. 이를 위해 Python CSV 라이브러리 또는 Django 템플릿 시스템을 사용할 수 있습니다.
pt_br: Este documento explica como emitir CSV (valores separados por vírgulas) dinamicamente usando "views" do Django. Para fazer isso, você pode usar a biblioteca CSV do Python ou o sistema de templates do Django.
zh_hans: 本文介绍如何用 Django 的视图动态输出 CSV (Comma Separated Values)。要达到目的，你可以使用 Python 的 CSV 库或 Django 的模板系统。

source: Using the Python CSV library
it: Utilizzando la libreria CSV di Python
ja: Python の CSV ライブラリを使う
ko: 파이썬 CSV 라이브러리 사용하기
pt_br: Usando a biblioteca CSV do Python.
zh_hans: 使用 Python 的 CSV 库

source: Python comes with a CSV library, :mod:`csv`. The key to using it with Django is that the :mod:`csv` module's CSV-creation capability acts on file-like objects, and Django's :class:`~django.http.HttpResponse` objects are file-like objects.
it: Python è dotato di una libreria CSV, :mod:`csv`. La chiave dell'usarla con Django è che le capacità di creazione di CSV del modulo :mod:`csv` agiscono su oggetti file-like e gli oggetti di Django :class:`~django.http.HttpResponse` sono oggetti file-like.
ja: Python の標準ライブラリには CSV のライブラリ :mod:`csv` が含まれています。Django でこのライブラリを使うコツは、:mod:`csv` モジュールの CSV 生成機能がファイルライクオブジェクトに対して働くことを利用します。Django の :class:`~django.http.HttpResponse` オブジェクトもまた、ファイルライクオブジェクトなのです。
ko: Python은 CSV 라이브러리인 :mod:'csv'와 함께 제공됩니다. Django와 함께 사용하기 위한 핵심은 :mod:'csv' 모듈의 CSV-생성 기능이 파일 같은 개체에 작용하고 Django의 :class는 다음과 같습니다.'~django.the' 입니다.HttpResponse' 객체는 파일 유사 객체입니다.
pt_br: Python vem com uma biblioteca CSV, :mod:`csv`. A chave para usá-lo com Django é que a capacidade CSV-creation do módulo :mod:`csv` age como um objeto "file-like", e aos objetos da class:`~django.http.HttpResponse` do Django são objetos "file-like".
zh_hans: Python 有用一个 CSV 库 :mod:`csv`。它配合 Django 使用的关键是 :mod:`csv` 模块的 CSV 创建行为作用于类文件对象，而 Django 的 :class:`~django.http.HttpResponse` 对象也是类文件对象。

source: Here's an example::
it: Qui un esempio::
ja: 以下に例を示します:
ko: 여기 예제가 있습니다::
pt_br: Aqui está um exemplo
zh_hans: 这有个例子::

source: The code and comments should be self-explanatory, but a few things deserve a mention:
it: Il codice ed i commenti dovrebbero essere auto esplicativi, ma alcuni dettagli meritano un approfondimento:
ja: コードとコメントが自分自身の意味を説明しているはずですが、いくつかの点には言及しておくべきでしょう。
ko: 코드와 코멘트는 자명해야 하지만 몇 가지 사항은 언급할 가치가 있습니다.
pt_br: O código e comentário devem ser auto-explanaveis, mas algumas coisas merecem uma menção.
zh_hans: 代码和注释应该是不言自明的，但是有几件事值得提一下：

source: The response gets a special MIME type, :mimetype:`text/csv`. This tells browsers that the document is a CSV file, rather than an HTML file. If you leave this off, browsers will probably interpret the output as HTML, which will result in ugly, scary gobbledygook in the browser window.
it: La response ottiene un MIME type speciale, :mimetype:`text/csv`. Questo dice ai browser che il documento è un file CSV, piuttosto che un file HTML. Se non lo specifichi, i browser probabilmente intepreteranno l'output come HTML, che risulterà in un brutto e spaventoso nonsense nella finestra del browser.
ja: レスポンスは特別な MIME タイプ (:mimetype:`text/csv`) を受け取ります。これにより、ブラウザは、ドキュメントが HTML ではなく CSV ファイルであることを判断します。もしこの MIME タイプの設定を忘れると、ブラウザは出力を HTML と解釈し、ブラウザウィンドウに醜くて恐ろしいぐちゃぐちゃの文字列が現れてしまう恐れがあります。
ko: 응답에는 특수 MIME 유형인 :mimtype:'text/csv'가 있습니다. 이것은 문서가 HTML 파일이 아닌 CSV 파일임을 브라우저에 알려줍니다. 이 기능을 해제하면 브라우저가 출력을 HTML로 해석하여 브라우저 창에서 보기 흉하고 무서운 단어를 만들 수 있습니다.
pt_br: A resposta recebe um tipo MIME especial :mimetype:`text/csv`. Isso diz ao browser que o documento é um arquivo CSV, ao invés de um arquivo HTML. Se deixar isso desligado, os browsers vão provavelmente interpretar a resposta como HTML, o qual irá resultar em uma feia e assustadora gobbledygook na janela do seu browser.
zh_hans: 响应指定了特殊的 MIME 类型 :mimetype:`text/csv`。这告诉浏览器该文档是一个 CSV 文件，而不是一个 HTML 文件。如果你没这么干，浏览器可能会将输出视作 HTML，这会在浏览器窗口展示丑陋的，恐怖的官样文章。

source: The response gets an additional ``Content-Disposition`` header, which contains the name of the CSV file. This filename is arbitrary; call it whatever you want. It'll be used by browsers in the "Save as..." dialog, etc.
it: La risposta ottine un header ``Content-Disposition`` aggiuntivo, che contiene il nome del file CSV. Questo nome è arbitrario; chiamalo come vuoi. Sarà usato dai browser nel dialogo "Salva come..." ecc...
ja: レスポンスには、追加の ``Content-Disposition`` ヘッダに CSV のファイル名を設定することができます。ファイル名はどんなものでも構いません。ここで指定した名前は、ブラウザが「別名で保存」ダイアログなどで使用します。
ko: 이 응답에는 CSV 파일의 이름이 포함된 "Content-Disposition" 헤더가 추가됩니다. 이 파일 이름은 임의이므로 원하는 대로 불러 주십시오. 브라우저가 "다른 이름으로 저장..."에서 사용합니다.대화 상자 등입니다.
pt_br: A resposta recebe um cabeçalho adicional ``Content-Dispoition``, o qual contém o nome do arquivo CSV. Este nome de arquivo e arbitrário; chame isso do que você quiser. Ele será usado pelo browser no diálogo "Salvar como...", etc.
zh_hans: 相应还包括一个额外的 ``Content-Disposition`` 头，其中包含了 CSV 文件的名称。文件名是任意的；随便你怎么叫。它会被浏览器在 "保存为……" 对话框中用到。

source: You can hook into the CSV-generation API by passing ``response`` as the first argument to ``csv.writer``. The ``csv.writer`` function expects a file-like object, and :class:`~django.http.HttpResponse` objects fit the bill.
it: Puoi agganciarti alla API per la generazione di CSV passando ``response`` come primo argomento a ``csv.writer``. La funzione ``csv.writer`` si aspetta un oggetto file-like e :class:`~django.http.HttpResponse` fa al caso suo.
ja: CSV 生成 API にフックするには、``csv.writer`` の最初の引数として ``response`` を渡すだけです。``csv.writer`` 関数はファイルライクなオブジェクトを要求しますが、:class:`~django.http.HttpResponse` オブジェクトはこの要求に適合しています。
ko: "csv.writer"에 대한 첫 번째 논거로 "대응"을 전달함으로써 CSV 세대 API에 연결할 수 있습니다. "csv.writer" 기능은 파일 같은 객체를 기대하며 :class는 다음과 같습니다.'~django.the' 입니다.HttpResponse' 객체가 빌에 맞습니다.

source: For each row in your CSV file, call ``writer.writerow``, passing it an :term:`iterable`.
it: Per ogni riga del tuo CSV, chiama ``writer.writerow``, passando un :term:`iterable`.
ja: CSV ファイルの行ごとに ``writer.writerow`` を呼び、:term:`iterable` を渡します。
ko: CSV 파일의 각 행에 대해 ''writer''로 전화하십시오."글쓴다"는 뜻으로 "표절할 수 있다"라는 말을 씁니다.
zh_hans: 要按行输出 CSV 文件，调用 ``writer.writerrow``，传入一个 :term:`iterable` 参数。

source: The CSV module takes care of quoting for you, so you don't have to worry about escaping strings with quotes or commas in them. Pass ``writerow()`` your raw strings, and it'll do the right thing.
it: Il modulo CSV si occupa del quoting per te, quindi non devi preoccuparti di fare escape delle stringhe con quote o virgole. Passa a ``writerow()`` le tue stringhe grezze e farà la cosa giusta.
ja: CSV モジュールは引用を適切に処理するので、引用符やカンマでの文字列のエスケープについて心配する必要はありません。生の文字列を ``writerow()`` に渡すことで適切に処理されます。
ko: CSV 모듈은 견적을 처리하므로 따옴표 또는 쉼표가 포함된 문자열을 이스케이프할 필요가 없습니다. "원래의 조건"을 넘기면 옳은 일을 할 수 있을 것입니다.

source: Streaming large CSV files
it: Streaming di grossi file CSV
ja: サイズの大きな CSV ファイルをストリーミングする
ko: 대용량 CSV 파일들을 스트리밍하기
pt_br: Transmitindo grandes arquivos CSV
zh_hans: 输出超大 CSV 文件

source: When dealing with views that generate very large responses, you might want to consider using Django's :class:`~django.http.StreamingHttpResponse` instead. For example, by streaming a file that takes a long time to generate you can avoid a load balancer dropping a connection that might have otherwise timed out while the server was generating the response.
it: Quando hai a che fare con view che generano response molto grandi, potresti voler considerare :class:`~django.http.StreamingHttpResponse` di Django, invece. Per esempio, facendo streaming di un file che ci mette tanto ad essere generato puoi evitare che il load balancer interrompa una connessione che sarebbe andata fuori tempo massimo mentre il server generava la risposta.
ja: 大きなサイズのレスポンスを生成するビューを取り扱うときには、代わりに Django の :class:`~django.http.StreamingHttpResponse` の使用を考えてみてください。例えば、生成に長時間を要するファイルをストリーミングことで、サーバーがレスポンスを生成している間にタイムアウトしてしまうような接続でも、ロードバランサが接続をドロップすることを防げます。
ko: 매우 큰 응답을 생성하는 보기를 처리할 때 Django의 :class:를 사용하는 것을 고려할 수 있습니다.'~django.the' 입니다.대신 스트리밍HttpResponse'입니다. 예를 들어, 생성하는 데 시간이 오래 걸리는 파일을 스트리밍하면 서버가 응답을 생성하는 동안 시간 초과되었을 수 있는 연결을 로드 밸런서가 삭제하지 않도록 방지할 수 있습니다.
pt_br: Quando lida com "views" que geram respostas muito grandes, talvez queira considerar usar o :class:`~django.http.StreamingHttpResponse` do Django no lugar. Por exemplo, por trasmitir em fluxo contínuo ou "streaming" um arquivo que leva muito tempo para ser gerado você pode evitar que a conexão seja perdida tentando balancear a carga que talvez expire enquanto o servidor estava gerando a resposta.
zh_hans: 当处理生成很多回复的视图时，你可能要考虑使用 Django 的 :class:`~django.http.StreamingHttpResponse` 作为替代。例如，要进行耗时的输出文件流的操作，你可以避免负载均衡器在服务器输出耗时相应时，可能由于超时抛弃改连接。

source: In this example, we make full use of Python generators to efficiently handle the assembly and transmission of a large CSV file::
it: In questo esempio, utilizziamo i generatori Python per gestire in modo efficiente la composizione e la trasmissione di un file CSV di grandi dimensioni::
ja: この例では、Python のジェネレータを最大限使用して、サイズの大きな CSV ファイルの組み立てと伝達を効率的に扱います。
ko: 이 예에서는 Python 생성기를 최대한 활용하여 대형 CSV 파일의 어셈블리 및 전송을 효율적으로 처리합니다.
pt_br: Neste exemplo, fazemos uso total de geradores Python para manipular eficientemente a montagem e transmissão de um grande arquivo CSV::
zh_hans: 在本例中，我们充分利用 Python 的生成器，高效地处理大型 CSV 文件的装配和输出任务::

source: Using the template system
it: Utilizzare il template system
ja: テンプレートシステムを使う
ko: 템플릿 시스템 사용하기
pt_br: Usando o sistema de template.
zh_hans: 使用模板系统

source: Alternatively, you can use the :doc:`Django template system </topics/templates>` to generate CSV. This is lower-level than using the convenient Python :mod:`csv` module, but the solution is presented here for completeness.
it: Alternativamente, puoi usare il :doc:`sistema di template di Django </topics/templates>` per generare CSV. Questo è più low-level rispetto all'utilizzo del conveniente modulo :mod:`csv` ma la soluzione viene qui proposta per completezza.
ja: もしくは、:doc:`Django のテンプレートシステム </topics/templates>` を使って CSV を生成することもできます。Python の :mod:`csv` モジュールの利便性には劣りますが、完全性のために提供されています。
ko: 또는 :doc을 사용할 수 있습니다.CSV를 생성하기 위한 '장고 템플릿 시스템'입니다. 이는 편리한 Python:mod:'csv' 모듈을 사용하는 것보다 낮은 수준이지만, 완벽함을 위해 솔루션을 제공합니다.
pt_br: Uma alternatica, você pode usar o :doc:`sistema de tempaltes do Django </topics/templates>` para gerar CSV. Isso é mais baixo nível que usar o conveniente módulo Python :mod:`csv`, mas a solução é apresentada aqui para para abrangência.
zh_hans: 或者，你也能用 :doc:`Djano 模板系统 </topics/templates>` 生成 CSV。这比使用方便的 :mod:`csv` 模块级别低点，但是，解决方案就在这，你可以选。

source: The idea here is to pass a list of items to your template, and have the template output the commas in a :ttag:`for` loop.
it: L'idea è di passare una lista di oggetti al tuo template, e lasciare che il template crei le virgole nel ciclo :ttag:`for`
ja: 考え方としては、テンプレートに項目のリストを渡すというものです。そして、テンプレートの :ttag:`for` ループの中でカンマを出力させます。
ko: 여기서의 아이디어는 템플릿에 항목 목록을 전달하고 템플릿이 쉼표를 :ttag:'for' 루프에 출력하도록 하는 것입니다.
pt_br: A idéia aqui é passar uma lista de itens para seu template, e ter a saida do template as vírgulas em um loop :ttag:`for`.
zh_hans: 办法就是将项目列表传给模板，让模板在 :ttag:`for` 循环中输出逗号。

source: Here's an example, which generates the same CSV file as above::
it: Qui c'è un esempio, che genera lo stesso file CSV visto in precedenza::
ja: 以下の例は、上述の例と同じ CSV ファイルを生成します。
ko: 다음은 위와 동일한 CSV 파일을 생성하는 예입니다.
pt_br: Aqui um exemplo, o qual gera o mesmo arquivo CSV que acima::
zh_hans: 以下例子输出与前文一样的 CSV 文件::

source: The only difference between this example and the previous example is that this one uses template loading instead of the CSV module. The rest of the code -- such as the ``content_type='text/csv'`` -- is the same.
it: La sola differenza tra questo esempio e quello precedente è che questo usa il caricamento del template invece del modulo CSV. Il resto del codice -- come ``content_type='text/csv'`` -- è lo stesso.
ja: この例と上述の例の唯一の違いは、この例では CSV モジュールの代わりにテンプレートを呼び出していることです。残りのコード部分 (例えば ``content_type='text/csv'``) は同じです。
ko: 이 예와 이전 예와의 유일한 차이점은 이 예에서는 CSV 모듈 대신 템플릿 로드를 사용한다는 것입니다. "content_type type'text/csv"와 같은 나머지 코드는 동일합니다.
pt_br: A única diferença entre este exemplo e o exemplo anterior é que este usa carfa de template ao invés do módulo CSV. O resto do código -- tal como ``content_type='text/csv'`` -- é o mesmo.
zh_hans: 本例与前例唯一的不同是本例使用模板加载，而不是 CSV 模块。剩下的代码都一样，例如 ``content_type='text/csv'``。

source: Then, create the template ``my_template_name.txt``, with this template code:
it: Quindi, crea il template ``my_template_name.txt``, con questo codice:
ja: そして、以下のテンプレートのコードを用いて、テンプレート ``my_template_name.txt`` を作成しましょう。
ko: 그런 다음 ''my_template_name' 템플릿을 생성합니다.txt², 이 템플릿 코드로 다음을 수행합니다.
pt_br: Então, crie o template ``my_template_name.txt``, com este código no template:
zh_hans: 然后，用模板代码创建模板 ``my_template_name.txt``。

source: This short template iterates over the given data and displays a line of CSV for each row. It uses the :tfilter:`addslashes` template filter to ensure there aren't any problems with quotes.
it: Questo breve template itera i dati e mostra una riga del CSV alla volta. Utilizza il filtro template :tfilter:`addslashes` per essere sicuro che non ci siano problemi con gli apici.
ja: この短いテンプレートは与えられたデータを繰り返し処理し、各行の CSV 行を表示します。引用符の問題がないように :tfilter:`addslashes` テンプレートフィルタを使用します。
ko: 이 짧은 템플릿은 지정된 데이터에 대해 반복되고 각 행에 대해 CSV 줄을 표시합니다. :t filter:'addslash' 템플릿 필터를 사용하여 따옴표에 문제가 없도록 합니다.

source: Other text-based formats
it: Altri formati basati sul testo
ja: 他のテキストベースのフォーマット
ko: 기타 텍스트 기반 형식입니다.
pt_br: Outros formatos baseados e texto.
zh_hans: 其它文本格式
