Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Notice that there isn't very much specific to CSV here -- just the specific output format. You can use either of these techniques to output any text-based format you can dream of. You can also use a similar technique to generate arbitrary binary data; see :doc:`/howto/outputting-pdf` for an example.
it: Nota che non c'è niente di molto specifico di CSV qui -- solo il formato di output. Puoi usare entrambe queste tecniche per fare output di qualsiasi file in formato testo che vuoi. Puoi anche utilizzare una tecnica simile per generare dati binari arbitrari; vedi :doc:`/howto/outputting-pdf` per avere un esempio.
ja: ここで説明した CSV (特定の出力フォーマットの 1 つ)のような、フォーマット特有の説明は特にありません。あなたの望むテキストベースのフォーマットを出力するときには、ここで説明したテクニックを活用してみてください。また、任意のバイナリデータを生成するときにも、ここでのテクニックが参考になります; :doc:`/howto/outputting-pdf` で例を参照してください。
ko: CSV에 대한 구체적인 내용은 없고 특정 출력 형식만 있습니다. 이러한 기술 중 하나를 사용하여 원하는 텍스트 기반 형식을 출력할 수 있습니다. 유사한 기술을 사용하여 임의 이진 데이터를 생성할 수도 있습니다. 예제는 :doc:'/howto/output-pdf'를 참조하십시오.
pt_br: Note que não tem muita coisa específica sobre CSV aqui -- apenas o formato de saída. Você pode usar qualquer uma destas técnicas para qualquer formato texto que você imagine. Você também pode usar essa técnica para gerar dados binários arbitrários; veja :doc:`/howto/outputting-pdf` por exemplo.
zh_hans: 注意，这里并没有太多特定于 CSV 的内容——仅是特定的输出格式。你可以使用其中任意一种输出你能想到文本内容。你也能用类似的技术生成任意二进制数据；参考 :doc:`/howto/outputting-pdf` 的例子。

source: How to create PDF files
it: Come creare file PDF
ja: PDFファイルを作成する

source: This document explains how to output PDF files dynamically using Django views. This is made possible by the excellent, open-source ReportLab_ Python PDF library.
it: Questo documento spiega come produrre PDF dinamicamente usando le views di Django. Questo è reso possibile dall'eccellente libreria open-source ReportLab_ Python PDF.
ja: このドキュメントでは、Django のビューを使用して PDF ファイルを動的に出力する方法を説明します。これは、優れたオープンソースの Python PDF ライブラリ ReportLab_ により可能になっています。
ko: 이 문서에서는 Django 보기를 사용하여 PDF 파일을 동적으로 출력하는 방법을 설명합니다. 이는 우수한 오픈 소스 ReportLab_Python PDF 라이브러리를 통해 가능합니다.
pt_br: Este documnto explica como gerar arquivos PDF dinamicamente usando "views" Django. Isso é possível através da excelente, biblioteca Python de código-aberto RepostLab_ .
zh_hans: 本文介绍如何用 Django 的视图动态输出 PDF 文件。该功能由绝佳的开源 ReportLab_ Python PDF 库提供。

source: The advantage of generating PDF files dynamically is that you can create customized PDFs for different purposes -- say, for different users or different pieces of content.
it: Il vantaggio di generare file PDF dinamicamente è che puoi creare PDF personalizzati per differenti scopi -- , per differenti utenti o per differenti parti del contenuto.
ja: PDF ファイルを動的に生成する利点は、異なる目的のためにカスタマイズされた PDF を作成できることです。たとえば、異なるユーザーや異なるコンテンツを使用して生成できます。
ko: PDF 파일을 동적으로 생성할 수 있는 이점은 사용자나 컨텐츠의 다양한 용도로 사용자 정의된 PDF를 생성할 수 있다는 것입니다.
pt_br: A vantagem de gerar arquivos PDF dinamicamente é que você pode criar PDFs personalizados para diferentes propósitos -- vamos dizer, para diferentes usuários ou diferentes partes de conteúdo.
zh_hans: 动态生成 PDF 文件的优点是你可以为不同的目的创建不同的自定义 PDF——例如，为不同的用户或内容的不同片段生成 PDF。

source: For example, Django was used at kusports.com_ to generate customized, printer-friendly NCAA tournament brackets, as PDF files, for people participating in a March Madness contest.
it: Per esempio, Django è stato usato in kusports.com_ per generare bracket di torneo printer-friendly per i tornei NCAA, come file PDF, per le persone che partecipavano alla gara March Madness.
ja: たとえば、kusports.com_ では、March Madness コンテストに参加する人たちのために、カスタマイズされたプリンター向けの NCAA トーナメントブラケットを PDF ファイルとして生成するのに Django が使われていました。
ko: 예를 들어, Django는 kusports.com_에서 3월 Madness 대회에 참가하는 사람들을 위해 PDF 파일로 사용자 정의되고 프린터 친화적인 NCAA 토너먼트 브래킷을 생성하는 데 사용되었습니다.
pt_br: Por exemplo, o DJango foi usado no kusports.com_ para gerar relatórios personalizados, prontos para impressão, de pontuação de torneio da NCAA, como arquivos PDF, para pessoas que participam do concurso March Madness.
zh_hans: 例如，kusports.com_ 用 Django 将自定义的，打印友好的 NCAA 锦标赛树状图生成 PDF 文件，发放给参加三月疯狂竞赛的人。

source: Install ReportLab
it: Installa ReportLab
ja: ReportLab をインストールする
ko: ReportLab을 설치합니다.
pt_br: Instalar o ReportLab
zh_hans: 安装 ReportLab

source: The ReportLab library is :pypi:`available on PyPI <reportlab>`. A `user guide`_ (not coincidentally, a PDF file) is also available for download. You can install ReportLab with ``pip``:
ja: ReportLab ライブラリは、:pypi:`PyPI で利用できます <reportlab>`。`ユーザーガイド`_ (偶然ではなく PDF で提供されています) もダウンロードして利用できます。ReportLab は ``pip`` により次のコマンドでインストールできます。

source: Test your installation by importing it in the Python interactive interpreter:
ja: Python の対話的インタープリタ内でインポートすることでインストールをテストします。

source: If that command doesn't raise any errors, the installation worked.
it: Se quel comando non genera nessune errore, l'installazione ha funzionato.
ja: このコマンドが何もエラーを起こさなければ、インストールは機能しています。
ko: 해당 명령으로 인해 오류가 발생하지 않으면 설치가 작동했습니다.
pt_br: Se o comando não emitir nenhum erro, a instalação funciona.
zh_hans: 若该命令未抛出任何错误，安装成功。

source: Write your view
it: Scrivi la tua vista
ja: ビューを書く
ko: 당신의 견해를 쓰시오.
pt_br: Escreva sua "view"
zh_hans: 编写视图

source: The key to generating PDFs dynamically with Django is that the ReportLab API acts on file-like objects, and Django's :class:`~django.http.FileResponse` objects accept file-like objects.
it: La chiave per generare PDF dinamicamente con Django è che le API di ReportLab agiscono su oggetti file-like e l'oggetto di Django :class:`~django.http.FileResponse` accetta oggetti file-like.
ja: Django で PDF を動的に生成するときに重要な点は、ReportLab API がファイルライクなオブジェクトとして振る舞い、Django の :class:`~django.http.FileResponse` オブジェクトがファイルライクなオブジェクトを受け取るということです。
ko: Django를 사용하여 PDF를 동적으로 생성하기 위한 핵심은 ReportLab API가 파일과 유사한 개체에 대해 작동하고 Django의 :class:'~django.the' 입니다.파일 응답' 개체는 파일 유사 개체를 수락합니다.
zh_hans: 利用 Django 动态生成 PDF 的关键是 ReportLab API 作用于类文件对象，而 Django 的 :class:`~django.http.FileResponse` 对象接收类文件对象。

source: Here's a "Hello World" example::
it: Qui un esempio di "Hello World"::
ja: ここに、"Hello World"の例を示します:
ko: 다음은 "Hello World"의 예입니다.
pt_br: Aqui um exemplo "Hello World"::
zh_hans: 这有个 "Hello World" 示例::

source: The response will automatically set the MIME type :mimetype:`application/pdf` based on the filename extension. This tells browsers that the document is a PDF file, rather than an HTML file or a generic :mimetype:`application/octet-stream` binary content.
it: La risposta imposterà automaticamente il tipo MIME :mimetype:`application/pdf` basato sull'estensione del file. Questo dice ai browser che il documento è un file PDF, piuttosto che un file HTML o un contenuto binario generico :mimetype:`application/octet-stream`.
ja: レスポンスはファイル名の拡張子に基づいて自動的にMIMEタイプ :mimetype:`application/pdf` を設定します。これはブラウザに、ドキュメントがHTMLファイルや一般的な :mimetype:`application/octet-stream` バイナリコンテンツではなく、PDFファイルであることを伝えます。
ko: 응답은 파일 이름 확장자에 따라 자동으로 MIME 유형:mimtype:'application/pdf'를 설정합니다. 이것은 브라우저에게 문서가 HTML 파일이나 일반적인 :mimetype:'application/octet-stream' 바이너리 콘텐츠가 아닌 PDF 파일임을 알려줍니다.

source: When ``as_attachment=True`` is passed to ``FileResponse``, it sets the appropriate ``Content-Disposition`` header and that tells web browsers to pop-up a dialog box prompting/confirming how to handle the document even if a default is set on the machine. If the ``as_attachment`` parameter is omitted, browsers will handle the PDF using whatever program/plugin they've been configured to use for PDFs.
it: Quando ``as_attachment=True`` viene passato a ``FileResponse``, imposta l'header ``Content-Disposition`` appropriato e dice ai browser web di mostrare una finestra di dialogo che richiede/conferma come gestire il documento anche se sulla macchina è impostato un valore predefinito. Se il parametro ``as_attachment`` viene omesso, i browser gestiranno il PDF utilizzando qualsiasi programma/plugin siano stati configurati ad usare per i PDF.
ja: ``as_attachment=True`` が ``FileResponse`` に渡されると、適切な ``Content-Disposition`` ヘッダが設定され、ウェブブラウザはそのマシンでデフォルトが設定されていたとしても、そのドキュメントをどのように扱うかを確認するダイアログボックスをポップアップするようになります。もし ``as_attachment`` パラメータが省略された場合、ブラウザはPDFを扱うために設定されたプログラムやプラグインを使ってPDFを扱います。

source: You can provide an arbitrary ``filename`` parameter. It'll be used by browsers in the "Save as..." dialog.
it: Puoi scegliere un parametro ``filename`` arbitrario. Verrà utilizzato dai browsers nella finestra di dialogo "Salva come..".
ja: 任意の ``filename`` パラメータを指定できます。これはブラウザの "名前を付けて保存" ダイアログで使用されます。
ko: 임의의 "파일 이름" 매개 변수를 제공할 수 있습니다. 브라우저가 "다른 이름으로 저장..."에서 사용합니다." 대화 상자입니다.
zh_hans: 你也可以提供可选参数 ``filename``。浏览器的“另存为…”对话框会用到它。

source: You can hook into the ReportLab API: The same buffer passed as the first argument to ``canvas.Canvas`` can be fed to the :class:`~django.http.FileResponse` class.
it: È possibile agganciarsi all'API ReportLab: lo stesso buffer è passato come primo argomento alla classe ``canvas.Canvas`` può alimentare la classe :class:`~django.http.FileResponse` .
ja: ReportLab API にフックできます: ``canvas.Canvas`` の第一引数に渡されたバッファと同じバッファを :class:`~django.http.FileResponse` クラスに渡すことができます。
ko: ReportLab API에 연결할 수 있습니다. "캔버스"에 대한 첫 번째 주장과 같은 완충장치가 통과되었습니다.캔버스'는 :class에 제공할 수 있습니다.'~django.the' 입니다.파일 응답 클래스입니다.

source: Note that all subsequent PDF-generation methods are called on the PDF object (in this case, ``p``) -- not on ``buffer``.
it: Si noti che tutti i metodi di generazione PDF successivi sono chiamati sull'oggetto PDF (in questo caso, ``p``) -- non su `` buffer``.
ja: 後続のPDF生成メソッドはすべて、PDFオブジェクト（この場合は ``p`` ）に対して呼び出され、 ``buffer`` に対して呼び出されるのではないことに注意してください。
ko: 이후의 모든 PDF 생성 방법은 "버퍼"가 아닌 PDF 객체(이 경우 "p")로 호출됩니다.
zh_hans: 注意，所有后续生成 PDF 的方法都是在 PDF 对象上调用的（本例中是 ``p``）——而不是在 ``buffer`` 上调用。

source: Finally, it's important to call ``showPage()`` and ``save()`` on the PDF file.
it: Infine, è importante chiamare ``showPage()`` e ``save()`` sul file PDF.
ja: 最後に、PDFファイル上で ``showPage()`` と ``save()`` を呼び出すことが重要です。
ko: 마지막으로 PDF 파일로 ``쇼 페이지"와 "저장(save)"을 부르는 것이 중요합니다.
pt_br: E finalmente, é importante chamar ``showPage()`` e o ``save()`` no arquivo PDF.
zh_hans: 最后，牢记在 PDF 文件上调用 ``showPage()`` 和 ``save()``。

source: ReportLab is not thread-safe. Some of our users have reported odd issues with building PDF-generating Django views that are accessed by many people at the same time.
it: ReportLab non è thread-safe. Alcuni dei nostri utenti hanno riportato strani problemi con Django view che generano PDF quando vi accedono più persone allo stesso tempo.
ja: ReportLabはスレッドセーフではありません。一部のユーザーからは、多くの人が同時にアクセスするPDF生成Djangoビューを構築する際に奇妙な問題が発生するとの報告があります。
ko: ReportLab은 스레드 세이프가 아닙니다. 일부 사용자가 PDF 생성 Django 뷰를 구축하는 과정에서 여러 사용자가 동시에 액세스할 수 있는 이상한 문제가 발생했다고 보고했습니다.
pt_br: O ReposrtLab não tem mecanismos de segurança para ser usado de maneira concorrente, ou não é thread-safe. Alguns de nossos usuários tem relatado problemas ímpares ao gerar PDF em "views" Django que são acessadas por muitos usuários ao mesmo tempo.
zh_hans: ReportLab 不是线程安全的。某些用户已经报告了一些奇怪的 issue，在创建用于生成 PDF 的 Django 视图时，这些视图被多个用户同时访问会出现问题。

source: Other formats
it: Altri formati
ja: ほかのフォーマット
ko: 다른 포맷
pt_br: Outros Formatos
zh_hans: 其它格式

source: Notice that there isn't a lot in these examples that's PDF-specific -- just the bits using ``reportlab``. You can use a similar technique to generate any arbitrary format that you can find a Python library for. Also see :doc:`/howto/outputting-csv` for another example and some techniques you can use when generated text-based formats.
it: Nota che non ci sono molti esempi specifici per i PDF -- solo alcuni che usano ``reportlab``. Puoi usare tecniche simili per generare ogni formato arbitario per il quale puoi trovare una libreria Python. Vedi anche :doc:`/howto/outputting-csv` per altri esempi e qualche tecnica da usare per generare formati basati su testo.
ja: これらの例には PDF 固有のものはあまりないことに注意してください -- ``reportlab`` を使った部分だけです。同じようなテクニックを使って、Pythonのライブラリがあれば任意のフォーマットを生成できます。また、 :doc:`/howto/outputting-csv` にも別の例とテキストベースのフォーマットを生成するときに使えるテクニックがあります。
ko: 이러한 예에서는 PDF에 특정한 것이 많지 않으며 단지 "보고서 실험실"을 사용한 일부입니다. 유사한 기술을 사용하여 Python 라이브러리를 찾을 수 있는 임의 형식을 생성할 수 있습니다. 또한 다른 예와 텍스트 기반 형식을 생성할 때 사용할 수 있는 몇 가지 기법은 :doc:'/how to/outputing-csv'를 참조하십시오.
pt_br: Note que não tem muito nestes exemplos que seja especificamente sobre PDF -- apenas as partes usando ``reportlab``. Você pode usar técnicas similares para gerar qualquer outro formato arbitrário para a qual você encontre uma bilioteca Python. Veja também :doc:`/howto/outputting-csv` para outro exemplo e algumas técnicas que você pode usar quando quiser gerar fomatos baseados em texto.
zh_hans: 注意，这些例子中没有任何 PDF 特有的数据——只有使用 ``reportlab`` 的部分。你可以用类似的技巧生成任意格式，只要你能找到对应的 Python 库。也请看看 :doc:`/howto/outputting-csv`，看看另一个例子中，如何用一些技巧输出文本内容。

source: Django Packages provides a `comparison of packages <https://djangopackages.org/grids/g/pdf/>`_ that help generate PDF files from Django.
it: Django Packages offre una `comparazione di package <https://djangopackages.org/grids/g/pdf/>`_ che aiutano a generare file PDF da Django.
ja: Django Packagesは、DjangoからPDFファイルを生成するのに役立つ `パッケージの比較一覧 <https://djangopackages.org/grids/g/pdf/>`_ を提供しています。
ko: Django Package는 Django에서 PDF 파일을 생성하는 데 도움이 되는 'packages https://djangopackages.org/grids/g/pdf/'을 제공합니다.
zh_hans: Django 包提供了一个 `包的比较 <https://djangopackages.org/grids/g/pdf/>`_ 有助于用 Django 生成 PDF 文件。

source: How to override templates
it: Come sovrascrivere i templates
ja: テンプレートをオーバーライドする

source: In your project, you might want to override a template in another Django application, whether it be a third-party application or a contrib application such as ``django.contrib.admin``. You can either put template overrides in your project's templates directory or in an application's templates directory.
it: Nel tuo progetto, puoi voler fare override del template in un'altra applicazione Django, che sia una applicazione di terze parti o una applicazione contrib come ``django.contrib.admin``. Puoi mettere gli override di template nella directory di template del tuo progetto o nella directory di template dell'applicazione.
ja: プロジェクトでは、``django.contrib.admin`` のような contrib アプリケーションやサードパーティアプリケーションで Djangoアプリケーションのテンプレートを上書きすることができます。 テンプレートの上書きは、プロジェクトのテンプレートディレクトリまたはアプリケーションのテンプレートディレクトリに置くことができます。
ko: 프로젝트에서 타사 애플리케이션이든 ``django.contrib.admin"과 같은 기여 애플리케이션이든 다른 Django 애플리케이션의 템플릿을 재정의하는 것이 좋습니다. 프로젝트의 템플릿 디렉토리 또는 응용프로그램의 템플리트 디렉토리에 템플리트 재정의를 넣을 수 있습니다.
zh_hans: 在项目中，你可以想要在另一个 Django 应用中重写模板，不论它是第三方应用或 contrib 应用，例如 ``django.contrib.admin``。你可以将重写的模板置于工程的模板目录或应用的模板目录。

source: If you have app and project templates directories that both contain overrides, the default Django template loader will try to load the template from the project-level directory first. In other words, :setting:`DIRS <TEMPLATES-DIRS>` is searched before :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`.
it: Se hai directory di template di app e di progetto che fanno entrambe override, il template loader di default di Django proverà a caricare prima quello a livello di progetto. In altre parole, :setting:`DIRS <TEMPLATES-DIRS>` viene ricercata prima di :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`.
ja: オーバーライドが含まれている app と project の両方のテンプレートディレクトリがある場合、デフォルトの Django テンプレートローダは、まずプロジェクトレベルのディレクトリからテンプレートをロードしようとします。つまり、 :setting:`DIRS <TEMPLATES-DIRS>` は :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` より前に検索されます。
ko: 앱 및 프로젝트 템플릿 디렉터리에 모두 재정의가 포함된 경우 기본 Django 템플릿 로더가 먼저 프로젝트 수준 디렉터리에서 템플릿을 로드하려고 시도합니다. 즉, :설정:'입니다.DIRS'가 다음 설정 전에 검색됩니다.'APP_DIRS'입니다.
zh_hans: 若应用和工程的模板模板都包含被重写的模板，默认的 Django 模板加载器会先尝试加载工程目录下的模板。换句话说，先查找 :setting:`DIRS <TEMPLATES-DIRS>`，其次 :setting:`APP_DIRS <TEMPLATES-APP_DIRS>`。

source: Read :ref:`overriding-built-in-widget-templates` if you're looking to do that.
it: Leggi :ref:`overriding-built-in-widget-templates` se stai cercando di fare questo.
ja: そのようなことをしたい場合は、:ref:`overriding-built-in-widget-templates` を読んでください。
ko: ref:를 읽습니다.그렇게 하려면 붙박이장 같은 것도 있어야죠.
zh_hans: 阅读 :ref:`重写内置视图模板` 若你正在找相关资料。

source: Overriding from the project's templates directory
it: Sovrascrivere la directory dei template del progetto
ja: プロジェクトのtemplatesディレクトリからオーバーライドする
ko: 프로젝트의 템플릿 디렉터리에서 재정의합니다.
zh_hans: 重写来自工程目录的模板

source: First, we'll explore overriding templates by creating replacement templates in your project's templates directory.
it: Innanzitutto, esploreremo come fare override i template creando modelli sostitutivi nella directory dei template del tuo progetto.
ja: 最初に、プロジェクトのテンプレートディレクトリに置き換え用テンプレートを作成して、テンプレートのオーバーライドを検討します。
ko: 먼저 프로젝트의 템플릿 디렉터리에 교체 템플릿을 생성하여 템플릿을 재정의하는 방법에 대해 알아봅니다.
zh_hans: 首先，我们探索用在工程模板目录创建替代模板的方法。

source: Let's say you're trying to override the templates for a third-party application called ``blog``, which provides the templates ``blog/post.html`` and ``blog/list.html``. The relevant settings for your project would look like::
it: Diciamo che stai cercando di fare override del template di una applicazione di terza parte chiamata ``blog``, che offre i template ``blog/post.html`` e ``blog/list.html``. Le impostazioni rilevanti avranno questo aspetto::
ja: ``blog/post.html`` と ``blog/list.html`` というテンプレートを提供している ``blog`` というサードパーティアプリケーションのテンプレートをオーバーライドしようとしているとしましょう。プロジェクトに関連する設定は次のようになります:
ko: 당신이 ``blog/post.html"과 "blog/list.html"을 제공하는 "blog"라는 제3자 애플리케이션의 템플릿을 재정의하려고 한다고 가정해 보겠습니다. 프로젝트의 관련 설정은 다음과 같습니다.
zh_hans: 假设你正在重写第三方应用 ``blog`` 的模板，该应用提供了 ``blog/post.html`` 和 ``blog/list.html`` 模板。工程关键配置如下::

source: The :setting:`TEMPLATES` setting and ``BASE_DIR`` will already exist if you created your project using the default project template. The setting that needs to be modified is :setting:`DIRS<TEMPLATES-DIRS>`.
it: Le impostazioni :setting:`TEMPLATES` e ``BASE_DIR`` esisteranno già se hai creato il tuo progetto usando il template di default del progetto. L'impostazione che necessita di essere modificata è :setting:`DIRS <TEMPLATES-DIRS>`.
ja: デフォルトのプロジェクトテンプレートを使ってプロジェクトを作成した場合、 :setting:`TEMPLATES` 設定と ``BASE_DIR`` はすでに存在しています。変更が必要な設定は :setting:`DIRS<TEMPLATES-DIRS>` です。
ko: :설정:입니다.기본 프로젝트 템플릿을 사용하여 프로젝트를 생성했다면 템플릿 설정과 ``BASE_DIR"이 이미 존재하게 됩니다. 수정해야 할 설정은 : setting:'입니다.DIRS입니다.
zh_hans: 若用模板工程模板创建工程，则 :setting:`TEMPLATES` 和 ``BASE_DIR`` 早已存在。需要修改的配置是 :setting:`DIRS <TEMPLATES-DIRS>`。

source: These settings assume you have a ``templates`` directory in the root of your project. To override the templates for the ``blog`` app, create a folder in the ``templates`` directory, and add the template files to that folder:
it: Queste impostazioni presumono che tu abbia una directory ``templates`` nella radice del progetto. Per fare override dei template per l'app ``blog``, crea un foldere nella directory ``templates`` ed aggiungi i file di template a quella cartella:
ja: これらの設定はプロジェクトのルートに ``templates`` ディレクトリがあることを前提としています。 ``blog`` アプリのテンプレートを上書きするには、 ``templates`` ディレクトリにフォルダを作成し、テンプレートファイルをそのフォルダに追加します:
ko: 이러한 설정은 프로젝트의 루트에 "템플릿" 디렉토리를 가지고 있다고 가정합니다. "블로그" 앱의 템플릿을 재정의하려면 "템플릿" 디렉터리에 폴더를 생성한 다음 템플릿 파일을 해당 폴더에 추가하십시오.
zh_hans: 这些配置假定在工程根目录下有个 ``templates`` 目录。要重写 ``blog`` 应用的模板，在 ``templates`` 目录中创建一个文件夹，然后将以下模板文件添加至该目录：

source: The template loader first looks for templates in the ``DIRS`` directory. When the views in the ``blog`` app ask for the ``blog/post.html`` and ``blog/list.html`` templates, the loader will return the files you just created.
it: Il template loader cerca prima i template nella directory ``DIRS``. Quando le viste nell'app ``blog`` richiedono i template ``blog/post.html`` e ``blog/list.html``, il loader restituirà i file che hai appena creato.
ja: テンプレートローダーはまず ``DIRS`` ディレクトリにあるテンプレートを探します。 ``blog`` アプリのビューが ``blog/post.html`` と ``blog/list.html`` のテンプレートを要求すると、ローダーは先ほど作成したファイルを返します。
ko: 템플릿 로더는 먼저 "DIRS" 디렉토리에서 템플릿을 찾습니다. "blog" 앱의 뷰가 "blog/post.html"과 "blog/list.html" 템플릿을 요청하면 로더는 방금 만든 파일을 반환합니다.
zh_hans: 模板加载器会先查找 ``DIRS`` 目录下的模板。当 ``blog`` 应用中的视图要求 ``blog/post.html`` 和 ``blog/list.html`` 模板，加载器会返回你刚创建的文件。

source: Overriding from an app's template directory
it: Sovrascrivere la directory dei template di un'app
ja: アプリのテンプレートディレクトリからオーバーライドする
ko: 앱의 템플릿 디렉토리에서 재정의합니다.
zh_hans: 重写来自应用模板目录的模板

source: Since you're overriding templates located outside of one of your project's apps, it's more common to use the first method and put template overrides in a project's templates folder. If you prefer, however, it's also possible to put the overrides in an app's template directory.
it: Dal momento che stai facendo override dei template situati fuori delle app di progetto, è più comune usare il primo metodo e mettere i template override nella cartella di template del progetto. Se preferisci, comunque, è anche possibile mettere gli override nella directory di template dell'app.
ja: プロジェクトのアプリの外部にあるテンプレートをオーバーライドする場合、通常は最初の方法を使用し、テンプレートのオーバーライドをプロジェクトのテンプレートフォルダに配置します。ただし、好みに応じて、オーバーライドをアプリのテンプレートディレクトリに配置することも可能です。
ko: 프로젝트의 앱 외부에 위치한 템플릿을 재정의하기 때문에 프로젝트의 템플릿 폴더에 템플릿 재정의를 넣고 첫 번째 방법을 사용하는 것이 더 일반적입니다. 그러나 원하는 경우 앱의 템플릿 디렉터리에 재정의를 넣을 수도 있습니다.
zh_hans: 由于重写的模板位于工程应用之外，更常见的做法是使用第一个方法，然后将重写的模板置于工程模板目录。然而，如果你偏爱将重写的模板放入应用模板目录，也是可以的。

source: First, make sure your template settings are checking inside app directories::
it: Innanzitutto, assicurati che le impostazioni dei template stiano controllando all'interno delle directory dell'app::
ja: まず、テンプレート設定がアプリディレクトリ内をチェックしていることを確認してください:
ko: 먼저 템플릿 설정이 앱 디렉터리 내에서 확인 중인지 확인합니다.
zh_hans: 首先，确保模板配置会搜索应用模板目录::

source: If you want to put the template overrides in an app called ``myapp`` and the templates to override are named ``blog/list.html`` and ``blog/post.html``, then your directory structure will look like:
it: Se vuoi mettere gli override di template in una app chiamata ``myapp`` ed i template da sovrascrivere sono chiamati ``blog/list.html`` e ``blog/post.html`` allora la struttura della directory sarà::
ja: もし ``myapp`` というアプリにテンプレートのオーバーライドを配置し、オーバーライドするテンプレートが ``blog/list.html`` と ``blog/post.html`` である場合、ディレクトリ構造は以下のようになります:
ko: "myapp"이라는 앱에 템플릿 재정의를 넣고 재정의할 템플릿 이름을 "blog/list.html"과 "blog/post.html"로 지정하면 디렉터리 구조는 다음과 같습니다.
zh_hans: 若你想重写名为 ``blog/list.html`` 和 ``blog/post.html`` 的模板，并将它们置于名为 ``myapp`` 的应用中，那么目录结构应该看起来像这样：

source: With :setting:`APP_DIRS<TEMPLATES-APP_DIRS>` set to ``True``, the template loader will look in the app's templates directory and find the templates.
it: Con :setting:`APP_DIRS<TEMPLATES-APP_DIRS>` impostato a ``True``, il template loader cercherà nella directory di template dell'applicazione e troverà i template.
ja: :setting:`APP_DIRS<TEMPLATES-APP_DIRS>` を ``True`` に設定すると、テンプレートローダーはアプリのテンプレートディレクトリを探し、テンプレートを見つけることができます。
ko: 설정:을(설정):APP_DIRS가 "참"으로 설정되면 템플릿 로더가 앱의 템플릿 디렉토리를 검색하여 템플릿을 찾습니다.
zh_hans: 当 :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` 置为 ``True`` 时，模板加载器会深入应用的模板目录查找模板。

source: Extending an overridden template
it: Estendere un template sovrascritto
ja: オーバーライドされたテンプレートを継承（extend）する
ko: 재정의된 템플릿을 확장합니다.

source: With your template loaders configured, you can extend a template using the :ttag:`{% extends %}<extends>` template tag whilst at the same time overriding it. This can allow you to make small customizations without needing to reimplement the entire template.
it: Con i tuoi template loader configurati, puoi estendere un template usando il tag di template :ttag:`{% extends %}<extends>` sovrascrivendolo allo stesso tempo. Questo ti permette di fare piccole personalizzazioni senza necessità di reimplementare l'intero template.
ja: テンプレートローダーが設定されていれば、 :ttag:`{% extends %}<extends>` テンプレートタグを使ってテンプレートを継承できます。これにより、テンプレート全体を再実装することなく、少しだけカスタマイズできます。
ko: 템플릿 로더를 구성한 경우 :ttag:'{% extenses %}' 템플릿 태그를 사용하여 템플릿을 확장하는 동시에 재정의할 수 있습니다. 이렇게 하면 전체 템플릿을 다시 구현할 필요 없이 소규모 사용자 지정을 수행할 수 있습니다.
