Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: :setting:`MEDIA_ROOT` and :setting:`MEDIA_URL`
it: :setting:`MEDIA_ROOT` e :setting:`MEDIA_URL`
ja: :setting:`MEDIA_ROOT` と :setting:`MEDIA_URL`
ko: :설정: `MEDIA_ROOT` 그리고 :설정`MEDIA_URL`
pt_br: :setting:`MEDIA_ROOT` e :setting:`MEDIA_URL`
zh_hans: :setting:`MEDIA_ROOT` 和 :setting:`MEDIA_URL`

source: Media files are uploaded by your users. They're untrusted! Make sure your web server never attempts to interpret them. For instance, if a user uploads a ``.php`` file, the web server shouldn't execute it.
it: I file multimediali sono caricati dagli utenti. Sono insicuri! Assicurati che il tuo webserver non li interpreti mai. Per esempio, se un utente carica un file ``.php``, il server web non dovrebbe eseguirlo.
ja: メディアファイルは、あなたのユーザーによってアップロードされます。彼らは信用なりません！ ウェブサーバーが決してこれらを解読しようとしないようにしてください。たとえば、ユーザーが ``.php`` ファイルをアップロードしたとき、ウェブサーバーはその内容を実行するべきではありません。
ko: 미디어 파일은 사용자가 업로드합니다. 그들은 믿을 수 없어요! 웹 서버가 해당 문서를 해석하지 않도록 하십시오. 예를 들어 사용자가 ".php" 파일을 업로드하면 웹 서버가 실행하지 않아야 한다.
zh_hans: 媒体文件由用户上传。他们是不可信任的！确保 web 服务器从未尝试解析这些文件。例如，若用户上传了一个 ``.php`` 文件，web 服务器应该永远不要运行它。

source: Now is a good time to check your backup strategy for these files.
it: Adesso è un buon momento per verificare la tua strategia di backup per questi files.
ja: この機会に、こうしたファイルに対するバックアップ戦略をチェックしておきましょう。
ko: 지금 바로 이러한 파일의 백업 전략을 확인해 보십시오.
pt_br: Agora é uma boa hora para verificar sua estratégia de backup para estes arquivos.
zh_hans: 现在是检查这些文件的备份策略的好时机。

source: Any website which allows users to log in should enforce site-wide HTTPS to avoid transmitting access tokens in clear. In Django, access tokens include the login/password, the session cookie, and password reset tokens. (You can't do much to protect password reset tokens if you're sending them by email.)
it: Ogni sito web che permette agli utenti di fare login, dovrebbe applicare HTTPS per evitare la trasmissione degli access token in chiaro. In Django, gli access token includono il login/password, i cookie di sessione ed i token di reimpostazione della password. (Non puoi proteggere gran che i token di reimpostazione della password se li invii per email).
ja: ユーザーにログインさせるあらゆるウェブサイトは、アクセストークンを平文で送信するのを防ぐため、サイト全体の HTTPS を強制するべきです。Django では、アクセストークンはログインとパスワード、セッションクッキー、パスワードリセットトークンを含みます。(パスワードリセットトークンを E メール送信する場合、それほど保護されてはいません。)
ko: 사용자가 로그인할 수 있는 웹 사이트는 액세스 토큰을 명확하게 전송하지 않도록 사이트 전체 HTTPS를 적용해야 합니다. Django에서 액세스 토큰에는 로그인/암호, 세션 쿠키 및 암호 재설정 토큰이 포함됩니다(이메일로 보내는 경우 암호 재설정 토큰을 보호하는 데 많은 작업을 수행할 수 없습니다).
pt_br: Qualquer website que possibilita autenticação de usuários deveria exigir HTTPS em todo o site para evitar a transmissão de tokens planos. No Djano, os tokes de acesso incluem o login/senha, a "cookie" da sessão e o token de reset de senha. (Não é possível fazer muito para proteger bem os tokens de reset de senha se são enviados via email).
zh_hans: 允许用户登录的网站应该强制站点范围的 HTTPS，避免明文传输令牌。在 Django 中，令牌包括账号/密码，会话 cookie 和重置密码的令牌。（如果你用邮件发送重置密码的令牌，那就没什么办法能保护它们。）

source: Protecting sensitive areas such as the user account or the admin isn't sufficient, because the same session cookie is used for HTTP and HTTPS. Your web server must redirect all HTTP traffic to HTTPS, and only transmit HTTPS requests to Django.
it: Proteggere aree sensibili quali l'account utente o l'amministrazione non è sufficiente, perchè lo stesso cookie di sessione viene usato sia per HTTP che per HTTPS. Il tuo web server deve redirigere tutto il traffico HTTP ad HTTPS, e trasmettere solo richieste HTTPS a Django.
ja: ユーザーアカウントや admin などの機密性の高いエリアを保護するだけでは不十分です。なぜなら、HTTP と HTTPS で同じセッションクッキーが使用されるためです。Web サーバーは、すべての HTTP トラフィックを HTTPS にリダイレクトし、HTTPS リクエストのみを Django に送信する必要があります。
ko: HTTP 및 HTTPS에 동일한 세션 쿠키가 사용되므로 사용자 계정이나 관리자와 같은 중요한 영역을 보호하는 것만으로는 충분하지 않습니다. 웹 서버는 모든 HTTP 트래픽을 HTTPS로 리디렉션하고 HTTPS 요청만 Django로 전송해야 합니다.
pt_br: Proteger áreas sensíveis como a conta do usuário e o admin não são sificientes, porque o mesmo "cookie" de sessão é usado para HTTP e HTTPS. Seu servidor WEB deve redirecionar todas as requisições HTTP para HTTPS, e somente transmitir requests HTTPS para o Django.
zh_hans: 仅保护用户账号或后台等敏感区域是不够的，因为 HTTP 和 HTTPS 使用相同的会话 cookie。Web 服务器必须将所有的 HTTP 重定向至 HTTPS，且只将 HTTPS 的请求转发给 Django。

source: Once you've set up HTTPS, enable the following settings.
it: Quando hai disposto HTTPS, abilita le seguenti impostazioni.
ja: 一度 HTTPS をセットアップしたら、以下の設定項目が有効になります。
ko: HTTPS를 설정한 후 다음 설정을 사용하도록 설정하십시오.
pt_br: Uma vez que tenha configurado HTTPS, habilite as seguintes configurações.
zh_hans: 若你已经配置了 HTTPS，启用下列配置。

source: Set this to ``True`` to avoid transmitting the CSRF cookie over HTTP accidentally.
it: Abilitalo a ``True`` per evitare di trasmettere accidentalmente il cookie CSFR su HTTP.
ja: 誤って HTTP によって CSRF クッキーを送信してしまうのを防ぐには、``True`` をセットしてください。
ko: 실수로 HTTP를 통해 CSRF 쿠키가 전송되지 않도록 하려면 "참"으로 설정하십시오.
pt_br: Defina este como ``True`` para evitar transmissão do "cookie" de CSRF através de HTTP acidentalmente.
zh_hans: 将此设置为 ``True``，避免不甚用 HTTP 传输 CSRF cookie。

source: Set this to ``True`` to avoid transmitting the session cookie over HTTP accidentally.
it: Impostalo a ``True`` per evitare di trasmettere accidentalmente il cookie di sessione su HTTP.
ja: 誤って HTTP によってセッションクッキーを送信してしまうのを防ぐには、``True`` をセットしてください。
ko: 실수로 HTTP를 통해 세션 쿠키가 전송되지 않도록 하려면 "참"으로 설정하십시오.
pt_br: Defina este como ``True`` para evitar transmissão do "cookie" da sessão através de HTTP acidentalmente.
zh_hans: 将此设置未 ``True``，避免不甚用 HTTP 传输会话 cookie。

source: Performance optimizations
it: Ottimizzazione delle prestazioni
ja: パフォーマンスの最適化
ko: 성능 최적화
pt_br: Otimizações de desempenho.
zh_hans: 性能优化

source: Setting :setting:`DEBUG = False <DEBUG>` disables several features that are only useful in development. In addition, you can tune the following settings.
it: Impostare :setting:`DEBUG = False <DEBUG>` disabilita molte feature che sono utili solo in fase di sviluppo. Inoltre, puoi mettere a punto le seguenti impostazioni.
ja: :setting:`DEBUG = False <DEBUG>` をセットすることで、複数の開発向けの機能が無効化されます。さらに、以下の設定を調整できます。
ko: 설정 :setting:`DEBUG = False 은 개발에만 유용한 여러 기능을 사용하지 않도록 설정합니다. 또한 다음 설정을 조정할 수 있습니다.
pt_br: A Configuração :setting:`DEBUG = False <DEBUG>` desabilita muitas características que são úteis somente em desenvolvimento. Além disso, você pode ajustar as seguintes configurações.
zh_hans: 配置 :setting:`DEBUG = False <DEBUG>` 会禁用几个仅在开发时有用的功能。另外，你要调整下列配置。

source: Sessions
it: Sessioni
ja: セッション
ko: 세션

source: Consider using :ref:`cached sessions <cached-sessions-backend>` to improve performance.
it: Considera di usare :ref:`cached sessions <cached-sessions-backend>` per migliorare la performance.
ja: パフォーマンスを向上させるために :ref:`キャッシュを使ったセッション <cached-sessions-backend>` の使用を検討してください。
ko: 성능 향상을 위해 :ref:'캐시 세션'을 사용하는 것을 고려하십시오.

source: If using database-backed sessions, regularly :ref:`clear old sessions <clearing-the-session-store>` to avoid storing unnecessary data.
it: Se usi le sessioni su database, :ref:`pulisci le vecchie sessioni <clearing-the-session-store>` regolarmente per evitare di memorizzare dati non necessari.
ja: データベースバックアップセッションを使用している場合は、不要なデータを保存しないように :ref:`セッションストアのクリア <clearing-the-session-store>` を定期的に行ってください。
ko: 데이터베이스 지원 세션을 사용할 경우 정기적으로:ref:'이전 세션 지우기'를 수행하여 불필요한 데이터를 저장하지 않도록 합니다.

source: Enabling :ref:`persistent database connections <persistent-database-connections>` can result in a nice speed-up when connecting to the database accounts for a significant part of the request processing time.
it: Abilitare :ref:`le connessioni persistenti ad database <persistent-database-connections>` può portare ad una piacevole riduzione dei tempi quando ci si connette agli account del database per una parte significativa del tempo di processamento della richiesta.
ja: :ref:`永続的なデータベース接続 <persistent-database-connections>` を有効化すると、リクエストのプロセス時間の多くの部分に対するデータベースアカウントへの接続において、高速になります。
ko: 요청 처리 시간의 상당 부분을 데이터베이스 계정에 연결할 때 :ref:'영구 데이터베이스 연결'을 활성화하면 속도가 상당히 빨라질 수 있습니다.
pt_br: Habilitando :ref:`persistent database connections <persistent-database-connections>` pode resultar em um bom aumento de velocidade no tempo de processamento de requisições quando se conecta a contas do banco de dados.
zh_hans: 开启 :ref:`持久数据库连接 <persistent-database-connections>` 会在连接数据库账号耗费了请求处理时间的很大一部分的时候，大大提升速度。

source: This helps a lot on virtualized hosts with limited network performance.
it: Questo aiuta molto su virtual host con prestazioni di rete limitate.
ja: 限られたネットワーク性能の仮想化ホストにおいて、とても効果的です。
ko: 따라서 네트워크 성능이 제한된 가상화된 호스트에서 많은 도움이 됩니다.
pt_br: Isso ajuda muito os Hosts virtualizados com desempenho de network limitado.
zh_hans: 这对带宽有限的虚拟主机帮助极大。

source: Enabling the cached template loader often improves performance drastically, as it avoids compiling each template every time it needs to be rendered. When :setting:`DEBUG = False <DEBUG>`, the cached template loader is enabled automatically. See :class:`django.template.loaders.cached.Loader` for more information.
it: Abilitare il loader dei template in cache spesso migliora drasticamente le performance, perchè evita che il template venga compilato tutte le volte che deve essere mostrato. Quando :setting:`DEBUG = False <DEBUG>`, il loader dei template con cache è abilitato automaticamente. Vedi :class:`django.template.loaders.cached.Loader` per avere più informazioni.
ja: キャッシュされたテンプレートローダーを有効にすると、レンダリングが必要になるたびに各テンプレートをコンパイルする必要がなくなるので、パフォーマンスが劇的に向上します。 :setting:`DEBUG = False <DEBUG>` の場合、キャッシュテンプレートローダーは自動的に有効になります。詳しくは :class:`django.template.loaders.cached.Loader` を参照してください。

source: Error reporting
it: Segnalazione errore
ja: エラーのレポート
ko: 오류 알림
pt_br: Relatório de erro
zh_hans: 发送错误

source: By the time you push your code to production, it's hopefully robust, but you can't rule out unexpected errors. Thankfully, Django can capture errors and notify you accordingly.
it: Nel momento in cui fai push del codice in produzione, si spera sia robusto, ma non puoi aver ragione degli errori che non ti aspetti. Per fortuna, Django cattura gli errori e te li notifica in accordo.
ja: あなたの書いたコードを本番環境に送信するまでは、頑強であることが望まれますが、予期しないエラーを除外することはできません。ありがたいことに、Django はエラーをキャッチして適切にお知らせします。
ko: 코드를 프로덕션으로 푸시할 때쯤이면 강력한 기능이 발휘되지만 예기치 않은 오류를 배제할 수는 없습니다. 고맙게도, Django는 오류를 포착하고 그에 따라 통지할 수 있습니다.
pt_br: Na hora em que o código é enviado para produção, espera-se robustez, mas não podemos ter erros inexperados. Menos mal, o Django pode capturar estes erros e noticá-los de acordo.
zh_hans: 在你将代码推送至生产环境后，你总是期望代码是健壮的，但你并不能控制意料之外的错误。还好，Django 能捕获错误并通知你。

source: Review your logging configuration before putting your website in production, and check that it works as expected as soon as you have received some traffic.
it: Verifica la configurazione del sistema di logging prima di mettere il tuo sito in produzione, e verifica che funzioni come previsto appena inizi a ricevere del traffico.
ja: 本番環境に置く前に、ロギング設定を見直しましょう。また、トラフィックを受け取ったらすぐにそれらが想定通り動作していることを確認してください。
ko: 웹 사이트를 프로덕션 상태로 전환하기 전에 로깅 구성을 검토하고 일부 트래픽이 수신되는 즉시 해당 구성이 제대로 작동하는지 확인합니다.
pt_br: Reveja a sua configuração de log antes de colocar seu website em produção, e verifique se este está funcionando como esperado tão logo receba algum tráfego.
zh_hans: 在将网站放入生产环境前，检查 logging 配置项。在你收到某些信息后，查看其是否按预期运行。

source: See :doc:`/topics/logging` for details on logging.
it: Vedi :doc:`/topics/logging` per dettagli sul logging.
ja: ロギングに関する詳細は :doc:`/topics/logging` を参照してください。
ko: 로깅에 관한 자세한 내용은 :doc:`/topics/logging`을 참조하세요
pt_br: Veja :doc:`/topics/logging` para detalhes de log.
zh_hans: 查看 :doc:`/topics/logging` 了解 logging 的细节。

source: :setting:`ADMINS` and :setting:`MANAGERS`
it: :setting:`ADMINS` e :setting:`MANAGERS`
ja: :setting:`ADMINS` と :setting:`MANAGERS`
ko: :설정:`ADMINS` 그리고 :설정:`MANAGERS`
pt_br: :setting:`ADMINS` e :setting:`MANAGERS`
zh_hans: :setting:`ADMINS` 和 :setting:`MANAGERS`

source: :setting:`ADMINS` will be notified of 500 errors by email.
it: :setting: `ADMINS` riceverà una notifica di errori 500 via e-mail.
ja: :setting:`ADMINS` は、500 エラーの通知を E メールで受け取ります。
ko: 이메일에 의한 500 에러는 :설정:`ADMINS`에게 알려질 것입니다
pt_br: :setting:`ADMINS` será notificado de erros to tipo 500 por email.
zh_hans: 发生 500 错误时，会邮件通知 :setting:`ADMINS`。

source: :setting:`MANAGERS` will be notified of 404 errors. :setting:`IGNORABLE_404_URLS` can help filter out spurious reports.
it: :setting:`MANAGERS` saranno notificati riguardo agli errori 404. :setting:`IGNORABLE_404_URLS` può aiutare a filtrare report spuri.
ja: :setting:`MANAGERS` は、404 エラーの通知を受け取ります。:setting:`IGNORABLE_404_URLS` により不要なレポートをフィルタリングできます。
ko: :설정:`MANAGERS` 오류 404가 표시됩니다. :설정:`IGNORABLE_404_URLS` 가짜 보고서를 필터링하는 데 도움이 될 수 있습니다.
pt_br: :setting:`MANAGERS` serão notificados de erros do tipo 404. :setting:`IGNORABLE_404_URLS` pode ajudar a filtrar erros ilegítimos.
zh_hans: 404 错误会通知 :setting:`MANAGERS`。:setting:`IGNORABLE_404_URLS` 有助于过滤误报。

source: See :doc:`/howto/error-reporting` for details on error reporting by email.
it: Vedi :doc:`/howto/error-reporting` per dettagli sul report degli errori via email.
ja: E メールによるエラーレポートの詳細は、:doc:`/howto/error-reporting` を参照してください。
ko: 이메일로 에러를 알리는 방법에 대한 자세한 내용은 :doc:`/howto/error-reporting` 을 참조하세요
pt_br: Veja :doc:`/howto/error-reporting` para detalhes sobre relatórios de erros por email.
zh_hans: 参考 :doc:`/howto/error-reporting` 了解邮件如何在发生错误时发送报告的细节。

source: Error reporting by email doesn't scale very well
it: La segnalazione degli errori via email non scala molto bene
ja: E メールによるエラーレポートはスケールしない
ko: 메일로 에러를 알려주는것은 좋지 않을수도 있습니다
pt_br: Relatórios de erros por email não escalam muito bem.
zh_hans: 利用邮件报告错误的弹性并不好

source: Consider using an error monitoring system such as Sentry_ before your inbox is flooded by reports. Sentry can also aggregate logs.
it: Considera di usare un sistema di monitoraggio degli errori come Sentry_, prima che la tua inbox sia inondata da errori. Sentry può anche aggregare i log.
ja: あなたの受信箱がレポートであふれかえる前に、Sentry_ などのエラーモニタリングツールの導入を検討してください。Sentry もログを集計することができます。
ko: 보고서에 의해 받은 편지함이 플러시되기 전에 Sentry_와 같은 오류 모니터링 시스템을 사용하는 것이 좋습니다. Sentry는 로그를 집계할 수도 있습니다.
pt_br: Considere usar um sistema de monitoramento de erros tal como o Sentry_ antes que sua caixa postal seja cheia de relatórios. O Sentry pode também agregar logs.
zh_hans: 在收件箱被报告塞满前，考虑下使用错误监控系统，类似 Sentry_。Sentry 还可以聚合日志。

source: Customize the default error views
it: Personalizza la vista degli errori di default
ja: デフォルトのエラービューをカスタムする
ko: 기본 오류 보기 사용자 지정
pt_br: Customize as views de erro padrão
zh_hans: 自定义默认错误视图

source: Django includes default views and templates for several HTTP error codes. You may want to override the default templates by creating the following templates in your root template directory: ``404.html``, ``500.html``, ``403.html``, and ``400.html``. The :ref:`default error views <error-views>` that use these templates should suffice for 99% of web applications, but you can :ref:`customize them <customizing-error-views>` as well.
it: Django include viste e template per molti codici di errore HTTP. Potresti voler fare override dei template creando i seguenti templati nella directory radice dei template: `404.html``, ``500.html``, ``403.html`` e``400.html``. Le :ref:`viste predefinite di errore <error-views>` dovrebbero essere sufficienti per il 99% delle applicazioni ma le puoi anche :ref:`customize them <customizing-error-views>` .
ja: Django には、いくつかの HTTP に対して、デフォルトのビューとテンプレートが用意してあります。ルートのテンプレートディレクトリに以下のテンプレートを作成することで、独自のテンプレートに置き換えることができます: ``404.html``, ``500.html``, ``403.html``, and ``400.html`` 。99％のWebアプリケーションは、これらのテンプレートを使用した :ref:`デフォルトのエラービュー <error-views>` で事足りるはずですが、 :ref:`これらをカスタマイズする <customizing-error-views>` こともできます。

source: How to deploy Django
it: Come distribuire Django
ja: Djangoをデプロイするには

source: Django is full of shortcuts to make web developers' lives easier, but all those tools are of no use if you can't easily deploy your sites. Since Django's inception, ease of deployment has been a major goal.
it: Django è pieno di scorciatoie per rendere più semplice la vita degli sviluppatori ma questi strumenti sono inutili se non puoi fare facilmente deploy dei tuoi siti. Dall'avvento di Django, la facilità di deploy è stato un obiettivo fondamentale.
ja: Django にある非常に多くのショートカットはWeb開発者を楽にしてくれますが、サイトをかんたんにデプロイできなければ、これらのツールのどれも役に立ちません。 当初より Django は、デプロイのしやすさを大きな目標としてきました。

source: There are many options for deploying your Django application, based on your architecture or your particular business needs, but that discussion is outside the scope of what Django can give you as guidance.
it: Ci sono molte opzioni per fare deploy della tua applicazione Django, basate sulle tue architetture o i tuoi bisogni di business, ma questa discussione va oltre lo scopo di quel che Django può darti in termini di guida.
ja: Django アプリケーションのデプロイには、アーキテクチャや特定のビジネスニーズに基づいて多くの選択肢がありますが、その議論は Django がガイダンスとして提供できる範囲外です。
ko: 아키텍처 또는 특정 비즈니스 요구 사항에 따라 Django 애플리케이션을 배포하는 방법에는 여러 가지가 있지만 이러한 논의는 Django가 지침으로 제공할 수 있는 범위를 벗어납니다.

source: Django, being a web framework, needs a web server in order to operate. And since most web servers don't natively speak Python, we need an interface to make that communication happen.
it: Django, essendo un framework web, ha bisogno di un server web per poter funzionare. Visto che la maggior parte dei server web non supporta nativamente Python, abbiamo bisogno di un'interfaccia di comunicazione perché questo sia possibile.
ja: Django は Web フレームワークなので、動作させるには Web サーバが必要です。そして、ほとんどの Web サーバはネイティブでは Python を使用しないので、通信を実現するためのインターフェイスが必要です。
ko: 웹 프레임워크인 Django는 작동하기 위해 웹 서버가 필요합니다. 그리고 대부분의 웹 서버는 기본적으로 Python을 사용하지 않기 때문에, 우리는 그러한 커뮤니케이션이 이루어지도록 인터페이스가 필요합니다.

source: Django currently supports two interfaces: WSGI and ASGI.
it: Django attualmente supporta due interfacce: WSGI e ASGI.
ja: Djangoは現在、WSGIとASGIの2つのインターフェースをサポートしています。
ko: Django는 현재 WSGI와 ASGI의 두 가지 인터페이스를 지원합니다.

source: `WSGI`_ is the main Python standard for communicating between web servers and applications, but it only supports synchronous code.
it: WSGI`_ è lo standard Python per la comunicazione tra web server ed applicazioni ma supporta solo codice sincrono.
ja: `WSGI`_ はウェブサーバーとアプリケーション間で通信するためのPythonの主要な規格です。ただし、同期的なコードしかサポートしていません。

source: `ASGI`_ is the new, asynchronous-friendly standard that will allow your Django site to use asynchronous Python features, and asynchronous Django features as they are developed.
it: `ASGI`_ è il nuovo standard asyncronous-friendly che permetterà al tuo sito Django di usare le feature asincrone di Python e le caratteristiche asincrone di Django man mano che vengono sviluppate.
ja: `ASGI`_ は、Django サイトで非同期の Python 機能と非同期の Django 機能を使えるようにするための、新しい非同期フレンドリーな標準です。
ko: ASGI는 당신의 Django 사이트에서 비동기 Python 기능과 비동기 Django 기능을 개발하면서 사용할 수 있게 해주는 새로운 비동기 친화적인 표준이다.

source: You should also consider how you will handle :doc:`static files </howto/static-files/deployment>` for your application, and how to handle :doc:`error reporting</howto/error-reporting>`.
it: Dovresti anche considerare a come gestirai i :doc:`file statici </howto/static-files/deployment>` per la tua applicazione e come gestirai :doc:`il report degli errori </howto/error-reporting>`.
ja: また、アプリケーションの :doc:`静的ファイル </howto/static-files/deployment>` をどのように扱うか、そして :doc:`エラーレポート </howto/error-reporting>` をどのように扱うかも考慮する必要があります。
ko: 응용 프로그램에 대해 :doc:'static files'를 어떻게 처리할 것인지와 :doc:'error reporting'을 어떻게 처리할 것인지도 고려해야 한다.

source: Finally, before you deploy your application to production, you should run through our :doc:`deployment checklist<checklist>` to ensure that your configurations are suitable.
it: Infine, prima che tu faccia deploy della tua applicazione in produzione, dovresti scorrere la nostra :doc:`checklist di deployment <checklist>` per assicuranti che le tue configurazioni siano idonee.
ja: 最後に、アプリケーションを本番環境にデプロイする前に、 :doc:`デプロイチェックリスト<checklist>` を実行し、設定が適切であることを確認してください。
ko: 마지막으로 애플리케이션을 운영 환경에 배포하기 전에 :doc: '배포 체크리스트'를 실행하여 구성이 적합한지 확인해야 합니다.

source: How to authenticate against Django's user database from Apache
it: Come autenticare da Apache verso il database utenti di Django
ja: Django のユーザーデータベースに対する Apache からの認証

source: Since keeping multiple authentication databases in sync is a common problem when dealing with Apache, you can configure Apache to authenticate against Django's :doc:`authentication system </topics/auth/index>` directly. This requires Apache version >= 2.2 and mod_wsgi >= 2.0. For example, you could:
it: Dal momento che mantenere più database di autenticazione sincronizzati è un problema comune quando si ha a che fare con Apache, è possibile configurare Apache in modo che si autentichi direttamente sul :doc:`sistema di autenticazione </topics/auth/index>` di Django. Questo richiede la versione di Apache >= 2.2 e mod_wsgi >= 2.0. Ad esempio, potresti:
ja: 複数の認証データベースを同期させることは Apache を扱う上でよくある問題なので、 Django の :doc:`認証システム </topics/auth/index>` に対して直接認証するように Apache を設定できます。これには Apache version >= 2.2 と mod_wsgi >= 2.0 が必要です。例えば下記のようなことができます:
ko: Apache를 처리할 때는 여러 인증 데이터베이스를 동기화하는 것이 일반적인 문제이므로 Django의 :doc:'인증 시스템'에 대해 직접 인증하도록 Apache를 구성할 수 있습니다. 이를 위해서는 Apache 버전 > > 2.2 및 mod_wsgi > > 2.0이 필요합니다. 예를 들어 다음과 같은 작업을 수행할 수 있습니다.
pt_br: Uma vez que manter múltiplos banco de dados de autenticação é um problema comum quando se trata do Apache, você pode configurar o Apache para autenticar diretamente no Django :doc:`authentication system </topics/auth/index>`. Isso requer o Apache versão >= 2.2 e mod_wsgi >= 2.0. Por exemplo você poderia:
zh_hans: 使用 Apache 时，保持多个身份认证数据同步是一个常见的问题，你可以让 Apache 直接使用 Django 的 :doc:`验证系统 </topics/auth/index>`。这要求 Apache 版本 >= 2.2，且 mod_wsgi >= 2.0。例如这样：

source: Serve static/media files directly from Apache only to authenticated users.
it: Distribuire files static/media direttamente da Apache solo ad utenti autenticati.
ja: 認証されたユーザにのみ、静的/メディアファイルを Apache から直接提供する。
ko: 정적/미디어 파일을 Apache에서 인증된 사용자에게만 직접 제공합니다.
pt_br: Servir arquivos estáticos/media diretamente do Apache para usuários autenticados
zh_hans: 仅为已授权的用户直接从 Apache 提供 static/media 文件。

source: Authenticate access to a Subversion_ repository against Django users with a certain permission.
it: Autenticare l'accesso un repository Subversion_ per gli utenti Django con un certo permesso.
ja: 特定のパーミッションを持つ Django ユーザに対して、 Subversion_ リポジトリへのアクセスを認証する。
ko: 특정 사용 권한을 가진 Django 사용자에 대해 Subversion_repository에 대한 액세스를 인증합니다.
pt_br: Autenticar o acesso a um respositório Subversion_ para usuários Django com uma certa permissão.
zh_hans: 仅为有特定权限的 Django 用户提供 Subversion 仓库访问。

source: Allow certain users to connect to a WebDAV share created with mod_dav_.
it: Permettere ad alcuni utenti di connettersi ad una condivisione WebDAV creata con mod_dav_.
ja: mod_dav_ で作成された WebDAV 共有に特定のユーザが接続できるように許可する。
ko: 특정 사용자가 mod_dav_로 생성된 WebDAV 공유에 연결할 수 있습니다.
pt_br: Possibilita certos usuários a conectar a um compartilhamento WebDav criado com mod_dav_.
zh_hans: 允许某些用户连接到 mod_dav_ 创建的 WebDAV 共享。
