Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Django can also be configured to email errors about broken links (404 "page not found" errors). Django sends emails about 404 errors when:
it: Django può essere configurato per inviare via email errori relativi ai link non funzionanti (errore 404 "pagina non trovata"). Django invia email relative ad errori 404 quando:
ja: Django は、リンク切れに関するエラー (404 "page not found" エラー) をメールで送信するように設定することもできます。Django は以下の場合に 404 エラーに関するメールを送ります:
ko: 끊어진 링크에 대한 전자 메일 오류(404 "페이지 없음" 오류)로 Django를 구성할 수도 있습니다. Django는 다음과 같은 경우 약 404개의 오류를 이메일로 전송합니다.
pt_br: O Django pode ser configurado para enviar emails com erros sobre links quebrados (erros 404 "página não encontrada"). O Django envia emails com erros 404 quando:
zh_hans: Django 也能配置成为已失效的连接发送错误邮件（404 "page not found" 错误）。Django 发送 404 错误邮件的条件：

source: :setting:`DEBUG` is ``False``;
it: :setting:`DEBUG` è ``False``;
ja: :setting:`DEBUG` が ``False`` のとき;
ko: :설정:`DEBUG` 는 "거짓"이다
pt_br: :setting:`DEBUG` é ``False``;
zh_hans: :setting:`DEBUG` 为 ``False``；

source: Your :setting:`MIDDLEWARE` setting includes :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
it: La tua impostazione :setting:`MIDDLEWARE` include :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.
ja: :setting:`MIDDLEWARE` 設定に :class:`django.middleware.common.BrokenLinkEmailsMiddleware` が含まれているとき。
ko: 설정:`MIDDLEWARE` 설정은 :class:`django.middleware.common.BrokenLinkEmailsMiddleware`.을 포함된다
zh_hans: :setting:`MIDDLEWARE` 配置包括 :class:`django.middleware.common.BrokenLinkEmailsMiddleware`。

source: If those conditions are met, Django will email the users listed in the :setting:`MANAGERS` setting whenever your code raises a 404 and the request has a referer. It doesn't bother to email for 404s that don't have a referer -- those are usually people typing in broken URLs or broken web bots. It also ignores 404s when the referer is equal to the requested URL, since this behavior is from broken web bots too.
it: Se queste condizioni sono soddisfatte, Django invierà un'e-mail agli utenti elencati nell'impostazione :setting:`MANAGERS` ogni volta che il tuo codice genera un 404 e la richiesta ha un referer. Non si preoccupa di inviare e-mail per i 404 che non hanno un referer: di solito si tratta di persone che digitano URL non funzionanti o bot Web non funzionanti. Ignora anche i 404 quando il referer è uguale all'URL richiesto, poiché questo comportamento è dovuto anche a bot web rotti.
ja: これらの条件が満たされると、Django はあなたのコードが 404 を発生させ、そのリクエストがリファラを持っている場合、 :setting:`MANAGERS` 設定にリストされているユーザにメールを送ります。リファラを持たない 404 にはわざわざメールを送りません。それは大抵、壊れた URL を入力したユーザか、壊れた Web ボットです。また、リファラがリクエストされた URL と同じ場合の 404 も無視します。

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it toward the top of your :setting:`MIDDLEWARE` setting.
it: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` deve essere inserita prima di ogni altro middleware che intereccetti gli errori 404, come :class:`~django.middleware.locale.LocaleMiddleware` o :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Inseriscilo verso l'inizio del tuo setting :setting:`MIDDLEWARE`.
ja: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` は、 :class:`~django.middleware.locale.LocaleMiddleware` や :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` のような 404 エラーを検出する他のミドルウェアよりも前に表示する必要があります。これを :setting:`MIDDLEWARE` 設定の一番上に置いてください。

source: You can tell Django to stop reporting particular 404s by tweaking the :setting:`IGNORABLE_404_URLS` setting. It should be a list of compiled regular expression objects. For example::
it: Puoi dire a Django di smettere di segnalare particolari 404 modificando l'impostazione :setting:`IGNORABLE_404_URLS`. Dovrebbe essere un elenco di oggetti di espressioni regolari compilati. Per esempio::
ja: 特定の 404 を報告しないように Django に指示するには、 :setting:`IGNORABLE_404_URLS` 設定をいじります。これはコンパイルされた正規表現オブジェクトのリストでなければなりません。例えば:
ko: : setting을 수정하여 Django에게 특정 404s에 대한 보고를 중지하라고 지시할 수 있습니다.IGNORABLE_404_URL의 설정입니다. 컴파일된 정규식 개체의 목록이어야 합니다.
pt_br: Você pode dizer ao Django para parar de reportar 404s ajustando a definição do :setting:`IGNORABLE_404_URLS`. Isso deve ser uma lista de objetos compilados de expressões regulares. Por exeplo::
zh_hans: 你可以通过调整配置项 :setting:`IGNORABLE_404_URLS` 让 Django 忽略某些 404s。内容应该是已编译的正则表达式的列表。例子::

source: In this example, a 404 to any URL ending with ``.php`` or ``.cgi`` will *not* be reported. Neither will any URL starting with ``/phpmyadmin/``.
it: In questo esempio, un 404 a qualsiasi URL che finisce con ``.php`` oppure ``.cgi`` *non* verrà riportato.Inoltre nessuna URL inizierà con `/phpmyadmin/``.
ja: この例では、 ``.php`` または ``.cgi`` で終わる URL への 404 は報告されません。また、 ``/phpmyadmin/`` で始まるURLも報告されません。
ko: : 설정을 수정하여 Django에게 특정 404에 대한 보고를 중지하도록 지시할 수 있습니다.IGNERGABLE_404_URL에 대한 설정. 컴파일된 정규식 개체 목록이어야 합니다. 예:
pt_br: Neste exemplo, um 404 para qualquer URL com ``.php``ou ``.cgi`` *não* será reportado. Nem nenhuma URL começando com ``/phpadmin/``.
zh_hans: 在本例中，对以 ``.php`` 或 ``.cgi`` 结尾的 URL 的 404 错误将 *不会* 被报告。以 ``phpmyadmin`` 开头的也不会被报告。

source: The following example shows how to exclude some conventional URLs that browsers and crawlers often request::
it: Gli esempi seguenti mostrano come escludere alcune URLs standard che i browser ed i crawler richiedono con frequenza::
ja: 以下は、ブラウザやクローラがよくリクエストする従来の URL を除外する方法の例です:
ko: 다음 예에서는 브라우저 및 크롤러가 자주 요청하는 일부 기존 URL을 제외하는 방법을 보여 줍니다.
pt_br: O exemplo seguinte mostra como excluir algumas URLs convencionais que "borwsers" e "crawlers" requisitam com frequência.
zh_hans: 下面的例子展示了如何排除一些浏览器和爬虫经常访问的传统 URL::

source: (Note that these are regular expressions, so we put a backslash in front of periods to escape them.)
it: (Nota bene che queste sono espressioni regolari, quindi mettiamo un backslash prima del punto per assicurarci l'interpretazione come carattere)
ja: (これらは正規表現なので、ピリオドの前にバックスラッシュを入れてエスケープしていることに注意してください)
ko: (참고로 이것들은 정규 표현식입니다. 그래서 우리는 그것들을 피하기 위해 기간 앞에 역슬래시를 붙였습니다.)
pt_br: (repare que essas são expressões regulares, então coloca-se uma barra invertida na frente dos pontos para que não sejam substituidos.)
zh_hans: （注意，这些都是正则表达式，所以我们用反斜杠转义了点号。）

source: If you'd like to customize the behavior of :class:`django.middleware.common.BrokenLinkEmailsMiddleware` further (for example to ignore requests coming from web crawlers), you should subclass it and override its methods.
it: Se desideri personalizzare ulteriormente il comportamento di :class:`django.middleware.common.BrokenLinkEmailsMiddleware` (ad esempio per ignorare le richieste provenienti dai web crawler), dovresti ereditare la classe e sovrascrivere i suoi metodi.
ja: :class:`django.middleware.common.BrokenLinkEmailsMiddleware` の動作をさらにカスタマイズしたい場合(例えば、ウェブクローラからのリクエストを無視したい場合など)は、サブクラスを作成し、そのメソッドをオーバーライドしてください。
ko: :class:`django.middleware.common의 동작을 사용자 지정하려면끊어진 링크 이메일 미들웨어의 추가(예: 웹 크롤러에서 오는 요청을 무시하려면)를 하위 분류하고 메소드를 재정의해야 합니다.
pt_br: Se quer personalizar o comportamentdo do :class:`django.middleware.common.BrokenLinkEmailsMiddleware` mais adiante (por exemplo para ignorar requisições vindas de rastreadores web), você deve criar uma subclasse e sobrescreva seus métodos.
zh_hans: 若后续你想自定义 :class:`django.middleware.common.BrokenLinkEmailsMiddleware` 的行为（例如忽略来自网络爬虫的请求），你需要继承该类，并重写方法。

source: 404 errors are logged using the logging framework. By default, these log records are ignored, but you can use them for error reporting by writing a handler and :doc:`configuring logging </topics/logging>` appropriately.
it: Gli errori 404 vengono registrati utilizzando il logging framework. Di default, queste registrazioni sul log vengono ignorate, ma puoi usarle per la segnalazione di errori scrivendo un handler :doc:`configuring logging </topics/logging> ' in modo appropriato.
ja: 404エラーはロギングフレームワークを使って記録されます。デフォルトではこれらのログレコードは無視されますが、ハンドラを書いて :doc:`ロギングを適切に設定する</topics/logging>` ことで、エラー報告に使うことができます。
ko: 404개의 오류는 로깅 프레임워크를 사용하여 기록됩니다. 기본적으로 이러한 로그 레코드는 무시되지만, 처리기와 :doc:'로그 구성'을 적절하게 작성하여 오류 보고에 사용할 수 있습니다.
pt_br: Erros 404 são logados usando o framework logging. Por padrão, estes registros de log são ignorados, mas você pode usá-los para relatório de erros sobrescrevendo o "handlers" e o :doc:`configuring logging </topics/logging>` apropriadamente.
zh_hans: 404 错误由 logging 框架报告。默认情况下，这些日志记录被忽略了，但你能通过编写一个处理器和 :doc:`配置 logging </topics/logging>` 让它们报告错误。

source: Filtering error reports
it: Filtra i report di errore
ja: エラーレポートをフィルタリングする
ko: 오류 보고서 필터링
pt_br: Filtrando relatórios de erros
zh_hans: 过滤错误报告

source: Filtering sensitive data is a hard problem, and it's nearly impossible to guarantee that sensitive data won't leak into an error report. Therefore, error reports should only be available to trusted team members and you should avoid transmitting error reports unencrypted over the internet (such as through email).
it: Il filtraggio dei dati sensibili è un problema difficile ed è quasi impossibile garantire che i dati sensibili non vengano trasmessi in un report di errore. Pertanto, i report di errore dovrebbero essere disponibili solo per i membri del team affidabili e dovresti evitare di trasmettere report di errore non crittati su Internet (ad esempio tramite e-mail).
ja: 機密データのフィルタリングは難しい問題であり、機密データがエラーレポートに漏れないことを保証することはほとんど不可能です。したがって、エラーレポートは信頼できるチームメンバーのみが利用できるようにし、インターネット上で暗号化されていないエラーレポートを送信することは避けるべきです（電子メールなど）。

source: Filtering sensitive information
it: Filtraggio informazioni sensibili
ja: 機密情報のフィルタリング
ko: 중요한 정보 필터링
pt_br: Filtrando Informações sensíveis
zh_hans: 过滤敏感数据

source: Error reports are really helpful for debugging errors, so it is generally useful to record as much relevant information about those errors as possible. For example, by default Django records the `full traceback`_ for the exception raised, each `traceback frame`_’s local variables, and the :class:`~django.http.HttpRequest`’s :ref:`attributes<httprequest-attributes>`.
it: I report sugli errori sono davvero utili per il loro debug, quindi è generalmente utile registrare quante più informazioni possibili a riguardo. Ad esempio, per impostazione predefinita Django registra il `full traceback`_ per l'eccezione sollevata, le variabili locali di ogni `traceback frame`_ e i :ref:`attributes<httprequest-attributes>` di :class:`~django.http.HttpRequest`.
ja: エラーレポートはエラーのデバッグにとても役立つので、通常は、エラーに関する関連情報をできるだけ多く記録しておくと便利です。例えば、デフォルトでは Django は発生した例外の `full traceback`_ や、各 `traceback frame`_ のローカル変数、 :class:`~django.http.HttpRequest` の :ref:`属性 <httprequest-attributes>` を記録します。
ko: 오류 보고서는 오류를 디버깅하는 데 매우 유용하므로 일반적으로 이러한 오류에 대한 관련 정보를 가능한 많이 기록하는 것이 유용합니다. 예를 들어, 기본적으로 Django는 제기된 예외에 대해 'full traceback'_, 각 'traceback frame'_의 로컬 변수 및 :class를 기록합니다.'~django.the'HttpRequest's:ref:'attributes1'입니다.
pt_br: Relatórios de erros são de grande ajuda para detectar falhas, sempre é util registrar o máximo de informação sobre falhas quanto possível. Por exemplo, por padrão o Django registra
zh_hans: 错误报告对于调试错误来说超级有用，所以通常尽可能多的记录关键信息。例如，Django 默认记录了抛出异常的 `完整调用栈`_，每个 `调用栈层`_ 的局部变量，以及 :class:`~django.http.HttpRequest` 的 :ref:`属性 <httprequest-attributes>`。

source: However, sometimes certain types of information may be too sensitive and thus may not be appropriate to be kept track of, for example a user's password or credit card number. So in addition to filtering out settings that appear to be sensitive as described in the :setting:`DEBUG` documentation, Django offers a set of function decorators to help you control which information should be filtered out of error reports in a production environment (that is, where :setting:`DEBUG` is set to ``False``): :func:`sensitive_variables` and :func:`sensitive_post_parameters`.
it: Comunque, a volte alcuni tipi di informazioni possono essere troppo sensibili e quindi non può essere appropriato tenere traccia ad esempio, della password o del numero di carta di credito di un utente. Quindi oltre a filtrare le impostazioni che sono sensibili come descritto nella documentazione :setting:`DEBUG`, Django offre una serie di decoratori di funzioni che ti aiutano a controllare quali informazioni debbano essere filtrate sul report degli errori in ambiente di produzione (cioè con :setting:`DEBUG` impostato a ``False``): :func:`sensitive_variables` e :func:`sensitive_post_parameters`.
ja: しかし、例えばユーザのパスワードやクレジットカード番号のように、ある種の情報は機密性が高すぎるため、記録するのが適切でない場合があります。そこで Django では、 :setting:`DEBUG` ドキュメントで説明されているように、機密性が高そうな設定をフィルタリングすることに加えて、本番環境 (つまり、 :setting:`DEBUG` が ``False`` に設定されている場合) でエラーレポートからフィルタリングされる情報を制御するのに役立つ関数デコレータを提供しています。 :func:`sensitive_variables` と :func:`sensitive_post_parameters` です。
ko: 그러나 때로는 특정 유형의 정보가 너무 민감하여 사용자의 암호 또는 신용 카드 번호와 같이 추적하기에 적절하지 않을 수 있다. 따라서 :설정의 설명에 따라 중요한 설정을 필터링하는 것 외에도 다음과 같은 작업을 수행할 수 있습니다.'DEBUG' 설명서인 Django는 실운영 환경에서 오류 보고서(여기서: setting: setting:디버그는 func:'sensitive_variables'와 func:'sensitive_post_parameters'로 설정되어 있다.
zh_hans: 然而，有时候某些信息会涉及敏感内容，因此不适合写入调用栈。例如，用户的密码或信用卡号。故此，为了过滤 :setting:`DEBUG` 文档中描述的敏感内容，Django 提供了一系列的函数装饰器，帮你控制在生产环境（即 :setting:`DEBUG` 为 ``False``）下应该从错误报告中过滤掉哪些信息：:func:`sensitive_variables` 和 :func:`sensitive_post_parameters`。

source: If a function (either a view or any regular callback) in your code uses local variables susceptible to contain sensitive information, you may prevent the values of those variables from being included in error reports using the ``sensitive_variables`` decorator::
it: Se una funzione (sia essa una view o una callback regolare) nel tuo codice usa variabili locali suscettibili di contenere infomazioni sensibili, puoi evitare che i valori di quelle variabili vengano inclusi nei report degli errori usando il decoratore ``sensitive_variables``::
ja: コード内の関数（ビューまたは通常のコールバック）が機密情報を含む可能性のあるローカル変数を使用している場合、 ``sensitive_variables`` デコレータを使用することで、それらの変数の値がエラーレポートに含まれないようにすることができます:
ko: 코드의 함수(보기 또는 일반 콜백)가 중요한 정보를 포함할 수 있는 로컬 변수를 사용하는 경우 "sensitive_variables" decorator를 사용하여 해당 변수 값이 오류 보고서에 포함되지 않도록 방지할 수 있습니다.
pt_br: Se uma função (uma view ou callback) no seu código usa variavéis locais que venham guardar informação sigilosa, voce deve reguasdar o valor dessas variavéis de serem expostas nos relatórios de erros usando o decorator ''sensitive_variables''
zh_hans: 若代码中的一个函数（也可能是视图或定期回调）使用容易包含敏感信息的本地变量，你可以用 ``sensitive_variables`` 装饰器阻止错误报告包含这些变量的值::

source: In the above example, the values for the ``user``, ``pw`` and ``cc`` variables will be hidden and replaced with stars (``**********``) in the error reports, whereas the value of the ``name`` variable will be disclosed.
it: Nell'esempio sopra, i valori delle variabili ``user``, ``pw`` e ``cc`` verranno nascosti e sostituiti con asterischi (``**********``) nei report di errore, mentre verrà mostrato il valore della variabile ``name``.
ja: 上記の例では、 ``user``、``pw``、``cc`` の値は非表示になり、エラーレポートではアスタリスク (``*******``) に置き換えられますが、 ``name`` 変数の値は公開されます。
ko: 위의 예에서 "user", "pw" 및 "cc" 변수의 값은 오류 보고에 숨겨져 별('*************)로 대체되며 "name" 변수의 값은 공개된다.

source: To systematically hide all local variables of a function from error logs, do not provide any argument to the ``sensitive_variables`` decorator::
it: Per nascondere sistematicamente tutte e variabili locali di una funzione dal sistema di gestione degli errori nei log, non indicare alcun argomento al decoratore ``sensitive_variables``::
ja: 関数のすべてのローカル変数をエラーログから徹底的に隠す場合は、引数なしで ``sensitive_variables`` デコレーターを使います:
ko: 오류 로그에서 함수의 모든 로컬 변수를 체계적으로 숨기려면 "sensitive_variables" decorator에 어떤 인수도 제공하지 마십시오.
pt_br: Para esconder sistematicamente todas as variáveis locais de uma fução dos logs de erros, não forneça argumento ao decorador ``sensitive_variables``::
zh_hans: 要在错误日志中系统的隐藏所有的局部变量，不要向 ``sensitive_variables`` 装饰器传入任何参数::

source: When using multiple decorators
it: Quando si utilizzano decoratori multipli
ja: 複数のデコレータを使うとき
ko: 여러 개의 장식자를 사용하는 경우
pt_br: Quando usar multiplos decorators
zh_hans: 同时使用多个装饰器时

source: If the variable you want to hide is also a function argument (e.g. '``user``’ in the following example), and if the decorated function has multiple decorators, then make sure to place ``@sensitive_variables`` at the top of the decorator chain. This way it will also hide the function argument as it gets passed through the other decorators::
it: Se la variabile che vuoi nascondere è anche un argomento di funzione (ad es. ''``user``' nell'esempio seguente), e se la funzione decorata ha più decoratori, assicurati di posizionare ``@sensitive_variables`` in cima alla serie di decoratori. In questo modo nasconderà anche l'argomento della funzione mentre viene passato attraverso gli altri decoratori::
ja: 非表示にしたい変数が関数の引数でもある場合 (例えば、次の例では '``user``') 、そしてデコレートされた関数に複数のデコレーターがある場合は、 ``@sensitive_variables`` をデコレーターチェインの先頭に置くようにしてください。こうすることで、関数の引数が他のデコレータに渡される際に、その引数を隠すことができます:
ko: 숨기려는 변수가 함수 인수(예: 다음 예에서는 'user' user')이고, 장식된 함수에 여러 개의 장식기가 있는 경우, 반드시 "@sensitive_variables"를 장식자 체인의 맨 위에 놓아야 한다. 이렇게 하면 다른 장식자를 통과할 때 함수 인수도 숨겨집니다.
pt_br: Se a variável que você quer esconder é também um argumento da função (ex.: ``user`` no exemplo a seguir), e si a função "decorada" tem múltimplos "decorators", então tenha certeza de posiionar o ``@sensitive_variables`` no topo da lista de "decorators". Desta maneira, serão escondidos também o argumento da função enquanto passa pelos outros "decorators"::
zh_hans: 若你想隐藏的变量还是一个函数参数（下例中 '``user``’），且被装饰的函数已拥有好几个装饰器，确保将 ``@sensitive_variables`` 置于最上面。这样，它就也能隐藏函数参数了，因为它穿过其它装饰器::

source: Support for wrapping ``async`` functions was added.
ja: ``async`` 関数のラップをサポートしました。

source: If one of your views receives an :class:`~django.http.HttpRequest` object with :attr:`POST parameters<django.http.HttpRequest.POST>` susceptible to contain sensitive information, you may prevent the values of those parameters from being included in the error reports using the ``sensitive_post_parameters`` decorator::
it: Se una delle tue view riceve un oggetto :class:`~django.http.HttpRequest` con :attr:`POST parameters<django.http.HttpRequest.POST>` suscettibile di contenere informazioni riservate, puoi impedire che i valori di tali parametri siano inclusi nei report di error utilizzando il decoratore ``sensitive_post_parameters``::
ja: もしビューの 1 つが :class:`~django.http.HttpRequest` オブジェクトを :attr:`POST parameters<django.http.HttpRequest.POST>` で受け取った場合、機密情報が含まれている可能性があるので、 ``sensitive_post_parameters`` デコレータを使って、エラーレポートにそのパラメータの値が含まれないようにすることができます:
ko: 만약 당신의 견해를 피력하는을 받는다:수업:`~django.http.HttpRequest` 개체:항목을 보강:`POSTparameters<django.http.HttpRequest.POST>`민감한 정보를 담아 취약해 당신은 예방할 수 있다.이런 변수들의 오류 보고서도``sensitive_post_parameters"실내 장식가를 사용하여 포함되는에서 값::.
pt_br: Se uma de suas "views" recebe um objeto :class:`~django.http.HttpRequest` com :attr:`parâmetros do POST<django.http.HttpRequest.POST>` suscetível a conter informação sensível, é possível evitar que os valores destes parâmetros sejam incluídos no relatório de erros usando o "decorator" ``sensitive_post_parameters`` ::
zh_hans: 若视图收到一个包含 :attr:`POST 参数 <django.http.HttpRequest.POST>` 的 :class:`~django.http.HttpRequest` 对象，参数中极有可能内含敏感信息。你可以通过 ``sensitive_post_parameters`` 装饰器避免这些参数的值被包括在错误报告中::

source: In the above example, the values for the ``pass_word`` and ``credit_card_number`` POST parameters will be hidden and replaced with stars (``**********``) in the request's representation inside the error reports, whereas the value of the ``name`` parameter will be disclosed.
it: Nell'esempio di cui sopra, i valori dei parametri di POST per ``pass_word`` e ``credit_card_number`` saranno nascosti e rimpiazzati con degli asterischi (``**********``) nella rappresentazione della request nel report degli errori, dove invece il valore del parametro ``name`` sarà mostrato.
ja: 上の例では、 ``pass_word`` と ``credit_card_number`` のPOSTパラメータの値は隠され、エラーレポート内のリクエストの表現ではアスタリスク (``*******``) に置き換えられますが、 ``name`` パラメータの値は公開されます。
ko: 위의 예에서 "pass_word"와 "credit_card_number" POST 매개 변수의 값은 오류 보고 내 요청 표현에 숨겨져 별('********')로 대체되며, "이름" 매개 변수의 값은 공개된다.

source: To systematically hide all POST parameters of a request in error reports, do not provide any argument to the ``sensitive_post_parameters`` decorator::
it: Per nascondere sistematicamente tutti i parametri di una richiesta POST nel report degli errori, non inserire alcun parametro al decoratore ``sensitive_post_parameters`` ::
ja: エラーレポートでリクエストの全てのPOSTパラメータを徹底的に隠す場合は、 引数なしで ``sensitive_post_parameters`` デコレータを使います:
ko: 오류 보고서에서 요청의 모든 POST 매개 변수를 체계적으로 숨기려면 ``sensitive_post_parameters" 장식자에게 어떤 인수도 제공하지 마십시오.
pt_br: Para esconder sistematicamente todos os parâmetros do POST de uma requisição em um relatório de erro relatório, não forneça nenhum arguento para o "decorator" ``sensitive_post_parameters``::
zh_hans: 要在错误报告中系统的屏蔽所有 POST 参数，不要给 ``sensitive_post_parameters`` 装饰器提供任何参数::

source: All POST parameters are systematically filtered out of error reports for certain :mod:`django.contrib.auth.views` views (``login``, ``password_reset_confirm``, ``password_change``, and ``add_view`` and ``user_change_password`` in the ``auth`` admin) to prevent the leaking of sensitive information such as user passwords.
it: Tutti i parametri in POST sono sistematicamente filtrati dai report degli errori per alcune view :mod:`django.contrib.auth.views` (``login``, ``password_reset_confirm``, ``password_change``, ``add_view`` e ``user_change_password`` nell'amministrazione ``auth``) per prevenire la fuoriuscita di informazioni sensibili come ad esempio le password utente.
ja: 特定の :mod:`django.contrib.auth.views` のビュー (``auth`` admin 内の ``login``, ``password_reset_confirm``, ``password_change``, ``auth`` admin の ``add_view`` と ``user_change_password``) のエラーレポートから、すべての POST パラメータが徹底的にフィルタされ、ユーザパスワードのような機密情報の漏洩を防ぎます。
ko: 모든 POST 매개 변수는 특정:mod:'django.contrib에 대한 오류 보고서에서 체계적으로 필터링됩니다.auth.password, ``password_reset_password", "password_changes", "add_view" 및 "user_change_password in ``auth 관리자"에서 보기 때문에 사용자 암호와 같은 중요한 정보가 유출되는 것을 방지할 수 있다.
pt_br: Todos os parâmentros do POST são sistematicamente filtrados do relatório para certas "views" :mod:`django.contrib.auth.views` (``login``, ``password_reset_confirm``, ``password_change``, e ``add_view`` e ``user_change_password`` no ``auth`` admin) para prevenir o vazamento de informação sensível tal como as senhas de usuários.
zh_hans: 为了避免敏感信息的泄露（例如账号密码）， 所有传入认证视图 :mod:`django.contrib.auth.views` （``login``， ``password_reset_confirm``， ``password_change``， and ``add_view`` 和 ``auth`` 后台中的 ``user_change_password``）的 POST 参数都在错误报告中经过系统过滤。

source: Custom error reports
it: Rapporti di errore personalizzati
ja: カスタムエラーレポート
ko: 사용자 정의 오류 리포트
pt_br: Relatórios de erros personalizados
zh_hans: 自定义错误报告
