Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: We can now use ``foo__ne`` for any field ``foo``. You will need to ensure that this registration happens before you try to create any querysets using it. You could place the implementation in a ``models.py`` file, or register the lookup in the ``ready()`` method of an ``AppConfig``.
it: Adesso possiamo usare ``foo__ne`` per ogni campo ``foo``. Ti devi assicurare che questa registrazione avvenga prima che cerchi di creare un qualunque queryset che la usi. Puoi mettere l'implementazione in un file ``models.py`` , o registrare il criterio di ricerca nel metodo ``ready()`` di un ``AppConfig``.
ja: これ以降、どのようなフィールドであっても ``foo`` に対しては ``foo__ne`` が利用できます。なお、これを用いるクエリーセットを生成するならば、それ以前にルックアップの登録を行っておく必要があります。実装する場所は ``models.py`` ファイル内で行ってもよいし、``AppConfig`` 内の ``ready()`` メソッドにてルックアップの登録を行うのでも構いません。
ko: 이제 우리는 ``foo_ne"를 어떤 "foo" 의 어떠한 필드에서도 사용할 수 있다. 이 등록을 사용하여 쿼리 세트를 만들기 전에 이 등록이 수행되는지 확인해야 합니다. 당신은 그 실행을 ``models.py"파일 안에 구현할 수 있고, "AppConfig"안의 "ready()함수를 사용하여 조회를 등록할 수 있다.
pt_br: Agora podemos usar `` foo__ne`` para qualquer campo `` foo``. Tenha certeza de registrar antes de tentar criar qualquer "querysets" que o use. É possível colocar a implementação no `` models.py``, ou registar a lookup no método ``ready()`` do `` AppConfig``.
zh_hans: 现在我们可以用 ``foo__ne`` 来代表 ``foo`` 的任意字段。你需要确保注册行为发生在创建任意的 queryset 之前。你可以在 ``models.py`` 文件内设置它，或者在 ``AppConfig`` 的 ``ready()`` 方法中注册它。

source: Taking a closer look at the implementation, the first required attribute is ``lookup_name``. This allows the ORM to understand how to interpret ``name__ne`` and use ``NotEqual`` to generate the SQL. By convention, these names are always lowercase strings containing only letters, but the only hard requirement is that it must not contain the string ``__``.
it: Dando un'occhiata più attenta all'implementazione, il primo attributo richiesto é ``lookup_name``. Questo permette alla ORM di capire come interpretare ``name__ne`` e usare ``NotEqual`` per generare il codice SQL. Per convenzione, questi nomi sono sempre stringhe in minuscolo contenenti solo lettere, ma l'unico requisito mandatorio è che non contengano la stringa ``__``.
ja: 実装の詳細について見ると、最初に必要な属性は ``lookup_name`` です。この属性があると、ORM が ``name_ne`` を解釈できるようになり、``NotEqual`` を使って SQL を生成できます。慣習として、こうした名前は常に小文字のアルファベットのみからなる文字列にしますが、必ず守らなければならない制約は、文字列 ``__`` を決して含んではならないということです。
ko: 그 구현을 자세히 들여다보면, 가장 먼저 요구되는 속성은 ``lookup_name"이다. 이를 통해 ORM은 ``name__ne"의 해석 방법을 이해하고 "Not Equal"을 사용하여 SQL을 생성할 수 있다. 관례적으로, 이 이름들은 항상 소문자 문자열로 문자만 포함하고 있지만, 유일한 어려운 요구조건은 문자열 "__"를 포함해서는 안 된다는 것이다.
pt_br: Olhando mais perto da implementação, o primeiro atributo obrigatório é `` lookup_name``. Isso permite que o ORM entenda como interpretar `` name__ne`` e use `` NotEqual`` para gerar o SQL. Por convenção, estes nomes são sempre em strings caixa baixa contendo apenas letras, mas a única exigência é que não contenha a string `` __``.
zh_hans: 仔细观察实现过程，第一个要求的属性是 ``lookup_name``。它能让 ORM 理解如何编译 ``name_ne`` 并使用 ``NotEqual`` 来建立 SQL 语句。按照惯例，这些名字应该总是仅包含小写字母的字符串，但是绝对不能包含双下划线 ``__``。

source: We then need to define the ``as_sql`` method. This takes a ``SQLCompiler`` object, called ``compiler``, and the active database connection. ``SQLCompiler`` objects are not documented, but the only thing we need to know about them is that they have a ``compile()`` method which returns a tuple containing an SQL string, and the parameters to be interpolated into that string. In most cases, you don't need to use it directly and can pass it on to ``process_lhs()`` and ``process_rhs()``.
it: Poi dobbiamo definire il metodo ``as_sql`` . Questo usa un oggetto ``SQLCompiler`` , chiamato ``compiler``, e la connessione al database attivo. Gli oggetti ``SQLCompiler`` non sono documentati, ma la sola cosa che dobbiamo sapere a loro riguardo è che hanno un metodo ``compile()`` che restituisce una tupla contenente una stringa SQL, e i parametri da interpolare in quella stringa. Nella maggior parte dei casi, non hai necessità di usarli direttamente e puoi passarli a ``process_lhs()`` e ``process_rhs()``.
ja: 次に、"as_sql" メソッドを定義する必要があります。これには "compiler" という "SQL Compiler" オブジェクトと、アクティブなデータベース接続を必要とします。"SQL Compiler" オブジェクトについてのドキュメントはありませんが、それがSQL文字列を含むタプルと文字列に挿入されるパラメータを返す ``compile()`` メソッドを持つ、ということだけ知っていれば十分です。ほとんどの場合、これを直接用いる必要はなく、``process_lhs()`` および ``process_rhs()`` に渡すことができます。
ko: 그다음 우리는 ``as_sql" 방식을 정의할 필요가 있다. 이것은"compiler"라고 불리는 ``SQLCompiler"객체와 활성화된 데이터베이스 연결이 필요하다. "SQL Compiler" 객체는 문서화되어 있지 않지만 그것들에 대해 우리가 알아야 할 것은 SQL 문자열이 들어 있는 튜플을 반환하는 ``compile()" 방법과 그 문자열에 삽입될 파라미터가 있다는 것뿐이다. 대부분의 경우 직접 사용할 필요가 없으며 ``process_lhs()"와 ``process_rhs()"로 직접전달할 수 있다.
zh_hans: 之后我们需要定义 ``as_sql`` 方法。此方法需要一个 ``SQLCompiler`` 对象, 被叫做 ``compiler``，和一个有效的数据库连接。``SQLCompller`` 对象没有文档，我们只需要知道它有一个 ``compile()`` 方法可以返回一个包括 SQL 字符串的元组，和插入这个字符串的参数。大部分情况下，你不需要直接使用这个对象你可以把它传送给 ``process_lhs()`` 和 ``process_rhs()``。

source: A ``Lookup`` works against two values, ``lhs`` and ``rhs``, standing for left-hand side and right-hand side. The left-hand side is usually a field reference, but it can be anything implementing the :ref:`query expression API <query-expression>`. The right-hand is the value given by the user. In the example ``Author.objects.filter(name__ne='Jack')``, the left-hand side is a reference to the ``name`` field of the ``Author`` model, and ``'Jack'`` is the right-hand side.
it: Un ``Lookup`` lavora verso due valori, ``lhs`` e ``rhs``, che rappresentano la parte sinistra e la parte destra. La parte sinistra di solito è un riferimento a un campo, ma può essere qualunque cosa implementi una :ref:`query expression API <query-expression>`. La parte destra è il valore dato dall'utente. Nell'esempio ``Author.objects.filter(name__ne='Jack')``, la parte sinistra è un riferimento al campo ``name`` del modello ``Author`` , e ``'Jack'`` è la parte destra.
ja: 2つの値に対して動作するルックアップ ``lhs`` と ``rhs`` は、それぞれ left-hand side (左辺) と right-hand side (右辺) を表します。左辺は通常フィールド参照ですが、:ref:`クエリ式 API <query-expression>` を実装するものであれば何でもかまいません。右辺はユーザーから与えられた値です。``Author.objects.filter(name__ne='Jack')`` の例では、左辺は ``Author`` モデルの ``name`` フィールドへの参照で、右辺は ``'Jack'`` です。
ko: "Lookup"은 "lhs" 와 "rhs"라는 값에서 동작하는데, 각각 왼쪽과 오른쪽을 뜻한다. 왼쪽은 대부분 필드 레퍼런스이지만, :ref:'쿼리 표현 API' 를 구현하는 모든 것이 될 수 있습니다. 오른쪽 값은 유저에 의해서 정해진다. "Author.objects.filter(name__ne='Jack)" 예시에서, 왼쪽은 "Author" 모델의 "name" 필드의 레퍼런스이고, 오른쪽은 "Jack"이다.
pt_br: A ``Lookup`` trabalha em dois valores, e ``lhs`` e ``rhs``, entendendo como left-hand side e right-hand side. O lado esquerdo é geralmente uma referência de campo, mas pode ser qualquer coisa que implemente :ref: `query expression API <query-expression>`. O lado direito é o valor dado pelo usuário. No exemplo ``Author.objects.filter (name__ne = 'Jack') ``, o lado esquerdo é uma referência para o campo ``name`` campo do modelo ``Author``, e `` 'Jack ' `` é o lado direito.
zh_hans: ``Lookup`` 工作依靠两个值，``lhs`` 和 ``rhs``，代表左右两边，左边是一个字段参考，它可以是任何实现了 :ref:`查询表达式 API <query-expression>` 的实例。右边是一个用户给定的数值。举个例子： ``Author.objects.filter(name__ne='Jack')``，左边是 ``Author`` 模型的 ``name`` 字段，右边是 ``'Jack'``。

source: We call ``process_lhs`` and ``process_rhs`` to convert them into the values we need for SQL using the ``compiler`` object described before. These methods return tuples containing some SQL and the parameters to be interpolated into that SQL, just as we need to return from our ``as_sql`` method. In the above example, ``process_lhs`` returns ``('"author"."name"', [])`` and ``process_rhs`` returns ``('"%s"', ['Jack'])``. In this example there were no parameters for the left hand side, but this would depend on the object we have, so we still need to include them in the parameters we return.
it: Chiamiamo ``process_lhs`` e ``process_rhs`` per convertirli nei valori che ci servono per il codice SQL usando l'oggetto ``compiler`` descritto in precedenza. Questi metodi ritornano tuple contenenti il codice SQL e i parametri che devono essere interpolati in quel codice SQL, esattamente come si devono essere restituiti dal nostro metodo ``as_sql`` . Nell'esempio precedente, ``process_lhs`` restituisce ``('"author"."name"', [])`` e ``process_rhs`` restituisce ``('"%s"', ['Jack'])``. In questo esempio non c'erano parametri per la parte sinistra, ma può dipendere dall'oggetto che abbiamo, per questo dobbiamo includerli nei parametri che restituiamo.
ja: ``process_lhs`` と ``process_rhs`` を呼び出して、前述の ``compiler`` オブジェクトを使用してSQLに必要な値に変換します。これらのメソッドは、SQL とその SQL に補間されるパラメーターを含むタプルを返します。これは、``as_sql`` メソッドが返す必要があるものと同じです。上記の例では、``process_lhs`` は ``('"author"."name"', [])`` を返し、``process_rhs`` は ``('"%s"', ['Jack'])`` を返します。この例では、左側にパラメーターはありませんが、これは所有するオブジェクトに依存するため、返すパラメーターにそれらを含める必要があります。
ko: "process_lhs"와 "process_rhs"는 앞에서 설명한 "compiler" 개체를 사용하여 SQL에 필요한 값으로 변환하기 위해 "process_lhs"와 "process_rhs"라고 부른다. 이러한 방법들은 우리가 우리의 "as_sql" 방법에서 돌아올 때처럼 일부 SQL을 포함하는 튜플과 그 SQL에 보간될 파라미터를 반환한다. 위의 예에서 "process_lhs"는 ``('author'.name", []), "process_rhs"는 "('"%s"', ['Jack'])"을 반환합니다."이 예에서는 좌익에 대한 매개변수가 없었지만 이것은 우리가 가지고 있는 대상에 따라 달라지므로 우리는 여전히 그것들을 반환하는 매개변수에 포함시킬 필요가 있다.
pt_br: Nós chamamos e ``process_lhs`` e ``process_rhs`` para convertê-los para os valores que precisamos para SQL usando o objeto ``compiler`` descrito antes. Esses métodos retornam tuplas contendo alguns SQL e os parâmetros a serem interpolados dentro deste SQL, assim como nós precisamos para retornar do nosso método ``as_sql``. No exemplo acima, ``process_lhs`` retorna ``( "autor". "Nome" ', []) `` e ``process_rhs`` retorna ``( "% s"', [ 'Jack' ])``. Neste exemplo não havia parâmetros para o lado esquerdo, mas isso depende do objeto que temos, portanto ainda precisamos incluí-los nos parâmetros que retornamos.
zh_hans: 我们利用 ``process_lhs`` 和 ``process_rhs`` 将他们转换为我们期望值，用于之前介绍的 ``compiler`` 对象执行 SQL。这俩方法返回一个元组，包含一些 SQL 语句和插入 SQL 语句一些参数，就像是 ``as_sql`` 方法需要返回的。前文所述的例子中，``process_lhs`` 返回 ``('"author"."name"', [])``，``process_lhs`` 返回 ``('"%s"', ['Jack'])``。在这个例子里面没有手边的参数，这需要看情况而定，所以我们仍需要在返回结果时包括这些参数。

source: Finally we combine the parts into an SQL expression with ``<>``, and supply all the parameters for the query. We then return a tuple containing the generated SQL string and the parameters.
it: Finalmente combiniamo le parti in una espressione SQL con ``<>``, e riforniamo? con tutti i parametri per l'interrogazione. Dopodiché ritorniamo una tupla contenente la stringa SQL e i parametri generati.
ja: 最後に、これらの部分を ``<>`` を使って SQL 式にまとめ、クエリのすべてのパラメータを指定します。その後、生成された SQL 文字列とパラメータを含むタプルを返します。
ko: 마지막으로 부품을 SQL 표현식과 "<>"로 결합하고 질의에 대한 모든 매개 변수를 제공한다. 그런 다음 생성된 SQL 문자열과 매개 변수가 포함된 튜플을 반환합니다.
zh_hans: 最后，我们将这些部分组合成一个带有 ``<>`` 的 SQL 表达式，并提供查询的所有参数。 然后我们返回一个包含生成的 SQL 字符串和参数的元组。

source: A transformer example
it: Un esempio di trasformatore
ja: トランスフォーム（``Transform``: 変換）の例
ko: 변압기 예제

source: The custom lookup above is great, but in some cases you may want to be able to chain lookups together. For example, let's suppose we are building an application where we want to make use of the ``abs()`` operator. We have an ``Experiment`` model which records a start value, end value, and the change (start - end). We would like to find all experiments where the change was equal to a certain amount (``Experiment.objects.filter(change__abs=27)``), or where it did not exceed a certain amount (``Experiment.objects.filter(change__abs__lt=27)``).
it: La ricerca personalizzata sopra indicata è fantastica, ma in alcuni casi potresti aver bisogno di concatenare le ricerche insieme. Per esempio, supponiamo che stiamo costruendo la nostra applicazione laddove vogliamo fare uso del operatore ``abs()``. Abbiamo un modello ``Experiment`` che registra un valore inizio, un valore fine, e che un valore cambio ( inizio - fine ). Ci piacerebe cercare tutti gli esperimenti dove valore cambio è uguale ad alcuni valori (``Experiment.objects.filter(change__abs=27)``),o qualsiasi vaolore che non supera un certo quantitativo (``Experiment.objects.filter(change__abs__lt=27)``).
ja: 上記のカスタムルックアップは素晴らしいですが、場合によってはルックアップを一緒に連結したいこともあります。たとえば、``abs()`` 演算子を利用したいアプリケーションを構築しているとしましょう。開始値、終了値モデルおよび変更 (start - end) を記録する ``Experiment`` モデルがあります。変化が一定の量に等しい (``Experiment.objects.filter(change__abs=27)``)、またはそれが一定の量を超えなかった (``Experiment.objects.filter(change__abs__lt=27)``) すべての Experiment を見つけたいと思うことがあるでしょう。
ko: 위의 사용자 지정 조회는 훌륭하지만 경우에 따라 조회를 함께 연결할 수 있습니다. 예를 들어, 우리가 "abs()" 연산자를 사용하고자 하는 응용 프로그램을 만들고 있다고 가정해 보자. 우리는 시작값, 끝값, 변화(시작-끝)를 기록하는 "Experimental" 모델을 가지고 있다. 우리는 그 변화가 일정량과 동일한 모든 실험("Experiment.objects.filter(change__abs =27') 또는 일정량을 초과하지 않는 ("Experiment.objects.filter(change__abs__lt |27)")을 찾고자 한다.
pt_br: A lookup personalizado acima é boa, mas em alguns casos você queira ser capaz de lookups encadeadas. Por exemplo, vamos supor que estamos construindo uma aplicação onde queremos fazer uso do operador ``abs()``. Temos um modelo ``Experiment`` que registra um valor inicial, o valor final e a mudança (início - fim). Gostaríamos de encontrar todos os experimentos em que a alteração foi igual a uma certa quantidade ( ``Experiment.objects.filter (change__abs = 27)``), ou onde não exceda um certo montante ( ``Experiment.objects.filter (change__abs__lt = 27)``).
zh_hans: 上面的自定义查询器没问题，但在某些情况下，您可能希望能够将一些查询器链接在一起。 例如，假设我们正在构建一个使用 ``abs()`` 运算的应用程序。我们有一个 ``Experiment`` 模型，它记录起始值，结束值和差值（起始 - 结束）。 我们想找到 change 属性等于某个数值的所有 Experiment 对象(``Experiment.objects.filter(change__abs = 27)``)，change属性没有超过一定数量的 Experiment 对象(``Experiment.objects.filter(change__abs__lt= 27)``)。

source: This example is somewhat contrived, but it nicely demonstrates the range of functionality which is possible in a database backend independent manner, and without duplicating functionality already in Django.
it: Questo esempio è in qualche modo ?forzato?, ma ci mostra il range di funzionalita possibili nel database backend in maniera indipendete, e senza duplicare funzionalita gia esistenti in Django
ja: この例は多少工夫がされていますが、データベースバックエンドに依存しない方法で、そしてすでに Django にある機能を複製することなく可能な機能の範囲をうまく示しています。
ko: 이 예제는 다소 작위적이지만, 이미 Django에 있는 기능을 복제하지 않고 데이터베이스 백엔드에 독립적인 방식으로 가능한 기능의 범위를 잘 보여준다.
pt_br: Este exemplo é um pouco artificial, mas demonstra muito bem a gama de funcionalidades que é possível de uma maneira independente em um backend de banco de dados., e sem duplicar funcionalidades já existentes no Django.
zh_hans: 这个例子有点刻意，但它很好地演示了以数据库后端独立方式可能实现的功能范围，并且没有重复 Django 中的功能。

source: We will start by writing an ``AbsoluteValue`` transformer. This will use the SQL function ``ABS()`` to transform the value before comparison::
it: Cominceremo con la scrittura del convertitore``AbsoluteValue``. Utilizzeremo le funzioni SQL ``ABS()`` per convertire il valore prima del confronto::
ja: 私たちは ``AbsoluteValue`` トランスフォーマー（変換器）を書くことから始めましょう。次のコードは、 SQL 関数 ``ABS()`` を使って比較の前に値を変換します:
ko: "우리는 'Absolute' 변압기를 쓰는 것으로 시작할 것이다. 이는 SQL 함수 "ABS()"를 사용하여 비교 전에 값을 변환한다.
zh_hans: 我们将从编写一个 ``AbsoluteValue`` 变换器开始。 这将使用 SQL 中的 ``ABS()`` 函数在比较进行之前转换值::

source: Next, let's register it for ``IntegerField``::
it: Successivamente registriamolo per il campo ``IntegerField``::
ja: 次に、``IntegerField`` に登録しましょう。
ko: 다음으로, ``IntegerField``\를 등록해봅시다.
pt_br: Em seguida, vamos registrá-lo para `` IntegerField`` ::
zh_hans: 下一步，让我们为其注册 ``IntrgerField``::

source: We can now run the queries we had before. ``Experiment.objects.filter(change__abs=27)`` will generate the following SQL:
it: Adesso possiamo lanciare le query che avevamo prima. ``Experiment.objects.filter(change__abs=27)`` genererà il seguente SQL:
ja: これで、このクエリを使うことができるようになりました。 ``Experiment.objects.filter(change__abs=27)`` は次のSQLを生成します。
ko: 이제 이전의 쿼리를 실행할 수 있습니다. ``Experiment.objects.filter(change__abs=27)`` 은 다음의 SQL을 생성합니다.

source: By using ``Transform`` instead of ``Lookup`` it means we are able to chain further lookups afterward. So ``Experiment.objects.filter(change__abs__lt=27)`` will generate the following SQL:
it: Usare ``Transform`` invece di ``Lookup`` significa che saremo in grado di concatenare ulteriori lookup in seguito. Così ``Experiment.objects.filter(change__abs__lt=27)`` genererà il seguente SQL:
ja: ``LookUp`` の代わりに ``Transform`` を使うことで、それ以降のルックアップを連結できます。つまり、``Experiment.objects.filter(change__abs__lt=27)`` は以下のようなSQLを生成します。

source: Note that in case there is no other lookup specified, Django interprets ``change__abs=27`` as ``change__abs__exact=27``.
it: Nel caso non ci siano altre ricerche specificate, Django interpreta ``change__abs=27`` come ``change__abs__exact=27``.
ja: 他にルックアップが指定されていない場合、Django は ``change__abs=27`` を ``change__abs__exact=27`` として解釈します。
ko: 다른 조회가 지정되지 않은 경우, Django는 "change__abs abs=27"을 "change__abs_exact=27"로 해석합니다.
pt_br: Note-se que no caso não há nenhuma outra lookup especificada, o Django interpreta ``change__abs = 27`` como ``change__abs__exact = 27``.
zh_hans: 请注意，如果没有指定其他查找定义，Django则会将 ``change__abs=27`` 解析为 ``change__abs__exact=27``。

source: This also allows the result to be used in ``ORDER BY`` and ``DISTINCT ON`` clauses. For example ``Experiment.objects.order_by('change__abs')`` generates:
it: Questo consente anche al risultato di essere usato in espressioni ``ORDER BY`` e ``DISTINCT ON``. Per esempio ``Experiment.objects.order_by('change__abs')`` produce:
ja: これにより ``ORDER BY`` 句と ``DISTINCT ON`` 句の使用も可能です。例えば ``Experiment.objects.order_by('change__abs')`` は以下の SQL を生成します。
ko: 이는 또한 이 결과를 "ORDER BY"와 "DISTINCT ON" 조항에 사용할 수 있게 한다. 예를 들어 "Experiment.objects.order_by('change__abs')"는 다음을 생성합니다:

source: And on databases that support distinct on fields (such as PostgreSQL), ``Experiment.objects.distinct('change__abs')`` generates:
it: E nei database che supportano distinct sui campi (come PostgreSQL), ``Experiment.objects.distinct('change__abs')`` produce:
ja: そして、PosgreSQL のようにフィールドを DISTINCT することもサポートしています。``Experiment.objects.distinct('change__abs')`` は以下の SQL を生成します。
ko: 필드에서의 구별을 지원하는 데이터베이스(PostgreSQL같은), "Experiment.objects.distinct('change__abs')"는 다음을 생성합니다.

source: When looking for which lookups are allowable after the ``Transform`` has been applied, Django uses the ``output_field`` attribute. We didn't need to specify this here as it didn't change, but supposing we were applying ``AbsoluteValue`` to some field which represents a more complex type (for example a point relative to an origin, or a complex number) then we may have wanted to specify that the transform returns a ``FloatField`` type for further lookups. This can be done by adding an ``output_field`` attribute to the transform::
it: Quando cerca quali lookup sono disponibili dopo avere applicato la ``Transform``, Django usa l'attributo ``output_field``. Se l'attributo non è cambiato, non abbiamo necessità di specificarlo, ma supponiamo che stavamo applicando la ``AbsoluteValue`` ad un campo che rappresenta un tipo più complesso (per esempio un punto relativo ad una origine, o un numero complesso), allora per ulteriori lookup avremmo voluto specificare il fatto che la trasformazione ritorna un tipo ``FloatField``. Ciò può essere fatto aggiungendo un attributo ``output_field`` alla trasformazione::
ja: ``Transform`` が適用された後、どのルックアップが許可されるかを探すとき、Django は ``output_field`` 属性を使用します。ここでは変更しないため、これを指定する必要はありませんでしたが、より複雑な型（たとえば、原点に関連する点や複素数）を表すフィールドに ``AbsoluteValue`` を適用すると仮定します。 次に、トランスフォームが次のルックアップのために ``FloatField`` 型を返すように指定したいかもしれません。これは、次のようにトランスフォームに ``output_field`` 属性を追加することで実現できます:
ko: "Transform"이 적용된 후 어떤 룩업이 허용되는지를 찾을 때, Django는 "output_field" 속성을 사용한다. 변화가 되지 않았기 때문에 여기에 명시할 필요는 없지만, 보다 복잡한 유형(예:기원에 상대적인 점, 또는 복합적인 수)을 나타내는 어떤 분야에 "AbsoluteValue"을 적용한다고 가정하면 변환이 추가 조회를 위해 "FloatField" 타입을 반환한다고 명시하고 싶었을 수도 있다. 이는 "output_field" 속성을 변환에 추가하여 수행할 수 있다::
pt_br: Quando olhamos par quais lookups são permitidas depois de ter aplicado o ``Trnasform``, Django usa o atibuto `òutput_field``. Não é necessário especificar isso aqui, já que não muda, más supondo que fosse aplicado ``AbsoluteValue``para algum campo que represente um tipo mais complexo (por exemplo um ponto reativo a uma origem ou um número complexo) então talvez quereríamos especificar que retornasse um tipo ``FloatField`` para próximas lookups. Isso pode ser feito adicionando um atributo `òutput_field``ao transform::
zh_hans: 当我们在应用 ``Transform`` 之后查找允许执行哪些查找时，Django 使用 ``output_field`` 属性。 我们不需要在这里指定它，因为它没有改变，但假设我们将 ``AbsoluteValue`` 应用于某个字段，该字段表示更复杂的类型（例如，相对于原点的点或复数） 那么我们可能想要指定转换返回一个 ``FloatField`` 类型以进行进一步的查找。 这可以通过在变换中添加 ``output_field`` 属性来完成::

source: This ensures that further lookups like ``abs__lte`` behave as they would for a ``FloatField``.
it: Questo assicura che future ricerce come ``abs__lte`` si comportino come per ``FloatField``.
ja: これにより ``abs__lte`` のようなそれ以降のルックアップが ``FloatField`` の場合と同じように動作することが保証されます。
ko: 이를 통해 "abs_lte"와 같은 추가적인 룩업이 "FloatField"에서 처럼 행동할 수 있다.
pt_br: Isso garante que novas pesquisas como ``abs__lte`` se comportem como fariam para um ``FloatField``.
zh_hans: 这确保了像 ``abs__lte`` 这样的进一步查找与对 ``FloatField`` 一致。

source: Writing an efficient ``abs__lt`` lookup
it: Scrivere una ``abs__lt`` ricerca efficiente
ja: 効率的な ``abs__lt`` ルックアップを書く
ko: 효율적인 "abs_lt" 룩업 작성법
pt_br: Escrevendo uma lookup ``abs__lt`` eficiente
zh_hans: 编写一个高效的 ``abs__lt`` 查找

source: When using the above written ``abs`` lookup, the SQL produced will not use indexes efficiently in some cases. In particular, when we use ``change__abs__lt=27``, this is equivalent to ``change__gt=-27`` AND ``change__lt=27``. (For the ``lte`` case we could use the SQL ``BETWEEN``).
it: Usando il lookup ``abs`` di cui sopra, l'SQL che viene prodotto in qualche caso non utilizzerà gli indici prodotti efficientemente. In particolare, l'utilizzo di ``change__abs__lt=27`` è equivalente all'utilizzo di ``change__gt=-27`` AND ``change__lt=27``. (Per il caso ``lte`` avremmo potuto usare il ``BETWEEN`` di SQL).
ja: 上記の ``abs`` ルックアップを使用するとき、生成された SQL はいくつかのケースでインデックスを効率的に使用しません。特に、``change__abs__lt=27`` を使うとき、これは ``change__gt=-27`` かつ ``change__lt=27`` と同じです (``lte`` の場合はSQLの ``BETWEEN`` を使うことができます)。
ko: 위에서 작성한 "abs" 룩업을 사용할 때 생성된 SQL은 경우에 따라 인덱스를 효율적으로 사용하지 않을 것이다. 특히 우리가 ``change_abs__lt=27"을 사용할 때 이는 ``change_gt =-27"과 "change_lt =27"에 해당한다("lte"케이스에서는 우리는 SQL "BETWEEN"을 사용할 수 있다).
pt_br: Quando usado a lookup ``abs`` escrita acima, o SQL gerado não irá usar índices de maneira eficiente em alguns casos. Em particular, quando usado ``change__abs__lt=27``, é equivalente a ``change__gt=-27`` e ``change__lt=27``. (Para o caso ``lte`` podemos usar o SQL ``BETWEEN``).
zh_hans: 当使用上面写的 ``abs`` 查找时，生成的 SQL 在某些情况下不会有效地使用索引。 特别是，当我们使用 ``change__abs__lt=27`` 时，这相当于 ``change__gt=-27`` 和 ``change__lt=27``。（对于 ``lte`` 情况，我们可以使用 SQL ``BETWEEN``）。

source: So we would like ``Experiment.objects.filter(change__abs__lt=27)`` to generate the following SQL:
it: Ci piacerebbe che ``Experiment.objects.filter(change__abs__lt=27)`` generi la seguente SQL:
ja: そのため、``Experiment.objects.filter(change__abs__lt=27)`` に次のような SQL を生成させたいです。
ko: 그래서 우리는 "Experiment.objects.filter(change__abs__lt=27)"을 다음 SQL문을 생성하기를 원한다:

source: The implementation is::
it: L'implemetazione è::
ja: 実装は次のようになります。
ko: 구현은 다음과 같습니다.
pt_br: A implementação é::
zh_hans: 实现方式是::
