Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Notice how we used ``self`` to scope the ``CycleNode`` specific information within the ``render_context``. There may be multiple ``CycleNodes`` in a given template, so we need to be careful not to clobber another node's state information. The easiest way to do this is to always use ``self`` as the key into ``render_context``. If you're keeping track of several state variables, make ``render_context[self]`` a dictionary.
it: Nota come abbiamo usato ``self`` per dare uno scope alla specifica informazione ``CycleNode`` nel ``render_context``. Ci possono essere molteplici ``CycleNodes`` in un dato template, quindi abbiamo bisogno di stare attenti a non andare in conflitto con l'informazione di stato di un altro nodo. Il modo più semplice di farlo è usare sempre ``self`` come chiave in ``render_context``. Se stai tenendo traccia di diverse variabili di stato, rendi ``render_context[self]`` un dizionario.
ja: ``self`` を使用して ``render_context`` 内の ``CycleNode`` 固有の情報をスコープしていることに注意してください。 テンプレート内には複数の ``CycleNode`` が存在する可能性があるので、他のノードの状態情報を取得しないように注意する必要があります。最も簡単な方法は、常に ``render_context`` のキーとして ``self`` を使用することです。複数の状態変数を管理している場合は、 ``render_context[self]`` を辞書にします。
ko: 우리가 ``self"를 어떻게 사용해서 ``render_context" 내에서 ``CycleNode"의 구체적인 정보를 범위를 넓혔는지 주목하라. 주어진 템플릿에 "CycleNode"가 여러 개 있을 수 있으므로 다른 노드의 상태 정보가 중복되지 않도록 주의해야 한다. 가장 쉬운 방법은 항상 ``자기"를 ``렌더_컨텍스트"의 열쇠로 삼는 것이다. 여러 가지 국가 변수를 추적하고 있다면 ``render_context"를 사전으로 만들어라.
pt_br: Note como usamos o ``self`` como escopo para a informação específica do ``CycleNode`` dentro do ``render_context``. Pode haver múltiplos ``CycleNodes`` em um dado template, então é preciso ter cuidado para não conflitar outra informação de estado do nó. A maneira mais fácil de fazer isso é sempre usar ``self`` como chave dentro do ``render_context``. Se está acompanhando várias variáveis de estado faça do ``render_context[self]`` um dicionário.
zh_hans: 注意我们是如何利用 ``self`` 将 ``CycleNode`` 的特定参数装入 ``render_context`` 的。一个模板中可能有多个 ``CycleNodes``，所以我们要十分小心，不要破坏其它节点的状态信息。最简单的方式就是一直将 ``self`` 作为键存入 ``render_context``。如果你同时追踪好几个状态变量，将 ``render_context[self]`` 做成一个字典。

source: Registering the tag
it: Registrare il tag
ja: タグを登録する
ko: 태그를 등록한다.
pt_br: Registrando a tag
zh_hans: 注册该标签

source: Finally, register the tag with your module's ``Library`` instance, as explained in :ref:`writing custom template tags<howto-writing-custom-template-tags>` above. Example::
it: Infine, registra il tag nell'istanza del tuo modulo ``Library``, come spiegato in :ref:`scrivere tag di template personalizzati` qui sopra. Per esempio::
ja: 最後に、上記の :ref:`カスタムテンプレートタグを書く<howto-writing-custom-template-tags>` で説明したように、タグをモジュールの ``Library`` インスタンスに登録します。次に例を示します。
ko: 마지막으로 위의 ref:"사용자 정의 템플릿 태그 작성"에서 설명한 대로 모듈의 "라이브러리" 인스턴스에 태그를 등록합니다. 예:

source: The ``tag()`` method takes two arguments:
it: Il methodo ``tag()`` ha bisogni di due argomenti:
ja: ``tag()`` メソッドは次の2つの引数を取ります。
ko: "태그()" 방식은 두 가지 주장을 한다.
pt_br: O método ``tag()`` recebe dois argumentos:
zh_hans: ``tag`` 方法接收两个参数：

source: The name of the template tag -- a string. If this is left out, the name of the compilation function will be used.
it: Il nome del template tag -- una stringa. Se viene tralasciato, il nome della fu..?
ja: テンプレート タグの名前の文字列。これを省略した場合は、コンパイル関数の名前が使用されます。
ko: 템플릿 태그의 이름 - 문자열. 이 옵션을 제외하면 컴파일 기능의 이름이 사용됩니다.
pt_br: O nome da template tag -- uma string. Se não for informado, o nome da função de compilação será usado.
zh_hans: 模板标签的名字——一个字符串。若为空，将会使用编译函数的名字。

source: As with filter registration, it is also possible to use this as a decorator::
it: Così come con la registrazione di un filtro, è anche possibile usarlo come decoratore::
ja: フィルタ登録と同様に、これをデコレータとして使うこともできます。
ko: 필터 등록과 마찬가지로, 다음 구성 요소로 사용할 수도 있습니다.
pt_br: Assim como o registro de um filtro, também é possível usá-lo como "decorator"::
zh_hans: 就像过滤器注册一样，这里也能用装饰器::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the tag name.
it: Se non specifichi l'argomento ``name``, come nel secondo esempio qui sopra, Django userà il nome della funzione come nome del tag.
ja: ``name`` 引数を省略した場合、上記の2番目の例と同じように、Django はタグ名として関数の名前を利用します。
ko: 위의 두 번째 예와 같이 "name" 인수를 생략하면 Django는 함수의 이름을 태그 이름으로 사용합니다.
pt_br: Se não informado o argumento ``name``, como no segundo exemplo acima, o Django irá usar o nome da função como nome da tag.
zh_hans: 若未输入 ``name`` 参数，像上述第二个例子一样，Django 会将函数名作为标签名。

source: Passing template variables to the tag
it: Passare variabili del template ai tag
ja: テンプレート変数をタグに渡す
ko: 태그에 템플릿 변수 전달
pt_br: Passando variáveis de template para a tag.
zh_hans: 传递模板变量给标签

source: Although you can pass any number of arguments to a template tag using ``token.split_contents()``, the arguments are all unpacked as string literals. A little more work is required in order to pass dynamic content (a template variable) to a template tag as an argument.
it: Anche se puoi passare un numero arbitrario di argomenti ad un tag di template usando ``token.split_contents()``, gli argomenti sono tutti spacchettati come string literals. E' richiesto un po' più di lavoro per passare un contenuto dinamico (una variabile di template) come argomento ad un tag di template.
ja: ``token.split_contents()`` を使用するテンプレート タグには任意の個数の引数を渡せますが、引数はすべて文字列リテラルとしてアンパックされます。動的なコンテンツ (テンプレート変数) をテンプレートタグに引数として渡すためには、少し追加の作業が必要になります。
ko: ``token.split_contents()"를 사용하여 템플릿 태그에 원하는 수의 인수를 전달할 수 있지만 인수는 모두 문자열 리터럴로 압축 해제됩니다. 동적 내용(템플릿 변수)을 템플릿 태그에 인수로 전달하려면 조금 더 많은 작업이 필요합니다.
pt_br: Embora você possa passar qualquer número de argumentos para uma tag de template usando ``token.split_contents()``, os argumentos são todos "desempacotados" como strings literais. Um pouco mais de trabalho é requerido para que passe o conteúdo dinamicamente (uma variável de template) para uma tag de template como argumento.
zh_hans: 虽然你能利用 ``token.split_contents()`` 将任意数量的变量传递给一个模板标签，但是解包出来的参数均是字符串文本。要将一个动态内容（一个模板变量）作为参数传递给模板标签需要额外工作。

source: While the previous examples have formatted the current time into a string and returned the string, suppose you wanted to pass in a :class:`~django.db.models.DateTimeField` from an object and have the template tag format that date-time:
it: Mentre gli esempi precedenti hanno formattato l'ora corrente in una stringa e restituito una stringa, supponi di voler passare un :class:`~django.db.models.DateTimeField` da un oggetto ed avere il template tag che formatta il date-time::
ja: 前の例では現在時刻を文字列にフォーマットして文字列として返しましたが、オブジェクトから :class:`~django.db.models.DateTimeField` を渡したくて、テンプレートタグがその値を date-time とフォーマットとするとすると、次のように書けます。
ko: 이전 예에서는 현재 시간을 문자열로 포맷하고 문자열을 반환했지만 :class에서 전달하고자 한다고 가정합니다.'~django.db.db.know.개체에서 'DateTimeField'로, 날짜-시간의 템플릿 태그 형식을 갖습니다.
pt_br: Enquando os exemplos anteriores formataram a hora corrente como string e retornaram uma string, suponha que queira passar um :class:`~django.db.models.DateTimeField` de um objeto e a template tag formate o date-time:
zh_hans: 前文的例子已经成功将当前时间转为字符串并将之返回，假设你想传入一个 :class:`~django.db.models.DateTimeField` 对象，并想用该模板标签格式化这个对象：

source: Initially, ``token.split_contents()`` will return three values:
it: All'inizio, ``token.split_contents()`` restituirà tre valori:
ja: 最初に、``token.split_contents()`` が3つの値を返します。
ko: 당초 ``token.split_contents()"는 세 가지 값을 반환한다.
pt_br: Inicialmente, ``token.split_contents()`` irá retornar três valores:
zh_hans: 首先，``token.split_contents()`` 会返回 3 个值：

source: The tag name ``format_time``.
it: Il nome tag ``format_time``.
ja: タグ名 ``format_time``。
ko: 태그 이름은 "format_time"
pt_br: O nome da tag ``format_time``.
zh_hans: 标签名 ``format_time``。

source: The string ``'blog_entry.date_updated'`` (without the surrounding quotes).
it: La stringa ``'blog_entry.date_updated'`` (senza le virgolette).
ja: 文字列 ``'blog_entry.date_updated'`` (両側のクオートは含まない)
ko: ''blog_entry.date_updated'' 문자열(주변 인용문 없음)
pt_br: A string ``'blog_entry.date_updated'`` (sem as aspas).
zh_hans: 字符串 ``'blog_entry.date_updated'``（不包含引号）。

source: The formatting string ``'"%Y-%m-%d %I:%M %p"'``. The return value from ``split_contents()`` will include the leading and trailing quotes for string literals like this.
it: La stringa di formattazione ``'"%Y-%m-%d %I:%M %p"'``. Il valore restituito da ``split_contents()`` includerà le virgolette in capo ed in coda agli string literals come questo.
ja: フォーマット文字列 ``'"%Y-%m-%d %I:%M %p"'``。``split_contents()`` からの返り値は、このように文字列リテラルの前後にクオートを含みます。
ko: 형식 문자열 ""%Y-%m-%I:%M""" "split_contents()"에서 반환되는 값은 이와 같은 문자열 리터럴의 선행 및 후행 인용을 포함한다.
pt_br: A string de formatação ``'"%Y-%m-%d %I:%M %p"'``. O valor retornado do ``split_contents()`` irá incluir as aspas para string literais como esta.
zh_hans: 格式化字符串 ``'"%Y-%m-%d %I:%M %p"'``。 ``split_contents()`` 的返回值会为类似这样的字符串保留引号。

source: Now your tag should begin to look like this::
it: Adesso il tuo tag comincia a sembrare così::
ja: これで、タグは次のようになります。
ko: 이제 너의 태그는 이렇게 보이기 시작해야한다.
pt_br: Agora sua tag deve começar a parecer com isso::
zh_hans: 现在，你的标签应该看起来像这样::

source: You also have to change the renderer to retrieve the actual contents of the ``date_updated`` property of the ``blog_entry`` object. This can be accomplished by using the ``Variable()`` class in ``django.template``.
it: Devi anche cambiare il renderer per ritirare il contenuto attuale della proprietà ``date_updated`` dell'oggetto ``blog_entry``. Questo può essere ottenuto usando la classe ``Variable()`` in ``django.template``.
ja: ``blog_entry`` オブジェクトの ``date_updated`` プロパティの実際のコンテンツを取得するレンダラを変更する必要があります。これは ``django.template`` で ``Variable()`` クラスを使用することで実現できます。
ko: ``blog_entry" 개체의 ``날짜_업데이트" 속성의 실제 내용을 검색하려면 렌더러를 변경해야 한다. 이는 ``django. template"에서 ``Variable()" 클래스를 사용하면 이룰 수 있다.
pt_br: Também é necessário alterar o renderizador para retornar o conteúdo atual da propriedade ``date_update`` do objeto ``blog_entry``.
zh_hans: 你也需要修改 renderer，让其获取 ``blog_entry`` 对象的 ``date_updated`` 属性的真实内容。这能通过在 ``django.template`` 中使用 ``Variable()`` 完成。

source: To use the ``Variable`` class, instantiate it with the name of the variable to be resolved, and then call ``variable.resolve(context)``. So, for example::
it: Per usare la classe ``Variable``, instanziala con il nome della variabile da risolvere, e poi chiama ``variable.resolve(context)``. Quindi, per esempio::
ja: ``Variable`` クラスを使うには、クラスを解決されるべき変数名でインスタンス化した後に、``variable.resolve(context)`` を呼びます。したがって、たとえば次のようになります。
ko: "Variable" 클래스를 사용하려면 해결할 변수의 이름으로 인스턴스화한 다음 "variable.resolve(컨텍스트)"라고 부른다. 예를 들어 다음과 같습니다.

source: Variable resolution will throw a ``VariableDoesNotExist`` exception if it cannot resolve the string passed to it in the current context of the page.
it: La risoluzione della variabile solleverà una eccezione ``VariableDoesNotExist`` se non può risolvere la stringa che gli si passa nel contesto corrente della pagina.
ja: ページの現在のコンテキスト内で渡された文字列が解決できない場合、変数を解決しようとすると ``VariableDoesNotExist`` 例外が発生します。
ko: 가변 해상도는 페이지의 현재 컨텍스트에서 전달된 문자열을 해결할 수 없는 경우 "Variable DonsNot Exception.
pt_br: A resolução da variável irá lançar uma excessão ``VariableDoesNotExist`` se não conseguir resolver a string recebida no contexto corrente da página.
zh_hans: 变量解决方案会在无法在当前页的上下文中找到指定字符串时抛出 ``VariableDoesNotExist`` 异常。

source: Setting a variable in the context
it: Impostare una variabile nel contesto
ja: コンテキスト内で変数を設定する
ko: 컨텍스트에 변수를 설정
pt_br: Definindo uma variável no contexto
zh_hans: 在上下文中设置变量

source: The above examples output a value. Generally, it's more flexible if your template tags set template variables instead of outputting values. That way, template authors can reuse the values that your template tags create.
it: L'esempio qui sopra mostra un valore. Generalmente, è tutto più flessibile se i template tag impostano le variabili di template invece di mostrare valori. In questo modo, gli autori di template possono riusare i valori che i tuoi tag di template creano.
ja: 上記の例は値を出力します。一般に、テンプレートタグは値を出力する代わりに、テンプレート変数を設定するほうがより柔軟です。それにより、テンプレートの作者はテンプレートタグが作成した値を再利用できるようになります。
ko: 위의 예제는 값을 출력합니다. 일반적으로 템플릿 태그가 값을 출력하는 대신 템플릿 변수를 설정하는 것이 더 유연합니다. 이렇게 하면 템플릿 작성자는 템플릿 태그가 생성한 값을 재사용할 수 있습니다.

source: To set a variable in the context, use dictionary assignment on the context object in the ``render()`` method. Here's an updated version of ``CurrentTimeNode`` that sets a template variable ``current_time`` instead of outputting it::
it: Per impostare una variabile nel contesto, usa l'assegnazione di dizionario sull'oggetto context nel metodo ``render()``. Ecco una versione aggiornata di ``CurrentTimeNode`` che imposta una variabile di template chiamata ``current_time`` invece di mostrarla.
ja: コンテキスト内に変数を設定するには、``render()`` メソッド内で、コンテキスト オブジェクト上のディクショナリ代入を使います。以下は、出力する代わりにテンプレート変数 ``current_time`` を設定する、更新されたバージョンの ``CurrentTimeNode`` です。
ko: 컨텍스트에서 변수를 설정하려면 컨텍스트 객체에 대한 사전 할당을 "렌더()" 방법으로 사용하십시오. 여기 템플릿 변수를 출력하는 대신 "current_time"을 설정하는 "CurrentTimeNode"의 업데이트된 버전이 있다.

source: Note that ``render()`` returns the empty string. ``render()`` should always return string output. If all the template tag does is set a variable, ``render()`` should return the empty string.
it: Nota che ``render()`` restituisce una stringa vuota. ``render()`` dovrebbe sempre restituire un output come stringa. Se tutto quel che il tag di template fa è impostare una variabile, ``render()`` dovrebbe restituire una stringa vuota.
ja: ``render()`` は空の文字列を返すことに注意してください。``render()`` はつねに文字列の出力を返します。すべてのテンプレートタグが変数の設定だけを行う場合、``render()`` は空の文字列を返す必要があります。
ko: "render()"는 빈 문자열을 반환합니다. "만들다"는 항상 문자열 출력을 반환해야 한다. 템플릿 태그가 변수를 설정하기만 하면 "render()"는 빈 문자열을 반환해야 한다.
pt_br: Repare que ``render()`` retorna uma string vazia. ``render()`` deve sempre retornar uma string como saída. Se tudo que a tag de template faz é definir uma variável, ``render()`` deve retornar uma string vazia.
zh_hans: 注意， ``render()`` 返回了空字符串。 ``render()`` 应该总是返回字符串。如果所有的模板标签都设置了变量， ``render()`` 应该返回空字符串。

source: Here's how you'd use this new version of the tag:
it: Ecco come useresti la nuova versione del tag:
ja: この新しいバージョンのタグの使い方はこちらです。
ko: 새 버전의 태그를 사용하는 방법은 다음과 같습니다.
pt_br: Aqui como você deveria usar a nova versão da tag:
zh_hans: 下面是如何使用新版标签的实例：

source: Variable scope in context
it: Scope delle variabili nel contesto
ja: コンテキスト内の変数のスコープ
ko: 컨텍스트의 가변 범위
pt_br: Escopo da variável no context
zh_hans: 上下文中的变量作用域

source: Any variable set in the context will only be available in the same ``block`` of the template in which it was assigned. This behavior is intentional; it provides a scope for variables so that they don't conflict with context in other blocks.
it: Ogni variabile impostata nel context sarà solo disponibile nello stesso ``blocco`` del template in cui è stata assegnata. Questo comportamento è intenzionale; fornisce uno scope per le variabili, in modo che non vadano in conflitto con il context in altri blocchi.
ja: コンテキストに設定された変数は、その変数が割り当てられたテンプレートの同じ ``block`` でのみ使用できます。 この動作は意図的なもので、他のブロックのコンテキストと衝突しないように、変数にスコープを提供します。
ko: 컨텍스트에 설정된 변수는 할당된 템플릿의 동일한 "블록"에서만 사용할 수 있습니다. 이 동작은 의도적인 것입니다. 다른 블록의 컨텍스트와 충돌하지 않도록 변수에 대한 범위를 제공합니다.
pt_br: Qualquer variável definida no contexto somente estará disponível no mesmo "bloco" do template no qual ele foi definido. Este comportamento é intencional; ele fornece um escopo para as variáveis que então não conflitam com o contexto de outros blocos.
zh_hans: 上下文内变量仅在模板中相同 ``block`` 内生效。这是故意的；提供有作用域的变量不会与其它区块中的上下文发生冲突。

source: But, there's a problem with ``CurrentTimeNode2``: The variable name ``current_time`` is hard-coded. This means you'll need to make sure your template doesn't use ``{{ current_time }}`` anywhere else, because the ``{% current_time %}`` will blindly overwrite that variable's value. A cleaner solution is to make the template tag specify the name of the output variable, like so:
it: Ma c'è un problema con ``CurrentTimeNode2``: il nome di variabile ``current_time`` è hard-coded. Questo significa che dovrai accertarti che il tuo template non usi ``{{ current_time }}`` da nessun altra parte, perchè ``{% current_time %}`` sovrascriverà ciecamente quel nome di variabile. Una soluzione più pulita è fare in modo che il tag di template specifichi il nome della variabile di output, in questo modo:
ja: しかし、 ``CurrentTimeNode2`` には問題があります: 変数名 ``current_time`` がハードコーディングされています。つまり、テンプレートが ``{{ current_time }}`` を他の場所で使用していないことを確認する必要があります。なぜなら、 ``{% current_time %}`` はその変数の値を盲目的に上書きしてしまうからです。よりクリアな解決策は、次のようにテンプレートタグで出力変数の名前を指定することです:
ko: 그러나 ``Current TimeNode2"에는 문제가 있다. 변수 이름 "current_time"은 하드 코딩되어 있다. 이는 "{% current_time }"이 변수의 값을 무턱대고 덮어쓸 것이기 때문에 템플릿이 "{{current_time}"을 다른 곳에 사용하지 않도록 해야 한다는 것을 의미한다. 더 깨끗한 해결책은 템플릿 태그가 출력 변수의 이름을 다음과 같이 지정하도록 하는 것입니다.
pt_br: Mas, tem um problema com ``CurrentTimeNode2``: O nome da variável ``current_time`` está "hardecodeada". Isso significa que tem que ter certeza seu template não usa ``{{ current_time }}`` em nenhum outro lugar, porque o ``{% current_time %}`` irá redefinir o valor da variável. Uma solução mais limpa é fazer a tag de template especificar o nome da variável de saída, como:
zh_hans: 但是， ``CurrentTimeNode2`` 有个问题：变量名 ``current_time`` 是硬编码的。这意味着你需要确认模板未在其它地方使用 ``{{ current_time }}``，因为 ``{% current_time %}`` 会绑定兵重写该变量的值。一个简洁的方法是让模板标签指定输出变量的值，像这样：

source: To do that, you'll need to refactor both the compilation function and ``Node`` class, like so::
it: Per fare ciò, dovrai rifattorizzare sia la funzione di compilazione che la classe ``Node``, così::
ja: そのためには、コンパイル関数と ``Node`` クラスの両方を次のようにリファクタリングする必要があります:
ko: 그러기 위해서는 컴파일 기능과 ``노드" 클래스를 모두 다음과 같이 리팩터링해야 한다.
pt_br: Para fazer isso, será preciso refatorar tanto a função de compilação e a classe de ``Node`, como::
zh_hans: 为此，你需要重构编译函数和 ``Node`` 类，像这样::

source: The difference here is that ``do_current_time()`` grabs the format string and the variable name, passing both to ``CurrentTimeNode3``.
it: La differenza qui è che ``do_current_time()`` prende la stringa di formattazione ed il nome di variabile, passandole entrambe a ``CurrentTimeNode3``.
ja: ここでの違いは、 ``do_current_time()`` がフォーマット文字列と変数名を取得し、その両方を ``CurrentTimeNode3`` に渡していることです。
ko: 여기서 다른 점은 "do_current_time()"이 형식 문자열과 변수 이름을 모두 "CurrentTimeNode3"로 넘겨준다는 점이다.
pt_br: A diferença aqui é que ``do_current_time()`` pega a string de formato e o nome da variável passando ambos para ``CurrenteNode3``.
zh_hans: 此处的不同点是 ``do_current_time()`` 处理了格式化字符串和变量名，并将它们传递给 ``CurrentTimeNode3``。

source: Finally, if you only need to have a simple syntax for your custom context-updating template tag, consider using the :meth:`~django.template.Library.simple_tag` shortcut, which supports assigning the tag results to a template variable.
it: Infine, se hai solo bisogno di avere una sintassi semplice per il tuo template tag personalizzato che aggiorna il context, considera l'utilizzo dello shortcut :meth:`~django.template.Library.simple_tag`, che supporta l'assegnamento dei risultati del tag ad una variabile di template.
ja: 最後に、コンテキストを更新するカスタムテンプレートタグの簡単な構文が必要なだけなら、 :meth:`~django.template.Library.simple_tag` ショートカットを使うことを検討してください 。 このショートカットは、タグの結果をテンプレート変数に代入することをサポートしています。
ko: 마지막으로 사용자 정의 컨텍스트 업데이트 템플릿 태그에 대해 간단한 구문만 있으면 되는 경우 :meth:'~django.template을 사용하는 것이 좋습니다.Library.simple_tag' 바로 가기이며, 템플릿 변수에 태그 결과를 할당할 수 있습니다.
pt_br: Finalmente, se você precisa ter somente uma sinatxe simples para sua tag de template personalizada que atualiza o contexto, considere usar o atalho :meth:`~django.template.Library.simple_tag`, o qual possibilita passar os resultados de uma tag para uma variável de template.
zh_hans: 最后，如果你的自定义上下文更新模板标签只需要简单的语法，考虑使用 :meth:`~django.template.Library.simple_tag` 快捷方式，它支持将标签结果分配给模板变量。

source: Parsing until another block tag
it: Analisi fino ad un altro blocco tag
ja: 他のブロックタグまでパースする
ko: 다른 블록 태그까지 구문 분석
pt_br: "Parsing" até outra bloco de tag.
zh_hans: 解析直到碰到另一区块的标签

source: Template tags can work in tandem. For instance, the standard :ttag:`{% comment %}<comment>` tag hides everything until ``{% endcomment %}``. To create a template tag such as this, use ``parser.parse()`` in your compilation function.
it: I tag di template possono funzionare in tandem. Per esempio, il tag standard :ttag:`{% comment %}<comment>` nasconde ogni cosa fino a ``{% endcomment %}``. Per creare un tag di template come questo, usa ``parser.parse()`` nella tua funzione di compilazione.
ja: テンプレートタグは連動して動作します。例えば、標準の :ttag:`{% comment %}<comment>` タグは ``{% endcomment %}`` まですべてを隠蔽します。このようなテンプレートタグを作成するには、コンパイル関数の中で ``parser.parse()`` を使います。
ko: 템플릿 태그는 함께 사용할 수 있습니다. 예를 들어 표준:ttag:'{% comment %}' 태그는 "{% end comment %}"까지 모든 것을 숨깁니다. 이와 같은 템플릿 태그를 만들려면 컴파일 기능에 "parser.parse()"를 사용하십시오.
pt_br: Tags de templates podem trabalhar em tandem. Por exemplo, a tag padrão :ttag:`{% comment %}<comment>` esconde tudo até ``{% endcomment %}``. Para criar uma tag de template coo esta, use ``parser.parse()`` na sua função de compilação.
zh_hans: 模板标签能串联工作。例如，标准标签 ttag:`{% comment %} <comment>` 隐藏任何东西，直到碰到 ``{% endcomment %}``。要创建一个类似的标签，在编译函数中使用 ``parser.parse()``。

source: Here's how a simplified ``{% comment %}`` tag might be implemented::
it: Ecco come potrebbe essere implementato un tag semplificato ``{% comment %}``::
ja: 以下は ``{% comment %}`` タグをシンプル化したものです:
ko: 단순화된 ``{% comment %" 태그를 구현하는 방법은 다음과 같다.
pt_br: Aqui como uma tag ``{% comment %}`` simplificada pode ser implmentada::
zh_hans: 以下是如何实现一个简单的 ``{% comment %}`` 标签的介绍::

source: The actual implementation of :ttag:`{% comment %}<comment>` is slightly different in that it allows broken template tags to appear between ``{% comment %}`` and ``{% endcomment %}``. It does so by calling ``parser.skip_past('endcomment')`` instead of ``parser.parse(('endcomment',))`` followed by ``parser.delete_first_token()``, thus avoiding the generation of a node list.
it: L'implementazione reale di :ttag:`{% comment %}<comment>` è leggermente diversa nel fatto che permette a template tag rotti di apparire tra ``{% comment %}`` e``{% endcomment %}``. Lo fa chiamando ``parser.skip_past('endcomment')`` invece di ``parser.parse(('endcomment',))`` seguito da ``parser.delete_first_token()``, evitando la generazione di una node list.
ja: 実際の :ttag:`{% comment %}<comment>` の実装は少し異なり、 ``{% comment %}`` と ``{% endcomment %}`` の間に壊れたテンプレートタグを表示することを許可します。これは ``parser.parse(('endcomment',))`` の代わりに ``parser.skip_past('endcomment')`` を呼び出し、その後に ``parser.delete_first_token()`` を実行することで、ノードリストの生成を回避しています。
ko: :ttag:'{% comment %}'의 실제 구현은 깨진 템플릿 태그를 ``{% comment %"와 "{% end comment %}" 사이에 표시할 수 있다는 점에서 약간 다르다. 그것은 ``parser.delete_first_token('end comment')'이 아닌 ``parser.skip_past('end comment')'"라고 불러서 노드 리스트의 생성을 피한다.
pt_br: A implementação atual da :ttag:`{% comment %}<comment>` é ligeiramente diferente na medida que permite que tags de templates "quebradas" apareçam entre ``{% comment %}`` e ``{% endcomment %}``. Faz isso chamando ``parser.skip_past('endcomment')`` no lugar de ``parser.parse(('endcomment',))`` seguido por ``parser.delete_first_token()``, assim evitando gerar uma lista de nós.
zh_hans: :ttag:`{% comment %} <comment>` 的实现略有不同，它允许 ``{% comment %}`` 和 ``{% endcomment %}`` 出现破损的标记。它通过调用 ``parser.skip_past('endcomment')`` （而不是 ``parser.parse(('endcomment',))``），后跟 ``parser.delete_first_token()``，从而避免生成节点列表。
