Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: How to authenticate using ``REMOTE_USER``
it: Come autenticarsi usando ``REMOTE_USER``
ja: ``REMOTE_USER`` で認証する
ko: "REMOTE_USER"를 이용해 인증하는 방법

source: This document describes how to make use of external authentication sources (where the web server sets the ``REMOTE_USER`` environment variable) in your Django applications. This type of authentication solution is typically seen on intranet sites, with single sign-on solutions such as IIS and Integrated Windows Authentication or Apache and `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, etc.
it: Questo documento descrive come utilizzare fonti di autenticazione esterne (dove il web server imposta la variabile di ambiente ``REMOTE_USER``) nelle applicazioni Django. Questo tipo di soluzione di autenticazione tipicamente si vede in siti intranet, con soluzioni single sign-on come IIS e Integrated Windows Authentication oppure Apache and `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, ecc.
ja: このドキュメントでは、Django アプリケーション内での外部の認証ソースの使用方法について説明します。たとえば、Web サーバが ``REMOTE_USER`` を設定するような場合です。このような認証方法は、単一認証 (single sign-on) システムを利用するイントラネットサイトの多くで典型的に見られるものです。単一認証システムの例としては、IIS と統合 Windows 認証の組み合わせや、Apache と `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_ などの組み合わせがあります。

source: When the web server takes care of authentication it typically sets the ``REMOTE_USER`` environment variable for use in the underlying application. In Django, ``REMOTE_USER`` is made available in the :attr:`request.META <django.http.HttpRequest.META>` attribute. Django can be configured to make use of the ``REMOTE_USER`` value using the ``RemoteUserMiddleware`` or ``PersistentRemoteUserMiddleware``, and :class:`~django.contrib.auth.backends.RemoteUserBackend` classes found in :mod:`django.contrib.auth`.
it: Quando il web server si occupa dell'autenticazione tipicamente imposta la variabile d'ambiente ``REMOTE_USER`` da usare nell'applicazione. In Django ``REMOTE_USER`` viene resa disponibile nell'attributo :attr:`request.META <django.http.HttpRequest.META>`. Django può essere configurato per usare il valore di ``REMOTE_USER`` usando le classi ``RemoteUserMiddleware`` o ``PersistentRemoteUserMiddleware`` e :class:`~django.contrib.auth.backends.RemoteUserBackend` che si trovano in :mod:`django.contrib.auth`.
ja: Web サーバーが認証を行う際には、一般に下層のアプリケーションで使用される ``REMOTE_USER`` 環境変数を設定します。Django では、:attr:`request.META <django.http.HttpRequest.META>` 属性から ``REMOTE_USER`` が利用できます。Django は ``RemoteUserMiddleware`` または ``PersistentRemoteUserMiddleware`` 、そして :mod:`django.contrib.auth` に含まれる :class:`django.contrib.auth.backends` を使うことで ``REMOTE_USER`` の値を利用できるように設定できます。

source: Configuration
it: Configurazione
ja: 設定
ko: 설정
pt_br: Configuração
zh_hans: 配置

source: First, you must add the :class:`django.contrib.auth.middleware.RemoteUserMiddleware` to the :setting:`MIDDLEWARE` setting **after** the :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
it: In primo luogo, devi aggiungere la classe :class:`django.contrib.auth.middleware.RemoteUserMiddleware` nel file settings.py :setting:`MIDDLEWARE` posizionato **dopo** la classe :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
ja: 最初に次のように :setting:`MIDDLEWARE` 設定に :class:`django.contrib.auth.middleware.RemoteUserMiddleware` を加える必要があります。これは :class:`django.contrib.auth.middleware.AuthenticationMiddleware` の **後に** 追加してください::
ko: 우선, :class:`django.contrib.auth.middleware.AuthenticationMiddleware`\를 설정하기 전에 :setting:`MIDDLEWARE`\에 :class:`django.contrib.auth.middleware.RemoteUserMiddleware`\를 추가해야 합니다.
zh_hans: 首先，你需要向配置文件的 :setting:`MIDDLEWARE` 键中，在 :class:`django.contrib.auth.middleware.AuthenticationMiddleware` 的 **后面** 添加 :class:`django.contrib.auth.middleware.RemoteUserMiddleware` ::

source: Next, you must replace the :class:`~django.contrib.auth.backends.ModelBackend` with :class:`~django.contrib.auth.backends.RemoteUserBackend` in the :setting:`AUTHENTICATION_BACKENDS` setting::
it: Poi, devi sostituire :class:`~django.contrib.auth.backends.ModelBackend` con :class:`~django.contrib.auth.backends.RemoteUserBackend` nella impostazione di :setting:`AUTHENTICATION_BACKENDS` ::
ja: 続いて、:setting:`AUTHENTICATION_BACKENDS` 設定の :class:`~django.contrib.auth.backends.ModelBackend` を :class:`~django.contrib.auth.backends.RemoteUserBackend` に変更します::
ko: 그 다음 , :setting:`AUTHENTICATION_BACKENDS` 세팅에 있는 :class:`~django.contrib.auth.backends.ModelBackend`\를 :class:`~django.contrib.auth.backends.RemoteUserBackend`\로 바꿔야 합니다.
pt_br: Depois você deve substituir a :class:`~django.contrib.auth.backends.ModelBackend` por :class:`~django.contrib.auth.backends.RemoteUserBackend` na configuração :setting:`AUTHENTICATION_BACKENDS`::
zh_hans: 然后，你需要将设置中的 :setting:`AUTHENTICATION_BACKENDS` setting:: 键值由 :class:`~django.contrib.auth.backends.ModelBackend` 替换为 :class:`~django.contrib.auth.backends.RemoteUserBackend`::

source: With this setup, ``RemoteUserMiddleware`` will detect the username in ``request.META['REMOTE_USER']`` and will authenticate and auto-login that user using the :class:`~django.contrib.auth.backends.RemoteUserBackend`.
it: Con questa configurazione, ``RemoteUserMiddleware`` rileverà il nome utente in ``request.META['REMOTE_USER']`` e autenticherà e farà login automaticamente di quell'utente usando la :class:`~django.contrib.auth.backends.RemoteUserBackend`.
ja: この設定を行うと ``RemoteUserMiddleware`` は ``request.META['REMOTE_USER']`` 内の username を検索し、 :class:`~django.contrib.auth.backends.RemoteUserBackend` を使用したユーザーの認証と自動ログインを行います。
ko: 설정을 마치고 난 후, ``RemoteUserMiddleware``\는 유저네임을 ``request.META['REMOTE_USER']``\에서 찾을 수 있을 것 입니다. 그리고 :class:`~django.contrib.auth.backends.RemoteUserBackend`\를 이용하여 사용자를 증명하고 자동 로그인을 할 것입니다.
pt_br: Com esta configuração, o `:class:`~django.contrib.auth.middleware.RemoteUserMiddleware` irá detectar o __username__ em ``request.META['REMOTE_USER']`` e irá autenticar e automaticamente logar aquele usuário usando o :class:`~django.contrib.auth.backends.RemoteUserBackend`.
zh_hans: 通过此项设置， ``RemoteUserMiddleware`` 可以检测 ``request.META['REMOTE_USER']`` 中的用户名，而且可以认证和自动登录用户使用的 :class:`~django.contrib.auth.backends.RemoteUserBackend`。

source: Be aware that this particular setup disables authentication with the default ``ModelBackend``. This means that if the ``REMOTE_USER`` value is not set then the user is unable to log in, even using Django's admin interface. Adding ``'django.contrib.auth.backends.ModelBackend'`` to the ``AUTHENTICATION_BACKENDS`` list will use ``ModelBackend`` as a fallback if ``REMOTE_USER`` is absent, which will solve these issues.
it: Sii cosciente che questa particolare configurazione disabilita l'autenticazione con il ``ModelBackend`` di default. Questo significa che se il valore di ``REMOTE_USER`` non è impostato, l'utente non potrà fare log in, anche utilizzando l'interfaccia di amministrazione di Django. Aggiungendo ``'django.contrib.auth.backends.ModelBackend'`` all'elenco ``AUTHENTICATION_BACKENDS`` si userà ``ModelBackend`` come ripiego se è assente ``REMOTE_USER`` , risolvendo questo inconveniente.
ja: この特定の設定は、デフォルトの ``ModelBackend`` による認証を無効にすることに注意してください。つまり、 ``REMOTE_USER`` の値が設定されていなければ、Django の admin interface を使ったとしても、ユーザーはログインすることができないということです。 ``REMOTE_USER`` が存在しない場合のフォールバックとして ``AUTHENTICATION_BACKENDS`` のリストに ``'django.contrib.auth.backends.ModelBackend'`` を追加しておけば、この問題は解決できます。
ko: 이 설정은 인증을 기본 ``ModelBackend``\로 사용하지 못하게 합니다. 그 말은 만약 ``REMOTE_USER`` 값이 설정되어 있지 않으면 Django의 관리 인터페이스를 사용한다 하더라도 사용자는 로그인할 수 없다는 것입니다. ``django.contrib.auth.backends.ModelBackend``\를 ``AUTHENTICATION_BACKENDS`` 리스트에 추가하면 ``REMOTE_USER``\가 없을 경우``ModelBackend``\로 대체하여 이 문제를 해결할 수 있습니다.
pt_br: Esteja ciente de que essa definição em particular desabilita a autenticação com o padrão ``ModelBackend``. Isso significa que se o valor de ``REMOTE_USER`` não estiver definido o usuário não conseguirá logar-se, mesmo utilizando a inteface do Django admin. Adicionando ``django.contrib.auth.backends.ModelBackend`` à lista ``AUTHENTICATION_BACKENDS`` ele será utilizado como um substituto se "REMOTE_USER" estiver ausente, e esse problema não acontecerá.
zh_hans: 要注意这项设置将导致无法使用默认的 ``ModelBackend`` 验证。也就是说如果 ``REMOTE_USER`` 的值没有指定则该用户将无法登录，即使通过 Django 的管理后台。要解决这些问题，把 ``'django.contrib.auth.backends.ModelBackend'`` 加入 ``AUTHENTICATION_BACKENDS`` 列表中，则当 ``REMOTE_USER`` 未指定时，就会回退使用 ``ModelBackend``。

source: Django's user management, such as the views in ``contrib.admin`` and the :djadmin:`createsuperuser` management command, doesn't integrate with remote users. These interfaces work with users stored in the database regardless of ``AUTHENTICATION_BACKENDS``.
it: La gestione utenti di Django, come le view in ``contrib.admin`` e il comando di gestione :djadmin:`createsuperuser` , non si integrano con gli utenti remoti. Queste interfacce lavorano con gli utenti memorizzati nel database, indipendentemente dagli ``AUTHENTICATION_BACKENDS``.
ja: ``contrib.admin`` 画面や :djadmin:`createsuperuser` 管理コマンドなどの、Django のユーザ管理機能はリモートユーザを統合管理しません。これらのインタフェースは ``AUTHENTICATION_BACKENDS`` の設定にかかわらず、データベース中のユーザだけを管理します。
ko: ``contrib.admin``\의 뷰와 :djadmin:`createsuperuser` 관리 명령과 같은 Django의 사용자 관리는 원격 사용자와 통합할 수 없습니다. 이 인터페이스들은 ``AUTHENTICATION_BACKENDS``\와 상관없이 데이터페이스에 저장된 사용자와만 작동합니다.
pt_br: O gerenciamento de usuários do Django, bem como as views em ``contrib.admin``, e o comando de gerenciamento :djadmin:`createsuperuser`, não fazem integração com usuários remotos. Esta interface trabalha com usuários armazenados no banco de dados independente do ``AUTHENTICATION_BACKENDS``.
zh_hans: Django 的用户管理系统，比如 ``contrib.admin`` 中的视图函数及 :djadmin:`createsuperuser` 的管理命令，都没有与远程用户集成。这些接口只工作在数据库中存储的用户上，无论 ``AUTHENTICATION_BACKENDS`` 为何值。

source: Since the ``RemoteUserBackend`` inherits from ``ModelBackend``, you will still have all of the same permissions checking that is implemented in ``ModelBackend``.
it: Poiché il ``RemoteUserBackend`` eredita da ``ModelBackend``, avrai ancora tutto il controllo sui permessi che è implementato in ``ModelBackend``.
ja: ``RemoteUserBackend`` を ``ModelBackend`` から継承した後も、``ModelBackend`` によってチェックが行われ、すべてのパーミッションが維持されます。
ko: ``RemoteUserBackend``\는 ``ModelBackend``\를 상속하기 때문에 독자는 ``ModelBackend``\에서 구현된 권한 확인을 모두 그대로 가지고 있습니다.
pt_br: Um vez que ``RemoteUserBackend`` herda de ``ModelBackend``, você ainda terá todos as mesmas permissões de verificação que estão implementadas em ``ModelBackend``.
zh_hans: 因为 ``RemoteUserBackend`` 继承自 ``ModelBackend``, 您仍将拥有在 ``ModelBackend`` 中实现的所有相同的权限检查。

source: Users with :attr:`is_active=False <django.contrib.auth.models.User.is_active>` won't be allowed to authenticate. Use :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` if you want to allow them to.
it: Gli utenti con l'attributo :attr:`is_active=False <django.contrib.auth.models.User.is_active>` non avranno il permesso di autenticarsi. Usa :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` se vuoi permettere l'autenticazione.
ja: :attr:`is_active=False <django.contrib.auth.models.User.is_active>` 属性を持つユーザは認証が許可されません。許可したい場合は、:class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` を使用してください。
ko: :attr:`is_active=False <django.contrib.auth.models.User.is_active>`\인 사용자에게는 인증이 허락되지 않을 것입니다. 허락을 하기 위해서는 :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend`\를 사용하세요.
zh_hans: 具有 :attr:`is_active=False <django.contrib.auth.models.User.is_active>` 的用户将被禁止验证。你可以使用 :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` 来允许验证。

source: If your authentication mechanism uses a custom HTTP header and not ``REMOTE_USER``, you can subclass ``RemoteUserMiddleware`` and set the ``header`` attribute to the desired ``request.META`` key. For example::
it: Se il tuo meccanismo di autenticazione usa una intestazione HTTP personalizzata, e non ``REMOTE_USER``, puoi derivare ``RemoteUserMiddleware`` e impostare l'attributo ``header`` alla chiave ``request.META`` desiderata. Per esempio::
ja: 認証メカニズムが ``REMOTE_USER`` 以外のカスタム HTTP ヘッダを使っている場合には、以下の例のように ``RemoteUserMiddleware`` をサブクラス化して、クラスの ``header`` 属性を適切な ``request.META`` のキー名に設定してください::
ko: 만약에 여러분의 인증 메커니즘이 ``REMOTE_USER``\가 아닌 맞춤 HTTP 헤더를 사용한다면 독자는 ``RemoteUserMiddleware``\를 서브클래스화할 수 있고 ``header`` 속성을 요구되는 ``request.META`` 키로 설정할 수 있습니다. 다음의 예를 보세요.
pt_br: Se o seu mecanismo de autenticação utilizar um cabeçalho HTTP custumizado e não o ``REMOTE_USER`, você pode utilizar a subclass ``RemoteUserMiddleware`` e definir o atributo ``header`` para atribuir a chave ``request.META``. Por exemplo::
zh_hans: 如果你的验证机制使用一个自定义的 HTTP 头部而不是 ``REMOTE_USER``，你可以构建一个 ``RemoteUserMiddleWare`` 的子类然后把 ``header`` 属性设成你希望的 ``request.META`` 键值。例如::

source: Be very careful if using a ``RemoteUserMiddleware`` subclass with a custom HTTP header. You must be sure that your front-end web server always sets or strips that header based on the appropriate authentication checks, never permitting an end-user to submit a fake (or "spoofed") header value. Since the HTTP headers ``X-Auth-User`` and ``X-Auth_User`` (for example) both normalize to the ``HTTP_X_AUTH_USER`` key in ``request.META``, you must also check that your web server doesn't allow a spoofed header using underscores in place of dashes.
it: Sii molto attento se utilizzi una sottoclasse di ``RemoteUserMiddleware`` con un'intersatione HTTP personalizzata. Devi essere sicuro che il tuo front-end web server imposti sempre o rimuova quella intestazione in base agli appropriati controlli di autenticazione, impedendo ad un utente di inviare un falso (o "spoofed") valore di intestazione . Poiché le intestazioni HTTP ``X-Auth-User`` e ``X-Auth_User`` (per esempio) sono entrambe normalizzate alla chiave ``HTTP_X_AUTH_USER`` in ``request.META``, devi anche controllare che il tuo web server non permetta intestazioni false utilizzando trattini bassi al posto dei trattini.
ja: もし ``RemoteUserMiddleware`` のサブクラスをカスタム HTTP ヘッダーとともに使う場合は、十分に注意してください。フロントエンドのウェブサーバは、適切な認証のチェックに基づいて、必ずヘッダーを設定または削除するようにしなければなりまません。偽の (もしくは「スプーフィングされた」) ヘッダー値を送ってくるエンドユーザーを決して許可してはいけません。たとえば、HTTP ヘッダの ``X-Auth-User`` と ``X-Auth_User`` は、両方とも ``request.META`` の ``HTTP_X_AUTH_USER`` キーに正規化されてしまうため、ウェブサーバーがダッシュの代わりにアンダースコアを使用してスプーフィングされたヘッダーを許容しないことを必ず確認しなければなりません。
ko: 맞춤 HTTP 헤더로 ``RemoteUserMiddleware`` 서브클래스를 사용한다면 매우 조심해야 합니다. 독자는 반드시 자신의 프론트엔드 웹서버가 최종 사용자가 가짜 헤더 값을 보내는 것을 허용하지 않도록 헤더를 적절한 인증 확인을 기반으로 설정하여야 합니다. HTTP 헤더 ``X-Auth-User``\와 ``X-Auth_User`` (예를 들어) 모두 ``request.META``\에서 ``HTTP_X_AUTH_USER`` 키로 표준화되기 때문에 독자는 또한 본인의 웹 서버가 밑줄을 사용한 스푸핑된 헤더를 허용하지 않도록 확인하여야 합니다.
pt_br: Tenha muito cuidado se usar a subclasse ``RemoteUserMiddleware`` com um cabeçalho HTTP customizado. Tenha certeza que o servidor de front-end sempre defina ou retire o cabeçalho baseado nos checks de autenticação apropriados, nunca permitindo que um usuário submeta um falso (ou falsificado) valor no cabeçalho. Já que os cabeçalhos HTTP ``X-Auth-User`` e o ``X-Auth_User`` (por exemplo) são ambos normalizados para a chave ``HTTP_X_AUTH_USER`` no ``request.META``, tem que ser verificado que o seu servidor web não aceita um cabeçalho falsificado usando "underscores" no lugar de traços.
zh_hans: 使用具有自定义HTTP头部的 ``RemoteUserMiddleware`` 子类时需要特别小心。你要确保你的前端服务器基于验证检查结果正确设置或去除了该头部，禁止任何终端用户提交一个仿冒的头部值。因为HTTP头部 ``X-Auth-User`` 与（比方说） ``X-Auth_User`` 都会标准化为 ``request.META`` 的 ``HTTP_X_AUTH_USER`` 键，你必须确保你的服务器不允许头部使用下划线来替代横杠。

source: This warning doesn't apply to ``RemoteUserMiddleware`` in its default configuration with ``header = 'REMOTE_USER'``, since a key that doesn't start with ``HTTP_`` in ``request.META`` can only be set by your WSGI server, not directly from an HTTP request header.
it: Questo avvertimento non si applica a ``RemoteUserMiddleware`` nella sua configurazione di default con ``header = 'REMOTE_USER'``, perché una chiave che non inizia con ``HTTP_`` in ``request.META`` può essere impostata solo dal tuo server WSGI, non direttamente da una intestazione di richiesta HTTP.
ja: この警告は、デフォルト設定の ``header = 'REMOTE_USER'`` になっている ``RemoteUserMiddleware`` には適用されません。なぜなら、``request.META`` 内の ``HTTP_`` で始まらないキーは WSGI サーバだけが設定でき、、HTTP リクエストヘッダーから直接設定されるわけではないためです。
ko: 이 경고는 ``header = 'REMOTE_USER'``\인 기본 설정에서 ``RemoteUserMiddleware``\를 적용하지 않습니다. ``request.META``\에서 ``HTTP_``\로 시작하지 않는 키는 HTTP 요청 헤더로부터 직접이 아닌 WSGI 서버를 통해서만 설정될 수 있기 때문입니다.
pt_br: Este alerta não se aplica ao ``RemoteUserMiddleware`` na sua configuração default ``header = 'REMOTE_USER'``, já que uma chave que não inicie com ``HTTP_`` em ``request.META`` só pode ser setada pelo servidor WSGI, e não diretamente do cabeçalho da requisição HTTP
zh_hans: 这个警告不适用于 ``RemoteUserMiddlewar``，它的默认配置为 ``header ='REMOTE_USER'``, 因为在 ``request.META`` 中不存在以 ``HTTP_`` 开始的键可以只由WSGI服务器设置, 而不能直接来自HTTP请求头部.

source: If you need more control, you can create your own authentication backend that inherits from :class:`~django.contrib.auth.backends.RemoteUserBackend` and override one or more of its attributes and methods.
it: Se hai necessità di più controllo, puoi creare il tuo backend di autenticazione che eredita da :class:`~django.contrib.auth.backends.RemoteUserBackend` e sostituisce uno o più dei suoi attributi e metodi.
ja: 認証メカニズムをより細かく制御したい場合は、 :class:`~django.contrib.auth.backends.RemoteUserBackend` を継承する独自の認証バックエンドを作成し、属性やメソッドをいくつかオーバライドしてください。
ko: 만약 독자가 더 많은 제어를 필요로 할 경우, :class:`~django.contrib.auth.backends.RemoteUserBackend`\를 상속하는 인증 백엔드를 스스로 만들어 하나 이상의 속성과 메소드를 오버라이드할 수 있습니다.
pt_br: Se você precisa de mais controle, é possível criar seu próprio "backend" de autenticação que herda de :class:`~django.contrib.auth.backends.RemoteUserBackend` e sobrescreve um ou mais de seus atributos e métodos.
zh_hans: 如果你需要更多控制, 你可以通过继承 :class:`~django.contrib.auth.backends.RemoteUserBackend` 并且覆盖其一个或多个属性和方法来创建你自己的验证后端.

source: Using ``REMOTE_USER`` on login pages only
it: Usare ``REMOTE_USER`` solo sulle pagine di login
ja: ログインページでのみ ``REMOTE_USER`` を使用する
ko: ``REMOTE_USER``\는 로그인 페이지에서만 사용할 수 있습니다.
pt_br: Usando ``REMOTE_USER`` apenas nas páginas de login.
zh_hans: 仅在登录界面使用 ``REMOTE_USER``

source: The ``RemoteUserMiddleware`` authentication middleware assumes that the HTTP request header ``REMOTE_USER`` is present with all authenticated requests. That might be expected and practical when Basic HTTP Auth with ``htpasswd`` or similar mechanisms are used, but with Negotiate (GSSAPI/Kerberos) or other resource intensive authentication methods, the authentication in the front-end HTTP server is usually only set up for one or a few login URLs, and after successful authentication, the application is supposed to maintain the authenticated session itself.
it: Il ``RemoteUserMiddleware`` presuppone che l'intestazione HTTP ``REMOTE_USER`` sia presente in tutte le richieste che necessitano di autenticazione. Può essere quindi usato quando si ha a che fare con il Basic HTTP Auth con ``htpasswd`` o altri semplici meccanismi; quando invece si usa Negotiate (GSSAPI/Kerberos) o un altro metodo di autenticazione che richiede maggiori risorse, l'autenticazione nel server HTTP di front-end è normalmente utilizzata in ambienti ristretti con pochi URL di accesso, e dopo un'autenticazione riuscita, si suppone che l'applicazione mantenga autonomamente la sessione autenticata.
ja: ``RemoteUserMiddleware`` 認証ミドルウェアは、 HTTP リクエストヘッダーの ``REMOTE_USER`` が認証されたリクエストに存在していることを想定しています。これは、``htpasswd`` や同様のメカニズムを備えた Basic 認証であれば妥当で実用的かもしれませんが、Negotiate (GSSAPI/Kerberos) や他のリソース中心的な認証メソッドでは、フロントエンド HTTP サーバ内の認証は、通常、1つまたは少数のログイン URL しか設置せず、認証の成功後にもアプリケーションが認証されたセッション自体を維持することが想定されています。
ko: 인증 미들웨어인 ``RemoteUserMiddleware``\는 HTTP 요청 헤더인 ``REMOTE_USER``\가 모든 인증된 요청과 함께 존재한다는 것을 가정합니다. 이것은 Basic HTTP Auth가 ``htpasswd`` 또는 기타 간단한 메커니즘들과 함께일 때 기대거나 실용적이지만, Negotiate(GSSAPI / Kerberos) 또는 기타 자원 집약적인 인증 방법과 함께 일 때는, 프런트엔드 HTTP 서버에서의 인증은 일반적으로 하나 또는 몇 개의 로그인 URL을 설정해야하고, 인증이 성공하면 응용 프로그램은 인증된 세션 자체가 유지 관리된다라는 조건이여야합니다.

source: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` provides support for this use case. It will maintain the authenticated session until explicit logout by the user. The class can be used as a drop-in replacement of :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` in the documentation above.
it: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` fornisce supporto per questo caso d'uso. Mantiene la sessione autenticata fino ad un logout esplicito dell'utente. La classe può essere usata in sostituzione in cascata di :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` nella documentazione di cui sopra.
ja: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` は、このようなユースケースへのサポートを提供します。このミドルウェアは、ユーザーが明示的にログアウトするまで、認証されたセッションを維持しようとします。このクラスは、上述のドキュメント内の :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` とドロップインで交換できます。
ko: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware`\는 사용 사례에 대한 지원을 제공합니다. 이것은 사용자에 의하여 명시적으로 로그아웃할 때까지 인증된 세션을 유지 관리할 것 입니다. 이 클래스는 위의 문서에서 :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` 일시 대체품으로 사용되어질 수 있습니다.
pt_br: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` provê suporte para este caso de uso. Ele manterá a sessão de autenticação até o logout explicito do usuário. A classe pode ser usada como um substituto constante para :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` na documentação acima.
zh_hans: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` 就针对这个使用场景提供了支持。除非用户显式地退出登录，它将一直保留已认证的会话。这个中间件可以代替上文中的 :class:`~django.contrib.auth.middleware.RemoteUserMiddleware`。

source: How to use Django's CSRF protection
it: Come usare la protezione CSRF di Django
ja: Django の CSRF 保護を利用する

source: To take advantage of CSRF protection in your views, follow these steps:
it: Per trarre vantaggio dalla protezione di CSRF nelle tue view, segui questi passi:
ja: CSRF 対策をあなたのビューで有効にするには、以下の手順に従ってください:

source: The CSRF middleware is activated by default in the :setting:`MIDDLEWARE` setting. If you override that setting, remember that ``'django.middleware.csrf.CsrfViewMiddleware'`` should come before any view middleware that assume that CSRF attacks have been dealt with.
it: Il middleware CSRF viene attivato di default nell'impostazione :setting:`MIDDLEWARE`. Se sovrascrivi quella impostazione, ricorda che ``'django.middleware.csrf.CsrfViewMiddleware'`` dovrebbe stare prima di ogni middleware per le view che assume che ci si sia già occupati degli attacchi CSRF.
ja: CSRF ミドルウェアは、デフォルトで :setting:`MIDDLEWARE` 設定で有効になっています。もし設定をオーバーライドするときは、``'django.middleware.csrf.CsrfViewMiddleware'`` が、 CSRF 攻撃への対策がされていることを前提とした他の全てのビュー・ミドルウェアの前に来るようにしてください。

source: If you disabled it, which is not recommended, you can use :func:`~django.views.decorators.csrf.csrf_protect` on particular views you want to protect (see below).
it: Se l'hai disabilitato, cosa che non è raccomandata, puoi usare :func:`~django.views.decorators.csrf.csrf_protect` sulle specifiche view che vuoi proteggere (vedi sotto).
ja: (推奨されませんが) もし対策を無効にする場合は、:func:`~django.views.decorators.csrf.csrf_protect` を使って特定のビューを保護することができます (下記を参照してください)。

source: In any template that uses a POST form, use the :ttag:`csrf_token` tag inside the ``<form>`` element if the form is for an internal URL, e.g.:
it: In ogni template che utilizzi un form POST, usa il tag :ttag:`csrf_token` dentro l'elemento ``<form>`` se il form fa riferimento ad un URL interna, per es.:
ja: POST フォームを使う全てのテンプレートで、POST が内部 URL に使われる場合は、``<form>`` 要素の内部で :ttag:`csrf_token` タグを使用してください。
