Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The virtual environment will be activated and you'll see "(project-name)" next to the command prompt to designate that. Each time you start a new command prompt, you'll need to activate the environment again.
it: L'ambiente virtuale verrà attivato e vedrai "(nome-progetto)" accanto al prompt dei comandi per designarlo. Ogni volta che avvii un nuovo prompt dei comandi, dovrai attivare nuovamente l'ambiente.
ja: 仮想環境がアクティブ化され、コマンドプロンプトの隣にそれを示す "(project-name)" が表示されます。新しいコマンドプロンプトを開始するたびに、環境を再度アクティブにする必要があります。
ko: 가상 환경이 활성화되고 명령 프롬프트 옆에 "(프로젝트 이름)"이 표시되어 가상 환경을 지정합니다. 새 명령 프롬프트를 시작할 때마다 환경을 다시 활성화해야 합니다.

source: Install Django
it: Installa Django
ja: Django をインストールする
ko: 장고 설치
pt_br: Instalando Django
zh_hans: 安装 Django

source: Django can be installed easily using ``pip`` within your virtual environment.
it: Django puo essere installato utilizzando ``pip`` nel tuo ambiente virtuale.
ja: Django は仮想環境内で ``pip`` を使って簡単にインストールできます。
ko: Django는 가상 환경 내에서 "pip"을 사용하여 쉽게 설치할 수 있습니다.
zh_hans: Django 可以轻松地在你的虚拟环境中使用 ``pip`` 安装。

source: In the command prompt, ensure your virtual environment is active, and execute the following command:
ja: コマンドプロンプトで、仮想環境がアクティブであることを確認して、以下のコマンドを実行します：

source: This will download and install the latest Django release.
it: Questo scarichera e installera l'ultima versione di Django
ja: これにより、Django の最新版のリリースがダウンロードされ、インストールされます。
ko: 그러면 최신 Django 릴리스가 다운로드되고 설치됩니다.
pt_br: Isso irá baixar e instalar a última versão do Django.
zh_hans: 这将下载并安装最新的 Django 发布版本。

source: After the installation has completed, you can verify your Django installation by executing ``django-admin --version`` in the command prompt.
it: Dopo che l'installazione è stata completata, puoi verificare la tua installazione di Django eseguendo ``django-admin --version`` nel prompt dei comandi.
ja: インストールが完了したら、コマンドプロンプトで ``django-admin --version`` というコマンドを実行することで、Django が正しくインストールされたかどうかを確認することができます。
ko: 설치가 완료되면 명령 프롬프트에서 "django-admin --version"을 실행하여 Django 설치를 확인할 수 있습니다.
pt_br: Depois que a instalação for concluída, você pode verificar sua instalação do Django executando ``django-admin --version`` na linha de comando.
zh_hans: 安装完成后，你可以在命令提示符运行 ``django-admin --version`` 验证你安装的 Django。

source: See :ref:`database-installation` for information on database installation with Django.
it: Vedere :ref:`database-installation` per informazioni sull'installazione del database con Django.
ja: Django とともにデータベースをインストールするための情報については、 :ref:`database-installation` を参照してください。
ko: Django와의 데이터베이스 설치에 대한 자세한 내용은:ref:'데이터베이스 설치'를 참조하십시오.
pt_br: Veja :ref:`database-installation` para informações sobre instalação do banco de dados com Django.
zh_hans: 参考 :ref:`数据库安装` 了解如何通过 Django 安装数据库。

source: Colored terminal output
it: Risultato colorato del terminale
ja: ターミナルのカラー出力

source: A quality-of-life feature adds colored (rather than monochrome) output to the terminal. In modern terminals this should work for both CMD and PowerShell. If for some reason this needs to be disabled, set the environmental variable :envvar:`DJANGO_COLORS` to ``nocolor``.
it: Una funzione di qualità della vita aggiunge un output colorato (anziché monocromatico) al terminale. Nei terminali moderni questo dovrebbe funzionare sia per CMD che per PowerShell. Se per qualche motivo questo deve essere disabilitato, imposta la variabile ambientale :envvar:`DJANGO_COLORS` su ``nocolor``.
ja: クオリティ・オブ・ライフ機能により、ターミナルに（モノクロではなく）色のついた出力が追加されます。最近の端末ではCMDとPowerShellの両方で動作するはずです。何らかの理由で無効にしたい場合は、環境変数 :envvar:`DJANGO_COLORS` を ``nocolor`` に設定してください。

source: On older Windows versions, or legacy terminals, :pypi:`colorama` 0.4.6+ must be installed to enable syntax coloring:
ja: 古いWindowsバージョンやレガシー端末では、シンタックスカラーリングを有効にするには :pypi:`colorama` 0.4.6 以上をインストールする必要があります:

source: See :ref:`syntax-coloring` for more information on color settings.
it: Vedere :ref:`syntax-coloring` per ulteriori informazioni sulle impostazioni del colore.
ja: 色の設定については :ref:`syntax-coloring` を参照してください。

source: Common pitfalls
it: Insidie comuni
ja: よくある落とし穴
ko: 공통적인 함정
pt_br: Armadilhas comuns
zh_hans: 常见失误

source: If ``django-admin`` only displays the help text no matter what arguments it is given, there is probably a problem with the file association in Windows. Check if there is more than one environment variable set for running Python scripts in ``PATH``. This usually occurs when there is more than one Python version installed.
it: Se ``django-admin`` mostra solo un testo di aiuto, non importa che argomenti gli si diano, probabilmente c'è un problema di associazione di file in Windows. Controlla se c'è più di una variabile di ambiente impostata per lanciare gli script Python in ``PATH``. Questo generalmente accade quando c'è più di una versione di Python installata.
ja: どんな引数を与えても ``django-admin`` がヘルプテキストしか表示してくれない場合、Windows のファイルの関連付けに問題がある可能性があります。``PATH`` に Python のスクリプトを実行するのに必要な環境変数が2つ以上設定されていないかどうか確認してください。2つ以上のバージョンの Python をインストールした時にこの問題が起こることがあります。
ko: 만약 "django-admin"이 어떤 주장이 주어지더라도 도움말 텍스트만 표시한다면, 윈도우의 파일 연결에 문제가 있을 것입니다. "PATH"에서 Python 스크립트를 실행하기 위해 둘 이상의 환경 변수가 설정되어 있는지 확인합니다. 일반적으로 Python 버전이 두 개 이상 설치된 경우 이러한 문제가 발생합니다.
pt_br: Se o ``django-admin`` somente mostra o texto de help não importando quais argumentos lhe é dado, provavelmente tem um problema com a associação do arquivo no windows. Verifique se existe mais de uma variável de ambiente definida para rodar os scripts Python no ``PATH``. Isso occore quando existe mais de uma versão de Python instalada.
zh_hans: 若 ``django-admin`` 无论输入啥参数都只显示帮助信息，这可能是一个 Windos 的文件关联问题。检查 ``PATH`` 中是否不止一个用于运行 Python 脚本的环境变量。该问题通常在安装了多个 Python 版本时出现。

source: If you are connecting to the internet behind a proxy, there might be problems in running the command ``py -m pip install Django``. Set the environment variables for proxy configuration in the command prompt as follows:
ja: プロキシ経由でインターネットに接続している場合、コマンド ``py -m pip install Django`` の実行がうまくいかないかもしれません。コマンドプロンプトで、プロキシ設定用の環境変数を以下のように設定してください:

source: In general, Django assumes that ``UTF-8`` encoding is used for I/O. This may cause problems if your system is set to use a different encoding. Recent versions of Python allow setting the :envvar:`PYTHONUTF8` environment variable in order to force a ``UTF-8`` encoding. Windows 10 also provides a system-wide setting by checking ``Use Unicode UTF-8 for worldwide language support`` in :menuselection:`Language --> Administrative Language Settings --> Change system locale` in system settings.
it: In generale, Django assume che per l'I/O venga usato l'encoding ``UTF-8``. Questo può causare problemi se il tuo sistema è impostato per usare un encoding differente. Versioni recenti di Python permettono di impostare la variabile di ambiente :envvar:`PYTHONUTF8` per forzare l'encoding ``UTF-8``. Windows 10 offre una impostazione a livello di sistema, spuntando ``Usa Unicode UTF-8 per il supporto alle lingue di tutto il mondo`` in :menuselection:`Lingua --> Impostazioni di Amministrazione della Lingua --> Cambia il locale del sistema` nelle impostazioni di sistema.
ja: 一般に、Django は ``UTF-8`` エンコーディングが入出力に使われることを想定しています。このため、システムが別のエンコーディングを使うように設定されていると、 問題を引き起こすかもしれません。最近のバージョンの Python では、 :envvar:`PYTHONUTF8` 環境変数を設定することで、 ``UTF-8`` エンコーディングを強制できます。Windows 10 では、システム設定の :menuselection:`言語 --> 管理用の言語の設定 --> システム ロケールの変更` にある ``ワールドワイド言語サポートで Unicode UTF-8 を使用`` をチェックすることで、システム全体の設定を行うこともできます。

source: How to create database migrations
it: Come creare migrazioni di database
ja: データベースのマイグレーションの作成方法

source: This document explains how to structure and write database migrations for different scenarios you might encounter. For introductory material on migrations, see :doc:`the topic guide </topics/migrations>`.
it: Questo documento spiega come strutturare e scrivere migrazioni di database per diversi scenari che potresti incontrare. Per materiale introduttivo sulle migrazioni, vedere :doc:`the topic guide </topics/migrations>`.
ja: このドキュメントでは、遭遇する可能性のあるいくつかのシナリオに対する、データベースのマイグレーションの構成方法と書き方について説明します。マイグレーションに関する入門的な資料を探しているなら、:doc:`トピック別ガイド </topics/migrations>` を読んでください。
ko: 이 문서에서는 발생할 수 있는 다양한 시나리오에 대해 데이터베이스 마이그레이션을 구성하고 쓰는 방법을 설명합니다. 마이그레이션에 대한 소개 자료는 :doc: '주제 가이드'를 참조하십시오.
pt_br: Este documento explica como estruturar e a escrever migrações de banco de dados para diferentes cenários que você talvez encontre.
zh_hans: 本文介绍了如何为可能遇到的不同场景组织和编写数据库迁移。关于迁移的介绍性资料，参考 :doc:`专题指南</topics/migrations>`。

source: Data migrations and multiple databases
it: Migrazioni dati e database multipli
ja: データのマイグレーションと複数のデータベース
ko: 데이터 마이그레이션 및 여러 데이터베이스를 사용합니다.
pt_br: Migrações de dados e múltimplos bancos de dados
zh_hans: 数据迁移和多种数据库

source: When using multiple databases, you may need to figure out whether or not to run a migration against a particular database. For example, you may want to **only** run a migration on a particular database.
it: Quando usi più database, potresti aver bisogno di capire se è necessario utilizzare una migrazione per un particolare database. Per esempio, puoi voler lanciare **solo** una migrazione verso uno specifico database.
ja: 複数のデータベースを使用している場合、特定のデータベースに対してマイグレーションを実行するかどうかを判断する必要があるかもしれません。例えば、特定のデータベースに対してのみマイグレーションを実行したい場合です。
ko: 여러 데이터베이스를 사용할 때 특정 데이터베이스에 대해 마이그레이션을 실행할지 여부를 결정해야 할 수도 있습니다. 예를 들어 특정 데이터베이스에서 **만* 마이그레이션을 실행할 수 있습니다.
pt_br: Quando isar múltimplos bancos de dados, você talvez precisse entender onde rodar e onde não rodar migrações para um banco de dados em partiular. Por exemplo, você talvez queira **somente** rodar migrações para um banco de dados em particular.
zh_hans: 使用多种数据库时，你可能需要指定是否为特定数据库运行迁移。例如，你可能 **只想** 为特定数据库运行迁移。

source: In order to do that you can check the database connection's alias inside a ``RunPython`` operation by looking at the ``schema_editor.connection.alias`` attribute::
it: Per fare ciò è possibile controllare l'alias della connessione del database all'interno di un'operazione ``RunPython`` guardando l'attributo ``schema_editor.connection.alias``::
ja: これを行うには、 ``RunPython`` 操作の中で、 ``schema_editor.connection.alias`` 属性を見て、データベース接続のエイリアスを確認します:
ko: 그러기 위해서 당신은 ``schema_editor.connection"을 보면 ``RunPython" 운영 내에서 데이터베이스 연결의 별칭을 확인할 수 있습니다.별칭 속성:입니다.
pt_br: Para fazer isso você pode verificar o alias da conexão com o banco de dados dentro de uma operação ``RunPython`` olhando no attributo ``schema_editor.connection.alias``::
zh_hans: 为此，你可以在 ``RunPython`` 操作中检查数据库连接别名，通过查看 ``schema_editor.connection.alias`` 属性::

source: You can also provide hints that will be passed to the :meth:`allow_migrate()` method of database routers as ``**hints``:
it: Puoi anche fornire suggerimenti che verranno passati al metodo :meth:`allow_migrate()` del router di database come ``**hints``:
ja: また、データベースルーターの :meth:`allow_migrate()` メソッドに渡すヒントを ``**hints`` として指定することもできます:
ko: <div></div>
pt_br: Você pode fornecer dicas que serão passadas para o método :meth:`allow_migrate()` do roteador de banco de dados como ``**hints``:
zh_hans: 你也能提供会以 ``**hints`` 传递给数据库路由器的 :meth:`allow_migrate()` 方法的提示：

source: Then, to leverage this in your migrations, do the following::
it: Quindi, per sfruttare questo nelle tue migrazioni, procedi come segue:
ja: これをマイグレーションに利用するには、次のようにします:
ko: 마이그레이션 시 이 기능을 활용하려면 다음을 수행하십시오.
pt_br: Então para aproveitar isso em suas migrações, faça o seguinte::
zh_hans: 然后，要将其在迁移中生效，像下面这样做::

source: If your ``RunPython`` or ``RunSQL`` operation only affects one model, it's good practice to pass ``model_name`` as a hint to make it as transparent as possible to the router. This is especially important for reusable and third-party apps.
it: Se la tua operazione ``RunPython`` o ``RunSQL`` interessa solo un modello, è buona norma passare ``model_name`` come suggerimento per renderlo il più trasparente possibile al router. Ciò è particolarmente importante per le app riutilizzabili e di terze parti.
ja: もし ``RunPython`` や ``RunSQL`` 操作が 1 つのモデルにしか影響しないのであれば、 ``model_name`` をヒントとして渡すことで、ルーターに対して最大限、透過的になります。これは再利用可能なサードパーティアプリにとって特に重要です。
ko: 만일 당신의 ``RunPython" 또는 "RunSQL" 작업이 하나의 모델에만 영향을 준다면, 가능한 한 투명하게 라우터에 알리기 위해 "model_name"을 힌트로 전달하는 것이 좋은 관행입니다. 이는 재사용 가능한 앱과 타사 앱에서 특히 중요합니다.
pt_br: Se você executar ``RunPython`` ou ``RunSQL`` as operações só irão afetar um modelo, e isso é uma boa passar ``model_name`` como uma dica para que fique tão tranaprente quanto possível para o roteador. Isso é especialmente importante para reutilização e applicações de terceiros.
zh_hans: 若你的 ``RunPython`` 或 ``RunSQL`` 操作只影响了一个模型，为其传入 ``model_name`` 作为提示，使其对路由器更加透明。这对可复用的和第三方应用特别重要。

source: Migrations that add unique fields
it: Migrazioni che aggiungono campi univoci
ja: ユニークなフィールドを追加するマイグレーション
ko: 고유한 필드를 추가하는 마이그레이션입니다.
pt_br: Migrações que adicionam campos "unique"
zh_hans: 添加独一无二字段的迁移

source: Applying a "plain" migration that adds a unique non-nullable field to a table with existing rows will raise an error because the value used to populate existing rows is generated only once, thus breaking the unique constraint.
it: L'applicazione di una migrazione "plain" che aggiunge un campo univoco non annullabile a una tabella con righe esistenti genererà un errore poiché il valore utilizzato per popolare le righe esistenti viene generato una sola volta, interrompendo così il vincolo univoco.
ja: 既存の行を持つテーブルにユニークな非 Null フィールドを追加する「プレーン」なマイグレーションを適用するとエラーが発生します。これは、既存の行すべてを埋めるために使用される値がただ一つだけ生成され、これがユニーク制約に違反するためです。
ko: 기존 행이 있는 테이블에 null이 아닌 고유한 필드를 추가하는 "일반" 마이그레이션을 적용하면 기존 행을 채우는 데 사용되는 값이 한 번만 생성되므로 고유한 제약 조건이 해제되기 때문에 오류가 발생합니다.
pt_br: Aplicar uma migração "sem customizações" que adicione um campo não nulo e "unique" a uma table com registros existentes irá emitir um erro porque o valor usado para popular os registros existente é gerado somente uma vez, então quebrando o "contraint" "unique".
zh_hans: 应用 “普通” 迁移，将新的唯一非空的字段添加到已拥有一些行的表格会抛出一个错误，因为用于填充现有行的值只生成一次，从而打破了唯一约束。唯一非空字段即所有行的该字段都不能为空，且值唯一，不能重复。

source: Therefore, the following steps should be taken. In this example, we'll add a non-nullable :class:`~django.db.models.UUIDField` with a default value. Modify the respective field according to your needs.
it: Pertanto, è necessario eseguire i seguenti passaggi. In questo esempio, aggiungeremo un non-nullable :class:`~django.db.models.UUIDField` con un valore predefinito. Modifica il rispettivo campo in base alle tue esigenze.
ja: そのため、次の手順を踏む必要があります。この例では、デフォルト値を持つ非 Null の :class:`~django.db.models.UUIDField` を追加します。必要に応じて、該当するフィールドを変更してください。
ko: 따라서 다음 단계를 수행해야 합니다. 이 예에서는 Null이 아닌 :class를 추가합니다.'~django.db.db.class입니다.기본값인 UUIDField'입니다. 필요에 따라 각 필드를 수정합니다.
pt_br: Portanto, os seguintes passos devem ser seguidos. Neste exemplo, nós iremos adicionar um :class:`~django.db.models.UUIDField` não-nulo com um valor padrão. Modifique o campo respectivo de acordo com suas necessidades.
zh_hans: 因此，需要做以下步骤。在本例中，我们将添加一个带默认值的非空 :class:`~django.db.models.UUIDField`。根据你的需要修改对应字段。

source: Add the field on your model with ``default=uuid.uuid4`` and ``unique=True`` arguments (choose an appropriate default for the type of the field you're adding).
it: Aggiungi il campo al tuo modello con gli argomenti ``default=uuid.uuid4`` e ``unique=True`` (scegli un valore predefinito appropriato per il tipo di campo che stai aggiungendo).
ja: モデルに ``default=uuid.uuid4`` と ``unique=True`` 引数を持つフィールドを追加します（追加するフィールドのタイプに適切なデフォルトを選択してください）。
ko: ``default = uuid"를 사용하여 모델에 필드를 추가합니다.uuid4와 "hydp*"로 구성됩니다.True' 인수(추가하려는 필드 유형에 적합한 기본값 선택)를 선택합니다.
pt_br: Adicione o campo no seu modelo com ``default=uuid.uuid4`` e argumentos ``unique=True`` (escolha um padrão apropriado para o tipo de campor que você está adicionando).
zh_hans: 在模型中以 ``default=uuid.uuid4`` 和 ``unique=True`` 参数添加该字段（根据字段类型，为其选择一个合适的默认值）。

source: Run the :djadmin:`makemigrations` command. This should generate a migration with an ``AddField`` operation.
it: Esegui il comando :djadmin:`makemigrations`. Questo dovrebbe generare una migrazione con un'operazione ``AddField``.
ja: :djadmin:`makemigrations` コマンドを実行します。これにより、 ``AddField`` 操作を含むマイグレーションが生成されます。
ko: :djadmin:'make migration' 명령을 실행합니다. 이는 ``Add Field" 작전으로 이주를 창출해야 합니다.
pt_br: Execute o comando :djadmin:`makemigrations` . Isso deve gerar uma migração com uma operação ``AddField``.
zh_hans: 运行 :djadmin:`makemigrations` 命令。这将生成一个 ``AddField`` 操作的迁移。

source: Generate two empty migration files for the same app by running ``makemigrations myapp --empty`` twice. We've renamed the migration files to give them meaningful names in the examples below.
it: Genera due file di migrazione vuoti per la stessa app eseguendo due volte ``makemigrations myapp --empty``. Abbiamo rinominato i file di migrazione per assegnare loro nomi significativi negli esempi seguenti.
ja: 同じアプリに対して ``makemigrations myapp --empty`` を2回実行して、2つの空のマイグレーションファイルを生成します。以下の例では、マイグレーションファイルにわかりやすい名前を付けるためにファイル名を変更しています。
ko: 동일한 앱에 대해 "마이 앱으로 마이그레이션 -- 비우기"를 두 번 실행하여 두 개의 빈 마이그레이션 파일을 생성합니다. 아래의 예에서 의미 있는 이름을 지정하기 위해 마이그레이션 파일의 이름을 변경했습니다.
pt_br: Gera dois arquivos de migrações vazios para a mesma aplicação rodando ``makemigrations myapp --empty`` duas vezes. Renomeamos os arquivos de migração para dara eles nomes significativos nos exemplos abaixo
zh_hans: 通过运行 ``makemigrations myapp --empty`` 两次为同一应用生成两个相同的空迁移文件。我们已在以下例子中将迁移文件重命名成有意义的名字。

source: Copy the ``AddField`` operation from the auto-generated migration (the first of the three new files) to the last migration, change ``AddField`` to ``AlterField``, and add imports of ``uuid`` and ``models``. For example:
it: Copia l'operazione ``AddField`` dalla migrazione generata automaticamente (il primo dei tre nuovi file) all'ultima migrazione, cambia ``AddField`` in ``AlterField`` e aggiungi le importazioni di ``uuid`` e ``models``. Per esempio:
ja: 自動生成されたマイグレーション(3つの新しいファイルのうちの最初のファイル)から ``AddField`` オペレーションを最後のマイグレーションにコピーし、 ``AddField`` を ``AlterField`` に変更し、 ``uuid`` と ``models`` のインポートを追加します。例:
ko: "AddField" 작업을 자동 생성 마이그레이션(새 파일 3개 중 첫 번째 파일)에서 마지막 마이그레이션으로 복사하고 "AddField"를 "AlterField"로 변경하고 "uuid" 및 "model" 수입을 추가합니다. 예를 들어 다음과 같습니다.
zh_hans: 从自动生成的迁移（3个新文件中的第一个）中将 ``AddField`` 操作拷贝至上一个迁移，将 ``AddField`` 改为 ``AlterField``，添加 ``uuid`` 和 ``models`` 的导入。例子：

source: Edit the first migration file. The generated migration class should look similar to this:
it: Modifica il primo file di migrazione. La classe di migrazione generata sarà simile a questa:
ja: 最初の移行ファイルを編集します。 生成された移行クラスは次のようになります::
ko: 첫 번째 마이그레이션 파일을 편집합니다. 생성된 마이그레이션 클래스는 다음과 유사하게 표시되어야 합니다.
pt_br: Edite o primeiro arquivo da migração. A classe de migração gerada deve se parecer com isso:
zh_hans: 编辑第一个迁移文件。生成的迁移类应该看起来像这样：

source: Change ``unique=True`` to ``null=True`` -- this will create the intermediary null field and defer creating the unique constraint until we've populated unique values on all the rows.
it: Cambia ``unique=True`` in ``null=True`` -- questo creerà il campo null intermedio e rinvierà la creazione del vincolo univoco fino a quando non avremo popolato valori univoci su tutte le righe.
ja: ``unique=True`` を ``null=True`` に変更してください。これは、一時的にNULLフィールドを作成し、すべての行に一意な値を設定するまで、一意制約の作成を延期します。
ko: ''변신''을 하세요.True' to "null ull True" -- 이렇게 하면 중간 null 필드가 생성되고 모든 행에 고유 값을 채울 때까지 고유한 제약 조건 생성이 지연됩니다.
pt_br: Mude ``unique=True`` para ``null=True`` -- isso irá criar o campo nullo imtermediário e adiar a criação da restrição "unique" até que tenhamos populado os valores únicos em todas os registros.
zh_hans: 将 ``unique=True`` 改为 ``null=True``——这将创建中间 null 字段，并延迟创建唯一性约束，直到我们已为所以行填充了唯一值。

source: In the first empty migration file, add a :class:`~django.db.migrations.operations.RunPython` or :class:`~django.db.migrations.operations.RunSQL` operation to generate a unique value (UUID in the example) for each existing row. Also add an import of ``uuid``. For example:
it: Nel primo file di migrazione vuoto, aggiungi una operazione :class:`~django.db.migrations.operations.RunPython` o :class:`~django.db.migrations.operations.RunSQL` per generare un valore univoco (UUID nell'esempio) per ogni riga esistente. Aggiungi anche un import di ``uuid``. Per esempio:
ja: 最初の空のマイグレーションファイルに、 :class:`~django.db.migrations.operations.RunPython` または :class:`~django.db.migrations.operations.RunSQL` オペレーションを追加して、既存の各行に対して一意な値 (この例では UUID) を生成します。 ``uuid`` のインポートも追加します。例:
ko: 첫 번째 빈 마이그레이션 파일에서 :class를 추가하십시오.'~django.db.migrations.operations입니다.Python' 또는 :class를 실행합니다.'~django.db.migrations.operations입니다.SQL 작업을 실행하여 각 기존 행에 대해 고유한 값(예제의 UUID)을 생성합니다. 또한 "uuid"의 가져오기를 추가합니다. 예를 들어 다음과 같습니다.
zh_hans: 在第一个空的迁移文件中，添加一个 :class:`~django.db.migrations.operations.RunPython` 或 :class:`~django.db.migrations.operations.RunSQL` 操作，为每个已存在的行创建一个唯一值（本例中 UUID）。同时添加 ``uuid`` 的导入。例子：

source: Now you can apply the migrations as usual with the :djadmin:`migrate` command.
it: Ora puoi applicare le migrazioni come al solito con il comando :djadmin:`migrate` .
ja: これで :djadmin:`migrate` コマンドを使って通常通りマイグレーションを適用することができます。
ko: 이제 :djadmin:'migrate' 명령을 사용하여 평소와 같이 마이그레이션을 적용할 수 있습니다.
pt_br: Agora você pode aplicar as migrações como de costume com o comando :djadmin:`migrate`.
zh_hans: 现在你能像往常一样用 :djadmin:`migrate` 应用迁移了。

source: Note there is a race condition if you allow objects to be created while this migration is running. Objects created after the ``AddField`` and before ``RunPython`` will have their original ``uuid``’s overwritten.
it: Nota che si crea una race condition se permetti agli oggetti di essere creati mentre la migrazione gira. Gli oggetti creati dopo ``AddField`` e prima di ``RunPython`` avranno il loro ``uuid`` originale sovrascritto.
ja: このマイグレーションの実行中にオブジェクトの作成を許可すると、競合状態が発生することに注意してください。 ``AddField`` の後でかつ ``RunPython`` の前に作成されたオブジェクトは、元の ``uuid`` が上書きされます。
ko: 마이그레이션이 실행되는 동안 개체를 만들 수 있는 경우 경합 조건이 있습니다. "AddField" 이후와 "Run Python" 이전에 만들어진 물체들은 원래의 "uuid"를 덮어쓸 것입니다.
pt_br: Note que há uma condição de concorrência se você deixar com que objetos sejam criados enquanto essa migração está rodando. Objetos criados depois do ``AddField``e antes do ``RunPython`` terão seus ``uuid``'s sobrescritos.
zh_hans: 注意，若你允许运行迁移时创建对象可能会造成竞争。 ``AddField`` 后和 ``RunPython`` 前创建的对象保留原先重写的 ``uuid`` 值。

source: Non-atomic migrations
it: Migrazioni "Non-atomic"
ja: 非アトミックのマイグレーション
ko: 비원자성 마이그레이션입니다.
zh_hans: 非原子性迁移

source: On databases that support DDL transactions (SQLite and PostgreSQL), migrations will run inside a transaction by default. For use cases such as performing data migrations on large tables, you may want to prevent a migration from running in a transaction by setting the ``atomic`` attribute to ``False``::
it: In un database che supporta le transazioni DDL (SQLite e PostgreSQL), le migrations sono eseguite di default all'interno di una transazione. Per casi d'uso quali migrations su grandi tabelle, potresti voler evitare l'esecuzione delle migrations all'interno di una transazione, configurando l'attributo ``atomic`` a ``False``::
ja: DDL トランザクションをサポートしているデータベース (SQLite と PostgreSQL) では、マイグレーションはデフォルトでトランザクション内で実行されます。大きなテーブルに対してデータ移行を行う場合などには、 ``atomic`` 属性を ``False`` に設定することで、トランザクション内で移行が実行されないようにすることができます:
ko: DDL 트랜잭션을 지원하는 데이터베이스(SQLite 및 Postgre)입니다.SQL) 마이그레이션은 기본적으로 트랜잭션 내에서 실행됩니다. 대형 테이블에서 데이터 마이그레이션을 수행하는 경우와 같은 사용 사례의 경우 "원자" 속성을 "거짓"으로 설정하여 트랜잭션에서 마이그레이션이 실행되지 않도록 할 수 있습니다.
zh_hans: 对于支持 DDL 事务的数据库 (SQLite and PostgreSQL)，迁移默认运行在事务内。对于类似在大数据表上运行数据迁移的场景，你可以通过将 ``atomic`` 属性置为 ``False`` 避免在事务中运行迁移::
