Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Uses the system check framework to inspect the entire Django project for potential problems. Serious problems are raised as a :exc:`CommandError`; warnings are output to stderr; minor notifications are output to stdout.
ko: 시스템 검사 프레임워크를 사용하여 전체 Django 프로젝트에 잠재적인 문제가 있는지 검사합니다. 심각한 문제는 다음과 같이 제기됩니다:exc:`CommandError`;경고는 stderr로 출력되고 경미한 알림은 stdout으로 출력됩니다.
pt_br: Usa a estrutura de verificação do sistema para inspecionar todo o projeto Django para os potenciais problemas. Graves problemas são levantados como :exc:`CommandError`; avisos são enviados para stderr; notificações menos importantes são enviados para stdout.
zh_hans: 利用系统检查框架校验 Django 项目是否存在隐含的问题。严重的问题会抛出 :exc:`CommandError`；警告会输出至 stderr；次要通知输出至 stdout。

source: If this exception is raised during the execution of a management command from a command line console, it will be caught and turned into a nicely-printed error message to the appropriate output stream (i.e., stderr); as a result, raising this exception (with a sensible description of the error) is the preferred way to indicate that something has gone wrong in the execution of a command. It accepts the optional ``returncode`` argument to customize the exit status for the management command to exit with, using :func:`sys.exit`.
ko: 명령줄 콘솔에서 관리 명령을 실행하는 동안 이 예외가 발생하면 해당 명령이 캡처되어 적절한 출력 스트림(예, stderr)으로 인쇄된 오류 메시지로 전환됩니다. 따라서 오류에 대한 적절한 설명을 통해 이 예외를 발생시키는 것이 좋습니다.명령을 잘못 실행하다 그것은 :func:'sys.exit'을 사용하여 관리 명령의 종료 상태를 사용자 정의하기 위한 선택적인 ``returncode" 주장을 수용한다.

source: For our ``Hand`` example, we could convert the card data to a string of 104 characters by concatenating all the cards together in a pre-determined order -- say, all the *north* cards first, then the *east*, *south* and *west* cards. So ``Hand`` objects can be saved to text or character columns in the database.
ko: 우리의 "Hand" 예에서는 모든 카드를 미리 정해진 순서대로 연결함으로써 104자 문자열로 카드 데이터를 변환할 수 있습니다. 예를 들어 모든 *북* 카드, 그 다음 *동*, *남* 및 *서* 카드). 따라서 "Hand" 개체를 데이터베이스의 텍스트 또는 문자 열에 저장할 수 있습니다.
pt_br: Para o nosso exemplo ``Hand`, podemos converter o dado carta para uma string de 104 caracteres concatenando todos as cartas juntas em uma ordem pré-determinada --por exemplo, primeiro todos os *north*, depois os *east*, *south* e *west*. Então os objetos ``Hand`` podem ser salvos em colunas do tipo texto ou caracter em um banco de dados.
zh_hans: 对于我们的 ``Hand`` 示例，我们能将卡片数据转换为一个 104 个字符的字符串，通过以预定义的顺序连接所有卡片——也就是说，先连接 *北* 所拥有的卡，随后是 *东*， *南*，和 *西*。所有 ``Hand`` 对象能被保存在数据库中的文本或字符列中。

source: The counterpoint to writing your ``__init__()`` method is writing the :meth:`~.Field.deconstruct` method. It's used during :doc:`model migrations </topics/migrations>` to tell Django how to take an instance of your new field and reduce it to a serialized form - in particular, what arguments to pass to ``__init__()`` to re-create it.
ko: 당신의 ``__init__()" 방식을 쓰는 것의 대척점은 :meth:"를 쓰는 것이다.Field.deconstruction' 메서드입니다. 그것은 :doc:'model migration'에서 Django에게 당신의 새로운 필드의 예를 들어 그것을 직렬화된 형태로 줄이는 방법, 특히 그것을 재생성하기 위해 "_init_()"로 전달할 인수들을 말한다.
zh_hans: 与编写 ``__init__()`` 方法相对是编写 :meth:`~.Field.deconstruct` 方法。它在 :doc:`模型迁移 </topics/migrations>` 期间告诉 Django 如何获取你的新字段的一个实例，并将其转为序列化形式——特别是，传递什么参数给 ``__init__()`` 来重新创建它。

source: In our ``HandField`` class, we're storing the data as a VARCHAR field in the database, so we need to be able to process strings and ``None`` in the ``from_db_value()``. In ``to_python()``, we need to also handle ``Hand`` instances::
ko: "HandField`" 클래스에서는 데이터를 데이터베이스에 VARCHAR 필드로 저장하므로 "from_db_value()"에서 문자열과 "`None"을 처리할 수 있어야 한다. ``to_python()"에서 우리는 또한 ```Hand"의 인스턴스를 다룰 필요가 있다.
pt_br: Na nossa classe ``HandField``, estamos armazendo os dados como campo VARCHAR no banco de dados, então temos que ser capazes de processar strings e ``None`` no ``from_db_value()``. No ``to_python()``, precisamos também lidar com instâncias de ``Hand``::
zh_hans: 在 ``HandField`` 类中，我们在数据库中以 VARCHAR 字段的形式存储数据，所以我们要能在 ``from_db_value()`` 中处理字符串和 ``None``。在 ``to_python()`` 中，我们也需要处理 ``Hand`` 实例::

source: Look at the existing Django fields (in :file:`django/db/models/fields/__init__.py`) for inspiration. Try to find a field that's similar to what you want and extend it a little bit, instead of creating an entirely new field from scratch.
ko: 기존의 Django 필드('django/db/models/fields/__init__py' 파일)를 보고 영감을 얻습니다. 완전히 새로운 필드를 처음부터 새로 만드는 대신 원하는 필드와 유사한 필드를 찾아서 약간 확장하십시오.
pt_br: Olhe para os campos existentes no Django (em :file:`django/db/models/fields/__init__.py`) para inspação. Tente encontrar um campo que seja similar ao o que você quer extender um pouco, ao invés de criar um inteiramente novo desde o início.
zh_hans: 借鉴已有的 Django 字段（位于 :file:`django/db/models/fields/__init__.py`）。试着找到一个与你目标类似的字段，而不是从零开始创建。

source: The source for Django's own ``ImageField`` (in ``django/db/models/fields/files.py``) is a great example of how to subclass ``FileField`` to support a particular type of file, as it incorporates all of the techniques described above.
ko: Django 자신의 "ImageField"의 출처("django/db/db/fields/files.py에 있음)는 위에서 설명한 모든 기술을 포함하고 있기 때문에 특정 유형의 파일을 지원하기 위해 "FileField"를 하위 분류하는 방법을 보여주는 좋은 예이다.
pt_br: O código fonte para o ``ImageField`` do Django (em ``django/db/models/fields/files.py``) é um bom exemplo de como herdar ``FileField`` para dar suporte ao um tipo de arquivo em particular, já que ele incorpora todas as técnicas descritas acima.
zh_hans: Django 的 ``ImageField`` 的源码（位于 ``django/db/models/fields/files.py``）就是个展示如何继承 ``FileField`` 支持特定文件的不错例子，因为它包含了上述所有技巧。

source: For example, if your custom tags/filters are in a file called ``poll_extras.py``, your app layout might look like this::
ko: 예를 들어 사용자 지정 태그/필터가 ``poll_extras"라는 파일에 있는 경우.py², 앱 레이아웃은 다음과 같을 수 있습니다.
pt_br: Por exemplo, se suas tags/filtros customizados estão em um arquivo chamado ``poll_extras.py`, o layout da app deve parecer como isso::
zh_hans: 例如，如果你的 tags/filters 保存在一个名为 ``poll_extras.py`` 的文件中，你的应用布局可能看起来像这样::

source: For more examples of complex rendering, see the source code of :ttag:`{% for %}<for>` in ``django/template/defaulttags.py`` and :ttag:`{% if %}<if>` in ``django/template/smartif.py``.
ko: 복잡한 렌더링의 자세한 예는 "django/template/default 태그"에서 :ttag:'{% for %"의 소스 코드를 참조하십시오."django/https/smartif.py"의 pypad 및 :'{% if %}"입니다.
pt_br: Para mais exemplos de renderização mais complexas, veja o código fonte da :ttag:`{% for %}<for>` em ``django/template/defaulttags.py`` e :ttag:`{% if %}<if>` em ``django/template/smartif.py``.
zh_hans: 更多关于复杂渲染的例子，查看 ``django/template/defaulttags.py`` 中 :ttag:`{% for %} <for>` 的源码，或 ``django/template/smartif.py`` 中 :ttag:`{% if %} <if>` 的源码。

source: Daphne_ is a pure-Python ASGI server for UNIX, maintained by members of the Django project. It acts as the reference server for ASGI.
ko: Daphne_는 UNIX용 Pure-Python ASGI 서버이며, Django 프로젝트의 멤버에 의해 유지보수됩니다. ASGI의 참조 서버 역할을 합니다

source: You can install Daphne with ``pip``::
ko: ``pip``:으로 다프네를 설치할 수 있다

source: For a typical Django project, invoking Daphne would look like::
ko: 일반적인 Django 프로젝트의 경우 Daphne을 호출하는 방법은 다음과 같습니다.

source: You can install Hypercorn with ``pip``::
ko: 하이퍼콘은 "pip"로 설치할 수 있다.

source: For a typical Django project, invoking Hypercorn would look like::
ko: 일반적인 Django 프로젝트의 경우 하이퍼콘을 호출하는 방법은 다음과 같습니다.

source: You can install Uvicorn with ``pip``::
ko: "pip"로 Uvicorn을 설치할 수 있다.

source: For a typical Django project, invoking Uvicorn would look like::
ko: 일반적인 Django 프로젝트의 경우 Uvicorn을 호출하는 방법은 다음과 같습니다.

source: :setting:`SECRET_KEY`
ko: :설정:`SECRET_KEY`

source: :setting:`DEBUG`
ko: :설정:`DEBUG`

source: :setting:`ALLOWED_HOSTS`
ko: :설정:`ALLOWED_HOSTS`

source: :setting:`CACHES`
ko: :설정:`CACHES`

source: :setting:`DATABASES`
ko: :설정:`DATABASES`

source: :setting:`CSRF_COOKIE_SECURE`
ko: :설정:`CSRF_COOKIE_SECURE`

source: :setting:`SESSION_COOKIE_SECURE`
ko: :설정:`SESSION_COOKIE_SECURE`

source: :setting:`CONN_MAX_AGE`
ko: :설정:`CONN_MAX_AGE`

source: :setting:`TEMPLATES`
ko: :설정:`TEMPLATES`

source: Enabling the cached template loader often improves performance drastically, as it avoids compiling each template every time it needs to be rendered. See the :ref:`template loaders docs <template-loaders>` for more information.
ko: 캐시된 템플리트 로더를 사용 가능으로 설정하면 렌더링할 때마다 각 템플리트가 컴파일되지 않으므로 성능이 크게 향상됩니다. 자세한 내용은 :ref:'템플릿 로더 문서'를 참조하십시오.
pt_br: Habilitando o cache do carregador de "templates" muitas vezes aumenta o desempenho dramaticamente, já que isso evita compilar cada template todas as vezes que precisa ser renderizado. Veja o :ref:`template loaders docs <template-loaders>` para mais informações.
zh_hans: 启用缓存的模板加载器通常会极大地提升性能，因为它避免了每次渲染模板时都编译它们。参考 :ref:`模板加载器文档 <template-loaders>` 获取更多信息。

source: :setting:`LOGGING`
ko: :설정:`LOGGING`

source: When Gunicorn is installed, a ``gunicorn`` command is available which starts the Gunicorn server process. The simplest invocation of gunicorn is to pass the location of a module containing a WSGI application object named ``application``, which for a typical Django project would look like::
ko: 귀니콘이 설치되면 귀니콘 서버 프로세스를 시작하는 ``귀니콘" 명령이 나온다. 가장 간단한 gunicorn의 호출은 일반적인 Django 프로젝트의 경우 다음과 같이 보이는 "application"이라는 WSGI 애플리케이션 객체가 있는 모듈의 위치를 통과하는 것이다.

source: The admin files live in (:file:`django/contrib/admin/static/admin`) of the Django distribution.
ko: admin 파일은 django 배포판의 (:file:'django/contrib/admin/static/admin')에 있습니다.
pt_br: Os arquivos do admin ficam em (:file:`django/contrib/admin/static/admin`) da distribuição Django.
zh_hans: 后台文件位于 Django 发行版的 (:file:`django/contrib/admin/static/admin`) 中。

source: Here's an example command to start a uWSGI server::
ko: 다음은 uWSGI 서버를 시작하는 예제 명령입니다.
pt_br: Aqui um exemplo de um comando para iniciar um servior uWSGI::
zh_hans: 以下是个示例命令，用于启动一个 uWSGI 服务器::

source: Example ini configuration file::
ko: ini 구성 파일의 예:
pt_br: Exemplo do arquivo ini de configuração::
zh_hans: 示例 ini 配置文件::

source: Example ini configuration file usage::
ko: ini 구성 파일 사용 예:
pt_br: Exemplo de uso do arquivo ini de configuração::
zh_hans: 示例 ini 配置文件语法::

source: If you get a ``UnicodeEncodeError`` when uploading files with file names that contain non-ASCII characters, make sure uWSGI is configured to accept non-ASCII file names by adding this to your ``uwsgi.ini``::
ko: 비ASC 파일 이름을 가진 파일을 업로드할 때 "유니코드 인코딩 오류"가 발생하는 경우II 문자, "uwsgi"에 추가하여 uWSGI가 ASCII가 아닌 파일 이름을 허용하도록 구성되었는지 확인하십시오.이니:
pt_br: Se receber um ``UnicodeEncodeError``quando fizer upload de arquivos com nomes que contenham caraceteres não ASCII, tenha certeza de configurar o uWSGI para aceitar nome de arquivos não ASCII adicionando isso ao seu ``uwsgi.ini``::
zh_hans: 如果上传的文件名包含非 ASCII 字符时，可能抛出 ``UnicodeEncodeError``，确保 uWSGI 已正确配置，能接受非 ASCII 字符的文件名，通过在 ``uwsgi.ini`` 添加以下内容::

source: It's sometimes useful to pre-populate your database with hard-coded data when you're first setting up an app. You can provide initial data with migrations or fixtures.
ko: 응용프로그램을 처음 설정할 때 하드 코딩된 데이터로 데이터베이스를 미리 채우는 것이 유용합니다. 마이그레이션 또는 고정 장치와 함께 초기 데이터를 제공할 수 있습니다.
zh_hans: 第一次配置应用时，用硬编码的数据预备数据库有时很很有用。你能通过迁移和固定内容提供初始数据。

source: Providing initial data with migrations
ko: 마이그레이션으로 초기 데이터 제공하기.
zh_hans: 通过迁移提供初始数据

source: If you want to automatically load initial data for an app, create a :ref:`data migration <data-migrations>`. Migrations are run when setting up the test database, so the data will be available there, subject to :ref:`some limitations <test-case-serialized-rollback>`.
ko: 앱의 초기 데이터를 자동으로 로드하려면 :ref:'데이터 마이그레이션'을 생성하십시오. 마이그레이션은 테스트 데이터베이스를 설정할 때 실행되므로:ref:'일부 제한 사항'에 따라 데이터를 사용할 수 있습니다.
zh_hans: 若你想为应用自动载入初始数据，创建一个 :ref:`数据迁移 <data-migrations>`。创建测试数据库时会运行迁移，所以可以用这里的数据， :ref:`一些限制 <test-case-serialized-rollback>` 主题。

source: Providing data with fixtures
ko: 고정 장치를 통해 데이터를 제공합니다.
zh_hans: 通过固定内容提供数据

source: You can also provide data using fixtures, however, this data isn't loaded automatically, except if you use :attr:`.TransactionTestCase.fixtures`.
ko: 고정 장치를 사용하여 데이터를 제공할 수도 있지만 이 데이터는 :attr:`.TransactionTestCase.fixtures`. 를 사용하는 경우를 제외하고 자동으로 로드되지 않습니다.
zh_hans: 你也能通过固定内容提供数据，不过，这些数据不会自动加载，除非你使用 :attr:`.TransactionTestCase.fixtures`。

source: You can load data by calling :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, where ``<fixturename>`` is the name of the fixture file you've created. Each time you run :djadmin:`loaddata`, the data will be read from the fixture and re-loaded into the database. Note this means that if you change one of the rows created by a fixture and then run :djadmin:`loaddata` again, you'll wipe out any changes you've made.
ko: :djadmin:'manage'를 호출하여 데이터를 로드할 수 있습니다.pyload data ``"는 당신이 만든 fixture 파일의 이름입니다. 실행할 때마다:djadmin:load data(로드 데이터)는 고정장치에서 데이터를 읽고 데이터베이스에 다시 로드됩니다. 이는 고정 장치에 의해 생성된 행 중 하나를 변경한 후 다음을 실행하는 경우입니다.데이터를 다시 로드하면 변경 내용이 모두 지워집니다.

source: Where Django finds fixture files
ko: Django가 고정 파일을 찾는 위치입니다.
pt_br: Onde o Django encontra arquivos de "fixture"
zh_hans: Django 从哪里寻找固定内容文件

source: By default, Django looks in the ``fixtures`` directory inside each app for fixtures. You can set the :setting:`FIXTURE_DIRS` setting to a list of additional directories where Django should look.
ko: 기본적으로 Django는 각 앱에 있는 "fixtures" 디렉토리에서 고정 장치를 찾습니다. : 설정을 설정할 수 있습니다.FIXT_DIRS는 Django가 찾아야 할 추가 디렉토리 목록으로 설정됩니다.
pt_br: Por padrão, o Django procura por "fixtures" no diretório ``fixtures`` dentro de cada app. Você definir a :setting:`FIXTURE_DIRS` como uma lista de diretórios adicionais onde o Django deve procurar.
zh_hans: 默认情况下，Django 在每个应用的 ``fixtures`` 目录中查找固定内容。你可以将配置项 :setting:`FIXTURE_DIRS` 设为一个 Django 需要额外寻找的目录列表。

source: When running :djadmin:`manage.py loaddata <loaddata>`, you can also specify a path to a fixture file, which overrides searching the usual directories.
ko: 실행 시 :djadmin:'manage'입니다.py load data'. 고정 파일 경로를 지정할 수도 있습니다. 이 경로는 일반적인 디렉터리 검색을 재정의합니다
pt_br: Quando chamar :djadmin:`manage.py loaddata <loaddata>`, você pode especificar um caminho para o arquivo de "fixture", o qual é procurado no lugar dos diretórios usuais.
zh_hans: :djadmin:`manage.py loaddata <loaddata>` 时，你也能指定一个到固定内容文件的路径，这将会覆盖查找常规目录的行为。

source: :setting:`NAME`
ko: 설정:`NAME`

source: :setting:`ENGINE <DATABASE-ENGINE>`
ko: :설정:`ENGINE 1`

source: :setting:`USER`
ko: :설정:`USER`

source: :setting:`PASSWORD`
ko: :설정:`PASSWORD`

source: :setting:`HOST`
ko: :설정:`HOST`

source: :setting:`PORT`
ko: :설정:`PORT`

source: Django comes with a utility called :djadmin:`inspectdb` that can create models by introspecting an existing database. You can view the output by running this command::
ko: Django는 기존 데이터베이스를 검사하여 모델을 만들 수 있는 :djadmin:'inspectdb'라는 유틸리티와 함께 제공됩니다. 다음 명령을 실행하여 출력을 볼 수 있습니다.
pt_br: O Django vem com uma ferramenta chamada :djadmin:`inspectdb` que pode criar os modelos introspectando o banco de dados existente. Você pode verificar a saida rodando este comando::
zh_hans: Django 自带一个叫做 :djadmin:`inspectdb` 的工具，它可以通过内省已存在的数据库创建对应模型。你能通过运行以下命令看到输出::

source: Save this as a file by using standard Unix output redirection::
ko: 표준 Unix 출력 리디렉션을 사용하여 다음을 파일로 저장합니다.
pt_br: Salve isso como um arquivo usando o redirecionamento padrão da saída Unix.
zh_hans: 通过标准 Unix 输出重定向将其保存为文件::

source: Next, run the :djadmin:`migrate` command to install any extra needed database records such as admin permissions and content types::
ko: 그런 다음 :djadmin:'migrate' 명령을 실행하여 관리자 권한 및 컨텐츠 유형과 같이 추가로 필요한 데이터베이스 레코드를 설치합니다.
pt_br: A seguir, execute o comando :djadmin:`migrate` para instalar qualquer registro necessário de banco de dados tal como permissões do admin e tipos de conteúdo::
zh_hans: 然后，运行 :djadmin:`migrate` 命令安装所有额外需要的数据库记录，像是后台权限和内容类型::

source: The ReportLab library is `available on PyPI`_. A `user guide`_ (not coincidentally, a PDF file) is also available for download. You can install ReportLab with ``pip``:
ko: ReportLab 라이브러리는 PyPI에서 사용할 수 있습니다. 사용자 가이드(PDF 파일)도 다운로드할 수 있습니다. "pip"로 ReportLab을 설치할 수 있습니다.
pt_br: A biblioteca RepostLab está disponível `available on PyPI`_. Um guia de usuário em `user guide`_ (não coincidentemente um arquivo PDF) está disponível para download. Você pode instalar o ReportLab com ``pip``:
zh_hans: ReportLab 库可从 `PyPI`_ 获取。也可以下载 `用户指南`_ （一份 PDF 文件，这不是巧合）。你可以用 ``pip`` 安装 ReportLab：

source: Test your installation by importing it in the Python interactive interpreter::
ko: Python 대화형 인터프리터를 사용하여 설치를 테스트합니다.
pt_br: Teste sua instalação importando no interpretador interativo Python::
zh_hans: 在 Python 交互解释器中导入它，测试你的安装是否成功::

source: The basic outline of putting static files into production consists of two steps: run the :djadmin:`collectstatic` command when static files change, then arrange for the collected static files directory (:setting:`STATIC_ROOT`) to be moved to the static file server and served. Depending on :setting:`STATICFILES_STORAGE`, files may need to be moved to a new location manually or the :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` method of the ``Storage`` class might take care of that.
ko: 정적 파일을 프로덕션에 넣는 기본 개요는 두 단계로 구성됩니다. 정적 파일이 변경될 때 :djadmin:'collectstatic' 명령을 실행한 다음 수집된 정적 파일 디렉토리(:seting:').STATIC_ROOT')를 정적 파일 서버로 이동하여 제공합니다. : 설정에 따라 달라집니다.STATICFILES_STORY'에서 파일을 수동으로 새 위치로 이동하거나 :func:'post_process <django.contrib.staticfiles.staticfiles.storage로 이동해야 할 수 있습니다.정적 파일 저장소입니다.포스트_프로세스' 방식의 스토리지 클래스가 이를 해결할 수도 있습니다.

source: There's any number of ways you might do this, but if the provider has an API, you can use a :doc:`custom file storage backend </howto/custom-file-storage>` to integrate the CDN with your Django project. If you've written or are using a 3rd party custom storage backend, you can tell :djadmin:`collectstatic` to use it by setting :setting:`STATICFILES_STORAGE` to the storage engine.
ko: 여러 가지 방법을 사용할 수 있지만 제공자에 API가 있는 경우 :doc:'사용자 정의 파일 스토리지 백엔드를 사용하여 CDN을 Django 프로젝트와 통합할 수 있습니다. 타사 사용자 지정 스토리지 백엔드를 작성했거나 사용 중인 경우 :djadmin:'collectstatic'을 설정하여 사용할 수 있습니다.static files_storage'를 저장 엔진에 연결합니다.

source: Once that's done, all you have to do is run :djadmin:`collectstatic` and your static files would be pushed through your storage package up to S3. If you later needed to switch to a different storage provider, you may only have to change your :setting:`STATICFILES_STORAGE` setting.
ko: 작업이 완료되면 djadmin:'collectstatic'만 실행하면 정적 파일이 스토리지 패키지를 통해 S3까지 푸시됩니다. 나중에 다른 스토리지 제공자로 전환해야 하는 경우 :seting:'만 변경하면 됩니다.정적 파일_저장소' 설정입니다.

source: In your templates, use the :ttag:`static` template tag to build the URL for the given relative path using the configured :setting:`STATICFILES_STORAGE`.
ko: 템플릿에서 :ttag:'static' 템플릿 태그를 사용하여 구성된 를 사용하여 지정된:setting:`STATICFILES_STORAGE`.에 대한 URL을 빌드합니다.
zh_hans: 在模板中，用 :ttag:`static` 模板标签基于配置 :setting:`STATICFILES_STORAGE` 位给定的相对路径构建 URL。

source: Run the :djadmin:`collectstatic` management command::
ko: :djadmin:'collectstatic' 관리 명령을 실행합니다.
pt_br: Execute o comando de gerenciamento :djadmin:`collectstatic` ::
zh_hans: 运行 :djadmin:`collectstatic` 管理命令::

source: If you're not using the Django test runner, you may need to also ensure that any console output is not captured which would hide deprecation warnings. For example, if you use `pytest <https://pytest.org/>`__:
ko: Django 테스트 러너를 사용하지 않는 경우, 사용되지 않는 경고를 숨기기 위해 콘솔 출력이 캡처되지 않았는지 확인해야 할 수도 있습니다. 예를 들어 'pytest https://pytest.org/'__을(를) 사용하는 경우 다음을 수행합니다.

source: After installation, open the command prompt and check that the Python version matches the version you installed by executing::
ko: 설치 후에는 커맨드 프롬프트를 열어서 설치된 파이썬 버전과 방금 설치한 파이썬 버전이 같은지 확인하세요.
pt_br: Depois da instalação, abra a linha comando e verifique se a versão do Python é a mesma que a versão instalada executando::
zh_hans: 安装后，打开命令提示符，检查 Python 版本是否与你装的一致，通过运行::

source: `pip`_ is a package manager for Python and is included by default with the Python installer. It helps to install and uninstall Python packages (such as Django!). For the rest of the installation, we'll use ``pip`` to install Python packages from the command line.
ko: pip_은(는) Python용 패키지 관리자이며 기본적으로 Python 설치 관리자에 포함되어 있습니다. Python 패키지(예: Django!)를 설치하고 제거하는 데 도움이 됩니다. 나머지 설치 시에는 "pip"을 사용하여 명령줄에서 Python 패키지를 설치할 것입니다.

source: To create a virtual environment for your project, open a new command prompt, navigate to the folder where you want to create your project and then enter the following::
ko: 프로젝트의 가상 환경을 생성하려면 새 명령 프롬프트를 열고 프로젝트를 생성할 폴더로 이동한 다음 다음을 입력합니다.

source: In the command prompt, ensure your virtual environment is active, and execute the following command::
ko: 명령 프롬프트에서 가상 환경이 활성 상태인지 확인하고 다음 명령을 실행합니다.
zh_hans: 在命令提示行中，确认虚拟环境是激活的，然后运行以下命令::

source: If you are connecting to the internet behind a proxy, there might be problems in running the command ``py -m pip install Django``. Set the environment variables for proxy configuration in the command prompt as follows::
ko: 만일 당신이 대리인을 통해 인터넷에 접속한다면 ``py-mp install Django"라는 명령어를 실행하는 데 문제가 있을 수 있습니다. 명령 프롬프트에서 다음과 같이 프록시 구성에 대한 환경 변수를 설정합니다.

source: Authentication using ``REMOTE_USER``
pt_br: Autenticação usando ``REMOTE_USER``
zh_hans: 使用 ``REMOTE_USER`` 进行身份验证

source: This document describes how to make use of external authentication sources (where the Web server sets the ``REMOTE_USER`` environment variable) in your Django applications. This type of authentication solution is typically seen on intranet sites, with single sign-on solutions such as IIS and Integrated Windows Authentication or Apache and `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, etc.
pt_br: Este documento descreve como usar fontes externas de autenticação (quando o servidor define a variável de ambiente ``REMOTE_USER``) em suas aplicações Django. Este tipo de solução de autenticação é geralmente usado em sites de intranet, com soluções single sign-on como o IIS e autenticação Integrada do Windows ou Apache e `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_, etc.
zh_hans: 本文档描述如何在 Django 应用中使用外部身份验证资源（在 web 服务器上设置 ``REMOTE_USER`` 环境变量的地方）。这种类型的身份验证方法一般用在使用了单点登录方案的内部网站上，比如 IIS 和 Windows 一体化验证或者 Apache 和 `mod_authnz_ldap`_, `CAS`_, `Cosign`_, `WebAuth`_, `mod_auth_sspi`_ 等等。

source: When the Web server takes care of authentication it typically sets the ``REMOTE_USER`` environment variable for use in the underlying application. In Django, ``REMOTE_USER`` is made available in the :attr:`request.META <django.http.HttpRequest.META>` attribute. Django can be configured to make use of the ``REMOTE_USER`` value using the ``RemoteUserMiddleware`` or ``PersistentRemoteUserMiddleware``, and :class:`~django.contrib.auth.backends.RemoteUserBackend` classes found in :mod:`django.contrib.auth`.
pt_br: Quando o servidor Web se encarrega da autenticação ele normalmente define a variável de ambiente ``REMOTE_USER`` para uso na aplicação que está sendo executada. No Django, ``REMOTE_USER`` é disponibilizado no atributo :attr:`request.META <django.http.HttpRequest.META>`. O Django pode ser configurado para fazer uso do ``REMOTE_USER`` usando as classes :class:`django.contrib.auth.middleware.RemoteUserMiddleware` e :class:`~django.contrib.auth.backends.RemoteUserBackend` encontrados em:mod:`django.contrib.auth`.
zh_hans: 当 Web 服务器负责鉴权时，通常会设置 ``REMOTE_USER`` 环境变量，这是为了在底层应用中使用。在 Django 中， ``REMOTE_USER`` 是作为 :attr:`request.META <django.http.HttpRequest.META>` 的参数来使用的。如果想在 Django 中使用 ``REMOTE_USER``, 可以通过配置 ``RemoteUserMiddleware`` 中间件， ``PersistentRemoteUserMiddleware`` 中间件，或者继承在 :mod:`django.contrib.auth` 中的 :class:`~django.contrib.auth.backends.RemoteUserBackend` 来实现。

source: First, you must add the :class:`django.contrib.auth.middleware.RemoteUserMiddleware` to the :setting:`MIDDLEWARE_CLASSES` setting **after** the :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
pt_br: Primeiro, você deve adicionar :class:`django.contrib.auth.middleware.RemoteUserMiddleware` ao :setting:`MIDDLEWARE_CLASSES` definindo **depois** o :class:`django.contrib.auth.middleware.AuthenticationMiddleware`::
