Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Writing a custom field can be a tricky process, particularly if you're doing complex conversions between your Python types and your database and serialization formats. Here are a couple of tips to make things go more smoothly:
it: Scrivere un campo personalizzato può essere un processo complesso, in particolar modo se stai facendo delle conversioni complesse tra i tipi di dati Python e il tuo database e i formati di serializzazione. Ecco alcuni suggerimenti per rendere le cose più semplici:
ja: カスタムフィールドの作成は、特に Python の型とデータベースやシリアライズのフォーマットとの間で複雑な変換を行う場合、厄介なプロセスになることがあります。ここでは、スムーズに進めるためのヒントをいくつか紹介します:
ko: 특히 Python 유형과 데이터베이스 및 직렬화 형식 간에 복잡한 변환을 수행하는 경우에는 사용자 지정 필드를 작성하는 작업이 까다로울 수 있습니다. 다음은 작업을 보다 원활하게 진행할 수 있도록 하는 몇 가지 팁입니다.
pt_br: Escrever um campo personalizado pode ser um pouco complicado, particularmente se estiver fazendo conversões complexas entre tipos Python e o banco de dados e formatos de serialização. Aqui algumas dicas par fazer as coisas mais tranquilas.
zh_hans: 编写自定义字段是个棘手的，尤其是在 Python 类，数据库，序列化格式之间进行复杂转换的时候。下面有几个让事情更顺利的建议：

source: Look at the existing Django fields (in :source:`django/db/models/fields/__init__.py`) for inspiration. Try to find a field that's similar to what you want and extend it a little bit, instead of creating an entirely new field from scratch.
ja: 既存の Django フィールド ( :source:`django/db/models/fields/__init__.py` にあります) を見て、着想を得てください。ゼロから全く新しいフィールドを作るのではなく、あなたの欲しいものに似たフィールドを見つけ、それを少し拡張してみてください。

source: Put a ``__str__()`` method on the class you're wrapping up as a field. There are a lot of places where the default behavior of the field code is to call ``str()`` on the value. (In our examples in this document, ``value`` would be a ``Hand`` instance, not a ``HandField``). So if your ``__str__()`` method automatically converts to the string form of your Python object, you can save yourself a lot of work.
it: Metti un metodo ``__str__()`` sulla classe che stai incapsulando come campo. Ci sono molti casi in cui il comportamento di default del campo è quello di chaimare ``str()`` sul valore. (Negli esempi in questo documento, `value`` potrebbe essere una istanza di ``Hand``, non un ``HandField``). Così, se il tuo metodo ``__str__()`` converte automaticamente in stringa il tuo oggetto Python, puoi risparmiarti un sacco di lavoro.
ja: フィールドとしてラップしているクラスに ``__str__()`` メソッドを追加します。フィールドのコードのデフォルトの動作として、値に対して ``str()`` を呼び出す箇所が多くあります。(このドキュメントの例では、 ``value`` は ``HandField`` ではなく ``Hand`` インスタンスになります）。そのため、 ``__str__()`` メソッドが自動的に Python オブジェクトの文字列形式に変換してくれれば、多くの手間を省けます。
ko: 필드로 마무리하는 수업에 "__str__()" 방식을 적용합니다. 필드 코드의 기본 동작은 값에 대해 "str()"라고 부르는 경우가 많다. (이 문서의 예에서 "가치"는 ``핸드필드"가 아니라 "손"의 예일 것이다. 그래서 만약 당신의 ``_str__()" 방법이 당신의 파이썬 객체의 문자열 형태로 자동 변환된다면, 당신은 많은 작업을 절약할 수 있다.
zh_hans: 为字段类添加一个 ``__str__()`` 方法。在很多地方，字段代码的默认行为是对值调用 ``str()``。（本页文档中， ``value`` 会是一个 ``Hand`` 实例，而不是 ``HandField``）。所以 ``__str()`` 方法会自动将 Python 对象转为字符串格式，帮你剩下不少时间。

source: Writing a ``FileField`` subclass
it: Scrivere una sottoclasse ``FileField``
ja: ``FileField`` サブクラスを書く
ko: ``FileField``의 하위 클래스 작성
pt_br: Escrevendo uma subclasse ``FileField``
zh_hans: 编写一个 ``FileField`` 子类

source: In addition to the above methods, fields that deal with files have a few other special requirements which must be taken into account. The majority of the mechanics provided by ``FileField``, such as controlling database storage and retrieval, can remain unchanged, leaving subclasses to deal with the challenge of supporting a particular type of file.
it: Oltre ai metodi sopra, i campi che hanno a che fare con i file hanno pochi altri requisiti speciali che è necessario prendere in considerazione. La maggior parte delle meccaniche fornite da ``FileField``, come il controllo dello storage e del ritiro su e dal database, possono rimanere inalterate, lasciando alle sottoclassi l'onere di supportare un determinato tipo di file.
ja: 上記のメソッドに加えて、ファイルを扱うフィールドには考慮すべき特別な要件がいくつかあります。 ``FileField`` によって提供される仕組みの大部分、例えばデータベースの保存と取得の制御などは、変更することなく、サブクラスに特定のタイプのファイルをサポートさせることができます。
ko: 위의 방법 외에도 파일을 처리하는 필드에는 몇 가지 다른 특수한 요구 사항이 고려되어야 합니다. 데이터베이스 저장 및 검색 통제 등 ``파일 필드"가 제공하는 메커니즘의 대다수는 변하지 않을 수 있어 하위 클래스는 특정 유형의 파일을 지원해야 하는 과제를 떠안게 된다.
pt_br: Além dos métodos acima, campos que lidam com arquivos tem alguns outros requerimentos especiais que devem ser levados em conta. A maioria dos mecanismos fornecidos pelo ``FileField`, como controlar o armazenamento e leitura na base de dados, podem permanecer inalterados, deixando as subclasses lidarem com o desafio de dar suporte a um tipo de arquivo particular.
zh_hans: 除了上述方法外，处理文件的字段还有一些必须考虑到的特殊要求。 ``FileField`` 提供的大部分机制（像是操作数据库存储和检索）能保持不变，让子类面对支持特殊文件的挑战。

source: Django provides a ``File`` class, which is used as a proxy to the file's contents and operations. This can be subclassed to customize how the file is accessed, and what methods are available. It lives at ``django.db.models.fields.files``, and its default behavior is explained in the :doc:`file documentation </ref/files/file>`.
it: Django fornisce una classe ``File``, che viene utilizzata come proxy per accedere ai contenuti del file e compiere operazioni. A partire da questa si possono creare delle sottoclassi per personalizzare le modalità di accesso al file ed i metodi disponibili. Si tratta di ``django.db.models.fields.files`` ed il suo comportamento standard viene spiegato nella :doc:`documentazione dei file</ref/files/file>`.
ja: Django は ``File`` クラスを提供し、ファイルの内容や操作のプロキシとして使われます。これをサブクラス化することで、ファイルへのアクセス方法や利用可能なメソッドをカスタマイズできます。このクラスは ``django.db.models.fields.files`` にあり、デフォルトの動作は :doc:`ファイルのドキュメント</ref/files/file>` で解説しています。
ko: django는 파일의 내용과 작업을 대신하는 "파일" 클래스를 제공한다. 파일 액세스 방법과 사용 가능한 방법을 사용자 정의하기 위해 하위 분류할 수 있습니다. 그것은 ``django.db.models.fields"에 산다.files는 다음과 같이 처리되며, 기본 동작은 :doc:'file docation'에 설명되어 있다.
pt_br: O Django fornece uma classe ``File``, a qual é usada como um proxy para conteúdos e operações de arquivos . Isso pode ser herdado para customizar como o arquivo é acessado, e quais métodos estão disponíveis. Isso está em ``django.db.models.fields.files``, e seu comportamento padrão é explicado no :doc:`arquivo documentação</ref/files/file>`.
zh_hans: Django 提供一个 ``File`` 类，作为文件内容和文件操作的代理。可以继承该类自定义访问文件的方式，哪些方法是可用的。它位于 ``django.db.models.fields.files``，它的默认行为在 :doc:`file 文档 </ref/files/file>` 中介绍。

source: Once a subclass of ``File`` is created, the new ``FileField`` subclass must be told to use it. To do so, assign the new ``File`` subclass to the special ``attr_class`` attribute of the ``FileField`` subclass.
it: Una volta creata una sottoclasse di `File``, è necessario dire alla nuova sottoclasse di ``FileField`` di usarla. Per farlo, assegna la nuova sottoclasse ``File`` all'attributo speciale ``attr_class`` della sottoclasse ``FileField``.
ja: 一度 ``File`` のサブクラスが作成されると、新しい ``FileField`` サブクラスにはそれを使用するように指示する必要があります。そのためには、新しい ``File`` サブクラスを ``FileField`` サブクラスの特別な ``attr_class`` 属性に割り当てます。
ko: 일단 "파일"의 서브클래스가 만들어지면 새로운 "파일필드" 서브클래스는 그것을 사용하라는 말을 들어야 한다. 그러기 위해서는 새로운 "파일" 하위 클래스를 "파일 필드" 하위 클래스의 "attr_class" 특성의 "파일" 하위 클래스를 할당해야 한다.

source: A few suggestions
it: Alcuni suggerimenti
ja: いくつかの提案
ko: 몇 가지 제안들
pt_br: Algumas sugestões
zh_hans: 一些建议

source: In addition to the above details, there are a few guidelines which can greatly improve the efficiency and readability of the field's code.
it: In aggiunta ai dettagli precedentemente esposti, ci sono alcune linee guida che possono migliorare notevolmente l'efficienza e la leggibilità del codice del campo.
ja: 上記の詳細に加えて、フィールドのコードの効率と読みやすさを劇的に改善するいくつかのガイドラインがあります。
ko: 위의 세부 사항 외에도 필드 코드의 효율성과 가독성을 크게 개선할 수 있는 몇 가지 지침이 있습니다.
pt_br: Além dos detalhes acima, tem algumas orientações as quais podem melhorar muito a eficiência e a legibilidade do código do campo.
zh_hans: 除了上述细节，下面还有一些准则，有助于极大地提高字段代码的效率和可读性。

source: The source for Django's own ``ImageField`` (in :source:`django/db/models/fields/files.py`) is a great example of how to subclass ``FileField`` to support a particular type of file, as it incorporates all of the techniques described above.
ja: Django 独自の ``ImageField`` のソース ( :source:`django/db/models/fields/files.py` ) は、上で説明したテクニックを全て組み込んでいるので、特定のファイルタイプをサポートするために ``FileField`` をサブクラス化する方法の良い例です。

source: Cache file attributes wherever possible. Since files may be stored in remote storage systems, retrieving them may cost extra time, or even money, that isn't always necessary. Once a file is retrieved to obtain some data about its content, cache as much of that data as possible to reduce the number of times the file must be retrieved on subsequent calls for that information.
it: Metti in cache i file quando possibile. Dal momento che i file potrebbero trovarsi su sistemi di storage remoti, ritirarli potrebbe costare tempo o addirittura denaro aggiuntivo, cosa che non è sempre necessaria. Una volta che un file è stato ritirato per ottenere dati relativi al suo contenuto, metti in cache quanti più dati possibile per ridurre il numero di volte che il file deve essere ritirato per chiamate susseguenti relative a quelle informazioni.
ja: できるだけファイル属性をキャッシュします。ファイルはリモートのストレージシステムに保存されている可能性があるため、それらを取得するには、必ずしも必要ではない余分な時間やコストがかかる可能性があります。一度ファイルを検索してその内容に関するデータを取得したら、そのデータをできるだけ多くキャッシュして、その情報を取得するために以後ファイルを検索する回数を減らします。
ko: 가능한 경우 파일 특성을 캐시합니다. 파일을 원격 스토리지 시스템에 저장할 수 있기 때문에 파일을 검색하는 데 추가 시간 또는 비용이 소요될 수 있습니다. 항상 필요한 것은 아닙니다. 파일이 검색되어 콘텐츠에 대한 데이터를 얻으면 해당 데이터를 가능한 많이 캐슁하여 이후 해당 정보를 호출할 때 파일을 검색해야 하는 횟수를 줄이십시오.
pt_br: Faça o cache dos atributos do arquivo sempre que possível. Uma vez que é possível que arquivos sejam armazenados em sistemas de armazenamento remotos, recuperá-los talvez requeira tempo extra, ou mesmo dinheiro, que não é sempre necessário. Uma vez que o arquivo é recuperado para obter alguns dados sobre seu conteúdo, faça o cache de dados o quanto possível para reduzir o número de vezes que o arquivo deve ser recuperado em chamadas subsequentes para aquela informação.
zh_hans: 尽可能的缓存文件属性。因为文件可能保存在远端存储系统中，检出它们会消耗额外的时间，甚至是钱，且不总是必要的。一旦检出某个文件，获取其内容，尽可能缓存所有数据，以减少后续调用再次检索文件的次数。

source: How to implement a custom template backend
it: Come implementare un backend per template personalizzato
ja: テンプレートのバックエンドをカスタマイズする

source: Custom backends
it: Backend personalizzati
ja: カスタムのバックエンド
ko: 맞춤 백엔드

source: Here's how to implement a custom template backend in order to use another template system. A template backend is a class that inherits ``django.template.backends.base.BaseEngine``. It must implement ``get_template()`` and optionally ``from_string()``. Here's an example for a fictional ``foobar`` template library::
it: Ecco come implementare un backend di template custom per utilizzare un altro sistema di template. Un backend di template è una classe che eredita da ``django.template.backends.base.BaseEngine``. Deve implementare ``get_template()`` ed opzionalmente ``from_string()``. Ecco un esempio di template library fittizia ``foobar``::
ja: ここでは、他のテンプレートシステムを使用するために、カスタムテンプレートバックエンドを実装する方法を説明します。テンプレートバックエンドは ``django.template.backends.base.BaseEngine`` を継承したクラスです。このクラスは ``get_template()`` と、オプションで ``from_string()`` を実装する必要があります。以下は架空の ``foobar`` テンプレートライブラリの例です:
ko: 다른 템플릿 시스템을 사용하기 위해 사용자 지정 템플릿 백엔드를 구현하는 방법은 다음과 같습니다. 템플릿 백엔드는 ``django.template.backends.base"를 상속하는 클래스입니다.Base Engine'입니다. "get_template()"과 "from_string()"을 구현해야 한다. 가상의 ``푸바" 템플릿 라이브러리의 예는 다음과 같다.

source: See `DEP 182`_ for more information.
it: Vedi `DEP 182`_ per maggiori informazioni.
ja: 詳しい情報は `DEP 182`_ を参照してください。
ko: 자세한 내용은 'DEP 182'를 참조하십시오.

source: Debug integration for custom engines
it: Integrazione per il debug di engine custom
ja: カスタムエンジンに対するデバッグの統合
ko: 사용자 지정 엔진을 위한 디버그 통합

source: The Django debug page has hooks to provide detailed information when a template error arises. Custom template engines can use these hooks to enhance the traceback information that appears to users. The following hooks are available:
it: La pagina di debug di Django ha hook che forniscono informazioni dettagliate quando si verifica un template error. I motori di template personalizzati possono utilizzare questi hook per aumentare le informazioni di traceback visualizzate dagli utenti. Sono disponibili i seguenti hook:
ja: Django のデバッグページには、テンプレートエラーが発生したときに詳細な情報を提供するフックがあります。カスタムのテンプレートエンジンは、これらのフックを使うことで、ユーザに表示されるトレースバック情報を強化できます。以下のフックが利用できます:
ko: Django 디버그 페이지에는 템플릿 오류가 발생할 때 자세한 정보를 제공하는 후크가 있습니다. 사용자 정의 템플릿 엔진은 이러한 후크를 사용하여 사용자에게 표시되는 추적 정보를 향상시킬 수 있습니다. 다음 후크를 사용할 수 있습니다.

source: Template postmortem
it: Postmortem sul template
ja: テンプレートの postmortem (事後分析)
ko: 템플릿 사후검토

source: The postmortem appears when :exc:`~django.template.TemplateDoesNotExist` is raised. It lists the template engines and loaders that were used when trying to find a given template. For example, if two Django engines are configured, the postmortem will appear like:
it: il postmortem appare quando viene sollevato :exc:`~django.template.TemplateDoesNotExist`. Fa una lista dei motori di template e dei loader che sono stati usati quando si cercava un determinato template. Per esempio, se sono configurati due motori Django, il postmortem apparrà così:
ja: postmortemは :exc:`~django.template.TemplateDoesNotExist` が発生したときに表示されます。これは、指定されたテンプレートを見つけようとしたときに使われたテンプレートエンジンとローダの一覧を表示します。例えば、2つの Django エンジンが設定されている場合、 postmortem は以下のように表示されます:
ko: 다음 경우:exc:에 사후에:'~django.the'템플릿이 없습니다'가 발생합니다. 지정된 템플릿을 찾을 때 사용된 템플릿 엔진 및 로더가 나열됩니다. 예를 들어 두 개의 Django 엔진이 구성된 경우 사후에 다음과 같이 표시됩니다.

source: Custom engines can populate the postmortem by passing the ``backend`` and ``tried`` arguments when raising :exc:`~django.template.TemplateDoesNotExist`. Backends that use the postmortem :ref:`should specify an origin <template-origin-api>` on the template object.
it: I motori personalizzati possono popolare il postmortem passando gli argomenti ``backend`` e ``tried`` quando sollevano :exc:`~django.template.TemplateDoesNotExist`.I backend che usano il postmortem :ref:`dovrebbero specificare una origine<template-origin-api>` sull'oggetto di template.
ja: カスタムエンジンは :exc:`~django.template.TemplateDoesNotExist` を発生させるときに ``backend`` と ``tried`` 引数を渡すことで postmortem に値を入れることができます。postmortem を使用するバックエンドはテンプレートオブジェクトの :ref:`origin を指定する <template-origin-api>` 必要があります。
ko: 커스텀엔진은 다음과 같은 문제를 제기할 때 ``백엔드"와 "시도한" 주장을 통과시킴으로써 사후에 채워질 수 있다.'~django.the'템플릿이 없습니다. 사후 처리:ref:'를 사용하는 백엔드는 템플릿 개체에 원점을 지정해야 합니다.

source: Contextual line information
it: Informazione su linea contestuale
ja: コンテキストの行情報
ko: 맥락선정보

source: If an error happens during template parsing or rendering, Django can display the line the error happened on. For example:
it: Se viene generato un errore durante il parsing o il rendering del template, Django è in grado di mostrare la riga in cui è presente l'errore. Ad esempio:
ja: もしテンプレートをパースもしくはレンダリングしてる最中にエラーが発生したら、Djangoはエラーが発生した行を表示することができます。たとえば:

source: Custom engines can populate this information by setting a ``template_debug`` attribute on exceptions raised during parsing and rendering. This attribute is a :class:`dict` with the following values:
it: I motori personalizzati possono popolare questa informazione impostando un attributo ``template_debug`` sulle eccezioni sollevate durante il parsing ed il rendering. Questo attributo è un :class:`dict` con i seguenti valori:
ja: カスタムエンジンはパースやレンダリング中に発生した例外に ``template_debug`` 属性を指定することで、この情報を入力できます。この属性は以下の値を持つ :class:`dict` です:
ko: 사용자 지정 엔진은 구문 분석 및 렌더링 중에 발생하는 예외에 대해 "template_debug" 속성을 설정하여 이 정보를 채울 수 있다. 이 속성은 다음 값을 갖는 :class:'dict'입니다.

source: ``'name'``: The name of the template in which the exception occurred.
it: ``'name'``: Il nome del template in cui è avvenuta l'eccezione.
ja: ``'name'``: 例外が発生したテンプレートの名前。
ko: "이름": 예외가 발생한 템플릿의 이름입니다.

source: ``'message'``: The exception message.
it: ``'message'``: Il messaggio dell'eccezione
ja: ``'message'``: 例外メッセージ。
ko: ``'message'``: 예외 메시지.

source: ``'source_lines'``: The lines before, after, and including the line the exception occurred on. This is for context, so it shouldn't contain more than 20 lines or so.
it: ``'source_lines'``: Le righe prima, dopo e che includono la riga dove è avvenuta l'eccezione. Questo è per il contesto, quindi non dovrebbe contenere più di 20 righe o giù di lì.
ja: ``'source_lines'``: 例外が発生した行の前後の行。これは文脈のためのものなので、20行以上にすべきではありません。
ko: ''source_lines'': 예외가 발생한 행의 이전, 이후 및 포함 선. 컨텍스트용이므로 20개 이상의 라인을 포함할 수 없습니다.

source: ``'line'``: The line number on which the exception occurred.
it: ``'line'``: Il numero di riga in cui è avvenuta l'eccezione.
ja: ``'line'``: 例外が発生した行番号。
ko: "라인": 예외가 발생한 라인 번호입니다.

source: ``'before'``: The content on the error line before the token that raised the error.
it: ``'before'``: Il contenuto della riga dell'errore prima del token che ha generato l'errore.
ja: ``'before'``: エラーを発生させたトークンの前のエラー行の内容。
ko: "'before'": 오류를 발생시킨 토큰 앞의 내용입니다.

source: ``'during'``: The token that raised the error.
it: ``'during'``: Il token che ha generato l'errore.
ja: ``'during'``: エラーを発生させたトークン。
ko: ``'during'``: 오류를 발생시킨 토큰입니다.

source: ``'after'``: The content on the error line after the token that raised the error.
it: ``'after'``: Il contenuto della riga dell'errore dopo il token che ha generato l'errore.
ja: ``'after'``: エラーを発生させたトークンの後のエラー行の内容。
ko: ``'after'``: 오류를 발생시킨 토큰 뒤에 있는 오류 행의 내용입니다.

source: ``'total'``: The number of lines in ``source_lines``.
it: ``'total'``: Il numero di righe in ``source_lines``.
ja: ``'total'``: ``source_lines`` の行数。
ko: ``'total'``: "source_line"의 줄 수는 다음과 같다.

source: ``'top'``: The line number where ``source_lines`` starts.
it: ``'top'``: Il numero di riga dove inizia ``source_lines``.
ja: ``'top'``: ``source_lines`` が始まる行番号。
ko: ``'top'``: "source_line"이 시작되는 라인 번호이다.

source: ``'bottom'``: The line number where ``source_lines`` ends.
it: ``'bottom'``: Il numero di riga dove termina ``source_lines``.
ja: ``'bottom'``: ``source_lines`` が終了する行番号。
ko: ``'bottom'``: "source_line"이 끝나는 라인 번호이다.

source: Given the above template error, ``template_debug`` would look like::
it: Dato il template di errore qui sopra, ``template_debug`` sarà simile a::
ja: 上記のテンプレートエラーが発生した場合、 ``template_debug`` は次のようになります:
ko: 위의 템플릿 오류로 인해 "template_debug"는 다음과 같이 표시됩니다.

source: Origin API and 3rd-party integration
it: Origin API ed integrazione di terze parti
ja: Origin API と サードパーティとの統合
ko: 오리진 API 및 타사 통합

source: Django templates have an :class:`~django.template.base.Origin` object available through the ``template.origin`` attribute. This enables debug information to be displayed in the :ref:`template postmortem <template-postmortem>`, as well as in 3rd-party libraries, like the `Django Debug Toolbar`_.
it: I template Django hanno un oggetto :class:`~django.template.base.Origin` disponibile attraverso l'attributo ``template.origin``. Questo abilita informazioni di debug da mostrare nel :ref:`template postmortem <template-postmortem>`, così come nelle librerie di terze parti, come `Django Debug Toolbar`_.
ja: Django テンプレートには :class:`~django.template.base.Origin` オブジェクトがあり、 ``template.origin`` 属性で利用できます。これにより、デバッグ情報を :ref:`テンプレートの postmortem (事後分析) <template-postmortem>` や、 `Django Debug Toolbar`_ のようなサードパーティライブラリに表示できます。
ko: Django 템플릿의 :class:'~django.base.오리진 객체는 "template.origin" 속성을 통해 사용할 수 있다. 디버그 정보를 ef:'템플릿 사후에'는 물론, 제3자 도서관에서도 '장고 디버그 툴바'와 같은 디버그 정보를 표시할 수 있다.

source: Custom engines can provide their own ``template.origin`` information by creating an object that specifies the following attributes:
it: I motori personalizzati possono fornire la propria informazione ``template.origin`` creando un oggetto che specifica i seguenti attributi:
ja: カスタムエンジンは、以下の属性を指定するオブジェクトを作成することで、独自の ``template.origin`` 情報を提供できます:
ko: 커스텀 엔진은 다음과 같은 속성을 지정하는 객체를 만들어 자체 ``템플릿.오리진" 정보를 제공할 수 있다.

source: ``'name'``: The full path to the template.
it: ``'name'``: il percorso completo verso il template.
ja: ``'name'``: テンプレートへのフルパス。
ko: ``'name'``: 템플릿의 전체 경로입니다.

source: ``'template_name'``: The relative path to the template as passed into the template loading methods.
it: ``'template_name'``: il percorso relativo verso il template così come viene passato nei metodi di caricamento del template.
ja: ``'template_name'``: テンプレート読み込みメソッドに渡される、テンプレートへの相対パス。
ko: ``'template_name'``: 템플릿 로드 메서드에 전달된 템플릿에 대한 상대 경로입니다.

source: ``'loader_name'``: An optional string identifying the function or class used to load the template, e.g. ``django.template.loaders.filesystem.Loader``.
it: ``'loader_name'``: una stringa opzionale che indentifica la funzione o la classe utilizzata per caricare il template, per es. ``django.template.loaders.filesystem.Loader``.
ja: ``'loader_name'``: テンプレートの読み込みに使われる関数またはクラスを識別するためのオプションの文字列。例: ``django.template.loaders.filesystem.Loader``。
ko: ``'loader_name'``: 템플릿을 로드하는 데 사용되는 함수 또는 클래스를 식별하는 선택적 문자열(예: "django.template.loaders")입니다.파일 시스템로더'.

source: How to create custom template tags and filters
it: Come creare tag di template e filtri personalizzati
ja: 独自のテンプレートタグとフィルタを作る

source: Django's template language comes with a wide variety of :doc:`built-in tags and filters </ref/templates/builtins>` designed to address the presentation logic needs of your application. Nevertheless, you may find yourself needing functionality that is not covered by the core set of template primitives. You can extend the template engine by defining custom tags and filters using Python, and then make them available to your templates using the :ttag:`{% load %}<load>` tag.
it: Il linguaggio di template di Django arriva come un'ampia varietà di :doc:`filtri e tag built-in</ref/templates/builtins>` progettati per far fronte alle necessità di logica di presentazione delle tue applicazioni. Eppure, potresti trovarti nella condizione di aver bisogno di funzionalità che non sono coperte dal set di primitive di template del core. Puoi estendere il motore di template definendo dei tag e filtri personalizzati usando Python e poi renderli disponibili ai tuoi template utilizzando il tag :ttag:`{% load %}<load>`
ja: Django のテンプレート言語は、アプリケーションのプレゼンテーションロジックのニーズに対応するように設計された、多種多様な :doc:`埋め込みタグやフィルタ</ref/templates/builtins>` を搭載しています。それでもなお、テンプレート構成要素のコア・セットでカバーされていない機能が必要になることもあるでしょう。そのときは Python を使用し、独自のタグやフィルタを定義することによって、テンプレートエンジンを拡張できます。その上で、:ttag:`{% load %}<load>` タグを使用すると、テンプレートでそれらの機能を利用することができるようになります。
ko: Django의 템플릿 언어는 애플리케이션의 프레젠테이션 논리 요구를 해결하도록 설계된 다양한 :doc:'내장 태그 및 필터'와 함께 제공됩니다. 그럼에도 불구하고 템플릿의 핵심 요소 집합에서 다루지 않는 기능이 필요할 수 있습니다. Python을 사용하여 사용자 지정 태그와 필터를 정의하여 템플릿 엔진을 확장한 다음 :t 태그:'{% load %}' 태그를 사용하여 템플릿에서 사용할 수 있도록 설정할 수 있습니다.
pt_br: A linguagem de templates do Django vem com uma variedade de :doc:`built-in tags e filtros </ref/templates/builtins>` projetados para atender as necessidades da lógica de apresentação da sua aplicação. Mesmo assim, talvez precise de uma funcionalidade que não está coberta pelo conjunto das primitivas do template. É possível estender o engine de templates definindo tags e filtros customizados usando Python, e então torná-los disponíveis para seus templates usando a tag :ttag:`{% load %}<load>` .
zh_hans: Django 模板语言包含了很多 :doc:`内置 tags 和 filters </ref/templates/builtins>`，设计目的是满足应用需要占位逻辑需求。极少情况下，你可能发现需要的功能未被核心模板集覆盖。你能通过 Python 代码自定义 tags 和 filters 扩展集成模板引擎，通过 :ttag:`{% load %} <load>` 标签使其可用。

source: Code layout
it: Layout del codice
ja: コードのレイアウト
ko: 코드 레이아웃
pt_br: Layout do código
zh_hans: 代码布局
