Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The first class is the Python object that your users will manipulate. They will assign it to the model attribute, they will read from it for displaying purposes, things like that. This is the ``Hand`` class in our example.
it: La prima classe è l'oggetto Python che i tuoi utenti manipoleranno. Lo assegneranno all'attributo model, leggeranno da esso per la visualizzazione, cose del genere. Questa è la classe ``Hand`` nel nostro esempio.
ja: 最初のクラスは、ユーザーが操作するPythonオブジェクトです。彼らはそれをモデル属性に割り当て、そのようなものを表示するためにそれから読み込みます。これは、この例の ``Hand`` クラスです。
ko: 첫 번째 클래스는 사용자가 조작할 Python 개체입니다. 그들은 그것을 모델 속성에 할당하고, 그것을 보여주기 위해 읽게 될 것입니다. 이것이 우리의 예에서 볼 수 있는 "Hand" 클래스이다.
pt_br: A primeira classe é o objeto Python que os usuários irão manipular. Irão assinalar isso a um atributo de model, lerão para mostrar, coisas assim. Esta é a classe ``Hand`` em nosso exemplo.
zh_hans: 第一个类是用户需要操作的 Python 对象。它们会复制给模型属性，它们会为了显示而读取属性，就想这样。这里本例中的 ``Hand`` 类。

source: The second class is the ``Field`` subclass. This is the class that knows how to convert your first class back and forth between its permanent storage form and the Python form.
it: La seconda classe è la sottoclasse ``Field``. Questa è la classe che sa come riconvertire la tua prima classe avanti ed indietro tra la sua forma di salvataggio permanente e la sua forma in Python.
ja: 2番目のクラスは ``Field`` サブクラスです。これは、最初のクラスを永続ストレージ形式とPython形式の間で変換する方法を知っているクラスです。
ko: 두 번째 클래스는 ``Field" 하위 클래스다. 이 클래스는 퍼스트 클래스를 영구 스토리지 폼과 Python 폼 사이에서 앞뒤로 변환하는 방법을 알고 있는 클래스입니다.
pt_br: A segunda classe é a subclasse ``Field``. Essa é a classe que sabe como converter sua classe entre sua forma de armazenamento permanente e a forma do Python e vice-versa.
zh_hans: 第二类是 ``Field`` 的子类。这个类知道如何在永久存储格式和 Python 格式之间来回转换。

source: Writing a field subclass
it: Scrivere una sottoclasse di campo
ja: フィールドサブクラスを書く
ko: 필드상속 작성법
pt_br: Escrevendo uma subclasse de campo
zh_hans: 编写一个 field 子类

source: When planning your :class:`~django.db.models.Field` subclass, first give some thought to which existing :class:`~django.db.models.Field` class your new field is most similar to. Can you subclass an existing Django field and save yourself some work? If not, you should subclass the :class:`~django.db.models.Field` class, from which everything is descended.
it: Quando pianifichi la tua sottoclasse :class:`~django.db.models.Field`, prova a pensare a quale classe :class:`~django.db.models.Field` esistente somigli. Puoi fare una sottoclasse di un campo Django esistente e risparmiarti un po' di lavoro? Se non puoi, dovresti fare una sottoclasse di :class:`~django.db.models.Field`, dalla quale tutto discende.
ja: :class:`~django.db.models.Field` のサブクラス化を考える前に、まず、新しいフィールドが、既存のどの :class:`~django.db.models.Field` クラスに最も似ているかを考えてください。既存の Django フィールドをサブクラス化して、手間を省くことはできませんか？そうでなければ、すべてのフィールドの基底となる、 :class:`~django.db.models.Field` クラスをサブクラス化すべきです。
ko: 클래스 계획 시:'~django.db.db.know.필드의 하위 클래스는 먼저 기존의 :클래스 중 어느 것을 생각하는지 제시합니다.'~django.db.db.know.필드 클래스는 새 필드와 가장 유사합니다. 기존 Django 필드를 하위 분류하여 작업을 저장할 수 있습니까? 그렇지 않으면 모든 것이 내려온 필드의 :class.'~django.db.db.know. 를 하위 분류해야 합니다
pt_br: Quando estiver panejando sua subclasse de :class:`~django.db.models.Field`, primeiro de uma com qual classe já existente :class:`~django.db.models.Field` seu campo se parece mais. É possível fazer uma subclasse de campo Django já existente e economizar algum trabalho ? Caso não, você deve construir uma subclasse de :class:`~django.db.models.Field`, da qual tudo descende.
zh_hans: 计划编写第一个 :class:`~django.db.models.Field` 子类时，需要先想想新字段和哪个已有的 :class:`~django.db.models.Field` 最相似。你会继承 Django 字段节约你的时间吗？如果不会，你需要继承 :class:`~django.db.models.Field` 类，从它继承了一切。

source: Initializing your new field is a matter of separating out any arguments that are specific to your case from the common arguments and passing the latter to the ``__init__()`` method of :class:`~django.db.models.Field` (or your parent class).
it: Inizializzare il tuo nuovo campo è questione di fare una separazione tra gli argomenti che sono specifici per il tuo caso da quelli comuni e passare questi ultimi nel metodo ``__init__()`` di :class:`~django.db.models.Field` (o della tua classe padre).
ja: 新しいフィールドの初期化は、ケース固有の引数を共通の引数から分離し、後者を :class:`~django.db.models.Field` の ``__init__()`` メソッドに渡すことです。 （または親クラスに対して）。
ko: . :class'~django.db.db.know.Field(또는 부모 클래스)의 메소드는 당신의 새로운 필드를 초기화하는 것은 당신의 경우에 특정한 어떤 주장과 공통적인 주장을 분리해서 후자를 "__init__()" 방법에 전달하는 문제입니다
pt_br: Iniciar seu novo campo é uma questão de separar quaisquer argumentos que são específicos para seu caso dos argumentos comuns e passar este último para o método ``__init__()`` da :class:`~django.db.models.Field` (ou sua classe pai).
zh_hans: 初始化新字段有点麻烦，因为要从公共参数中分离你需要的参数，并将剩下的传给父类 :class:`~django.db.models.Field` 的 ``__init__()`` 方法（或你的父类）。

source: In our example, we'll call our field ``HandField``. (It's a good idea to call your :class:`~django.db.models.Field` subclass ``<Something>Field``, so it's easily identifiable as a :class:`~django.db.models.Field` subclass.) It doesn't behave like any existing field, so we'll subclass directly from :class:`~django.db.models.Field`::
it: Nel nostro esempio, chiameremo il nostro campo ``HandField``. (E' una buona idea chiamare la tua sottoclasse di :class:`~django.db.models.Field` ``<Something>Field``, così che sia facilmente identificabile come :class:`~django.db.models.Field` subclass.). Non deve comportarsi come alcun campo esistente, così faremo direttamente una sottoclasse di :class:`~django.db.models.Field`::
ja: この例では、フィールドを ``HandField`` と呼ぶことにします。（ :class:`~django.db.models.Field` サブクラス ``<Something>Field`` と名付けることをオススメします。 :class:`~django.db.models.Field` サブクラスであることが簡単にわかるためです） 既存のフィールドのようには動作しないため、この例では :class:`~django.db.models.Field` から直接サブクラス化しています。
ko: 예를 들어, 우리는 우리의 분야를 "HandField"라고 부를 것이다.( :class:`~django.db.models.Field` 의 서브클래스를 ``1Field``라고 부르는 것은 좋은 생각인데, 이로 인해 :class:`~django.db.models.Field` 서브클래스 를 쉽게 인식할 수 있습니다)이는 기존 필드와 다르게 동작하므로 :class:`~django.db.models.Field`:: 으로부터 직접적으로 상속해야 한다.
pt_br: No nosso exemplo, iremos chamar nosso campo de ``HandField``. (é uma boa idéia chamar sua subclasse :class:`~django.db.models.Field` ``<AgumaCoisa>Field``, então ela fica facilmente identificável como uma subclasse de :class:`~django.db.models.Field`) . Nosso campo não se comporta como nenhum outro campo existente, então iremos herdar diretamente de :class:`~django.db.models.Field`::
zh_hans: 在本例中，我们会调用 ``HandField``。（调用你的 :class:`~django.db.models.Field` 子类这个主意也很不错，所以认证为一个 :class:`~django.db.models.Field` 很简单。）它并不表现的像任何已存在的字段，所以我们将直接继承自 :class:`~django.db.models.Field`::

source: Our ``HandField`` accepts most of the standard field options (see the list below), but we ensure it has a fixed length, since it only needs to hold 52 card values plus their suits; 104 characters in total.
it: Il nostro ``HandField`` accetta la maggior parte delle opzioni standard per un campo (vedi la lista qui sotto) ma ci assicuriamo che abbia una lunghezza fissa, perchè necessita di tenere solo i valori delle 52 carte più i loro semi; 104 caratteri in tutto.
ja: 私たちの ``HandField`` は、ほとんどの標準フィールドオプションを受け入れます（以下のリストを参照してください）。しかし、52枚のカードの値とそれらのスート（マーク）を保持するだけで十分なため、固定長を持つようにします。合計で104文字です。
ko: 우리의 "HandField"는 대부분의 표준 필드 옵션(아래 목록 참조)을 수용하지만 52개의 카드 값과 그 정장, 총 104자만 보유하면 되기 때문에 길이가 고정되어 있음을 보장한다.
pt_br: Nosso ``HandField`` aceita a maioria das opções dos campos padrão (veja a lista abaixo), mas asseguramos que ele tenha um comprimento fixo, já que só precisa de 52 valores de carta mais seus naipes; 104 caracteres no total.
zh_hans: 我们的 ``HandField`` 接收大多数标准字段选项（参考下面的列表），但是我们确定参数是定长的，因为它只需要保存 52 个卡片和它们的值；总计 104 个字符。

source: Many of Django's model fields accept options that they don't do anything with. For example, you can pass both :attr:`~django.db.models.Field.editable` and :attr:`~django.db.models.DateField.auto_now` to a :class:`django.db.models.DateField` and it will ignore the :attr:`~django.db.models.Field.editable` parameter (:attr:`~django.db.models.DateField.auto_now` being set implies ``editable=False``). No error is raised in this case.
it: Molti dei modelli di Django accettano opzioni con le quali poi non fanno niente. Per esempio, puoi passare sia :attr:`~django.db.models.Field.editable` che :attr:`~django.db.models.DateField.auto_now` ad una :class:`django.db.models.DateField` ed ignorerà il parametro :attr:`~django.db.models.Field.editable` (impostare :attr:`~django.db.models.DateField.auto_now` implica ``editable=False``). Non viene sollevato alcun errore in questo caso.
ja: 多くのDjangoのモデルフィールドは、受け取ってもなにも起こらないオプションを受け取ります。例えば、 :attr:`~django.db.models.Field.editable` と :attr:`~django.db.models.DateField.auto_now` は :class:`django.db.models.DateField` に渡すことができますが、 :attr:`~django.db.models.Field.editable` のパラメーターを無視します。（ :attr:`~django.db.models.DateField.auto_now` には ``editable=False`` がセットされています）この場合、エラーは発生しません。
ko: Django의 모델 분야 중 많은 부분은 그들이 아무것도 하지 않는 옵션을 받아들인다. 예를 들어, :attr:`~django.db.models.Field.editable` and :attr:`~django.db.models.DateField.auto_now` 두 가지를 모두 :class:`django.db.models.DateField` 로 전달 할 수 있고 :attr:`~django.db.models.Field.editable`매개 변수와(:attr:`~django.db.models.DateField.auto_now` being set implies ``editable=False``). 를 무시한다.

source: This behavior simplifies the field classes, because they don't need to check for options that aren't necessary. They pass all the options to the parent class and then don't use them later on. It's up to you whether you want your fields to be more strict about the options they select, or to use the more permissive behavior of the current fields.
it: Questo comportamento semplifica le classi per i campi perchè non hanno bisogno di controllare le opzioni che non sono necessarie. Passano tutte le opzioni al padre e poi non le usano. Sta a te essere più o meno esigente riguardo alle opzioni che selezionano o utilizzare il comportamento più permissivo per i campi correnti.
ja: この振る舞いはフィールドクラスをシンプルにします。なぜなら、必要のないオプションをチェックする必要がないからです。すべてのオプションを親クラスに渡し、オプションを使用しないのです。フィールドにより厳密にオプションを扱ってほしいのか、より柔軟なカレントフィールドの動作を使うのかは、使う人次第です。
ko: 이 동작은 필요하지 않은 옵션을 확인할 필요가 없으므로 필드 클래스를 단순화합니다. 모든 옵션을 부모 클래스에 전달한 다음 나중에 사용하지 않습니다. 선택한 옵션에 대해 필드를 더 엄격하게 지정하거나 현재 필드의 더 관대한 동작을 사용할지 여부는 사용자에게 달려 있습니다.

source: The ``Field.__init__()`` method takes the following parameters:
it: Il metodo ``Field.__init__()`` accetta i seguenti parametri:
ja: ``Field.__init__()`` メソッドは以下のパラメーターを取ります:
ko: ''`Field.__init__()' 방법은 다음과 같은 파라미터를 사용합니다.
pt_br: O método ``Field.__init__()`` recebe os seguintes parâmetros:
zh_hans: ``Field.__init__()`` 方法接收以下参数:

source: ``rel``: Used for related fields (like :class:`ForeignKey`). For advanced use only.
it: ``rel``: Usato per campi collegati (come :class:`ForeignKey`). Solo per utenti avanzati.
ja: ``rel``: 関連フィールドに使用される (:class:`ForeignKey` など)。上級者向けです。
ko: ``rel``: Used for related fields (like :class:`ForeignKey`). 고급 사용시
pt_br: ``rel``: Usado para campos relacionados (como :class:`ForeignKey`). Somente para uso avançado.
zh_hans: ``rel``: 用于关联字段（像是： :class:`ForeignKey`）。仅用于进阶用途。

source: ``serialize``: If ``False``, the field will not be serialized when the model is passed to Django's :doc:`serializers </topics/serialization>`. Defaults to ``True``.
it: ``serialize``: Se ``False``, il campo non verrà serializzato quando viene passato ai :doc:`serializers </topics/serialization>` di Django. Di default a ``True``.
ja: ``serialize``: ``False`` の場合、Django の :doc:`シリアライザ </topics/serialization>` にモデルが渡されたときに、フィールドをシリアライズしません。デフォルトの値は ``True`` です。
ko: "serialize": "False"이라면, 모델이 장고 :doc :"serializers"에 전달될 때 그 분야는직렬화되지 않을 것이다. 기본값은 "TRUE"입니다.
pt_br: ``serialize``: se ``False``, o campo não será "serializado" quando o modelo for passado para os :doc:`serializadores </topics/serialization>`. Padrão é ``True``.
zh_hans: ``serialize``: 若为 ``False``，字段传给 Django 的 :doc:`序列化器 </topics/serialization>` 时不会被序列化。默认为 ``True``。

source: :attr:`~django.db.models.Field.db_tablespace`: Only for index creation, if the backend supports :doc:`tablespaces </topics/db/tablespaces>`. You can usually ignore this option.
it: :attr:`~django.db.models.Field.db_tablespace`: solo per la creazione dell'indice, se il backend supporta :doc:`tablespaces </topics/db/tablespaces>`. Generalmente puoi ignorare questa opzione.
ja: もしバックエンドが :doc:`テーブル空間 (tablespace) </topics/db/tablespaces>` をサポートする場合、:attr:`~django.db.models.Field.db_tablespace`: はインデックスの作成のみ行います。通常、このオプションは無視できます。
ko: :attr:`~django.db.models.Field.db_tablespace`: 백엔드에서 :doc:'tablespaces'를 지원하는 경우에만 인덱스 생성에 사용됩니다. 일반적으로 이 옵션을 무시할 수 있습니다.
pt_br: :attr:`~django.db.models.Field.db_tablespace`: Somente para a criação de índice, se o "backend" suportar :doc:`tablespaces </topics/db/tablespaces>`. Normalmente é possível ignorar essa opção.
zh_hans: :attr:`~django.db.models.Field.db_tablespace`: 仅为创建索引，如果后端支持 :doc:`tablespaces </topics/db/tablespaces>`。一般情况下你可以忽略此选项。

source: :attr:`~django.db.models.Field.auto_created`: ``True`` if the field was automatically created, as for the :class:`~django.db.models.OneToOneField` used by model inheritance. For advanced use only.
it: :attr:`~django.db.models.Field.auto_created`: ``True`` se il campo è stato creato automaticamente, come per :class:`~django.db.models.OneToOneField`, usato per l'ereditarietà del model. Solo per uso avanzato.
ja: モデル継承で使用される :class:`~django.db.models.OneToOneField` のように、フィールドが自動的に作成された場合は、:attr:`~django.db.models.Field.auto_created` は ``True`` です。 高度な使用向けです。
ko: 필드가 자동으로 생성된 경우,:class:`~django.db.models.OneToOneField` 가 모델 상속으로 사용된 경우, :attr:`~django.db.models.Field.auto_created`: ``True``이다. 고급 사용시
pt_br: :attr:`~django.db.models.Field.auto_created`: ``True`` se o campo foi criado automaticamente, como para o :class:`~django.db.models.OneToOneField` usado pela herança de modelo. Somente para uso avançado.
zh_hans: :attr:`~django.db.models.Field.auto_created`:若字段是自动创建的，则为 ``True``，用于 :class:`~django.db.models.OneToOneField` 的模型继承。仅用于进阶用途。

source: All of the options without an explanation in the above list have the same meaning they do for normal Django fields. See the :doc:`field documentation </ref/models/fields>` for examples and details.
it: Tutte le opzioni che non hanno una spiegazione nella lista precedente hanno lo stesso significato che avrebbero nei normali campi Django. Vedi la :doc:`documentazione dei campi </ref/models/fields>` per esempi e dettagli.
ja: 上記のリストに説明のないオプションはすべて、通常のDjangoフィールドと同じ意味を持ちます。例と詳細については、 :doc:`フィールドのドキュメント </ref/models/fields>` を参照してください。
ko: 위의 목록에 설명이 없는 모든 옵션은 일반 D장고 필드에 대해 동일한 의미를 가집니다. 예시와 자세한 내용은 :doc:'field documentation'를 참조하십시오.
pt_br: Todas as opções sem uma explicação na lista acima tem o mesmo significado que os campos normais do Django. veja a :doc:`field documentation </ref/models/fields>` para exemplos e detalhes.
zh_hans: 上述列表中所有无解释的选项与在普通 Django 字段中的作用一样。参见 :doc:`字段文档 </ref/models/fields>` 获取例子和细节信息。

source: Field deconstruction
it: Scomposizione di un campo
ja: フィールドの解体
ko: 필드 해체
pt_br: A descontrução do Campo
zh_hans: 字段解析

source: The counterpoint to writing your ``__init__()`` method is writing the :meth:`~.Field.deconstruct` method. It's used during :doc:`model migrations </topics/migrations>` to tell Django how to take an instance of your new field and reduce it to a serialized form - in particular, what arguments to pass to ``__init__()`` to recreate it.
it: Il duale rispetto allo scrivere il metodo ``__init__()`` è scrivere il metodo :meth:`~.Field.deconstruct`. Viene utilizzato durante :doc:`model migrations` per dire a Django come prendere un'istanza del tuo nuovo campo e ridurlo ad una forma serializzata, in particolare, quali argomenti passare a ``__init__()`` per ricrearlo.
ja: ``__init__()`` メソッドとは対照的なものとして、 :meth:`~.Field.deconstruct` メソッドがあります。これは :doc:`モデルのマイグレーション </topics/migrations>` 中に使用されるもので、新しいフィールドのインスタンスを取得する方法、インスタンスをどのようにシリアライズして減らすかの方法をDjangoに指示します。特に、インスタンスを再生成するためにどの引数を ``__init__()`` に渡すかを指示します。

source: If you haven't added any extra options on top of the field you inherited from, then there's no need to write a new ``deconstruct()`` method. If, however, you're changing the arguments passed in ``__init__()`` (like we are in ``HandField``), you'll need to supplement the values being passed.
it: Se non hai aggiunto opzioni extra sul campo dal quale hai ereditato, allora non c'è bisogno di scrivere un nuovo metodo ``deconstruct()``. Se, comunque, stai cambiando gli argomenti da passare ad ``__init__()`` (come stiamo facendo in ``HandField``), avrai bisogno di integrare i valori da passare.
ja: 継承元のフィールドの上に追加のオプションを追加していない場合、新しい ``deconstruct()`` メソッドを記述する必要はありません。 ただし、``__init__()`` で渡される引数を変更する場合（``HandField`` のように）、渡される値を補足する必要があります。
ko: 물려받은 분야 위에 별도의 옵션을 추가하지 않았다면 굳이 새로운 ```deconstruct()" 방식을 쓸 필요가 없다. 그러나 만일 당신이 ``_init__()" (우리가 "HandField"에 있는 것처럼)로 전달된 주장을 바꾼다면, 당신은 통과되는 값을 보완할 필요가 있을 것이다.
pt_br: Se não foram adicionadas opções extras ao campo que foi herdado, então não há necessidade de reescrever o método ``deconstruct()``. Por outro lado, se você mudar os argumentos passados no ``__init__()`` (como em ``HandField``), será preciso complementar os argumentos sendo passados.
zh_hans: 如果你未在继承的字段之前添加任何选项，就不需要编写新的 ``deconstruct()`` 方法。然而，如果你正在修改传递给 ``__init__()`` 的参数（像 ``HandField`` 中的一样），你需要增补被传递的值。

source: ``deconstruct()`` returns a tuple of four items: the field's attribute name, the full import path of the field class, the positional arguments (as a list), and the keyword arguments (as a dict). Note this is different from the ``deconstruct()`` method :ref:`for custom classes <custom-deconstruct-method>` which returns a tuple of three things.
it: ``deconstruct()`` restituisce una tupla di 4 elementi: il nome dell'attributo del campo, l'import path completo della classe del campo, i positional arguments (come lista) ed i keyword arguments (come dizionario). Nota che questo è differente dal metodo ``deconstruct()`` :ref:`per la classi custom <custom-deconstruct-method>` che restituisce una tupla di tre cose.
ja: ``deconstruct()`` 関数は4要素のタプルを返します。それは、フィールドの属性、インポートするフィールドクラスのフルパス、位置引数（リスト型）、キーワード引数（辞書型）です。この関数は ``deconstruct()`` メソッドとは異なることに注意してください。 ``deconstruct()`` メソッドは :ref:`カスタムクラスのためのもの <custom-deconstruct-method>` で、3要素のタプルを返します。
ko: ``deconstruct()" 는 4개의 아이템의 튜플을 반환합니다 :필드 속성 이름, 필드 클래스의 전체 가져오기 경로, 위치 인수(목록으로) 및 키워드 인수(dict로)가 있습니다. 이는 3개의 튜플을 반환하는 ``deconstruct()`` method :ref:` 과는 다릅니다.

source: As a custom field author, you don't need to care about the first two values; the base ``Field`` class has all the code to work out the field's attribute name and import path. You do, however, have to care about the positional and keyword arguments, as these are likely the things you are changing.
it: Come autore di un campo custom, non devi preoccuparti dei primi due valori; la classe di base ``Field`` ha tutto il codice per gestire l'attributo relativo al nome del campo ed al percorso di importazione. Devi, in ogni caso, fare attenzione ai positional e keyword arguments, perchè molto probabilmente sono quelli che stai cambiando.
ja: カスタムフィールドの作成者は、最初の2つの値を気にする必要はありません。 ベース ``Field`` クラスには、フィールドの属性名とインポートパスを計算するためのすべてのコードがあります。 ただし、位置引数とキーワード引数は、変更する可能性が高いため、注意する必要があります。
ko: 사용자 지정 필드 작성자로서 기본 ``Field" 클래스는 필드의 속성 이름과 가져오기 경로를 결정하는 모든 코드를 가지고 있기 때문에 앞의 두 값에 신경 쓸 필요가 없습니다. 그러나 위치 및 키워드 인수에 주의해야 합니다. 이러한 인수는 사용자가 변경하는 것일 수 있기 때문입니다.
pt_br: Como autor do campo customizado, não é necessário se preocupar sobre os dois primeiros valores; a classe ``Field`` básica tem todo o código para o atributo "name" e "import path" funcionar. Entretanto, devemos nos preocupar com o argumentos posicionais e os nomeados, já que estes são as alterações que fizemos
zh_hans: 作为自定义字段的作者，你不需要担心前两个值；基类 ``Field`` 已包含处理字段属性名和导入路径的代码。然后，你仍必须关注位置参数和关键字参数，这些是你最有可能改的东西。

source: For example, in our ``HandField`` class we're always forcibly setting max_length in ``__init__()``. The ``deconstruct()`` method on the base ``Field`` class will see this and try to return it in the keyword arguments; thus, we can drop it from the keyword arguments for readability::
it: Per esempio, nella nostra classe ``HandField`` stiamo già forzosamente impostando max_length in ``__init__()``. Il metodo ``deconstruct()`` sulla classe base ``Field`` ne terrà conto e cercherà di restituirlo tra i keyword arguments; quindi, possiamo eliminarlo dai keyword arguments per questioni di leggibilità::
ja: たとえば、 ``HandField`` クラスでは、常に ``__init__()`` でmax_lengthを強制的に設定しています。 ``Field`` ベースクラスの ``deconstruct()`` メソッドはこれを見て、キーワード引数でそれを返そうとします。 したがって、読みやすくするためにキーワード引数から削除できます::
ko: 예를 들어 우리의 ``HandField" 클래스에서 우리는 항상 max_length를 ``__init__()"로 강제적으로 설정한다. "Field" 클래스의 ``deconstruct() "방식은 이것을 보고 키워드 논쟁에서 반환하려고 할 것이다. 따라서 우리는 이것을 가독성을 위한 키워드 논쟁에서 빼놓을 수 있다.
pt_br: Por exemplo, na nossa classe "HandField" sempre somos forçados a definir max_length em " __init __ () ". O método "deconstruct()" da classe base "Field" ierá tentar retornar os argumentos da palavra-chave; assim, podemos lançar a partir dos argumentos palavras-chaves para facilitar a leitura ::
zh_hans: 例如，在 ``HandField`` 类中，我们总是强制设置 ``__init__()`` 的长度。基类 ``Field`` 中的 ``deconstruct()`` 方法会看到这个值，并尝试在关键字参数中返回它；因此，我们能为了可读性从关键字参数中剔除它::

source: If you add a new keyword argument, you need to write code in ``deconstruct()`` that puts its value into ``kwargs`` yourself. You should also omit the value from ``kwargs`` when it isn't necessary to reconstruct the state of the field, such as when the default value is being used::
it: Se aggiungi un nuovo keyword argument, dovrai scrivere da te del codice in ``deconstruct()`` che metta il suo valore in ``kwargs``. Dovresti anche omettere il valore da ``kwargs`` quando non sia necessario ricostruire lo stato del campo, per esempio quando se ne usa il valore predefinito::
ja: 新しいキーワード引数を追加する場合、自分で ``kwargs`` に値を設定する ``deconstruct()`` でコードを記述する必要があります。 また、デフォルト値が使用されている場合など、フィールドの状態を再構築する必要がない場合は、``kwargs`` から値を省略してください::
ko: 새로운 키워드 논거를 추가하면 그 가치를 스스로 "kwags"에 넣는 ``decorruction()"이라는 코드를 쓸 필요가 있다. 기본값이 사용되는 경우와 같이 필드 상태를 재구성할 필요가 없는 경우 "kwags"에서 값을 생략해야 한다.
zh_hans: 若你添加了一个新的关键字参数，你需要在 ``deconstruct`` 中新增代码，将其值传入 ``kwargs``。如果不需要字段的重构状态，比如使用默认值的情况，还应该忽略 ``kwargs`` 中的值。

source: More complex examples are beyond the scope of this document, but remember - for any configuration of your Field instance, ``deconstruct()`` must return arguments that you can pass to ``__init__`` to reconstruct that state.
it: Esempi più complessi sono oltre le finalità di questo documento ma ricorda - per ogni configurazione della tua istanza di Field, ``deconstruct()`` deve restituire argomenti che si possano passare ad ``__init__`` per ricostruire lo stato.
ja: より複雑な例はこのドキュメントの範囲外ですが、これだけは覚えておいてください - ``deconstruct()`` は、フィールドインスタンスのどのような設定に対しても、その状態を再構築するために ``__init__`` に渡す引数を返さなければなりません。
ko: 좀 더 복잡한 예는 이 문서의 범위를 벗어나지만 기억하라. 즉, 필드 인스턴스의 구성에 대해서는 "`deconstruct()"가 해당 상태를 재구성하기 위해 "_init__"로 전달할 수 있는 인수를 반환해야 한다.
pt_br: Exemplos mais complexos estão além do escopo deste documento, mas lembre - para qualquer configuração da sua instância de Field, o ``deconstruct()`` tem que retornar argumentos que se possa passar para o ``__init__`` para reconstruir aquele estado.
zh_hans: 更多的复杂例子超出本文的范围，但是请牢记——对于你的字段实例的任意配置，``deconstruct()`` 必须返回能传递给 ``__init__`` 的参数重构状态。
