Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Within such a migration, all operations are run without a transaction. It's possible to execute parts of the migration inside a transaction using :func:`~django.db.transaction.atomic()` or by passing ``atomic=True`` to ``RunPython``.
it: In tale migrazione, tutte le operazioni sono lanciate senza transazione. E' possibile eseguire parti della migrazione dentro una transazione usando :func:`~django.db.transaction.atomic()` o passando ``atomic=True`` a ``RunPython``.
ja: このようなマイグレーションでは、すべての操作はトランザクションなしで実行されます。 :func:`~django.db.transaction.atomic()` を使用するか、 ``RunPython`` に ``atomic=True`` を渡すことで、マイグレーションの一部をトランザクション内で実行できます。
ko: 이러한 마이그레이션 내에서 모든 작업은 트랜잭션 없이 실행됩니다. func:'~django.db.transaction.transaction.transaction.transaction'을 사용하거나 "transaction"을 전달하여 트랜잭션 내 마이그레이션의 일부를 실행할 수 있습니다."피톤을 운영하라"는 말은 사실입니다.
zh_hans: 在这样的迁移种，所有的操作运行时都不含事务。通过使用 :func:`~django.db.transaction.atomic()` 或为 ``RunPython`` 传入 ``atomic=True`` 能将部分迁移置于事务之中。

source: Here's an example of a non-atomic data migration that updates a large table in smaller batches::
it: Qui c'è un esempio di migrazione dei dati non atomica che aggiorna una grande tabella con piccoli passi automatici::
ja: 以下は、大きなテーブルを小さなバッチで更新する、非アトミックなデータマイグレーションの例です:
ko: 다음은 더 작은 배치로 큰 테이블을 업데이트하는 비원자 데이터 마이그레이션의 예입니다.
zh_hans: 这是一个例子，关于非原子性数据迁移操作，将更新大数据表的操作分为数个小批次::

source: The ``atomic`` attribute doesn't have an effect on databases that don't support DDL transactions (e.g. MySQL, Oracle). (MySQL's `atomic DDL statement support <https://dev.mysql.com/doc/refman/en/atomic-ddl.html>`_ refers to individual statements rather than multiple statements wrapped in a transaction that can be rolled back.)
it: L'attributo ``atomic`` non ha effetto sui database che non supportano le transazioni DDL (per es. MySQL, Oracle). (Il supporto per le istruzioni `atomic DDL di MySQL <https://dev.mysql.com/doc/refman/en/atomic-ddl.html>`_ si riferisce a singole istruzioni, piuttosto che a più istruzioni racchiuse in una transazione sulla quale si può fare roll back.)
ja: ``atomic`` 属性は DDL トランザクションをサポートしていないデータベース (MySQL や Oracle など) には影響しません。(MySQLの `atomic DDL statement support <https://dev.mysql.com/doc/refman/en/atomic-ddl.html>`_ は、ロールバック可能なトランザクションに包まれた複数のステートメントではなく、個々のステートメントを指します)。
ko: "원자" 특성은 DDL 트랜잭션을 지원하지 않는 데이터베이스(예: MySQL, Oracle)에는 영향을 미치지 않습니다. (MySQL의 'dsl statement support https://dev.mysql.com/doc/refman/en/atomic-ddl.html'_은(는) 롤백할 수 있는 트랜잭션에 포함된 여러 개의 문이 아닌 개별 문을 말합니다.)
zh_hans: ``atomic`` 属性对不支持 DDL 事务的数据库没有影响（例如 MySQL，Oracle）。（MySQL 的 `原子性 DDL 语句支持 <https://dev.mysql.com/doc/refman/en/atomic-ddl.html>`_ 指向独立的语句，而不是封装在能回滚的事务中的多句语句。）

source: Controlling the order of migrations
it: Controllo dell'ordine delle migrazioni
ja: マイグレーションの順序をコントロールする
ko: 마이그레이션 순서 제어
pt_br: Controlando a ordem das migrações
zh_hans: 控制迁移顺序

source: Django determines the order in which migrations should be applied not by the filename of each migration, but by building a graph using two properties on the ``Migration`` class: ``dependencies`` and ``run_before``.
it: Django determina l'ordine in cui le migrazioni dovrebbero essere applicate non in base al nome del file di ogni migrazione, ma usando un grafo che usa due proprietà sulla classe ``Migration``: ``dependencies`` e ``run_before``.
ja: Django はマイグレーションを適用する順番を、マイグレーションのファイル名ではなく、 ``Migration`` クラスの 2 つのプロパティである ``dependencies`` と ``run_before`` を使ってグラフを作成することで決定します:
ko: Django는 각 마이그레이션의 파일 이름이 아니라 "이민" 클래스의 ``dependency"와 "run_before"라는 두 가지 속성을 사용하여 마이그레이션이 적용되어야 하는 순서를 결정합니다.
pt_br: django determina a ordem em que as migrações não devem ser aplicadas pelo nome do arquivo de cada migração, mas através da construção de um gráfico usando duas propriedade na classe ``Migration``: ``dependencies`` e ``run_before``.
zh_hans: Django 不是通过迁移的名字决定迁移执行顺序，而是通过在 ``迁移`` 类上使用两个属性： ``dependencies`` 和 ``run_before``。

source: If you've used the :djadmin:`makemigrations` command you've probably already seen ``dependencies`` in action because auto-created migrations have this defined as part of their creation process.
it: Se hai usato il comando :djadmin:`makemigrations` probabilmente hai già visto ``dependencies`` in azione perchè le migrazioni auto-generate lo hanno definito come parte del loro processo di creazione.
ja: :djadmin:`makemigrations` コマンドを使ったことがあるなら、おそらく ``dependencies`` の動作をすでに見ているでしょう。自動生成されたマイグレーションは作成プロセスの一部としてそれを定義するためです。
ko: "djadmin:"make migration" 명령을 사용했다면 자동 생성된 마이그레이션은 생성 과정의 일부로 정의되기 때문에 "dependency"가 이미 실행 중인 것을 보았을 것입니다.
pt_br: se você estiver usando o comando :djadmin:`makemigration` você provavelmente já viu ``dependencies`` em ação por causa da migration auto-criada, tendo esta definição como parte do processo de criação.
zh_hans: 若你用过 :djadmin:`makemigrations` 命令，你可能早已在运行时见过 ``dependencies``，因为自动创建的迁移将此定义为其创建过程的一部分。

source: The ``dependencies`` property is declared like this::
it: La proprietà ``dependencies`` viene dichiarata in questo modo::
ja: ``dependencies`` プロパティは次のように宣言されます::
ko: "의존성" 재산은 다음과 같이 선언됩니다.
pt_br: A propridade ``dependencies`` está declarada como isto::
zh_hans: ``依赖`` 属性像这样申明::

source: Usually this will be enough, but from time to time you may need to ensure that your migration runs *before* other migrations. This is useful, for example, to make third-party apps' migrations run *after* your :setting:`AUTH_USER_MODEL` replacement.
it: Generalmente questo basta, ma di volta in volta potresti aver bisogno di assicurarti che le tue migrazioni girino *prima* di altre migrazioni. Questo torna utile, ad esempio, per fare in modo che le migrazioni delle app di terze parti girino *dopo* i rimpiazzi sul tuo :setting:`AUTH_USER_MODEL`.
ja: 通常はこれで十分ですが、時にはあなたのマイグレーションが他のマイグレーションよりも *先に* 実行されるようにする必要があるかもしれません。これは例えば、サードパーティアプリのマイグレーションを :setting:`AUTH_USER_MODEL` の置換の *後に* 実行させるのに便利です。
ko: 일반적으로 이 정도면 충분하지만 때때로 마이그레이션이 *다른 마이그레이션 전에* 실행되도록 해야 할 수도 있습니다. 예를 들어, 이 기능은 타사 앱의 마이그레이션을 *다음* 이후에 실행하도록 하는 데 유용합니다. 설정:'AUTH_USER_MODEL을 대체합니다.
pt_br: Normalmente isso é o bastante, mas de vez enquando você pode assegurar que sua migração rode *antes* de outras migrações. Isso é útil, por exemplo, para fazer migrações de aplicações de terceiros rodar *depois* de substituir seu :setting:`AUTH_USER_MODEL`.
zh_hans: 通常这就够用了，但是有很多次，你总是需要确认你的迁移运行在其它迁移 *之前*。例如，这对于让第三方应用的迁移运行在替换 :setting:`AUTH_USER_MODEL` 之后就很有用。

source: To achieve this, place all migrations that should depend on yours in the ``run_before`` attribute on your ``Migration`` class::
it: Per ottenere ciò, inserisci tutte le migrazioni che dovrebbero dipendere dalla tua nell'attributo ``run_before`` nella tua classe ``Migration``::
ja: これを行うには、 ``Migration`` クラスの ``run_before`` 属性に、依存するすべてのマイグレーションを配置します:
ko: 이를 위해 귀사에 의존해야 할 모든 마이그레이션을 귀국의 ``이민" 등급의 ``실행 전" 속성으로 배치하십시오.
pt_br: Para conseguir isso, coloque todas as migrações que devem depender das suas no atributo ``run_before`` na sua classe ``Migration``::
zh_hans: 要实现此目的，将所有需要先运行的迁移置于你的 ``Migration`` 类的 ``run_before`` 属性::

source: Prefer using ``dependencies`` over ``run_before`` when possible. You should only use ``run_before`` if it is undesirable or impractical to specify ``dependencies`` in the migration which you want to run after the one you are writing.
it: È preferibile usare ``dipendenze`` su ``run_before`` quando possibile. Dovresti usare ``run_before`` solo se non è desiderabile o non pratico specificare ``dependencies`` nella migrazione che vuoi eseguire dopo quella che stai scrivendo.
ja: 可能な限り、 ``run_before`` よりも ``dependencies`` を使うことを推奨します。 ``run_before`` を使うのは、書いているマイグレーションの後に実行したいマイグレーションで ``dependencies`` を指定するのが望ましくないか、現実的でない場合のみです。
ko: 가능하면 ``실행 전"보다 "의존적"을 사용하는 것을 선호합니다. 작성 중인 마이그레이션 이후에 실행할 마이그레이션에 ``의존성"을 지정하는 것이 바람직하지 않거나 비실용적인 경우에만 "run_before"를 사용해야 합니다.
pt_br: Prefira usar ``dependencies`` ao ``run_before`` quando possível. Você deve somente usar o ``run_before`` se ele não é desejável ou impraticável para especificar ``dependencies`` na migração qual você quer rodar depois da que está escrevendo.
zh_hans: 尽可能使用 ``dependencies``，而不是 ``run_before``。只有在在特定迁移中添加 ``dependencies`` 使其运行于你编写的迁移之后是没希望的和不切实际的情况下，你才能使用 ``run_before``。

source: Migrating data between third-party apps
it: Migrazione dei dati tra app
ja: サードパーティのアプリ間でデータをマイグレーションする
ko: 타사 앱 간에 데이터를 마이그레이션하고 있습니다.
zh_hans: 在第三方应用程序中迁移数据

source: You can use a data migration to move data from one third-party application to another.
it: È possibile utilizzare una migrazione dei dati per spostare i dati da un'applicazione ad un'altra.
ja: データマイグレーションを使って、あるサードパーティアプリケーションから別のアプリケーションにデータを移動できます。
ko: 데이터 마이그레이션을 사용하여 한 타사 응용 프로그램에서 다른 응용 프로그램으로 데이터를 이동할 수 있습니다.
zh_hans: 你可以使用数据迁移把数据从一个第三方应用程序中转移到另一个。

source: If you plan to remove the old app later, you'll need to set the ``dependencies`` property based on whether or not the old app is installed. Otherwise, you'll have missing dependencies once you uninstall the old app. Similarly, you'll need to catch :exc:`LookupError` in the ``apps.get_model()`` call that retrieves models from the old app. This approach allows you to deploy your project anywhere without first installing and then uninstalling the old app.
it: Se prevedi di rimuovere la vecchia app in un secondo momento, dovrai impostare la proprietà ``dependencies`` in base al fatto che la vecchia app sia installata o meno. Altrimenti, avrai le dipendenze mancanti dopo aver disinstallato la vecchia app. Allo stesso modo, dovrai catturare :exc:`LookupError` nella chiamata ``apps.get_model()`` che recupera i modelli dalla vecchia app. Questo approccio ti consente di distribuire il tuo progetto ovunque senza prima installare e quindi disinstallare la vecchia app.
ja: 後で古いアプリを削除する予定がある場合は、古いアプリがインストールされているかどうかに基づいて ``dependencies`` プロパティを設定する必要があります。そうしないと、古いアプリをアンインストールしたときに依存関係がなくなってしまいます。同様に、古いアプリからモデルを取得する ``apps.get_model()`` の呼び出しで :exc:`LookupError` をキャッチする必要があります。この方法によって、古いアプリをインストールしてからアンインストールすることなく、プロジェクトをどこにでもデプロイできるようになります。
ko: 나중에 기존 앱을 제거할 계획이라면 기존 앱의 설치 여부에 따라 "의존성" 속성을 설정해야 합니다. 그렇지 않으면 이전 앱을 제거한 후 종속성이 누락됩니다. 마찬가지로 exc를 확인해야 합니다.기존 앱에서 모델을 검색하는 ``apps.get_model()" 통화에서 "Lookup Error"가 발생합니다. 이 방법을 사용하면 먼저 이전 앱을 설치한 다음 제거하지 않고도 프로젝트를 아무 곳에나 배포할 수 있습니다.
zh_hans: 如果你计划要移除旧应用程序，则需要根据是否安装旧应用程序来设置 ``依赖`` 属性。否则，一旦你卸载旧应用程序，就会缺失依赖项。同样，你需要在调用 ``app.get_model()`` 时捕获 :exc:`LookupError`，前者在旧应用程序中检索模型。这种方法允许你在任何地方部署项目，而无需先安装并且卸载旧应用程序。

source: Here's a sample migration:
it: Ecco un esempio di migrazione:
ja: 簡単なマイグレーションの例を見てみましょう:
ko: 다음은 마이그레이션 예 입니다:
zh_hans: 这是一个迁移示例：

source: Also consider what you want to happen when the migration is unapplied. You could either do nothing (as in the example above) or remove some or all of the data from the new application. Adjust the second argument of the :mod:`~django.db.migrations.operations.RunPython` operation accordingly.
it: Potresti non fare nulla (come nell'esempio sopra) o rimuovere alcuni o tutti i dati dalla nuova applicazione. Regola di conseguenza il secondo argomento dell'operazione :mod:`~django.db.migrations.operations.RunPython`.
ja: また、マイグレーションが適用されないときにどうしたいかも検討します。（上記の例のように）何もしないか、新しいアプリケーションからデータの一部または全部を削除できます。 それに応じて :mod:`~django.db.migrations.operations.RunPython` 操作の2番目の引数を調整します。
ko: 또한 마이그레이션이 적용되지 않을 때 수행할 작업도 고려하십시오. 위의 예와 같이 아무 작업도 수행하지 않거나 새 응용 프로그램에서 일부 또는 모든 데이터를 제거할 수 있습니다. :mod의 두 번째 인수를 조정합니다.'~django.db.migrations.operations입니다.이에 따라 파이썬을 실행합니다.
zh_hans: 另外在迁移未执行时，请考虑好什么是你想要发生的。你可以什么都不做（就像上面的示例）或者从新应用中移除一些或全部的数据。相应的调整 :mod:`~django.db.migrations.operations.RunPython` 操作的第二个参数。

source: Changing a ``ManyToManyField`` to use a ``through`` model
it: Modifica di un ``ManyToManyField`` per utilizzare un modello ``through``
ja: ``ManyToManyField`` を中間 (``through``) モデルを使うように変更する
ko: ``ManyToManyField`` 를 바꾸어 ``through`` 모델을 사용합니다.

source: If you change a :class:`~django.db.models.ManyToManyField` to use a ``through`` model, the default migration will delete the existing table and create a new one, losing the existing relations. To avoid this, you can use :class:`.SeparateDatabaseAndState` to rename the existing table to the new table name while telling the migration autodetector that the new model has been created. You can check the existing table name through :djadmin:`sqlmigrate` or :djadmin:`dbshell`. You can check the new table name with the through model's ``_meta.db_table`` property. Your new ``through`` model should use the same names for the ``ForeignKey``\s as Django did. Also if it needs any extra fields, they should be added in operations after :class:`.SeparateDatabaseAndState`.
it: Se modifichi una :class:`~django.db.models.ManyToManyField` per usare un modello ``through``, la migrazione predefinita cancellerà la tabella esistente e ne creerà una nuova, perdendo le relazioni esistenti. Per evitare ciò, puoi utilizzare :class:`.SeparateDatabaseAndState` per rinominare la tabella esistente con il nuovo nome della tabella, comunicando al rilevatore automatico di migrazione che il nuovo modello è stato creato. Puoi controllare il nome della tabella esistente tramite :djadmin:`sqlmigrate` o :djadmin:`dbshell`. Puoi controllare il nuovo nome della tabella attraverso la proprietà ``_meta.db_table`` del modello. Il tuo nuovo modello ``through`` dovrebbe usare gli stessi nomi per ``ForeignKey``\s di Django. Inoltre, se sono necessari campi aggiuntivi, dovrebbero essere aggiunti nelle operazioni dopo :class:`.SeparateDatabaseAndState`.
ja: :class:`~django.db.models.ManyToManyField` を ``through`` モデルに変更すると、デフォルトのマイグレーションは既存のテーブルを削除して新しいテーブルを作成し、既存のリレーションを失います。これを避けるには、:class:`.SeparateDatabaseAndState` を使用して、マイグレーションの自動検出器に新しいモデルが作成されたことを伝えながら、既存のテーブル名を新しいテーブル名に変更します。既存のテーブル名は :djadmin:`sqlmigrate` または :djadmin:`dbshell` で確認できます。新しいテーブル名は中間モデルの ``_meta.db_table`` プロパティで確認できます。新しい ``through`` モデルは ``ForeignKey`` に Django と同じ名前を使うべきです。また、追加のフィールドが必要な場合は、 :class:`.SeparateDatabaseAndState` の後の操作で追加してください。

source: For example, if we had a ``Book`` model with a ``ManyToManyField`` linking to ``Author``, we could add a through model ``AuthorBook`` with a new field ``is_primary``, like so::
it: Per esempio, se avessimo un modello ``Book`` con un ``ManyToManyField`` collegato a ``Author``, potremmo aggiungere un modello completo ``AuthorBook`` con un nuovo campo ``is_primary``, come::
ja: 例えば、 ``Author`` にリンクする ``ManyToManyField`` を持つ ``Book`` モデルがあった場合、次のように新しいフィールド ``is_primary`` を持つ中間モデル ``AuthorBook`` を追加できます:
ko: 예를 들어 우리가 ``다수로"를 ``저자"로 연결한 ``책" 모델을 가지고 있다면 다음과 같이 새로운 분야의 "is_primary"를 가진 ``저자책"을 추가할 수 있을 것입니다.

source: Changing an unmanaged model to managed
it: Modifica di un modello non gestito in gestito
ja: 未管理状態のモデルを管理状態に変更する
ko: 관리되지 않는 모델을 관리 대상으로 변경합니다.
zh_hans: 将非托管模型变为托管的

source: If you want to change an unmanaged model (:attr:`managed=False <django.db.models.Options.managed>`) to managed, you must remove ``managed=False`` and generate a migration before making other schema-related changes to the model, since schema changes that appear in the migration that contains the operation to change ``Meta.managed`` may not be applied.
it: Se desideri modificare un modello non gestito (:attr:`managed=False <django.db.models.Options.managed>`) in gestito, devi rimuovere ``managed=False`` e generare una migrazione prima di creare un altro schema -modifiche correlate al modello, poiché le modifiche allo schema che appaiono nella migrazione che contiene l'operazione di modifica di ``Meta.managed`` potrebbero non essere applicate.
ja: 未管理状態のモデル（:attr:`managed=False <django.db.models.Options.managed>`) を管理状態に変更する場合、 ``managed=False`` を削除し、マイグレーションを生成してから、モデルにスキーマ関連の変更を加える必要があります。これは、 ``Meta.managed`` を変更する操作を含むマイグレーションに含まれるスキーマ変更が適用されない可能性があるためです。
ko: 관리되지 않는 모델(:attr:'managed >False <django.db.db.closed)을 변경하려는 경우입니다.관리 대상인 Options.managed>'에서는 "Meta.managed" 변경 작업을 포함하는 마이그레이션에 표시되는 스키마 변경 사항이 적용되지 않을 수 있으므로 모델을 변경하기 전에 "Managed ="을 제거하고 마이그레이션을 생성해야 합니다.
zh_hans: 如果你想要将非托管模型 (:attr:`managed=False <django.db.models.Options.managed>`) 变为托管的，你必须移除 ``managed=False`` 并且在对此模型做其他模式相关的改变前生成一次迁移，因为如果迁移中出现模式改变，对 ``Meta.managed`` 的修改操作不会被执行。

source: Called by ``Storage.open()``, this is the actual mechanism the storage class uses to open the file. This must return a ``File`` object, though in most cases, you'll want to return some subclass here that implements logic specific to the backend storage system.
it: Chiamato tramite ``Storage.open()``, questo è il meccanismo attuale che la casse di storage usa per aprire il file. Questo deve ritornare un oggetto ``File``, anche se nella maggior parte dei casi, vorrai ritornare qualche sottoclasse che implementa una logica specifica al sistema di storage di backend.
ko: "Storage.open()"으로 호출하게 되는것이 저장 클래스가 실제로 파일을 열기 위해 사용하는 매커니즘이다. 이는 항상 "File" 오브젝트를 반환하는데, 대부분의 경우, 백엔드 저장 시스템에 특정한 논리를 실행하는 몇몇개의 상속들을 너는 반환하고 싶을것이다.
pt_br: Chamado por `` Storage.open () ``, este é o mecanismo real da classe de armazenamento utiliza para abrir o arquivo. Isso deve retornar um objeto `` File``, embora na maioria dos casos, você vai querer retornar alguma subclasse aqui que implementa a lógica específica para o back-end do sistema de armazenamento.
zh_hans: 它将被 ``Storage.open()`` 调用，前者才是存储类用来打开文件的真正机制，这个方法必须要返回一个 ``文件`` 对象。尽管在大多数时候，你想要这个方法返回一个继承于特定逻辑的后台存储系统的子类。

source: Should return the actual name of name of the file saved (usually the ``name`` passed in, but if the storage needs to change the file name return the new name instead).
it: Deve restituire il nome reale del file salvato (di solito il ``name`` utilizzato in chiamata, ma se la memoria di massa deve cambiare il nome del file, il nome restituito deve essere il nuovo nome).
ko: 저장된 파일의 실제 이름을 반환해야 합니다(일반적으로 "이름"이 전달되지만 저장소의 파일 이름을 변경해야 할 경우 새 이름을 반환합니다.)
pt_br: Deve retornar o nome real do nome do arquivo salvo (geralmente o ``name`` passado, mas se o armazenamento precisa mudar o nome do arquivo retorna então retorna o novo nome).
zh_hans: 应该返回保存的文件名的实际名称（通常是传入“name”，但如果内存需要改变文件名，则返回新名称）。

source: If ``app_configs`` and ``tags`` are both ``None``, all system checks are performed. ``tags`` can be a list of check tags, like ``compatibility`` or ``models``.
it: Se ``app_configs`` e ``tags`` sono entrambi ``None``, sono effettuati tutti i controlli di sistema. ``tags`` può essere una lista di tag di controllo, come ``compatibility`` o ``models``.
ko: "app_configs"와 "tags"가 둘 다 "None"이면 모든 시스템 점검이 이루어진다. "'compatibility' 또는 ''models''과 같은 체크 태그의 목록이 될 수 있다.
pt_br: Se ambos ``app_configs`` e ``tags`` forem ``None``, todas as verificações do sistema são realizadas. `` Tags`` pode ser uma lista tags de checagem, como ``compatibility`` ou ``models``.
zh_hans: 若 ``app_configs`` 和 ``tags`` 均为 ``None``，所以的系统检查项都会被运行。``tags`` 能是一个检查标签的列表，例如 ``compatibility`` 或 ``models``。

source: The :meth:`~Field.db_type` and :meth:`~Field.rel_db_type` methods are called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. The methods are also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument. They are not called at any other time, so it can afford to execute slightly complex code, such as the ``connection.settings_dict`` check in the above example.
it: I metodi :meth:`~Field.db_type` e :meth:`~Field.rel_db_type` sono chiamati da Django quando il framework costruisce gli statement ``CREATE TABLE`` per la tua applicazione -- cioè, quando crei le tabelle la prima volta. I metodi vengono anche chiamati quando viene costruita una clausola ``WHERE`` che include il model field -- cioè, quando richiedi dei dati con i metodi QuerySet come ``get()``, ``filter()`` ed ``exclude()`` ed hai il model field come argomento. Non sono chiamati in nessun'altra situazione, così si può permettere di eseguire codice un po' più complesso, come il controllo ``connection.settings_dict`` dell'esempio citato sopra.
ko: :meth:'~Field.db_type' 및 :meth:'~Field.rel_db_type' 방법은 프레임워크가 당신의 애플리케이션에 대한 ``CREATE TABLE" 문을 구성할 때 즉, 당신이 당신의 테이블을 처음 만들 때 Django에 의해 호출된다. 이 방법은 모델 필드를 포함하는 ``WHERE" 조항 즉 ``필터()"와 "제외()"와 같은 쿼리셋 방법을 사용하여 데이터를 검색하고 모델 필드를 논쟁으로 삼을 때도 호출된다. 그들은 다른 때 호출되지 않기 때문에 그것은 ``연결"과 같은 약간 복잡한 코드를 실행할 여유가 있다.위의 예에서 settings_laints를 체크합니다.
zh_hans: :meth:`~Field.db_type` 和 :meth:`~Field.rel_db_type` 方法由 Django 框架在为应用构建 ``CREATE TABLE`` 语句时调用——即你第一次创建数据表的时候。这些方法也在构建一个包含此模型字段的 ``WHERE`` 字句时调用——即你在利用 QuerySet 方法(``get()``, ``filter()``, 和 ``exclude()``)检出数据时或将此模型字段作为参数时。它们在其它时间不会被调用，故它们能承担执行有点小复杂的代码，例如上述的 ``connection.settings_dict`` 例子。

source: The ``SECRET_KEY_FALLBACKS`` setting was added to support rotating secret keys.
it: L'impostazione ``SECRET_KEY_FALLBACKS`` è stata aggiunta per supportare la rotazione delle chiavi per i segreti.

source: This document will guide you through installing Python 3.8 and Django on Windows. It also provides instructions for setting up a virtual environment, which makes it easier to work on Python projects. This is meant as a beginner's guide for users working on Django projects and does not reflect how Django should be installed when developing patches for Django itself.
it: Questo documento ti guiderà su come installare Python 3.8 e Django su Windows. Offre anche istruzioni su come creare un virtual environment, che rende più facile lavorare su progetti Python. E' intesa come guida per principianti per utenti che lavorano a progetti Django e non riflette come Django dovrebbe essere installato quando si sviluppano patch per Django stesso.
ko: 이 문서는 Windows에 Python 3.8 및 Django를 설치하는 과정을 안내합니다. 또한 Python 프로젝트에서 보다 쉽게 작업할 수 있도록 가상 환경 설정에 대한 지침을 제공합니다. 이것은 Django 프로젝트를 하는 사용자들을 위한 초보자 가이드로서 의미되며, Django 자체에 대한 패치를 개발할 때 Django가 어떻게 설치되어야 하는지 반영하지 않습니다.

source: Django is a Python web framework, thus requiring Python to be installed on your machine. At the time of writing, Python 3.8 is the latest version.
it: Django è un Python framework web, che richiede che Python sia installato sulla tua macchina. Al momento della stesura, Python 3.8 è l'ultima versione.
ko: Django는 Python 웹 프레임워크이므로 Python을 컴퓨터에 설치해야 합니다. 현재 Python 3.8은 최신 버전입니다.

source: To do this, add a ``management/commands`` directory to the application. Django will register a ``manage.py`` command for each Python module in that directory whose name doesn't begin with an underscore. For example::
ko: 이를 위해 애플리케이션에 ``management/commands`` 디렉토리를 추가합니다. django는이름이 밑줄로 시작하지 않는 ``manage.py"를 각 디렉토리안에 있는 Python 모듈에 대한 커멘드에 등록할 것이다.

source: Tries to execute this command, performing system checks if needed (as controlled by the :attr:`requires_system_checks` attribute). If the command raises a :exc:`CommandError`, it's intercepted and printed to stderr.
ko: 필요한 경우 시스템 검사를 수행하여 이 명령을 실행하시오( :attr:'requires_system_checks' 속성에 의해 제어됨). 커맨드가 :exc:`CommandError` 을 보여주는 경우, 중간에 가로채져 stderr에 출력될 것입니다.
pt_br: Tenta executar este comando, realizando verificações de sistemas se necessário (como controlado pelo atributo :attr:`requires_system_checks`). Se o comando gerar um :exc:`CommandError`, este é interceptado e impresso no stderr.
zh_hans: 试着执行此命令，如果需要的话，进行系统检查（由 :attr:`requires_system_checks` 控制）。若命令抛出 :exc:`CommandError`，这会导致命令中断，并将错误输出至 stderr。
