Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: When Uvicorn is installed, a ``uvicorn`` command is available which runs ASGI applications. Uvicorn needs to be called with the location of a module containing an ASGI application object, followed by what the application is called (separated by a colon).
it: Quando Uvicorn è installato, è disponibile un comando ``uvicorn``, che fa girare le applicazioni ASGI. Uvicorn necessita di essere chiamato dalla locazione di un modulo contenente un oggetto di applicazione ASGI, seguito da come si chiama l'applicazione (separati dai due punti).
ja: Uvicornがインストールされると、ASGIアプリケーションを実行する ``uvicorn`` コマンドが利用できるようになります。Uvicornを呼び出すには、ASGIアプリケーションオブジェクトを含むモジュールの場所と、それに続いてアプリケーションの名前(コロン区切り)を指定する必要があります。
ko: Uvicorn이 설치되면 ASGI 애플리케이션을 실행하는 "uvicorn" 명령을 사용할 수 있다. Uvicorn은 ASGI 애플리케이션 개체가 포함된 모듈의 위치로 호출되어야 하며 그 다음에 애플리케이션 이름이 콜론으로 구분됩니다.

source: For a typical Django project, invoking Uvicorn would look like:
ja: 典型的な Django プロジェクトでは、Uvicorn の起動は次のようになります:

source: In development mode, you can add ``--reload`` to cause the server to reload any time a file is changed on disk.
it: In modalità sviluppo, puoi aggiungere "--reload" per ottenere il riavvio del server ogni volta che un file sul disco viene modificato.
ja: 開発モードでは、 ``--reload`` を追加することで、ディスク上のファイルが変更されるたびにサーバをリロードできます。

source: For more advanced usage, please read the `Uvicorn documentation <Uvicorn_>`_.
it: Per utilizzi più avanzati, leggi la `documentazione di Uvicorn <Uvicorn_>`_.
ja: より高度な使い方は `Uvicorn documentation <Uvicorn_>`_ を参照してください。
ko: 고급 사용법은 Uvicorn document를 읽어주세요.

source: Deploying Django using Uvicorn and Gunicorn
it: Distribuisci Django usando Uvicorn e Gunicorn
ja: UvicornとGunicornを使ってDjangoをデプロイする

source: Gunicorn_ is a robust web server that implements process monitoring and automatic restarts. This can be useful when running Uvicorn in a production environment.
it: Gunicorn p un robusto server web che implementa il monitoraggio del processo ed il riavvio automatico. Questo può essere utile quando scegli di utilizzare Uvicorn in ambiente di produzione.
ja: Gunicorn_ は、プロセス監視と自動再起動を実装した堅牢なウェブサーバーです。本番環境でUvicornを運用する際に役立ちます。

source: To install Uvicorn and Gunicorn, use the following:
ja: UvicornとGunicornをインストールするには、次のコマンドを実行します:

source: Then start Gunicorn using the Uvicorn worker class like this:
ja: Uvicornのworkerクラスを使ってGunicornを起動します:

source: Deployment checklist
it: Lista dei controlli per la distribuzione
ja: デプロイチェックリスト
ko: 배포 전 체크리스트
pt_br: Lista de verificação para distribuição
zh_hans: 部署清单

source: The internet is a hostile environment. Before deploying your Django project, you should take some time to review your settings, with security, performance, and operations in mind.
it: Internet è un ambiente ostile. Prima di distribuire il tuo progetto Django, dovresti prenderti del tempo per revisionare le tue configurazioni, tenendo a mente sicurezza, performance ed gestione operativa.
ja: インターネットは敵対的な環境です。Django プロジェクトをデプロイする前に、セキュリティ、パフォーマンス、運用を念頭に置いて、時間をかけて設定を見直すべきです。

source: Django includes many :doc:`security features </topics/security>`. Some are built-in and always enabled. Others are optional because they aren't always appropriate, or because they're inconvenient for development. For example, forcing HTTPS may not be suitable for all websites, and it's impractical for local development.
it: Django include molte :doc:`caratteristiche di sicurezza </topics/security>`. Alcune sono built-in e sempre abilitate. Altre sono opzionali perchè non sono sempre appropriate o perchè non sono pratiche in fase di sviluppo. Per esempio, forzare HTTPS può non andare bene per tutti i siti ed è molto poco pratico per lo sviluppo locale.
ja: Django には多くの :doc:`セキュリティ機能 </topics/security>` があります。いくつかはビルトインで、常に有効です。その他は任意となっており、これは常に適切とは限らなかったり、開発に対しては不便だったりするためです。たとえば、HTTPS を強制することは、すべてのウェブサイトに対して適切とは言えず、またローカル開発では実践的ではありません。
ko: 장고는 :doc:`보안 기능</topics/security>`\을 많이 갖고 있습니다. 몇몇은 내장된 기능으로 항상 켜져있습니다. 다른 몇몇은 선택할 수 있는데 그 이유는 항상 보안 기능들이 적절하지 않거나 개발에 불편함을 가져올 수 있기 때문입니다. 예를 들어 강제로 HTTPS를 활성화 하는 것은 모든 웹사이트에 적합하지 않을 수도 있고, 로컬 개발환경에선 비실용적일 수도 있습니다.
pt_br: O Django inclui muitos :doc:`security features </topics/security>`. Agumas são embutidas e sempre habilitadas. Outras são opcionais porque nem sempre são apropriadas, ou porque são inconvenientes para desenvolvimento. Por exemplo, forçar HTTPS talvez não seja bom para todos os websites e não prático para desenvolvimento local.
zh_hans: Django 包含了许多 :doc:`安全特性 </topics/security>`。一些是内置的并且总保持激活状态，其他的则是可选的因为它们不总是恰当的，或者因为它们不便于之后的开发。举个例子，强制的 HTTPS 并不一定适合所有网站，它对于本地开发就是不切实际的。

source: Performance optimizations are another category of trade-offs with convenience. For instance, caching is useful in production, less so for local development. Error reporting needs are also widely different.
it: Le ottimizzazioni di performance sono un'altra categoria di tradeoff con la convenienza. Per esempio, il caching è utile in produzione, meno per lo sviluppo locale. Anche l'error reporting deve essere molto differente.
ja: パフォーマンスの最適化は、利便性とのトレードオフとなるもう 1 つの要素です。たとえば、キャッシュは本番環境では役立ちますが、ローカル開発では役立ちません。同様に、エラーレポートの必要性にも大きな違いがあります。
ko: 성능 최적화는 편의를 위한 또다른 범주의 거래입니다. 예를 들어, 캐싱은 상용 환경에서 유용할 수 있지만 로컬 개발 환경에서는 실용적이지 않을 수 있습니다. 오류 보고의 필요성에도 큰 차이가 있습니다.
pt_br: Otimização de desempenho são outra categoria de "perde-ganha" com a conveniência. Por exemplo, "cache" é útil em produção, mas não em desenvolvimento. Necessidades de relatórios de erros também são amplamente diferentes.
zh_hans: 性能优化是另一项便利性权衡的主题。例如，缓存在生成环境很有用，但是对本地开发就作用不大。错误报告的需求也大不相同。

source: The following checklist includes settings that:
it: La seguente lista di controlli include configurazioni come:
ja: 以下のチェックリストは、次の設定項目を含みます:
ko: 설정에 대한 체크리스트는 다음과 같습니다.
pt_br: As seguinte lista de verificação inclui configurações que:
zh_hans: 以下清单包括以下配置：

source: must be set properly for Django to provide the expected level of security;
it: devono essere configurate correttamente in Django affinché forniscano il livello di sicurezza atteso;
ja: Django が想定するレベルのセキュリティを提供するために適切に設定する必要があるもの;
ko: Django에서 예상되는 수준의 보안을 제공하도록 설정해야 합니다.
pt_br: devem ser configuradas propriamente para que o Django fornece o nível esperado de segurança.
zh_hans: 必须正确地设置 Django 以提供预期的安全级别；

source: are expected to be different in each environment;
it: ci si aspetta che siano differenti per ogni ambiente;
ja: 環境によって異なると思われるもの;
ko: 각 환경에 맞도록 설정해야 합니다.
pt_br: espera-se que sejam diferentes em cada ambiente.
zh_hans: 期望在每个环境中都是不同的；

source: enable optional security features;
it: abilita le funzionalità di sicurezza opzionali;
ja: オプションのセキュリティ機能を有効にするもの;
ko: 선택적인 보안 기능들을 활성화시켜야 합니다.
pt_br: habilitam características de segurança opcionais;
zh_hans: 启用可选的安全功能；

source: enable performance optimizations;
it: Abilita le ottimizzazioni per le prestazioni
ja: パフォーマンスの最適化を有効にするもの;
ko: 성능 최적화가 적용돼야 합니다.
pt_br: habilitam otimização de desempenho.
zh_hans: 启用性能优化；

source: provide error reporting.
it: fornisce le segnalazioni dell'errore.
ja: エラーレポートを提供するもの;
ko: 에러 보고가 제공되어야 합니다.
pt_br: fornece relatório de erro.
zh_hans: 提供错误报告功能。

source: Many of these settings are sensitive and should be treated as confidential. If you're releasing the source code for your project, a common practice is to publish suitable settings for development, and to use a private settings module for production.
it: Molte di queste impostazioni sono sensibili e dovrebbero essere trattate come confidenziali. Se stai rilasciando il codice sorgente del tuo progetto, una pratica comune è quella di pubblicare impostazioni adeguate per lo sviluppo ed usare moduli di impostazioni privati per la produzione.
ja: これらの設定の多くは機密性が高く、機密情報として扱うべきです。プロジェクトのソースコードを公開する場合、開発用の適切な設定を公開し、本番用にはプライベートな設定モジュールを使用するのが一般的な慣習です。
ko: 이 설정들 중 대부분은 예민할 수 있고 감추어져야 합니다. 만약 여러분이 프로젝트의 소스코드를 배포한다면, 대부분은 개발 환경에 최적화된 설정으로 배포하고 상용 환경에서 사용할 별도의 설정을 사용할 것입니다.
pt_br: Muitas destas configurações são sensíveis e devem ser tratadas confidencialmente. Se você está publicando o código fonte do seu projeto, uma prática comum é publicar configurações adequadas para desenvolvimento, e usar o módulo de configuração para produção.
zh_hans: 许多配置项是敏感的，需要被当做机密对待。如果要发布项目源码，常见操作是为开发开放合适的配置项，为生产环境配置私密设置模块。

source: Run ``manage.py check --deploy``
it: Lancia ``manage.py check --deploy``
ja: ``manage.py check --deploy`` を実施しよう
ko: ``manage.py check --deploy`` 명령 실행
pt_br: Execute ``manage.py check --deploy``
zh_hans: 运行 ``manage.py check --deploy``

source: Some of the checks described below can be automated using the :option:`check --deploy` option. Be sure to run it against your production settings file as described in the option's documentation.
it: Alcuni dei check descritti qui sotto possono essere automatizzati utilizzando l'opzione :option:`check --deploy`. Assicurati di lanciarla sul file di impostazioni della produzione come descritto nella documentazione delle opzioni.
ja: 以下で説明しているチェックのいくつかは、:option:`check --deploy` オプションを使用して自動化できます。オプションのドキュメントで説明しているとおり、本番環境の設定に対してこのチェックを実施してください。
ko: 문서아래에 설명된 일부 검사는 : 옵션을 사용하여 자동화할 수 있습니다.check --deploy' 옵션을 선택하십시오. 옵션 설명서에 설명된 대로 프로덕션 설정 파일에 대해 실행하십시오.
pt_br: Algumas das verificações descritas abaixo podem ser automatizadas usando a opção :option:`check --deploy`. Assegure-se de executá-lo com o arquivo de configuração como descrito na documentação de configuração.
zh_hans: 下面介绍的某些检查项会自动使用 :option:`check --deploy` 选项。请确保根据选项文档中描述的生产设置文件运行它。

source: Critical settings
it: Configurazioni critiche
ja: 最重要な設定
ko: 중요 설정
pt_br: Configurações críticas.
zh_hans: 关键配置

source: **The secret key must be a large random value and it must be kept secret.**
it: **La chiave segreta deve essere un valore casuale grande e deve essere tenuta segreta.**
ja: **シークレットキーは、長いランダム文字列で、秘匿される必要があります。**
ko: **비밀 키는 큰 임의 값이어야 하며 기밀로 유지되어야 합니다.**
pt_br: **A chave secreta deve ser um valor randômico e longo e deve ser mantido em segredo**
zh_hans: **密码必须是一个较长的随机值，且被妥善保存。**

source: Make sure that the key used in production isn't used anywhere else and avoid committing it to source control. This reduces the number of vectors from which an attacker may acquire the key.
it: Assicurati che la chiave utilizzata in produzione non sia usata da altre parte ed evita di farne un commit verso il software di controllo dei sorgenti. Questo riduce il numero di vettori dai quali un attaccante potrebbe acquisire la chiave.
ja: 本番環境で使われるキーは、他の場所で使われておらず、ソースコントロール中に記述してしまわないよう十分注意してください。これにより、攻撃者がキーを取得してしまう恐れを軽減できます。
ko: 프로덕션에 사용된 키가 다른 곳에서 사용되지 않는지 확인하고 소스 제어에 커밋하지 않도록 하십시오. 이렇게 하면 공격자가 키를 얻을 수 있는 벡터 수가 줄어듭니다.
pt_br: Tenha ceteza que a chave usada em produção não é usada em nenhum outro local e evite "commitar" isso no código fonte. Isso reduz o número de vetores dos quais um atacante possa acessar a chave.
zh_hans: 确保生产环境使用的密码并未用于其它环境，且未被提交至版本控制系统。这将减少攻击者获取密码的概率。

source: Instead of hardcoding the secret key in your settings module, consider loading it from an environment variable::
it: Invece di fare hardcoding della chiave segreta nelle tuo modulo di impostazioni, cosidera di caricarla da una variabile d'ambiente::
ja: 設定モジュールにシークレットキーを直接書き込む代わりに、環境変数から読み込む方法を検討してください::
ko: 설정 모듈의 비밀 키를 하드코딩하는 대신 환경 변수에서 로드하는 것을 고려하십시오.
pt_br: Ao invés de "hardecodear" a chave secreta no módulo de configuração, considere carrega-lo de uma variável de ambiente::
zh_hans: 逾期将安全密码硬编码在配置模块中，不然考虑从环境变量加载它::

source: or from a file::
it: o da un file::
ja: もしくはファイルから読み込みます::
ko: 또는 파일로부터
pt_br: ou de um arquivo::
zh_hans: 或者从一个文件::

source: If rotating secret keys, you may use :setting:`SECRET_KEY_FALLBACKS`::
it: Se stai utilizzando la rotazione delle chiavi per i segreti, puoi usare :setting:`SECRET_KEY_FALLBACKS`::
ja: シークレットキーをローテーションする場合は、 :setting:`SECRET_KEY_FALLBACKS`: が使用できます:

source: Ensure that old secret keys are removed from ``SECRET_KEY_FALLBACKS`` in a timely manner.
it: Assicurati che le vecchie chiavi siano rimosse prontamente da ``SECRET_KEY_FALLBACKS``.
ja: 古いシークレットキーが ``SECRET_KEY_FALLBACKS`` から適時に削除されていることを確認してください。

source: **You must never enable debug in production.**
it: **Non devi mai abilitare la modalità debug in produzione**
ja: **デバッグは、本番環境では決して有効化してはいけません。**
ko: **프로덕션에서 디버그를 사용 가능으로 설정하지 않아야 합니다.**
pt_br: **Nunca habilite o debug em produção**
zh_hans: **永远不要在生产环境打开 debug 开关。**

source: You're certainly developing your project with :setting:`DEBUG = True <DEBUG>`, since this enables handy features like full tracebacks in your browser.
it: Stai certamente sviluppando il tuo progetto con :setting:`DEBUG = True <DEBUG>`, perchè abilita comode feature come i traceback completi nel browser.
ja: プロジェクトの開発中は :setting:`DEBUG = True <DEBUG>` だったはずですが、これはブラウザ内の全トレースバックといった便利な機能を使えるようにするためです。
ko: 다음을 설정하여 프로젝트를 개발하고 있는 것이 확실합니다.브라우저의 전체 추적과 같은 편리한 기능을 제공하므로 'DEBUG = True'입니다.
pt_br: Certamente você desenvolvimento seu projeto com :setting:`DEBUG = True <DEBUG>`, já que isso habilita características convenientes como "tracebakcs" no seu browser.
zh_hans: 开发时，你当然要配置 :setting:`DEBUG = True <DEBUG>`，这将方便你在浏览器启用完全回溯功能。

source: For a production environment, though, this is a really bad idea, because it leaks lots of information about your project: excerpts of your source code, local variables, settings, libraries used, etc.
it: Per un ambiente di produzione, tuttavia, è un'idea davvero cattiva, perchè espone molte informazioni sul progetto: stralci di codice sorgente, variabili locali, impostazioni, librerie utilizzate ecc...
ja: しかし、本番環境に対してはこれはまったく不適切です。なぜなら、プロジェクトに関する多くの情報を公にしてしまうからです: ソースコードからの引用、ローカル変数、設定、使われているライブラリ、等。
ko: 그러나 프로덕션 환경에서는 이 방법이 매우 좋지 않습니다. 프로젝트에 대한 많은 정보(소스 코드, 로컬 변수, 설정, 사용된 라이브러리 등)를 유출하기 때문입니다.
pt_br: Para o ambiente de produção, embora, isso é realmente uma má idéia, porque ele abre uma série de informações sobre seu projeto: dicas de seu código fonte, variáveis locais, configurações, bibliotecas usadas, etc.
zh_hans: 不过，对于生产环境来说，这真是一个坏主意，因为这会泄露很多超出预期的信息：代码摘要，本地变量，配置项，使用的库，等等。

source: Environment-specific settings
it: Configurazione dipendente dall'ambiente
ja: 環境に合わせた設定
ko: 특정한 환경 설정
pt_br: Configurações específicas de configurações
zh_hans: 特定于环境的配置

source: When :setting:`DEBUG = False <DEBUG>`, Django doesn't work at all without a suitable value for :setting:`ALLOWED_HOSTS`.
it: Quando :setting:`DEBUG = False <DEBUG>`, Django non funziona affatto senza un valore adatto di :setting:`ALLOWED_HOSTS`.
ja: :setting:`DEBUG = False <DEBUG>` のとき、:setting:`ALLOWED_HOSTS` が適切に設定されない限り Django は一切動作しません。
ko: :설정:'DEBUG = False', Django는 : 설정에 :setting:`ALLOWED_HOSTS`. 의 적합한 값이 없으면 전혀 작동하지 않습니다
pt_br: Quando :setting:`DEBUG = False <DEBUG>`, o Django não irá funcionar de maneira alguma sem um valor adequado para o :setting:`ALLOWED_HOSTS`.
zh_hans: :setting:`DEBUG = False <DEBUG>` 时，Django 在未正确配置 :setting:`ALLOWED_HOSTS` 时无法工作。

source: This setting is required to protect your site against some CSRF attacks. If you use a wildcard, you must perform your own validation of the ``Host`` HTTP header, or otherwise ensure that you aren't vulnerable to this category of attacks.
it: Questa impostazione è necessaria per proteggere il tuo sito da alcuni attacchi CSRF. Se usi una wildcard, devi fare la tua validazione dell'header HTTP ``Host`` o altrimenti assicurarti di non essere vulnerabile a questa categoria di attacchi.
ja: この設定は、いくつかの CSRF 攻撃からあなたのサイトを保護するために必要です。もしワイルドカードを使用した場合、``Host`` HTTP のバリデーションを自分自身で行う必要があります。さもなければ、この種の攻撃に脆弱なサイトとなってしまいます。
ko: 이 설정은 일부 CSRF 공격으로부터 사이트를 보호하는 데 필요합니다. 와일드카드를 사용할 경우 "Host" HTTP 헤더에 대한 자체 검증을 수행하거나 그렇지 않을 경우 이 공격 범주에 취약하지 않은지 확인해야 합니다.
pt_br: Essa configuração é requerida para proteger seu site de ataques CSRF. Se usar um caracter corínga, você deve fazer sua própria validação do cabeçalho HTTP do ``Host``, ou de outra maneira tenha certeza que você não está vulnerável a esse tipo de ataque.
zh_hans: 该配置避免你的站点遭受某些 CSRF 攻击。如果使用了通配符，你必须实现自定义的 ``Host`` HTTP 头，或者确保你不会很容易地遭受此种攻击。

source: You should also configure the web server that sits in front of Django to validate the host. It should respond with a static error page or ignore requests for incorrect hosts instead of forwarding the request to Django. This way you'll avoid spurious errors in your Django logs (or emails if you have error reporting configured that way). For example, on nginx you might set up a default server to return "444 No Response" on an unrecognized host:
it: Dovresti anche configurare il web server che sta davanti a Django per validare l'host. Dovrebbe rispondere con una pagina di errore statica o ignorare richieste di host sbagliati invece di inoltrare le richieste a Django. In questo modo eviterai errori spuri nei log di Django (o email, se hai l'error reporting configurato in quel modo). Per esempio, su nginx potresti voler impostare un server di default che restituisca "444 No Response" per gli host sconosciuti:
ja: 加えて、Django の手前にいるウェブサーバーにも、ホストを検証するよう設定をする必要があります。これにより、不適切なホストに対して、Django にリクエストを転送する代わりに、エラーページを表示したりリクエストを無視するようにできます。そして、Django のログ内で誤ったエラーが起きる (もしくは設定しだいでは E メールが送信される) のを防ぎます。たとえば、nginx では認識されないホストに対してデフォルトサーバーが "444 No Response" を返します:

source: If you're using a cache, connection parameters may be different in development and in production. Django defaults to per-process :ref:`local-memory caching <local-memory-caching>` which may not be desirable.
it: Se stai usando una cache, i parametri di connessione potrebbero essere differenti tra sviluppo e produzione. Django ha come default il :ref:`local-memory caching <local-memory-caching>` per processo, che può non essere desiderabile.
ja: もしキャッシュを使うなら、開発環境と本番環境とでコネクションパラメータは異なるでしょう。そうでない場合、デフォルトは :ref:`ローカルメモリのキャッシュ <local-memory-caching>` に設定されています。
ko: 캐시를 사용하는 경우 연결 매개 변수는 개발 및 운영에서 다를 수 있습니다. Django의 기본값은 프로세스당:ref:로컬 메모리 캐싱 1은 바람직하지 않을 수 있다.
zh_hans: 若使用了缓存，开发环境的连接参数和生产环境可能不同。Djano 默认为每个进程提供 :ref:`本地内存缓存 <local-memory-caching>`，这可能与期望不同。

source: Cache servers often have weak authentication. Make sure they only accept connections from your application servers.
it: I server di cache spesso hanno una autenticazione debole. Accertati che accettino connessioni solo dai server delle applicazioni.
ja: キャッシュサーバーは認証に弱点を持っています。あなたのアプリケーションからのコネクションだけを受け入れるようにしてください。
ko: 캐시 서버의 인증확인은 약한 경우가 많습니다. 응용프로그램 서버로부터의 연결만 허용하는지 확인합니다.
pt_br: Servidores de "cache" tem em geral uma autenticação fraca. Assegure-se que somente aceite conexões de seus servidores de aplicações.
zh_hans: 缓存服务器一般采用若验证。确保它们只接受来自你的应用服务器的连接。

source: Database connection parameters are probably different in development and in production.
it: I parametri di connessione al database saranno probabilmente differenti tra sviluppo e produzione.
ja: データベースの接続パラメータは、開発環境と本番環境でおそらく異なります。
ko: 데이터베이스 연결 매개 변수는 개발 및 운영에서 서로 다를 수 있습니다.
pt_br: Parâmetros de conexões de bancos de dados são provavelmente diferentes em desenvolvimento e em produção.
zh_hans: 生产环境与开发环境的数据库连接参数可能是不同的。

source: Database passwords are very sensitive. You should protect them exactly like :setting:`SECRET_KEY`.
it: Le password dei database sono molto sensibili. Dovresti proteggere esattamente come :setting:`SECRET_KEY`.
ja: データベースパスワードは非常に機密的なものです。:setting:`SECRET_KEY` と同様の方法で保護してください。
ko: 데이터베이스 암호는 매우 민감합니다. 당신은 :setting:`SECRET_KEY`.을 똑같이 보호해야 한다.
pt_br: Senhas de bancos de dados são muito sensíveis. Você deve protegê-las tal como o :setting:`SECRET_KEY`.
zh_hans: 数据库密码是机密的。你应该像保护 :setting:`SECRET_KEY` 那样保护它们。

source: For maximum security, make sure database servers only accept connections from your application servers.
it: Per la massima sicurezza, verifica che il database accetti connessioni solo dai server applicativi.
ja: セキュリティを最大限に確保するためには、データベースサーバーがアプリケーションサーバーからの接続のみを許可するようにしてください。
ko: 보안을 최대화하려면 데이터베이스 서버가 응용프로그램 서버의 연결만 허용해야 합니다.
pt_br: Para máxima segurança, certifique que os servidores de bancos de dados somente aceitem conexões de seus servidores de aplicação.
zh_hans: 为了最大限度的安全，确保数据库只为来自你应用的连接提供服务。

source: If you haven't set up backups for your database, do it right now!
it: Se non hai configurato i backup per il tuo database, fallo immediatamente!
ja: もしデータベースのバックアップの設定をしていなければ、今すぐに行ってください！
ko: 데이터베이스에 대한 백업을 설정하지 않은 경우 지금 바로 수행하십시오!
pt_br: Se não configurou backup para seu banco de dados, faça isso já!
zh_hans: 如果你还未为数据库设置备份，现在就做！

source: :setting:`EMAIL_BACKEND` and related settings
it: :setting:`EMAIL_BACKEND` ed impostazioni correlate
ja: :setting:`EMAIL_BACKEND` と関連する設定
ko: :설정:`EMAIL_BACKEND` 과 관련된 설정들
pt_br: :setting:`EMAIL_BACKEND` e configurações relacionadas
zh_hans: :setting:`EMAIL_BACKEND` 和关联配置

source: If your site sends emails, these values need to be set correctly.
it: Se il tuo sito invia email, questi valori dovranno essere configurati opportunamente.
ja: あなたのサイトが E メールを送信する場合、設定値が正しくセットされている必要があります。
ko: 사이트에서 전자 메일을 보내는 경우 이 값을 올바르게 설정해야 합니다.
pt_br: Se seu site envia e-mails, estes valores precisam ser definidos corretamente.
zh_hans: 如果你的站点发送邮件，以下值需要被正确地配置。

source: By default, Django sends email from webmaster@localhost and root@localhost. However, some mail providers reject email from these addresses. To use different sender addresses, modify the :setting:`DEFAULT_FROM_EMAIL` and :setting:`SERVER_EMAIL` settings.
it: Di default, Django manda email da webmaster@localhost e root@localhost. Comunque, alcuni provider rigettano le email da questi indirizzi. Per usare un mittente diverso, modifica le impostazioni :setting:`DEFAULT_FROM_EMAIL` e :setting:`SERVER_EMAIL`.
ja: デフォルトでは、Django は webmaster@localhost と root@localhost から E メールを送信します。しかし、いくつかのメールプロバイダはこれらのアドレスを拒否します。異なる送信者アドレスを使用するには、:setting:`DEFAULT_FROM_EMAIL` と :setting:`SERVER_EMAIL` 設定を修正してください。
ko: 기본적으로 Django는 webmaster@localhost 및 root@localhost에서 이메일을 전송합니다. 그러나 일부 메일 공급자는 이러한 주소의 전자 메일을 거부합니다. 다른 발신인 주소를 사용하려면 : 설정을 수정하십시오.'DEFAUT_FROM_EMAIL' 및 :설정:'SERVER_EMail의 설정입니다.
pt_br: Por padrão, o Django envia email de webmaster@localhost e root@localhost. Entretanto, alguns provedores de email rejeitam emails destes endereços. Para usar endereços de envio diferentes, modifique as configurações :setting:`DEFAULT_FROM_EMAIL` e :setting:`SERVER_EMAIL` .
zh_hans: 默认情况下，Django 从 webmaster@localhost 和 root@localhost 发送邮件。然而，某些邮件服务商拒绝来自这些地址的邮件。为了使用不同的发件人地址，修改 :setting:`DEFAULT_FROM_EMAIL` 和 :setting:`SERVER_EMAIL` 配置。

source: :setting:`STATIC_ROOT` and :setting:`STATIC_URL`
ja: :setting:`STATIC_ROOT` と :setting:`STATIC_URL`
ko: :설정:`STATIC_ROOT` 그리고 :설정:`STATIC_URL`
pt_br: :setting:`STATIC_ROOT` e :setting:`STATIC_URL`
zh_hans: :setting:`STATIC_ROOT` 和 :setting:`STATIC_URL`

source: Static files are automatically served by the development server. In production, you must define a :setting:`STATIC_ROOT` directory where :djadmin:`collectstatic` will copy them.
it: I file statici sono automaticamente serviti dal server di sviluppo. In produzione, devi definire una directory :setting:`STATIC_ROOT` dove :djadmin:`collectstatic` li copierà.
ja: 静的ファイルは、開発用サーバーでは自動的に提供されます。本番環境では、:djadmin:`collectstatic` が静的ファイルをコピーする :setting:`STATIC_ROOT` ディレクトリを設定する必要があります。
ko: 정적 파일은 개발 서버에서 자동으로 제공됩니다. 프로덕션에서 :seting:'를 정의해야 합니다.STATIC_ROOT' 디렉토리. 여기서 :djadmin:'collectstatic'은 이들을 복사한다.
pt_br: Arquivos estáticos são automaticamente servidos pelo servidor de desenvolvimento. Em produção, você deve definir o diretório :setting:`STATIC_ROOT` onde o :djadmin:`collectstatic` irá copiá-los.
zh_hans: 静态文件由开发服务器自动托管。但在生产环境，你必须定义配置 :setting:`STATIC_ROOT` ， :djadmin:`collectstatic` 将会拷贝它们。

source: See :doc:`/howto/static-files/index` for more information.
it: Vedi :doc:`/howto/static-files/index` per ulteriori informazioni.
ja: より詳しくは :doc:`/howto/static-files/index` を参照してください。
ko: 더 많은 정보를 원하면 :doc:`/howto/static-files/index` 를 확인하세요
pt_br: Veja :doc:`/howto/static-files/index` para mais informações.
zh_hans: 查看 :doc:`/howto/static-files/index` 获得更多信息。
