Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The most common place to specify custom template tags and filters is inside a Django app. If they relate to an existing app, it makes sense to bundle them there; otherwise, they can be added to a new app. When a Django app is added to :setting:`INSTALLED_APPS`, any tags it defines in the conventional location described below are automatically made available to load within templates.
it: Il posto più comune in cui specificare tag e filtri di template personalizzati è nell'applicazione Django. Se sono collegati ad una app esistente, ha senso metterli lì; altrimento, possono essere aggiunti ad una nuova app. Quando una applicazione Django viene aggiunta ad :setting:`INSTALLED_APPS`, ogni tag che definisce nella locazione convenzionale descritta qui sotto viene automaticamente reso disponibile al caricamento nei template.
ja: 独自のテンプレートタグやフィルタを指定するための最も一般的な場所は、Django のアプリケーションの内部です。それらが既存のアプリに関連するものである場合は、この場所にバンドルするのが最適です。それ以外の場合は、新しいアプリケーションに追加されてしまいます。Django のアプリケーションが :setting:`INSTALLED_APPS` に追加されると、以下に記載された従来の場所に定義したタグは、自動的にテンプレート内に読み込むことが可能になります。
ko: 사용자 정의 템플릿 태그 및 필터를 지정하는 가장 일반적인 장소는 Django 앱 내부입니다. 기존 앱과 관련된 경우 해당 앱에 번들을 추가하는 것이 좋습니다. 그렇지 않으면 새 앱에 추가할 수 있습니다. :seting:'에 Django 앱이 추가되면설치됨_아래에 설명된 기존 위치에서 정의하는 모든 태그는 템플릿 내에서 자동으로 로드됩니다.
pt_br: O lugar mais comum para especificar tags e filtros customizados é dentro de uma app Django. Se eles estão relacionados a uma app existente, faz sentido empacotá-los ali; se não eles podem ser adicionados a uma nova app. Quando uma app Django é adicionada ao :setting:`INSTALLED_APPS`, qualquer tag que estiver definida em um local convencional descrito abaixo ficam automaticamente disponíveis para serem carregadas dentro dos templates.
zh_hans: 定制自定义模板 tags 和 filters 的位置就是 Django 应用内。如果它们关联至某个已存在的应用，在那里将它们打包就很有用；否则，它们能被添加至新应用。当一个 Django 应用被添加至 :setting:`INSTALLED_APPS`，所以其在常规位置（下面介绍）定义的标签都可以在模板中自动加载。

source: The app should contain a ``templatetags`` directory, at the same level as ``models.py``, ``views.py``, etc. If this doesn't already exist, create it - don't forget the ``__init__.py`` file to ensure the directory is treated as a Python package.
it: L'applicazione deve contenere una directory ``templatetags``, allo stesso livello di ``models.py``, ``views.py``, ecc. Se non esiste già, creala - non dimenticare il file ``__init__.py`` per assicurarti che la directory sia trattata come un package Python.
ja: アプリケーションは、"models.py" や "views.py" などと同じレベルに "templatetags" ディレクトリを含むべきです。まだ存在していない場合は、ディレクトリが Python パッケージとして扱われるようにするため、"__init__.py" を忘れないでください。
ko: 이 앱은 ``템플릿 태그" 디렉토리를 ``모델"과 동일한 수준으로 포함해야 한다.파이로, "말하자면"피클 등 만약 이것이 존재하지 않는다면, 그것을 만들어라 - 디렉토리가 파이썬 패키지로 취급되도록 하기 위해 "_init__py" 파일을 잊지 마세요
pt_br: A app deve conter um diretório ``templatetags``, no mesmo nível que o ``models.py`, ``views.py`, etc. Se este ainda não existe, crie - não esqueça o arquivo ``__init__.py`` para ter certeza que o diretório é tratado como um pacote Python.
zh_hans: 该应用应包含一个 ``templatetags`` 目录，与 ``models.py``， ``views.py`` 等同级。若该目录不存在，创建它——不要忘了用 ``__init__.py`` 文件确保目录被视作一个 Python 包。

source: Development server won't automatically restart
it: I server di sviluppo non si riavviano in automatico
ja: 開発用サーバが自動的にリスタートしない場合
ko: 개발 서버는 자동으로 다시 시작되지 않습니다
pt_br: O servidor de desenvolvimento não irá reiniciar automaticamente
zh_hans: 开发服务器并不会自动重启

source: After adding the ``templatetags`` module, you will need to restart your server before you can use the tags or filters in templates.
it: Dopo aver aggiunto il modulo ``templatetags``, avrai bisogno di riavviare il tuo server prima di poter utilizzare i tag o i filtri nei template.
ja: ``templatetags`` モジュールを追加した後、テンプレートでタグやフィルタを使用する前に、サーバーを再起動する必要があります。
ko: "템플릿 태그" 모듈을 추가한 후 서버를 재시작해야 템플릿에 태그 또는 필터를 사용할 수 있습니다.
pt_br: Depois de adicionar o módulo ``templatags``, será preciso reiniciar o servidor antes que seja possível utilizar as tags ou filtros nos tempates.
zh_hans: 添加 ``templatetags`` 模块后，你需要重启服务器，这样才能在模板中使用 tags 和 filters。

source: Your custom tags and filters will live in a module inside the ``templatetags`` directory. The name of the module file is the name you'll use to load the tags later, so be careful to pick a name that won't clash with custom tags and filters in another app.
it: I tuoi tag e filtri personalizzati vivranno in un modulo nella directory ``templatetags``. Il nome del file del modulo è il nome che userai per caricare successivamente i tag, quindi fai attenzione a sceglierne uno che non vada in conflitto con i tag ed i filtri personalizzati di un'altra applicazione.
ja: カスタムタグやフィルタは ``templatetags`` ディレクトリ内のモジュールにあります。モジュールファイルの名前は、あとでタグをロードして使うので、別のアプリでカスタムタグやフィルタと衝突しない名前を選択するように心がけてください。
ko: 사용자 지정 태그와 필터는 ``템플릿 태그" 디렉토리 내의 모듈에 상주하게 된다. 모듈 파일의 이름은 나중에 태그를 로드하는 데 사용할 이름이므로 다른 앱의 사용자 지정 태그 및 필터와 충돌하지 않는 이름을 선택하십시오.
pt_br: As tags e filtros personalizados irão ficar em um módulo dentro do diretório ``templatetags`. O nome do arquivo do módulo é o nome que será usado para carregar as tags mais tarde, então tenha cuidado em escolher um nome que não conflite com tags e filtros customizados de outras apps.
zh_hans: 自定义的 tags 和 filters 会保存在模块名为 ``templatetags`` 的目录内。模块文件的名字即稍候你用来加载 tags 的名字，所以小心不要采用一个可能与其它应用自定义的 tags 和 filters 冲突的名字。

source: For example, if your custom tags/filters are in a file called ``poll_extras.py``, your app layout might look like this:
ja: 例えば、カスタムタグ/フィルタが ``poll_extras.py`` というファイルにある場合、アプリのレイアウトは次のようになります:

source: And in your template you would use the following:
it: E nel tuo template utilizzerai i seguenti:
ja: そして、テンプレートでは次のように使います:
ko: 템플릿에서 다음을 사용합니다.
pt_br: E no seu template você deveria usar o seguinte:
zh_hans: 在模板中你会使用以下代码：

source: The app that contains the custom tags must be in :setting:`INSTALLED_APPS` in order for the :ttag:`{% load %}<load>` tag to work. This is a security feature: It allows you to host Python code for many template libraries on a single host machine without enabling access to all of them for every Django installation.
it: Le app che contengono i tag personalizzati devono trovarsi in :setting:`INSTALLED_APPS` affinchè il tag :ttag:`{% load %}<load>` funzioni. E' una feature di sicurezza: ti rende possibile fare hosting di codice Python per molte librerie di template su una singola macchina host senza abilitare l'accesso a tutte per ogni installazione di Django.
ja: カスタムタグを含むアプリケーションは、:ttag:`{% load %}<load>` タグを機能させるために :setting:`INSTALLED_APPS` 内に記述される必要があります。これは、セキュリティ機能です: 毎回の Django のインストールでこれらへのアクセスを有効化することなく、単一のホストマシン上の多数のテンプレートライブラリに対して Python のコードをホストできるようにします。
ko: 사용자 지정 태그가 포함된 앱은 :seting:'에 있어야 합니다.설치됨_:t 태그의 경우 APPS'는 '{% load %}' 태그가 작동합니다. 보안 기능은 다음과 같습니다. 이를 통해 모든 Django 설치에 대해 모든 템플릿 라이브러리에 대한 액세스를 설정하지 않고 단일 호스트 시스템의 여러 템플릿 라이브러리에 대해 Python 코드를 호스팅할 수 있습니다.
pt_br: A app que contém a tag personalizada deve estar em :setting:`INSTALLED_APPS` para que a tag :ttag:`{% load %}<load>` funcione. Essa é uma característica de segurança: isso permite servir código Python para muitas bibliotecas de template em uma única máquina servidora sem habilitar acesso cada instalação de Django.
zh_hans: 为了使 :ttag:`{% load %}<load>` 标签生效，包含自定义标签的应用必须包含在 :setting:`INSTALLED_APPS` 中。这是个安全特性：它允许你在一个主机上持有多个模板库，而不是让每个 Django 安装都能访问所有的库。

source: There's no limit on how many modules you put in the ``templatetags`` package. Just keep in mind that a :ttag:`{% load %}<load>` statement will load tags/filters for the given Python module name, not the name of the app.
it: Non c'è limite al numero di moduli che puoi aggiungere nel package ``templatetags``. Tieni solo presente che uno statement :ttag:`{% load %}<load>` caricherà tag/filtri per un dato nome di modulo Python, non per il nome dell'app.
ja: ``templatetags`` パッケージに入れられるモジュールの数に制限はありません。ただ、:ttag:`{% load %}<load>` ステートメントは、アプリケーションの名前ではなく、与えられた Python のモジュール名に対してタグ/フィルタをロードすることに注意してください。
ko: "템플릿 태그" 패키지에 얼마나 많은 모듈을 넣었는지는 제한이 없다. :t태그:'{%load %}' 문은 앱 이름이 아닌 지정된 Python 모듈 이름에 대한 태그/필터를 로드한다는 점을 유념하십시오.
pt_br: Não há limites de quantos módulos são colocados dentro do pacote ``templatetags``. Apenas mantenha em mente que um comando :ttag:`{% load %}<load>` irá carregar tags/filters para o nome do módulo Python, e não o nome da app.
zh_hans: 我们并未限制放入 ``templatetags`` 包中的模块数量。只需牢记 :ttag:`{% load %}<load>` 语句会加载名字指定 Python 模块的 tags/filters，而不是应用。

source: To be a valid tag library, the module must contain a module-level variable named ``register`` that is a ``template.Library`` instance, in which all the tags and filters are registered. So, near the top of your module, put the following::
it: Per essere una libreria di tag valida, il modulo deve contenere una variabile module-level chiamata ``register``, che è una instanza di ``template.Library``, nella quale sono registrati tutti i tag ed i filtri. Così, nella parte più alta del tuo modulo, metti quanto segue::
ja: 有効なタグライブラリにするため、モジュールは、``register`` という名前のモジュールレベルの変数を含む必要があります。これは、すべてのタグとフィルタが登録されている ``template.Library`` のインスタンスです。そのため、あなたのモジュールの上部に、次のコードを記述してください::
ko: 유효한 태그 라이브러리가 되려면 모듈 레벨 변수인 ``등록"을 포함해야 한다.모든 태그와 필터가 등록된 라이브러리 인스턴스. 따라서 모듈 상단 근처에 다음을 배치합니다.
pt_br: Para ser uma biblioteca de tags válida, o módulo deve conter uma variável do nível do módulo chamado ``register`` que é uma instância de ``template.Library``, na qual todas as tags e filtros são registrados. Então, próximo ao topo do seu módulo, coloque o seguinte::
zh_hans: 要成为一个可用的 tag 库，模块必须包含一个名为 ``register`` 的模块级变量，它是一个 ``template.Library`` 实例。所有的 tags 和 filters 均在其中注册。所以，在模块的开始，输入以下内容::

source: Alternatively, template tag modules can be registered through the ``'libraries'`` argument to :class:`~django.template.backends.django.DjangoTemplates`. This is useful if you want to use a different label from the template tag module name when loading template tags. It also enables you to register tags without installing an application.
it: Alternativamente, i moduli per i tag di template possono essere registrati attraverso l'argomento ``'libraries'`` in :class:`~django.template.backends.django.DjangoTemplates`. Risulta utile quando vuoi usare una label differente rispetto al nome del modulo di tag di template quando carichi i tag di template. Ti permette anche di registrare tag senza installare una applicazione.
ja: あるいは、テンプレートタグのモジュールは、:class:`~django.template.backends.django.DjangoTemplates` への ``'libraries'`` 引数を通じて登録することもできます。テンプレートタグをロードするときに、テンプレートタグのモジュール名とは異なるラベルを使用したい場合に便利です。また、アプリケーションをインストールせずに、タグを登録できるようになります。
ko: 또는 "라이브러리" 인수를 통해 템플릿 태그 모듈을 :class에 등록할 수 있다.~django.backends.django장고사찰. 이 기능은 템플릿 태그를 로드할 때 템플릿 태그 모듈 이름과 다른 레이블을 사용하려는 경우에 유용합니다. 또한 응용 프로그램을 설치하지 않고도 태그를 등록할 수 있습니다.
pt_br: Um alternativa, é que módulos de tags de template podem ser registradas através do argumento ``'libraries'`` do :class:`~django.template.backends.django.DjangoTemplates`. Isso é útil se você quer um "label" diferente para o módulo da tag de quando carregar os templates. Isso também habilita o registro de tags sem instalar a aplicação.
zh_hans: 或者，模板标签模块能通过 :class:`~django.template.backends.django.DjangoTemplates` 的 ``'libraries'`` 参数注册。这在加载模板名字时，想为模板标签起个别名时很有用。这也让你能在未安装应用的情况下注册标签。

source: Behind the scenes
it: Dietro le quinte
ja: 背景
ko: 배후
pt_br: Por trás das cenas.
zh_hans: 幕后

source: For a ton of examples, read the source code for Django's default filters and tags. They're in :source:`django/template/defaultfilters.py` and :source:`django/template/defaulttags.py`, respectively.
it: Per molti più esempi, leggi il codice sorgente dei filtri di default e dei tag di Django. Si trovano rispettivamente in :source:`django/template/defaultfilters.py` e :source:`django/template/defaulttags.py`.
ja: 豊富な例については、 Django のデフォルトのフィルタとタグのソースコードを読んでください。それぞれ :source:`django/template/defaultfilters.py` と :source:`django/template/defaulttags.py` にあります。

source: For more information on the :ttag:`load` tag, read its documentation.
it: Per avere più informazioni sul tag :ttag:`load`, leggi la sua documentazione.
ja: :ttag:`load` タグの詳細については、ドキュメントを参照してください。
ko: :ttag:'load' 태그에 대한 자세한 내용은 설명서를 참조하십시오.
pt_br: Para maiores informações sobre a tag :ttag:`load` tag, leia sua documentação
zh_hans: 更多关于 :ttag:`load` 标签的信息，阅读本文档。

source: Writing custom template filters
it: Scrivere filtri template personalizzati
ja: 独自のテンプレートフィルタを記述する
ko: 사용자 정의 템플릿 필터 쓰기
pt_br: Escrevendo filtros de templates personalizados
zh_hans: 编写自定义的模板过滤器

source: Custom filters are Python functions that take one or two arguments:
it: I filtri custom sono funzioni Python che prendono uno o due argomenti.
ja: 独自のフィルタは、1つか2つの引数を取るPythonの関数です:
ko: 사용자 정의 필터는 하나 또는 두 개의 인수를 사용하는 Python 함수입니다.

source: The value of the variable (input) -- not necessarily a string.
it: Il valore della variabile (input) - non necessariamente una stringa.
ja: 変数の値 (インプット) -- 文字列とは限りません。
ko: 변수 값(입력) - 반드시 문자열은 아닙니다.
pt_br: O valor da variável (input) -- não necessariamente uma string.
zh_hans: （输入的）变量的值，不一定得是字符串类型

source: The value of the argument -- this can have a default value, or be left out altogether.
it: Il valore dell'argomento - può avere un valore di default o può essere lasciata fuori.
ja: 引数の値 -- デフォルト値を持つことも、完全に省略することもできます。
ko: 인수 값 - 기본값을 사용하거나 완전히 제외할 수 있습니다.
pt_br: O valor do argumento -- este pode ter um valor padrão, ou ser deixado de fora.
zh_hans: 而参数的值，它们可以有一个默认值，或者被排除在外

source: For example, in the filter ``{{ var|foo:"bar" }}``, the filter ``foo`` would be passed the variable ``var`` and the argument ``"bar"``.
it: Per esempio, nel filtro "{{ var|foo:"bar" }}", al filtro foo sarà passata la variabile "var" e l'argomento "bar".
ja: 例えば、フィルタ ``{{ var|foo:"bar" }}`` の中で、フィルタ ``foo`` は変数 ``var`` と引数 ``"bar"`` を渡されます。
ko: 예를 들어 필터 ``{var|foo:"bar}"에서 필터 ``foo"는 변수 "var"와 변수 "bar"라는 주장 "bar"가 전달된다.
pt_br: Por exemplo, no filtro ``{{ var|foo:"bar" }}``, ao filtro ``foo`` seria passada a variável ``var`` e o argumento ``"bar"``.
zh_hans: 举个例子，在过滤器 ``{{ var|foo:"bar" }}`` 中，变量 ``var`` 和参数 ``bar`` 会传递给过滤器 ``foo``。

source: Since the template language doesn't provide exception handling, any exception raised from a template filter will be exposed as a server error. Thus, filter functions should avoid raising exceptions if there is a reasonable fallback value to return. In case of input that represents a clear bug in a template, raising an exception may still be better than silent failure which hides the bug.
it: Dal momento che il linguaggio di template non fornisce la gestione delle eccezioni, ogni eccezione sollevata dal un filtro di template sarà esposta come errore del server. Quindi, le funzioni di filtro dovrebbero evitare di sollevare eccezioni se c'è un valore di fallback ragionevole da restituire. In caso di input che rappresenti un chiaro bug in un template, sollevare una eccezione può ancora essere meglio di un fallimento silente che nasconde il bug.
ja: テンプレート言語は例外処理を提供しないので、テンプレートフィルタから生成された例外はすべてサーバーエラーとして公開されます。したがって、フィルタ関数は、返すべき妥当なフォールバック値がある場合には例外を発生させないようにする必要があります。テンプレートの明確なバグを表すインプットの場合、例外を発生させる方が、バグを隠すサイレントな失敗よりも適切でしょう。
ko: 템플리트 언어는 예외 처리를 제공하지 않으므로, 템플리트 필터에서 발생하는 예외는 서버 오류로 노출됩니다. 따라서 필터 기능은 반환할 적절한 예비 값이 있는 경우 예외를 발생시키지 않아야 한다. 템플릿에서 명확한 버그를 나타내는 입력의 경우 예외를 발생시키는 것이 버그를 숨기는 자동 장애보다 나을 수 있습니다.
pt_br: Uma vez que a linguagem de template não fornece manipulação de exceções, qualquer exceção vinda de um filtro de template será exposta como um erro de servidor. Sendo assim, funções de filtros devem evitar enviar exceções se houver um valor substituto razoável para retornar. No caso de uma entrada que representa claramente um bug em um template, enviar uma exceção talvez ainda seja melhor que uma falha silenciosa a qual esconde o bug.
zh_hans: 因为模板语言不提供异常处理机制，所以任何从模板过滤器中抛出的异常都将被视为服务器异常。因此，如果有一个合理的返回值将要被返回的话，过滤器函数应当避免产生异常。万一模板中出现有明显错误的输入，产生异常也仍然比隐藏这个 bug 要好。

source: Here's an example filter definition::
it: Un esempio della definizione di un filtro
ja: 以下はフィルタ定義の例です::
ko: 다음은 필터 정의 예제입니다.
pt_br: Aqui um exemplo de definição de filtro::
zh_hans: 这是一个过滤器定义的例子::

source: And here's an example of how that filter would be used:
it: E qui un esempio di come il viene usato
ja: そして、以下はフィルタがどのように使われるかの例です:
ko: 다음은 해당 필터를 사용하는 방법의 예입니다.
pt_br: E aqui um exemplo de como aquele filtro poderia ser usado:
zh_hans: 这个例子展示了如何使用这个过滤器：

source: Most filters don't take arguments. In this case, leave the argument out of your function::
it: Moltri filtri non prendono argomenti. In questo caso, lascia l'argomento fuori dalla tua funzione::
ja: ほとんどのフィルタは引数を取りません。この場合、次のように関数の第2引数を省略してください:
ko: 대부분의 필터는 인수를 사용하지 않습니다. 이 경우 인수는 함수에서 제외합니다.

source: Registering custom filters
it: Registrazione di filtri personalizzati
ja: 独自のフィルタを登録する
ko: 사용자 정의 필터 등록
pt_br: Registrando filtros customizados
zh_hans: 注册自定义过滤器

source: Once you've written your filter definition, you need to register it with your ``Library`` instance, to make it available to Django's template language::
it: Dopo aver scritto la definizione del filtro, bisogna registrarlo con l'istanza di "Library" al fine di renderlo disponibile per l'uso nel linguaggio dei template di Django.
ja: フィルタ定義を書き終わったら、Django のテンプレート言語で使用できるようにするため、``Library`` のインスタンスに登録する必要があります。
ko: 일단 필터 정의를 작성했으면 "라이브러리" 인스턴스에 등록해야 django의 템플릿 언어로 사용할 수 있습니다.
pt_br: Uma vez que tenha escrito sua definição do filtro, é preciso registrá-lo com sua instância de ``Library``, para fazer com que esteja disponível para a linguagem de template do Django.
zh_hans: 每当你写好你的过滤器定义的时候，你需要用你的 ``Library`` 实例去注册它，从而让它对于 Django 模板语言而言是可用的

source: The ``Library.filter()`` method takes two arguments:
it: Il metodo "Library.filter()" prende due argomenti:
ja: ``Library.filter()`` メソッドは 2 つの引数を取ります:
ko: ``Library.filter()`` 메소드는 두 개의 인수를 사용합니다.
pt_br: O Método ``Library.filter()`` recebe dois argumentos:
zh_hans: ``Library.filter()`` 方法有两个参数：

source: The name of the filter -- a string.
it: Il nome del filtro -- una stringa
ja: フィルタの名前 -- 文字列です。
ko: 필터의 이름 - 문자열.
pt_br: O nome do filtro -- uma string.
zh_hans: 过滤器的名称——字符串。

source: The compilation function -- a Python function (not the name of the function as a string).
it: La funzione di compilazione --una funzione Python (non il nome di funzione come stringa).
ja: 編集用の関数 -- Python の関数です (文字列としての関数名ではありません)。
ko: 컴파일 함수 --파이썬 함수( 문자열로 함수 이름이 아님)입니다.
pt_br: A função de compilação -- uma função Python (não o nome da função como uma string)
zh_hans: 编辑函数——一个 Python 函数（不是函数名的字符串）。

source: You can use ``register.filter()`` as a decorator instead::
it: In alternativa puoi usare ``register.filter()`` come decorator ::
ja: 代わりに ``register.filter()`` をデコレータとして使用できます。
ko: ``register.filter()``를 장식자 대신으로 사용할 수 있습니다.
pt_br: Você pode, ao invés, usar ``register.filter()`` como um decorador::
zh_hans: 你也能以装饰器的模式使用 ``register.filter()``::

source: If you leave off the ``name`` argument, as in the second example above, Django will use the function's name as the filter name.
it: Se lasci fuori l'argomento ``name``, come nell'esempio sopra, Django userà il nome della funzione come nome di filtro.
ja: ``name`` 引数を省略した場合、上記の 2 番目の例と同じように、Django はフィルタ名として関数の名前を利用します。
ko: 위의 두 번째 예에서와 같이 "name" 인수를 생략하면 Django는 함수 이름을 필터 이름으로 사용합니다.
pt_br: Se deixar de passar o argumento ``name``, como no segundo exemplo acima, o Django irá usar o nome da função como nome do filtro.
zh_hans: 若你不填 ``name`` 参数，像第二个例子展示的一样，Django 会将函数名当做过滤器名。

source: Finally, ``register.filter()`` also accepts three keyword arguments, ``is_safe``, ``needs_autoescape``, and ``expects_localtime``. These arguments are described in :ref:`filters and auto-escaping <filters-auto-escaping>` and :ref:`filters and time zones <filters-timezones>` below.
it: Infine, ``register.filter()`` accetta anche tre argomenti keyword, ``is_safe``, ``needs_autoescape`` e ``expects_localtime``. Questi argomenti sono descritti in :ref:`filtri ed auto-escaping <filters-auto-escaping>` e :ref:`filtri e time zones <filters-timezones>` qui sotto.
ja: 最後に、``register.filter()`` は 3 つのキーワード引数 (``is_safe``、``needs_autoescape``、 ``expects_localtime``) を受け入れます。これらの引数は、後述の :ref:`フィルタと自動エスケープ <filters-auto-escaping>` と :ref:`フィルタとタイムゾーン <filters-timezones>` の中で説明されています。
ko: 마지막으로 ``등록하십시오.필터'도 ``is_safe", ``autoescape", "local time"의 세 가지 키워드 주장을 수용한다. 이러한 인수는 아래 ref:'필터 및 자동 이스케이프' 및:ref:'필터 및 시간대'에 설명되어 있습니다.
pt_br: Finalmente, ``register.filter()`` também aceita três argumentos nomeados, ``is_safe``, ``needs_autoescape``, e ``expects_localtime``. Estes argumentos são descrito em :ref:`filters and auto-escaping <filters-auto-escaping>` e :ref:`filters and time zones <filters-timezones>` abaixo.
zh_hans: 最后， ``register.filter()`` 也接受 3 个关键字参数， ``is_sage``， ``needs_autoescape``，和 ``expects_localtime``。这些参数在下面的 :ref:`过滤器和自动转义 <filters-auto-escaping>` 和 :ref:`过滤器和时区 <filters-timezones>` 介绍。

source: Template filters that expect strings
it: Template filtri che si aspettano delle stringhe
ja: 文字列を要するテンプレートフィルタ
ko: 문자열이 필요한 템플릿 필터
pt_br: Filtros de templates que recebem strings
zh_hans: 模板过滤器期望字符串

source: If you're writing a template filter that only expects a string as the first argument, you should use the decorator ``stringfilter``. This will convert an object to its string value before being passed to your function::
it: Se stai scrivendo un filtro di template che si aspetta solo una stringa come primo argomento, dovresti utilizzare il decoratore ``stringfilter``. Questo convertirà un oggetto al suo valore stringa prima di passarlo alla tua funzione::
ja: 第 1 引数として文字数を要求するだけのテンプレートフィルタを記述している場合、デコレータ ``stringfilter`` を使う必要があります。これは、関数に渡される前にオブジェクトを文字列に変換します。
ko: 첫 번째 인수로 문자열만 예상하는 템플릿 필터를 작성하려면 장식기 ``스트링 필터"를 사용해야 한다. 이렇게 하면 기능이 전달되기 전에 개체가 문자열 값으로 변환됩니다.
pt_br: Se você está escrevendo um filtro de template que somente aceita uma string como primeiro argumento, deveria usar o decorador ``stringfilter``. Isso irá converter um objeto para seu valor string antes de ser passado pela sua função::
zh_hans: 如果编写只接收一个字符串作为第一个参数的模板过滤器，你需要使用 ``stringfilter`` 的装饰器。它会将参数前转为字符串后传递给函数::

source: This way, you'll be able to pass, say, an integer to this filter, and it won't cause an ``AttributeError`` (because integers don't have ``lower()`` methods).
it: In questo modo, sarà in grado di passare, diciamo, un intero a questo filtro e non causerà un ``AttributeError`` (perchè gli integer non hanno metodi ``lower()``)
ja: これにより、このフィルタに整数を渡したとしても ``AttributeError`` は発生しません。(整数は ``lower()`` メソッドを持ちませんが。)
ko: 이렇게 하면 정수 같은 것을 필터에 전달할 수 있고 정수에는 "속성 오류"가 발생하지 않습니다(정수에는 "낮은()" 방법이 없기 때문입니다.
pt_br: Desta maneira, você será capaz de passar, vamos dizer, um inteiro para este filtro, e isso não irá causar um ``AttributeError`` (porque inteiros não possuem os métodos ``lower()``).
zh_hans: 这样，您就可以将一个整数传递给这个过滤器，而不会导致 ``AttributeError`` (因为整数没有 ``lower()`` 方法)。

source: Filters and auto-escaping
it: Filtri e auto escaping
ja: フィルタと自動エスケープ
ko: 필터 및 자동 이스케이프
pt_br: Filtros e auto-escaping
zh_hans: 过滤器和自动转义

source: When writing a custom filter, give some thought to how the filter will interact with Django's auto-escaping behavior. Note that two types of strings can be passed around inside the template code:
it: Scrivendo un filtro personalizzato, pensa a come il filtro interagirà con i comportamenti di auto-escaping di Django. Nota che nel codice di template possono essere passati due tipi di stringhe:
ja: 独自のフィルタを作成する場合、フィルタがDjangoの自動エスケープの挙動とどのように関連するか考慮してください。2種類の文字列がテンプレートコードに渡されることに留意してください:
ko: 사용자 정의 필터를 작성할 때 필터가 Django의 자동 이스케이핑 동작과 어떻게 상호 작용하는지 생각해 보십시오. 템플릿 코드 내에서 두 가지 유형의 문자열을 전달할 수 있습니다.
zh_hans: 编写自定义过滤器时，考虑一下过滤器将如何与 Django 的自动转义行为交互。
