Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The ``RemoteUserMiddleware`` authentication middleware assumes that the HTTP request header ``REMOTE_USER`` is present with all authenticated requests. That might be expected and practical when Basic HTTP Auth with ``htpasswd`` or other simple mechanisms are used, but with Negotiate (GSSAPI/Kerberos) or other resource intensive authentication methods, the authentication in the front-end HTTP server is usually only set up for one or a few login URLs, and after successful authentication, the application is supposed to maintain the authenticated session itself.
pt_br: O middleware de autenticação ``RemoteUserMiddleware`` assume que o cabeçalho ``REMOTE_USER`` da requisição HTTP está presente em todas as requisições autenticadas. Isso é esperado e até prático quando usado em uma autenticação HTTP básica com ``htpasswd`` ou um outro mecanismo simples, más com uma requisição Negotiate (GSSAPI/Kerberos) ou outro método de autenticação de fontes intensivas, a autenticação no servidor HTTP de front-end é comumente configurada para uma ou algumas poucas URLS de login, e depois de uma autenticação bem sucedida, é esperado que a aplicação mantenha a sessão de autenticação por conta própria.
zh_hans: ``RemoteUserMiddleware`` 验证中间件假定所有已验证的请求都包含 ``REMOTE_USER`` 头部。这可能对于使用 ``htpasswd`` 或其他简单机制的基础 HTTP 验证方式是很自然的，然而对于协商验证（GSSAP/Kerberos）或其他资源密集的验证方式来说，前端 HTTP 服务器的验证通常只在几个登录的 URL 上存在，在验证成功之后，应用需要自己维护已验证的会话。

source: Writing a custom storage system
pt_br: Escrevendo um sistema de armazenamento custumizado
zh_hans: 编写一个自定义存储系统

source: By default, the following methods raise `NotImplementedError` and will typically have to be overridden:
pt_br: Por padrão, os seguintes métodos geram `NotImplementedError` e normalmente tem que ser sobrescritos.
zh_hans: 通常，下面的方法会引发一个 `NotImplementedError`，并通常必须被重写。

source: By way of example, if listing the contents of certain storage backends turns out to be expensive, you might decide not to implement `Storage.listdir`.
pt_br: A título de exemplo, se listar o conteúdo de certas infraestruturas de armazenamento acaba por ser caro, você pode decidir não aplicar o `Storage.listdir`.
zh_hans: 举例来说，如果列出某些存储后端的内容会比较消耗性能，那么您可以决定不实现 `Storage.listdir` 方法。

source: In older versions, this method was not called when ``upload_to`` was a callable.
pt_br: Em versões antigas, este método não foi chamado quando `` upload_to`` era executado.

source: If a file with ``name`` already exists, an underscore plus a random 7 character alphanumeric string is appended to the filename before the extension.
pt_br: Se um ``name`` de um arquivo já existe, um "underscore" mais uma seqüência alfanumérica 7 caracteres aleatórios é anexado ao nome do arquivo antes da extensão.
zh_hans: 如果已经存在一个 ``name`` 的文件，则会在扩展后缀前添加下划线和 7 位随机字母。

source: The ``max_length`` argument was added.
pt_br: O argumento ``max_length`` foi adicionado.

source: Custom Lookups
pt_br: Pesquisas personalizadas
zh_hans: 自定义查询器

source: A simple lookup example
pt_br: Um simples exemple de pesquisa
zh_hans: 一个简单的查询器示例

source: Let's start with a simple custom lookup. We will write a custom lookup ``ne`` which works opposite to ``exact``. ``Author.objects.filter(name__ne='Jack')`` will translate to the SQL::
pt_br: Vamos iniciar com uma simples pesquisa personalizada. Escreveremos uma simples pesquisa ``ne`` que funciona em frente ao ``exato``. ``Author.objects.filter(name__ne='Jack') traduzindo para SQL.
zh_hans: 让我们从一个典型的自定义查询器开始。我们编写一个自定义查询器 ``ne``，它与 ``exact`` 相反。``Author.objects.filter(name__ne='Jack')`` 将会转换成 SQL::

source: There are two steps to making this work. Firstly we need to implement the lookup, then we need to tell Django about it. The implementation is quite straightforward::
pt_br: Há duas etapas para fazer este trabalho. Em primeiro lugar precisamos implementar a "lookup", então precisamos dizer ao Django sobre ele. A implementação é bastante simples ::
zh_hans: 完成此工作需要两个步骤。第一首先我们需要实现查询器，第二我们需要将它告知 Django。 查询器的实现非常简单::

source: To register the ``NotEqual`` lookup we will just need to call ``register_lookup`` on the field class we want the lookup to be available. In this case, the lookup makes sense on all ``Field`` subclasses, so we register it with ``Field`` directly::
pt_br: Para registrar a lookup ``NotEqual`` precisamos somente chamar ``register_lookup`` no campo da classe que queremos que a lookup esteja disponível. Neste caso, a lookup faz sentido em todos os ``Field`` da sub-classe, então registramos isso com `` Field`` diretamente ::
zh_hans: 要注册 ``NotEqual`` 查询器，我们只需在对应字段类上调用 ``register_lookup`` 方法。 在这种情况下，查询器对所有 ``Field`` 子类都生效，所以我们直接用 ``Field`` 注册它::

source: The ability to use the decorator pattern was added.
pt_br: foi adicionado a capacidade de usar o pattern decorator.

source: We then need to define the ``as_sql`` method. This takes a ``SQLCompiler`` object, called ``compiler``, and the active database connection. ``SQLCompiler`` objects are not documented, but the only thing we need to know about them is that they have a ``compile()`` method which returns a tuple containing a SQL string, and the parameters to be interpolated into that string. In most cases, you don't need to use it directly and can pass it on to ``process_lhs()`` and ``process_rhs()``.
pt_br: Precisamos então definir o método `as_sql``. Isso requer um objeto ``SQLCompiler``, chamado `` compiler``, e a conexão do banco de dados ativo. Objetos ``SQLCompiler`` não são documentados, mas a única coisa que precisamos saber sobre eles é que eles têm um método ``compile()`` que retorna uma tupla contendo uma string SQL, e os parâmetros a serem interpolados dentro da string. Na maioria dos casos, você não precisará usá-lo diretamente e pode passá-lo para ``process_lhs() `` e `` process_rhs()``.

source: Finally we combine the parts into a SQL expression with ``<>``, and supply all the parameters for the query. We then return a tuple containing the generated SQL string and the parameters.
pt_br: Finalmente combinamos as peças em uma expressão SQL com ``<>``, e fornecemos todos os parâmetros para a consulta. Em seguida retornamos uma tupla contendo a string SQL gerada e os parâmetros.

source: A simple transformer example
pt_br: Um exemplo simples transformador
zh_hans: 一个简单的转换器示例

source: We will start by writing a ``AbsoluteValue`` transformer. This will use the SQL function ``ABS()`` to transform the value before comparison::
pt_br: Vamos começar por escrever um tradutor ``AbsoluteValue``. Isto irá usar a função SQL ``ABS ()`` para transformar o valor antes da comparação::

source: We can now run the queries we had before. ``Experiment.objects.filter(change__abs=27)`` will generate the following SQL::
pt_br: agora podemos executar as queries que tínhamos antes. ``Experiment.objects.filter (change__abs = 27) `` irá gerar o seguinte SQL ::
zh_hans: 我们现在可以运行之前的查询。``Experiment.objects.filter(change__abs=27)`` 将生成以下 SQL::

source: By using ``Transform`` instead of ``Lookup`` it means we are able to chain further lookups afterwards. So ``Experiment.objects.filter(change__abs__lt=27)`` will generate the following SQL::
pt_br: Ao usar `` Transform`` ao invés de ``Lookup`` isso significa que somos capazes de encadear lookups umas as outras. Então ``Experiment.objects.filter (change__abs__lt = 27)`` irá gerar o seguinte SQL ::
zh_hans: 通过使用 ``Transform`` 而不是 ``Lookup``，这意味着我们可以在之后链接进一步的查找。 所以 ``Experiment.objects.filter(change__abs__lt=27)`` 将生成以下 SQL ::

source: So we would like ``Experiment.objects.filter(change__abs__lt=27)`` to generate the following SQL::
pt_br: Então nós gostaríamos ``Experiment.objects.filter (change__abs__lt=27)`` para gerar o seguinte SQL::
zh_hans: 因此, 我们希望 ``Experiment.objects.filter(change__abs__lt=27)`` 能生成以下 SQL::

source: Let's examine the simple example of case-insensitive transformation here. This transformation isn't very useful in practice as Django already comes with a bunch of built-in case-insensitive lookups, but it will be a nice demonstration of bilateral transformations in a database-agnostic way.
pt_br: Vamos examinar o exemplo simples de transformação case-insensitive aqui. Essa transformação não é muito útil na prática, como Django já vem com um monte de pesquisas de maiúsculas e minúsculas embutidos, mas será uma boa demonstração de transformações bilaterais de uma forma agnóstica ao banco de dados.
zh_hans: 让我们在此测试这个简单的大小写转换器。这个转换器实际上不是非常实用，因为 Django 早已内置了一堆大小写敏感查询器，但它很好的以一种与数据库无关的方式演示了双向转换。

source: Now, the queryset ``Author.objects.filter(name__upper="doe")`` will generate a case insensitive query like this::
pt_br: Agora, o queryset ``Author.objects.filter(name__upper = "doe")`` irá gerar uma query case-insensitive como esta::
zh_hans: 现在，这个查询集 ``Author.objects.filter(name__upper="doe")`` 会生成一个像这样的不区分大小写的查询::

source: We can change the behavior on a specific backend by creating a subclass of ``NotEqual`` with a ``as_mysql`` method::
pt_br: Nós podemos mudar o comportamento em um backend específico, criando uma subclasse de ``NotEqual`` com um método ``as_mysql`` ::

source: Writing custom ``django-admin`` commands
pt_br: Escrevendo comandos do ``Django Admin`` personalizados
zh_hans: 编写自定义 ``django-admin`` 命令

source: To do this, just add a ``management/commands`` directory to the application. Django will register a ``manage.py`` command for each Python module in that directory whose name doesn't begin with an underscore. For example::
pt_br: Pra tal, adicione um diretório ``management/commands`` a sua aplicação. O Django irá registrar um comando ``manage.py`` para cada módulo Python dentro deste diretório, cujo o nome não inicie com underscore. Por exemplo::
zh_hans: 为达此目的，只需为应用添加一个 ``management/commands`` 目录。Django 会为每个名字不以下划线开头的 Python 模块注册一个 ``manage.py`` 命令。比如::

source: On Python 2, be sure to include ``__init__.py`` files in both the ``management`` and ``management/commands`` directories as done above or your command will not be detected.
pt_br: Em Python 2, tenha certeza de incluir arquivo ``__init__.py`` em ambos os diretórios ``management`` e ``management/commands`` como feito acima ou seus comandos não serão detectados.

source: Before Django 1.8, management commands were based on the :py:mod:`optparse` module, and positional arguments were passed in ``*args`` while optional arguments were passed in ``**options``. Now that management commands use :py:mod:`argparse` for argument parsing, all arguments are passed in ``**options`` by default, unless you name your positional arguments to ``args`` (compatibility mode). You are encouraged to exclusively use ``**options`` for new commands.
pt_br: Antes de Django 1.8, comandos de gerenciamento foram baseados no módulo :py:mod:`optparse` e ​​argumentos posicionais eram passados ​​em ``*args`` enquanto argumentos opcionais eram passados ​​em ``**options``. Agora que os comandos de gerenciamento usam :py:mod:`argparse` para fazer o parser dos argumentos, todos os argumentos são passados ​​em ``**options`` por padrão, a menos que argumentos posicionais sejam nomeados para ``args`` (modo de compatibilidade). Encorajamos a usar exclusivamente ``**options`` para novos comandos.

source: The new custom command can be called using ``python manage.py closepoll <poll_id>``.
pt_br: O novo comando personalizado pode ser chamado usando ``python manage.py closepoll <poll_id>``.

source: The ``handle()`` method takes one or more ``poll_ids`` and sets ``poll.opened`` to ``False`` for each one. If the user referenced any nonexistent polls, a :exc:`CommandError` is raised. The ``poll.opened`` attribute does not exist in the :doc:`tutorial</intro/tutorial01>` and was added to ``polls.models.Poll`` for this example.
pt_br: O método ``handle()`` recebe um ou mais ``poll_ids`` e define ``poll.opened`` como ``False`` para cada um. Se o usuário referenciar um "poll" não existente, um :exc:`CommandError` é levantada. O atributo ``poll.opened`` não existe no :doc:`tutorial </intro/tutorial01>` e foi adicionado a ``polls.models.Poll`` para este exemplo.

source: Previously, only the standard :py:mod:`optparse` library was supported and you would have to extend the command ``option_list`` variable with ``optparse.make_option()``.
pt_br: Anteriormente, somente a biblioteca padrão :py:mod:`optparse` era aceita e era necessário "extender" a variável do comando ``option_list`` com` `optparse.make_option()``.

source: By default, the :meth:`BaseCommand.execute` method deactivates translations because some commands shipped with Django perform several tasks (for example, user-facing content rendering and database population) that require a project-neutral string language.
pt_br: Por padrão, o método :meth:`BaseCommand.execute` desativa traduções porque alguns comandos internos do Django executam várias tarefas (por exemplo, renderização de conteúdo voltado ao usuário e popular o banco de dados) que exigem uma língua neutra no projeto.

source: In previous versions, Django forced the "en-us" locale instead of deactivating translations.
pt_br: Nas versões anteriores, o Django forçou a localização para "en-us" ao invés de desativar traduções.

source: If, for some reason, your custom management command needs to use a fixed locale, you should manually activate and deactivate it in your :meth:`~BaseCommand.handle` method using the functions provided by the I18N support code::
pt_br: Se por algum motivo, o seu comando personalizado de gerenciamento precisar usar um local fixo, é necessário que o suporte a "locale" seja ativar e desativado manualmente no método :meth:`~BaseCommand.handle` usando as funções fornecidas pelo código de apoio I18N::

source: Another need might be that your command simply should use the locale set in settings and Django should be kept from deactivating it. You can achieve it by using the :data:`BaseCommand.leave_locale_alone` option.
pt_br: Outra necessidade pode ser que o seu comando simplesmente deva utilizar a definição de "locale" definido no "settings" e o Django deve ser mantido sem desativá-lo. Você pode fazer isso usando a opção :data:`BaseCommand.leave_locale_alone`.

source: When working on the scenarios described above though, take into account that system management commands typically have to be very careful about running in non-uniform locales, so you might need to:
pt_br: Ao trabalhar nos cenários descritos acima, porém, considere que comandos de gerenciamento de sistemas em tipicamente que ser muito cuidadosos sobre o funcionamento em locais não-uniformes, de modo que você pode precisar:

source: Make sure the :setting:`USE_I18N` setting is always ``True`` when running the command (this is a good example of the potential problems stemming from a dynamic runtime environment that Django commands avoid offhand by deactivating translations).
pt_br: Verifique se o :setting:`USE_I18N` é sempre ``True`` ao executar o comando (este é um bom exemplo dos potenciais problemas decorrentes de um ambiente de execução dinâmico que comandos do Django evitam desativando traduções).

source: Review the code of your command and the code it calls for behavioral differences when locales are changed and evaluate its impact on predictable behavior of your command.
pt_br: Rever o código do seu comando e o código que este chama para diferenças de comportamento quando os locais são alteradas e avaliar o seu impacto sobre o comportamento previsível de seu comando.

source: A string listing the arguments accepted by the command, suitable for use in help messages; e.g., a command which takes a list of application names might set this to '<app_label app_label ...>'.
pt_br: A string que lista os argumentos aceitos pelo comando, adequado para o uso em mensagens de ajuda; ex., um comando que tem uma lista de nomes de aplicativos pode definir isso como '<app_label app_label ...>'.

source: This should be done now in the :meth:`~BaseCommand.add_arguments()` method, by calling the ``parser.add_argument()`` method. See the ``closepoll`` example above.
pt_br: Isto deve ser feito agora no método :meth:`~BaseCommand.add_arguments()`, chamando o método ``parser.add_argument()``. Veja o exemplo ``closepoll`` acima.

source: A boolean indicating whether the command needs to be able to import Django settings; if ``True``, ``execute()`` will verify that this is possible before proceeding. Default value is ``True``.
pt_br: Um booleano que indica se o comando precisa ser capaz de importar configurações do Django; Se ``True``, ``execute()`` irá verificar se isso é possível antes de prosseguir. O valor padrão é ``True``.

source: This is the list of ``optparse`` options which will be fed into the command's ``OptionParser`` for parsing arguments.
pt_br: Esta é a lista de opções do ``optparse`` que serão alimentados no comando do ``OptionParser`` para análise.

source: You should now override the :meth:`~BaseCommand.add_arguments` method to add custom arguments accepted by your command. See :ref:`the example above <custom-commands-options>`.
pt_br: Deve-se agora sobrescrever o método :meth:`~BaseCommand.add_arguments` para adicionar os argumentos personalizados aceitos pelo seu comando. Veja :ref:`o exemplo acima <customcommands-options>`.

source: A boolean; if ``True``, the entire Django project will be checked for potential problems prior to executing the command. Default value is ``True``.
pt_br: Um booleano; Se ``True``, todo o projeto Django será verificado sobre potenciais problemas antes de executar o comando. O valor padrão é ``True``.
zh_hans: 一个布尔值；若为 ``True``，会在执行命令前完整地检验 Django 项目，确定是否有潜在的问题。默认值为 ``True``。

source: A boolean indicating whether the locale set in settings should be preserved during the execution of the command instead of being forcibly set to 'en-us'.
pt_br: Um booleano que indica se o local definido nas configurações devem se preservado durante a execução do comando em vez de ser forçosamente definido como 'en-us'.

source: Default value is ``False``.
pt_br: O valor padrão é ``False``.

source: Make sure you know what you are doing if you decide to change the value of this option in your custom command if it creates database content that is locale-sensitive and such content shouldn't contain any translations (like it happens e.g. with django.contrib.auth permissions) as making the locale differ from the de facto default 'en-us' might cause unintended effects. Seethe `Management commands and locales`_ section above for further details.
pt_br: Verifique se sabe o que você está fazendo se decidir mudar o valor dessa opção em seu comando personalizado se ele cria conteúdo de banco de dados que é sensível ao local e tal conteúdo não deve conter quaisquer traduções (como acontece por exemplo com permissões em django.contrib.auth) fazendo com que o o local diferente do padrão de fato 'en-us' pode causar efeitos indesejados. Veja a seção `comandos de gestão e locales`_ acima para mais detalhes.

source: This option can't be ``False`` when the :data:`~BaseCommand.can_import_settings` option is set to ``False`` too because attempting to set the locale needs access to settings. This condition will generate a :exc:`CommandError`.
pt_br: Esta opção não pode ser ``False`` quando a opção :data:`~BaseCommand.can_import_settings` está definido como ``False`` também porque a tentativa de definir a localidade precisa de acesso às configurações. Esta condição irá gerar um :exc:`CommandError`.

source: It may return a Unicode string which will be printed to ``stdout`` (wrapped by ``BEGIN;`` and ``COMMIT;`` if :attr:`output_transaction` is ``True``).
pt_br: Ele pode retornar uma string Unicode que será impresso para ``stdout`` (envolvido por ``BEGIN;`` e `` COMMIT; `` se :attr:`output_transaction` for ``True``).

source: Use :class:`BaseCommand` instead, which takes no arguments by default.
pt_br: Use :class:`BaseCommand` no lugar, que por padrão não tem argumentos.

source: A command which takes no arguments on the command line.
pt_br: Um comando que não recebe argumentos da linha de comando

source: Rather than implementing :meth:`~BaseCommand.handle`, subclasses must implement :meth:`~NoArgsCommand.handle_noargs`; :meth:`~BaseCommand.handle` itself is overridden to ensure no arguments are passed to the command.
pt_br: Ao invés de implementar o :meth:`~BaseCommand.handle`, subclasses devem implementar :meth:`~NoArgsCommand.handle_noargs`; :meth:`~BaseCommand.handle` que será sobrescrito para ter certeza que nenhum argumento foi passado do comando

source: Perform this command's actions
pt_br: Executar ações deste comando

source: If this exception is raised during the execution of a management command from a command line console, it will be caught and turned into a nicely-printed error message to the appropriate output stream (i.e., stderr); as a result, raising this exception (with a sensible description of the error) is the preferred way to indicate that something has gone wrong in the execution of a command.
pt_br: Se esta exceção é gerada durante a execução de um comando de gerenciamento chamado do console da linha de comando, ele será capturado e transformado em uma mensagem de erro devidamente impresso para a saída apropriada (isto é, stderr); como resultado, gerar essa exceção (com uma descrição sensata do erro) é a maneira preferida para indicar que algo deu errado na execução de um comando.
zh_hans: 如果异常是在命令行控制台运行管理命令时抛出的，它会被捕获，并转换为打印友好的错误信息，输出至合适的流（例如 stderr）;作为结果，抛出异常（包含清晰的错误介绍）是一个不错的说明运行命令过程中出错的方式。

source: Writing custom model fields
pt_br: Escrevendo campos personalizados de modelos.
zh_hans: 编写自定义模型字段(model fields)

source: This is just an ordinary Python class, with nothing Django-specific about it. We'd like to be able to do things like this in our models (we assume the ``hand`` attribute on the model is an instance of ``Hand``)::
pt_br: Esta é somente uma classe Python comum, não tem nada específico do Django. Gostaríamos de ser capazes de fazer coisas como essa no nosso modelo (assumimos que o atributo ``hand`` do modelo é uma instância de ``Hand``)::
zh_hans: 这仅是个普通的 Python 类，不添加任何 Django 指定的内容。我们对模型做这样的事（我们假定模型 ``hand`` 属性的值为 ``Hand`` 的实例）::

source: The simplest way to think of a model field is that it provides a way to take a normal Python object -- string, boolean, ``datetime``, or something more complex like ``Hand`` -- and convert it to and from a format that is useful when dealing with the database (and serialization, but, as we'll see later, that falls out fairly naturally once you have the database side under control).
pt_br: A maneira mais simples de pensar em um campo de modelo, é que ele fornece uma maneira de converter um objeto Python normal --string, boolean, ``datetime``, ou alguma coisa mais complexa como o ``Hand``-- para ou de um formato que seja útil quando interagir com o banco de dados (e serialização, mas, como veremos mais tarde isso parece bastante natural uma vez que você tenha o lado do banco de dados sob controle).
zh_hans: 最简单的理解模型字段的方式就是它以 Python 对象的方式展示——字符串，布尔值， ``datetime``，或其它更复杂的东西，比如 ``Hand``——将它与某种格式之间来回转换，这在处理数据库（或序列化）时很有用（但是，像我们稍后看到的，一旦您控制了数据库端，就会很自然地出现这种情况）。

source: Normally, you're either writing a Django field to match a particular database column type, or there's a fairly straightforward way to convert your data to, say, a string.
pt_br: Normalmente, ou você está escrevendo um campo Django para lidar com um tipo de coluna de banco de dados em particular, ou existe uma maneira bastante simples de converter seu dado para, por exemplo, uma string.
zh_hans: 一般来说，你可以编写一个 Django 字段来适配特定是数据库列类型，或者已存在一个直接承载你数据的类型，例如，字符串。
