Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: First, define the function that takes the argument and produces a dictionary of data for the result. The important point here is we only need to return a dictionary, not anything more complex. This will be used as a template context for the template fragment. Example::
it: Innanzitutto, definisci la funzione che accetta l'argomento e produce un dizionario di dati per il risultato. Il punto importante qui è che dobbiamo solo restituire un dizionario, non qualcosa di più complesso. Questo verrà utilizzato come context del template per il frammento del template. Esempio::
ja: まず、引数を受け取り、結果のデータの辞書を生成する関数を定義します。ここで重要なのは、辞書を返すだけでよく、それ以上複雑なものは必要ないということです。これは、テンプレートの断片のテンプレート・コンテキストとして使用されます。例:
ko: 먼저 인수를 사용하고 결과에 대한 데이터 사전을 만드는 함수를 정의합니다. 여기서 중요한 점은 더 복잡한 것이 아니라 사전만 돌려주면 된다는 것입니다. 템플릿 조각의 템플릿 컨텍스트로 사용됩니다. 예:
pt_br: Primeiro defina a função que recebe os argumentos e produz um dicionário de dados para o resultado. O ponto importante aqui é que precisamos somente retornar um dicionário, não algo mais complexo. Isso será usado como um contexto para o fragmento de template. Exemplo::
zh_hans: 首先，定义一个函数，接受参数，并返回一个字典。此处的要点是我们只需返回一个字典，不是任何其它复杂的东西。这将作为一个模板上下文被模板碎片使用。例子::

source: Next, create the template used to render the tag's output. This template is a fixed feature of the tag: the tag writer specifies it, not the template designer. Following our example, the template is very short:
it: Quindi, crea il template utilizzato per eseguire il rendering dell'output dei tag. Questo modello è una caratteristica fissa dei tag: lo specifica l'autore del tag, non il designer del template. Seguendo il nostro esempio, il template è molto breve:
ja: 次に、タグの出力をレンダリングするためのテンプレートを作成します。このテンプレートはタグの固定機能であり、テンプレート設計者ではなく、タグ作成者が指定します。この例では、テンプレートはとても短いです:
ko: 그런 다음 태그의 출력을 렌더링하는 데 사용되는 템플릿을 만듭니다. 이 템플릿은 태그의 고정 기능입니다. 태그 작성기는 템플릿 디자이너가 아니라 태그를 지정합니다. 이 예에서는 템플릿이 매우 짧습니다.

source: Now, create and register the inclusion tag by calling the ``inclusion_tag()`` method on a ``Library`` object. Following our example, if the above template is in a file called ``results.html`` in a directory that's searched by the template loader, we'd register the tag like this::
it: Ora, crea e registra il tag di inclusione chiamando il metodo ``inclusion_tag()`` su un oggetto ``Library``. Seguendo il nostro esempio, se il template sopra si trova in un file chiamato ``results.html`` in una directory che viene cercata dall'invocatore del template, registreremo il tag in questo modo::
ja: 次に、 ``Library`` オブジェクトの ``inclusion_tag()`` メソッドを呼び出して、 inclusion tag を作成し、登録します。例に従って、上記のテンプレートがテンプレートローダーによって検索されるディレクトリの ``results.html`` というファイルにある場合、次のようにタグを登録します:
ko: 이제 "도서관 목적"에 "포함_태그()" 방식을 "도서관 목적"이라고 부르며 포함 태그를 만들고 등록해야 한다. 위의 템플릿이 템플릿 로더가 검색하는 디렉토리의 "results.html" 파일에 있는 경우 다음과 같이 태그를 등록합니다.
pt_br: Agora, crie e registre a tag de inclusão chamando o método ``inclusion_tag()`` em um objeto do tipo ``Library``. Seguindo nosso exemplo, se o exemplo acima é um arquivo chamado ``results.html`` em um diretório que é procurado pelo template loader, nós regitramos a tag assim::
zh_hans: 现在，在 ``Library`` 对象上调用 ``inclusion_tag()`` 创建并注册该包含标签。如果上述模板位于一个名为 ``results.html`` 的文件中，在模板加载器搜索的目录中，我们像这样注册该标签::

source: Alternatively it is possible to register the inclusion tag using a :class:`django.template.Template` instance::
it: In alternativa è possibile registrare il tag di inclusione utilizzando un'istanza di :class:`django.template.Template`::
ja: あるいは、 :class:`django.template.Template` インスタンスを使って inclusion tag を登録することもできます:
ko: 또는 :class:'django.template를 사용하여 포함 태그를 등록할 수 있습니다.템플릿 인스턴스:
pt_br: Alternativamente é possível registrar a tag de inclusão usando uma instância de :class:`django.template.Template`::
zh_hans: 或者，也能用 :class:`django.template.Template` 实例注册包含标签::

source: ...when first creating the function.
it: ...alla prima creazione della funzione.
ja: …これは、関数を最初に作成する際に行います。
ko: ...처음 함수를 생성할 때 사용합니다.
pt_br: ... quando criar a função pela primeira vez.
zh_hans: 在第一次创建该函数时。

source: Sometimes, your inclusion tags might require a large number of arguments, making it a pain for template authors to pass in all the arguments and remember their order. To solve this, Django provides a ``takes_context`` option for inclusion tags. If you specify ``takes_context`` in creating a template tag, the tag will have no required arguments, and the underlying Python function will have one argument -- the template context as of when the tag was called.
it: A volte, i tag di inclusione potrebbero richiedere un numero elevato di argomenti, rendendo difficile per gli autori dei template passare tutti gli argomenti e ricordare il loro ordine. Per risolvere questo problema, Django fornisce un'opzione ``takes_context`` per i tag di inclusione. Se specifichi ``takes_context`` nella creazione di un tag nel template, il tag non avrà argomenti richiesti e la funzione Python sottostante avrà un argomento -- il context del template a partire da quando il tag è stato chiamato.
ja: 時に、 inclusion tag は多くの引数を要求することがあり、テンプレート作者が全ての引数を渡したり、引数の順番を覚えたりするのは面倒です。これを解決するために、 Django は inclusion tag に ``takes_context`` オプションを用意しています。テンプレートタグを作成する際に ``takes_context`` を指定すると、タグには必要な引数がなくなり、 Python 関数の引数は 1 つになります――タグが呼び出された時点のテンプレートコンテキストです。
ko: 때때로 포함 태그에 많은 인수가 필요할 수 있으므로 템플릿 작성자가 모든 인수를 전달하고 순서를 기억하기가 어렵습니다. 이를 해결하기 위해 Django는 태그 포함을 위한 "takes_context" 옵션을 제공한다. 템플릿 태그를 만들 때 "takes_context"를 지정하면 태그에 필요한 인수가 없으며 기본 Python 함수에 태그가 호출되었을 때 템플릿 컨텍스트라는 하나의 인수가 있게 됩니다.
pt_br: Algumas vezes, sua tag de inclusão requer um número grande de argumentos, tornando uma dor de cabeça para autores dos templates passar todos os argumentos e lembrar sua ordem. Para resolver isso, o Django fornece uma opção ``takes_context`` para tags de inclusão. Se o especificado o ``takes_context`` na criação da tag de template, a tag não terá argumentos requeridos, e a função Python implícita terá um argumento -- o contexto do template quando a tag foi chamada.
zh_hans: 有时候，你的包含标签可能要求超多参数，模板作者不得不传入所有参数，并牢记它们的顺序，非常痛苦。为了解决此问题， Django 为包含标签提供了一个 ``take_context`` 选项。如果在创建模板标签时指定了 ``takes_context``，该标签将没有必要的参数，底层 Python 函数将只有一个参数——标签创建时的模板上下文。

source: For example, say you're writing an inclusion tag that will always be used in a context that contains ``home_link`` and ``home_title`` variables that point back to the main page. Here's what the Python function would look like::
it: Ad esempio, supponiamo che tu stia scrivendo un tag di inclusione che sarà sempre utilizzato in un context che contiene variabili ``home_link`` e ``home_title`` che puntano alla pagina principale. Ecco come sarebbe la funzione Python:
ja: 例えば、メインページを指す ``home_link`` と ``home_title`` 変数を含むコンテキストの中で常に使用される inclusion tag を書くとします。Python の関数は次のようになります:
ko: 예를 들어 메인 페이지로 돌아가는 ``home_link"와 "home_title" 변수를 포함하는 컨텍스트에서 항상 사용되는 포함 태그를 작성한다고 하자. Python 기능은 다음과 같습니다.
pt_br: Por exemplo, digamos que esteja escrevendo uma tag de inclusão que sempre será usada em um contexto que contém as variásveis ``home_link`` e ``home_title`` que apontam de volta para a página principal. Aqui como a função Python deveria parecer::
zh_hans: 举个例子，假设你编写了一个包含标签，总会在一个包含指向首页的 ``home_link`` 和 ``home_title`` 的上下文环境下使用。Python 函数看起来会像这样::

source: Note that the first parameter to the function *must* be called ``context``.
it: Si noti che il primo parametro della funzione *deve* essere chiamato ``context``.
ja: 最初の引数は ``context`` に *しなければならない* ことに注意してください。
ko: 이 함수에 대한 첫 번째 매개 변수는 *"context"라고 해야 합니다.
pt_br: Repare que o primeiro parâmetro para a função *deve* ser chamado de ``context``.
zh_hans: 注意，该函数的第一个参数 *必须* 是 ``context``。

source: In that ``register.inclusion_tag()`` line, we specified ``takes_context=True`` and the name of the template. Here's what the template ``link.html`` might look like:
it: In quella riga ``register.inclusion_tag()``, abbiamo specificato ``takes_context=True`` e il nome del template. Ecco come potrebbe apparire il template ``link.html``:
ja: この ``register.inclusion_tag()`` の行では、 ``takes_context=True`` と、テンプレートの名前を指定しています。テンプレート ``link.html`` は以下のようになるでしょう:
ko: 그 ``register.laught_tagles" 라인으로 우리는 "laf_laught ="이라고 명기했다.True'와 템플릿의 이름입니다. "link.html"이라는 템플릿은 다음과 같다.
pt_br: Na linha ``register.inclusion_tag()``, especificamos o ``takes_context=True`` e o nome do template. Aqui o que o template ``link.html`` deve se parecer:
zh_hans: 在 ``register.inclusion_tag()`` 行，我们制定了模板名并设置 ``takes_context=True``。以下是模板 ``link.html`` 的样子：

source: Then, any time you want to use that custom tag, load its library and call it without any arguments, like so:
it: Quindi, ogni volta che desideri utilizzare quel tag personalizzato, carica la sua libreria e chiamala senza argomenti, in questo modo:
ja: そして、そのカスタムタグを使いたいときはいつでも、そのライブラリをロードして、引数なしで次のように呼び出します:
ko: 그런 다음 언제든지 해당 사용자 지정 태그를 사용하려면 라이브러리를 로드하고 다음과 같은 인수 없이 호출하십시오.
pt_br: Então, qualquer momento que queira usar a tag personalizada, carregue sua biblioteca e chame-a sem nenhum argumento, como:
zh_hans: 后面，当你想用该自定义标签时，加载它的库，并不带任何参数的调用它，像这样：

source: Note that when you're using ``takes_context=True``, there's no need to pass arguments to the template tag. It automatically gets access to the context.
it: Nota che quando usi ``takes_context=True``, non è necessario passare argomenti al tag del modello. Ottiene automaticamente l'accesso al context.
ja: ``takes_context=True`` を使用している場合、テンプレートタグに引数を渡す必要がないことに注意してください。自動的に context にアクセスします。
ko: 참고: "disclos_disclosen ="을 사용할 때true'는 템플릿 태그에 인수를 전달할 필요가 없습니다. 자동으로 컨텍스트에 액세스할 수 있습니다.
pt_br: Repare que quando estiver usando ``takes_context=True``, não tem necessidade de passar argumentos para a tag de template. Esta tem acessa o contexto automaticamente.
zh_hans: 注意，只要使用了 ``takes_context=True``，就无需为模板标签传递参数。它自动从上下文获取。

source: The ``takes_context`` parameter defaults to ``False``. When it's set to ``True``, the tag is passed the context object, as in this example. That's the only difference between this case and the previous ``inclusion_tag`` example.
it: Il parametro ``takes_context`` è predefinito su ``False``. Quando è impostato su ``True``, al tag viene passato l'oggetto context, come in questo esempio. Questa è l'unica differenza tra questo caso e il precedente esempio di ``inclusion_tag``.
ja: ``takes_context`` パラメータのデフォルトは ``False`` です。これを ``True`` に設定すると、この例のようにタグに context オブジェクトが渡されます。これが先ほどの ``inclusion_tag`` の例との唯一の違いです。
ko: "takes_context"라는 매개변수는 기본적으로 "False"로 설정되어 있다. "참"으로 설정하면 이 예에서와 같이 태그가 컨텍스트 객체를 통과합니다. 그것이 이번 사건과 이전의 ``포함_태그" 사례와의 유일한 차이점이다.
pt_br: O parâmetro padrão para ``takes_context`` é ``False``. Quando definido como ``True``, para tag é passado o objeto contexto, como neste exemplo. Este é a única diferença entre este caso e o exemplo ``inclusion_tag`` anterior.
zh_hans: ``takes_context`` 参数默认为 ``False``。当其为 ``True``，标签会被传入上下文对象，像本例展示的那样。这是本例和之前的 ``包含标签`` 实例的唯一不同之处。

source: ``inclusion_tag`` functions may accept any number of positional or keyword arguments. For example::
it: Le funzioni ``inclusion_tag`` possono accettare qualsiasi argomento posizionale o di parole chiave. Per esempio::
ja: ``inclusion_tag`` 関数は任意の数の位置引数またはキーワード引数を受け取ることができます。例えば:
ko: "filt_tagles 함수는 위치 또는 키워드 인수를 얼마든지 수용할 수 있다. 예:
pt_br: Funções ``inclusion_tag`` podem aceitar qualquer número de argumentos posicionais ou nomeados. Por exemplo::
zh_hans: ``包含标签`` 函数能接受任意个数的位置或关键字参数。例子::

source: Advanced custom template tags
it: Tag di template personalizzati avanzati
ja: 高度なカスタムテンプレートタグ
ko: 고급 사용자 지정 템플릿 태그
pt_br: Tags personalizadas avançadas
zh_hans: 进阶自定义模板标签

source: Sometimes the basic features for custom template tag creation aren't enough. Don't worry, Django gives you complete access to the internals required to build a template tag from the ground up.
it: A volte le funzionalità di base per la creazione di tag in template personalizzati non sono sufficienti. Non preoccuparti, Django ti dà accesso completo al necessario per creare un tag template da zero.
ja: カスタムテンプレートタグを作成するための基本的な機能だけでは不十分な場合があります。ご心配なく、 Django はテンプレートタグを一から構築するのに必要な内部機能への完全なアクセスを提供します。
ko: 사용자 지정 템플릿 태그를 만드는 기본 기능이 충분하지 않은 경우도 있습니다. 걱정하지 마십시오. Django는 처음부터 템플릿 태그를 만드는 데 필요한 내부 액세스 권한을 제공합니다.
pt_br: As vezes as funções básicas para criação das tags de template não são o suficiente. Não se preocupe, o Django lhe dá completo acesso as "coisas"internas requeridas para construir uma tag de template do zero.
zh_hans: 有时候，用于自定义模板标签的基础特性不够用。不要担心，Django 开放了从零开始构建模板标签所需的所有内置机制。

source: A quick overview
it: Una rapida panoramica
ja: 簡単な概要
ko: 간략한 개요
pt_br: Um rápida visão geral
zh_hans: 简介

source: The template system works in a two-step process: compiling and rendering. To define a custom template tag, you specify how the compilation works and how the rendering works.
it: Il sistema di template funziona in un processo in due fasi: compilazione e rendering. Per definire un tag template personalizzato, specifica come funziona la compilation e come funziona il rendering.
ja: テンプレート・システムは、コンパイルとレンダリングの 2 段階のプロセスで動作します。カスタムテンプレートタグを定義するには、コンパイルの仕組みとレンダリングの仕組みを指定します。
ko: 템플릿 시스템은 컴파일 및 렌더링의 2단계 프로세스로 작동합니다. 사용자 정의 템플릿 태그를 정의하려면 컴파일의 작동 방식과 렌더링 방식을 지정합니다.
pt_br: O sistema de templates funciona em um processo de 2 passos.: compilação e renderização. Para definir uma tag de template personalizada, é necessário especificar como a compilação funcionar e como a renderização funciona.
zh_hans: 模板系统工作只需两步：编译和渲染。为了定义自定义模板标签，你需指定如何编译和渲染。

source: When Django compiles a template, it splits the raw template text into ''nodes''. Each node is an instance of ``django.template.Node`` and has a ``render()`` method. A compiled template is a list of ``Node`` objects. When you call ``render()`` on a compiled template object, the template calls ``render()`` on each ``Node`` in its node list, with the given context. The results are all concatenated together to form the output of the template.
it: Quando Django compila un template, divide il testo del template grezzo in ''nodi''. Ogni nodo è un'istanza di ``django.template.Node`` e ha un metodo ``render()``. Un template compilato è un elenco di oggetti ``Nodo``. Quando chiami ``render()`` su un oggetto del template compilato, il template chiama ``render()`` su ogni ``Nodo`` nella sua lista dei nodi, con il context fornito. I risultati sono tutti concatenati insieme per formare il risultato (output) del template.
ja: Django はテンプレートをコンパイルするとき、生のテンプレートテキストを "ノード" に分割します。各ノードは ``django.template.Node`` のインスタンスで、 ``render()`` メソッドを持っています。コンパイルされたテンプレートは ``Node`` オブジェクトのリストです。コンパイルされたテンプレートオブジェクトに対して ``render()`` を呼び出すと、テンプレートは与えられたコンテキストで、ノードリスト内の各 ``Node`` に対して ``render()`` を呼び出します。 その結果はすべて連結され、テンプレートの出力となります。
ko: Django는 템플릿을 컴파일할 때 원시 템플릿 텍스트를 "노드"로 분할합니다. 각 노드는 ``django.template"의 인스턴스이다.노드'는 "렌더()" 방식을 가지고 있다. 컴파일된 템플릿은 "노드" 개체의 목록입니다. 컴파일된 템플릿 객체의 "렌더()"를 호출할 때 템플릿은 주어진 컨텍스트를 사용하여 노드 목록에 있는 각 "노드"에 "렌더()"를 호출한다. 결과는 모두 함께 연결되어 템플릿 출력을 형성합니다.

source: Thus, to define a custom template tag, you specify how the raw template tag is converted into a ``Node`` (the compilation function), and what the node's ``render()`` method does.
it: Quindi, per definire un custom template tag: specifica come il template tag grezzo viene convertito in un ``Node`` (usa la funzione di compilazione) e definisci cosa fa il metodo ``render()`` del nodo.
ja: このように、カスタムテンプレートタグを定義するには、生のテンプレートタグを ``Node`` に変換する方法（コンパイル関数）と、ノードの ``render()`` メソッドの動作を指定します。
ko: 따라서 사용자 정의 템플릿 태그를 정의하려면 원시 템플릿 태그를 "노드"(컴파일 기능)로 변환하는 방법과 노드의 "렌더()" 메서드가 수행하는 방법을 지정합니다.
pt_br: Então, para definir uma tag de template personalizada, especifique como a tag de template original é convertida em um ``Node`` (a a função de compilação), e o que o método ``reder()``do nó faz.
zh_hans: 因此，要定义一个自定义模板标签，你要指定如何将原始模板标签转换为 ``节点`` （编译函数），还要指定 ``render()`` 方法的操作。

source: Writing the compilation function
it: Scrivere la funzione di compilazione
ja: コンパイル関数の書き方
ko: 컴파일 기능 쓰기
pt_br: Escrevendo a função de compilação
zh_hans: 编写编译函数

source: For each template tag the template parser encounters, it calls a Python function with the tag contents and the parser object itself. This function is responsible for returning a ``Node`` instance based on the contents of the tag.
it: Per ogni tag del template che incontra il parser del template, chiama una funzione Python con il contenuto del tag e l'oggetto del parser stesso. Questa funzione è responsabile della restituzione di un'istanza ``Node`` basata sul contenuto del template tag.
ja: テンプレートパーサーが見つけたそれぞれのテンプレートタグに対して、タグの内容とパーサーオブジェクト自身を使って Python 関数を呼び出します。この関数はタグの内容に基づいて ``Node`` インスタンスを返す役割を担います。
ko: 각 템플릿 태그에 대해 템플릿 파서가 발견하면 태그 내용 및 파서 개체 자체를 사용하여 Python 함수를 호출합니다. 이 기능은 태그의 내용에 따라 "노드" 인스턴스를 반환하는 역할을 한다.
pt_br: Para cada tag de template que o analisador de templates encontra, ele chama uma função Python com o conteúdo da tag e o próprio objeto analisador. Essa função é responsável por retornar uma instância de ``Node`` baseada no conteúdo da tag.
zh_hans: 模板解析器遇到的每个模板标签，解析器都会调用一个 Python 函数，参数是标签内容和解析器对象本身。该函数需要基于标签的内容返回一个 ``节点`` 实例。

source: For example, let's write a full implementation of our template tag, ``{% current_time %}``, that displays the current date/time, formatted according to a parameter given in the tag, in :func:`~time.strftime` syntax. It's a good idea to decide the tag syntax before anything else. In our case, let's say the tag should be used like this:
it: Per esempio, scriviamo un'implementazione completa del nostro tag template, ``{% current_time %}``, che mostra la data/ora corrente, formattata secondo un parametro dato nel tag, sintassi :func:`~time.strftime ` . È una buona idea decidere la sintassi dei template tag prima di ogni altra cosa. Nel nostro caso, supponiamo che il tag debba essere utilizzato in questo modo:
ja: 例えば、テンプレートタグの完全な実装である ``{% current_time %}`` を書いてみましょう。このタグは :func:`~time.strftime` という構文で、タグで与えられたパラメータに従ってフォーマットされた現在の日時を表示します。何よりも先にタグの構文を決めるのは良いアイデアです。この場合、タグは次のように使用します:
ko: 예를 들어, 태그에 지정된 매개 변수에 따라 포맷된 현재 날짜/시간을 표시하는 템플릿 태그 "{% current_time %}"의 전체 구현을 :func:'~time.strftime' 구문으로 작성해보자. 태그 구문은 다른 것보다 먼저 결정하는 것이 좋습니다. 이 경우 태그는 다음과 같이 사용해야 합니다.

source: The parser for this function should grab the parameter and create a ``Node`` object::
it: Il parser per questa funzione dovrebbe prendere il parametro e creare un oggetto ``Node``::
ja: この関数のパーサは、パラメータを取得して ``Node`` オブジェクトを作成する必要があります:
ko: 이 기능의 파서는 매개 변수를 잡고 다음과 같은 ``노드" 개체를 만들어야 한다.
pt_br: O analisador para essa função deve pegar os criar um objeto ``Node``::
zh_hans: 这个函数的解析器应用获取参数，并创建一个 ``节点`` 对象::

source: Notes:
it: Note:
ja: メモ:
ko: 각주:
pt_br: Notas:
zh_hans: 注意：

source: ``parser`` is the template parser object. We don't need it in this example.
it: ``parser`` è l'oggetto parser di template. Non ne abbiamo bisogno in questo esempio.
ja: ``parser`` はテンプレートパーサーオブジェクトです。この例では不要です。
ko: "파서라는 것은 템플릿 파서 개체이다. 이 예에서는 필요하지 않습니다.
pt_br: ``parser`` é o objeto analisador do template. Nós não precisamos dele neste exemplo.
zh_hans: ``parser`` 是模板解析器对象。本例中不需要。

source: ``token.contents`` is a string of the raw contents of the tag. In our example, it's ``'current_time "%Y-%m-%d %I:%M %p"'``.
it: ``token.contents`` è una stringa di contenuti grezzi del tag. Nel nostro esempio, è ``'current_time "%Y-%m-%d %I:%M %p"'``.
ja: ``token.contents`` はタグの生の内容を表す文字列です。この例では ``'current_time "%Y-%m-%d %I:%M %p"'`` です。
ko: "알아두다.알아두다"는 태그의 생색내기 내용물의 줄이다. 우리의 예에서 그것은 "'current_time %Y-%m- %I:%M"이다.
pt_br: ``token.contents`` é uma string com o conteúdo original da tag, seu ``'current_time "%Y-%m-%d %I:%M %p"'``.
zh_hans: ``token.contents`` 是包含标签原始内容的字符串。本例中是 ``'current_time "%Y-%m-%d %I:%M %p"'``。

source: The ``token.split_contents()`` method separates the arguments on spaces while keeping quoted strings together. The more straightforward ``token.contents.split()`` wouldn't be as robust, as it would naively split on *all* spaces, including those within quoted strings. It's a good idea to always use ``token.split_contents()``.
it: Il metodo ``token.split_contents()`` separa gli argomenti con gli spazi tenendo assieme le stringhe tra virgolette. Il più diretto ``token.contents.split()`` non sarebbe così robusto, perchè dividerebbe pedissequamente *tutti* gli spazi, inclusi quelli tra virgolette. E' una buona idea usare sempre `token.split_contents()``.
ja: ``token.split_contents()`` メソッドは、引用符で囲まれた文字列はそのままに、引数をスペースで分割します。より単純な ``token.contents.split()`` を使用すると、引用符で囲まれた文字列内を含む *すべての* スペースで単純に分割してしまうため、それほど堅牢ではありません。常に ``token.split_contents()`` を使用することをお勧めします。
ko: "token.split_contents()" 방식은 인용된 문자열을 함께 유지하면서 공간에 대한 인수를 구분한다. 좀더 간단한 ``token.contents.split()"는 인용된 문자열 내의 공간을 포함하여 *모든* 공간에서 순진하게 분리되기 때문에 그렇게 강력하지는 않을 것이다. 항상 ``token.split_contents()"를 사용하는 것이 좋다.
pt_br: O método ``token.split_contents()`` separa os argumentos por espaços enquanto mantém strings entre aspas, juntas. Mais direto o ``token.contents.split()`` não seria tão robusto já que ingenuamente dividiria *todos* os espaços, incluindo aqueles dentro de aspas. É uma boa idéia usar sempre o ``token.split_contents()``.
zh_hans: ``token.split_contents()`` 方法按空格分隔字符串，但不会分隔引号包裹的部分。二愣子 ``token.contents.split()`` 就没那么健壮了，它直接在空格处分割字符串，不论它们是否被引号包裹。推荐总是使用 ``token.split_contents()``。

source: This function is responsible for raising ``django.template.TemplateSyntaxError``, with helpful messages, for any syntax error.
it: Questa funzione è responsabile di sollevare ``django.template.TemplateSyntaxError``, con messaggi utili, per ogni errore di sintassi.
ja: この関数は構文エラーに対して ``django.template.TemplateSyntaxError`` を親切なメッセージとともに発生させます。
ko: 이 기능은 ``장고 템플릿"을 올리는 데 책임이 있다.모든 구문 오류에 대해 유용한 메시지가 포함된 TemplateSyntaxError'입니다.
pt_br: Essa função é responsável for informar o ``django.template.TemplateSyntaxError``, com mensagens de ajuda, para qualquer erro de sintaxe.
zh_hans: 该方法要在语法错误发生时抛出包含有用信息的 ``django.template.TemplateSyntaxError``。

source: The ``TemplateSyntaxError`` exceptions use the ``tag_name`` variable. Don't hard-code the tag's name in your error messages, because that couples the tag's name to your function. ``token.contents.split()[0]`` will ''always'' be the name of your tag -- even when the tag has no arguments.
it: Le eccezioni ``TemplateSyntaxError`` usano la variabile ``tag_name``. Non fare hard-coding del nome del tag nei tuoi messaggi di errore, perchè questo accoppia il nome del tuo tag alla funzione. ``token.contents.split()[0]`` sarò "sempre" il nome del tuo tag -- anche quando il tag non prende argomenti.
ja: ``TemplateSyntaxError`` 例外は ``tag_name`` 変数を使用します。エラーメッセージにタグの名前をハードコーディングしないでください。 ``token.contents.split()[0]`` は"常に"タグの名前になります――タグに引数がない場合でもです。
ko: "템플릿 구문 오류" 예외는 "tag_name" 변수를 사용한다. 오류 메시지에서 태그 이름을 하드 코딩하지 마십시오. 태그 이름이 기능과 결합됩니다. "항상"은 당신의 태그 이름이 될 것이다. 심지어 그 태그가 아무런 언쟁도 없을 때에도 말이다.
pt_br: As exceções ``TemplateSyntaxError`` usam a variável ``tag_name``. Não coloque nomes de tags dentro de suas mensagens de erro, porque isso amarra o nome da tag a sua função. ``token.contents.split()[0]`` ''sempre'' será o nome da sua tag -- mesmo quando sua tag não tem argumentos.
zh_hans: ``TemplateSyntaxError`` 异常使用了 ``tag_name`` 变量。不要在错误消息中硬编码标签名，因为这会使的标签名与函数耦合。 ``token.contents.split()[0]`` 总会返回标签名——即便标签没有参数。
