Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: During development, if you use :mod:`django.contrib.staticfiles`, this will be done automatically by :djadmin:`runserver` when :setting:`DEBUG` is set to ``True`` (see :func:`django.contrib.staticfiles.views.serve`).
it: Durante lo sviluppo, se usi :mod:`django.contrib.staticfiles`, sarà fatto automaticamente da :djadmin:`runserver` quando :setting:`DEBUG` è ``True`` (vedi :func:`django.contrib.staticfiles.views.serve`).
ja: 開発中に :mod:`django.contrib.staticfiles` を使用する場合には、:setting:`DEBUG` を ``True`` に設定して :djadmin:`runserver` を実行すれば、自動的に設定が行われます。(詳しくは、:func:`django.contrib.staticfiles.views.serve` を参照)
ko: 개발 중에 :mod:'django.contrib.static files'를 사용할 경우 :설정::djadmin:'runserver'에 의해 자동으로 수행됩니다.DEBUG는 "True"로 설정되어 있습니다(func:"django.contrib.static files" 참조).view.serve')를 입력합니다.
pt_br: Durante o desenvolvimento, se você usar :mod:`django.contrib.staticfiles`, isso será feito automaticamente pelo :djadmin:`runserver` quando :setting:`DEBUG` está definido como ``True``(veja :func:`django.contrib.staticfiles.views.serve`).
zh_hans: 开发时，使用 :mod:`django.contrib.staticfiles`，这一般会在 :setting:`DEBUG` is set to ``True`` 情况下由 :djadmin:`runserver` 自动完成（参考 :func:`django.contrib.staticfiles.views.serve`）。

source: This method is **grossly inefficient** and probably **insecure**, so it is **unsuitable for production**.
it: Questo metodo è **altamente inefficiente** e probabilmente **poco sicuro**, per questo è **inadeguato alla produzione**.
ja: ただし、この方法は **極めて非効率** であり、**セキュリティ上の問題がある** 可能性が高いため、**本番環境で使うべきではありません**。
ko: 이 방법은 **총적으로 비효율적**이며 아마도 **불안한**이므로 **운영에 적합하지 않습니다*.
pt_br: Este método é **grosseiramente ineficiente** e provavelmente **inseguro**, então isso é **impróprio para produção**.
zh_hans: 该方法 **极度低效** 且 **不怎么安全**，所以这 **不适合生产环境**。

source: See :doc:`/howto/static-files/deployment` for proper strategies to serve static files in production environments.
it: Consulta la documentazione :doc:`/howto/static-files/deployment` per le migliori strategie per distribuire file statici in ambienti di produzione.
ja: 本番環境で静的ファイルを配信するための適切な戦略については、:doc:`/howto/static-files/deployment` を読んでください。
ko: 프로덕션 환경에서 정적 파일을 서비스하기 위한 적절한 전략은 :doc:'/how to/static files/deployment'를 참조하십시오.
pt_br: Veja :doc:`/howto/static-files/deployment` para estratégias apropriadas para servir arquivos estáticos em ambientes de produção.
zh_hans: 参考 :doc:`/howto/static-files/deployment` 了解如何正确地在生产环境提供静态文件服务的策略。

source: Your project will probably also have static assets that aren't tied to a particular app. In addition to using a ``static/`` directory inside your apps, you can define a list of directories (:setting:`STATICFILES_DIRS`) in your settings file where Django will also look for static files. For example::
it: Il tuo progetto avrà probabilmente anche asset statici che non sono legati ad una app particolare. Oltre ad usare una directory ``static/`` nelle tue applicazioni, puoi definire una lista di directory (:setting:`STATICFILES_DIRS`) nel tuo file di impostazioni dove Django cercherà ulteriormente i file statici. Per esempio::
ja: プロジェクトには、特定のアプリケーションに紐付けられていない 静的な assets があることがあります。その場合には、アプリケーション内の ``static/`` ディレクトリの他に、設定ファイルでディレクトリのリスト (:setting:`STATICFILES_DIRS`) を定義して、Django が静的ファイルを検索できるようにすることができます。たとえば、次のように設定します。
ko: 프로젝트에 특정 앱에 연결되지 않은 정적 자산도 있을 수 있습니다. 앱 내에서 "static/" 디렉토리를 사용하는 것 외에도 디렉토리 목록(:seting:")을 정의할 수 있습니다.Django가 정적 파일도 찾을 수 있는 설정 파일의 STATICFILES_DIRS)입니다. 예를 들어 다음과 같습니다.
pt_br: Seu projeto irá provavelmente ter ativos estáticos que não estão amarrados a uma app em particular. Além de usar um diretório ``static/`` dentro de sua app, você pode definir uma lista de diretórios (:setting:`STATICFILES_DIRS`) no seu arquivo de configurações onde o Django também irá procurar por arquivos estáticos. Por exemplo::
zh_hans: 你的工程可能包含未与任何应用绑定的静态资源。除了在 apps 中使用 ``static/`` 目录，你可以在配置文件中定义一个目录列表 (:setting:`STATICFILES_DIRS`) ，Django 会从中寻找静态文件。例子::

source: See the documentation for the :setting:`STATICFILES_FINDERS` setting for details on how ``staticfiles`` finds your files.
it: Consulta la documentazione per la configurazione relativa a :setting:`STATICFILES_FINDERS` per i dettagli su come ``staticfiles`` trova i tuoi files.
ja: ``staticfiles`` がファイルを探索する方法について詳しくは、 :setting:`STATICFILES_FINDERS` のドキュメントを参照してください。
ko: :설정:'에 대한 설명서를 참조하십시오.정적 파일_입니다."정적 파일"이 당신의 파일을 어떻게 찾는지에 대한 자세한 내용은 FINDER의 설정입니다.
pt_br: Veja a documentação para a definição do :setting:`STATICFILES_FINDERS` para detalhes sobre como o ``staticfiles`` encontra seus arquivos.
zh_hans: 参考 :setting:`STATICFILES_FINDERS` 配置的文档了解 ``staticfiles`` 是如何找到你的文件的细节。

source: Static file namespacing
it: Namespacing dei file statici
ja: 静的ファイルの名前空間
ko: 정적 파일 네임스페이싱
pt_br: "namespacing" de arquivos estáticos
zh_hans: 静态文件命名空间

source: Now we *might* be able to get away with putting our static files directly in ``my_app/static/`` (rather than creating another ``my_app`` subdirectory), but it would actually be a bad idea. Django will use the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the best way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
it: Come per i template, *potremmo* semplicemente inserire i nostri file statici direttamente in ``my_app/static/`` (anziché creare un'altra sottodirectory ``my_app``), ma sarebbe certamente una cattiva idea. Django sceglierà il primo file statico che troverà con un nome che corrisponde, e se tu avessi un file statico con lo stesso nome in una app *diversa*, Django non saprebbe come distinguere fra i due. Dobbiamo essere in grado di puntare Django sul file corretto, ed il modo migliore per farlo è quello di inserirlo in un *namespace*. Cioè, inserendo questi file statici dentro *un'altra* directory che abbia come nome il nome della app stessa.
ja: 静的ファイルを（別の ``my_app`` サブディレクトリを作成するのではなく）直接 ``my_app/static/`` に配置することも *可能* ですが、実際にはそれは良くない考えです。Djangoは、名前が一致する最初の静的ファイルを使用します。もし *異なる* アプリケーションに同じ名前の静的ファイルがあった場合、Djangoはそれらを区別できません。正しいファイルをDjangoに指定する必要があります。これを保証する最善の方法は、それらを *名前空間化* することです。つまり、アプリケーション自体の名前で命名された *別の* ディレクトリ内に静的ファイルを配置することです。
ko: 이제 정적 파일을 ``my_app/static/"에 직접 넣어도 (또 다른 ``my_app" 서브디렉토리가 아니라) 벗어날 수 있을지 모르지만, 실제로는 좋지 않은 생각일 것입니다. Django는 이름이 일치하는 첫 번째 정적 파일을 사용하며, *different* 애플리케이션에서 동일한 이름의 정적 파일이 있는 경우 Django는 이 파일을 구별할 수 없습니다. 우리는 Django를 제대로 가리킬 수 있어야 하며, 이것을 확실히 하기 위한 최선의 방법은 *이름 간격*을 정하는 것입니다. 즉, 이러한 정적 파일을 애플리케이션 자체용으로 명명된 *또 다른* 디렉토리에 넣습니다.

source: You can namespace static assets in :setting:`STATICFILES_DIRS` by specifying :ref:`prefixes <staticfiles-dirs-prefixes>`.
it: Puoi assegnare namespace agli asset statici in :setting:`STATICFILES_DIRS` specificando :ref:`prefissi <staticfiles-dirs-prefixes>`.
ja: :setting:`STATICFILES_DIRS` で :ref:`プレフィックス <staticfiles-dirs-prefixes>` を指定することで、静的アセットの名前空間を指定できます。
ko: :seting:'에서 정적 자산의 네임스페이스를 지정할 수 있습니다.staticfiles_DIRS'는 다음과 같이 지정합니다.ref:'prefixs'.

source: Serving static files during development
it: Servire file statici durante lo sviluppo
ja: 開発時の静的ファイルの取扱い
ko: 개발 중에 정적 파일을 제공합니다.
zh_hans: 开发时提供静态文件服务

source: If you use :mod:`django.contrib.staticfiles` as explained above, :djadmin:`runserver` will do this automatically when :setting:`DEBUG` is set to ``True``. If you don't have ``django.contrib.staticfiles`` in :setting:`INSTALLED_APPS`, you can still manually serve static files using the :func:`django.views.static.serve` view.
it: Se usi :mod:`django.contrib.staticfiles` come spiegato sopra, :djadmin:`runserver` lo farà automaticamente se :setting:`DEBUG` è impostato su ``True``. Se non hai ``django.contrib.staticfiles`` in :setting:`INSTALLED_APPS`, puoi comunque servire manualmente i file statici usando la vista :func:`django.views.static.serve`.
ja: 上で述べたたように :mod:`django.contrib.staticfiles` を利用する場合、 :setting:`DEBUG` が ``True`` であれば :djadmin:`runserver` は自動的にこの処理を行います。もし :setting:`INSTALLED_APPS` 内に ``django.contrib.staticfiles`` が存在しない場合は、手動で :func:`django.views.static.serve` ビューを用いて静的ファイルを取り扱わなければなりません。
ko: 위에서 설명한 바와 같이 :mod:'django.contrib.static files'를 사용하는 경우 :설정: :djadmin:'runserver'는 자동으로 이 작업을 수행합니다.DEBUG는 "True"로 설정되어 있습니다. "django.contrib.static files"가 없는 경우 : setting:"으로 설정합니다.설치되었습니다.APPs'에서는 :func:'django'를 사용하여 정적 파일을 수동으로 제공할 수 있습니다.정적이죠.의견을 제시합니다.
zh_hans: 若你使用了前文所述的 :mod:`django.contrib.staticfiles`， :djadmin:`runserver` 会在 :setting:`DEBUG` 为 ``True`` 时自动处理。若你未在 :setting:`INSTALLED_APPS` 中包含 ``django.contrib.staticfiles``，你仍能手动通过 :func:`django.views.static.serve` 为静态文件提供服务。

source: This is not suitable for production use! For some common deployment strategies, see :doc:`/howto/static-files/deployment`.
it: Questo non è adatto per un utilizzo in produzione! Per alcune strategie di pubblicazione comuni, guarda :doc:`/howto/static-files/deployment`.
ja: この機能は本番環境で利用するのに適していません！ 一般的なデプロイ方法に関しては :doc:`/howto/static-files/deployment` を参照ください。
ko: 이것은 생산용으로 적합하지 않습니다! 일반적인 배포 전략은 :doc:'/how to/static-files/deploy'를 참조하십시오.
pt_br: Isso não é apropriado para uso em produção!. Para algumas estratégias de implantação, veja :doc:`/howto/static-files/deployment`.
zh_hans: 这不适合生产环境！常见的部署策略请参考 :doc:`/howto/static-files/deployment`。

source: For example, if your :setting:`STATIC_URL` is defined as ``static/``, you can do this by adding the following snippet to your ``urls.py``::
it: Per esempio, se la tua impostazione :setting:`STATIC_URL` è definita come ``static/``, puoi fare questo aggiungendo il seguente snippet a ``urls.py``::
ja: 例えば、 :setting:`STATIC_URL` が ``static/`` として定義されている場合、これを行うには ``urls.py`` に以下のコードを追加します:

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``static/``) and not a URL (e.g. ``http://static.example.com/``).
it: Questa funzione helper funziona solo in modalità debug e solo se il prefisso dato è locale (ad esempio ``static/``) e non un URL (es: ``http://static.example.com/``).
ja: このヘルパー関数はデバッグモードでのみ動作し、与えられた接頭辞が URL (``http://static.example.com/`` など) ではなくローカル (``static/`` など) の場合にのみ動作します。

source: Also this helper function only serves the actual :setting:`STATIC_ROOT` folder; it doesn't perform static files discovery like :mod:`django.contrib.staticfiles`.
it: Anche questa funzione helper serve solo la cartella :setting:`STATIC_ROOT`; non esegue la disocvery dei file statici come :mod:`django.contrib.staticfiles`.
ja: またこのヘルパー関数は :setting:`STATIC_ROOT` のフォルダのみを利用します; :mod:`django.contrib.staticfiles` のように静的ファイルの探索は行いません。
ko: 또한 이 도우미 기능은 실제 :seting:'만 제공합니다.STATIC_ROOT' 폴더. :mod:'django.contrib.static files'와 같은 정적 파일 검색을 수행하지 않습니다.
pt_br: Ainda esta função de auxílio somente serve o diretório atual :setting:`STATIC_ROOT`; ela não faz a procura de arquivos estáticos como :mod:`django.contrib.staticfiles`.
zh_hans: 当然，助手函数只为实际的 :setting:`STATIC_ROOT` 目录提供服务；它不会像 :mod:`django.contrib.staticfiles` 一样搜索静态文件。

source: Finally, static files are served via a wrapper at the WSGI application layer. As a consequence, static files requests do not pass through the normal :doc:`middleware chain </topics/http/middleware>`.
it: Infine, i file statici sono serviti via wrapper al livello di applicazione WSGI. Di conseguenza, le richieste a file static non passano attraverso la normale :doc:`catena di middleware </topics/http/middleware>`.
ja: 最後に、静的ファイルはWSGIアプリケーション層のラッパーを介して提供されます。結果として、静的ファイルのリクエストは通常の :doc:`ミドルウェアチェイン</topics/http/middleware>` を通りません。

source: Serving files uploaded by a user during development
it: Distribuire file caricati da un utente durante lo sviluppo
ja: 開発時における、ユーザーがアップロードするファイルの取扱い
ko: 개발 중에 사용자가 업로드한 파일을 제공합니다.
zh_hans: 开发期间保存用户上传的文件

source: During development, you can serve user-uploaded media files from :setting:`MEDIA_ROOT` using the :func:`django.views.static.serve` view.
it: Durante lo sviluppo, è possibile servire file multimediali caricati dall'utente da:setting:`MEDIA_ROOT` utilizzando la vista :func:`django.views.static.serve`.
ja: 開発中は、ユーザーによってアップロードされたメディアファイルを :func:`django.views.static.serve` ビューを利用している :setting:`MEDIA_ROOT` から利用できます。
ko: 개발 중에:설정:에서 사용자가 업로드한 미디어 파일을 제공할 수 있습니다.'MEDIA_ROOT'는 :func:'django'를 사용합니다.정적이죠.의견을 제시합니다.
zh_hans: 开发期间，你能用 :func:`django.views.static.serve` 视图为用户上传的媒体文件提供服务。

source: For example, if your :setting:`MEDIA_URL` is defined as ``media/``, you can do this by adding the following snippet to your :setting:`ROOT_URLCONF`::
it: Ad esempio, se il tuo :setting:`MEDIA_URL` è definita come ``media/``, puoi farlo aggiungendo il seguente snippet al tuo:setting:`ROOT_URLCONF`::
ja: 例えば、 :setting:`MEDIA_URL` が ``media/`` として定義されている場合、これを行うには :setting:`ROOT_URLCONF` に以下のコードを追加します:

source: This helper function works only in debug mode and only if the given prefix is local (e.g. ``media/``) and not a URL (e.g. ``http://media.example.com/``).
it: Questa funzione di supporto è disponibile solo in modalità debug e solo se il prefisso è locale (es. ``media/``) ma non unaURL (es. ``http://media.example.com/``).
ja: このヘルパー関数はデバッグモードでのみ動作し、与えられたプレフィックスがURL (``http://media.example.com/`` など) ではなくローカル (``media/`` など) の場合にのみ動作します。

source: When running tests that use actual HTTP requests instead of the built-in testing client (i.e. when using the built-in :class:`LiveServerTestCase <django.test.LiveServerTestCase>`) the static assets need to be served along the rest of the content so the test environment reproduces the real one as faithfully as possible, but ``LiveServerTestCase`` has only very basic static file-serving functionality: It doesn't know about the finders feature of the ``staticfiles`` application and assumes the static content has already been collected under :setting:`STATIC_ROOT`.
it: Quando si eseguono test che utilizzano richieste HTTP effettive invece del client di test integrato (per esempio utilizzando :class:`LiveServerTestCase <django.test.LiveServerTestCase>`) gli asset statici devono essere serviti insieme al resto del contenuto in modo che l'ambiente di test riproduca quello reale il più fedelmente possibile, ma ``LiveServerTestCase`` ha solo funzionalità di servizio di file statici molto basilari: non conosce la funzione di ricerca dell'applicazione ``staticfiles`` e presuppone il il contenuto statico sia già stato collezionato in :setting:`STATIC_ROOT`.
ja: ビルトインのテストクライアント (たとえば、ビルトインの :class:`LiveServerTestCase <django.test.LiveServerTestCase>`) ではなく実際の HTTP リクエストを使用してテストを実行している場合、テスト環境が現実の環境をできるだけ忠実に再現できるように、他のコンテンツと同じように静的アセットも配信する必要があります。しかし、``LiveServerTestCase`` はとても基本的な静的ファイル配信機能しかないため、``staticfiles`` アプリケーションの探索機能はなく、すでに静的コンテンツは :setting:`STATIC_ROOT` に集められていることを前提にしています。
ko: 내장된 테스트 클라이언트 대신 실제 HTTP 요청을 사용하는 테스트를 실행하는 경우(즉, 내장된 :class를 사용하는 경우):"LiveServerTestCase >django.test입니다.'라이브서버 테스트 사례') 정적 자산은 콘텐츠의 나머지 부분에 제공되어야 테스트 환경이 가능한 한 충실하게 실제 데이터를 재현할 수 있지만 ``라이브서버 테스트 사례"는 매우 기본적인 정적 파일 서비스 기능만 갖추고 있습니다. 정적인 파일(static files) 애플리케이션의 파인더 기능에 대해서는 알지 못하며 정적인 내용은 이미 다음과 같은 설정으로 수집되었다고 가정합니다.STATIC_ROOT'입니다.
pt_br: Ao executar testes que usam requisições HTTP reais ao invés do cliente de teste embutido (isto é, quando se usa a :class:`LiveServerTestCase <django.test.LiveServerTestCase>` do Django) o conteúdo estático precisa ser servido junto com o resto do conteúdo então o ambiente de teste reproduz o real tão fielmente quanto possível, mas ``LiveServeTestCase`` tem somente funcionalidades de servidor de arquivos muito básicas. Ele não sabe sobre as caraceterísticas de procura da aplicação ``staticfiles`` e assume que o conteúdo estático já tenha sido coletado pelo :setting:`STATIC_ROOT`.
zh_hans: 运行使用真实 HTTP 请求（而不是内置的测试客户端，即内置的 :class:`LiveServerTestCase <django.test.LiveServerTestCase>`）的测试用例时，静态资源要与剩余内容分别提供服务，这样，测试环境才能尽量重现真实的问题。但 ``LiveServerTestCase`` 只拥有非常基本的为静态文件提供服务的能力：它并不知道 ``staticfiles`` 应用的查找功能，且总是假设静态内容已被收集至 :setting:`STATIC_ROOT` 目录下。

source: Because of this, ``staticfiles`` ships its own :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, a subclass of the built-in one that has the ability to transparently serve all the assets during execution of these tests in a way very similar to what we get at development time with ``DEBUG = True``, i.e. without having to collect them using :djadmin:`collectstatic` first.
it: A causa di ciò, ``staticfiles`` offre la propria :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, una sottoclasse di quella built-in che ha l'abilità di servire trasparentemente tutti gli asset durante l'esecuzione di questi test in modo molto simile a quello che si ottiene durante lo sviluppo con ``DEBUG = True``, cioè senza doverli collezionare usando prima :djadmin:`collectstatic`.
ja: このため、 ``staticfiles`` は独自の :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase` を同梱しています。これは組み込みのサブクラスで、開発時に ``DEBUG = True`` を指定した場合と非常によく似た方法で、つまり :djadmin:`collectstatic` を使って最初にアセットを収集することなく、テストの実行中にすべてのアセットを透過的に提供する機能を持っています。
ko: 이 때문에 "정적 파일"은 자체 클래스인 "django.contrib.static files.testing"을 제공합니다.StaticLiveServer TestCase'는 이러한 테스트를 실행하는 동안 모든 자산을 "DEBUG @ True"로 개발 시 얻은 것과 매우 유사한 방식으로 투명하게 처리할 수 있는 내장형 테스트 사례의 하위 클래스로서, 즉 "staticadmin:"collectstatic"을 먼저 사용할 필요가 없습니다.
pt_br: Por causa disso, ``staticfiles`` vem com sua própria :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`, uma subclasse daquela que vem embutida uma que tem a habilidade de servir de maneira transparente todos os ativos durante a execução destes testes de uma maneira similar a que temos em tempo de desenvovlimento com ``DEBUG = TRUE``, isto é, sem coletá-los usando antes o :djadmin:`collectstatic`.
zh_hans: 因此， ``staticfiles`` 自带了 :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`，这是一个内置子类，能够透明地以类似我们在开发阶段 ``DEBUG = True`` 时获得的方式为所有静态资源在测试期间提供服务。即无需先用 :djadmin:`collectstatic` 收集它们。

source: Deployment
ja: デプロイ
ko: 배치
pt_br: Implantação
zh_hans: 部署

source: :mod:`django.contrib.staticfiles` provides a convenience management command for gathering static files in a single directory so you can serve them easily.
it: :mod:`django.contrib.staticfiles` fornisce un comando di gestione comodo per la raccolta di file statici in un'unica directory in modo da poterli servire facilmente.
ja: :mod:`django.contrib.staticfiles` には、静的ファイルを単一のディレクトリに集約するための便利な管理コマンドがあり、静的ファイルを簡単に配信できます。
ko: :mod:'django.static files'는 정적 파일을 한 디렉토리로 수집하여 쉽게 제공할 수 있도록 편리한 관리 명령을 제공합니다.
pt_br: :mod:`django.contrib.staticfiles` fornece um comando de gerenciamento conveniente para juntar arquivos estáticos e um único diretório então você pode servi-los facilmente.
zh_hans: :mod:`django.contrib.staticfiles` 提供了一个便利的管理命令，用于将静态文件收集至独立目录，方便你为它们提供服务。

source: Set the :setting:`STATIC_ROOT` setting to the directory from which you'd like to serve these files, for example::
it: Imposta il valore di :setting:`STATIC_ROOT` alla directory da cui desideri servire questi file, ad esempio::
ja: :setting:`STATIC_ROOT` 設定で、どのディレクトリから静的ファイルを配信するかを指定します。たとえば:
ko: : setting:'을 설정합니다.STATIC_ROOT' 설정은 다음과 같이 이러한 파일을 제공할 디렉토리로 설정합니다.
pt_br: Defina a configuração do :setting:`STATIC_ROOT` para o diretorio do qual você gostaria de servir estes arquivos, por exemplo::
zh_hans: 将 :setting:`STATIC_ROOT` 配置成你喜欢的目录，在这个目录提供服务，例如::

source: Run the :djadmin:`collectstatic` management command:
ja: :djadmin:`collectstatic` 管理コマンドを実行します

source: This will copy all files from your static folders into the :setting:`STATIC_ROOT` directory.
it: Questo copia tutti i file dalla tua cartella static nella cartella definita in :setting:`STATIC_ROOT` .
ja: これにより、各 static フォルダから :setting:`STATIC_ROOT` のディレクトリにファイルがコピーされます。
ko: 그러면 정적 폴더의 모든 파일이 :seting:'로 복사됩니다.STATIC_ROOT' 디렉토리입니다.
pt_br: Isso irá copiar todos os arquivos dos diretórios "static" para dentro do diretório definido em :setting:`STATIC_ROOT`.
zh_hans: 这将会把静态目录下的所有文件拷贝至 :setting:`STATIC_ROOT` 目录。

source: Use a web server of your choice to serve the files. :doc:`/howto/static-files/deployment` covers some common deployment strategies for static files.
it: Utilizza un web server a tua scelta per distribuire i files. :doc:`/howto/static-files/deployment` copre alcune delle strategie di distribuzione comuni per i file statici.
ja: お好みのWebサーバーを使用してファイルを配信してください。:doc:`/howto/static-files/deployment` では、静的ファイルの一般的なデプロイ戦略をいくつか紹介しています。
ko: 선택한 웹 서버를 사용하여 파일을 제공합니다. :doc:'/how to/static files/deployment'에서는 정적 파일에 대한 몇 가지 일반적인 배포 전략을 다룹니다.
pt_br: Use um servidor Web de sua escolha para servir os arquivos. O :doc:`/howto/static-files/deployment` cobre algumas estratégias de implantações comuns para arquivos estáticos.
zh_hans: 选一个 Web 服务器为这些文件提供服务。 文档 :doc:`/howto/static-files/deployment` 介绍了静态文件的常见部署策略。

source: This document has covered the basics and some common usage patterns. For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
it: Questo documento ha coperto le basi ed alcuni pattern di utilizzo comuni. Per avere dettagli completi su tutte le impostazioni, i comandi, i tag di template ed altri frammenti inclusi in :mod:`django.contrib.staticfiles`, visita :doc:`la guida di riferimento di staticfiles </ref/contrib/staticfiles>`.
ja: このドキュメントでは、基本および一般的な利用パターンを紹介しました。:mod:`django.contrib.staticfiles` に含まれるすべての設定、コマンド、テンプレートタグ、およびその他の事項に関する網羅的な詳細は、:doc:`staticfiles のリファレンス </ref/contrib/staticfiles>` を参照してください。
ko: 이 문서에서는 기본 사항 및 몇 가지 일반적인 사용 패턴을 다룹니다. :mod:'django.contrib.static files'에 포함된 모든 설정, 명령, 템플릿 태그 및 기타 항목에 대한 자세한 내용은 :doc:'static files reference'를 참조하십시오.
pt_br: Este documento cobriu o básico e alguns padrões de uso comum. Para detalhes completos sobre todas as configurações, comandos, tags de templates, e outras partes incluídas em :mod:`django.contrib.staticfiles`, veja a :doc:`referência de arquivos estáticos </ref/contrib/staticfiles>`.
zh_hans: 本文档已覆盖基础和常见模式。对于所有配置项，命令，模板标签和其他包含在 :mod:`django.contrib.staticfiles` 碎片的全部细节，参考 :doc:`静态文件参考 </ref/contrib/staticfiles>`。

source: How to upgrade Django to a newer version
it: Come aggiornare Django ad una nuova versione
ja: Django の新しいバージョンへの更新

source: While it can be a complex process at times, upgrading to the latest Django version has several benefits:
it: Mentre può essere a volte un processo complesso, aggiornare all'ultima versione di Django ha alcuni benefici:
ja: 時には更新作業は複雑な手順になってしまうことがありますが、Django の最新版に更新すると、以下ような恩恵が受けられます。
ko: 때로는 복잡한 프로세스일 수도 있지만 최신 Django 버전으로 업그레이드하면 다음과 같은 여러 가지 이점이 있습니다.
pt_br: Enquanto que isso pode ser as vezes um processo complexo, atualizar a versão do Django tem muitos benefícios:
zh_hans: 虽然有时是个复杂的过程，将 Django 升级到最新版有以下好处：

source: New features and improvements are added.
it: Nuove features e miglioramenti sono aggiunti
ja: 新しい機能や改善点が追加される。
ko: 새로운 기능과 향상된 기능이 추가되었습니다.
pt_br: Novas características e melhorias são adicionadas.
zh_hans: 新功能和优化

source: Bugs are fixed.
it: Bugs e fix.
ja: バグが修正される。
ko: 버그 수정되었습니다.
pt_br: Erros são ajustados.
zh_hans: 已修复的 bug。

source: Older version of Django will eventually no longer receive security updates. (see :ref:`supported-versions-policy`).
it: La versione precedente di Django potrebbe non ricevere più aggiornamenti di sicurezza. (vedi :ref:`supported-versions-policy`).
ja: 古いバージョンの Django はいずれセキュリティアップデートを受けられなくなります。(:ref:`supported-versions-policy` を参照してください)
ko: 이전 버전의 Django는 결국 더 이상 보안 업데이트를 받지 않습니다. (ref:'지원-포함-정책' 참조)
zh_hans: 旧版 Django 最终将不再收到安全更新。（参考 :ref:`supported-versions-policy`）
