Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The :doc:`model reference </topics/db/models>` documentation explains how to use Django's standard field classes -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, etc. For many purposes, those classes are all you'll need. Sometimes, though, the Django version won't meet your precise requirements, or you'll want to use a field that is entirely different from those shipped with Django.
it: La documentazione :doc:`model reference </topics/db/models>` spiega come usare i campi delle classi standard di Django -- :class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, ecc. La maggior parte delle volte, queste classi sono tutto ciò di cui hai bisogno. A volte, però, la versione di Django non incontrerà precisamente i tuoi requisiti o vorrai usare un campo che è totalmente differente da quelli che sono forniti con Django.
ja: :doc:`モデルリファレンス </topics/db/models>` ドキュメントでは、Djangoの標準フィールドクラスである、 :class:`~django.db.models.CharField` や、 :class:`~django.db.models.DateField` などの使い方を説明しています。多くの場合、これらのクラスがあれば十分です。ただし、Djangoのバージョンが正確な要件を満たしていない場合や、Djangoに同梱されているものとはまったく異なるフィールドを使用したい場合があります。
ko: :doc:'model reference' 설명서는 Django의 표준 필드 클래스 --:class:'~django.db.db.know.CharField', :class:'~django.db.db.know.날짜 필드' 등 여러 가지 목적으로, 그 수업들이 여러분에게 필요한 전부입니다. 하지만 때로는 Django 버전이 사용자의 정확한 요구 사항을 충족하지 못하거나 Django와 함께 제공된 필드와는 완전히 다른 필드를 사용하고자 할 수 있습니다.
pt_br: A documentação :doc:`referência de modelo </topics/db/models>` explica como usar as classes de campo padrão do Django --:class:`~django.db.models.CharField`, :class:`~django.db.models.DateField`, etc. Para muitos propósitos, essas classes são tudo o que você precisará. Às vezes, porém, a versão Django não vai atender às suas necessidades específicas, ou você vai querer usar um campo que é totalmente diferente daqueles fornecidos com Django.
zh_hans: :doc:`字段参考 </topics/db/models>` 文档介绍了如何使用 Django 的标准字段类—— :class:`~django.db.models.CharField`， :class:`~django.db.models.DateField`，等等。大多数情况下，这些类就是你需要的。虽然有时候，Django 的版本不能精确地匹配你的需求，或者你想使用的字段与 Django 内置的完全不同。

source: Django's built-in field types don't cover every possible database column type -- only the common types, such as ``VARCHAR`` and ``INTEGER``. For more obscure column types, such as geographic polygons or even user-created types such as `PostgreSQL custom types`_, you can define your own Django ``Field`` subclasses.
it: I tipi di campi built-in di Django non coprono ogni possibile tipologia di colonna di database -- sono i tipi più comuni, come ``VARCHAR`` e ``INTEGER``. Per tipi di colonne più oscuri, come poligoni geografici o anche tipi creati dall'utente come i `PostgreSQL custom types`_, puoi definire le tue sottoclassi di Django ``Field``.
ja: Django の組み込みフィールド型は、データベースで利用可能な全てのカラム型をカバーしているわけではなく、 ``VARCHAR`` や ``INTEGER`` のような一般的な型のみに対応しています。地理的な多角形や `PostgreSQL カスタム型`_ のようなユーザが作成した型など、より曖昧なカラム型については、独自の Django ``Field`` サブクラスを定義することができます。
ko: django의 내장형 필드에는 "VARCHAR"과 "INTER"와 같은 일반적인 유형의 데이터베이스 열만 포함하지는 않으며 지리적 다각형이나 사용자가 만든 포스트그레그 등 사용자가 만든 열 유형도 포함된다.SQL custom type은 _ __ 사용자 고유의 "Field" 하위 클래스를 정의할 수 있다.
pt_br: Os tipos de campos embutidos no Django não cobrem todas os possíveis tipos de colunas do banco de dados -- somente os tipos comuns, tais como ``VARCHAR``e `ÌNTEGER``. Para tipos de colunas mais obscuros, tal como polígonos geográficos ou ainda tipos criados pelo usuário como `PostgreSQL custom Types`__, é possível definir sua própria subclasse de ``Field`` do Django.
zh_hans: Django 内置的字段类型并未覆盖所有可能的数据库字段类型——只有常见的类型，例如 ``VARCHAR`` 和 ``INTEGER``。对于更多模糊的列类型，例如地理多边形（geographic polygons），甚至是用户创建的类型，例如 `PostgreSQL custom types`_，你可以自定义 Django 的 ``Field`` 子类。

source: Alternatively, you may have a complex Python object that can somehow be serialized to fit into a standard database column type. This is another case where a ``Field`` subclass will help you use your object with your models.
it: Alternativamente, puoi avere un oggetto Python complesso che può essere serializzato in qualche modo per essere accolto in un tipo di colonna standard di database. Questo è un ulteriore caso in cui una sottoclasse di ``Field`` ti aiuterà ad usare il tuo oggetto con i tuoi modelli.
ja: あるいは、複雑な Python オブジェクトを、標準的なデータベースのカラム型に合うようにシリアライズすることもできます。これもまた、``Field`` サブクラスがオブジェクトをモデルで使用するのに役立つケースです。
ko: 또한, 표준 데이터베이스 열 유형에 맞게 직렬화할 수 있는 복잡한 Python 개체가 있을 수 있습니다. 이것은 ``필드" 서브클래스가 당신의 객체를 당신의 모델과 함께 사용하는 데 도움을 줄 또 다른 경우이다.
pt_br: Por outro lado, pode haver um tipo complexo de objeto no Python que pode de alguma maneira ser serializado para que se encaixe em um tipo de coluna padrão no banco de dados. Este é um outro caso onde uma subclasse de ``Field`` pode ajudar a utilizar o objeto com o "models".
zh_hans: 或者，你有一个复杂的 Python 对象，它可以以某种形式序列化，适应标准的数据库列类型。这是另一个 ``Field`` 子类能帮助你配合模型使用你的对象的示例。

source: Our example object
it: Il nostro oggetto di esempio
ja: 私たちのサンプルオブジェクト
ko: 우리의 예제 객체
pt_br: Nosso objeto de exemplo
zh_hans: 我们的示例对象

source: Creating custom fields requires a bit of attention to detail. To make things easier to follow, we'll use a consistent example throughout this document: wrapping a Python object representing the deal of cards in a hand of Bridge_. Don't worry, you don't have to know how to play Bridge to follow this example. You only need to know that 52 cards are dealt out equally to four players, who are traditionally called *north*, *east*, *south* and *west*. Our class looks something like this::
it: Creare campi personalizzati richiede un po' di attenzione ai dettagli. Per rendere le cose più facili, in questo documento useremo un esempio consistente: avvolgere un oggetto Python che rappresenta il mazzo di carte in una mano di Bridge_. Non preoccuparti, non è necessario che tu sappia come giocare a Bridge per seguire questo esempio. Devi sono sapere che 52 carte sono ripartite ugualmente per quattro giocatori, che sono tradizionalmente chiamati *nord*, *est*, *sud* e *ovest*. La nostra classe è fatta più o meno così::
ja: カスタムフィールドを作成するには、細部に少し注意する必要があります。わかりやすくなるように、このドキュメントでは「ブリッジ Bridge_ の手札のやり取りを表すPythonオブジェクトの実装」を一貫した例として説明することにします。なお、この実装例を理解するために、ブリッジのプレイルールを理解する必要はありません。52枚のカードが、伝統的に *北* 、 *東* 、 *南* および *西* と呼ばれる4人のプレイヤーに均等に配られることだけを覚えておいてください。クラスは以下のように実装します:
ko: 사용자 지정 필드를 만들려면 세부 정보에 약간 주의를 기울여야 합니다. 이 문서에서는 Bridge_의 손에서 카드 거래를 나타내는 Python 개체를 감싸는 일관된 예를 보여드리겠습니다. 걱정하지 마세요, 이 예를 따르기 위해 브리지 게임을 하는 방법을 알 필요는 없어요. 52장의 카드가 전통적으로 *north*, *east*, *south* 및 *west*라고 불리는 네 명의 플레이어에 동일하게 배포된다는 것만 알면 됩니다. 저희 클래스는 다음과 같습니다.
pt_br: Criar campos personalizados requer um pouco de atenção. Para que seja mais fácil de acompanhar, usaremos um exemplo consistente através desta documentação: um objeto Python que represente a coleção de cartas de uma mão de Bridge_. Não se preocupe, não é necessário saber como jogar Bridge para entender o exemplo. É necessário saber que 52 cartas são distribuídas igualmente para 4 jogadores, os quais são tradicionalmente chamados *north* (norte), *east* (leste), *south* (sul) and *west* (oeste). Nossa classe se parece com isso::
zh_hans: 创建自定义字段要求注意一些细节。为了简化问题，我们在本文档中全程使用同一实例：封装一个 Python 对象，代表手上 桥牌_ 的细节。不要担心，你不需要知道如何玩桥牌就能学习此例子。你只需知道 52 张牌被均分给 4 个玩家，一般称他们 *北*，*东*，*南* 和 *西*。我们的类长这样::

source: This is an ordinary Python class, with nothing Django-specific about it. We'd like to be able to do things like this in our models (we assume the ``hand`` attribute on the model is an instance of ``Hand``)::
it: Questa è una classe Python ordinaria, senza niente che sia specifico di Django. Ci piacerebbe fare cose come questa nel nostro modello (assumiamo che l'attributo "hand" sul modello sia istanza di ``Hand``)::
ja: これはDjangoの仕様を使っていない、普通のPythonクラスです。モデルでこれと同じようなことを実行できるようにしたいと思います（モデルの中の ``hand`` 属性は ``Hand`` インスタンスだと想定しています）
ko: 이것은 Django 특유의 것이 없는 평범한 Python 클래스이다. 우리는 우리의 모델에서 이와 같은 것을 할 수 있기를 원한다(우리는 모델의 "hand" 속성은 "hand"의 예라고 가정한다.)::

source: We assign to and retrieve from the ``hand`` attribute in our model just like any other Python class. The trick is to tell Django how to handle saving and loading such an object.
it: Assegniamo e ritiriamo l'attributo ``hand`` nel nostro modello proprio come qualsiasi altra classe Python. Il trucco è dire a Django come gestire il salvataggio ed il caricamento su e da questo oggetto.
ja: 他のPythonクラスと同様に、モデルの ``hand`` 属性に割り当てたり、そこから取得したりします。コツは、そのようなオブジェクトの保存と読み込みの処理方法をDjangoに伝えることです。
ko: "우리는 다른 파이썬 클래스처럼 우리 모델의 "손" 속성에 할당하고 이를 조회한다. 요령은 Django에게 그러한 객체를 저장하고 적재하는 방법을 알려주는 것이다.
pt_br: Atribuimos ou lemos o valor do atributo ``hand`` no nosso modelo como em qualquer outra classe Python. Este truque é para dizer ao Django como manipular a gravação e a leitura como um objeto.
zh_hans: 对模型中的 ``hand`` 属性的赋值与取值操作与其它 Python 类一直。技巧是告诉 Django 如何保存和加载对象。

source: In order to use the ``Hand`` class in our models, we **do not** have to change this class at all. This is ideal, because it means you can easily write model support for existing classes where you cannot change the source code.
it: Per usare la classe ``Hand`` nei nostri models, *non* dobbiamo cambiare assolutamente la classe. Questo è l'ideale, perchè significa che puoi scrivere facilmente modelli che supportano classi esistenti dove non puoi cambiare il codice sorgente.
ja: モデルで ``Hand`` クラスを使用するために、**このクラスを変更する必要はありません**。 これは、ソースコードを変更できない既存のクラスのモデルサポートを簡単に記述できるため、理想的です。
ko: 모델에서 "Hand" 클래스를 사용하기 위해서는 이 클래스를 전혀 변경할 필요가 없다. 소스 코드를 변경할 수 없는 기존 클래스에 대한 모델 지원을 쉽게 작성할 수 있으므로 이상적입니다.
pt_br: Para utilizar a classe ``Hand`` em nossos modelos, nós **não** precisamos alterar essa classe em nada. Isso é ideal, porque quer dizer que podemos facilmente escrever modelos de suporte para classes existentes cujo o código fonte não pode ser alterado.
zh_hans: 为了在模型中使用 ``Hand`` 类，我们 **不** 需要修改这个类。这很不错，因为这以为着你仅需为已存在的类编写模型支持，即便你不能修改源码。

source: You might only be wanting to take advantage of custom database column types and deal with the data as standard Python types in your models; strings, or floats, for example. This case is similar to our ``Hand`` example and we'll note any differences as we go along.
it: Potresti anche solo voler trarre vantaggio dai tipi custom per le colonne di database ed avere a che fare con i dati come tipi standard di Python nei modelli; stringhe o float, per esempio. Questo caso è simile al nostro esempio ``Hand`` e terremo nota delle differenze andando avanti.
ja: 例えば文字列や浮動小数点数のような、Pythonの標準的な型としてカスタムデータベースのカラム型を扱い、データを利用したいこともあります。このケースは ``Hand`` の例と似ているので、違いを後で説明することにします。
ko: 사용자 지정 데이터베이스 열 유형을 활용하고 데이터를 모델에서 표준 Python 유형으로 처리(예: 문자열 또는 부동)하는 것이 좋습니다. 이번 사건은 우리의 ``Hand" 사례와 유사하며 우리는 진행하면서 어떤 차이도 주목하게 될 것이다.
pt_br: Você pode estar querendo tirar vantagem dos tipos customizados de colunas de banco de dados e lidar com o dado como um tipo de dado Python padrão nos seus modelos; Este caso é similar ao nosso exemplo ``Hand`` e iremos explicitar qualquer diferença enquanto continuamos.
zh_hans: 你可能只想要自定义数据库列的优点，并在模型中像使用标准 Python 那样；字符串，或浮点数，等等。这种情况与 ``Hand`` 例子类似，在进行过程中，我们将注意到差异。

source: Background theory
it: Teoria di Background
ja: 背景理論
ko: 배경설
pt_br: A teoria por trás.
zh_hans: 背后的理论

source: Database storage
it: Stoccaggio DB
ja: データベースストレージ
ko: 데이터베이스 저장
pt_br: Armazenamento no Banco de Dados.
zh_hans: 数据库存储

source: Let's start with model fields. If you break it down, a model field provides a way to take a normal Python object -- string, boolean, ``datetime``, or something more complex like ``Hand`` -- and convert it to and from a format that is useful when dealing with the database. (Such a format is also useful for serialization, but as we'll see later, that is easier once you have the database side under control).
it: Cominciamo con i campi di model. Se lo riduci ai minimi termini, un campo model offre un modo di prendere un normale oggetto Python -- stringa, booleano, ``datetime`` or qualcosa di più complesso come ``Hand`` -- e convertirlo a e da un formato che è utile quando si ha a che fare con il database. (Questo formato è anche utile per la serializzazione ma, come vedremo più tardi, è una cosa facile una volta che hai sotto controllo il database).
ja: モデルフィールドから始めましょう。分解すると、モデルフィールドは通常のPythonオブジェクト（文字列、ブール値、 ``datetime`` 、あるいは ``Hand`` のような複雑なもの）を、データベースを扱うときに便利な形式に変換する方法を提供します。(このような形式はシリアライズの際にも便利ですが、後で説明するように、データベース側を制御できるようになれば、その方が簡単です)。
ko: 먼저 모델 필드부터 살펴보겠습니다. 이를 세분화하면 모델 필드는 문자열, 부울, "datetime" 또는 "hand"와 같은 일반적인 Python 개체를 가져와서 데이터베이스를 처리할 때 유용한 형식으로 변환하거나 변환하는 방법을 제공한다. (이러한 형식은 직렬화에도 유용하지만 나중에 볼 수 있듯이 데이터베이스를 제어하면 더 쉽습니다.)

source: Fields in a model must somehow be converted to fit into an existing database column type. Different databases provide different sets of valid column types, but the rule is still the same: those are the only types you have to work with. Anything you want to store in the database must fit into one of those types.
it: I campi di un modello devono in qualche modo essere convertiti per stare in un tipo esistente di colonna di database. Diversi database offrono diversi set di tipi di colonna validi ma la regola è sempre la stessa: sono gli unici tipi con cui puoi lavorare. Qualsiasi cosa tu voglia scrivere sul database, deve poter essere rappresentato con quei tipi.
ja: モデルのフィールドは、既存のデータベースのカラムの型に適合するように何らかの方法で変換されなければなりません。データベースによって有効なカラム型のセットは異なりますが、利用できる型が決まっているという決まりは同じです。データベースに保存したいものはすべて、これらの型のいずれかに適合しなければなりません。
ko: 모델의 필드는 기존 데이터베이스 열 유형에 맞게 변환되어야 합니다. 데이터베이스마다 서로 다른 유효한 열 유형 집합을 제공하지만 규칙은 여전히 동일합니다. 즉, 이러한 유형만 사용해야 합니다. 데이터베이스에 저장할 항목은 해당 유형 중 하나에 포함되어야 합니다.
pt_br: Campos em um modelo devem ser de alguma maneira convertidos para que se encaixem em um tipo de coluna de banco de dados já existente. Bancos de dados diferentes provêem diferentes tipos de colunas, mas a regra ainda é a mesma: aqueles são os únicos dados que se tem para trabalhar. Qualquer coisa que se queira guardar em um banco de dados deve se encaixar em um daqueles tipos.
zh_hans: 模型中的字段必须能以某种方式转换为已存在的数据库列类型。不能的数据库提供不同的可用列类型集，但规则仍相同：你只需要处理这些类型。你想存在数据库中的任何数据都必须能适配这些类型中的某一个。

source: Normally, you're either writing a Django field to match a particular database column type, or you will need a way to convert your data to, say, a string.
it: Normalmente, stai scrivendo un campo Django che sia consono per uno dei tipi di colonna del database oppure ti servirà un modo di convertire i tuoi dati, per dire, in una stringa.
ja: 通常、特定のデータベースの列タイプに一致するようにDjangoフィールドを作成するか、データを文字列などに変換する方法が必要になります。
ko: 일반적으로 특정 데이터베이스 열 유형과 일치하는 Django 필드를 작성하거나 데이터를 문자열로 변환하는 방법이 필요합니다.

source: For our ``Hand`` example, we could convert the card data to a string of 104 characters by concatenating all the cards together in a predetermined order -- say, all the *north* cards first, then the *east*, *south* and *west* cards. So ``Hand`` objects can be saved to text or character columns in the database.
it: Per il nostro esempio ``Hand``, potremmo convertire i dati della carta in una stringa di 104 caratteri concatenando tutte le carte insieme in un ordine predeterminato -- diciamo, prima tutte le carte *nord*, poi *est*, * carte sud* e *ovest*. In questo modo gli oggetti ``Hand`` possono essere salvati in colonne testuali o di caratteri nel database.
ja: ``Hand`` の例では、すべてのカードをあらかじめ決められた順序で連結することで、カードデータを104文字の文字列に変換できます。たとえば、すべての *北* カード、次に *東* 、 *南* および *西* カードです。 したがって、``Hand`` オブジェクトをデータベースのテキストまたは文字列に保存できます。

source: What does a field class do?
it: Cosa fa una classe di campo?
ja: フィールドクラスが行うこと
ko: 필드클래스가 무엇을 하나요?
pt_br: O que uma classe campo faz?
zh_hans: 一个字段(Field)类做了什么？

source: All of Django's fields (and when we say *fields* in this document, we always mean model fields and not :doc:`form fields </ref/forms/fields>`) are subclasses of :class:`django.db.models.Field`. Most of the information that Django records about a field is common to all fields -- name, help text, uniqueness and so forth. Storing all that information is handled by ``Field``. We'll get into the precise details of what ``Field`` can do later on; for now, suffice it to say that everything descends from ``Field`` and then customizes key pieces of the class behavior.
it: Tutti i campi Django (e quando parliamo di *campi* in questo documento, intendiamo sempre campi del modello e non :doc:`form fields </ref/forms/fields>`) sono sottoclassi di :class:`django.db.models.Field`. La maggior parte delle informazioni che Django registra su un campo sono comuni per tutti i campi -- nome, testo di aiuto, unicità e così via. La registrazione di tutte quelle informazioni è gestita da ``Field``. Ci addentreremo nei dettagli di ciò che ``Field`` può fare più tardi; per ora, è sufficiente dire che ogni cosa discende da ``Field`` e poi personalizza pezzi chiave del comportamento della classe.
ja: Djangoのすべてのフィールド（およびこのドキュメントで *フィールド (Field)* と言うときは、常に :doc:`フォームフィールド </ref/forms/fields>` ではなくモデルフィールドを意味します）は :class:`django.db.models.Field` のサブクラスです。 Django がフィールドについて記録する情報のほとんどは、名前、ヘルプテキスト、一意性など、すべてのフィールドに共通です。すべての情報の保存は ``Field`` によって処理されます。``Field`` ができることの詳細については、後で詳しく説明します。とりあえず、すべてが ``Field`` から派生し、クラスの動作の重要な部分をカスタマイズすると言うだけで十分です。
ko: Django의 모든 필드(그리고 이 문서에서 *fields*라고 말할 때, 우리는 항상 모델 필드를 의미하며 :doc:'form fields'가 아님)는 :class:'django.db.models의 하위 클래스이다. Django가 필드에 대해 기록하는 대부분의 정보는 이름, 도움말 텍스트, 고유성 등 모든 필드에 공통적입니다. 그 모든 정보를 저장하는 일은 ``Field`"가 담당한다. 우리는 ``Field`"가 나중에 무엇을 할 수 있는지 자세히 알아볼 것이다. 현재로서는 모든 것이 ``Field`"에서 비롯되었다고 말하고 나서 계급 행동의 핵심 부분을 맞춤화한다고만 말해도 충분하다.
pt_br: Todos os campos do Django (e quando dizemos *campo* neste documento, sempre queremos dizer campos do modelo e não :doc:`campos de forms </ref/forms/fields>`) são subclasses de :class:`django.db.models.Field`. A maioria das informações que o Django registra sobre um campo é comum a todos os campos --name, help text, uniqueness e por diante. Armazenar toda essa informação é papel de ``Field``. Iremos entrar em detalhes precisos do que o ``Field`` pode fazer mais tarde; por agora, basta dizer que tudo descende de ``Field`` e então customizamos partes chaves do comportamento da classe.
zh_hans: 所有的 Django 字段（本页提到的 *字段* 均指模型字段，而不是 :doc:`表单字段 </ref/forms/fields>`）都是 :class:`django.db.models.Field` 的子类。对于所有字段，Django 记录的大部分信息是一样的——名字，帮助文本，是否唯一，等等。存储行为由 ``Field`` 处理。稍后，我们会深入了解 ``Field`` 能做什么；现在， 可以说万物源于 ``Field``，并在其基础上自定义了类的关键行为。

source: It's important to realize that a Django field class is not what is stored in your model attributes. The model attributes contain normal Python objects. The field classes you define in a model are actually stored in the ``Meta`` class when the model class is created (the precise details of how this is done are unimportant here). This is because the field classes aren't necessary when you're just creating and modifying attributes. Instead, they provide the machinery for converting between the attribute value and what is stored in the database or sent to the :doc:`serializer </topics/serialization>`.
it: E' importante capire che una classe per un campo di Django non è quel che è salvato negli attributi del model. Gli attributi del model contengono oggetti Python normali. Le classi per i campi che definisci in un model sono salvati nella classe ``Meta`` quando la classe del model viene creata (i dettagli precisi di come questo avvenga ora non sono importanti). Questo accade perchè le classi dei campi non sono necessarie quando stai creando o modificando attributi. Invece, offrono i meccanismi per convertire il valore dell'attributo in quel che viene salvato sul database o mandato al :doc:`serializzatore</topics/serialization>`.
ja: Djangoフィールドクラスは、モデル属性に格納されているものではないことを理解することが重要です。 モデル属性には通常のPythonオブジェクトが含まれます。 モデルで定義するフィールドクラスは、モデルクラスが作成されるときに実際に ``Meta`` クラスに保存されます（これを行う方法の正確な詳細はここでは重要ではありません）。 これは、属性を作成および変更するだけの場合、フィールドクラスは必要ないためです。 代わりに、属性値とデータベースに保存されているもの、または :doc:`シリアライザ </topics/serialization>` に送信されるものとの間で変換するための機構を提供します。
ko: Django 필드 클래스는 모델 속성에 저장된 클래스가 아닙니다. 모델 속성은 일반 Python 개체를 포함합니다. 사용자가 모델에 정의한 필드 클래스는 모델 클래스가 생성될 때 "메타" 클래스에 저장됩니다(여기서는 자세한 작업 내용이 중요하지 않음). 그 이유는 속성을 만들고 수정할 때는 필드 클래스가 필요하지 않기 때문입니다. 대신, 그들은 속성 값과 데이터베이스에 저장되거나 :doc:'serializer'로 전송되는 것 사이에서 변환하는 기계를 제공한다.
pt_br: É importante dizer que a classe de campo do Django não é o que é armazenado no seus atributos do modelo. Os atributos dos modelos contém objetos Python normais. As classes de campo que são definidas em um modelo são na verdade armazenadas dentro da classe ``Meta`` quando a classe é criada (os detalhes precisos de como isso é feito são importantes aqui). Isso é porque as classes de campos não são necessárias enquanto se está modificando atributos. Na verdade, eles fornecem o maquinário para conversão entre o valor do atributo e o que é armazenado no banco de dados ou enviado para o :doc:`serializador </topics/serialization>`.
zh_hans: 了解 Django 字段类不保存在模型属性中很重要。模型属性包含普通的 Python 对象。你所以定义的字段类实际上在模型类创建时在 ``Meta`` 类中（这是如何实现的在这里不重要）。这是因为在仅创建和修改属性时，字段类不是必须的。相反，他们提供了属性值间转换的机制，并决定了什么被存入数据库或发送给 :doc:`序列化器 </topics/serialization>`。

source: Keep this in mind when creating your own custom fields. The Django ``Field`` subclass you write provides the machinery for converting between your Python instances and the database/serializer values in various ways (there are differences between storing a value and using a value for lookups, for example). If this sounds a bit tricky, don't worry -- it will become clearer in the examples below. Just remember that you will often end up creating two classes when you want a custom field:
it: Tieni a mente questo quando crei i tuoi campi personalizzati. La sottoclasse ``Field`` di Django che scrivi offre i meccanismi per la conversione tra le tue istanze di Python ed i valori del database/serializzatore in diversi modi (ci sono differenze tra salvare un valore ed usarlo per un lookup, per esempio). Se ti sembra un po' complicato, non preoccuparti -- diverrà più chiaro negli esempi che seguono. Ricordati solo che finirai spesso a creare due classi quando vuoi un campo personalizzato:
ja: 独自のカスタムフィールドを作成する場合は、このことに留意してください。 作成するDjangoの ``Field`` サブクラスは、Pythonインスタンスとデータベース/シリアライザーの値をさまざまな方法で変換するための機構を提供します（たとえば、値の保存とルックアップでの値の使用には違いがあります）。 これが少しトリッキーに聞こえる場合でも、心配しないでください。以下の例で明らかになります。 カスタムフィールドが必要な場合、しばしば2つのクラスを作成することになります:
ko: 사용자 정의 필드를 작성할 때 이 점을 유념하십시오. 작성하는 Django "Field" 하위 클래스는 다양한 방법으로 Python 인스턴스와 데이터베이스/시리얼라이저 값을 변환하는 기계를 제공합니다(예를 들어 값을 저장하는 것과 룩업에 값을 사용하는 것 사이에는 차이점이 있음). 만약 이것이 좀 까다롭게 들린다면, 걱정하지 마세요. 아래의 예에서 더 명확해질 것입니다. 사용자 지정 필드를 원할 때 두 개의 클래스를 만드는 경우가 많습니다.
pt_br: Tenha isso em mente ao criar seus próprios campos. A subclasse ``Field`` do Django que você escreve provê o maquinário para conversão entre suas instancias Python e os valores do banco de dados/serializador de várias maneiras (existe uma diferença entre armazenar um valor e usar um valor para lookups por exemplo). Se isso lhe soa um pouco confuso, não se preocupe -- se tornará claro no exemplo abaixo. Mas lembre que muitas vezes acabará por criar duas classes quando quiser um campo personalizado:
zh_hans: 在你创建自定义字段时牢记这点。你所写的 Django 的 ``Field`` 子类提供了多种在 Python 实例和数据库/序列化器之间的转换机制（比如，保存值和使用值进行查询之间是不同的）。听起来有点迷糊，但别担心——通过以下的例子会清晰起来。只要记住，在你需要一个自定义字段时，只需创建两个类：
