Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: This should not be done for POST forms that target external URLs, since that would cause the CSRF token to be leaked, leading to a vulnerability.
it: Questo non si dovrebbe fare per i form POST che hanno come destinazione URL esterne, perchè questo esporrebbe il token CSRF, aprendo una vulnerabilità.
ja: この方法は、外部の URL を対象にする POST フォームで使ってはいけません。CSRF トークンが外部に漏れ、脆弱性の原因となります。

source: In the corresponding view functions, ensure that :class:`~django.template.RequestContext` is used to render the response so that ``{% csrf_token %}`` will work properly. If you're using the :func:`~django.shortcuts.render` function, generic views, or contrib apps, you are covered already since these all use ``RequestContext``.
it: Nelle funzioni di view corrispondenti, assicurati che venga utilizzato :class:`~django.template.RequestContext` per fare render della response così che ``{% csrf_token %}`` funzioni correttamente. Se stai usando la funzione :func:`~django.shortcuts.render`, view generiche o app contrib, se già coperto perchè usano già tutte ``RequestContext``.
ja: 対応するビュー関数では、``{% csrf_token %}`` が正しく機能するように、レスポンスをレンダリングする際に :class:`~django.template.RequestContext` が使用されていることを確認してください。 :func:`~django.shortcuts.render` 関数、ジェネリックビュー、または contrib アプリを使用している場合は、これらはすべて ``RequestContext`` を使用しているため、すでに対応しています。

source: Using CSRF protection with AJAX
it: Utilizzare la protezione CSRF con AJAX
ja: AJAXでCSRF保護を利用する

source: While the above method can be used for AJAX POST requests, it has some inconveniences: you have to remember to pass the CSRF token in as POST data with every POST request. For this reason, there is an alternative method: on each XMLHttpRequest, set a custom ``X-CSRFToken`` header (as specified by the :setting:`CSRF_HEADER_NAME` setting) to the value of the CSRF token. This is often easier because many JavaScript frameworks provide hooks that allow headers to be set on every request.
it: Anche se il metodo di cui sopra può essere utilizzato per le richieste AJAX POST, pone qualche inconveniente: devi ricordare di passare il token CSRF con i dati POST ad ogni richiesta POST. Per questo, esiste un metodo alternativo: in ogni XMLHttpRequest, imposta un header personalizzato ``X-CSRFToken`` (come specificato nell'impostazione :setting:`CSRF_HEADER_NAME`) con il valore del token CSFR. Spesso questo è più semplice, perchè molti framework Javascript offrono hooks che permettono di impostare le intestazioni per ogni richiesta.
ja: 上記の方法は AJAX の POST でも利用可能ですが、多少不便です。すべての POST リクエストで、CSRF トークンを POST するデータに忘れずに含めなければなりません。そのため、別の方法が用意されており、各 XMLHttpRequest に対して、``X-CSRFToken`` という独自ヘッダーに CSRF トークンの値を設定することができます (:setting:`CSRF_HEADER_NAME` 設定でヘッダー名が指定できます)。多くの JavaScript のフレームワークはすべてのリクエストについて、指定したヘッダーを設定するようなフック機能を提供しているので、普通は簡単に設定できます。

source: First, you must get the CSRF token. How to do that depends on whether or not the :setting:`CSRF_USE_SESSIONS` and :setting:`CSRF_COOKIE_HTTPONLY` settings are enabled.
it: Prima di tutto, devi ottenere il token CSRF. Come ottenerlo dipende dal fatto che siano abilitate o meno le impostazioni :setting:`CSRF_USE_SESSIONS` e :setting:`CSRF_COOKIE_HTTPONLY` .
ja: まず、CSRFトークンを取得する必要があります。これは、:setting:`CSRF_USE_SESSIONS` と :setting:`CSRF_COOKIE_HTTPONLY` の設定が有効になっているかどうかによって異なります。

source: Acquiring the token if :setting:`CSRF_USE_SESSIONS` and :setting:`CSRF_COOKIE_HTTPONLY` are ``False``
it: Acquisire il token se :setting:`CSRF_USE_SESSIONS` e :setting:`CSRF_COOKIE_HTTPONLY` sono ``False``
ja: :setting:`CSRF_USE_SESSIONS` と :setting:`CSRF_COOKIE_HTTPONLY` が ``False`` に設定されている場合にトークンを取得する

source: The recommended source for the token is the ``csrftoken`` cookie, which will be set if you've enabled CSRF protection for your views as outlined above.
it: La fonte raccomandata dalla quale prendere il token è il cookie ``csrftoken``, che sarà impostato se hai abilitato la protezione CSRF per le tue view come delinato precedentemente.
ja: トークン取得のソースとして推奨されるのは ``csrftoken`` クッキーです。これは、上記で概説したようにビューに対する CSRF 保護を有効化した場合にセットされます。

source: The CSRF token cookie is named ``csrftoken`` by default, but you can control the cookie name via the :setting:`CSRF_COOKIE_NAME` setting.
it: Il token CSFR è chiamato ``csrftoken`` per impostazione predefinita ma puoi controllare il nome del cookie con l'impostazione :setting:`CSRF_COOKIE_NAME`.
ja: デフォルトでは、CSRF トークンの cookie は ``csrftoken`` という名前ですが、:setting:`CSRF_COOKIE_NAME` の設定を通じて変更することができます。

source: You can acquire the token like this:
it: Puoi ottenere il token in questo modo:
ja: 以下のようにしてトークンを取得できます:

source: The above code could be simplified by using the `JavaScript Cookie library <https://github.com/js-cookie/js-cookie/>`_ to replace ``getCookie``:
it: Il codice qui sopra può essere semplificato usando la ` libreria JavaScript Cookie <https://github.com/js-cookie/js-cookie/>`_ per rimpiazzare ``getCookie``:
ja: 上記のコードは `JavaScript Cookie library <https://github.com/js-cookie/js-cookie/>`_ を使って ``getCookie`` を置き換えればシンプルにできます:

source: The CSRF token is also present in the DOM in a masked form, but only if explicitly included using :ttag:`csrf_token` in a template. The cookie contains the canonical, unmasked token. The :class:`~django.middleware.csrf.CsrfViewMiddleware` will accept either. However, in order to protect against `BREACH`_ attacks, it's recommended to use a masked token.
it: Il token CSRF è anche presente nel DOM in forma mascherata ma solo se esplicitamente incluso nel template usando :ttag:`csrf_token`. Il cookie contiene il token canonico, non mascherato. :class:`~django.middleware.csrf.CsrfViewMiddleware` li accetterà entrambi. In ogni caso, per proteggersi da attacchi `BREACH`_, ci si raccomanda di usare un token mascherato.
ja: CSRF トークンはマスクされた形で DOM にも存在しますが、これはテンプレート内で :ttag:`csrf_token` を使って明示的にインクルードされたときだけです。クッキーはマスクされていない正規のトークンを含んでいます。 :class:`~django.middleware.csrf.CsrfViewMiddleware` はどちらも受け付けます。しかし、 `BREACH`_ 攻撃から守るためには、マスクされたトークンを使うことを推奨します。

source: If your view is not rendering a template containing the :ttag:`csrf_token` template tag, Django might not set the CSRF token cookie. This is common in cases where forms are dynamically added to the page. To address this case, Django provides a view decorator which forces setting of the cookie: :func:`~django.views.decorators.csrf.ensure_csrf_cookie`.
it: Se la tua view non sta facendo rendering di un template contenente il tag di template :ttag:`csrf_token`, Django potrebbe non impostare il cookie CSRF. Questo accade di sovente in casi in cui i form sono aggiunti dinamicamente alla pagina. Per affrontare questo caso, Django fornisce un decoratore di view che forza l'impostazione del cookie: :func:`~django.views.decorators.csrf.ensure_csrf_cookie`.
ja: ビューが :ttag:`csrf_token` テンプレートタグを含むテンプレートをレンダリングしていない場合、Django は CSRF トークンクッキーをセットしない可能性があります。フォームがページに動的に追加される場合がその典型です。このケースに対応するため、Django はクッキーを強制的にセットするビューのデコレータを提供しています: :func:`~django.views.decorators.csrf.ensure_csrf_cookie`。

source: Acquiring the token if :setting:`CSRF_USE_SESSIONS` or :setting:`CSRF_COOKIE_HTTPONLY` is ``True``
it: Acquisire il token se :setting:`CSRF_USE_SESSIONS` o :setting:`CSRF_COOKIE_HTTPONLY` è ``True``
ja: :setting:`CSRF_USE_SESSIONS` または :setting:`CSRF_COOKIE_HTTPONLY` が ``True`` の時トークンを取得する

source: If you activate :setting:`CSRF_USE_SESSIONS` or :setting:`CSRF_COOKIE_HTTPONLY`, you must include the CSRF token in your HTML and read the token from the DOM with JavaScript:
it: Se attivi :setting:`CSRF_USE_SESSIONS` o :setting:`CSRF_COOKIE_HTTPONLY`, devi includere il token CSRF nel tuo HTML e leggere il token dal DOM con JavaScript:
ja: :setting:`CSRF_USE_SESSIONS` または :setting:`CSRF_COOKIE_HTTPONLY` を有効にした場合、HTML に CSRF トークンを含め、JavaScript で DOM からトークンを読み取る必要があります:

source: Setting the token on the AJAX request
it: Impostare il token sulla richiesta AJAX
ja: AJAX 通信でトークンを設定する

source: Finally, you'll need to set the header on your AJAX request. Using the `fetch()`_ API:
it: Infine, avrai bisogno di impostare l'intestazione della tua request AJAX. Usando l'API `fetch()`_:
ja: 最後に、AJAXリクエストにヘッダーを追加する必要があります。 `fetch()`_ APIを使用してください:

source: Using CSRF protection in Jinja2 templates
it: Usare la protezione CSRF nei template Jinja2
ja: Jinja2テンプレートでCSRF保護を利用する

source: Django's :class:`~django.template.backends.jinja2.Jinja2` template backend adds ``{{ csrf_input }}`` to the context of all templates which is equivalent to ``{% csrf_token %}`` in the Django template language. For example:
it: Il backend di template di Django :class:`~django.template.backends.jinja2.Jinja2` aggiunge ``{{ csrf_input }}`` al context di tutti i template che è equivalente a ``{% csrf_token %}`` nel linguaggio di template di Django. Per esempio:
ja: Django の :class:`~django.template.backends.jinja2.Jinja2` テンプレートバックエンドは、すべてのテンプレートのコンテキストに ``{{ csrf_input }}`` を追加します。これは、Django テンプレート言語内の ``{% csrf_token %}`` と同じ意味です。例えば:

source: Using the decorator method
it: Usare il metodo decoratore
ja: デコレータメソッドの利用

source: Rather than adding ``CsrfViewMiddleware`` as a blanket protection, you can use the :func:`~django.views.decorators.csrf.csrf_protect` decorator, which has exactly the same functionality, on particular views that need the protection. It must be used **both** on views that insert the CSRF token in the output, and on those that accept the POST form data. (These are often the same view function, but not always).
it: Piuttosto che inserire ``CsrfViewMiddleware`` come protezione totale, puoi usare il decoratore :func:`~django.views.decorators.csrf.csrf_protect`, che ha esattamente la stessa funzionalità su particolari view che abbiano bisogno di protezione. Devono essere usati **entrambi** sulle view che inseriscono il token CSRF in output e su quelle che accettano i dati POST dai form. (Sono spesso le stesse funzioni anche se non è sempre così).
ja: 全体を保護するために ``CsrfViewMiddleware`` を追加する代わりに、保護を必要とする特定のビューにおいて、まったく同じ機能を持つ :func:`~django.views.decorators.csrf.csrf_protect` デコレータを使えます。アウトプット内に CSRF トークンを挿入するビューと、POST フォームデータを受け入れるビューの両方で使用する必要があります (多くの場合同じビュー関数ですが、そうでない場合もあります)。

source: Use of the decorator by itself is **not recommended**, since if you forget to use it, you will have a security hole. The 'belt and braces' strategy of using both is fine, and will incur minimal overhead.
it: L'uso del decoratore di per sè **non è raccomandato** poichè se dimentichi di usarlo, ci sarà un buco nella sicurezza. La strategia 'a tutto tondo' di usare entrambe va bene ed introdurrà un overhead minimo.
ja: デコレータ自体で使うことは **非推奨** です。もし使い忘れた場合、セキュリティホールを抱えることになるからです。二重対策として両方を使うのは構いませんが、わずかにオーバーヘッドが増加します。

source: Handling rejected requests
it: Gestire le richieste rifiutate
ja: リクエスト拒否に対処する

source: By default, a '403 Forbidden' response is sent to the user if an incoming request fails the checks performed by ``CsrfViewMiddleware``. This should usually only be seen when there is a genuine Cross Site Request Forgery, or when, due to a programming error, the CSRF token has not been included with a POST form.
it: Per impostazione predefinita, una response '403 Forbidden' viene inviata all'utente se la request in ingresso fallisce sui controlli fatti da ``CsrfViewMiddleware``. Questo dovrebbe accadere solo se c'è un vero Cross Site Request Forgery o quando, a causa di un errore di programmazione, il token CSRF non è stato incluso nel POST del form.
ja: デフォルトでは、受信リクエストが ``CsrfViewMiddleware`` によって実行されるチェックに失敗した場合、ユーザーには "403 Forbidden" レスポンスが送信されます。これは通常、実際の CSRF が発生した場合、またはプログラミングエラーにより POST フォームに CSRF トークンが含まれていない場合にのみ送信されるべきです。

source: The error page, however, is not very friendly, so you may want to provide your own view for handling this condition. To do this, set the :setting:`CSRF_FAILURE_VIEW` setting.
it: La pagina di errore, in ogni caso, non è molto amichevole quindi potresti voler fornire la tua per gestire questa condizione. Per fare ciù, imposta il setting :setting:`CSRF_FAILURE_VIEW`.
ja: エラーページはとてもユーザーフレンドリーではないので、独自のビューを提供したいと考えるかもしれません。:setting:`CSRF_FAILURE_VIEW` の設定で実現できます。

source: CSRF failures are logged as warnings to the :ref:`django.security.csrf <django-security-logger>` logger.
it: I fallimenti CSRF sono registrati come warning nel logger :ref:`django.security.csrf <django-security-logger>`.
ja: CSRF の認証失敗は、 :ref:`django.security.csrf <django-security-logger>` ロガーに警告として記録されます。

source: Using CSRF protection with caching
it: Usare la protezione CSRF con il caching
ja: キャッシュによるCSRF保護を利用する

source: If the :ttag:`csrf_token` template tag is used by a template (or the ``get_token`` function is called some other way), ``CsrfViewMiddleware`` will add a cookie and a ``Vary: Cookie`` header to the response. This means that the middleware will play well with the cache middleware if it is used as instructed (``UpdateCacheMiddleware`` goes before all other middleware).
it: Se il tag di template :ttag:`csrf_token` è utilizzato da un template (o viene chiamata in qualche modo la funzione ``get_token``), ``CsrfViewMiddleware`` aggiungerà un cookie ed una intestazione ``Vary: Cookie`` alla response. Questo significa che il middleware si comporterà bene con il middleware di cache se viene usato come suggerito (``UpdateCacheMiddleware`` viene prima di tutti gli altri middleware).
ja: :ttag:`csrf_token` テンプレートタグがテンプレートで使用されている場合(または ``get_token`` 関数が他の方法で呼び出されている場合)、``CsrfViewMiddleware`` はレスポンスにクッキーと ``Vary: Cookie`` ヘッダをレスポンスに追加します。これは、``UpdateCacheMiddleware`` が指示通りに使用された場合、このミドルウェアがキャッシュミドルウェアと協調的に動作することを意味します（ ``UpdateCacheMiddleware`` は他のすべてのミドルウェアよりも優先されます）。

source: However, if you use cache decorators on individual views, the CSRF middleware will not yet have been able to set the Vary header or the CSRF cookie, and the response will be cached without either one. In this case, on any views that will require a CSRF token to be inserted you should use the :func:`django.views.decorators.csrf.csrf_protect` decorator first::
it: In ogni caso, se usi decoratori di cache su view specifiche, il middleware CSRF non sarà ancora in grado di impostare l'intestazione Vary sul cookie CSRF e la response sarà messa in cache senza che ci sia. In questo caso, su qualsiasi view che richieda l'inserimento di un cookie CSRF dovresti usare prima il decoratore :func:`django.views.decorators.csrf.csrf_protect`::
ja: しかし、個々のビューでキャッシュデコレータを使用すると、CSRF ミドルウェアはまだ Vary ヘッダや CSRF クッキーを設定できておらず、レスポンスはどちらも設定されずにキャッシュされます。この場合、CSRF トークンを挿入する必要があるビューでは、 :func:`django.views.decorators.csrf.csrf_protect` デコレータを最初に使うべきです:

source: If you are using class-based views, you can refer to :ref:`Decorating class-based views<decorating-class-based-views>`.
it: Se stai usando view basate su classi, puoi fare riferimento a :ref:`Decorating class-based views<decorating-class-based-views>`.
ja: クラスベースのビューを使っている場合は、:ref:`Decorating class-based views<decorating-class-based-views>` を参照してください。

source: Testing and CSRF protection
it: I test e la protezione CSRF
ja: テストと CSRF 保護

source: The ``CsrfViewMiddleware`` will usually be a big hindrance to testing view functions, due to the need for the CSRF token which must be sent with every POST request. For this reason, Django's HTTP client for tests has been modified to set a flag on requests which relaxes the middleware and the ``csrf_protect`` decorator so that they no longer rejects requests. In every other respect (e.g. sending cookies etc.), they behave the same.
it: ``CsrfViewMiddleware` sarà generalmente un grosso ostacolo nel test delle funzioni delle view, a causa della necessità del token CSRF che deve essere inviato ad ogni richiesta POST. Per questo motivo, il client HTTP di Django per i test è stato modificato per impostare un flag sulle richieste che rilassa il middleware ed il decoratore ``csrf_protect`` in modo che non rifiutino più le richieste. In ogni altro aspetto (per es. invio di cookie), si comportano nello stesso modo.
ja: 通常、 ``CsrfViewMiddleware`` はビュー関数をテストする際に大きな障害となります。なぜなら、 POST リクエストごとに CSRF トークンを送信する必要があるからです。このため、Django のテスト用 HTTP クライアントは、ミドルウェアと ``csrf_protect`` デコレータを緩和するフラグをリクエストに設定するように変更されました。それ以外の点 (例えばクッキーの送信など) では同じように動作します。

source: If, for some reason, you *want* the test client to perform CSRF checks, you can create an instance of the test client that enforces CSRF checks:
ja: 何らかの理由でテストクライアントに CSRF チェックを実行して *ほしい* ときには、CSRF チェックの実行を強制するテストクライアントのインスタンスを作ることができます:

source: Edge cases
it: Casi limite
ja: エッジケース

source: Certain views can have unusual requirements that mean they don't fit the normal pattern envisaged here. A number of utilities can be useful in these situations. The scenarios they might be needed in are described in the following section.
it: Alcune view hanno requisiti inusuali, il che significa che non ricadono nei pattern normali qui illustrati. Un certo numero di utility possono essere utili in queste situazioni. Gli scenari in cui potrebbero essere necessarie sono descritti nella seguente sezione.
ja: ビューによっては、ここで想定している通常のパターンに当てはまらないような特殊な要求がある場合があります。このような状況では、多くのユーティリティが役に立ちます。それらが必要とされる可能性のあるシナリオについては、次のセクションで説明します。

source: Disabling CSRF protection for just a few views
it: Disabilitare la protezione CSRF solo per alcune view
ja: 特定のビューで CSRF 保護を無効化する

source: Most views requires CSRF protection, but a few do not.
it: Molte view richiedono la protezione CSRF ma alcune non ne hanno bisogno.
ja: ほとんどのビューでCSRF保護が必要だが、わずかのビューでは必要でないケースがあります。

source: Solution: rather than disabling the middleware and applying ``csrf_protect`` to all the views that need it, enable the middleware and use :func:`~django.views.decorators.csrf.csrf_exempt`.
it: Soluzione: invece che disabilitare il middleware ed applicare ``csrf_protect`` a tutte le view che ne hanno bisogno, abilita il middleware ed usa :func:`~django.views.decorators.csrf.csrf_exempt`.
ja: 解決策: ミドルウェアを無効にして、必要なビュー全てに ``csrf_protect`` を適用するのではなく、ミドルウェアを有効にして :func:`~django.views.decorators.csrf.csrf_exempt` を使ってください。

source: Setting the token when ``CsrfViewMiddleware.process_view()`` is not used
it: Impostare il token quando non viene usato ``CsrfViewMiddleware.process_view()``
ja: ``CsrfViewMiddleware.process_view()`` が使われない場合のトークン設定

source: There are cases when ``CsrfViewMiddleware.process_view`` may not have run before your view is run - 404 and 500 handlers, for example - but you still need the CSRF token in a form.
it: Ci sono casi in cui ``CsrfViewMiddleware.process_view`` potrebbe non aver girato prima della tua view - per esempio gli handler 404 e 500 - ma hai ancora bisogno del token CSRF in un form.
ja: ビューが実行される前に ``CsrfViewMiddleware.process_view`` が実行されない場合があります（例えば、404ハンドラーや500ハンドラー）その場合でもフォームでCSRFトークンが必要となる場合。

source: Solution: use :func:`~django.views.decorators.csrf.requires_csrf_token`
it: Soluzione: usa :func:`~django.views.decorators.csrf.requires_csrf_token`
ja: 解決策: :func:`~django.views.decorators.csrf.requires_csrf_token` を使用する

source: Including the CSRF token in an unprotected view
it: Includere il token CSRF in una view non protetta
ja: 保護されていないビューにCSRFトークンを含める

source: There may be some views that are unprotected and have been exempted by ``csrf_exempt``, but still need to include the CSRF token.
it: Potrebbero esserci alcune view che non sono protette e sono esenti con ``csrf_exempt`` ma hanno ancora bisogno di includere un token CSRF.
ja: ``csrf_exempt`` によって除外され、保護されていないビューがあるかもしれない中で、CSRFトークンを含めなければならないこともあります。

source: Solution: use :func:`~django.views.decorators.csrf.csrf_exempt` followed by :func:`~django.views.decorators.csrf.requires_csrf_token`. (i.e. ``requires_csrf_token`` should be the innermost decorator).
it: Soluzione: usa :func:`~django.views.decorators.csrf.csrf_exempt` seguito da :func:`~django.views.decorators.csrf.requires_csrf_token` (cioè ``requires_csrf_token`` dovrebbe essere il decoratore più interno).
ja: 解決策: :func:`~django.views.decorators.csrf.csrf_exempt` の後に続けて :func:`~django.views.decorators.csrf.requires_csrf_token` を使用してください (つまり、 ``requires_csrf_token`` が最も内側のデコレータとなるようにしてください)。

source: Protecting a view for only one path
it: Proteggere una view per un solo percorso
ja: 1つのパスに対してのみビューを保護する

source: A view needs CSRF protection under one set of conditions only, and mustn't have it for the rest of the time.
it: Una view ha bisogno di protezione CSRF solo in alcune condizioni e non deve averlo per tutte le altre.
ja: ビューが CSRF 保護を必要とするのは、ある条件のときだけで、それ以外のときは CSRF 保護をしてはいけないときがあります。

source: Solution: use :func:`~django.views.decorators.csrf.csrf_exempt` for the whole view function, and :func:`~django.views.decorators.csrf.csrf_protect` for the path within it that needs protection. Example::
it: Soluzione: usa :func:`~django.views.decorators.csrf.csrf_exempt` per l'intera funzione di view e :func:`~django.views.decorators.csrf.csrf_protect` per il percorso che necessita di protezione. Esempio::
ja: 解決方法: ビュー関数全体には :func:`~django.views.decorators.csrf.csrf_exempt` を使用し、その中で保護が必要なパスに対して :func:`~django.views.decorators.csrf.csrf_protect` を使用します。例えば:

source: Protecting a page that uses AJAX without an HTML form
it: Proteggere una pagina che usa AJAX senza un form HTML
ja: HTML フォームなしで AJAX を使用するページの保護

source: A page makes a POST request via AJAX, and the page does not have an HTML form with a :ttag:`csrf_token` that would cause the required CSRF cookie to be sent.
it: Una pagina fa una richiesta AJAX e non ha un form HTML con un :ttag:`csrf_token` che farebbe partire il cookie CSRF.
ja: AJAX 経由で POST リクエストを行うページにおいて、必要な CSRF クッキーを送信する :ttag:`csrf_token` を持つ HTML フォームがないことがあります。

source: Solution: use :func:`~django.views.decorators.csrf.ensure_csrf_cookie` on the view that sends the page.
it: Soluzione: usa :func:`~django.views.decorators.csrf.ensure_csrf_cookie` sulla view che invia la pagina.
ja: 解決策: ページを送信するビューで :func:`~django.views.decorators.csrf.ensure_csrf_cookie` を使います。

source: CSRF protection in reusable applications
it: Protezione CSRF in applicazioni riusabili
ja: 再利用可能なアプリケーションにおける CSRF 保護

source: Because it is possible for the developer to turn off the ``CsrfViewMiddleware``, all relevant views in contrib apps use the ``csrf_protect`` decorator to ensure the security of these applications against CSRF. It is recommended that the developers of other reusable apps that want the same guarantees also use the ``csrf_protect`` decorator on their views.
it: Dal momento che è possibile per lo sviluppatore disabilitare ``CsrfViewMiddleware``, tutte le view rilevanti nelle app contrib usano il decoratore ``csrf_protect`` per assicurare la sicurezza di queste applicazioni contro CSRF. Si raccomanda agli sviluppatori di applicazioni riutilizzabili che vogliano le stesse garanzie di usare anche il decoratore ``csrf_protect`` sulle proprie view.
ja: 開発者は ``CsrfViewMiddleware`` を個別にオフにすることができるので、CSRF に対するアプリケーションのセキュリティを保証するために、contrib アプリケーションの関連するビューには、すべて ``csrf_protect`` デコレータを適用しています。その他の再利用可能なアプリの開発者も、同様にセキュリティを保証したいのであれば、ビューに ``csrf_protect`` デコレータを適用してください。

source: How to write a custom storage class
it: Come scrivere una storage class personalizzata
ja: カスタムのストレージクラスを書く
