Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Many of Django's model fields accept options that they don't do anything with. For example, you can pass both :attr:`~django.db.models.Field.editable` and :attr:`~django.db.models.DateField.auto_now` to a :class:`django.db.models.DateField` and it will simply ignore the :attr:`~django.db.models.Field.editable` parameter (:attr:`~django.db.models.DateField.auto_now` being set implies ``editable=False``). No error is raised in this case.
pt_br: Muitos dos modelos do Django aceitam opções que estes nunca usam pra nada. Por exemplo, é possível passar ambos os :attr:`~django.db.models.Field.editable` e :attr:`~django.db.models.DateField.auto_now` para um :class:`django.db.models.DateField` e o parâmetro :attr:`~django.db.models.Field.editable` será ignorado (:attr:`~django.db.models.DateField.auto_now` sendo definido implica em ``editable=False``). Nenhum erro é gerado neste caso.
zh_hans: 许多 Django 模板接收一堆不处理的选项。你可以同时给 :class:`django.db.models.DateField` 传入 :attr:`~django.db.models.Field.editable` 和 :attr:`~django.db.models.DateField.auto_now`，它会直接忽略 :attr:`~django.db.models.Field.editable` 参数（:attr:`~django.db.models.DateField.auto_now` 被设置意味着 ``editable=False``）。本例无错误抛出。

source: This behavior simplifies the field classes, because they don't need to check for options that aren't necessary. They just pass all the options to the parent class and then don't use them later on. It's up to you whether you want your fields to be more strict about the options they select, or to use the simpler, more permissive behavior of the current fields.
pt_br: Este comportamento simplifica as classes de campos, porque não precisam checar opções que não são necessárias. Apenas passam todas as opções para a classe mãe e estes não são usados mais tarde. Você decide se quer que seus campos sejam mais rigorosos sobre as opções que eles selecionam, ou usar o mais simples, um comportamento mais permissivo dos campos existentes.
zh_hans: 此行为简化了字段类，因为它们无需检查不需要的选项。它们直接将所有选项传给父类，就是后面爸爸不爱。是否对选项应用更严格的规则，还是更简单，更宽容的行为，这取决于你。

source: The counterpoint to writing your ``__init__()`` method is writing the ``deconstruct()`` method. This method tells Django how to take an instance of your new field and reduce it to a serialized form - in particular, what arguments to pass to ``__init__()`` to re-create it.
pt_br: O contraponto de escrever seu método ``__init__()``é escrever o método ``deconstruct()``. Este método diz ao Django como pegar uma instância do seu novo campo e reduzi-la para uma forma "serializada" em particular, e quais argumentos passar para ``__init__()`` para recriá-lo.

source: The contract of ``deconstruct()`` is simple; it returns a tuple of four items: the field's attribute name, the full import path of the field class, the positional arguments (as a list), and the keyword arguments (as a dict). Note this is different from the ``deconstruct()`` method :ref:`for custom classes <custom-deconstruct-method>` which returns a tuple of three things.
pt_br: O contrato da ``deconstruct()``é simples; ele retorna uma tupla de quatro item: o atributo "name" do campo, o path completo de importação da classe do campo, os argumentos posicionais (como lista), e os argumentos nomeados (como dicionários). Note que é diferente do método ``deconstruct()`` :ref:`para classes customizadas <custom-deconstruct-method>` o qual retorna uma tupla de 3 elementos
zh_hans: 拼接 ``deconstruct()`` 非常简单；它返回包含 4 个项目的原则：字段属性名，字段类的完整导入路径，可选参数（列表），和关键字参数（字典）。注意，这与 :ref:`为自定义类 <custom-deconstruct-method>` 的 ``deconstruct`` 方法不同，它返回包含 3个项目的元组。

source: If you add a new keyword argument, you need to write code to put its value into ``kwargs`` yourself::
pt_br: Se você adicionar um novo argumento palavra-chave, você mesmo precisa codificar e colocar o valor dentro da variável "kwargs".

source: In addition, try to avoid returning values as positional arguments; where possible, return values as keyword arguments for maximum future compatibility. Of course, if you change the names of things more often than their position in the constructor's argument list, you might prefer positional, but bear in mind that people will be reconstructing your field from the serialized version for quite a while (possibly years), depending how long your migrations live for.
pt_br: E mais, tente evitar retornar valores como argumentos posicionais; onde for possível, retorne valores como argumentos "nomeados" para compatibilidade máxima no futuro. Claro, se os nomes são trocados mais frequentemente que as posições na lista do construtor, talvez seja preferível o posicional, mas tenha em mente que as pessoas estarão reconstruindo seu campo a partir da verão serializada por algum tempo (talvez anos), dependendo de quanto tempo suas migrações sobrevivam.
zh_hans: 也就是说，尽量避免以位置参数返回值；可能的话，尽量以关键字参数返回，未来能更好的扩展。当然，如果你在构造器的参数列表中，修改参数名比参数位置更频繁的话，你可能更倾向于位置参数，但是，牢记于心，未来别人会从序列化版本中重新构建你的字段，可能是一小会后（可能数年后），这取决于你的迁移持续的时间。

source: You can see the results of deconstruction by looking in migrations that include the field, and you can test deconstruction in unit tests by just deconstructing and reconstructing the field::
pt_br: É possível ver os resultados de desconstrução olhando as migrações que incluem o campo, e é possível testar a desconstrução com "unit tests" somente desconstruindo e reconstruindo o campo::
zh_hans: 你能查看析构的结果，通过观察包含字段的迁移。你也能在单元测试中测试析构，只要简单的测试析构和重构字段::

source: As always, you should document your field type, so users will know what it is. In addition to providing a docstring for it, which is useful for developers, you can also allow users of the admin app to see a short description of the field type via the :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` application. To do this simply provide descriptive text in a :attr:`~Field.description` class attribute of your custom field. In the above example, the description displayed by the ``admindocs`` application for a ``HandField`` will be 'A hand of cards (bridge style)'.
pt_br: Como sempre, é devido documentar o tipo do campo, então os usuários irão saber o que é. Além disso prover uma "docstring" para ele, que é útil para desenvolvedores, é possível permitir que usuários da aplicação admin vejam uma pequena descrição do tipo do campo através do :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` . Para tal simplesmente forneça um texto descritivo no atributo :attr:`~Field.description` da classe do seu campo personalizado. NO evento acima, a descrição mostrada pela aplicação ``admindocs`` para o ``HandField`` será 'A hand of cards (bridge style)'.
zh_hans: 像之前一样，你需要为自定义字段类型编写文档，这样用户就会知道这他喵到底是啥。除了为其提供 docstring （对开发者很有用）外，你也需要让后台用户通过 :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` 看到一个关于字段类型的简单介绍。只需简单地在自定义字段的 :attr:`~Field.description` 属性提供描述性文本。在上述例子中，由 ``admindocs`` 应用为 ``HandField`` 字段提供的描述是 'A hand of cards (bridge style)'。

source: If you aim to build a database-agnostic application, you should account for differences in database column types. For example, the date/time column type in PostgreSQL is called ``timestamp``, while the same column in MySQL is called ``datetime``. The simplest way to handle this in a :meth:`~Field.db_type` method is to check the ``connection.settings_dict['ENGINE']`` attribute.
pt_br: Se o seu objetivo é criar uma aplicação agnóstica quanto ao banco de dados, deve levar em conta as diferenças nos tipos de colunas no banco de dados. Por exemplo, a tipo date/time para o PostgreSQL é chamado``timestamp`` enquanto que para o MySQL é chamado ``datetime``. O jeito mais simples de lidar com isso é no método :meth:`~Field.db_type` verificar o atributo ``connection.settings_dict['ENGINE']``.
zh_hans: 如果你意在构建一个兼容各种数据库的应用，你需要了解不同数据库列之间的差异。举个例子，PostgreSQL 中的 date/time 列类型叫做 ``timestamp``，而 MySQL 中相同的列叫做 ``datetime``。最简单的处理此问题的方法是在 :meth:`~Field.db_type` 方法中检查 ``connection.settings_dict['ENGINE']`` 属性。

source: The :meth:`~Field.db_type` method is called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. It is also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument. It's not called at any other time, so it can afford to execute slightly complex code, such as the ``connection.settings_dict`` check in the above example.
pt_br: O método :meth:`~Field.db_type` é chamado pelo Django quando o framework constrói o comando ``CREATE TABLE`` para sua aplicação -- que é, quando as tabelas são criadas pela primeira vez. É chamado também quando está construindo a cláusula ``WHERE`` -- quer dizer, quando dados são recebidos usando métodos de QuerySet como ``get()``, ``filter()``, e ``exclude()`` e tem o campo do modelo como argumento. O método não é chamado em nenhum outro momento, isso permite que se execute códigos relativamente complexos, tal como na verificação em ``connection.settings_dict`` no código acima.

source: The better way of doing this would be to make the parameter specifiable at run time -- i.e., when the class is instantiated. To do that, just implement ``Field.__init__()``, like so::
pt_br: O melhor jeito de fazer isso seria fazer o parâmetro ser especificado em tempo de execução -- isto é, quando a classe é instanciada. Para fazer isso, basta implementar ``Field.__init__()``, como em::
zh_hans: 更好的方式是在运行时指定参数值——即类实例化的时候。只需像这样实现 ``Field.__init__()`` 即可::

source: Finally, if your column requires truly complex SQL setup, return ``None`` from :meth:`.db_type`. This will cause Django's SQL creation code to skip over this field. You are then responsible for creating the column in the right table in some other way, of course, but this gives you a way to tell Django to get out of the way.
pt_br: Finalmente, se sua coluna requer que defina um SQL realmente complexo, retorne ``None`` do :meth:`.db_type`. Isso irá fazer que o código de criação de SQL do Django ignore este campo. Então você é o responsável por criar a coluna na tabela correta de alguma outra maneira, claro, isso é uma maneira de dizer ao Django para sair do caminho.
zh_hans: 最后，如果你的列真的要求配置复杂的 SQL，从 :meth:`.db_type` 返回 ``None``。这会让 Django 创建 SQL 的代码跳过该字段。随后你需要负责为该字段在正确的表中以某种方式创建列，这种方式允许你告诉 Django 不处理此事。

source: Historically, Django provided a metaclass called ``SubfieldBase`` which always called :meth:`~Field.to_python` on assignment. This did not play nicely with custom database transformations, aggregation, or values queries, so it has been replaced with :meth:`~Field.from_db_value`.
pt_br: Historicamente, o Django fornece uma metaclassa chamada ``SubfieldBase`` que sempre chama :meth:`~Field.to_python` na atribuição. Isso não funciona bem com transformação, agregções, ou queries de valores customizadaos, então teve que ser trocado com o :meth:`~Field.from_db_value`.

source: Since using a database requires conversion in both ways, if you override :meth:`~Field.to_python` you also have to override :meth:`~Field.get_prep_value` to convert Python objects back to query values.
pt_br: Uma vez que usar um banco de dados requer conversão em ambos os sentidos, se sobrescrever o :meth:`~Field.to_python` é necessário sobrescrever também :meth:`~Field.get_prep_value` para converter os objetos Python de novo em valores de query.
zh_hans: 使用数据库需要双向转换，如果你重写了 :meth:`~Field.to_python` 方法，你也必须重写 :meth:`~Field.get_prep_value` 将 Python 对象转回查询值。

source: Preparing values for use in database lookups
pt_br: Preparando valores para uso em filtros de banco de dados

source: As with value conversions, preparing a value for database lookups is a two phase process.
pt_br: Assim como conversões de valores, preparar o valor para um filtro de banco de dados é um processo de duas fazes

source: :meth:`.get_prep_lookup` performs the first phase of lookup preparation: type conversion and data validation.
pt_br: :meth:`.get_prep_lookup` executa a primeira fase da preparação da pesquisa: conversão de tipo e validação de dados

source: Prepares the ``value`` for passing to the database when used in a lookup (a ``WHERE`` constraint in SQL). The ``lookup_type`` parameter will be one of the valid Django filter lookups: ``exact``, ``iexact``, ``contains``, ``icontains``, ``gt``, ``gte``, ``lt``, ``lte``, ``in``, ``startswith``, ``istartswith``, ``endswith``, ``iendswith``, ``range``, ``year``, ``month``, ``day``, ``isnull``, ``search``, ``regex``, and ``iregex``.
pt_br: Prepare o ``valor`` para passá-lo para o banco de daods quando usado em uma pesquisa (uma cláusula ``WHERE`` no SQL). O parâmetro ``lookup_type`` será um dos filtros válidos do Django sendo filtros: ``exact``, ``iexact``, ``contains``, ``icontains``, ``gt``, ``gte``, ``lt``, ``lte``, ``in``, ``startswith``, ``istartswith``, ``endswith``, ``iendswith``, ``range``, ``year``, ``month``, ``day``, ``isnull``, ``search``, ``regex``, and ``iregex``.

source: If you are using :doc:`custom lookups </howto/custom-lookups>`, the ``lookup_type`` can be any ``lookup_name`` used by the project's custom lookups.
pt_br: Se você estiver usando :doc:`filtros personlizados </howto/custom-lookups>`, o ``lookup_type`` pode ser qualquer ``lookup_name`` usado pelos filtros personalizados do projeto .

source: Your method must be prepared to handle all of these ``lookup_type`` values and should raise either a ``ValueError`` if the ``value`` is of the wrong sort (a list when you were expecting an object, for example) or a ``TypeError`` if your field does not support that type of lookup. For many fields, you can get by with handling the lookup types that need special handling for your field and pass the rest to the :meth:`~Field.get_db_prep_lookup` method of the parent class.
pt_br: Seu método deve estar preparado para lidar com todos estes valores de ``lookup_type`` e deve emitir um ``ValueError`` se o ``value`` é do tipo errado (uma lista quando deveria ser um objeto, por exemplo) ou um ``TypeError`` se o seu campo não aceita aquele tipo de filtro. Para muitos campos, você pode começar por tratar os tipos de filtros que recisam de uma tratamento especil para seu campo e passar o resto para o método :meth:`~Field.get_db_prep_lookup` da classe pai.

source: If you needed to implement :meth:`.get_db_prep_save`, you will usually need to implement :meth:`.get_prep_lookup`. If you don't, :meth:`.get_prep_value` will be called by the default implementation, to manage ``exact``, ``gt``, ``gte``, ``lt``, ``lte``, ``in`` and ``range`` lookups.
pt_br: se você precisou implementar o :meth:`.get_db_prep_save`, normalmente você precisará implementar o :meth:`.get_prep_lookup`. Se não, :meth:`.get_prep_value` será chamado pela implementação padrão, para lidar com os filtros ``exact``, ``gt``, ``gte``, ``lt``, ``lte``, ``in`` and ``range``.

source: You may also want to implement this method to limit the lookup types that could be used with your custom field type.
pt_br: Talvez você queira implementar este método para limitar os tipos de filtros que possam ser usados com seu campo personalizado.

source: Note that, for ``"range"`` and ``"in"`` lookups, ``get_prep_lookup`` will receive a list of objects (presumably of the right type) and will need to convert them to a list of things of the right type for passing to the database. Most of the time, you can reuse ``get_prep_value()``, or at least factor out some common pieces.
pt_br: Note que, para os filtros ``range``e `ìn``, o ``get_grep_lookup`` receberá uma lista de objetos (presumidamente do tipo certo) e será preciso converte-los em uma lista de strings do tipo correto para passar para o banco de dados. Na maior parte do tempo, é possível reutilizar ``get_prep_value()``, ou no mínimo fatorar algumas partes comuns.

source: For example, the following code implements ``get_prep_lookup`` to limit the accepted lookup types to ``exact`` and ``in``::
pt_br: Por exemplo, o código seguinte implementa o ``get_prep_lookup`` para limitar os tipos de filtros aceitos para ``exact`` e `ìn`::

source: For performing database-specific data conversions required by a lookup, you can override :meth:`~Field.get_db_prep_lookup`.
pt_br: Para tratar conversões de dados específicos de um banco de dado requeridos por um filtro, reescreva o :meth:`~Field.get_db_prep_lookup`.

source: To customize how the values are serialized by a serializer, you can override :meth:`~Field.value_to_string`. Using ``value_from_object()`` is the best way to get the field's value prior to serialization. For example, since our ``HandField`` uses strings for its data storage anyway, we can reuse some existing conversion code::
pt_br: Para customizar a maneira como os valores são serializados por um serializador, sobrescreva o :meth:`~Field.value_to_string`. Usando o ``value_from_object()`` ;e o melhor jeito de pegar os valores dos campos antes da serialização. Por exemplo, já que de qualqer forma a ``HandField`` usa strings para armazenar os dados, podemos usar alguns códigos de conversão existentes::

source: Put a ``__str__()`` (``__unicode__()`` on Python 2) method on the class you're wrapping up as a field. There are a lot of places where the default behavior of the field code is to call :func:`~django.utils.encoding.force_text` on the value. (In our examples in this document, ``value`` would be a ``Hand`` instance, not a ``HandField``). So if your ``__str__()`` method (``__unicode__()`` on Python 2) automatically converts to the string form of your Python object, you can save yourself a lot of work.
pt_br: Coloque um método ``__str__()`` (``__unicode__()`` em Python 2) na classe que você está construindo como um campo. Há vários lugares onde o comportamento padrão do código do campo é chamar :func:`~django.utils.encoding.force_text` para o valor. (Em nossos exemplos no nosso documento, ``value`` pode ser uma instância de ``Hand``, e não um ``HandField``). Então se o seu método ``__str__()`` (``__unicode__()`` on Python 2) automaticamente converter para o formato string do seu objeto Python, você pode economizar muito trabalho.

source: Once a subclass of ``File`` is created, the new ``FileField`` subclass must be told to use it. To do so, simply assign the new ``File`` subclass to the special ``attr_class`` attribute of the ``FileField`` subclass.
pt_br: Uma vez que uma subclasse de ``File`` é criada, a nova subclasse ``FileField`` deve ser informada para usá-lo. Para isso, simplesmente passe a nova subclasse de ``File`` para o atributo especial ``attr_class`` da subclasse de ``FileField``.
zh_hans: 一旦创建了 ``File`` 子类，必须说明要使用新子类 ``FileField``。为此，只需为 ``FileField`` 的子类的 ``attr_class`` 指定新的 ``File`` 子类。

source: Custom template tags and filters
pt_br: "Template tags" e filtros customizados
zh_hans: 自定义模板（template）的标签（tags）和过滤器（filters）

source: For a ton of examples, read the source code for Django's default filters and tags. They're in ``django/template/defaultfilters.py`` and ``django/template/defaulttags.py``, respectively.
pt_br: Para uma tonelada de exemplos, leia o código fonte das tags e filtros padrão do Django. Eles estão em ``django/template/defaultfilters.py`` e ``django/template/defaulttags.py``, respectivamente.
zh_hans: 要查看超多的例子，查阅 Django 默认的 filters 和 tags 源码。它们分别位于 ``django/template/defaultfilters.py`` 和 ``django/template/defaulttags.py``。

source: Custom filters are just Python functions that take one or two arguments:
pt_br: Filtros customizados são apenas funções Python que recebem um ou dois argumentos:
zh_hans: 自定义的过滤器就是一些有一到两个参数的 Python 函数

source: Most filters don't take arguments. In this case, just leave the argument out of your function. Example::
pt_br: Muitos filtros não recebem argumentos. Neste caso, somente deixe o argumento fora de sua função. Exemplo::
zh_hans: 大部分的过滤器并没有参数。这样的话，只需要把这些参数从你的函数中去掉就好。例子如下：

source: When writing a custom filter, give some thought to how the filter will interact with Django's auto-escaping behavior. Note that three types of strings can be passed around inside the template code:
pt_br: Quando escrevendo um filtro personalizado, reflita sobre como o filtro irá interagir com o comportamento do auto-escaping do django. Veja que tes tipos de strings podem ser passadas dentro do código do template:

source: **Raw strings** are the native Python ``str`` or ``unicode`` types. On output, they're escaped if auto-escaping is in effect and presented unchanged, otherwise.
pt_br: **Raw strings** são os tipos nativos do Python ``str``ou ``unicode``. Na saída, eles são "escaped", se "auto-escaping" tiver efeitivo, caso contrário são apresentados sem mudança.

source: Internally, these strings are of type ``SafeBytes`` or ``SafeText``. They share a common base class of ``SafeData``, so you can test for them using code like::
pt_br: Internamente, estas strings são do tipo ``SafeBytes``ou ``SafeText``. Eles compartilham uma classe de base comum do ``SafeData``, então você pode testá-los usando código como::

source: **Strings marked as "needing escaping"** are *always* escaped on output, regardless of whether they are in an :ttag:`autoescape` block or not. These strings are only escaped once, however, even if auto-escaping applies.
pt_br: **Strings marcados como "needing escaping"** são *sempre* "escaped"na saida, independetemente se estão dentro de um bloco :ttag:`autoescape` ou não. Estas strings somente "escaped"uma vez, contudo, mesmo se "auto-escaping" se aplica.

source: Internally, these strings are of type ``EscapeBytes`` or ``EscapeText``. Generally you don't have to worry about these; they exist for the implementation of the :tfilter:`escape` filter.
pt_br: Internamente essas strings são do tipo ``EscapeBytes`` ou ``EscapeText``, geralmente você não precisa se preocupar com isso; eles existem para a implementação interna do filtro :tfilter:`escape`.

source: The reason ``is_safe`` is necessary is because there are plenty of normal string operations that will turn a ``SafeData`` object back into a normal ``str`` or ``unicode`` object and, rather than try to catch them all, which would be very difficult, Django repairs the damage after the filter has completed.
pt_br: A razão da necessidade do ``is_safe`` é porque existem muitas operações de string normais que tornarão um objeto ``SafeData`` de volta em uma ``str`` normal ou um objeto ``unicode`` e, melhor que tentar capturar todos eles, o que pode ser muito difícil, o Django repara o defeito depois que o filtro tenha terminado.
