Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If you have installed a :ref:`custom user model <auth-custom-user>` and want to use this default auth handler, it must support an ``is_active`` attribute. If you want to use group based authorization, your custom user must have a relation named 'groups', referring to a related object that has a 'name' field. You can also specify your own custom mod_wsgi auth handler if your custom cannot conform to these requirements.
it: Se hai installato un :ref:`modello utente personalizzato <auth-custom-user>` e vuoi utilizzare questo gestore di autenticazione predefinito, deve supportare un attributo ``is_active``. Se desideri utilizzare l'autorizzazione basata su gruppi, il tuo utente personalizzato deve avere una relazione denominata 'gruppi', che fa riferimento ad un oggetto correlato che ha un campo 'nome'. Puoi anche specificare il tuo gestore di autenticazione mod_wsgi personalizzato se per consuetudine non puoi conformarti a questi requisiti.
ja: もし :ref:`カスタムユーザーモデル<auth-custom-user>` をインストールしていて、このデフォルトの認証ハンドラを使用したい場合は、 ``is_active`` 属性をサポートしている必要があります。グループベースの認可を使用したい場合、カスタムユーザは 'group' という名前のリレーションを持ち、'name' フィールドを持つリレーション先のオブジェクトを参照する必要があります。カスタムの mod_wsgi 認証ハンドラがこれらの要件に適合しない場合は、 独自のカスタムの mod_wsgi 認証ハンドラを指定することもできます。
ko: :ref:'custom user model'을 설치한 경우 이 기본 인증 핸들러를 사용하려면 "is_active" 속성을 지원해야 합니다. 그룹 기반 인증을 사용하려면 사용자 지정 사용자에게 'name' 필드가 있는 관련 개체를 참조하는 'groups'라는 관계가 있어야 합니다. 또한 사용자 지정이 이러한 요구 사항을 충족할 수 없는 경우 사용자 지정 mod_wsgi 인증 처리기를 직접 지정할 수도 있습니다.
zh_hans: 若你已安装了一个 :ref:`自定义用户模型 <auth-custom-user>`，且想使用其默认认证处理器，它必须要支持 ``is_active`` 属性。若你想使用用户组授权，自定义用户必须有个关联名 'groups`，指向一个拥有 'name' 字段的关联对象。若自定义的无法满足上述要求，你也可以指定自定义 mod_wsgi 认证处理器。

source: Authentication with ``mod_wsgi``
it: Autenticazione con ``mod_wsgi``
ja: ``mod_wsgi`` による認証
ko: "mod_wsgi"로 인증
pt_br: Autenticação com ``mod_wsgi``
zh_hans: 用 ``mod_wsgi`` 进行授权认证

source: The use of ``WSGIApplicationGroup %{GLOBAL}`` in the configurations below presumes that your Apache instance is running only one Django application. If you are running more than one Django application, please refer to the `Defining Application Groups`_ section of the mod_wsgi docs for more information about this setting.
it: L'uso di ``WSGIApplicationGroup %{GLOBAL}`` nella configurazione qui sotto presume che la tua istanza di Apache stia facendo girare una sola applicazione Django. Se stai facendo girare più di una applicazione Django, fai riferimento alla sezione `Definire Gruppi di Applicazioni`_ della documentazione mod_wsgi per avere più informazioni su questa impostazione.
ja: 以下の設定における ``WSGIApplicationGroup %{GLOBAL}`` の使用は、 Apache インスタンスが 1 つの Django アプリケーションだけを実行していることを想定しています。複数の Django アプリケーションを実行している場合は、この設定については mod_wsgi ドキュメントの `Defining Application Groups`_ セクションを参照してください。
ko: 아래 구성에서 "WSGA 애플리케이션 그룹 %{GLOGL"을 사용하면 Apache 인스턴스가 Django 애플리케이션을 하나만 실행 중인 것으로 가정합니다. 둘 이상의 Django 응용 프로그램을 실행 중인 경우 이 설정에 대한 자세한 내용은 mod_wsgi 문서의 '응용 프로그램 그룹 정의' 섹션을 참조하십시오.
pt_br: O uso do ``WSGIApplicationGroup %{GLOBAL}`` nas configurações abaixo presume que a instância de Apache está rodando somente uma aplicação Django. Se estiver rodando mais de uma aplicação Django, por favor refira-se a seção `Defining Application Groups`_ da documentaçao mod_wsgi para maiores informações sobre essa configuração.
zh_hans: 以下配置文件中的 ``WSGIApplicationGroup %{GLOBAL}`` 假定 Apache 实例仅运行了一个 Django 应用。若你运行了不止一个 Django 应用，请参考 mod_wigi 文档的 `定义应用集群`_ 章节获取更多配置信息。

source: Make sure that mod_wsgi is installed and activated and that you have followed the steps to set up :doc:`Apache with mod_wsgi </howto/deployment/wsgi/modwsgi>`.
it: Assicurati che mod_wsgi sia installato ed attivato e che tu abbia seguito gli step per impostare :doc:`Apache con mod_wsgi </howto/deployment/wsgi/modwsgi>`.
ja: mod_wsgiがインストールされ、有効になっていることと、 :doc:`Apache と mod_wsgi </howto/deployment/wsgi/modwsgi>` をセットアップするステップに従っていることを確認してください。

source: Next, edit your Apache configuration to add a location that you want only authenticated users to be able to view:
it: Ora, modifica la tua configurazione di Apache per aggiungere una cartella che vuoi sia visibile solo ad utenti autenticati:
ja: 次に、Apacheの設定を編集して、認証されたユーザだけが閲覧できるようにしたい場所を追加します:
ko: 그런 다음 인증된 사용자만 볼 수 있는 위치를 추가하려면 Apache 구성을 편집하십시오.
pt_br: Depois, altere a configuração do Apache para adicionar um local que queira que somente usuários autenticados sejam capazes de ver:
zh_hans: 然后，编辑 Apache 配置，添加只允许授权用户查看的位置：

source: The ``WSGIAuthUserScript`` directive tells mod_wsgi to execute the ``check_password`` function in specified wsgi script, passing the user name and password that it receives from the prompt. In this example, the ``WSGIAuthUserScript`` is the same as the ``WSGIScriptAlias`` that defines your application :doc:`that is created by django-admin startproject </howto/deployment/wsgi/index>`.
it: La direttiva ``WSGIAuthUserScript`` dice a mod_wsgi di eseguire la funzione ``check_password`` nello script wsgi specificato, passando il nome utente e la password che riceve dal prompt. In questo esempio, ``WSGIAuthUserScript`` è lo stesso di ``WSGIScriptAlias`` che definisce la tua applicazione :doc:`creata da django-admin startproject </howto/deployment/wsgi/index>`.
ja: ``WSGIAuthUserScript`` ディレクティブは、プロンプトから受け取ったユーザ名とパスワードを渡して、指定した wsgi スクリプトの ``check_password`` 関数を実行するように mod_wsgi に指示します。この例では、 ``WSGIAuthUserScript`` は :doc:`django-admin startproject で作成される</howto/deployment/wsgi/index>` アプリケーションを定義する ``WSGIScriptAlias`` と同じです。
ko: ''WSGIAuthUserScript'' 지시문은 mod_wsgi에 지정된 wsgi 스크립트에서 "check_password" 기능을 실행하라고 지시하고 프롬프트에서 수신하는 사용자 이름과 암호를 전달한다. 이 예에서 ``WSGAuthUserScript"는 당신의 애플리케이션을 정의하는 ``WSGIScriptAlias"와 동일하며 이는 django-admin start project에서 만들어진 doc:"이다.
pt_br: A diretiva ``WSGIAuthUserScript`` diz ao mod_wsgi para executar função ``check_password`` no script wsgi especificado, passando o usuário e senha que recebeu do "prompt". Neste exemplo, o ``WSGIAuthUserScript`` é o mesmo que o ``WSGIScriptAlias`` que é quem define sua aplicação :doc:`that is created by django-admin startproject </howto/deployment/wsgi/index>`.
zh_hans: ``WSGIAuthUserScript`` 指令告诉 mod_wsgi 在指定 wsgi 脚本中执行 ``check_password`` 函数，并传递从提示符获取的用户名和密码。在本例中， ``WSGIAuthUserScript`` 与 ``WSGIScriptAlias`` 一样，后者 :doc:`由 django-admin startproject 创建 </howto/deployment/wsgi/index>`，定义了应用。

source: Using Apache 2.2 with authentication
it: Utilizzo di Apache 2.2 con autenticazione
ja: Apache 2.2 を認証とともに使う
ko: Apache 2.2 인증 사용법
pt_br: Usando Apache 2.2 com autenticação
zh_hans: 使用带身份验证的 Apache 2.2

source: Make sure that ``mod_auth_basic`` and ``mod_authz_user`` are loaded.
it: Controlla bene che ``mod_auth_basic`` e ``mod_authz_user`` siano caricati
ja: ``mod_auth_basic`` と ``mod_authz_user`` がロードされていることを確認してください。
ko: "mod_auth_basic"과 "mod_authz_user"가 로드되었는지 확인합니다.
pt_br: Certifique-se que ``mod_auth_basic`` e o ``mod_authz_user`` estão "carregados".
zh_hans: 确认 ``mod_auth_basic`` 和 ``mod_authz_user`` 被加载了。

source: These might be compiled statically into Apache, or you might need to use LoadModule to load them dynamically in your ``httpd.conf``:
it: Queste possono essere compilate staticamente in Apache, o potresti aver bisogno di usare LoadModule per caricarle dinamicamente nel tuo ``httpd.conf``:
ja: これらは Apache に静的にコンパイルされているかもしれませんし、LoadModule を使って ``httpd.conf`` で動的にロードする必要があるかもしれません:
ko: 이는 정적으로 Apache로 컴파일되거나 "httpd.conf"에 로드 모듈을 사용하여 동적으로 로드해야 할 수 있습니다.
pt_br: Esses podem ser compilados estaticamente dentro do Apache, ou é necessário usar o LoadModule para carregá-los dinamicamente no seu ``httpd.conf``:
zh_hans: 这些可能被静态编译进 Apache，或者用 LoadModule 在 ``httpd.conf`` 动态加载它们：

source: Finally, edit your WSGI script ``mysite.wsgi`` to tie Apache's authentication to your site's authentication mechanisms by importing the ``check_password`` function::
it: Infine, modifica il tuo script WSGI ``mysite.wsgi`` per legare l'autenticazione di Apache ai meccanismi di autenticaizione del tuo sito importando la funzione ``check_password``::
ja: 最後に、WSGIスクリプト ``mysite.wsgi`` を編集して、 ``check_password`` 関数をインポートすることで、Apacheの認証とサイトの認証メカニズムを紐づけます:
ko: 마지막으로 WSGI 스크립트 ``내 사이트"를 편집하십시오.wsgi는 다음과 같은 "check_password" 기능을 가져와 아파치의 인증을 사이트의 인증 메커니즘과 연결한다.
pt_br: Finalmente, altere seu script WSGI ``mysite.wsgi`` para conectar a autenticação do Apache ao mecanismo de autenticação do seu site importando a função ``check_password``::
zh_hans: 最后，编辑 WSGI 脚本 ``mysite.wsgi``，通过导入 ``check_password`` 函数，将 Apache 的认证授权机制接续在你站点的授权机制之后::

source: Requests beginning with ``/secret/`` will now require a user to authenticate.
it: Le richieste che iniziano con ``/secret/`` richiederanno un utente per l'autenticazione
ja: これで、 ``/secret/`` で始まるリクエストはユーザー認証が必要になりました。
ko: `/secret/``로 시작하는 요청은 이제 사용자가 인증해야 한다.
pt_br: Requisições começando com ``/secret/`` não requererão autenticação do usuário.
zh_hans: 以 ``/secret/`` 开头的请求现在会要求用户认证。

source: The mod_wsgi `access control mechanisms documentation`_ provides additional details and information about alternative methods of authentication.
it: La `documentazione sui meccanismi di controllo di accesso`_ di mod_wsgi offre dettagli aggiuntivi ed informazioni riguardo a metodi alternativi di autenticazione.
ja: mod_wsgi の `access control mechanisms documentation`_ に、認証の代替方法についての詳細と情報があります。
ko: mod_wsgi '액세스 제어 메커니즘 설명서'는 다른 인증 방법에 대한 추가 세부 정보와 정보를 제공한다.
pt_br: O mod_wsgi `access control mechanisms documentation`_ fornece detalhes adicionais e finromações sobre métodos alternativos de autenticação.
zh_hans: mod_wsgi `可达性控制机制文档`_ 提供了其它授权机制和方法的更多细节和信息。

source: Authorization with ``mod_wsgi`` and Django groups
it: Autorizzazione con ``mod_wsgi`` e gruppi Django
ja: ``mod_wsgi`` と Django グループを使った認可
ko: "mod_wsgi"와 "django" 그룹의 승인
pt_br: Autorização co ``mod_wsgi`` e grupos do Django
zh_hans: 利用 ``mod_wsgi`` 和 Django 用户组(groups)进行授权

source: mod_wsgi also provides functionality to restrict a particular location to members of a group.
it: mod_wsgi fornisce anche funzionalita di restringere una location particolare a un membro del gruppo.
ja: mod_wsgi は、グループのメンバーに特定の場所を制限する機能も提供します。
ko: mod_wsgi는 또한 특정 위치를 그룹의 멤버로 제한하는 기능을 제공한다.
pt_br: O mod_wsgi também fornece funcionalidade para restringir membros de um grupo a um local particular.
zh_hans: mod_wsgi 也提供了将组成员限制至特定路径的功能。

source: In this case, the Apache configuration should look like this:
it: In questo caso, la configurazione di Apache dovrebbe essere cosi :
ja: この場合、Apacheの設定は次のようになります:
ko: 이 경우 Apache 구성은 다음과 같아야 합니다.
pt_br: Neste caso, a configuração do Apache se pareça com essa:
zh_hans: 在本例中，Apache 配置应该看起来像这样：

source: To support the ``WSGIAuthGroupScript`` directive, the same WSGI script ``mysite.wsgi`` must also import the ``groups_for_user`` function which returns a list groups the given user belongs to.
it: Per supportare la direttiva ``WSGIAuthGroupScript``, lo stesso script WSGI ``mysite.wsgi`` deve anche importare la funzione ``groups_for_user`` che restituisce una lista di gruppi a cui un dato utente appartiene.
ja: ``WSGIAuthGroupScript`` ディレクティブをサポートするために、同じ WSGI スクリプト ``mysite.wsgi`` は、与えられたユーザが属しているグループのリストを返す ``groups_for_user`` 関数もインポートする必要があります。
ko: ``WSGAuthGroupScript"의 지시를 지지하기 위해 동일한 WSGI 스크립트는 "내 사이트"이다.wsgij는 또한 주어진 사용자가 속한 목록 그룹을 반환하는 ``groups_for_userstitute" 함수를 가져와야 한다.
pt_br: Para suportar a diretiva ``WSGIAuthGroupScript``, o mesmo script WSGI ``mysite.wsgi`` deve importar também a função ``groups_for_user`` que retorna uma lista de grupos aos quais o usuário pertence.
zh_hans: 要支持 ``WSGIAuthGroupScript`` 指令，同样的 WSGI 脚本 ``mysite.wsgi`` 必须也导入 ``groups_for_user`` 函数，函数会返回用户所属用户组的列表。

source: Requests for ``/secret/`` will now also require user to be a member of the "secret-agents" group.
it: Le richieste di ``/secret/`` renderanno necessario che l'utente faccia parte del gruppo "secret-agents"-
ja: これで、 ``/secret/`` に対するリクエストは、ユーザーが "secret-agents" グループのメンバーであることも要求するようになりました。
ko: "``/secret/`` 에 대한 요청도 이제 사용자가 "secret-agents"그룹의 구성원이어야 할 것이다.
pt_br: Agora as requisições para ``/secret/`` irão requerer que o usuário seja membro do grupo "secret-agents".
zh_hans: 对 ``/secret`` 的请求现在也会要求用户是 "secret-agents" 用户组的成员。

source: How to use Django with Gunicorn
it: Come installare Django con Gunicorn
ja: Django を Gunicorn とともに使う
ko: Gunicorn과 함께 django 사용방법
pt_br: Como usar o Django com o Gunicorn
zh_hans: 如何使用 Gunicorn 托管 Django

source: Gunicorn_ ('Green Unicorn') is a pure-Python WSGI server for UNIX. It has no dependencies and can be installed using ``pip``.
it: Gunicorn_ ('Green Unicorn') è un server Python puro per UNIX. Non ha dipendenze e può essere installato usando ``pip``.
ja: Gunicorn_ ('Green Unicorn') は UNIX 向けの pure-Python で実装されたWSGIサーバーです。依存はなく、 ``pip`` を使ってインストールできます。
ko: Gunicorn_('Green Unicon')는 UNIX용 Pure-Python WSGI 서버입니다. 종속성이 없으며 "파이프"를 사용하여 설치할 수 있다.

source: Installing Gunicorn
it: Installazione Gunicorn
ja: Gunicornのインストール
ko: Gunicorn 설치법
pt_br: Instalando o Gunicorn
zh_hans: 安装 Gunicorn

source: Install gunicorn by running ``python -m pip install gunicorn``. For more details, see the `gunicorn documentation`_.
it: Installa gunicorn lanciando ``python -m pip install gunicorn``. Per maggiori dettagli, guarda `gunicorn documentation`_.
ja: ``python -m pip install gunicorn`` を実行して gunicorn をインストールします。詳細は `gunicorn documentation`_ を参照してください。
ko: "python-mp install gunicorn"을 실행하여 gunicorn을 설치한다. 자세한 내용은`gunicorn documentation`_. 참조.

source: Running Django in Gunicorn as a generic WSGI application
it: Girare Django in Gunicorn come una applicazione generica WSGI
ja: GunicornでDjangoを一般的なWSGIアプリケーションとして動作させる
ko: 일반적인 WSGI 애플리케이션으로 Gunicorn에서 Django 실행
pt_br: Rodando Django em Gunicorn como uma aplicação WSGI genérica.
zh_hans: 把 Django 当作普通 WSGI 应用在 Gunicorn 中运行

source: When Gunicorn is installed, a ``gunicorn`` command is available which starts the Gunicorn server process. The simplest invocation of gunicorn is to pass the location of a module containing a WSGI application object named ``application``, which for a typical Django project would look like:
ja: Gunicorn がインストールされると、Gunicorn サーバプロセスを起動する ``gunicorn`` コマンドが利用できるようになります。gunicorn の最も単純な起動方法は、 ``application`` という WSGI アプリケーションオブジェクトを含むモジュールの場所を渡すことです 。典型的な Django プロジェクトでは次のようになります:

source: This will start one process running one thread listening on ``127.0.0.1:8000``. It requires that your project be on the Python path; the simplest way to ensure that is to run this command from the same directory as your ``manage.py`` file.
it: Avvierà un processo su cui gira un thread in ascolto su ``127.0.0.1:8000``. Richiede che il tuo progetto sia sul percorso Python; il modo più semplice di assicurartene è lanciare il comando dalla stessa directory in cui si trova il file ``manage.py``.
ja: このコマンドは ``127.0.0.1:8000`` を待ち受ける1つのスレッドを実行する1つのプロセスを開始します。プロジェクトは Python のパス上に置く必要があります。最も簡単な方法は ``manage.py`` ファイルと同じディレクトリからこのコマンドを実行することです。
ko: 이는 "127.0.0.1:8000"에서 하나의 스레드를 청취하는 하나의 과정을 시작할 것이다. 프로젝트가 Python 경로에 있어야 합니다. 이 명령을 ``관리"와 동일한 디렉토리에서 실행하는 가장 간단한 방법입니다.
pt_br: Isso irá iniciar um processo de uma thread escutando na ``127.0.0.1:8000``. Isso requer que seu projeto esteja no path Python; a maneira mais simples de verificar isso é rodar este comando do memso diretório que seu arquivo ``manage.py``
zh_hans: 这样会创建一个进程，包含了一个监听在 ``127.0.0.1:8000`` 的线程。前提是你的项目在 Python path 中，要满足这个条件，最简单的方法是在 ``manage.py`` 文件所在的目录中运行这条命令。

source: See Gunicorn's `deployment documentation`_ for additional tips.
it: Vedi la `documentazione per il deploy`_ di Gunicorn per consigli aggiuntivi.
ja: その他のヒントについては、Gunicorn の `deployment documentation`_ を参照してください。
ko: 자세한 내용은 Gunicorn의 '배치 설명서'를 참조하십시오.
pt_br: Veja a `deployment documentation`_ do Gunicorn para dicas adicionais
zh_hans: 更多技巧请参考 Gunicorn 的 `部署文档`_ 。

source: How to deploy with WSGI
it: Come distribuire con WSGI.
ja: WSGI とともにデプロイするには
ko: WSGI를 사용하여 배포하는 방법
pt_br: Como implantar com WSGI
zh_hans: 如何使用 WSGI 进行部署

source: Django's primary deployment platform is WSGI_, the Python standard for web servers and applications.
it: La piattaforma primaria di deploy di Django è WSGI_, lo standard Python per web server ed applicazioni.
ja: Django の主要なデプロイプラットフォームは、 Web サーバと Web アプリケーション に関して Python の標準である WSGI_ です。
ko: Django의 기본 배포 플랫폼은 웹 서버 및 애플리케이션을 위한 Python 표준인 WSGI_입니다.
pt_br: A principal plataforma de implantação do Django é WSGI_, o padrão Python para servidores web e aplicações.
zh_hans: Django 的主要部署平台是 WSGI_，它是 Web 服务器和 Web 应用的 Python 标准。

source: Django's :djadmin:`startproject` management command sets up a minimal default WSGI configuration for you, which you can tweak as needed for your project, and direct any WSGI-compliant application server to use.
it: Il comando di gestione di Django :djadmin:`startproject` imposta una configurazione WSGI di default minima per te, che puoi mettere a punto a seconda di quel necessita il progetto e fare in modo che ogni server di applicazione WSGI compliant la usi.
ja: Django の :djadmin:`startproject` 管理コマンドは、最小限のデフォルト WSGI 設定をセットアップしてくれます 。このデフォルト WSGI 設定は、あなたのプロジェクトに合わせて調整でき、WSGI に準拠したアプリケーションサーバにその設定を使用させることができます。
ko: Django의 :djadmin:'start project' 관리 명령은 프로젝트에 필요한 대로 수정할 수 있는 최소 기본 WSGI 구성을 설정하고 WSGI 호환 애플리케이션 서버를 사용하도록 지시합니다.

source: Django includes getting-started documentation for the following WSGI servers:
it: Django comprende la documentazione per iniziare con i seguenti server WSGI:
ja: Django には以下の WSGI サーバのために、手引きとなるドキュメントが用意されています:
ko: Django에는 다음 WSGI 서버에 대한 시작 설명서가 포함되어 있습니다.
pt_br: O Django inclui documentação básica para os seguintes seervidores WSGI:
zh_hans: Django 提供了下面这些 WSGI 服务的入门文档：

source: The key concept of deploying with WSGI is the ``application`` callable which the application server uses to communicate with your code. It's commonly provided as an object named ``application`` in a Python module accessible to the server.
it: Il concetto chiave del deploy con WSGI è l'``application`` richiamabile che il server dell'applicazione usa per comunicare con il tuo codice. Comunemente è fornita come un oggetto di nome ``application`` in un modulo Python accessibile al server.
ja: WSGI デプロイでキーとなる概念は、Web サーバがあなたのコードと通信するために使う ``application`` という呼び出し可能オブジェクトです。これは一般的に、サーバにアクセスできる Python モジュールの中で ``application`` という名前のオブジェクトとして提供されています。
ko: WSGI와 함께 배치하는 핵심 개념은 애플리케이션 서버가 코드와 통신하기 위해 사용하는 "애플리케이션" 호출 가능이다. 그것은 일반적으로 서버가 접근할 수 있는 파이썬 모듈에서 "애플리케이션"이라는 이름의 객체로 제공된다
pt_br: O conceito chave para implantação com WSGI é o executável ``application`` o qual o servidor de aplicação usa para se comunicar com seu código. Isso é comumente fornecido como um objeto chamado ``application`` em um módulo Python acessível ao servidor.
zh_hans: 用 WSGI 部署的关键是 ``application`` callable，应用服务器用它与你的代码交互。 ``application`` callable 一般以一个位于 Python 模块中，名为 ``application`` 的对象的形式提供，且对服务器可见。

source: The :djadmin:`startproject` command creates a file :file:`<project_name>/wsgi.py` that contains such an ``application`` callable.
it: Il comando :djadmin:`startproject` crea un file :file:`<project_name>/wsgi.py` che contiene tale ``application`` richiamabile.
ja: :djadmin:`startproject` コマンドは、この ``application`` 呼び出し可能オブジェクトを含む :file:`<project_name>/wsgi.py` ファイルを生成します。
ko: :djadmin:'start project' 명령은 :file:'/wsgi 파일을 생성합니다.그러한 ``응용프로그램"을 포함한 py는 호출할 수 있다.
pt_br: O comando :djadmin:`startproject` cria um arquivo :file:`<project_name>/wsgi.py` que contém a tal ``application`` executável.
zh_hans: :djadmin:`startproject` 命令创建了文件 :file:`<project_name>/wsgi.py`，其中包含了 ``application`` callable。

source: It's used both by Django's development server and in production WSGI deployments.
it: E' utilizzato sia da server di sviluppo Django sia da server di produzione WSGI.
ja: これは、Django のデプロイサーバーによって、また WSGI デプロイプロダクションにおいて、これら両方で使われます。
ko: Django의 개발 서버와 프로덕션 WSGI 배포에서 모두 사용됩니다.
pt_br: Ele é usado tanto para o servidor de desenvolvimento do Django quanto para a implantação WSGI para produção.
zh_hans: Django 开发服务器和生产环境的 WSGI 部署都用到了它。

source: WSGI servers obtain the path to the ``application`` callable from their configuration. Django's built-in server, namely the :djadmin:`runserver` command, reads it from the :setting:`WSGI_APPLICATION` setting. By default, it's set to ``<project_name>.wsgi.application``, which points to the ``application`` callable in :file:`<project_name>/wsgi.py`.
it: I server WSGI ottengono il percorso all'``application`` chiamabile dalla loro configurazione. Il server built-in di Django, cioè il comando :djadmin:`runserver`, lo legge dall'impostazione :setting:`WSGI_APPLICATION`. Di norma, è impostato a ``<project_name>.wsgi.application``, che punta all'``application`` callable in :file:`<project_name>/wsgi.py`.
ja: WSGI サーバーは ``application`` 呼び出し可能オブジェクトへのパスを、その設定から取得します。Django のビルトインサーバー (要するに :djadmin:`runserver` コマンド) は、:setting:`WSGI_APPLICATION` の設定からこれを読み出します。デフォルトでは、 :file:`<project_name>/wsgi.py` 内の ``application`` 呼び出し可能オブジェクトを指す ``<project_name>.wsgi.application`` がセットされています。
ko: WSGI 서버는 구성에서 호출 가능한 "애플리케이션"의 경로를 얻는다. Django의 내장 서버, 즉 :djadmin:'runserver' 명령어는 :set 에서 읽는다.'WSGI_APPLICATION' 설정. 기본적으로 이 프로그램은 ".wsgi.application"으로 설정되어 있는데, 이는 ":file:"/wsgi.py으로 호출 가능한 애플리케이션"을 가리킵니다.
zh_hans: WSGI 服务器从其配置中获取 ``application`` callable 的路径。Django 的默认服务器（ :djadmin:`runserver` 命令），从配置项 :setting:`WSGI_APPLICATION` 中获取。默认值是 ``<project_name>.wsgi.application``，指向 :file:`<project_name>/wsgi.py` 中的 ``application`` callable。

source: When the WSGI server loads your application, Django needs to import the settings module — that's where your entire application is defined.
it: Quando il server WSGI carica la tua applicazione, Django ha bisogno di importare il modulo settings - che è il posto dove la tua intera applicazione è definita.
ja: WSGI サーバがあなたのアプリケーションを読み込むとき、Django は Settings モジュールをインポートする必要があります。そのモジュールは、あなたのアプリケーション全体が定義されている場所です。
ko: WSGI 서버가 응용프로그램을 로드할 때 Django는 전체 응용프로그램이 정의된 설정 모듈을 가져와야 합니다.
pt_br: QUando o servidor WSGI carrega sua aplicação, o Django precisa importar o módulo de definições que é onde toda a sua aplicação é definida.
zh_hans: 当 WSGI 服务器加载应用时，Django 需要导入配置模块——完整定义应用的地方。

source: If this variable isn't set, the default :file:`wsgi.py` sets it to ``mysite.settings``, where ``mysite`` is the name of your project. That's how :djadmin:`runserver` discovers the default settings file by default.
it: Se questa variabile non è impostata, il file predefinito :file:`wsgi.py` lo imposta a ``mysite.settings``, dove ``mysite`` è il nome del tuo progetto. Ecco come di norma :djadmin:`runserver` scopre il file delle impostazioni predefinite.
ja: この値が設定されていない場合、初期生成ファイルである :file:`wsgi.py` は、 ``mysite.settings`` をこの値として設定します。ここでの ``mysite`` はプロジェクトの名前です。このようにして初期設定ファイルを見つけるのが、 :djadmin:`runserver` にあらかじめ用意されている方法です。
ko: 이 변수가 설정되지 않은 경우 기본값:file:'wsgi'입니다.py는 그것을 ``내 사이트"로 설정한다."내 사이트"가 프로젝트의 이름인 설정"입니다. 이렇게 하면 :djadmin:'runserver'는 기본적으로 기본 설정 파일을 검색합니다.
pt_br: Se essa variáve não está setada, o padrão :file:`wsgi.py` define isso como ``mysite.settings``, onde ``mysite`` é o nome do seu projeto. Assim é o padrão de como o :djadmin:`runserver` descobre o arquivo de definições padrão.
zh_hans: 若未设置该变量， :file:`wsgi.py` 默认将其设置为 ``mysite.settings``， ``mysite`` 即工程名字。这就是 :djadmin:`runserver` 默认的发现默认配置行为。
