Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Django's built-in filters have ``autoescape=True`` by default in order to get the proper autoescaping behavior and avoid a cross-site script vulnerability.
it: I filtri built-in di Django hanno di default "autoescape=True" al fine di assicurare il corretto autoescaping ed evitare vulnerabilità di tipo cross-site script.
ja: Django に組み込みのフィルタは、適切な自動エスケープを行い、クロスサイトスクリプティング（XSS）の脆弱性を回避するために、デフォルトで ``autoescape=True`` となっています。
ko: django의 내장 필터에는 ``autoescape=True"이 있다.올바른 자동 이스케이프 동작을 취하고 사이트 간 스크립트의 취약성을 피하기 위해 기본적으로 True'를 선택합니다.
pt_br: Os fiiltros embutidos do Django tem por padrão ``autoescape=True`` para que receba propriamente o comportamento da auto-substituição e evite a vulnerabilidade de "cross-site" .
zh_hans: Django 内置的过滤器默认配置 ``autoescape=True``，获取合适的自动转义行为，并避免跨站脚本漏洞。

source: In older versions of Django, be careful when reusing Django's built-in filters as ``autoescape`` defaults to ``None``. You'll need to pass ``autoescape=True`` to get autoescaping.
it: Nelle vecchie versioni di Django, fai attenzione quando riusi i filtri built-in di Django perchè ``autoescape`` viene impostato di default a ``None``. Dovrai passare ``autoescape=True`` per fare autoescaping.
ja: 古いバージョンの Django では、 ``autoescape`` のデフォルトは ``None`` ですので、 Django の組み込みのフィルタを再利用する際には注意してください。オートエスケープを有効にするには ``autoescape=True`` を渡す必要があります。
ko: 이전 버전의 장고에서는 장고의 내장 필터를 ``자동 탈출" 디폴트로 재사용할 때 주의해야 한다. ``자동 탈출"을 통과해야 할 것이다.맞다'는 말은 자동 탈출을 하는 것이다.
pt_br: Em versões antigas do Djagno, tenha cuidado quando reutilizar filtros embutidos como ``autoescape`` definidos por padrão como ``None``. Será necessário passar ``autoescape=True`` para ter a auto-substituição.
zh_hans: 在旧版本的 Django 中，复用 Django 内置过滤器时要小心，因为 ``自动转义`` 默认为 ``None``。你需要传入 ``autoescape=True`` 启用自动转义。

source: For example, if you wanted to write a custom filter called ``urlize_and_linebreaks`` that combined the :tfilter:`urlize` and :tfilter:`linebreaksbr` filters, the filter would look like::
it: Per esempio, se volessi scrivere un filtro custom chiamato ``urlize_and_linebreaks`` che combina i filtri :tfilter:`urlize` e :tfilter:`linebreaksbr`, avrebbe questo aspetto::
ja: 例えば、 :tfilter:`urlize` フィルタと :tfilter:`linebreaksbr` フィルタを組み合わせた ``urlize_and_linebreaks`` というカスタムフィルタを書きたい場合、フィルタは次のようになります:
ko: 예를 들어 :t필터를 조합한 "urlize_and_linebreaks"라는 사용자 정의 필터를 작성하려는 경우:urlize와 :tfilter:"line breaksbr" 필터의 모양은 다음과 같습니다.
pt_br: Por exemplo, se quer escrever um filtro personalizado chamado ``urlize_and_linebreaks``que combine os filtros :tfilter:`urlize` e :tfilter:`linebreaksbr`, o filtro deveria parecer com::
zh_hans: 举个例子，如果你想编写一个联合 :tfilter:`urlize` 和 :tfilter:`linebreaksbr` 过滤器的，名为 ``urlize_and_linebreaks`` 的自定义过滤器，可通过以下代码::

source: Then:
it: Poi
ja: 次のように使います:
ko: 그러면
pt_br: Então:
zh_hans: 接下来：

source: would be equivalent to:
it: sarebbe equivalente a:
ja: これは以下と同等です:
ko: 다음과 같습니다:
pt_br: seria equivalente a:
zh_hans: 等价于：

source: Filters and time zones
it: Filtri e time zones
ja: フィルタとタイムゾーン
ko: 필터 및 시간대
pt_br: Filtros e fusos horários
zh_hans: 过滤器和时区

source: If you write a custom filter that operates on :class:`~datetime.datetime` objects, you'll usually register it with the ``expects_localtime`` flag set to ``True``::
it: Se scrivessi un filtro custom che opera sugli oggetti :class:`~datetime.datetime`, normalmente lo registreresti con il flag ``expects_localtime`` a ``True``::
ja: :class:`~datetime.datetime` オブジェクトを操作するカスタムフィルタを書く場合、通常は ``expects_localtime`` フラグを ``True`` に設定して登録します:
ko: 만일 Class: datetime.datetime 의 Object 에 적용되는 커스텀 필터를 사용할려면 보통은 그것을 "expects_localtime" 이라는 플래그에 True 라고 세팅 해야합니다.
pt_br: Se escrever filtros personalizados que operam objetos :class:`~datetime.datetime`, geralmente registra-se com a flag ``expects_localtime``definido como ``True``::
zh_hans: 如果你编写了一个自定义过滤器，处理 :class:`~datetime.datetime` 对象，注册过滤器时通常将 ``expects_localtime`` 标志置为 ``True``::

source: When this flag is set, if the first argument to your filter is a time zone aware datetime, Django will convert it to the current time zone before passing it to your filter when appropriate, according to :ref:`rules for time zones conversions in templates <time-zones-in-templates>`.
it: Quando questo flag è impostato, se il primo argomento del tuo filtro è un datetime con time zone, Django lo converte alla time zone corrente prima di passarlo al tuo filtro ove appropriato, secondo le :ref:`regole per le conversioni delle time zone nei template <time-zones-in-templates>`.
ja: このフラグがセットされていると、フィルタの最初の引数がタイムゾーンを意識した datetime である場合、Django は :ref:`テンプレートにおけるタイムゾーン変換ルール <time-zones-in-templates>` に従って、フィルタに渡す前に現在のタイムゾーンに変換します。
ko: 플래그값이 세팅 되었을때 만일 필터의 첫번째 인자가 datetime 이 허용하는 time zone 이라면 장고는 적절한 싯점에 time zone 에 대한 참조 규칙에 의거한 정형화된 변경을 하도록 그 필터를 전달함으로서 현재의 time zone 으로 바꾸 도록 합니다.
pt_br: Quando esta flag está definida, se o primeiro argumento do seu filtro é uma date-time que leva em consideração o fuso-horário, o Django irá convertê-lo para o fuso-horário corrente antes de passa-lo para o filtro quando apropriado, de acordo com :ref:`rules for time zones conversions in templates <time-zones-in-templates>`.
zh_hans: 设置该标志后，如果过滤器接收的第一个参数是一个时区敏感的 datetime，Django 在将其传递给过滤器前的某个合适时间将其转换为当前时区的时间，依据 :ref:`模板中的时区转换规则 <time-zones-in-templates>`。

source: Writing custom template tags
it: Scrivere template tag personalizzati
ja: 独自のテンプレートタグを記述する
ko: 커스텀 탬플릿 태그 만들기
pt_br: Escrevendo tags de templates personalizadas.
zh_hans: 编写自定义模板标签

source: Tags are more complex than filters, because tags can do anything. Django provides a number of shortcuts that make writing most types of tags easier. First we'll explore those shortcuts, then explain how to write a tag from scratch for those cases when the shortcuts aren't powerful enough.
it: I tag sono più complessi dei filtri, perchè i tag possono fare qualsiasi cosa. Django offre degli shortcut che rendono la scrittura di molti tipi di tag più semplice. Prima esploreremo questi shortcut, poi spiegheremo come scrivere un tag da zero per quei casi in cui gli shortcut non bastano.
ja: タグはあらゆることができるため、フィルタより複雑です。Django は、ほとんどのタイプのタグを簡単に書けるように、多数のショートカットを提供しています。まず最初にこうしたショートカットを見てから、ショートカットでは機能が不足している場合にゼロからタグを書く方法を説明します。
ko: 태그는 필터보다 더 복잡합니다, 그 이유는 태그가 그 어떤것도 할 수 있기 때문입니다. 장고는 빠르고 쉬운 다양한 태그 작성법을 만들도록 합니다. 먼저 우리는 이들 빠른 방법을 탐색 할 것 입니다. 그 다음에 그 빠른 방법이 충분하다고 생각되지 않으면 태그 작성법을 스크래치(끄적거림) 부터 설명 할 겁니다.
pt_br: Tags são mais complexas que filtros, porque as tags podem fazer qualquer coisa. Django fornece inúmeros atalhos para fazer com que a escrita de várias tags seja mais fácil. Primeiro iremos explorar estes atalhos, e então explicar como escrever uma tag do início para aqueles casos em que os atalhos não são poderosos o suficiente.
zh_hans: 标签比过滤器更复杂，因为标签啥都能做。Django 提供了很多快捷方式，简化了编写绝大多数类型的标签过程。我们先探索这些快捷方式，然后解释如何在快捷方式不够强大的情况下从零编写标签。

source: Simple tags
it: Semplici tag
ja: シンプルなタグ
ko: 간단한 태그
pt_br: Tags simples
zh_hans: 简单标签

source: Many template tags take a number of arguments -- strings or template variables -- and return a result after doing some processing based solely on the input arguments and some external information. For example, a ``current_time`` tag might accept a format string and return the time as a string formatted accordingly.
it: Molti template tag prendono un certo numero di argomenti -- stringhe o variabili di template -- e restituiscono un risultato dopo aver fatto qualche processamento basato esclusivamente sugli argomenti di input e qualche informazione esterna. Per esempio, un tag ``current_time`` potrebbe accettare una stringa di formattazione e restituire l'ora come stringa formatta di conseguenza.
ja: 多くのテンプレートタグは、文字列やテンプレート変数などの引数を取り、入力引数と外部情報のみに基づいて処理を行った後、結果を返します。 たとえば、``current_time`` タグはフォーマット文字列を受け取り、その時刻を適切な文字列フォーマットとして返します。
ko: 대부분의 템플릿 태그는 문자열 또는 템플릿 변수 등 여러 인수를 사용하고 입력 인수와 일부 외부 정보만을 기반으로 일부 처리를 수행한 후 결과를 반환합니다. 예를 들어 "current_time" 태그는 형식 문자열을 허용하고 그에 따라 형식을 지정한 문자열로 시간을 반환할 수 있다.
pt_br: Muitas tags de templates recebem inúmeros argumentos -- strings ou variáveis de templates -- e retornam um resultado depois de fazer algum processamento baseado somente nos argumentos de entrada e alguma informação externa. Por exemplo, uma tag ``current_time`` aceitaria uma string de formato e retorna a hora como uma string formatada de acordo.
zh_hans: 许多模板标签接受多个参数——字符串或模板变量——并仅根据输入参数和一些额外信息进行某种处理，并返回结果。例如， ``current_time`` 标签可能接受一个格式字符串，并将时间按照字符串要求的格式返回。

source: To ease the creation of these types of tags, Django provides a helper function, ``simple_tag``. This function, which is a method of ``django.template.Library``, takes a function that accepts any number of arguments, wraps it in a ``render`` function and the other necessary bits mentioned above and registers it with the template system.
it: Per facilitare la creazione di questi tipi di tag, Django fornisce una funzione helper, ``simple_tag``. Questa funzione, che è un metodo di ``django.template.Library``, prende una funzione che accetta un numero arbitrario di argomenti, la racchiude in una funzione ``render`` e le altre parti necessarie menzionate prima e la registra nel sistema di template.
ja: これらのタイプのタグの作成を容易にするため、Django はヘルパー関数 ``simple_tag`` を提供しています。 この関数は ``django.template.Library`` のメソッドで、任意の数の引数を受け取る関数を取り、それを ``render`` 関数と上記で説明した他の必要なビットにラップし、そしてテンプレートシステムに登録します。
ko: 이러한 유형의 태그를 쉽게 만들 수 있도록 Django는 "simple_tag"라는 도우미 기능을 제공합니다. 이 기능은 ``django. template"의 한 방법이다.라이브러리'는 임의의 수의 인수를 수용하여 이를 "렌더" 기능과 위에서 언급한 다른 필요한 비트로 감싸서 템플릿 시스템에 등록한다
pt_br: Para facilitar a criação destes tipos de tags, Django fornece uma função de auxílio, ``simple_tag``. Essa função, a qual é um método de ``django.template.Library``, tem uma função que recebe qualquer número de parâmetros, empacota isso em uma função ``renderizadora`` junto com os "bits" mencionados acima e o registra com o sistema de templates.
zh_hans: 为了简化创建标签类型的流程，Django 提供了一个助手函数， ``simple_tag``。该函数实际是 ``django.template.Library`` 的一个方法，该函数接受任意个数的参数，将其封装在一个 ``render`` 函数以及上述其它必要的位置，并用模板系统注册它。

source: Our ``current_time`` function could thus be written like this::
it: La nostra funzione ``current_time`` dovrebbe essere scritta così::
ja: 私たちの ``current_time`` 関数は、以下のように書くことができます::
ko: 따라서 우리의 ``current_time" 기능은 다음과 같이 쓰여질 수 있다.
pt_br: Nossa função ``current_time`` poderia então ser escrita assim::
zh_hans: 我们的 ``current_time`` 函数因此能这样写::

source: A few things to note about the ``simple_tag`` helper function:
it: Alcune cose da notare a proposito della funzione helper ``simple_tag``:
ja: ``simple_tag`` ヘルパー関数について、注意すべきことがいくつかあります:
ko: "단순_태그" 도우미 기능에 대해 몇 가지 주목할 점은 다음과 같다.
pt_br: Algumas coisas para perceber sobre a função de auxílio ``simple_tag``:
zh_hans: 关于 ``simple_tag`` 助手函数，有几点要注意：

source: Checking for the required number of arguments, etc., has already been done by the time our function is called, so we don't need to do that.
it: Controllare il numero richiesto di argomenti ecc...viene già fatto quando la funzione viene chiamata, quindi non dobbiamo farlo.
ja: 必須の引数の数などのチェックは、すでにこの関数が呼ばれる時点までに完了しているため、自分でチェックをする必要はありません。
ko: 필요한 수의 인수 등을 확인하는 작업은 기능이 호출될 때까지 이미 수행되었으므로 그렇게 할 필요가 없습니다.
pt_br: A checagem do número de arrgumentos, etc, já foi feito na hora em que a função é chamada, então não precisamos faze-lo.
zh_hans: 检测要求参数的个数等在调用函数时就已完成，所以我们无需再做。

source: The quotes around the argument (if any) have already been stripped away, so we receive a plain string.
it: Le virgolette attorno all'argomento (se ce ne sono) sono già state eliminate, quindi riceviamo una stringa semplice.
ja: 引数を囲む引用符（もしあれば）はすでに取り除かれているので、プレーンな文字列を受け取ります。
ko: 인수에 대한 따옴표가 이미 제거되었으므로 일반 문자열을 수신합니다.

source: If the argument was a template variable, our function is passed the current value of the variable, not the variable itself.
it: Se l'argomento era una variabile di template, alla nostra funzione viene passato il valore corrente della variabile, non la variabile stessa.
ja: もし引数がテンプレート変数だった場合、テンプレート中でタグが呼ばれた時点の値が渡されます。テンプレート変数そのものが渡されるわけではありません。
ko: 인수가 템플릿 변수였다면, 우리의 함수는 변수 자체가 아니라 변수의 현재 값을 전달합니다.
pt_br: Se o argumento era uma variável de template, é passada par a nossa função o valor atual da variável, e não a própria variável.
zh_hans: 如果参数是一个模板变量，函数将传递变量值，而不是变量本身。

source: Unlike other tag utilities, ``simple_tag`` passes its output through :func:`~django.utils.html.conditional_escape` if the template context is in autoescape mode, to ensure correct HTML and protect you from XSS vulnerabilities.
it: A differenza di altre utilità di tag, ``simple_tag`` passa il suo output attraverso :func:`~django.utils.html.conditional_escape` se il template context è in modalità autoescape, per assicurare un HTML corretto e proteggerti da vulnerabilità XSS.
ja: 他のタグユーティリティとは異なり、 ``simple_tag`` は、テンプレートコンテキストが自動エスケープモードの場合、 :func:`~django.utils.html.conditional_escape` を通して出力を渡します。
ko: "simple_tag"는 다른 태그 유틸리티와 달리 템플릿 컨텍스트가 자동 이스케이프 모드인 경우 출력을 func:'~django.utils.html.conditional_escape'를 통해 전달하여 올바른 HTML을 보장하고 XSS 취약점으로부터 사용자를 보호합니다.
pt_br: Diferente de outras ferramentas de tag, ``simple_tag`` passa sua saida através do :func:`~django.utils.html.conditional_escape` se o contexto do tempte está no modo auto-substituição, para assegurar o HTML e proteger da vulnerabilidade XSS.
zh_hans: 若模板上下文处于自动转义模式，不像其它标签实体， ``simple_tag`` 通过 :func:`~django.utils.html.conditional_escape` 传递输出，为了确保输出正确的 HTML，避免 XSS 漏洞的威胁。

source: If additional escaping is not desired, you will need to use :func:`~django.utils.safestring.mark_safe` if you are absolutely sure that your code does not contain XSS vulnerabilities. For building small HTML snippets, use of :func:`~django.utils.html.format_html` instead of ``mark_safe()`` is strongly recommended.
it: Se non si desidera un escaping aggiuntivo, sarà necessario utilizzare :func:`~django.utils.safestring.mark_safe` solo se si è assolutamente sicuri che il codice non contenga vulnerabilità XSS. Per creare piccoli frammenti di codice HTML, è fortemente raccomandato l'uso di :func:`~django.utils.html.format_html` invece di ``mark_safe()``.
ja: 追加のエスケープが不要な場合、コードに XSS 脆弱性が絶対にないと確信できるのであれば、 :func:`~django.utils.safestring.mark_safe` を使う必要があります。小さな HTML コードを作成する場合は、 ``mark_safe()`` の代わりに :func:`~django.utils.html.format_html` を使うことを強く推奨します。
ko: 추가 이스케이프가 필요하지 않은 경우 코드에서 XSS 취약성이 포함되지 않은 것이 확실한 경우 func:'~django.utils.safeestring.mark_safe'를 사용해야 합니다. 작은 HTML 조각을 만들 때는 ``mark_safe()" 대신 :func:'~django.utils.html.format_html'을 사용하는 것이 좋다.
pt_br: Se substituições adicionais não são desejadas, é necessário usar :func:`~django.utils.safestring.mark_safe` se você tem a certeza absoluta que seu código não contém vulnerabilidade XSS. Para construir pequenos fragmentos de HTML, é fortemente recomendado usar :func:`~django.utils.html.format_html` ao invés de ``mark_safe()``
zh_hans: 如果不需要额外转义，你可能需要在万分确定您的代码不会引入任何 XSS 漏洞的情况下使用 :func:`~django.utils.safestring.mark_safe`。如果只是构建小的 HTML 片段，强烈建议使用 :func:`~django.utils.html.format_html`，而不是 ``mark_safe()``。

source: If your template tag needs to access the current context, you can use the ``takes_context`` argument when registering your tag::
it: Se il tuo tag nel template ha bisogno di accedere al context corrente, puoi usare l'argomento ``takes_context`` quando registri il tuo tag::
ja: テンプレートタグの中からコンテキストにアクセスしたい場合、タグを登録する際に ``takes_context`` 引数を使うことでできるようになります。
ko: 템플릿 태그가 현재 컨텍스트에 액세스해야 하는 경우 태그 등록 시 "takes_context" 인수를 사용할 수 있습니다.
pt_br: Se a template tag precisa acessar o contexto corrente, você pode usar o argumento ``takes_context`` quando registrá-la::
zh_hans: 若您的模板标签需要访问当前上下文，你可以在注册标签时传入 ``takes_context`` 参数::

source: Note that the first argument *must* be called ``context``.
it: Nota che il primo argomento deve chiamarsi "context"
ja: 最初の引数は ``context`` に *しなければならない* ことに注意してください。
ko: 첫 번째 논거를 *context*라고 해야 한다는 점에 유의하십시오.
pt_br: Perceba que o primeiro argumento **deve** ser chamado "context".
zh_hans: 注意，第一个参数必须是 ``context``。

source: For more information on how the ``takes_context`` option works, see the section on :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.
it: Per ulteriori informazioni su come funziona l'opzione ``takes_context`` vedere la sezione su :ref:`inclusion tags <howto-custom-template-tags-inclusion-tags>`.
ja: ``takes_context`` オプションがどのように動くかについて、詳しくは :ref:`inclusion tag <howto-custom-template-tags-inclusion-tags>` を参照してください。
ko: "takes_context" 옵션의 작동 방식에 대한 자세한 내용은 ref:"포함 태그" 섹션을 참조하십시오.
pt_br: Para maiores informações sobre como a opção ``takes_context`` funciona, veja a seção :ref:`inclusion tags<howto-custom-template-tags-inclusion-tags>`.
zh_hans: 更多关于 ``takes_context`` 选项如何工作的信息，参见章节 :ref:`包含标签 <howto-custom-template-tags-inclusion-tags>`。

source: If you need to rename your tag, you can provide a custom name for it::
it: Se hai bisogno dirinominare il tag, puoi fornirne un nome personalizzato::
ja: タグの名前を変更する必要がある場合は、カスタム名を指定できます:
ko: 태그 이름을 변경해야 하는 경우 태그의 사용자 지정 이름을 제공할 수 있습니다.
pt_br: Se você precisar renomear a tag, você pode fornecer um nome personalizado para ele::
zh_hans: 若你需要重命名标签，你可以为其提供一个自定义名称::

source: ``simple_tag`` functions may accept any number of positional or keyword arguments. For example::
it: Le funzioni ``simple_tag`` possono accettare un numero qualsiasi di argomenti posizionali o di parole chiave. Per esempio::
ja: ``simple_tag`` 関数は任意の数の位置引数またはキーワード引数を受け取ることができます。例えば:
ko: ''단순_태그 함수들은 위치 또는 키워드 인수를 얼마든지 수용할 수 있다. 예:
pt_br: As funções ``simple_tag`` aceitam qualquer número de argumentos posicionais ou nomeados. Por exemplo::
zh_hans: ``simple_tag`` 函数可以接受任意数量的位置或关键字参数。例如::

source: Then in the template any number of arguments, separated by spaces, may be passed to the template tag. Like in Python, the values for keyword arguments are set using the equal sign ("``=``") and must be provided after the positional arguments. For example:
it: Quindi nel template qualsiasi argomento, separato da spazi, può essere passato al tag del template. Come in Python, i valori per gli argomenti delle parole chiave sono impostati usando il segno di uguale ("``=``") e devono essere inseriti dopo gli argomenti posizionali. Per esempio:
ja: このようにすることで、テンプレートからはスペースで区切られた変数をいくつでもテンプレートタグに渡すことができます。Pythonの文法と同じように、キーワード引数の値は等号（"``=``"）を用いて位置引数の後に記述します。たとえば：
ko: 그런 다음 템플릿에서 공백으로 구분된 개수의 인수를 템플릿 태그에 전달할 수 있습니다. Python에서처럼 키워드 인수의 값은 동일한 부호("' =를 사용하여 설정되며, 위치 인수 뒤에 제공되어야 한다. 예:
pt_br: Então no template qualquer número de argumentos, separados por espaços podem ser passados para a atg de template. Como em Python, os valores para argumentos nomeados são definidos usando o sinal de igua ("`=`") e devem ser fornecidos depois dos argumentos posicionais. Por exemplo:
zh_hans: 随后在模板中，任意数量的，以空格分隔的参数会被传递给模板标签。与 Python 中类似，关键字参数的赋值使用等号（"``=``"），且必须在位置参数后提供。例子：

source: It's possible to store the tag results in a template variable rather than directly outputting it. This is done by using the ``as`` argument followed by the variable name. Doing so enables you to output the content yourself where you see fit:
it: È possibile memorizzare i risultati del tag in una variabile del template anziché esporlo direttamente. Questo viene fatto usando l'argomento ``as`` seguito dal nome della variabile. In questo modo puoi mostrare il contenuto dove ritieni opportuno:
ja: タグの処理結果を直接出力することのほかに、テンプレート変数に格納することも可能です。これは ``as`` に続けて変数名を書くことで実現可能です。これによって、タグの処理結果を好きなように出力することができるようになります。
ko: 태그 결과를 직접 출력하지 않고 템플릿 변수에 저장할 수 있습니다. 이것은 변수 이름 뒤에 나오는 "as"라는 논거를 사용하여 이루어진다. 이렇게 하면 다음과 같은 상황에 맞는 컨텐츠를 직접 출력할 수 있습니다.
pt_br: É possível armazenar os resultados da tag em uma variável de template ao invés de enviar para a saída diretamente. Isso é feito utilizando o argumento ``as`` seguido de um nome de variável. Fazendo isso é possível posicionar o conteúdo onde você achar cabido.
zh_hans: 将标签结果存入一个模板变量而不是直接将其输出是可能的。这能通过使用 ``as`` 参数，后跟变量名实现。这样做能让你在期望的位置输出内容：

source: Inclusion tags
it: Tag di inclusione
ja: Inclusion tag (インクルージョン・タグ)
ko: 포함 태그
pt_br: Tags de inclusão
zh_hans: 包含标签

source: Another common type of template tag is the type that displays some data by rendering *another* template. For example, Django's admin interface uses custom template tags to display the buttons along the bottom of the "add/change" form pages. Those buttons always look the same, but the link targets change depending on the object being edited -- so they're a perfect case for using a small template that is filled with details from the current object. (In the admin's case, this is the ``submit_row`` tag.)
it: Un altro tipo comune di tag template è il tipo che visualizza alcuni dati eseguendo il rendering di *un altro* template. Ad esempio, l'interfaccia di amministrazione di Django utilizza tag template personalizzati per visualizzare i pulsanti "aggiungi/modifica" nella parte inferiore delle pagine modulo (form). Quei pulsanti hanno sempre lo stesso aspetto, ma le destinazioni del collegamento cambiano a seconda dell'oggetto che viene modificato, quindi sono un caso perfetto per l'utilizzo di un piccolo template pieno di dettagli dall'oggetto corrente. (Nel caso dell'amministratore, questo è il tag ``submit_row``.)
ja: テンプレートタグのもう一つの一般的なタイプは、 *別の* テンプレートをレンダリングしてデータを表示するものです。例えば、 Django の admin インタフェースでは、カスタムテンプレートタグを使って、"add/change" フォームページの下にあるボタンを表示しています。これらのボタンはいつも同じように見えますが、編集中のオブジェクトによってリンク先が変わります -- なので、現在のオブジェクトの詳細で埋められた小さなテンプレートを使うのに最適なケースです。(admin の場合、これは ``submit_row`` タグです)。
ko: 템플릿 태그의 또 다른 일반적인 유형은 *다른* 템플릿을 렌더링하여 일부 데이터를 표시하는 유형입니다. 예를 들어, Django의 관리 인터페이스는 사용자 정의 템플릿 태그를 사용하여 "추가/변경" 양식 페이지의 아래쪽에 단추를 표시합니다. 이러한 버튼은 항상 동일하게 표시되지만 링크 대상은 편집 중인 개체에 따라 달라지므로 현재 개체의 세부 정보가 채워진 작은 템플릿을 사용할 수 있습니다. (관리자의 경우, 이것은 ``제출_행" 태그이다.)
pt_br: Outro tipo de tag de template é o tipo que mostra alguns dados renderizados por *outro* template. Por exemplo, a interface do Admin do Django usa tags de tempate para mostrar os botões ao longo do final das páginas de formulários "add/change". Esses botões sempre parecem os mesmos, mas o link de destino mudam dependendo do objeto sendo editado -- então são um perfeito caso para usar um template pequeno que é preenchido com detalhes do objeto atual. (No caso do Admin, essa é a tag ``submit_row``.)
zh_hans: 另一种常见的模板标签会为 *另一个* 模板渲染数据。例如， Django 的后台利用自定义模板标签在表单页的底部展示按钮。这些按钮看起来一样，但是连接目标根据被编辑的对象不同而不同——所以，这是一个极好的例子，展示如何用当前对象的细节填充小模板。（在后台例子中，即 ``submit_row`` 标签。）

source: These sorts of tags are called "inclusion tags".
it: I tag di questo tipo sono detti "tag di inclusione"
ja: この種のタグは "inclusion tag" と呼ばれます。
ko: 이러한 종류의 태그를 "포함 태그"라고 합니다.
pt_br: Este tipo de Tag são chamadas "tags de inclusão"
zh_hans: 这种标签被称为“包含标签”。

source: Writing inclusion tags is probably best demonstrated by example. Let's write a tag that outputs a list of choices for a given ``Poll`` object, such as was created in the :ref:`tutorials <creating-models>`. We'll use the tag like this:
it: La scrittura di tag di inclusione è probabilmente meglio dimostrata dall'esempio. Scriviamo un tag che produca un elenco di scelte per un dato oggetto ``Poll``, come è stato creato in :ref:`tutorials <creating-models>`. Useremo il tag in questo modo:
ja: Inclusion tag の書き方は例で示すのが一番わかりやすいでしょう。 :ref:`チュートリアル <creating-models>` で作成したような、与えられた ``Poll`` オブジェクトの選択肢のリストを出力するタグを書いてみましょう。タグはこのように使います:
ko: 포함 태그를 작성하는 것이 가장 좋은 예일 수 있습니다. 자습서에서 만든 것과 같이 주어진 "Poll" 객체에 대한 선택 목록을 출력하는 태그를 작성합시다. 태그는 다음과 같습니다.
pt_br: Escrever tags de inclusão é provavelmente melhor demonstrado através de exemplos. Vamos escrever uma Tag que devolve uma lista de opções para um dado objeto ``Poll``, tal como o que foi criado no :ref:`tutorials <creating-models>`. Usaremos a tag assim:
zh_hans: 编写包含标签可能最好通过实例来展示。让我们编写一个标签，它会将指定 ``Poll`` 对象（就像 :ref:`教程 <creating-models>` 中创建的那样）的选项以列表输出。我们像这样使用标签：

source: ...and the output will be something like this:
it: ... e l'output sarà qualcosa di simile a questo::
ja: ...そして出力は次のようになります:
ko: ...그리고 결과는 다음과 같습니다.
pt_br: ... e a saída será algo como:
zh_hans: 输出看起来像这样：
