Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Pay extra attention if you set new default values for arguments in the ``Field`` superclass; you want to make sure they're always included, rather than disappearing if they take on the old default value.
it: Fai particolarmente attenzione se imposti nuovi valori di default nella superclasse di ``Field``; vuoi essere sicuro che siano sempre inclusi piuttosto che sparire se dovessero riprendere il vecchio valore di default.
ja: ``Field`` スーパークラス内の引数に新しいデフォルト値を設定する場合には、特に注意してください。古いデフォルト値を使うと消えるようにするのではなく、デフォルト値が常に含まれるようにしてください。
ko: "Field" 슈퍼클래스의 인수에 대해 새로운 기본값을 설정하는 경우 특히 주의를 기울이십시오. 인수가 이전 기본값을 사용하는 경우 인수가 사라지더라도 항상 포함되도록 하려는 경우입니다.
pt_br: Preste atenção extra se foram definidos novos valores padrão para argumentos na superclasse do ``Field``, tem que ter certeza de que estes são sempre incluídos, ao invés de desaparecer se recebem o valor antigo.
zh_hans: 如果你在父类 ``Field`` 中设置了新的默认值需要额外注意；说明你希望总是包含它们，而不是在它们采用旧有值时消失。

source: In addition, try to avoid returning values as positional arguments; where possible, return values as keyword arguments for maximum future compatibility. If you change the names of things more often than their position in the constructor's argument list, you might prefer positional, but bear in mind that people will be reconstructing your field from the serialized version for quite a while (possibly years), depending how long your migrations live for.
it: Inoltre, cerca di evitare di restituire valori come positional arguments; dove possibile, restituisci valori come argomenti keyword per massimizzare la compatibilità futura. Se cambi il nome delle cose più spesso della loro posizione nella lista di argomenti del costruttore, potresti preferire i positional ma tieni in mente che molte persone ricostruiranno il campo a partire dalla versione serializzata per un po' (anche anni), dipendentemente da quanto a lungo vivranno le tue migrazioni.
ja: また、値を位置引数として返さないようにしてください。 可能な限り、将来の互換性を最大限にするために、キーワード引数として値を返してください。コンストラクタの引数リストにおける位置よりも、頻繁に引数の名前を変更する場合、位置引数で指定しがちになるかもしれません。しかし、利用者はかなり長期間（おそらく何年も）にわたって、シリアライズされたバージョンからフィールドを再構築することに注意してください。これはバージョンのライフサイクルの長さにも依存します。
ko: 또한 값을 위치 인수로 반환하지 않도록 하십시오. 가능한 경우 값을 키워드 인수로 반환하여 미래의 호환성을 최대화합니다. 생성자의 인수 목록에서 위치보다 항목의 이름을 더 자주 변경할 경우 위치 지정을 선호할 수 있지만 마이그레이션 기간(년)에 따라 사람들이 직렬화된 버전에서 사용자 필드를 오랫동안 재구성할 수 있습니다.

source: You can see the results of deconstruction by looking in migrations that include the field, and you can test deconstruction in unit tests by deconstructing and reconstructing the field::
it: Puoi osservare i risultati della decostruzione guardando nelle migrazioni che includono il campo, e puoi testare la decostruzione negli unit test, decostruendo e ricostruendo il campo::
ja: フィールドを含む移行を調べることで分解の結果を確認できます。フィールドを分解して再構築することで、単体テストで分解をテストできます::
ko: 필드를 포함하는 마이그레이션을 확인하여 재구성 결과를 확인할 수 있으며, 필드를 재구성하고 재구성하여 단위 테스트에서 재구성을 테스트할 수 있습니다.

source: Field attributes not affecting database column definition
it: Attributi di campo che non interessano la definizione di colonne di database
ja: データベースのカラム定義に影響しないフィールド属性

source: You can override ``Field.non_db_attrs`` to customize attributes of a field that don't affect a column definition. It's used during model migrations to detect no-op ``AlterField`` operations.
it: Puoi sovrascrivere ``Field.non_db_attrs`` per personalizzare gli attributi di un campo che non influiscono sulla definizione di una colonna. Viene utilizzato durante le migrazioni dei modelli per rilevare ``AlterField`` no-op.
ja: ``Field.non_db_attrs`` をオーバーライドすることで、カラム定義に影響しないフィールドの属性をカスタマイズできます。これはモデルのマイグレーションの間に使われ、no-opの ``AlterField`` 操作を検出します。

source: For example::
it: Per esempio::
ja: 例えば:
ko: 예시::
pt_br: Por exemplo::
zh_hans: 例子::

source: Changing a custom field's base class
it: Cambiare la classe base di un campo personalizzato
ja: カスタムフィールドのベースクラスを変更する
ko: 사용자 맞춤 정의 필드의 기본 클래스 변경
zh_hans: 修改自定义字段的基类

source: You can't change the base class of a custom field because Django won't detect the change and make a migration for it. For example, if you start with::
it: Non puoi cambiare la classe base di un campo custom perchè Django non si accorgerà del cambiamento e non potrà creare una migrazione di conseguenza. Per esempio, se cominci con::
ja: カスタムフィールドの基底クラスを変更することはできません。なぜなら、 Django はその変更を検知できず、マイグレーションも行わないからです。例えば次のように書き始めたとして、:
ko: Django가 변경 내용을 검색하지 않고 해당 필드에 대해 마이그레이션을 수행하므로 사용자 정의 필드의 기본 클래스를 변경할 수 없습니다. 예를 들어, 다음 항목으로 시작하는 경우:
zh_hans: 你可能修改自定义字段的基类，因为 Django 无法检测到修改，并为其实施迁移。例如，如果你先这样::

source: and then decide that you want to use ``TextField`` instead, you can't change the subclass like this::
it: e poi decidi che vuoi usare un ``TextField``, non puoi cambiare la sottoclasse così::
ja: そして、代わりに ``TextField`` を使用することに決めた場合、サブクラスを次のように変更することはできません::
ko: 대신 "TextField"를 사용하기로 결정하면 다음과 같이 하위 클래스를 변경할 수 없습니다.
zh_hans: 随后决定继承自 ``TextField``，你不能像这样修改子类::

source: Instead, you must create a new custom field class and update your models to reference it::
it: Invece, devi creare una nuova classe per il campo personalizzato ed aggiornare il modello per farvi riferimento::
ja: 代わりに、新しいカスタムフィールドクラスを作成し、モデルを更新してそれを参照する必要があります::
ko: 대신 새 사용자 지정 필드 클래스를 만들고 모델을 업데이트하여 참조해야 합니다.
zh_hans: 替代方法是，你必须新建一个自定义字段类，并将你的模型指向此类::

source: As discussed in :ref:`removing fields <migrations-removing-model-fields>`, you must retain the original ``CustomCharField`` class as long as you have migrations that reference it.
it: Come discusso in :ref:`rimuovere campi <migrations-removing-model-fields>`, devi mantenere la classe originale ``CustomCharField`` fintanto che hai migrazione che vi facciano riferimento.
ja: :ref:`フィールドを削除する <migrations-removing-model-fields>` で説明したように、それを参照するマイグレーションがある限り、元の ``CustomCharField`` クラスを保持する必要があります。
ko: "ref:'moving fields'에서 논했듯이, 당신은 그것을 참조하는 마이그레이션이 있는 한 원래의 "Custom CharField" 클래스를 보유해야 한다.
zh_hans: 就像文档 :ref:`移除字段 <migrations-removing-model-fields>` 中讨论的一样，你必须保留原 ``CustomCharField`` 类只要你还有迁移指向它。

source: Documenting your custom field
it: Documentare il tuo campo personalizzato
ja: カスタムフィールドのドキュメントを書く
ko: 사용자 맞춤 정의 필드 문서화
pt_br: Documentando o seu campo
zh_hans: 为自定义字段编写文档

source: As always, you should document your field type, so users will know what it is. In addition to providing a docstring for it, which is useful for developers, you can also allow users of the admin app to see a short description of the field type via the :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` application. To do this provide descriptive text in a :attr:`~Field.description` class attribute of your custom field. In the above example, the description displayed by the ``admindocs`` application for a ``HandField`` will be 'A hand of cards (bridge style)'.
it: Come sempre, dovresti documentare il tuo tipo di campo, così che gli utenti possano sapere cosa sia. Oltre a fornire una docstring, che è utile per gli sviluppatori, dovresti anche mettere in condizioni gli utenti dell'amministrazione di vedere una piccola descrizione del tipo di campo tramite l'applicazione :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` . Per far questo, fornisci un testo descrittivo nell'attributo di classe :attr:`~Field.description` del tuo campo personalizzato. Nell'esempio sopracitato, la descrizione mostrata dall'applicazione ``admindocs`` per un ``HandField`` sarà 'Una mano di carte (stile bridge)'.
ja: いつものように、フィールドタイプのドキュメントを作成し、それがどんなものかをユーザがわかるようにしましょう。開発者にとって便利な docstring を提供するだけでなく、 :doc:`django.contrib.admindocs </ref/contrib/admin/admindocs>` アプリケーションを通して、管理者アプリのユーザにフィールドタイプの短い説明を表示することもできます。これを行うには、カスタムフィールドの :attr:`~Field.description` クラス属性に説明文を記述します。上記の例では、 ``admindocs`` アプリケーションが表示する ``HandField`` の説明は 'A hand of cards (bridge style)' （日本語で「手札(ブリッジスタイル)」の意）となります。
ko: 사용자가 필드 유형을 알 수 있도록 항상 필드 유형을 문서화해야 합니다. 개발자에게 유용한 docstring을 제공할 뿐만 아니라 admin 앱의 사용자가 :doc:'django.contrib.admindocs' 애플리케이션을 통해 필드 유형에 대한 간단한 설명을 볼 수 있도록 할 수 있습니다. 이렇게 하려면 사용자 정의 필드의 :attr:'~Field.description' 클래스 속성에 설명 텍스트를 입력합니다. 위의 예에서 ``핸드필드"를 신청하는 ``애드민더스"가 보여주는 묘사는 카드의 손(브리지 스타일)이 될 것이다.

source: In the :mod:`django.contrib.admindocs` display, the field description is interpolated with ``field.__dict__`` which allows the description to incorporate arguments of the field. For example, the description for :class:`~django.db.models.CharField` is::
it: Nella visualizzazione in :mod:`django.contrib.admindocs`, la descrizione del campo è interpolata con ``field.__dict__``, che consente che la descrizione incorpori gli argomenti del campo. Per esempio, la descrizione di :class:`~django.db.models.CharField` è::
ja: :mod:`django.contrib.admindocs` の表示では、フィールドの説明は ``field.__dict__`` によって補完され、説明文にフィールドの引数を組み込むことができます。例えば、 :class:`~django.db.models.CharField` の説明は次のようになります:
ko: :mod:'django.contrib.admindocs' 디스플레이에서 필드 설명은 "field"로 보간된다.__dict__''는 필드 인수를 포함할 수 있는 설명입니다. 예를 들어 :class에 대한 설명:'~django.db.db.know.CharField'는 다음과 같다.
pt_br: No display do :mod:`django.contrib.admindocs`, a descrição do campo é interpolada com ``field.__dict__`` o qual habilita a descrição incorporar argumentos do campo. Por exemplo, a descrição para :class:`~django.db.models.CharField` é::
zh_hans: 在 :mod:`django.contrib.admindocs` 展示的内容中，字段描述在 ``field.__dict__`` 中差值，它允许描述包含字段参数。例如， :class:`~django.db.models.CharField` 的说明是::

source: Useful methods
it: Metodi utili
ja: 便利なメソッド
ko: 쓸모있는 메소드들
pt_br: Métodos úteis
zh_hans: 实用方法

source: Once you've created your :class:`~django.db.models.Field` subclass, you might consider overriding a few standard methods, depending on your field's behavior. The list of methods below is in approximately decreasing order of importance, so start from the top.
it: Una volta che hai creato la tua sottoclasse di :class:`~django.db.models.Field`, puoi considerare di fare override di alcuni metodi standard, dipendentemente dal comportamento del tuo campo. La lista di metodi che segue è ordinata approssimativamente in ordine decrescente di importanza, quindi inizia dall'alto.
ja: :class:`~django.db.models.Field` サブクラスを作成したら、フィールドの動作に応じて、いくつかの標準メソッドをオーバーライドすることを検討できます。以下のメソッドのリストは、おおよそ重要度の高いものから順に並んでいるので、上から始めてください。
ko: :class를 생성했으면:'~django.db.db.know.필드의 하위 클래스는 필드 동작에 따라 몇 가지 표준 방법을 재정의하는 것을 고려할 수 있습니다. 아래 방법 목록은 중요도가 대략적으로 감소하는 순서이므로 맨 위에서부터 시작하십시오.
pt_br: Uma vez criada a subclasse de :class:`~django.db.models.Field`, você deve considerar sobrescrever um poucos métodos, dependendo do comportamento do seu campo. A lista de métodos abaixo está mais ou menos em uma ordem decrescente de importância, então comece do topo.
zh_hans: 一旦你已创建了 :class:`~django.db.models.Field` 的子类，你可能会考虑重写一些标准方法，这取决于你的字段行为。以下列表中的方法大致按重要性降序排列，即从上至下。

source: Custom database types
it: Tipi di database personalizzati
ja: カスタムデータベースタイプ
ko: 사용자 맞춤 정의 데이터베이스 유형
pt_br: Tipos de banco de dados personalizados
zh_hans: 自定义数据库类型

source: Say you've created a PostgreSQL custom type called ``mytype``. You can subclass ``Field`` and implement the :meth:`~Field.db_type` method, like so::
it: Supponiamo che tu abbia creato un tipo PostgreSQL custom chiamato `mytype``. Puoi fare una sottoclasse di ``Field`` ed implementare il metodo :meth:`~Field.db_type`, nel modo seguente::
ja: ``mytype`` というPostgreSQLのカスタム型を作成したとします。このとき、 ``Field`` をサブクラス化し、 :meth:`~Field.db_type` 関数を以下のように実装できます:
ko: Postgre를 생성했다고 가정해 보십시오.SQL 사용자 정의 유형은 "my type"입니다. 다음과 같이 "Field"를 하위 분류하고 :meth:'~Field.db_type" 방법을 구현할 수 있습니다.
pt_br: Vamos dizer que você tenha criado um tipo personalizado para o PostgreSQL chamado ``mytype``. Você pode herdar de ``Field`` e implementar o método :meth:`~Field.db_type`, como a::
zh_hans: 假设你已创建了一个 PostgreSQL 自定义字段，名叫 ``mytype``。你可以继承 ``Field`` 并实现 :meth:`~Field.db_type` 方法，像这样::

source: Once you have ``MytypeField``, you can use it in any model, just like any other ``Field`` type::
it: Una volta che hai ``MytypeField``, puoi usarlo in ogni modello, come qualsiasi altro tipo ``Field``::
ja: ``MytypeField`` を取得したら、他の ``Field`` タイプと同様に、どのモデルでも使用できます:
ko: 일단 "MytypeField"를 갖게 되면 다른 "Field" 타입과 마찬가지로 어떤 모델에서도 사용할 수 있다.
pt_br: Uma vez que tenha ``MyTypeField``, pode usá-lo em qualquer modelo, tal como qualquer outro tipo ``Field``::
zh_hans: 只要已建立 ``MytypeField``，你就能像使用其它 ``Field`` 类型一样在模型中使用它::

source: If you aim to build a database-agnostic application, you should account for differences in database column types. For example, the date/time column type in PostgreSQL is called ``timestamp``, while the same column in MySQL is called ``datetime``. You can handle this in a :meth:`~Field.db_type` method by checking the ``connection.vendor`` attribute. Current built-in vendor names are: ``sqlite``, ``postgresql``, ``mysql``, and ``oracle``.
it: Se punti ad implementare una applicazione agnostica rispetto al database, dovresti tenere in considerazione le differenze nei tipi di colonna del database. Per esempio, il tipo date/time in PostgreSQL è chiamato ``timestamp``, mentre la stessa colonna in MySQL viene chiamata ``datetime``. Puoi gestire tutto questo in un metodo :meth:`~Field.db_type` controllando l'attributo ``connection.vendor``. I nomi di vendor correntemente disponibili sono: ``sqlite``, ``postgresql``, ``mysql`` e``oracle``.
ja: データベースに依存しないアプリケーションを構築することを目指している場合、データベースカラムの型の違いを考慮する必要があります。たとえば、PostgreSQL の日付や時刻のカラムの型は ``timestamp`` と呼ばれますが、同じカラムが MySQL では ``datetime`` と呼ばれます。この違いは :meth:`~Field.db_type` メソッド内で ``connection.vendor`` 属性をチェックすることでハンドリングできます。現在のビルトインされているベンダー名は、``sqlite``、``postgresql``、``mysql``、``oracle`` です。

source: The :meth:`~Field.db_type` and :meth:`~Field.rel_db_type` methods are called by Django when the framework constructs the ``CREATE TABLE`` statements for your application -- that is, when you first create your tables. The methods are also called when constructing a ``WHERE`` clause that includes the model field -- that is, when you retrieve data using QuerySet methods like ``get()``, ``filter()``, and ``exclude()`` and have the model field as an argument.
ja: Django は、アプリケーションのために ``CREATE TABLE`` ステートメントを構築するとき、つまり最初にテーブルを作成するときに :meth:`~Field.db_type` と :meth:`~Field.rel_db_type` メソッドを呼びます。このメソッドは、モデルのフィールドを含む ``WHERE`` 句を構築するとき、つまり QuerySet の ``get()``、``filter()``、``exclude()`` などのメソッドを使用してデータを取得するときにも呼ばれます。

source: Some database column types accept parameters, such as ``CHAR(25)``, where the parameter ``25`` represents the maximum column length. In cases like these, it's more flexible if the parameter is specified in the model rather than being hard-coded in the ``db_type()`` method. For example, it wouldn't make much sense to have a ``CharMaxlength25Field``, shown here::
it: Alcuni tipi di colonne di database accettano parametri, come ``CHAR(25)``, dove il parametro ``25`` rappresenta la lunghezza massima della colonna. In casi come questi, c'è più flessibilità se il parametro è specificato nel modello piuttosto che essere codificato nel metodo ``db_type()``. Per esempio, non avrebbe senso avere un ``CharMaxlength25Field``, mostrato qui::
ja: 一部のデータベースカラムの型は ``CHAR(25)`` などのパラメータを受け付けます。ここで、パラメータ ``25`` はカラムの最大長を表します。このような場合、パラメータを ``db_type()`` メソッド内でハードコードするよりも、モデル内で指定したほうがより柔軟になります。たとえば、ここで示すように、``CharMaxlength25Field`` のようなフィールドを持つ意味はあまりありません。
ko: 일부 데이터베이스 열 유형에는 "CHAR(25)"과 같은 매개 변수가 최대 열 길이를 나타내는 "25"와 같은 매개 변수가 허용된다. 이러한 경우 매개변수가 "db_type()" 방식으로 하드 코딩되기 보다는 모델에 지정되면 더 유연하다. 예를 들어 여기에 "CharMaxlength25Field"가 나와 있는 것은 말이 되지 않는다.
pt_br: Alguns tipos de coluna do banco de dados aceitam parâmetros, como ``CHAR(25)``, onde o parâmetro ``25`` representa o tamanho máximo da coluna. Em casos como este, é mais flexível se o parâmetro for especificado no modelo ao invés de ser hard-coded no método ``db_type()``. Por exemplo, não faria muito sentido ter ``CharMaxlength25Field``, mostrado aqui::
zh_hans: 某些数据库列类型接受参数，例如 ``CHAR(25)``，参数 ``25`` 表示列的最大长度。类似用例中，该参数若在模型中指定比硬编码在 ``db_type()`` 方法中更灵活。举个例子，构建 ``CharMaxlength25Field`` 没多大意义，如下所示::

source: The better way of doing this would be to make the parameter specifiable at run time -- i.e., when the class is instantiated. To do that, implement ``Field.__init__()``, like so::
it: Il miglior modo di fare una cosa del genere potrebbe essere rendere il parametro specificabile a run time -- per esempio, quando la classe viene istanziata. Per fare ciò, implementa così ``Field.__init__()``::
ja: これを行うためのよりよい方法は、実行時に、つまりクラスがインスタンス化されるときにパラメータを指定できるようにする方法です。そのためには、次のように ``Field.__init__()`` を実装します。
ko: 이렇게 하는 더 좋은 방법은 런타임에 매개 변수를 지정할 수 있게 하는 것입니다. 즉, 클래스가 인스턴스화된 경우입니다. 그러기 위해서는 ``필드"를 실행하라.__init__()는 다음과 같습니다.

source: Finally, if your column requires truly complex SQL setup, return ``None`` from :meth:`.db_type`. This will cause Django's SQL creation code to skip over this field. You are then responsible for creating the column in the right table in some other way, but this gives you a way to tell Django to get out of the way.
it: Infine, se la tua colonna richiede davvero un setup SQL complesso, restituisci ``None`` da :meth:`.db_type`. Questo farà in modo che Django salti questo campo durante la creazione del codice SQL. A questo punto sei in qualche modo il responsabile della creazione della colonna nella giusta tabella ma questo ti offre un modo di dire a Django di non agire.
ja: 最後に、カラムが本当に複雑な SQL のセットアップを必要とする場合、:meth:`.db_type` から ``None`` を返してください。こうすると、Django の SQL 生成コードがこのフィールドをスキップするようになります。その後、別の方法で正しいテーブルにカラムを作成すする必要がありますが、Django に邪魔をしないように伝えることができます。
ko: 마지막으로, 컬럼에 실제로 복잡한 SQL 설정이 필요한 경우 :meth:"none"에서 "none"을 반환합니다. 이로 인해 Django의 SQL 생성 코드가 이 필드를 건너뜁니다. 그러면 다른 방법으로 오른쪽 테이블에 열을 만들 책임이 있지만, 이것은 여러분이 Django에게 해결방법을 제공합니다.

source: The :meth:`~Field.rel_db_type` method is called by fields such as ``ForeignKey`` and ``OneToOneField`` that point to another field to determine their database column data types. For example, if you have an ``UnsignedAutoField``, you also need the foreign keys that point to that field to use the same data type::
it: Il metodo :meth:`~Field.rel_db_type` è chiamato da campi come ``ForeignKey`` e ``OneToOneField`` che puntano ad altri campi per determinare il proprio tipo di dato per la colonna del database. Per esempio, se hai un ``UnsignedAutoField``, hai anche bisogno delle foreign keys che puntano a quel campo e che usano lo stesso tipo di dato::
ja: :meth:`~Field.rel_db_type` メソッドは、他のフィールドを指す ``ForeignKey`` や ``OneToOneField`` などのフィールドによって、データベースのカラムのデータ型を特定するために呼ばれます。たとえば、``UnsignedAutoField`` がある場合、同じデータ型を使うためにそのフィールドを指す外部キーも必要になります。
ko: :meth:'~Field.rel_db_type'은 다른 필드를 가리키는 "ForeignKey"와 "OneToOneField"와 같은 분야로 불리며 데이터베이스 열 데이터 유형을 결정한다. 예를 들어 "미서명"이 있는 경우AutoField'에서 동일한 데이터 유형을 사용하려면 해당 필드를 가리키는 외래 키도 필요합니다.
zh_hans: :meth:`~Field.rel_db_type` 方法由字段调用，例如 ``ForeignKey`` 和 ``OneToOneField`` ，这些通过指向另一个字段来决定数据库列类型的字段。举个例子，如果你有个 ``UnsignedAutoField``，你也需要指向该字段的外键使用相同的数据类型::

source: Converting values to Python objects
it: Conversione di valori a oggetti Python
ja: 変数を Python オブジェクトに変換する
ko: 값을 파이썬 개체로 변환
pt_br: Convertendo valores para objetos Python
zh_hans: 将值转为 Python 对象

source: If your custom :class:`~Field` class deals with data structures that are more complex than strings, dates, integers, or floats, then you may need to override :meth:`~Field.from_db_value` and :meth:`~Field.to_python`.
it: Se la tua classe personalizzata :class:`~Field` ha a che fare con strutture di dati che sono più complesse di stringhe, date, interi o numeri in virgola mobile, allora potresti aver bisogno di fare override di :meth:`~Field.from_db_value` e :meth:`~Field.to_python`.
ja: もしカスタムの :class:`~Field` クラスが文字列、日付、整数、または浮動小数点数よりも複雑なデータ構造を扱う場合は、 :meth:`~Field.from_db_value` と :meth:`~Field.to_python` をオーバーライドする必要があるかもしれません。
ko: 사용자 정의:클래스:'~Field' 클래스는 문자열, 날짜, 정수 또는 부동보다 복잡한 데이터 구조를 다루므로 meth:'~from_db_value' 및 :meth:'~Field'를 재정의해야 할 수 있습니다.
pt_br: Se sua classe customizada de :class:`~Field` lida com estruturas de dados mais complexas que strings, datas, inteiros, or floats, então talvez precise sobrescrever o :meth:`~Field.from_db_value` e :meth:`~Field.to_python`.
zh_hans: 若自定义 :class:`~Field` 处理的数据结构比字符串，日期，整型，或浮点型更复杂，你可能需要重写 :meth:`~Field.from_db_value` 和 :meth:`~Field.to_python`。

source: If present for the field subclass, ``from_db_value()`` will be called in all circumstances when the data is loaded from the database, including in aggregates and :meth:`~django.db.models.query.QuerySet.values` calls.
it: Se presente per la sottoclasse del campo, ``from_db_value()`` sarà chiamato in tutte le circostanze in cui i dati sono caricati dal database, incluse le aggregazioni e le chiamate :meth:`~django.db.models.query.QuerySet.values`.
ja: フィールドのサブクラスに存在する場合、データがデータベースから読み込まれるすべての状況で、 ``from_db_value()`` が呼び出されます。これには集計や :meth:`~django.db.models.query.QuerySet.values` の呼び出しも含まれます。
ko: 필드 서브클래스에 "from_db_value()"가 존재하면 aggregate 및 :meth:"~django.db.models.QuerySet.values를 포함하여 데이터베이스에서 데이터가 로드되는 모든 상황에서 호출됩니다.의 호출입니다.
pt_br: Se presente para a subclasse do campo, ``from_db_value()`` será chamado em todas as circunstâncias quando dados são lidos do banco de dados, incluindo em agregacões e chamadas do :meth:`~django.db.models.query.QuerySet.values` .
zh_hans: 若要展示字段的子类， ``from_db_value()`` 将会在从数据库中载入的生命周期中调用，包括聚集和 :meth:`~django.db.models.query.QuerySet.values` 调用。

source: ``to_python()`` is called by deserialization and during the :meth:`~django.db.models.Model.clean` method used from forms.
it: ``to_python()`` è chiamato per la deserializzazione e nel metodo :meth:`~django.db.models.Model.clean` usato dai form.
ja: ``to_python()`` は、デシリアライズ時やフォームから使用される :meth:`~django.db.models.Model.clean` メソッドの中で呼び出されます。
ko: ``to_python()`` 는 역직렬화(deserialization)에 의해 호출되고 :meth:`~django.db.models.Model.clean`메소드가 폼 도중에 사용된다.
pt_br: o ``to_python()`` é chamado pela deserialização e durante o método :meth:`~django.db.models.Model.clean` usado nos forms.
zh_hans: ``to_python()`` 在反序列化时和为表单应用 :meth:`~django.db.models.Model.clean` 时调用。

source: As a general rule, ``to_python()`` should deal gracefully with any of the following arguments:
it: Come regola generale, ``to_python()`` dovrebbe avere a che fare in modo graceful con i seguenti argomenti::
ja: 一般的なルールとして、 ``to_python()`` は以下の引数を適切に処理するべきです。
ko: 일반적으로 ``to_python()"은 다음 주장 중 하나를 기품 있게 다루어야 한다.
pt_br: Como regra geral, ``to_python()``deve lidar tranquilamente com qualquer dos seguintes argumentos:
zh_hans: 作为通用规则， ``to_python`` 应该平滑地处理以下参数：

source: An instance of the correct type (e.g., ``Hand`` in our ongoing example).
it: Una istanza del tipo corretto (per esempio ``Hand`` nel nostro esempio).
ja: 正しいタイプのインスタンス（例：このページの例でいう ``Hand`` ）。
ko: 올바른 유형의 예(예: 현재 진행 중인 예에서 "Hand")
pt_br: Uma instância do tipo correto (ex., ``Hand``no nosso exemplo corrente).
zh_hans: 一个正确的类型（本业持续介绍的例子 ``Hand`` ）。

source: A string
it: Una stringa
ja: 文字列
ko: 문자열
pt_br: Uma string
zh_hans: 一个字符串

source: ``None`` (if the field allows ``null=True``)
it: ``None`` (se il campo permette ``null=True``)
ja: ``None`` (フィールドが ``null=True`` を許す場合)
ko: ``None``(필드에서 "null = True"를 허용한다면)
pt_br: ``None``(se o campo permitir ``null=True``)
zh_hans: ``None`` （若字段允许 ``null=True``）

source: In our ``HandField`` class, we're storing the data as a ``VARCHAR`` field in the database, so we need to be able to process strings and ``None`` in the ``from_db_value()``. In ``to_python()``, we need to also handle ``Hand`` instances::
it: Nella nostra classe ``HandField``, stiamo immagazinando i dati come un campo ``VARCHAR`` nel database, quindi dobbiamo essere in grado di processare string e ``None`` in `from_db_value()``. In ``to_python()``, dovremo anche gestire le istanze di ``Hand``::
ja: 私たちの ``HandField`` クラスでは、データをデータベースの ``VARCHAR`` フィールドとして保存しているため、 ``from_db_value()`` で文字列と ``None`` を処理できる必要があります。 ``to_python()`` では、 ``Hand`` のインスタンスも処理する必要があります。
