Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Upgrading as each new Django release is available makes future upgrades less painful by keeping your code base up to date.
it: Aggiornando ogni qualvolta un nuovo rilascio di Django è disponibile rende i futuri aggiornamenti meno doloroso mantenendo aggiornato il tuo codice.
ja: Django が新しくリリースされた時に更新して、コードベースを最新の状態に保っておけば、将来の更新作業が楽になる。
ko: 새로운 Django 릴리스가 출시될 때마다 업그레이드하면 코드베이스를 최신 상태로 유지하여 향후 업그레이드의 부담을 줄일 수 있습니다.
pt_br: Atualizando assim que cada versão do Django fica disponível faz com que futuras atualizações sejam menos dolorosas, por mantendo sua base de código atualizada.
zh_hans: 随着每个新 Django 发行版的发布而升级，可以使您的代码库保持最新，从而减少将来升级带来的痛苦。

source: Here are some things to consider to help make your upgrade process as smooth as possible.
it: Qui ci sono alcune cose da considera per aiutarti a completare il processo di upgrade nel modo più facile possibile.
ja: このセクションでは、更新作業ができるかぎりスムーズに行う助けになるよう、特に注意するべきことをいくつか説明しています。
ko: 다음은 업그레이드 프로세스를 최대한 원활하게 수행하기 위해 고려해야 할 몇 가지 사항입니다.
pt_br: Aqui alguns pontos para considerar para ajudar fazer seu process ode atualização mais suave tanto quanto possível.
zh_hans: 有些事情需要你考虑，这有助于使升级流程尽可能顺滑。

source: Required Reading
it: Letture richieste
ja: 更新時に読むべきドキュメント
ko: 읽는 것이 요구됩니다.
pt_br: Leitura requerida
zh_hans: 必读内容

source: If it's your first time doing an upgrade, it is useful to read the :doc:`guide on the different release processes </internals/release-process>`.
it: Se è la prima volta che fai un aggiornamento, è utile leggere la :doc:`guida sui diversi processi di rilascio </internals/release-process>`.
ja: はじめて Django を更新する時には、:doc:`Django のリリースプロセスガイド </internals/release-process>` を読んでおくと役に立つでしょう。
ko: 업그레이드를 처음 하는 경우에는 다른 릴리스 프로세스에 대한 :doc:'가이드'를 읽어보는 것이 유용합니다.
pt_br: Se esta é sua primeira vez fazendo uma atualização, é útil ler o :doc:`guia sobre o proesso de atualizações diferente </internals/release-process>`.
zh_hans: 若这是你第一次进行升级操作，那么阅读 :doc:`不同发行进程的指南 </internals/release-process>` 就非常有用。

source: Afterward, you should familiarize yourself with the changes that were made in the new Django version(s):
it: Successivamente, dovresti familiarizzare con le modifiche apportate alla/e nuova/e versione/i di Django:
ja: 更新を行う前には、新しいバージョンの Django ではどのような点が変更されたのかをよく知っておく必要があります。

source: Read the :doc:`release notes </releases/index>` for each 'final' release from the one after your current Django version, up to and including the version to which you plan to upgrade.
it: Leggi le :doc:`note di rilascio </releases/index>` per ogni rilascio 'final' da quella corrente di Django, fino ad includere la versione alla quale pianifichi di fare l'upgrade.
ja: まず、:doc:`リリースノート </releases/index>` を読みましょう。読む必要があるのは、現在の Django のバージョンの1つ後から、更新しようと考えているターゲットのバージョンまでの、それぞれの「最後の (final) リリース」のリリースノートです。
ko: 업그레이드하려는 버전을 포함하여 현재 Django 버전 이후 버전에서 "final" 릴리스별로 ":doc:'release note"를 읽어보십시오.
pt_br: Leia o :doc:`notas sobre a edição </releases/index>` para cara edição a partir da sua versão de Django corrente, até e inclusive a versão do Django pra qual que você planeja atualizar.
zh_hans: 阅读当前版本之后的每个“最终”版本的 :doc:`发行说明 </releases/index>` ，包括计划升级的版本。

source: Look at the :doc:`deprecation timeline</internals/deprecation>` for the relevant versions.
it: Guarda la :doc:`deprecation timeline</internals/deprecation>` per le versioni più rilevanti.
ja: そして、対応するバージョンの :doc:`非推奨機能のタイムライン </internals/deprecation>` にも目を通します。
ko: 관련 버전에 대한 :doc:'감소 시간표'를 보십시오.
pt_br: Dê uma olhada no :doc:`linha do tempo da depreciação</internals/deprecation>` para as versões relevantes.
zh_hans: 阅读 :doc:`过期时间表 </internals/deprecation>` 获取相关版本信息。

source: Pay particular attention to backwards incompatible changes to get a clear idea of what will be needed for a successful upgrade.
it: Presta particolare attenzione ai cambiamenti che introducono incompatibilità all'indietro per avere un'idea chiara di cosa sarà necessario per un aggiornamento di successo.
ja: 中でも特に、後方互換性のない変更点に注意してください。この点に注目すると、正しく更新するために必要なことがはっきりとわかるようになります。
ko: 이전 버전과 호환되지 않는 변경 사항에 특히 주의를 기울여 성공적인 업그레이드에 무엇이 필요한지 명확하게 파악합니다.
pt_br: Preste uma atenção particular a imcompatibilidades das mudanças nas versões anteriores para ter uma idéia clara do que será necessário para uma atualização de sucesso.
zh_hans: 特别注意向前兼容修改，清楚了解成功的升级需要做什么。

source: If you're upgrading through more than one feature version (e.g. 2.0 to 2.2), it's usually easier to upgrade through each feature release incrementally (2.0 to 2.1 to 2.2) rather than to make all the changes for each feature release at once. For each feature release, use the latest patch release (e.g. for 2.1, use 2.1.15).
it: Se stai aggiornando tra più di una versione (per es. da 2.0 a 2.2), generalmente è più facile fare upgrade incrementalmente di release in release (dalla 2.0 alla 2.1, alla 2.2...) piuttosto che fare tutti i cambiamenti per ogni release assieme. Per ogni release futura, usa l'ultima patch di rilascio (per es. per 2.1, usa 2.1.15).
ja: 複数の機能バージョン（例えば2.0から2.2）をアップグレードする場合、各機能リリースのすべての変更を一度に行うよりも、各機能リリースを段階的に（2.0→2.1→2.2）アップグレードする方が通常は簡単です。各機能リリースでは、最新のパッチリリースを使ってください (例えば、2.1 では 2.1.15 を使ってください)。
ko: 둘 이상의 기능 버전(예: 2.0에서 2.2로)을 통해 업그레이드하는 경우 일반적으로 각 기능 릴리스에 대한 모든 내용을 한 번에 변경하는 것보다 각 기능 릴리스(2.0에서 2.1에서 2.2)를 통해 업그레이드하는 것이 더 쉽습니다. 각 기능 릴리스에 대해 최신 패치 릴리스(예: 2.1의 경우 2.1.15 사용)를 사용합니다.

source: The same incremental upgrade approach is recommended when upgrading from one LTS to the next.
it: Lo stesso approccio di aggiornamenti incrementali è raccomandato quando si aggiorna da una LTS alla successiva.
ja: あるLTSから次のLTSにアップグレードする場合は、段階的にアップグレードする方法を推奨します。
ko: 한 LTS에서 다음 LTS로 업그레이드할 때도 동일한 증분 업그레이드 방법을 사용하는 것이 좋습니다.
zh_hans: 从一个长期支持（LTS）版本更新至下一个长期更新版本时，特别推荐同样的增量更新方法。

source: Dependencies
it: Dipendenze
ja: 依存関係
ko: 의존성
pt_br: Dependências
zh_hans: 依赖

source: In most cases it will be necessary to upgrade to the latest version of your Django-related dependencies as well. If the Django version was recently released or if some of your dependencies are not well-maintained, some of your dependencies may not yet support the new Django version. In these cases you may have to wait until new versions of your dependencies are released.
it: Il molti casi sarà necessario aggiornare all'ultima versione delle tue dipendenze collegate a Django. Se la versione di Django è stata rilasciata recentemente o alcune delle tue dipendenze non sono ben manutenute, alcune delle tue dipendenze potrebbero non supportarla. In questi casi devi aspettare che siano rilasciate nuove versioni delle tue dipendenze.
ja: ほとんどの場合、Django が依存しているパッケージも最新版に更新する必要があるでしょう。その Django のバージョンがリリースされたばかりで、依存関係にあるパッケージがきちんとメンテナンスされていなかった場合、新バージョンの Django に必要なパッケージがまだインストールできないかもしれません。そのような場合には、そうした Django の依存パッケージの新バージョンが使えるようになるまで、少し待たなければならない場合があります。
ko: 대부분의 경우 Django 관련 종속성의 최신 버전으로 업그레이드해야 합니다. 최근에 Django 버전이 릴리스되었거나 일부 종속성이 제대로 유지되지 않은 경우 일부 종속성이 새 Django 버전을 아직 지원하지 않을 수 있습니다. 이러한 경우 종속성의 새 버전이 릴리스될 때까지 기다려야 할 수도 있습니다.
pt_br: Na marioria dos casos para atualizar para a última versão do Django será necessário atualiar as dependências do Django também. Se a versão do Django foi lançada recentemente ou se algumas de suas dependências não são muito bem mantidas, algumas dependências podem não dar suporte a versão do Django. Nestes casos você terá que esperar até que a nova versão das dependências sejam lançadas.
zh_hans: 大多数情况下，将 Django 的依赖升至最新版本是必要的。若 Django 版本是最近发布的，但某些依赖没有很好适配，这些依赖可能无法支持最新版的 Django。这种情况下，你只能等新版本的依赖发布。

source: Resolving deprecation warnings
it: Risolvere i warning delle deprecation
ja: 廃止予定警告を解決する
ko: 사용 중지 경고를 해결하는 중입니다.
zh_hans: 处理过期警告

source: Before upgrading, it's a good idea to resolve any deprecation warnings raised by your project while using your current version of Django. Fixing these warnings before upgrading ensures that you're informed about areas of the code that need altering.
it: Prima dell'upgrade, è una buona idea risolvere ogni segnalazione di errore per parti deprecate nel tuo progetto mentre stai utilizzando la versione corrente di Django Sistemare questi errori prima dell'aggiornamento ti assicura la conoscenza delle aree del codice che hanno bisogno di essere modificate.
ja: アップグレードの前、Django の現在のバージョンを使っている間に、プロジェクトが挙げてくる廃止予定警告を解決しておくのがよいでしょう。アップグレードの前にこれらの警告を解決することで、コードが警告を必要とする領域について通知されるようにできます。
ko: 업그레이드하기 전에 현재 버전의 Django를 사용하는 동안 프로젝트에서 발생하는 모든 사용 중단 경고를 해결하는 것이 좋습니다. 업그레이드하기 전에 이러한 경고를 수정하면 변경해야 하는 코드 영역에 대한 정보를 얻을 수 있습니다.
zh_hans: 在升级前，将使用当前 Django 版本引发的过期警告解决掉是个不错的注意。在升级前修复这些警告能确保你了解代码中哪些部分需要修改。

source: In Python, deprecation warnings are silenced by default. You must turn them on using the ``-Wa`` Python command line option or the :envvar:`PYTHONWARNINGS` environment variable. For example, to show warnings while running tests:
it: In Python, i warning di deprecazione sono silenziati di default. Devi abilitarli con l'opzione ``-Wa`` in command line o la variabile d'ambiente :envvar:`PYTHONWARNINGS`. Per esempio, per mostrare i warning mentre si lanciano i test:
ja: Python では、デフォルトでは廃止予定警告は無効化されています。``-Wa`` Python コマンドラインオプションか :envvar:`PYTHONWARNINGS` 環境変数を使って有効化する必要があります。例えば、テスト実行中に警告を表示するには:
ko: Python에서는 기본적으로 사용되지 않음 경고가 표시되지 않습니다. "-Wa' Python 명령줄 옵션 또는 :envvar:"PYthon WARINGS" 환경 변수를 사용하여 이 옵션을 켜야 합니다. 예를 들어 테스트를 실행하는 동안 경고를 표시하려면 다음을 수행합니다.
zh_hans: 在 Python 中，过期警告默认是静默的。你必须用 Python 的命令行选项 ``-Wa`` 或 :envvar:`PYTHONWARNINGS` 环境变量将其打开。例如，在运行测试时显示警告：

source: If you're not using the Django test runner, you may need to also ensure that any console output is not captured which would hide deprecation warnings. For example, if you use `pytest <https://docs.pytest.org/>`__:
it: Se non stai usando il test runner di Django, potresti aver bisogno di assicurare che l'output della console non sia catturato per evitare di nascondere i warning di deprecazione. Per esempio, se usi `pytest <https://docs.pytest.org/>`__:
ja: Djangoのテストランナーを使っていない場合、廃止予定警告が隠されることのないように、コンソール出力がキャプチャされないようにする必要があるかもしれません。たとえば、 `pytest <https://docs.pytest.org/>`__ を使う場合:

source: Resolve any deprecation warnings with your current version of Django before continuing the upgrade process.
it: Risolvi eventuali avvisi di deprecazione con la versione corrente di Django prima di continuare il processo di aggiornamento.
ja: アップグレードプロセスを続ける前に、Django の現在のバージョンで廃止予定警告を解決してください。
ko: 업그레이드 프로세스를 계속하기 전에 현재 버전의 Django를 사용하여 더 이상 사용되지 않는 경고를 해결하십시오.
zh_hans: 在继续升级流程前处理当前 Django 版本报告的所有过期警告。

source: Third party applications might use deprecated APIs in order to support multiple versions of Django, so deprecation warnings in packages you've installed don't necessarily indicate a problem. If a package doesn't support the latest version of Django, consider raising an issue or sending a pull request for it.
it: Applicazioni di terze parti potrebbero usare APi deprecate per supportare più versioni di Django, quindi i warning di deprecazione in package che hai installato non indicano necessariamente un problema. Se un package non supporta l'ultima versione di Django, considera di sollevare una issue o di mandare una pull request.
ja: Django の複数バージョンをサポートするために、サードパーティアプリケーションは廃止される API を使用しているかもしれません。そのため、インストールしたパッケージの廃止予定警告は必ずしも問題を示しません。パッケージが Django の最新のバージョンをサポートしていない場合、問題を提起するかプルリクエストを送ることを考えてみてください。
ko: 타사 응용 프로그램은 여러 버전의 Django를 지원하기 위해 사용되지 않는 API를 사용할 수 있으므로 설치한 패키지의 사용되지 않음 경고가 반드시 문제를 나타내는 것은 아닙니다. 패키지가 최신 버전의 Django를 지원하지 않는 경우 문제를 제기하거나 Django에 대한 꺼내기 요청을 보내는 것을 고려하십시오.
zh_hans: 第三方应用可能会出于兼容多版本 Django 目的使用过期 APIs，所以你安装的应用报告的过期警告可能并不是问题。若某个包不支持最新版的 Django，考虑为其创建一个 issue 或发起一个 pull request。

source: Installation
it: Installazione
ja: インストール
ko: 설치, 설치본
pt_br: Instalação
zh_hans: 安装

source: Once you're ready, it is time to :doc:`install the new Django version </topics/install>`. If you are using a :mod:`virtual environment <venv>` and it is a major upgrade, you might want to set up a new environment with all the dependencies first.
it: Una volta che sei pronto, è tempo di :doc:`installare la nuova versione di Django </topics/install>`. Se stai usando un :mod:`virtual environment <venv>` ed è un aggiornamento major, potresti volere prima approntare un nuovo ambiente con tutte le dipendenze.
ja: さあ、準備ができたら、 :doc:`新しいバージョンの Django をインストールする </topics/install>` 時です。もし :mod:`virtual environment <venv>` を使っていて、今回のアップグレードがメジャーアップグレードなら、まずすべての依存関係を含む新しい環境をセットアップした方が良いかもしれません。
ko: 준비가 되면 :doc:'새 Django 버전을 설치해야 합니다. :mod:'가상 환경'을 사용하는 경우 주요 업그레이드인 경우 먼저 모든 종속성을 포함하는 새 환경을 설정할 수 있습니다.

source: If you installed Django with pip_, you can use the ``--upgrade`` or ``-U`` flag:
it: Se hai installato Django con pip_, puoi usare il flag ``--upgrade`` o ``-U``:
ja: Django を pip_ でインストールした場合は、``--upgrade`` か ``-U`` フラグが使用できます。
ko: ip_와 함께 django를 설치했다면 "--upgrade" 또는 "-U" 플래그를 사용할 수 있습니다.
zh_hans: 若你用 pip_ 安装 Django，你可以使用 ``--upgrade`` 或 ``-U`` 标志：

source: When the new environment is set up, :doc:`run the full test suite </topics/testing/overview>` for your application. Again, it's useful to turn on deprecation warnings on so they're shown in the test output (you can also use the flag if you test your app manually using ``manage.py runserver``):
it: Quando il nuovo ambiente è pronto, :doc:`lancia l'intera suite di test </topics/testing/overview>` per la tua applicazione. Di nuovo, è utile abilitare i warning di deprecazione così che siano mostrati negli output dei test (puoi anche usare il flag se testi la tua app manualmente con ``manage.py runserver``):
ja: 新しい環境が設定されたら、 :doc:`テストスイートを実行します </topics/testing/overview>` 。テストの出力に表示されるように、廃止予定の警告を有効にすると便利です。 (``manage.py runserver`` を使用してアプリケーションを手動でテストする場合は、フラグを使用することもできます)
ko: 새 환경이 설정되면 :doc:'전체 테스트 스위트'를 실행합니다. 다시 말해, 사용되지 않는 경고를 테스트 출력에 표시하도록 켜는 것이 유용합니다. ``manage.py runserver"를 사용하여 앱을 수동으로 테스트하는 경우에도 플래그를 사용할 수 있습니다.
zh_hans: 当环境准备好后，先为应用 :doc:`运行完整的测试套件 </topics/testing/overview>`。再说一次，将过期警告开关打开很有用，这样就能在测试输出中看到过期警告（若你用 ``manage.py runserver`` 手动测试，也能有该标志）：

source: After you have run the tests, fix any failures. While you have the release notes fresh in your mind, it may also be a good time to take advantage of new features in Django by refactoring your code to eliminate any deprecation warnings.
it: Dopo aver lanciato i test, fai le correzioni. Mentre hai le note di rilascio fresche nella mente, può essere un buon momento per avvantaggiarsi delle nuove feature in Django rifattorizzando il codice per eliminare ogni warning di deprecazione.
ja: テストを実行したら、テストに失敗した点をすべて修正しましょう。リリースノートの内容を心に留めながらコードをリファクタリングして、非推奨の警告が出ないようにすれば、Django の新しい機能の恩恵も受けられるかもしれません。
ko: 테스트를 실행한 후 오류를 수정하십시오. 릴리스 노트를 새로이 마음에 두고 있지만 사용 중인 코드를 리팩터링하여 더 이상 사용하지 않도록 함으로써 Django의 새로운 기능을 활용할 수도 있습니다.
pt_br: Depois que rodar os testes, concerte as falhas. Enquanto você tem as notas da versão frescas na sa cabeça, talvez seja uma boa hora para tirar vantagem das novas caraceterísticas do Django refatorando o código para eliminar qualquer alerta de descontinuidade.
zh_hans: 在你运行测试，并修复所有问题后。由于你刚看了发布说明，可能现在也是重构代码，消除所有过期警告，尝尝 Django 最新功能特性的好时机。

source: When you are sufficiently confident your app works with the new version of Django, you're ready to go ahead and :doc:`deploy </howto/deployment/index>` your upgraded Django project.
it: Quando sei sufficientemente sicuro che la tua app funzioni con la nuova versione di Django, sei pronto per andare avanti e :doc:`deploy </howto/deployment/index>` il tuo progetto Django aggiornato.
ja: 新しいバージョンの Django でアプリが十分に動作すると確信できたら、アップグレードした Django プロジェクトの :doc:`デプロイ </howto/deployment/index>` を進める準備は完了です。
ko: 당신의 앱이 새로운 버전의 Django와 잘 작동한다고 확신하면, 당신은 당신의 업그레이드된 Django 프로젝트를 진행할 준비가 되어 있습니다.
pt_br: Quando você estiver suficientemente confiante que sua aplicação funciona com a nova versão do Django, você está pronto para ir em frente e :doc:`implantar </howto/deployment/index>` seu projeto com Django atualizado.
zh_hans: 当你十分确信你的应用能兼容新版 Django 时，你就准备好去往下一步， :doc:`部署 </howto/deployment/index>` 升级后的 Django 工程。

source: If you are using caching provided by Django, you should consider clearing your cache after upgrading. Otherwise you may run into problems, for example, if you are caching pickled objects as these objects are not guaranteed to be pickle-compatible across Django versions. A past instance of incompatibility was caching pickled :class:`~django.http.HttpResponse` objects, either directly or indirectly via the :func:`~django.views.decorators.cache.cache_page` decorator.
it: Se stai utilizzando il caching offerto da Django, dovresti considerare di pulire la cache dopo l'upgrade. Altrimenti potresti incappare in probblemi, per esempio, se stai mettendo in cache oggetti pickled perchè questi oggetti non sono garantiti essere pickle-compatibili tra versioni di Django. Un caso passato di incompatibilità era la memorizzazione nella cache degli oggetti :class:`~django.http.HttpResponse`, sia direttamente che indirettamente tramite il decoratore :func:`~django.views.decorators.cache.cache_page`.
ja: Django が提供するキャッシュを利用している場合には、更新後にキャッシュをクリアしなければなりません。クリアしなかった場合にはどんな問題が起こり得るでしょうか？ たとえば、pickle 化したオブジェクトをキャッシュしていた場合には、複数のバージョンの Django にわたって pickle の互換性が保証されません。過去の非互換性の例では、pickle 化された :class:`~django.http.HttpResponse` オブジェクトを、 :func:`~django.views.decorators.cache.cache_page` デコレータを介して直接的または間接的にキャッシュしていました。
ko: Django에서 제공하는 캐시를 사용하는 경우 업그레이드 후 캐시 지우기를 고려해야 합니다. 그렇지 않으면 예를 들어 절인 개체를 캐싱하는 경우 문제가 발생할 수 있습니다. 이러한 개체는 Django 버전에서 피클 호환이 보장되지 않기 때문입니다. 과거 비호환성의 인스턴스는 caching peilt:class였습니다.'~django.the' 입니다.HttpResponse' 객체는 :func:'~django를 통해 직접 또는 간접적으로 생성됩니다.inviews.incache.cache_page' decorator입니다.
pt_br: Se você estiver usando o cache fornecido pelo Django, você deve considerar limpar o cache depois da atualização. De outro modo você pode ter problemas, por exemplo, se você estiver mantendo em cache objetos serializados e estes objetos não tem garantia de compatibilidade de serialização entre as versões do Django. Um problema de imcompatibilidade no passado foi o cache de objetos :class:`~django.http.HttpResponse` serializados, diretamente ou indiretamente via o decorador :func:`~django.views.decorators.cache.cache_page`.
zh_hans: 若你使用 Django 提供的缓存，你需要考虑在升级后清空缓存。否则，你可能会卷入麻烦中，举个例子，若你缓存了 pickled 对象，而这些对象并不能确保跨版本 pickle 兼容。一个过期兼容性例子是缓存 pickled :class:`~django.http.HttpResponse` 对象，不论是直接或间接由 :func:`~django.views.decorators.cache.cache_page` 装饰器创建。

source: How to install Django on Windows
it: Come installare Django su Windows
ja: Windows での Django のインストール方法
ko: 윈도우즈에 Django 설치하기
pt_br: Como instalar o Django no Windows
zh_hans: 如何在 Windows 上安装 Django

source: This document will guide you through installing Python 3.12 and Django on Windows. It also provides instructions for setting up a virtual environment, which makes it easier to work on Python projects. This is meant as a beginner's guide for users working on Django projects and does not reflect how Django should be installed when developing patches for Django itself.
ja: このドキュメントでは、Windows に Python 3.12 と Django をインストールする手順を説明します。また、Python プロジェクトでの作業を容易にする、仮想環境のセットアップ方法についても説明します。これは Django プロジェクトで作業するユーザのための初心者向けガイドであり、 Django 自体のパッチを開発する際に Django をどのようにインストールすべきかを反映したものではありません。

source: The steps in this guide have been tested with Windows 10. In other versions, the steps would be similar. You will need to be familiar with using the Windows command prompt.
it: I passaggi in questa guida sono stati testati su Windows 10. Nelle altre versioni, i passaggi dovrebbero essere simili. Potrebbe aiutare una conoscenza del prompt di comandi di Windows.
ja: このガイドの手順は、Windows 10でテストされています。他のバージョンでも手順は似ています。 Windows のコマンドプロンプトの使い方に精通している必要があります。
ko: 이 가이드의 단계는 Windows 10에서 테스트되었습니다. 다른 버전에서는 단계가 비슷합니다. Windows(윈도우) 명령 프롬프트를 사용하는 방법을 숙지해야 합니다.

source: Install Python
it: Installa Python
ja: Python をインストールする
ko: 파이썬 설치
pt_br: Instalando Python
zh_hans: 安装Python

source: Django is a Python web framework, thus requiring Python to be installed on your machine. At the time of writing, Python 3.12 is the latest version.
ja: Django は Python の Web フレームワークなので、マシンに Python がインストールされている必要があります。執筆時点では、 Python 3.12 が最新版です。

source: To install Python on your machine go to https://www.python.org/downloads/. The website should offer you a download button for the latest Python version. Download the executable installer and run it. Check the boxes next to "Install launcher for all users (recommended)" then click "Install Now".
it: Per installare Python sulla tua macchina vai a https://www.python.org/downloads/. Il sito web dovrebbe offrire un pulsante download per l'ultima versione di Python. Scarica l'installer eseguibile e lancialo. Spunta il box vicino a "Install launcher for all users (recommended)" e poi clicca su "Install Now".
ja: あなたのマシンにPythonをインストールするには、 https://www.python.org/downloads/ を開きます。最新のPythonバージョンのダウンロードボタンが表示されるはずです。実行可能なインストーラをダウンロードして実行します。 "Install launcher for all users (recommended)" にチェックを入れ、"Install Now" をクリックします。

source: After installation, open the command prompt and check that the Python version matches the version you installed by executing:
ja: インストール後、コマンドプロンプトを開き、次のコマンドを実行して、Python のバージョンが今インストールしたバージョンと一致するかどうか確認します。

source: For more details, see :doc:`python:using/windows` documentation.
it: Per maggiori dettagli, vedere la documentazione :doc:`python:using/windows`.
ja: 詳細は :doc:`python:using/windows` ドキュメントを参照してください。
ko: 자세한 내용은:doc:'python:using/window' 설명서를 참조하십시오.

source: About ``pip``
it: Su ``pip``
ja: ``pip`` について
ko: ``pip``\에 대하여
pt_br: Sobre o ``pip``
zh_hans: 关于 ``pip``

source: :pypi:`pip` is a package manager for Python and is included by default with the Python installer. It helps to install and uninstall Python packages (such as Django!). For the rest of the installation, we'll use ``pip`` to install Python packages from the command line.
ja: :pypi:`pip` は Python のパッケージマネージャで、Python インストーラにデフォルトで含まれています。Python パッケージ (Django など！) のインストールとアンインストールに役立ちます。残りのインストールでは、 ``pip`` を使ってコマンドラインから Python パッケージをインストールします。

source: Setting up a virtual environment
it: Impostazione di un ambiente virtuale
ja: 仮想環境の構築
ko: 가상 환경을 설정합니다.

source: It is best practice to provide a dedicated environment for each Django project you create. There are many options to manage environments and packages within the Python ecosystem, some of which are recommended in the `Python documentation <https://packaging.python.org/guides/tool-recommendations/>`_. Python itself comes with :doc:`venv <python:tutorial/venv>` for managing environments which we will use for this guide.
it: È buona norma fornire un ambiente dedicato per ogni progetto Django che crei. Ci sono molte opzioni per gestire ambienti e pacchetti all'interno dell'ecosistema Python, alcune delle quali sono consigliate nella `Documentazione Python <https://packaging.python.org/guides/tool-recommendations/>`_. Python stesso viene fornito con :doc:`venv <python:tutorial/venv>` per la gestione degli ambienti che useremo per questa guida.
ja: 作成する Django プロジェクトごとに専用の環境を用意するのがベストプラクティスです。Python のエコシステム内には、環境やパッケージを管理するための多くのオプションがあり、そのいくつかは `Python のドキュメント <https://packaging.python.org/guides/tool-recommendations/>`_ で推奨されています。Python 自身にも環境管理のための :doc:`venv <python:tutorial/venv>` が付属しています。
ko: 생성하는 각 Django 프로젝트에 전용 환경을 제공하는 것이 좋습니다. 파이썬 생태계 내 환경 및 패키지를 관리할 수 있는 여러 가지 옵션이 있으며 이 중 일부는 파이썬 설명서(https://packaging.python.org/guides/tool-recommendations/)에 나와 있습니다. Python 자체는 우리가 이 가이드에 사용할 환경을 관리하기 위한 :doc:'venv <python:tutorial/venv'와 함께 제공됩니다.

source: To create a virtual environment for your project, open a new command prompt, navigate to the folder where you want to create your project and then enter the following:
ja: プロジェクトの仮想環境を作成するには、新しいコマンドプロンプトを開き、プロジェクトを作成するフォルダに移動して、次のように入力します：

source: This will create a folder called 'project-name' if it does not already exist and set up the virtual environment. To activate the environment, run:
ja: これにより、'project-name'というフォルダーがまだ存在しなければ作成され、仮想環境が構築されます。環境をアクティブにするには、以下を実行します：
