Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: The ``needs_autoescape`` flag and the ``autoescape`` keyword argument mean that our function will know whether automatic escaping is in effect when the filter is called. We use ``autoescape`` to decide whether the input data needs to be passed through ``django.utils.html.conditional_escape`` or not. (In the latter case, we just use the identity function as the "escape" function.) The ``conditional_escape()`` function is like ``escape()`` except it only escapes input that is **not** a ``SafeData`` instance. If a ``SafeData`` instance is passed to ``conditional_escape()``, the data is returned unchanged.
pt_br: A flag ``needs_autoescape`` e o argumento nomeado ``autoescape`` implicam que nossa função irá sabe se a substituição automática está efetiva quando o filtro for chamado. Usamos o ``autoescape`` para decidir se o data de entrada precisa ser acessado através do ``django.utils.html.conditional_escape`` ou não. (No último caso, usamos a função identidade como função de "substituição"). A função ``conditional_escape()`` é como ``escape()`` exceto que somente substitui a entrada que **não** é instância de ``SafeData``. Se uma instância de ``SafeData`` é passada para a ``conditional_escape()``, o dado é retornado sem mudanças.
zh_hans: ``needs_autoescape`` 标志和 ``autoescape`` 关键字参数意味着函数会在过滤器被调用时知道自动转义是否生效。我们利用 ``autoescape`` 来决定是否要将输入数据传递给 ``django.utils.html.conditional_escape``。（后续实例中，我们仍使用同一函数作为“转义”函数。） ``conditional_escape()`` 函数

source: The quotes around the argument (if any) have already been stripped away, so we just receive a plain string.
pt_br: As aspas ao redor do argumento (se existem) já foram retiradas, então recebemos uma string simples.
zh_hans: 包裹参数（如果有的话）的引号已被删除，所以我们只收到一个普通字符串。

source: Auto-escaping for ``simple_tag`` as described in the previous two paragraphs was added.
pt_br: A auto-substituição par ``simple_tag``como descrito acima nos dois parágrafos anteriores foi adicionado.

source: Next, create the template used to render the tag's output. This template is a fixed feature of the tag: the tag writer specifies it, not the template designer. Following our example, the template is very simple:
pt_br: Depois, criamos o template que irá renderizar a saída da tag. Este template é uma característica fixa da tag: o autor da tag especifica isso, não o designer de template. Seguindo o exemplo, o template é muito simples.
zh_hans: 随后，创建用于渲染标签输出的模板。该模板是标签的一个固有特性：标签作者指定它，而不是模板设计者。跟随我们的例子，模板非常简单：

source: Assignment tags
pt_br: Tags de atribuição

source: ``simple_tag`` can now store results in a template variable and should be used instead.
pt_br: ``simple_tag`` agora pode armazenar resultados em uma variável de template e deve ser usado no lugar.

source: To ease the creation of tags setting a variable in the context, Django provides a helper function, ``assignment_tag``. This function works the same way as :meth:`~django.template.Library.simple_tag` except that it stores the tag's result in a specified context variable instead of directly outputting it.
pt_br: Para facilitar a criação de tags capazes de setar uma variável no contexto, o Django fornece uma função de auxílio, ``assignment_tag``. Essa função funciona do mesmo jeito que :meth:`~django.template.Library.simple_tag` exceto que é capaz de armazenar o resultado de uma tag em uma variável de contexto especificada ao invés de diretamente na saída.

source: Our earlier ``current_time`` function could thus be written like this::
pt_br: Nossa função ``current_time`` anterior pode então ser escrita como esta::

source: You may then store the result in a template variable using the ``as`` argument followed by the variable name, and output it yourself where you see fit:
pt_br: Então é possível armazenar o resultado em uma variável de template usando o argumento ``as`` seguido pelo nome da variável, e você pode mostrá-lo onde se encaixa melhor.

source: When Django compiles a template, it splits the raw template text into ''nodes''. Each node is an instance of ``django.template.Node`` and has a ``render()`` method. A compiled template is, simply, a list of ``Node`` objects. When you call ``render()`` on a compiled template object, the template calls ``render()`` on each ``Node`` in its node list, with the given context. The results are all concatenated together to form the output of the template.
pt_br: Quando Django compila um template, o texto do template original é dividido em "nós". Cada nó é uma instância de ``django.template.Node`` e tem um método ``render()``. Um template compilado é, simplesmente, uma lista de objetos ``Node``. Quando chama ``render()`` em um objeto template compilado, o template chama ``render()``para cada ``Node`` na sua lista de nós, com o dado contexto. Os resultados são todos concatenados juntos para formar a saída do template.
zh_hans: Django 编译模板时，会将原始模板文本划为“节点”。每个节点都是一个 ``django.template.Node`` 实例，拥有一个 ``render()`` 方法。简单来说，编译完的模板就是一个包含 ``节点`` 对象的列表。当你在已编译的模板上调用 ``render()``，该模板会为节点列表中的每个 ``节点`` 携带指定上下文调用 ``render()`` 方法。结果会自动连接，形成模板的输出。

source: For example, let's write a full implementation of our simple template tag, ``{% current_time %}``, that displays the current date/time, formatted according to a parameter given in the tag, in :func:`~time.strftime` syntax. It's a good idea to decide the tag syntax before anything else. In our case, let's say the tag should be used like this:
pt_br: Por exemplo, vamos escrever toda a implementação de uma simples tag de template, ``{% current_time %}``, que mostra a data/hora corrente., formatada de acordo com um parâmetro passado na tag, na syntax :func:`~time.strftime`. É uma boa idéia decidir a syntax antes de qualquer outro. No nosso caso, vamos dizer que a tag deveria ser assim:
zh_hans: 举个例子，让我们完整地实现简单模板标签 ``{% current_time %}``，该标签根据标签中指定的参数，以 :func:`~time.strftime` 语法格式化当前时间或日期。先决定标签语法是个不错的主意。在本例中，我们要这样使用标签：

source: The function returns a ``CurrentTimeNode`` with everything the node needs to know about this tag. In this case, it just passes the argument -- ``"%Y-%m-%d %I:%M %p"``. The leading and trailing quotes from the template tag are removed in ``format_string[1:-1]``.
pt_br: A função retorna um ``CurrentTimeNode`` com tudo que o nó precisa para conhecer sobre sua tag. Neste caso, ele apenas passa o argumento -- ``"%Y-%m-%d %I:%M %p"``. As aspas (direita e esquerda) da tag de template estão removidas em ``format_string[1:-1]``.
zh_hans: 该函数返回一个 ``CurrentTimeNode``，内含节点需要了解的标签的一切信息。在本例中，仅传递了参数—— ``"%Y-%m-%d %I:%M %p"``。开头和结尾的引号由 ``format_string[1:-1]`` 删除。

source: If the ``render()`` function of your template stores the result in a context variable (rather than returning the result in a string), it should take care to call ``mark_safe()`` if appropriate. When the variable is ultimately rendered, it will be affected by the auto-escape setting in effect at the time, so content that should be safe from further escaping needs to be marked as such.
pt_br: Se a função ``render()`` do seu template armazena o resultado em uma variável de contexto (ao invés de retornar o resultado em uma string), ele deve tomar o cuidado de chamar ``mark_safe()``se apropriado. Quando a variável é renderizada, ela será afetada pela definição do auto-substituição em efeito na hora, então o conteúdo que deve ser ignorado em futuras substituições deve ser marcado como tal.
zh_hans: 若模板的 ``render()`` 函数在上下文变量中存储结果（而不是以字符串返回结果），它要小心地在合适的时机调用 ``mark_safe()``。当变量最后一次被渲染时，它会在这个时候受到自动转义配置的影响，所以为了避免变量被进一步转义，需要如此配置。

source: The ``template`` attribute of ``Context`` objects was added in Django 1.8. :meth:`context.template.engine.get_template <django.template.Engine.get_template>` must be used instead of :func:`django.template.loader.get_template` because the latter now returns a wrapper whose ``render`` method doesn't accept a :class:`~django.template.Context`.
pt_br: O atributo ``template`` dos objetos ``Context`` foi adicionado no Django 1.8. :meth:`context.template.engine.get_template <django.template.Engine.get_template>` deve ser usado no lugar da :func:`django.template.loader.get_template` porque o último retorna um wrapper (função invólucro) cujo o método ``render`` não aceita a :class:`~django.template.Context`.

source: The CycleNode is iterating, but it's iterating globally. As far as Thread 1 and Thread 2 are concerned, it's always returning the same value. This is obviously not what we want!
pt_br: O CycleNode está iterando, más iterando globalmente. Tanto quanto Thread 1 e Thread 2 são problemas, eles retornam sempre o mesmo valor. Isso não é obviamente o que queremos !
zh_hans: CycleNode 正在被迭代，却是全局范围的。就像线程 1 和线程 2 担心的那样，它们总是返回同样的值。这显然不是我们想要的。

source: Finally, register the tag with your module's ``Library`` instance, as explained in :ref:`writing custom template filters<howto-writing-custom-template-tags>` above. Example::
pt_br: Finalmente, registre a tag com sua instancia de ``Library`` do modelo, como explicado em :ref:`writing custom template filters<howto-writing-custom-template-tags>` acima. Exemplo::
zh_hans: 最后，用模型的 ``Library`` 实例注册该标签，像上文 :ref:`编写自定义模板过滤器 <howto-writing-custom-template-tags>` 介绍的那样。例子::

source: To use the ``Variable`` class, simply instantiate it with the name of the variable to be resolved, and then call ``variable.resolve(context)``. So, for example::
pt_br: Para usar a class ``Variable``, simplesmente instancie-a com o nome da variável a ser resolvida, e então ``variable.resolve(context)``. Então por exemplo::
zh_hans: 要使用 ``Variable`` 类，简单地用变量名实例化它，并调用 ``variable.resolve(context)``。例子::

source: The above examples simply output a value. Generally, it's more flexible if your template tags set template variables instead of outputting values. That way, template authors can reuse the values that your template tags create.
pt_br: Os exemplos acima simplesmente retornam um valor. Geralmente, é mais flexível se suas tags de template definem variáveis ao invés de retornar valores. Desde modo, autores de templates podem reutilizar valores que suas tags de templates criam.
zh_hans: 上述例子仅输出一个值。一般来说，如果你的模板标签设置模板变量，会比直接输出更加灵活。这样，模板作者在你的模板标签创建时能复用这些值。

source: To set a variable in the context, just use dictionary assignment on the context object in the ``render()`` method. Here's an updated version of ``CurrentTimeNode`` that sets a template variable ``current_time`` instead of outputting it::
pt_br: Para definir uma variável no contexto, apenas use no objeto de contexto uma passagem de parâmetros por dicionário no método ``render()``. Aqui uma versão atualizada de ``CurrentTimeNode`` que definie uma variável de template ``current_time`` ao invés de retornar uma saída::
zh_hans: 要在上下文中设置变量，只需在 ``render()`` 方法中对其上下文使用字典赋值。新版的 ``CurrentTimeNode`` 设置了一个模板变量 ``current_time``，而不是直接输出::

source: ``CommentNode.render()`` simply returns an empty string. Anything between ``{% comment %}`` and ``{% endcomment %}`` is ignored.
pt_br: ``CommentNode.render()`` simplesmente retorna uma string vazia. Qualquer coisa entre ``{% comment %}`` e ``{% endcomment %}`` é ignorado.
zh_hans: ``CommentNode.render()`` 简单地返回一个空字符串。 ``{% comment %}`` 和 ``{% endcomment %}`` 之间的全部内容均被忽略。

source: The Internet is a hostile environment. Before deploying your Django project, you should take some time to review your settings, with security, performance, and operations in mind.
pt_br: A internet é um ambiente hostil. Antes de distribuir um projeto Django, você deve perder algum tempo para revisar suas configurações, com segurança, desempenho, e operações em mente.
zh_hans: 互联网是一个恶劣的环境。在部署你的 Django 项目之前，你应该将安全、性能和操作铭记于心，并花一些时间来检查你的配置。

source: You should also configure the Web server that sits in front of Django to validate the host. It should respond with a static error page or ignore requests for incorrect hosts instead of forwarding the request to Django. This way you'll avoid spurious errors in your Django logs (or emails if you have error reporting configured that way). For example, on nginx you might setup a default server to return "444 No Response" on an unrecognized host:
pt_br: Deve-se também configurar o servidor Web que está a frente do Django para validar o host. Ele deve responder com um erro de página estática ou ignorar a requisição para hosts incorretos ao invés de repassar o request para o Django. Desta maneira evitará erros espurios no seu log do Django (ou emails se tiver configurado para isso). Por exemplo, no nginx talvez configure o servidor padrão para retornar "444 no response" quando host não reconhecido:
zh_hans: 你也需要配置挡在 Django 之前的 Web 服务器，让它验证主机。它应该忽略来自错误主机的请求，或返回静态错误页，而不是将请求重定向至 Django。这样做能避免 Django 日志中出现虚假错误（或在配置此种错误后，避免发送错误报告邮件）。例如，在 nginx 上，你可能配置了一个默认主机，为未识别的主机返回 "444 No Response"：

source: If you're using a cache, connection parameters may be different in development and in production.
pt_br: Se está usando "cache", parâmetros de conexões talvez sejam diferentes em desenvolvimento e em produção.

source: If you're using Memcached, consider using :ref:`cached sessions <cached-sessions-backend>` to improve performance.
pt_br: Se estiver usando Memcached, considere usar :ref:`sessões cacheadas <cached-sessions-backend>` para melhorar o desempenho.
zh_hans: 若你使用了 Memcached，考虑用 :ref:`缓存会话 <cached-sessions-backend>` 来提高性能。

source: Media files are uploaded by your users. They're untrusted! Make sure your web server never attempt to interpret them. For instance, if a user uploads a ``.php`` file , the web server shouldn't execute it.
pt_br: Arquivos de media são enviados por usuários. Não são confiáveis! Assegure-se que seu servidor web nunca tente interpretá-los. Por exemplo, se um usuário enviar um arquivo ``.php``, o servidor web não deve executá-lo.

source: Django includes default views and templates for several HTTP error codes. You may want to override the default templates by creating the following templates in your root template directory: ``404.html``, ``500.html``, ``403.html``, and ``400.html``. The default views should suffice for 99% of Web applications, but if you desire to customize them, see these instructions which also contain details about the default templates:
pt_br: O Django inclui várias "views" e "templates" padrão para vários erros HTTP. Talvez você queira sobrescrever os templates padrão criando os seguintes templates na raiz do seu diretório de template: ``404.html``, ``500.html``, ``403.html``, and ``400.html``. As "views" padrão devem bastar para 99% das aplicações Web, mas se desejar customizá-las, veja essas instruções as quais também contém detalhes sobre os templates padrão.

source: Python Options
pt_br: Opções Python

source: It's strongly recommended that you invoke the Python process running your Django application using the `-R`_ option or with the :envvar:`PYTHONHASHSEED` environment variable set to ``random``. This option is enabled by default starting with Python 3.3.
pt_br: É fortemente recomendável que os processos Python que executam a aplicação Django use a opção `-R` ou com a variável de ambiente :envvar:`PYTHONHASHSEED` definida como ``random``. Essa opção está por padrão habilitada a começar com o Python 3.3.

source: These options help protect your site from denial-of-service (DoS) attacks triggered by carefully crafted inputs. Such an attack can drastically increase CPU usage by causing worst-case performance when creating ``dict`` instances. See `oCERT advisory #2011-003 <http://www.ocert.org/advisories/ocert-2011-003.html>`_ for more information.
pt_br: Essas opções ajudam a proteger seu site de ataques de "negação de serviço" (DoS) disparados por entradas cuidadosamente elaboradas. Como um ataque que pode aumentar drasticamente o uso da CPU causando um cenário de pior desempenho quando cria instâncias de ``dict``. Veja `oCERT advisory #2011-003 <http://www.ocert.org/advisories/ocert-2011-003.html>`_ para mais informações.

source: Deploying Django
pt_br: Implantação Django
zh_hans: 部署 Django

source: Django's chock-full of shortcuts to make Web developer's lives easier, but all those tools are of no use if you can't easily deploy your sites. Since Django's inception, ease of deployment has been a major goal.
pt_br: O Django está repleto de atalhos para fazer a vida dos desenvolvedores mais fácil, mas todas essas ferramentas não tem serventia se você não pode facilmente implantar seus sites. desde o começo do Django, a facilidade de implantação tem sido seu maior objetivo.
zh_hans: Django 中简化 Web 开发的快捷函数俯拾皆是，但是如果不能轻松部署站点的话，所有的工具都徒劳无益。Django 从最初就把方便部署当作一个主要目标。

source: If you're new to deploying Django and/or Python, we'd recommend you try :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>` first. In most cases it'll be the easiest, fastest, and most stable deployment choice.
pt_br: Se você é novo na implantação de Django e/ou Python, recomendamos que tente primeiro doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>`. Na maioria dos casos esta será a mais fácil, rápida e mais estável escolha para implantação.
zh_hans: 如果你是初次接触 Django 或者 Python，我们推荐你先尝试阅读文档 :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>`。在大多数情况，这种部署方式是最简单，最快和最稳定的。

source: If you have installed a :ref:`custom User model <auth-custom-user>` and want to use this default auth handler, it must support an ``is_active`` attribute. If you want to use group based authorization, your custom user must have a relation named 'groups', referring to a related object that has a 'name' field. You can also specify your own custom mod_wsgi auth handler if your custom cannot conform to these requirements.
pt_br: Se você instalou um :ref:`custom User model <auth-custom-user>` e quer usar a autenticador padrão, ele tem que ter um atributo ``is_active``. Se quer usar autoriações baseadas em "grupo", seu usuário personalizado deve ter uma relação chamada 'groups', referenciando um objeto relacional que tenha o campo 'name'. Você ainda pode especificar seu próprio autenticador mod_wsgi personalizado se sua personalização não puder atingir esses requerimentos.

source: Make sure that mod_wsgi is installed and activated and that you have followed the steps to setup :doc:`Apache with mod_wsgi </howto/deployment/wsgi/modwsgi>`.
pt_br: Certifique-se que o mod_wsgi está instalado e ativo e que seguiu os passos para configuração :doc:`Apache with mod_wsgi </howto/deployment/wsgi/modwsgi>`.
zh_hans: 确保你已按照 :doc:`Apache 配合 mod_wsgi </howto/deployment/wsgi/modwsgi>` 文档正确安装并激活了 mod_wsgi。

source: Gunicorn_ ('Green Unicorn') is a pure-Python WSGI server for UNIX. It has no dependencies and is easy to install and use.
pt_br: O Gunicorn_ ('Green Unicorn') é um seridor WSGI para Unix feito em Python puro. Ele não tem depedências e é fácil de instalar e usar.
zh_hans: Gunicorn_ ('Green Unicorn') 是一个 UNIX 下的纯 Python WSGI 服务器。它没有其它依赖，容易安装和使用。

source: Installing gunicorn is as easy as ``pip install gunicorn``. For more details, see the `gunicorn documentation`_.
pt_br: Instalar o Gunicorn é tão fácil quando ``pip install gunicorn``. Para mais detalhes, veja a `gunicorn documentation`_.
zh_hans: 安装 gunicorn 非常简单，只要执行 ``pip install gunicorn`` 即可。更多细节请参考 `gunicorn documentation`_。

source: When Gunicorn is installed, a ``gunicorn`` command is available which starts the Gunicorn server process. At its simplest, gunicorn just needs to be called with the location of a module containing a WSGI application object named `application`. So for a typical Django project, invoking gunicorn would look like::
pt_br: Quando Gunicorn é instalado, um comando ``gunicorn`` é disponibilizado para iniciar o o processo servidor do Gunicorn. Na sua forma mais simples, gunicorn somente precisa ser chamado com a localização do módulo contendo o objeto da aplicação WSGI nomeado `application`. Então para um típico projeto Django, chamar o gunicorn deve parecer com::
zh_hans: 安装 Gunicorn 之后，可以使用 ``gunicorn`` 命令启动 Gunicorn 服务进程。最简模式下，只需要把包含了 WSGI 应用对象的 `application` 模块位置告诉 gunicorn，就可以启动了。因此对于典型的 Django 项目，像这样来调用 gunicorn::

source: Django's :djadmin:`startproject` management command sets up a simple default WSGI configuration for you, which you can tweak as needed for your project, and direct any WSGI-compliant application server to use.
pt_br: O comando de gerenciamento do Django :djadmin:`startproject` define uma configuração WSGI simples padrão para você, que você pode ajustar conforme necessário para o seu projeto , e direcionar qualquer servidor de aplicações compatível com WSGI para uso.
zh_hans: Django 的管理命令 :djadmin:`startproject` 生成了一个简单的默认 WSGI 配置，你可以按照自己项目的需要去调整这个配置，任何兼容 WSGI 的应用服务器都可以直接使用。

source: WSGI servers obtain the path to the ``application`` callable from their configuration. Django's built-in server, namely the :djadmin:`runserver` command, read it from the :setting:`WSGI_APPLICATION` setting. By default, it's set to ``<project_name>.wsgi.application``, which points to the ``application`` callable in :file:`<project_name>/wsgi.py`.
pt_br: Servidores WSGI obtem o caminho para o executável ``application`` a partir da sua configuração. O servidor embutido do Django, nomeadamente o comando :djadmin:`runserver`, lê isso da configuração do :setting:`WSGI_APPLICATION`. Por padrão, é definido pelo ``<project_name>.wsgi.application``, o qual aponta para o executável ``application`` em :file:`<project_name>/wsgi.py`.

source: To apply `WSGI middleware`_ you can simply wrap the application object. For instance you could add these lines at the bottom of :file:`wsgi.py`::
pt_br: Pra aplicar o `WSGI middleware`_ você pode simplesmente envolver o objeto da aplicação. Por exemplo, você pode adicionar essas linhas no final do :file:`wsgi.py`::
zh_hans: 要应用 `WSGI 中间层`_，你只需简单包裹应用对象。举个例子，你可以在 :file:`wsgi.py` 末尾添加以下代码::

source: Some third-party WSGI middleware do not call ``close`` on the response object after handling a request. In those cases the :data:`~django.core.signals.request_finished` signal isn't sent. This can result in idle connections to database and memcache servers.
pt_br: Algumas middleware WSGI de terceiros não chamam ``close`` no objeto de resposta depois de manipular um request. Nestes casos o sinal :data:`~django.core.signals.request_finished` não é enviado. Isso pode resultar em conexões inativas no banco e em servidores memcache.

source: The `official mod_wsgi documentation`_ is fantastic; it's your source for all the details about how to use mod_wsgi. You'll probably want to start with the `installation and configuration documentation`_.
pt_br: A `official mod_wsgi documentation`_ é fantastica; É o sua fonte para todos os detalhes sobre como usar mod_wsgi. Você provavelmente irá querer começar com `installation and configuration documentation`_.

source: Once you've got mod_wsgi installed and activated, edit your Apache server's `httpd.conf`_ file (or a `virtual host`_ file) and add the following. If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
pt_br: Uma vez que tenha o mod_wsgi instalado e ativado, edit o arquivo `httpd.conf`_ do seu servidor Apache (ou um arquivo `virtual host`_ ) e adicione o seguinte. Se estiver usando uma versão do Apache anterior a 2.4, substitua ``Require all granted`` com ``Allow from all`` e também adicione a linha ``Order deny,allow`` acima dele.

source: The ``<Directory>`` piece just ensures that Apache can access your :file:`wsgi.py` file.
pt_br: A parte ``<Directory>`` somente assegura que o Apache pode acessar seu arquivo :file:`wsgi.py`.
zh_hans: ``<Directory>`` 片段仅确保 Apache 能访问 :file:`wsgi.py` 文件。
