Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: **Raw strings** are the native Python strings. On output, they're escaped if auto-escaping is in effect and presented unchanged, otherwise.
it: Le **Raw strings** sono le stringhe native di Python. All'output, sono oggetto di escape se è attivo l'auto-escape o altrimenti presentate senza cambiamenti.
ja: **Raw strings** はPythonのネイティブの文字列です。出力時に、自動エスケープが有効な場合はエスケープされ、それ以外の場合は変更されません。
ko: **원시 문자열*은(는) 기본 Python 문자열입니다. 출력 시 자동 이스케이프가 적용되고 변경되지 않은 상태로 표시되는 경우, 그렇지 않은 경우 이 기능은 이스케이프됩니다.
zh_hans: **原始字符串** 指原生 Python 字符串。在输出时，如果自动转义生效，则对它们进行转义，否则将保持不变。

source: **Safe strings** are strings that have been marked safe from further escaping at output time. Any necessary escaping has already been done. They're commonly used for output that contains raw HTML that is intended to be interpreted as-is on the client side.
it: Le **Safe strings** sono stringhe che sono state marcate come safe da ulteriori escape a tempo di output. Ogni escaping necessario è già stato fatto. Sono usate comunemente per output che contiene HTML grezzo che deve essere interpretato così come è client-side.
ja: **Safe strings** は出力時にさらなるエスケープがされないように安全とマークされた文字列です。必要なエスケープはすでに行われています。これらはクライアント側でそのまま解釈されることを目的とした生のHTMLを含む出力によく利用されます。
ko: **safe strings**는 출력 시 추가 이스케이프로부터 안전한 것으로 표시된 문자열입니다. 필요한 모든 탈출은 이미 이루어졌다. 일반적으로 클라이언트 측에서 있는 그대로 해석할 원시 HTML을 포함하는 출력에 사용됩니다.
pt_br: **Safe strings** são strings que tenham sido marcadas como seguras para futuros "escaping" no tempo de saída. Qualquer "escaping" necessário já foi feito. Eles são comumente usados para saídas que contenham HTML puro que se destina a ser interpretado como estão do lado do cliente.
zh_hans: **安全字符串** 是在输出时被标记为安全的字符串，不会进一步转义。必要的转义已在之前完成。它们通常用于原样输出 HTML，HTML 会在客户端被解释。

source: Internally, these strings are of type :class:`~django.utils.safestring.SafeString`. You can test for them using code like::
it: Internamente, queste stringhe sono di tipo :class:`~django.utils.safestring.SafeString`. Puoi testarle utilizzando del codice come questo::
ja: 内部では、これらの文字列は :class:`~django.utils.safestring.SafeString` 型になります。次のようなコードでこれらの値を検証することができます:
ko: 내부적으로 이러한 문자열은 다음과 같은 유형입니다.'~django.utils.tils.dring.SafeString'. 다음과 같은 코드를 사용하여 테스트할 수 있습니다.

source: Template filter code falls into one of two situations:
it: Il codice dei filtri di template ricade in una delle due situazioni::
ja: テンプレートフィルタのコードは、次の2つの状況のいずれかに当てはまります:
ko: 템플릿 필터 코드 두 가지 상황 중 하나에 속합니다:
pt_br: Código de filtros de templates caem em um das duas situações:
zh_hans: 模板过滤器代码有两种情况：

source: Your filter does not introduce any HTML-unsafe characters (``<``, ``>``, ``'``, ``"`` or ``&``) into the result that were not already present. In this case, you can let Django take care of all the auto-escaping handling for you. All you need to do is set the ``is_safe`` flag to ``True`` when you register your filter function, like so::
it: Il tuo filtro non introduce caratteri HTML non sicuri (``<``, ``>``, ``'``, ``"`` or ``&``) nei risultati che non erano già presenti. In questo caso, puoi lasciare che Django si curi di fare auto-escape per te. Tutto quel che devi fare è impostare ``is_safe`` a ``True`` quando registri la funzione di filtro, così::
ja: フィルタが結果に新たにHTMLで安全でない文字 (``<``, ``>``, ``'``, ``"`` or ``&``) を導入しない場合。この場合、Djangoにすべての自動エスケープ処理を任せることができます。フィルタ関数を登録する際に、 ``is_safe`` フラグを ``True`` に設定するだけです。次のようにします:
ko: 당신의 필터는 HTML이 안전하지 않은 문자(``<``, ``>``, ``'``, ``"`` or ``&``)를 아직 존재하지 않는 결과에 도입하지 않는다. 이 경우, Django가 당신을 위해 모든 자동 대피 처리를 하도록 할 수 있습니다. 다음과 같이 필터 기능을 등록할 때 "is_safe" 플래그를 "true"로 설정하면 된다.
pt_br: Seu filtro não introduz qualquer caracter HTML inseguro (``<``, ``>``, ``'``, ``"`` or ``&``) no resultado que ainda não foi apresentado. Neste caso, você pode deixar o Django cuidar de toda a manipulação do "auto-espacaping" pra você. Tudo o que precisa é definir a "flag" `ìs_safe``para ``True`` quando registrar a função do filtro, como::
zh_hans: 你的过滤器不会将任何 HTML 不安全的字符(``<``, ``>``, ``'``, ``"`` or ``&``)引入尚未出现的结果中。这种情况下，可以让 Django 自动为您处理所有的转义操作。你只需在注册自己的过滤器函数时，将 ``is_safe`` 标志置为 ``True``，像这样::

source: This flag tells Django that if a "safe" string is passed into your filter, the result will still be "safe" and if a non-safe string is passed in, Django will automatically escape it, if necessary.
it: Questo flag dice a Django che se una striga "safe" viene passata nel filtro, il risultato sarà ancora "safe" e se viene passata una stringa "non safe", Django farà automaticamente escape, se necessario.
ja: このフラグは、"安全"な文字列がフィルタに渡された場合、結果も依然として"安全"であることをDjangoに伝えます。そして、安全でない文字列が渡された場合、必要に応じてDjangoが自動的にエスケープします。
ko: 이 플래그는 Django에게 "안전한" 문자열을 필터에 전달해도 결과는 "안전"하며, 비안전 문자열이 전달되면 Django는 필요할 경우 자동으로 이 문자열을 이스케이프할 것이라고 합니다.
pt_br: A "flag" diz ao Django que se uma string "segura" é passada para seu filtro, o resultado ainda será "seguro" e se uma string não segura é passada, Django irá automaticamente fazer o "escape", se necessário.
zh_hans: 该标志告诉 Django，若一个“安全”字符串传给您的过滤器，结果仍会是安全的。若传入了不安全的字符串，Django 会在需要时自动转义。

source: You can think of this as meaning "this filter is safe -- it doesn't introduce any possibility of unsafe HTML."
it: Puoi pensarlo come "questo filtro è sicuro -- non introduce alcuna possibilità di HTML non safe".
ja: この場合、"このフィルタは安全である ―― それはどんな非安全なHTMLも導入する可能性はない。" と考えて構いません。
ko: 여러분은 이것을 "이 필터가 안전하다 - 이것은 안전하지 않은 HTML의 가능성을 전혀 유발하지 않는다"라는 의미로 생각할 수 있습니다.
pt_br: Você pode entender isso como "este filtro é seguro -- ele não introduz qualquer possibilidade de HTML não seguro"
zh_hans: 你可以这么认为，“过滤器是安全的——它不会产生任何不安全的 HTML。”

source: The reason ``is_safe`` is necessary is because there are plenty of normal string operations that will turn a ``SafeData`` object back into a normal ``str`` object and, rather than try to catch them all, which would be very difficult, Django repairs the damage after the filter has completed.
it: La ragione per la quale ``is_safe`` è necessario è perchè ci sono molte operazioni sulle stringhe che trasformano un oggetto ``SafeData`` in uno oggetto ``str`` normale e, piuttosto che cercare di catturarle tutte, cosa che sarebbe molto difficile, Django ripara il danno dopo aver completato il filtro.
ja: ``is_safe`` が必要な理由は、 ``SafeData`` オブジェクトを普通の ``str`` オブジェクトに変換するような標準的な文字列操作が多数存在し、これら全てを捉えることが非常に難しいため、Djangoではフィルタの処理が完了した後に問題を修正するためです。
ko: ``is_safe"가 필요한 이유는 ``SafeData" 물체를 정상적인 "str" 물체로 되돌리고 그것들을 모두 잡으려고 하기보다는 필터 완료 후 손상을 Django가 수리하는 정상적인 문자열 작업이 많기 때문이다.
zh_hans: 一定要 ``is_safe`` 的原因是大量的字符串操作会将 ``SafeData`` 对象返回为普通 ``str`` 对象，而不是尝试全部捕获（挺难的），Django 在过滤完成后尝试修复这些损伤。

source: For example, suppose you have a filter that adds the string ``xx`` to the end of any input. Since this introduces no dangerous HTML characters to the result (aside from any that were already present), you should mark your filter with ``is_safe``::
it: Per esempio, supponi di avere un filtro che aggiunge ``xx`` alla fine di ogni input. Siccome non introduce caratteri HTML pericolosi al risultato (tranne che nel caso non ci siano già), dovresti marcare il tuo filtro con ``is_safe``::
ja: 例えば、任意の入力の末尾に文字列 ``xx`` を追加するフィルタがあるとします。これは結果に危険なHTML文字を導入しません（元々存在していたものを除く）。よって、フィルタを ``is_safe`` でマークすべきです:
ko: 예를 들어, 입력 끝에 문자열 "xx"를 추가하는 필터가 있다고 가정합시다. 이것은 (이미 존재했던 어떤 것과도 별도로) 결과에 위험한 HTML 문자를 도입하지 않기 때문에, 필터를 "is_safe"로 표시해야 한다.
pt_br: Por exemplo, suponha que tenha um filtro que adiciona a string ``xx``ao final de uma entrada. Uma vez que isso não introduz nenhum caracter HTML perigoso para o resultado (além daqueles que já estão presentes), você deveria marcar seu filtro como ``is_safe``::
zh_hans: 举例来说，假定有个过滤器，会在任何输入后追加 ``xx``。由于此操作不会在结果产生任何 HTML 危险的字符（除了那些已存在的），你需要用 ``is_safe`` 标记你的过滤器::

source: When this filter is used in a template where auto-escaping is enabled, Django will escape the output whenever the input is not already marked as "safe".
it: Quando questo filtro viene utilizzato in un template quando l'auto-escape è abilitato, Django farà escape dell'output in tutti i casi in cui l'input non sia marcato come "safe".
ja: このフィルタが自動エスケープが有効なテンプレートで使用される場合、入力が既に"安全"としてマークされていない限り、Djangoは出力をエスケープします。
ko: 자동 이스케이프가 활성화된 템플릿에서 이 필터를 사용할 경우 Django는 입력이 "안전"으로 표시되지 않을 때마다 출력을 이스케이프합니다.
pt_br: Quando o filtro é usado em um template onde a auto-substituição está habilitada, o Django irá fazer a substituição na saída sempre que a entrada ainda não estiver marcada como "safe".
zh_hans: 当该过滤器对某个启用了自动转义的模板生效时，Django 会对输出自动转义，不管输入是否被标记为“安全的”。

source: By default, ``is_safe`` is ``False``, and you can omit it from any filters where it isn't required.
it: Di default, ``is_safe`` è ``False`` e puoi ometterlo da tutti i filtri in cui non sia required.
ja: デフォルトでは ``is_safe`` は ``False`` ですが、それが必要でないフィルタでは省略できます。
ko: 기본적으로 "is_safe"는 "False"이며 필요하지 않은 모든 필터에서 제외할 수 있습니다.
pt_br: Por padrão, ``is_safe`` é ``falso``, e você pode omiti-lo em qualquer filtro onde ele não é requerido.
zh_hans: 默认情况下， ``is_sate`` 为 ``False``，你可以为不要求此项的过滤器忽略它。

source: Be careful when deciding if your filter really does leave safe strings as safe. If you're *removing* characters, you might inadvertently leave unbalanced HTML tags or entities in the result. For example, removing a ``>`` from the input might turn ``<a>`` into ``<a``, which would need to be escaped on output to avoid causing problems. Similarly, removing a semicolon (``;``) can turn ``&amp;`` into ``&amp``, which is no longer a valid entity and thus needs further escaping. Most cases won't be nearly this tricky, but keep an eye out for any problems like that when reviewing your code.
it: Fai attenzione quando decidi se il tuo filtro davvero lascia le stringhe safe come safe. Se stai *rimuovendo* caratteri, potresti lasciare inavvertitamente tag HTML non bilanciati o entità nei risultati. Per esempio, rimuovere un ``>`` dall'input potrebbe convertire ``1`` in ``<a``, che avrebbe bisogno di escaping sull'output per evitare problemi. In modo simile, rimuovere un punto e virgola (``;``) può trasformare ``&amp;`` in ``&amp``, che non è più una entità valida e quindi necessità di ulteriore escaping. In molti casi non sarà così complicato ma fai attenzione a problemi come questi quando rivedi il tuo codice.
ja: フィルタが本当に安全な文字列を安全なまま残すかどうかを判断するときには注意してください。文字を *除去* している場合、不注意で結果の中に不均衡なHTMLタグやエンティティが残ってしまうかもしれません。例えば、入力から ``>`` を取り除くと ``<a>`` が ``<a`` になってしまうかもしれません。同様に、セミコロン(``;``)を削除すると、``&amp;`` が ``&amp`` に変わります。ほとんどの場合、ここまでトリッキーになることはありませんが、コードをレビューする際はこのような問題がないか注意してください。
ko: 필터가 실제로 안전한 문자열을 남기는지 결정할 때 주의하십시오. 문자를 *제거*하는 경우 결과에 불균형한 HTML 태그 또는 엔티티를 남길 수 있습니다. 예를 들어 입력에서 ""를 제거하면 ""가 ""로 바뀔 수 있는데, 문제가 발생하지 않도록 출력에서 "a"를 빼야 할 것이다. 마찬가지로 세미콜론(';')을 제거하면 ``&amp;"이 ``&amp;"로 바뀔 수 있는데, 이것은 더 이상 유효한 실체가 아니기 때문에 더 이상의 탈출이 필요하다. 대부분의 경우 이렇게 까다롭지는 않겠지만 코드를 검토할 때 이와 같은 문제를 주의 깊게 살펴보십시오.
pt_br: Tenha cuidado quando estiver decidindo se o seu filtro realmente irá deixar strings seguras como "safe". Se estiver "removendo" caracteres, poderia deixar tags HTML ou entidades incompletas no resultado. Por exemplo, removendo um ``>``de uma entrada poderia tornar ``<a>`` em um ``<a``, que poderia ser necessário fazer o "escape" na saída para evitar causar problemas. Similar a isso, removendo um ponto-e-vírgula (``;``) pode tornar um ``& amp;`` em um ``& amp`` , o qual não é mais uma entidade válida e assim precisa realizar o "escape". A maioria dos casos nem chegarão perto de ser complicados assim, mas fique de olho para qualquer problema como este quando revisar seu código.
zh_hans: 在确定过滤器是否确实将安全字符串保留为安全字符串时要千万小心。如果你正在 **删除** 字符，你可能不经意的在结果中留下不成对的 HTML 标记或实体。例如，从输入中删除一个 ``>`` 可能将 ``<a>`` 转为 ``<a``，后者可能需要转移，避免导致输出错误。类似的，删除一个分号(``;``)会将 ``&amp;`` 转为 ``&amp``，后者不再是一个有效的实体，因此需要转义。大多数情况下都没这么复杂，但是检查代码时要注意类似的问题。

source: Marking a filter ``is_safe`` will coerce the filter's return value to a string. If your filter should return a boolean or other non-string value, marking it ``is_safe`` will probably have unintended consequences (such as converting a boolean False to the string 'False').
it: Marcare un filtro come ``is_safe`` forzerà il valore restituito a stringa. Se il tuo filtro dovrebbe restituire un booleano o altri valori non stringa, marcarlo come ``is_safe`` probabilmente avrà conseguenze non volute (come la conversione del booleano False nella stringa 'False').
ja: フィルタを ``is_safe`` としてマークすると、フィルタの戻り値が文字列に強制されます。フィルタがブール値や他の文字列でない値を返すべき場合、 ``is_safe`` とマークすると意図しない結果になる可能性があります（例えば、ブール値の False を文字列の 'False' に変換するなど）。
ko: 필터를 "is_safe"로 표시하면 필터의 값을 문자열로 반환해야 합니다. 필터가 부울 값이나 기타 문자열이 아닌 값을 반환해야 하는 경우 "is_safe"로 표시하면 의도하지 않은 결과가 발생할 수 있습니다(예: 부울 False를 문자열 'False'로 변환).
pt_br: Fazendo um filtro ``is_safe`` obriga que este retorne um valor do tipo string. Se o seu filtro deveria retornar uma boolean ou outro valor que não uma string, marcar isso como ``is_safe`` provavelmente terá consequências inexperadas (tal como converter um booleano "False" para a string 'False').
zh_hans: 标记过滤器的 ``is_safe`` 会强制该过滤器的返回值为字符串。如果你的过滤器要返回一个布尔值或非字符串值，将其标记为 ``is_safe`` 可能会导致出乎意料的结果（类似将一个布尔值 False 转为字符串 'False'）。

source: Alternatively, your filter code can manually take care of any necessary escaping. This is necessary when you're introducing new HTML markup into the result. You want to mark the output as safe from further escaping so that your HTML markup isn't escaped further, so you'll need to handle the input yourself.
it: Alternativamente, il tuo codice può occuparsi manualmente di ogni escaping necessario. Questo è necessario quando introduci del nuovo markup HTML nei risultati. Potresti voler marcare l'output come safe così da non introdurre ulteriore escaping ed in questo caso dovrai occuparti da te dell'input.
ja: または、フィルタのコードで必要なエスケープ処理を手動で行うこともできます。これは、結果に新しいHTMLマークアップを導入する場合に必要です。HTMLマークアップがさらにエスケープされないように、出力を安全としてマークしたい場合は、入力を自分で処理する必要があります。
ko: 또는 필터 코드가 필요한 이스케이프를 수동으로 처리할 수 있습니다. 이것은 결과에 새 HTML 마크업을 도입할 때 필요합니다. HTML 마크업이 더 이상 유출되지 않도록 출력을 안전한 것으로 표시하여 입력을 직접 처리해야 합니다.
pt_br: Uma alternativa, o código do seu filtro pode manualmente cuidar das substituições necessárias. Isso é necessário quando adicionar uma marcação HTML ao resultado. Você quer marcar a saída como segura de substituições posteriores, então suas marcação HTML não será substituída, e precisará tratar a entrada por conta própria.
zh_hans: 或者，你的过滤器代码要手动关注必须的转义操作。这在输出新 HTML 标记时是必须的。想要避免你的 HTML 标记不被后续操作转义，你要将输出标记为安全的，且需要自己处理输入。

source: To mark the output as a safe string, use :func:`django.utils.safestring.mark_safe`.
it: Per marcare l'output come stringa safe, usa :func:`django.utils.safestring.mark_safe`.
ja: 出力を安全な文字列としてマークするには :func:`django.utils.safestring.mark_safe` を使います。
ko: 출력을 안전한 문자열로 표시하려면 func:'django.utils.safeestring.mark_safe'를 사용합니다.
pt_br: Para marcar a saída como saída segura, use :func:`django.utils.safestring.mark_safe`.
zh_hans: 要将输出标记为安全字符串，使用 :func:`django.utils.safestring.mark_safe`。

source: Be careful, though. You need to do more than just mark the output as safe. You need to ensure it really *is* safe, and what you do depends on whether auto-escaping is in effect. The idea is to write filters that can operate in templates where auto-escaping is either on or off in order to make things easier for your template authors.
it: Stai attento però. Devi fare altro oltre a marcare l'output come safe. Devi assicurarti che sia davvero *safe* e quel che fai dipende dal fatto che l'auto-escaping sia attivo. L'idea è scrivere filtri che possano operare in template in cui l'auto-escape sia attivo o meno per rendere più facili le cose agli autori dei template.
ja: ただし注意が必要です。出力を安全としてマークするだけでは不十分です。本当にそれが *安全である* ことを確認する必要があり、行うべきことは自動エスケープが有効かどうかによって異なります。テンプレート作成者のために、自動エスケープがオンまたはオフのどちらのテンプレートでも操作できるフィルタを書くことが考えられます。
ko: 하지만 조심하세요. 출력을 안전한 것으로 표시하는 것 이상을 수행해야 합니다. 실제로 *안전성을 보장해야 하며, 자동 이스케이핑이 적용되는지 여부에 따라 작업이 달라집니다. 자동 이스케이핑이 설정되거나 해제된 템플릿에서 작동할 수 있는 필터를 작성하여 템플릿 작성자에게 보다 쉽게 제공할 수 있습니다.
pt_br: Porém, tenha cuidado. É necessário mais que marcar a saída como segura. É necessário ter certeza que isso *é* realmente seguro, e o que fará depende se a auto-substituição está fazendo efeito. A idéia é escrever filtros que podem operar em templates onde o auto-escaping está ligado ou desligado de modo a tornar as coisas mais fáceis para os autores de templates.
zh_hans: 不过还是要小心，你要做的不只是将输出标记为安全的。你需要确保它 *真的是* 安全的，你所做的取决于自动转义是否生效。理想状态下，编写的过滤器在自动转义开启与关闭的情况下均能正确的操作模板，这样模板作者用起来就更简单了。

source: In order for your filter to know the current auto-escaping state, set the ``needs_autoescape`` flag to ``True`` when you register your filter function. (If you don't specify this flag, it defaults to ``False``). This flag tells Django that your filter function wants to be passed an extra keyword argument, called ``autoescape``, that is ``True`` if auto-escaping is in effect and ``False`` otherwise. It is recommended to set the default of the ``autoescape`` parameter to ``True``, so that if you call the function from Python code it will have escaping enabled by default.
it: Perchè il filtro conosca lo stato corrente di auto-escape, imposta il flag ``needs_autoescape`` a ``True`` quando registri la tua funzione di filtro (se non lo specifichi, di default è impostato a ``False``). Questo flag dice a Django che il tuo filtro vuole che gli sia passato un argomento extra chiamato ``autoescape``, che è ``True`` se l'auto-escape è attivo e ``False`` altrimenti. Si raccomanda di impostare il default sull'auto-escape a ``True``, così che chiamando la funzione dal codice Python l'escape sarà abilitato di default.
ja: フィルタが現在の自動エスケープの状態を知るためには、フィルタ関数を登録する際に ``needs_autoescape`` フラグを ``True`` に設定します。(このフラグを指定しない場合、デフォルトは ``False`` です)。このフラグは、追加のキーワード引数 ``autoescape`` をDjangoに渡すようにフィルタ関数に伝えます。この引数は自動エスケープが有効の場合は ``True`` 、そうでない場合は ``False`` となります。 ``autoescape`` パラメータのデフォルトは ``True`` に設定しておくことが推奨されます。これにより、Pythonコードから関数を呼び出したときにデフォルトでエスケープが有効になります。
ko: 필터가 현재의 자동 탈출 상태를 알기 위해서는 필터 기능을 등록할 때 "needs_autoscape" 플래그를 "true"로 설정하십시오. (이 깃발을 지정하지 않으면 기본값은 "False"입니다.) 이 깃발은 장고에게 당신의 필터 기능이 "자동 탈출"이라는 추가적인 키워드 인수가 통과되기를 원한다는 것을 알려주고 있는데, 그것은 자동 탈출이 유효하다면 "참"이고 그렇지 않으면 "거짓"이다. "자동탈출" 파라미터의 디폴트를 "트루"로 설정하여 파이썬 코드에서 함수를 호출할 경우 기본적으로 이스케이프가 활성화되도록 할 것을 권고한다.
pt_br: Para que seu filtro saiba o estado corrente do estado da auto-substituição, defina a flag ``needs_autoescape`` como ``True`` quando registrar o filtro. (se não especificar esa flag, seu valor padrão é ``False``). Esta flag dia ao Django que sua função do filtro quer que seja passado um argumento extra, chamado ``autoescape`, que é ``True`` se está em efeito e ``False``caso contrário. É recomendado definir o padrão do parâmetro ``autoescape`` para ``True``, então se a função for chamado de um código Python esta terá a substituição habilitada por padrão.
zh_hans: 为了让你的过滤器知道自动转移开关的状态，在你注册过滤器函数时将 ``needs_autoescape`` 标志（默认 ``False``）设置为 ``True``。该标志告诉 Django 过滤器函数额外接受一个名为 ``autoescape`` 关键字参数，值为 ``True`` 时说明自动转义生效中， ``False`` 说明关闭。推荐将 ``autoescape`` 参数的默认值设为 ``True``，这样，从 Python 代码调用此函数时，默认开启自动转义功能。

source: For example, let's write a filter that emphasizes the first character of a string::
it: Ad esempio, scriviamo un filtro che enfatizza il primo carattere di una stringa::
ja: 例えば、文字列の最初の文字を強調するフィルタを書いてみましょう:
ko: 예를 들어 문자열의 첫 번째 문자를 강조하는 필터를 작성하겠습니다.
pt_br: Por exemplo, vamos escrever um filtro que enfatiza o primeiro caracter de uma string::
zh_hans: 例子，让我们编写一个强制大写字符串的首字母的过滤器::

source: The ``needs_autoescape`` flag and the ``autoescape`` keyword argument mean that our function will know whether automatic escaping is in effect when the filter is called. We use ``autoescape`` to decide whether the input data needs to be passed through ``django.utils.html.conditional_escape`` or not. (In the latter case, we use the identity function as the "escape" function.) The ``conditional_escape()`` function is like ``escape()`` except it only escapes input that is **not** a ``SafeData`` instance. If a ``SafeData`` instance is passed to ``conditional_escape()``, the data is returned unchanged.
it: Il flag ``needs_autoescape`` e l'argomento keyword ``autoescape`` fanno sì che la funzione sappia quando l'escaping automatico è attivo nel momento in cui il filtro viene chiamato. Usiamo ``autoescape`` per decidere quando l'input debba essere passato in ``django.utils.html.conditional_escape`` o meno. (In quest'ultimo caso, usiamo la funzione identità come funzione di "escape"). La funzione ``conditional_escape()`` è come ``escape()`` a parte per il fatto che fa escaping dell'input che **non** è una instanza di ``SafeData``. Se una istanza di ``SafeData`` viene passata a ``conditional_escape()``, i dati vengono restituiti così come sono.
ja: ``needs_autoescape`` フラグと ``autoescape`` キーワード引数により、フィルタが呼び出された際に自動エスケープが有効かどうかを関数が知ることができます。 ``autoescape`` を使用して、入力データを ``django.utils.html.conditional_escape`` に通す必要があるかどうかを決定します（必要なければ、恒等関数を "escapse" 関数として使用します）。 ``conditional_escape()`` 関数は ``escape()`` に似ていますが、 ``SafeData`` インスタンス **でない** 入力のみをエスケープします。 ``SafeData`` インスタンスが ``conditional_escape()`` に渡された場合、データは変更されずにそのまま返されます。
ko: "needs_autoscape" 깃발과 "autoscape" 키워드 주장은 필터가 호출될 때 자동 탈출이 유효한지 여부를 우리의 기능이 알게 된다는 것을 의미한다. 우리는 입력 데이터가 ``django.utils.html.conditional_escape"를 통과해야 하는지 여부를 결정하기 위해 "autoscape"를 사용한다. (후자의 경우, 우리는 ID 기능을 "scape" 기능으로 사용한다.) 조건부_탈출() 기능은 ***이 아닌 ``안전한 데이터" 인스턴스인 입력만 빠져나간다는 점을 제외하면 ``탈출()"과 같다. "안전한 데이터" 인스턴스가 ``조건적"으로 넘어가면 데이터는 변경되지 않고 반환된다.

source: Finally, in the above example, we remember to mark the result as safe so that our HTML is inserted directly into the template without further escaping.
it: Infine, nell'esempio sopra, ci ricordiamo di marcare il risultato come safe in modo che il nostro HTML venga inserito direttamente nel template senza ulteriore escaping.
ja: 最後に、上の例では、HTMLがさらにエスケープされることなくテンプレートに直接挿入されるように、結果を安全としてマークすることを忘れないでください。
ko: 마지막으로, 위의 예에서, 우리는 HTML이 더 이상 탈출하지 않고 템플릿에 직접 삽입되도록 결과를 안전한 것으로 표시하는 것을 기억한다.
pt_br: Finalmente, no exemplo acima, relembramos de marcar resultados como seguros assim que o HTML é inserido diretamente no template sem outras substituições.
zh_hans: 最后，在上述例子中，我们牢记将结果标为安全的，所以 HMTL 未经转义就直接插入模板中。

source: There's no need to worry about the ``is_safe`` flag in this case (although including it wouldn't hurt anything). Whenever you manually handle the auto-escaping issues and return a safe string, the ``is_safe`` flag won't change anything either way.
it: Non c'è bisogno di preoccuparsi del flag ``is_safe`` in questo caso (anche se includerlo non farebbe male). Ogni volta che gestisci manualmente i problemi di auto-escape e restituisci una stringa safe, il flag ``is_safe`` non cambierebbe comunque niente.
ja: この場合、 ``is_safe`` フラグを気にする必要はありません (フラグを指定しても何も問題はありませんが)。自動エスケープの問題を手動で処理して安全な文字列を返す場合、 ``is_safe`` フラグを指定しても何も変わりません。
ko: (이를 포함하더라도) 이 경우 "안전하다"는 깃발에 대해선 걱정할 필요가 없다. 당신이 수동으로 자동 탈출 문제를 처리하고 안전한 줄을 돌려줄 때마다 "is_safe" 깃발은 어느 쪽도 변하지 않을 것이다.
pt_br: Não precisa se preocupar com a flag ``is_safe`` neste caso (embora inclui-la não faria nenhum mal). Mesmo que trate manualmente a auto-substituição e retorne uma string segura, a flag ``is_safe`` não alterará nada de nenhum modo.
zh_hans: 这种场景下无需担心 ``is_safe`` 标志（虽然包含它不会有什么问题）。无论你何时决定手动处理自动转义，并返回安全字符串， ``is_safe`` 标志不会有任何影响。

source: Avoiding XSS vulnerabilities when reusing built-in filters
it: Evitare le vulnerabilità XSS quando si riutilizzano i filtri built-in
ja: 組み込みのフィルタを再利用するときに XSS 脆弱性を回避する
ko: 내장된 필터를 재사용할 때 XSS 취약성 방지
pt_br: Evitando vulnerabilidade XSS quando reusar filtros embutidos.
zh_hans: 在重用内置过滤器时避免 XSS 漏洞
