Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: For example, you can use this technique to add a custom logo to the ``admin/base_site.html`` template:
it: Per esempio, puoi utilizzare questa tecnica per aggiungere un logo personalizzato al template ``admin/base_site.html``:
ja: 例えば、このテクニックを使って ``admin/base_site.html`` テンプレートにカスタムロゴを追加できます:
ko: 예를 들어 이 기술을 사용하여 ''admin/base_site.html' 템플릿에 사용자 정의 로고를 추가할 수 있습니다.

source: Key points to note:
it: Punti chiave da notare:
ja: 備考:
ko: 주요 내용은 다음과 같습니다.

source: The example creates a file at ``templates/admin/base_site.html`` that uses the configured project-level ``templates`` directory to override ``admin/base_site.html``.
it: Questo esempio crea un file in ``templates/admin/base_site.html`` che usa la directory configurata a livello di template ``templates`` per fare override di ``admin/base_site.html``.
ja: この例では、 ``templates/admin/base_site.html`` にファイルを作成し、 ``admin/base_site.html`` を上書きするために、設定されたプロジェクトレベルの ``templates`` ディレクトリを使用します。
ko: 이 예에서는 구성된 프로젝트 수준의 ``템플릿" 디렉토리를 사용하여 ``admin/base_site.html"을 재정의하는 "templates/admin/base_site.html"에 파일을 생성합니다.

source: The new template extends ``admin/base_site.html``, which is the same template as is being overridden.
it: Il nuovo template estende ``admin/base_site.html``, che è lo stesso template che è stato sovrascritto.
ja: 新しいテンプレートは ``admin/base_site.html`` を継承しており、これはオーバーライドされるテンプレートと同じです。
ko: 새 템플릿은 "admin/base_site.html"을 확장하며, 이는 재정의되는 템플릿과 동일합니다.

source: The template replaces just the ``branding`` block, adding a custom logo, and using ``block.super`` to retain the prior content.
it: Il template sostituisce solo il blocco ``branding``, aggiungendo un logo personalizzato e utilizzando ``block.super`` per mantenere il contenuto precedente.
ja: このテンプレートは ``branding`` ブロックだけを置き換え、カスタムロゴを追加し、 ``block.super`` を使って以前のコンテンツを保持します。
ko: 템플릿은 단지 "브랜드" 블록을 대체하고 맞춤형 로고를 추가하고 "블록"을 사용합니다.이전 내용을 보존할 수 있습니다.

source: The rest of the template is inherited unchanged from ``admin/base_site.html``.
it: Il resto del template è ereditato invariato da ``admin/base_site.html``.
ja: 残りのテンプレートは ``admin/base_site.html`` からそのまま継承されます。
ko: 템플릿의 나머지 부분은``admin/base_site.html``.에서 변경되지 않은 상태로 상속됩니다.

source: This technique works because the template loader does not consider the already loaded override template (at ``templates/admin/base_site.html``) when resolving the ``extends`` tag. Combined with ``block.super`` it is a powerful technique to make small customizations.
it: Questa tecnica funziona perchè il template loader non considera il template in override già caricato (in ``templates/admin/base_site.html``) quando risolve il tag ``extends``. In combinazione con ``block.super`` è una potente tecnica per fare piccole personalizzazioni.
ja: このテクニックは、テンプレートローダーが ``extends`` タグを解決するときに、すでにロードされているオーバーライドテンプレート (``templates/admin/base_site.html``) を考慮しないので動作します。 ``block.super`` と組み合わせることで、小さなカスタマイズを行うための強力なテクニックとなります。
ko: 이 기술은 템플릿 로더가 ``확장" 태그를 결정할 때 이미 로드된 오버라이드 템플릿("templates/admin/base_site.html")을 고려하지 않기 때문에 작동합니다. "블록"과 결합합니다.Superdown은 작은 커스터마이징을 만드는 강력한 기술입니다.

source: How to deploy static files
it: Come distribuire file statici
ja: 静的ファイルをデプロイする

source: For an introduction to the use of :mod:`django.contrib.staticfiles`, see :doc:`/howto/static-files/index`.
it: Per una introduzione all'uso di :mod:`django.contrib.staticfiles`, vedi :doc:`/howto/static-files/index`.
ja: :mod:`django.contrib.staticfiles` の使い方の基本に関しては、:doc:`/howto/static-files/index` を読んでください。
ko: :mod:'django.contrib.static files'의 사용에 대한 자세한 내용은 :doc:'/how to/static files/index'를 참조하십시오.
pt_br: Para uma introdução ao uso de :mod:`django.contrib.staticfiles`, veja :doc:`/howto/static-files/index`.
zh_hans: 想要 :mod:`django.contrib.staticfiles` 的使用指南，请参考 :doc:`/howto/static-files/index`。

source: Serving static files in production
it: Distribuire file statici in produzione
ja: 本番環境における静的ファイルの配信
ko: 프로덕션에서 정적파일 제공하기
pt_br: Servindo arquivos estáticos em produção
zh_hans: 在生产环境提供静态文件服务

source: The basic outline of putting static files into production consists of two steps: run the :djadmin:`collectstatic` command when static files change, then arrange for the collected static files directory (:setting:`STATIC_ROOT`) to be moved to the static file server and served. Depending the ``staticfiles`` :setting:`STORAGES` alias, files may need to be moved to a new location manually or the :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` method of the ``Storage`` class might take care of that.
ja: 静的ファイルを本番環境に配置する基本的な手順は、2つのステップから成り立っています: 静的ファイルが変更されたときに :djadmin:`collectstatic` コマンドを実行し、次に収集された静的ファイルディレクトリ（:setting:`STATIC_ROOT`）を静的ファイルサーバーに移動させ、配信できるようにします。``staticfiles`` の :setting:`STORAGES` エイリアスによっては、ファイルを手動で新しい場所に移動する必要があるかもしれませんし、 ``Storage`` クラスの :func:`post_process <django.contrib.staticfiles.storage.StaticFilesStorage.post_process>` メソッドがその処理を行うこともあります。

source: As with all deployment tasks, the devil's in the details. Every production setup will be a bit different, so you'll need to adapt the basic outline to fit your needs. Below are a few common patterns that might help.
it: Così come tutti i task di deploy, il diavolo è nei dettagli. Ogni setup di produzione sarà differente, quindi dovrai adattare il piano di base per soddisfare le tue necessità. Ecco alcuni pattern che potrebbero essere di aiuto.
ja: すべてのデプロイメントタスクと同様に、悪魔は細部に宿ります。プロダクションのセットアップはそれぞれ少しずつ異なるので、基本的なアウトラインをニーズに合わせて変更する必要があります。以下に、役立つかもしれないいくつかの一般的なパターンを示します。
ko: 모든 배포 작업과 마찬가지로 세부 사항도 중요합니다. 모든 프로덕션 설정은 약간 다르므로 필요에 맞게 기본 개요를 조정해야 합니다. 다음은 도움이 될 수 있는 몇 가지 일반적인 패턴입니다.

source: Serving the site and your static files from the same server
it: Distribuire il sito ed i file statici dallo stesso server
ja: サイトと静的ファイルを同じサーバから配信する
ko: 같은 서버에서 정적파일과 사이트를 제공하기
pt_br: Servindo o site e os arquivos estáticos de um mesmo servidor.
zh_hans: 在同一服务器提供站点和静态文件服务

source: If you want to serve your static files from the same server that's already serving your site, the process may look something like:
it: Se vuoi distribuire i tuoi file statici dallo stesso server che sta attualmente distribuendo il tuo sito, puoi procedere in questo modo:
ja: 静的ファイルをすでにサイトを配信しているのと同じサーバから配信したい場合、配信の手順は次のようになります。
ko: 사이트에 이미 서비스를 제공하고 있는 서버와 동일한 서버에서 정적 파일을 제공하려는 경우 프로세스는 다음과 같을 수 있습니다.
pt_br: Se você quer servir arquivos estáticos do mesmo servidor que já está servindo seu site , o processo talvez se parece com algo como:
zh_hans: 如果你想在早已提供站点服务器服务器上同时提供静态文件服务，操作步骤类似这样：

source: Push your code up to the deployment server.
it: Invia il codice al server di distribuzione.
ja: デプロイするサーバにコードを push する。
ko: 개발서버로 코드 올리기
pt_br: Suba seu código para o servidor de deploy.
zh_hans: 将代码推送至部署服务器。

source: On the server, run :djadmin:`collectstatic` to copy all the static files into :setting:`STATIC_ROOT`.
it: Nel server, esegui :djadmin:`collectstatic` per copiare tutti i file statici in :setting:`STATIC_ROOT`.
ja: サーバ側で、 :djadmin:`collectstatic` を実行することで、すべての静的ファイルを :setting:`STATIC_ROOT` で設定したディレクトリに集める。
ko: 서버에서 :djadmin:'collectstatic'을 실행하여 모든 정적 파일을 :seting:'에 복사합니다.STATIC_ROOT'입니다.
pt_br: No servidor, execute: :djadmin:`collectstatic` para que copie todos os arquivos estáticos para dentro de :setting:`STATIC_ROOT`.
zh_hans: 在服务器上运行 :djadmin:`collectstatic`，将所有的静态文件拷贝至 :setting:`STATIC_ROOT`。

source: Configure your web server to serve the files in :setting:`STATIC_ROOT` under the URL :setting:`STATIC_URL`. For example, here's :ref:`how to do this with Apache and mod_wsgi <serving-files>`.
it: Configura il tuo webserver per servire i file in :setting:`STATIC_ROOT` sotto la URL :setting:`STATIC_URL`. Per esempio, ecco :ref:`come farlo con Apache e mod_wsgi <serving-files>`.
ja: :setting:`STATIC_ROOT` に置かれたファイルを :setting:`STATIC_URL` から配信するように、Web サーバの設定を行う。たとえば、Apache と mod_wsgi を使用している場合、:ref:`Apache と mod_wsgi を使用したファイルの配信 <serving-files>` が参考になると思います。
ko: :seting:'에서 파일을 서비스하도록 웹 서버를 구성합니다.URL의 STATIC_ROOT' 아래에 있습니다. 설정:':'STATIC_URL'입니다. 예를 들어 다음과 같습니다.Apache 및 mod_wsgi로 이 작업을 수행하는 방법입니다.
pt_br: Configure seu servidor Web para servir seus arquivos em :setting:`STATIC_ROOT` sob a URL :setting:`STATIC_URL`. Por exemplo, aqui :ref:`como fazer isso com Apache e mod_wsgi <serving-files>`.
zh_hans: 配置 Web 服务器，使其在 :setting:`STATIC_URL` 下为 :setting:`STATIC_ROOT` 目录下的文件提供静态文件服务。例如， :ref:`这里是如何以 Apache 配合 mod_wsgi 开始 <serving-files>`。

source: You'll probably want to automate this process, especially if you've got multiple web servers.
it: Probabilmente vorrai automatizzare questo processo, in special modo se ha diversi web servers.
ja: 複数の Web サーバーがある場合は、おそらくこのプロセスを自動化したいと思うでしょう。
ko: 특히 웹 서버가 여러 개인 경우 이 프로세스를 자동화할 수 있습니다.
zh_hans: 你可能期望将该流程自动化，特别是在你有好几个 web 服务器的时候。

source: Serving static files from a dedicated server
it: Distribuire file statici da un server dedicato
ja: 専用のサーバから静的ファイルを配信する
ko: 특정 서버에서 정적파일 제공하기
pt_br: Servindo arquivos estáticos atráves de um servidor dedicado
zh_hans: 专用服务器提供静态文件服务

source: Most larger Django sites use a separate web server -- i.e., one that's not also running Django -- for serving static files. This server often runs a different type of web server -- faster but less full-featured. Some common choices are:
it: Siti Django più grandi usano un web server separato -- uno che non sta facendo girare Django -- per servire file statici. Questo server spesso fa girare un tipo diverso di web server -- più veloce ma meno completo. Alcune scelte comuni sono:
ja: ほとんどの大規模な Django サイトでは、静的ファイルの配信に別の Web サーバ（つまり Django を動かしていないサーバ）を使っています。このサーバは、多くの場合、別のタイプの Web サーバを実行しています。高速で、機能が限定的なものです。よくある選択肢は下記です:

source: Configuring these servers is out of scope of this document; check each server's respective documentation for instructions.
it: La configurazione di questi servers è al di là dello scopo di questo documento, consulta la documentazione dei rispettivi server per istruzioni.
ja: これらのサーバの設定方法は、このドキュメントの範囲外です。それぞれのサーバのドキュメントを参考に設定してください。
ko: 이 서버 구성은 이 문서의 범위를 벗어납니다. 각 서버의 해당 문서에서 지침을 확인하십시오.
pt_br: A configuração destes servidores estão fora do escopo deste documento; verifique a respectiva documentação de cada um para instruções.
zh_hans: 如何配置这些服务器超出了本文范围；查阅这些服务器各自的文档获取介绍。

source: Since your static file server won't be running Django, you'll need to modify the deployment strategy to look something like:
it: Dal momento che il tuo file server statico non eseguirà Django, dovrai modificare la strategia di distribuzione affinché sia qualcosa di simile:
ja: 静的ファイルサーバでは Django が実行されていないので、次のようにデプロイの戦略を変更する必要があります。
ko: 정적 파일 서버가 Django를 실행하지 않으므로 다음과 같이 배포 전략을 수정해야 합니다.
pt_br: Já que seu servidor de arquivos estáticos não irão rodar um Django, você irá precisar modificar a estratégia para algo como:
zh_hans: 由于静态文件服务器并不运行 Django，你需要将部署策略改成这样：

source: When your static files change, run :djadmin:`collectstatic` locally.
it: Quando i tuoi file statici vengono modificati, lancia :djadmin:`collectstatic` localmente.
ja: 静的ファイルが変更されたら、ローカル側で :djadmin:`collectstatic` を実行する。
ko: 정적 파일이 수정되었다면, 로컬에서 :djadmin:`collectstatic` 를 실행하세요.
pt_br: Quando seus arquivos estáticos mudarem, execute :djadmin:`collectstatic` localmente.
zh_hans: 当静态文件改变时，本地运行 :djadmin:`collectstatic`。

source: Push your local :setting:`STATIC_ROOT` up to the static file server into the directory that's being served. `rsync <https://rsync.samba.org/>`_ is a common choice for this step since it only needs to transfer the bits of static files that have changed.
it: Spingere :setting:`STATIC_ROOT` fino al file server statico nella directory che viene servita.`rsync <https://rsync.samba.org/>`_ è una scelta comune per questo step perchè ha bisogno di trasferire solo i pezzi di file statici che non sono cambiati.
ja: ローカルの :setting:`STATIC_ROOT` を静的ファイルサーバのファイル配信ディレクトリに push します。これには通常、`rsync <https://rsync.samba.org/>`_ を使います。変更された静的ファイルだけを転送できるからです。
ko: 로컬:설정:'를 누릅니다.STATIC_ROOT'을(를) 정적 파일 서버에 올려서 서비스 중인 디렉토리에 넣습니다. 'rsync https://rsync.samba.org/'_은(는) 변경된 정적 파일의 비트만 전송하면 되기 때문에 이 단계에서 흔히 선택할 수 있습니다.
pt_br: Coloque seu :setting:`STATIC_ROOT` local no servidor de arquivo estático dentro do diretório que esta sendo servido. O `rsync <https://rsync.samba.org/>`_ é uma opção comum para este passo já que ele precisa transferir somente as partes dos arquivos estáticos quesofreram mudanças.
zh_hans: 将本地 :setting:`STATIC_ROOT` 推送到静态文件服务器提供服务的目录。 `rsync <https://rsync.samba.org/>`_ 是一个常见选项，因为这种配置只会传输文件修改部分的数据流。

source: Serving static files from a cloud service or CDN
it: Distribuire file statici da un servizio cloud o da una CDN
ja: クラウドサービスや CDN から静的ファイルを配信する
ko: 클라우드 서비스나 CDN으로 정적 파일 제공하기
pt_br: Servindo arquivos estáticos de um servidor "cloud" ou CDN
zh_hans: 从云服务或 CDN 提供静态文件服务

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading web pages (especially when using a CDN).
it: Un'altra tattica comune è servire i file statici da un provider cloud storage come Amazon S3 e/o CDN (content delivery network). Questo ti permette di ignorare il problema di servire i file statici e va spesso bene per pagine che devono caricarsi più velocemente (specialmente usando una CDN).
ja: もう1つの一般的な方法は、AmazonのS3やCDN（コンテンツ・デリバリー・ネットワーク）のようなクラウドストレージから静的ファイルを配信することです。これにより、静的ファイルを配信する際の問題を無視することができ、多くの場合、Webページの読み込みが速くなります（特にCDNを使用する場合）。

source: When using these services, the basic workflow would look a bit like the above, except that instead of using ``rsync`` to transfer your static files to the server you'd need to transfer the static files to the storage provider or CDN.
it: Quando utilizzi questi servizi, il flusso di lavoro assomiglierà a quello visto in precedenza, ad eccezione dell'utilizzo di ``rsync`` per trasferire i tuoi file statici al server, dovrai invece trasferire i tuoi file verso lo storage provider o verso la CDN.
ja: これらのサービスを使う場合でも、基本的なワークフローは上で説明した通りです。ただし、``rsync`` を使って静的ファイルをサーバに転送する代わりに、ストレージプロバイダや CDN に転送する必要があります。
ko: 이러한 서비스를 사용할 때 기본 워크플로우는 위와 약간 비슷하지만 서버에 정적 파일을 전송하기 위해 "rsync"를 사용하는 대신 정적 파일을 스토리지 공급자 또는 CDN으로 전송해야 한다는 점을 제외하면 그렇습니다.
pt_br: Quando usar estes serviços, o processo básico será parecido como o acima, exceto que no lugar de usar o ``rsync`` para transferir seus arquivos estáticos para o servidor, você irá precisa transferir os arquivos estáticos para fornecedor do armazenamento ou CDN.
zh_hans: 使用这些服务时，基本的工作流程与上面类似，除了要将静态文件传输给存储服务商或 CDN，而不是用 ``rsync`` 将静态文件传输给服务器。

source: There's any number of ways you might do this, but if the provider has an API, you can use a :doc:`custom file storage backend </howto/custom-file-storage>` to integrate the CDN with your Django project. If you've written or are using a 3rd party custom storage backend, you can tell :djadmin:`collectstatic` to use it by setting ``staticfiles`` in :setting:`STORAGES`.
ja: そのための方法はいろいろありますが、プロバイダが API を提供している場合、:doc:`カスタムのファイルストレージバックエンド</howto/custom-file-storage>` を使って Django プロジェクトと CDN を統合できます。独自に作成したカスタムストレージバックエンドを使用している場合や、サードパーティのカスタムストレージバックエンドを使用している場合は、:setting:`STORAGES` に ``staticfiles`` を設定することで :djadmin:`collectstatic` にそれを使うよう指示できます。

source: For example, if you've written an S3 storage backend in ``myproject.storage.S3Storage`` you could use it with::
it: Per esempio, e tu hai definito uno storage S3 come backend in ``myproject.storage.S3Storage``, puoi utilizzarlo con::
ja: たとえば、S3 storage backend を ``myproject.storage.S3Storage`` としてすでに書いていれば、次のように書くだけでこのストレージを利用できます。
ko: 예를 들어 "myproject.storage"에 S3 스토리지 백엔드를 작성한 경우입니다.S3Storage는 다음과 같은 용도로 사용할 수 있습니다.
pt_br: Por exemplo, se você escreveu um backend de armazenamento para o S3 em ``myproject.storage.S3Storage`` você poderia usar isso com:
zh_hans: 例如，若你已在 ``myproject.storage.S3Storage`` 中写了一个 S3 存储后端，可以这么用::

source: Once that's done, all you have to do is run :djadmin:`collectstatic` and your static files would be pushed through your storage package up to S3. If you later needed to switch to a different storage provider, you may only have to change ``staticfiles`` in the :setting:`STORAGES` setting.
ja: これが完了したら、 :djadmin:`collectstatic` を実行するだけで、静的ファイルがストレージパッケージを通して S3 にプッシュされます。後で別のストレージプロバイダに切り替える必要がある場合は、 :setting:`STORAGES` 設定の ``staticfiles`` を変更するだけです。

source: For details on how you'd write one of these backends, see :doc:`/howto/custom-file-storage`. There are 3rd party apps available that provide storage backends for many common file storage APIs. A good starting point is the `overview at djangopackages.org <https://djangopackages.org/grids/g/storage-backends/>`_.
it: Per i dettagli su come potresti scrivere uno di questi backend, vedi :doc:`/howto/custom-file-storage`. Sono disponibili app di terze parti che forniscono backend di archiviazione per molte API di storage file comuni. Un buon punto di partenza è la `panoramica su djangopackages.org <https://djangopackages.org/grids/g/storage-backends/>`_.
ja: これらのバックエンドの書き方の詳細については :doc:`/howto/custom-file-storage` を参照してください。多くの一般的なファイルストレージ API 用のストレージバックエンドを提供するサードパーティアプリがあります。良い出発点は `djangopackages.org の overview <https://djangopackages.org/grids/g/storage-backends/>`_ です。
ko: 백엔드를 작성하는 방법에 대한 자세한 내용은:doc:'/how to/custom-file-storage'를 참조하십시오. 많은 공통 파일 스토리지 API에 대한 스토리지 백엔드를 제공하는 타사 앱이 있습니다. 좋은 출발점이 바로 djangopackages.org입니다.
zh_hans: 关于如何编写这些后端的细节，参考 :doc:`/howto/custom-file-storage`。有很多可用的第三方应用提供了针对常见文件存储 API 的存储后端。 `djangopackages.org 入门 <https://djangopackages.org/grids/g/storage-backends/>`_ 是个不错的起点。

source: The :setting:`STORAGES` setting was added.
ja: :setting:`STORAGES` 設定が追加されました。

source: Learn more
it: Per saperne di più
ja: さらに学ぶ
ko: 추가사항
pt_br: Aprenda mais
zh_hans: 了解更多

source: For complete details on all the settings, commands, template tags, and other pieces included in :mod:`django.contrib.staticfiles`, see :doc:`the staticfiles reference </ref/contrib/staticfiles>`.
it: Per avere dettagli completi su tutte le impostazioni, i comandi, i tag di template ed altri pezzi inclusi in :mod:`django.contrib.staticfiles`, visita :doc:`la guida di riferimento di staticfiles </ref/contrib/staticfiles>`.
ja: すべての設定、コマンド、テンプレートタグなどの詳細と、:mod:`django.contrib.staticfiles` に含まれているその他の機能については、:doc:`staticfiles リファレンス </ref/contrib/staticfiles>` を読んでください。
ko: :mod:'django.contrib.static files'에 포함된 모든 설정, 명령, 템플릿 태그 및 기타 항목에 대한 자세한 내용은 :doc:'static files reference'를 참조하십시오.
pt_br: Para detalhes completos sobre todas as configurações, comandos, tags de templates, e outras partes incluídas em :mod:`django.contrib.staticfiles`, veja :doc:`a referencia de arquivos estáticos </ref/contrib/staticfiles>`.
zh_hans: 想要了解所有配置项，命令，模板标签和 :mod:`django.contrib.staticfiles` 包含的其它零碎的完整细节，参考 :doc:`staticfiles 参考 </ref/contrib/staticfiles>`。

source: How to manage static files (e.g. images, JavaScript, CSS)
it: Come gestire file statici (Es. immagini, JavaScript, CSS)
ja: 静的ファイル (画像、JavaScript、CSS など) を管理する

source: Websites generally need to serve additional files such as images, JavaScript, or CSS. In Django, we refer to these files as "static files". Django provides :mod:`django.contrib.staticfiles` to help you manage them.
it: I siti web generalmente necessitano di servire file aggiuntivi come immagini, JavaScript o CSS. In Django, vi facciamo riferimento come "file statici". Django offre :mod:`django.contrib.staticfiles` per aiutarti a gestirli.
ja: ウェブサイトではふつう、画像や JavaScript、CSS などの追加のファイルを配信する必要があります。Django では、こうしたファイルのことを「静的ファイル (static files)」と呼んでいます。静的ファイルの管理を簡単にするために、Django は :mod:`django.contrib.staticfiles` を提供しています。
ko: 웹 사이트는 일반적으로 이미지, JavaScript 또는 CSS와 같은 추가 파일을 제공해야 합니다. Django에서는 이러한 파일을 "static files"라고 합니다. Django는 :mod:'django.contrib.static files'를 제공하여 파일 관리를 도와줍니다.
pt_br: Os sites web geralmente precisam servir arquivos adicionais como imagens, JavaScript, ou CSS. No Django, nós nos referímos a estes arquivos como "arquivos estáticos". O Django fornece :mod:`django.contrib.staticfiles` para ajudar você a lidar com eles.
zh_hans: 网站通常需要提供类似图片，JavaScript 或 CSS 的额外文件服务。在 Django 中，我们将这些文件称为“静态文件”。Django 提供了 :mod:`django.contrib.staticfiles` 帮你管理它们。

source: This page describes how you can serve these static files.
it: Questa pagina descrive come puoi distribuire questi file statici.
ja: このページでは、こうした静的ファイルの配信の仕方について説明します。
ko: 이 페이지에서는 이러한 정적 파일을 서비스하는 방법에 대해 설명합니다.
pt_br: Está página descreve como você pode servir estes arquivos estáticos.
zh_hans: 本页介绍如何为这些静态文件提供服务。

source: Configuring static files
it: Configurazione file statici
ja: 静的ファイルの設定
ko: 정적 파일을 구성하는 중입니다.
pt_br: Configurando arquivos estáticos
zh_hans: 配置静态文件

source: Make sure that ``django.contrib.staticfiles`` is included in your :setting:`INSTALLED_APPS`.
it: Assicurati che ``django.contrib.staticfiles`` sia inserito in :setting:`INSTALLED_APPS`.
ja: ``django.contrib.staticfiles`` が設定ファイルの :setting:`INSTALLED_APPS` に含まれていることを確認してください。
ko: "django.contrib.static files"가 다음 설정에 포함되도록 하십시오. :setting:`INSTALLED_APPS`.
pt_br: Certifique-se de que ``django.contrib.staticfiles`` está incluído no seu ::setting::`INSTALLED_APPS`.
zh_hans: 确保 :setting:`INSTALLED_APPS` 包含了 ``django.contrib.staticfiles``。

source: In your settings file, define :setting:`STATIC_URL`, for example::
it: Nel tuo file dei settings, definisci :setting:`STATIC_URL`, per esempio::
ja: 設定ファイルの中で、:setting:`STATIC_URL` を設定します。たとえば、次のようにします:
ko: 설정 파일에서 다음을 정의합니다.:setting:`STATIC_URL`, 예를 들어::
pt_br: Em seu arquivo de configurações, defina :setting:`STATIC_URL`, por exemplo::
zh_hans: 在配置文件中，定义 :setting:`STATIC_URL`，例子::

source: In your templates, use the :ttag:`static` template tag to build the URL for the given relative path using the configured ``staticfiles`` :setting:`STORAGES` alias.
ja: テンプレート内では、 :ttag:`static` テンプレートタグを使用して、``staticfiles`` :setting:`STORAGES` で設定したエイリアスで相対パスの URL を生成できます。

source: Store your static files in a folder called ``static`` in your app. For example ``my_app/static/my_app/example.jpg``.
it: Archivia i tuoi file statici in una cartella chiamata ``static`` nella tua app. Per esempio ``my_app/static/my_app/example.jpg``.
ja: アプリ内に ``static`` というフォルダを作成って静的ファイルを保存してください。例: ``my_app/static/my_app/example.jpg``。
ko: 정적 파일을 앱의 "static" 폴더에 저장합니다. 예를 들어 다음과 같습니다.``my_app/static/my_app/example.jpg``.
zh_hans: 将你的静态文件保存至程序中名为 ``static`` 的目录中。例如 ``my_app/static/my_app/example.jpg``。

source: Serving the files
it: Servire i file
ja: ファイルを配信する
ko: 파일을 제공합니다.
pt_br: Servindo os arquivos
zh_hans: 为这些文件提供服务

source: In addition to these configuration steps, you'll also need to actually serve the static files.
it: In aggiunta a questi passaggi di configurazione, hai anche bisogno effettivamente di distribuire file statici.
ja: これらの設定の手順に加えて、実際に静的ファイルを配信する必要があります。
ko: 이러한 구성 단계 외에도 정적 파일도 실제로 서비스해야 합니다.
pt_br: Além desses passos de configurações, você também vai precisar servir os arquivos estáticos.
zh_hans: 除了这些配置步骤外，你还需要实际地为这些文件提供服务。
