Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: All :func:`sensitive_variables` and :func:`sensitive_post_parameters` do is, respectively, annotate the decorated function with the names of sensitive variables and annotate the ``HttpRequest`` object with the names of sensitive POST parameters, so that this sensitive information can later be filtered out of reports when an error occurs. The actual filtering is done by Django's default error reporter filter: :class:`django.views.debug.SafeExceptionReporterFilter`. This filter uses the decorators' annotations to replace the corresponding values with stars (``**********``) when the error reports are produced. If you wish to override or customize this default behavior for your entire site, you need to define your own filter class and tell Django to use it via the :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` setting::
it: Tutto ciò che fanno :func:`sensitive_variables` e :func:`sensitive_post_parameters` è, rispettivamente, annotare la funzione decorata con i nomi delle variabili sensibili e annotare l'oggetto ``HttpRequest`` con i nomi dei parametri POST sensibili, in modo che le informazioni possona essere successivamente filtrate dai report quando si verifica un errore. Il vero filtro viene eseguito dal filtro di report degli errori predefinito di Django: :class:`django.views.debug.SafeExceptionReporterFilter`. Questo filtro utilizza le annotazioni dei decoratori per sostituire i valori corrispondenti con gli sterischi (``**********``) quando vengono prodotti i report di errore. Se desideri sovrascrivere o personalizzare questo comportamento predefinito per l'intero sito, devi definire la tua classe di filtro e dire a Django di usarla tramite l'impostazione :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER`::
ja: :func:`sensitive_variables` と :func:`sensitive_post_parameters` がすることは、それぞれ、装飾された関数にセンシティブな変数名をアノテートし、``HttpRequest`` オブジェクトにセンシティブな POST パラメータ名をアノテートするだけです。実際のフィルタリングは Django のデフォルトのエラーレポートフィルタ ( :class:`django.views.debug.SafeExceptionReporterFilter` ) で行われます。このフィルタはデコレータのアノテーションを使い、エラーレポートが生成される際に、対応する値をアスタリスク (``*******``) に置き換えます。このデフォルトの動作を上書きしたり、サイト全体でカスタマイズしたい場合は、独自のフィルタクラスを定義し、 :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` 設定でそれを使うように Django に指示する必要があります:
ko: func:'sensitive_variables'와 :func:'sensitive_post_parameters' do는 각각 민감한 변수의 이름으로 장식된 함수에 주석을 달고 "HttpRequest" 객체에 민감한 POST 매개 변수의 이름으로 주석을 달기 때문에 오류가 발생할 때 이러한 민감한 정보가 보고서에서 필터링될 수 있다. 실제 필터링은 Django의 기본 오류 리포터 필터 :class:'django에 의해 수행됩니다.경치, 경치,경치SafeExceptionReporterFilter'. 이 필터는 오류 보고가 생성될 때 장식자의 주석을 사용하여 해당 값을 별('********')로 바꿉니다. 전체 사이트에 대해 이 기본 동작을 재정의하거나 사용자 지정하려면 사용자 고유의 필터 클래스를 정의하고 Django에게 :seting:을 통해 사용하도록 지시해야 합니다.'DEFAULT_EXTECTION_REPORTER_FILTER' 설정:

source: You may also control in a more granular way which filter to use within any given view by setting the ``HttpRequest``’s ``exception_reporter_filter`` attribute::
it: Puoi controllare in modo più granulare quale filtro utilizzare all'interno di una vista configurando il parametro ``exception_reporter_filter`` della ``HttpRequest``::
ja: また、 ``HttpRequest`` の ``exception_reporter_filter`` 属性を指定することで、任意のビューで使用するフィルタをより細かく制御できます:
ko: 또한 ``HttpRequest"의 ``exception_reporter_filter" 속성을 설정하여 어떤 필터를 어떤 뷰에서 사용할지 보다 세밀하게 제어할 수도 있다.
pt_br: Você pode controlar de uma maneira mais granular qual filtro usar dentro de qualquer "view" configurando o atributo ``exception_reporter_filter`` do ``HttpRequest``::
zh_hans: 你也能在任意视图内以一种更细碎的方式控制过滤器，通过设置 ``HttpRequest`` 的 ``exception_reporter_filter`` 属性::

source: Your custom filter class needs to inherit from :class:`django.views.debug.SafeExceptionReporterFilter` and may override the following attributes and methods:
it: La tua classe del filtro personalizzato ha bisogno di ereditare da :class:`django.views.debug.SafeExceptionReporterFilter` e può sovrascrivere i seguenti attributi e metodi:
ja: カスタムフィルタクラスは :class:`django.views.debug.SafeExceptionReporterFilter` を継承し、以下の属性とメソッドをオーバーライドする必要があります:
ko: 사용자 지정 필터 클래스는 :class:'django'에서 상속해야 합니다.경치, 경치,경치SafeExceptionReporterFilter'는 다음과 같은 특성 및 방법을 재정의할 수 있습니다.

source: The string value to replace sensitive value with. By default it replaces the values of sensitive variables with stars (``**********``).
it: Il carattere da utilizzare per rimpiazzare valori sensibili. Di default viene rimpiazzato il valore di stringhe sensibili con l'asterisco (``**********``).
ja: センシティブな値を置換する文字列値。デフォルトでは、センシティブな変数の値をアスタリスク (``*******``) で置き換えます。
ko: 중요한 값을 대체할 문자열 값입니다. 기본적으로 이것은 민감한 변수의 값을 별('**********')로 바꿉니다.

source: A compiled regular expression object used to match settings and ``request.META`` values considered as sensitive. By default equivalent to::
it: Un oggetto di espressione regolare compilato per trovare le impostazioni ed i valori ``request.META`` considerati sensibili. In modo predefinito è equivalente a::
ja: センシティブな設定や ``request.META`` にマッチする正規表現オブジェクト。デフォルトでは下記です:
ko: 설정 및 ``요청"을 일치시키는 데 사용되는 컴파일된 정규식 개체입니다.META의 가치는 민감한 것으로 간주되고 있습니다. 기본적으로 다음과 같습니다.

source: ``HTTP_COOKIE`` was added.
ja: ``HTTP_COOKIE`` が追加されました。

source: Returns ``True`` to activate the filtering in :meth:`get_post_parameters` and :meth:`get_traceback_frame_variables`. By default the filter is active if :setting:`DEBUG` is ``False``. Note that sensitive ``request.META`` values are always filtered along with sensitive setting values, as described in the :setting:`DEBUG` documentation.
it: Restituisce ``True`` per attivare il filtro in :meth:`get_post_parameters` e :meth:`get_traceback_frame_variables`. Di default, il filtro è attivo se :setting:`DEBUG` is ``False``. Nota che i valori sensibili ``request.META`` sono sempre filtrati così come i valori di impostazioni sensibili, come descritto nella documentazione di :setting:`DEBUG`.
ja: :meth:`get_post_parameters` と :meth:`get_traceback_frame_variables` のフィルタリングを有効にする場合は ``True`` を返します。デフォルトでは :setting:`DEBUG` が ``False`` の場合に有効になります。 :setting:`DEBUG` のドキュメントにあるように、センシティブな ``request.META`` の値は常に、センシティブな設定値とともにフィルタリングされることに注意してください。
ko: :meth:'get_post_parameters' 및 :meth:'get_traceback_frame_variables'에서 필터링을 활성화하기 위해 "True"를 반환합니다. 다음과 같은 경우 필터는 기본적으로 활성화됩니다.디버그는 거짓입니다. 민감한 ``요청"에 주목하십시오.META의 값은 :설정에서 설명한 대로 항상 민감한 설정값과 함께 필터링됩니다.'DEBUG' 설명서입니다.

source: Returns the filtered dictionary of POST parameters. Sensitive values are replaced with :attr:`cleansed_substitute`.
it: Restituisce un dizionario filtrato di parametri POST. I valori sensibili sono rimpiazzati con :attr:`cleansed_substitute`.
ja: フィルタリングされた POST パラメータの辞書を返します。センシティブな値は :attr:`cleansed_substitute` で置換されます。
ko: POST 매개 변수의 필터링된 사전을 반환합니다. 중요한 값은 다음과 같이 대체됩니다. attr:'cleaned_substitute'.

source: Returns the filtered dictionary of local variables for the given traceback frame. Sensitive values are replaced with :attr:`cleansed_substitute`.
it: Restituisce un dizionario filtrato di variabili locali per una data finestra di traceback. I valori sensibili sono rimpiazzati con :attr:`cleansed_substitute`.
ja: 与えられたトレースバックフレームのローカル変数のフィルタリングされた辞書を返します。センシティブな値は :attr:`cleansed_substitute` で置き換えられます。
ko: 지정된 추적 프레임에 대해 필터링된 로컬 변수 사전을 반환합니다. 중요한 값은 다음과 같이 대체됩니다. attr:'cleaned_substitute'.

source: If you need to customize error reports beyond filtering you may specify a custom error reporter class by defining the :setting:`DEFAULT_EXCEPTION_REPORTER` setting::
it: Se necessiti di personalizzare i report degli errori oltre ai filtri, potresti specificare una classe personalizzata per il report degli errori definendo l'impostazione :setting:`DEFAULT_EXCEPTION_REPORTER`::
ja: フィルタリングの他にエラーレポートをカスタマイズする必要がある場合は、 :setting:`DEFAULT_EXCEPTION_REPORTER` 設定を定義することでカスタムエラーレポータークラスを指定できます:
ko: 필터링 이외의 오류 보고서를 사용자 정의해야 하는 경우 :setup을 정의하여 사용자 정의 오류 보고자 클래스를 지정할 수 있습니다.'DEF_EXPECTION_REPORT' 설정은 다음과 같습니다.

source: The exception reporter is responsible for compiling the exception report data, and formatting it as text or HTML appropriately. (The exception reporter uses :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` when preparing the exception report data.)
it: Il reporter delle eccezioni è resposabile di compilare i dati per il report delle eccezioni e di formattarli come HTML in modo appropriato. (Il reporter delle eccezioni usa :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` quando prepara i dati di report delle eccezioni).
ja: 例外レポーターは例外レポートデータをコンパイルし、テキストまたはHTMLとして適切にフォーマットする責任があります。(例外報告レポーターは、例外レポートデータを作成する際に :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` を使用します)。
ko: 예외 리포터는 예외 리포트 데이터를 컴파일하여 텍스트 또는 HTML로 적절하게 포맷할 책임이 있습니다. (예외 리포터는 : setting:예외 리포트 데이터를 준비할 때 'DEFAT_REPORTER_FILTER'를 입력하세요.)

source: Your custom reporter class needs to inherit from :class:`django.views.debug.ExceptionReporter`.
it: La tua classe report personalizzata deve ereditare da :class:`django.views.debug.ExceptionReporter`.
ja: カスタムレポータークラスは :class:`django.views.debug.ExceptionReporter` を継承する必要があります。
ko: 사용자 정의 리포터 클래스는 :class:`django.views.debug.ExceptionReporter`.에서 상속해야 합니다.

source: Property that returns a :class:`pathlib.Path` representing the absolute filesystem path to a template for rendering the HTML representation of the exception. Defaults to the Django provided template.
it: Proprietà che restituisce un :class:`pathlib.Path` che rappresenta il percorso assoluto sul filesystem di un template per fare render della rappresentazione HTML dell'eccezione. E' predefinito il template che offre Django.
ja: 例外の HTML 表現をレンダリングするテンプレートへの絶対ファイルシステムパスを表す :class:`pathlib.Path` を返すプロパティです。デフォルトは Django が提供するテンプレートです。

source: Property that returns a :class:`pathlib.Path` representing the absolute filesystem path to a template for rendering the plain-text representation of the exception. Defaults to the Django provided template.
it: Proprietà che restituisce un :class:`pathlib.Path` che rappresenta il percorso assoluto sul filesystem di un template per fare render della rappresentazione in plain-text dell'eccezione. E' predefinito il template che offre Django.
ja: :class:`pathlib.Path` を返すプロパティで、例外のプレーンテキスト表現をレンダリングするテンプレー トへのファイルシステムの絶対パスを表します。デフォルトは Django が提供するテンプレートです。

source: Return a dictionary containing traceback information.
it: Restituisce un dizionario che contiene le informazioni utili per l'analisi
ja: トレースバック情報を含む辞書を返します。
ko: 추적 정보가 들어 있는 사전을 반환합니다.

source: This is the main extension point for customizing exception reports, for example::
it: Questa è il punto principale dell'estensione per personalizzare i report delle eccezioni, per esempio::
ja: これは、例えば例外レポートをカスタマイズするための主な拡張ポイントです。例えば下記のようにします:
ko: 예외 보고서를 사용자 지정하기 위한 기본 확장 지점입니다. 예:

source: Return HTML version of exception report.
it: Restituisce la versione HTML del report dell'eccezione
ja: 例外レポートの HTML 版を返します。
ko: 예외 보고서의 HTML 버전을 반환합니다.

source: Used for HTML version of debug 500 HTTP error page.
it: Usato per la versione HTML del debug della pagina di errore 500 HTTP.
ja: デバッグ 500 HTTP エラー・ページの HTML 版に使用されます。
ko: 디버그 500 HTTP 오류 페이지의 HTML 버전에 사용됩니다.

source: Return plain text version of exception report.
it: Restituisce una versione testuale del resoconto dell'eccezione
ja: 例外レポートのプレーンテキスト版を返します。
ko: 예외 보고서의 일반 텍스트 버전을 반환합니다.

source: Used for plain text version of debug 500 HTTP error page and email reports.
it: Usato per la versione testuale del debug della pagina di errore 500 HTTP e report email.
ja: デバッグ 500 HTTP エラーページおよび E メールレポートのプレーンテキスト版に使用されます。
ko: 디버그 500 HTTP 오류 페이지 및 전자 메일 보고서의 일반 텍스트 버전에 사용됩니다.

source: As with the filter class, you may control which exception reporter class to use within any given view by setting the ``HttpRequest``’s ``exception_reporter_class`` attribute::
it: Così come con la classe filtro, puoi controllare quale classe per il report di eccezioni usare dentro ad ogni view impostando l'attributo ``exception_reporter_class`` di ``HttpRequest``::
ja: フィルタクラスと同様に、 ``HttpRequest`` の ``exception_reporter_class`` 属性を指定することで、任意のビューで使用する例外レポータークラスを制御できます:
ko: 필터 클래스와 마찬가지로 "HttpRequest"의 "exception_reporter_class" 속성을 설정하여 지정된 보기 내에서 사용할 예외 리포터 클래스를 제어할 수 있습니다.

source: You can also set up custom error reporting by writing a custom piece of :ref:`exception middleware <exception-middleware>`. If you do write custom error handling, it's a good idea to emulate Django's built-in error handling and only report/log errors if :setting:`DEBUG` is ``False``.
it: Puoi anche approntare un report degli errori personalizzato scrivendo una parte di :ref:`middleware delle eccezioni <exception-middleware>`. personalizzato. Se scrivi un report degli errori personalizzato, è una buona idea simulare la gestione degli errori built-in di Django e fare report/log degli errori solo se :setting:`DEBUG` è ``False``.
ja: また、独自の :ref:`例外ミドルウェア <exception-middleware>` を書くことで、独自のエラーレポートを設定することもできます。もしカスタムエラー処理を書くのであれば、 Django の組み込みエラー処理を真似て、 :setting:`DEBUG` が ``False`` の場合のみエラーを報告/ログ出力するようにすると良いでしょう。
ko: 또한 :ref의 사용자 정의 부분을 작성하여 사용자 정의 오류 보고를 설정할 수도 있습니다.'중략 미들웨어'입니다. 사용자 정의 오류 처리를 작성하는 경우 다음과 같은 경우 Django의 기본 오류 처리를 에뮬레이트하는 것이 좋습니다.디버그는 거짓입니다.
pt_br: Você pode também configurar um relatório de erro personalizado escrevendo um pedaço personalizado :ref:`middleware de exceção <exception-middleware>`. Se escrever um tratamento de erros personalizado, é uma boa idéia emular o tratamento de erro do Django e somente reportar/logar erros se :setting:`DEBUG` é ``False``.
zh_hans: 你也能够通过自定义一系列的 :ref:`异常中间层 <exception-middleware>` 定制错误报告行为。若你已经编写了自定义错误处理器，模仿 Django 内置的错误处理器，并只在 :setting:`DEBUG` 为 ``False`` 时报告或记录错误是个不错的主意。

source: "How-to" guides
it: guide "How-to"
ja: 「How-to」ガイド
ko: "How-to" 가이드
pt_br: Guias "como"
zh_hans: 操作指南

source: Here you'll find short answers to "How do I....?" types of questions. These how-to guides don't cover topics in depth -- you'll find that material in the :doc:`/topics/index` and the :doc:`/ref/index`. However, these guides will help you quickly accomplish common tasks.
it: Qui troverai brevi risposte a domande del tipo "Come faccio a...?". Queste guide how-to non coprono gli argomenti in profondità -- troverai quel tipo di materiale in :doc:`/topics/index` and :doc:`/ref/index`. In ogni caso, queste guide ti aiuteranno a portare velocemente a termine task comuni.
ja: ここには「～をするにはどうしたらよいだろう？」といった疑問に対する簡単な答えがあります。これらの How-to ガイドではあまり詳細な話は扱いません。詳細な情報については :doc:`/topics/index` や :doc:`/ref/index` で見つけられるでしょう。ともあれ、ここにあるガイドは、よくある作業を素早く片付けるのに役立つはずです。
ko: "...을 어떻게 해야 하나요?"에 대한 짧은 대답을 여기서 찾을 수 있습니다. 이 how-to 가이드는 주제를 깊이 있게 다루지 않으며, :doc:`/topics/index`\와 :doc:`/ref/index`\에서 관련 자료를 얻을 수 있습니다. 이 가이드는 일반적인 작업을 재빨리 완수하는 데 도움이 될 것입니다.
pt_br: Aqui você irá encontrar respostas curtas para tipos de perguntas "Como eu faço ...?" Estes guias de como não cobre tópicos em profundidade -- você irá achar esse material em :doc:`/topics/index` e the :doc:`/ref/index`. Contudo, este guia irá lhe ajudar a fazer tarefas comuns rapidamente.
zh_hans: 你将在此找到大量回答形如“我该如何……”问题的简答。这些怎么做指南不会深入各个主题——你可以在 :doc:`/topics/index` 和 :doc:`/ref/index` 找到深入的讲解。不过，这些指引可以帮你快速完成常见的任务。

source: The `Django community aggregator`_, where we aggregate content from the global Django community. Many writers in the aggregator write this sort of how-to material.
it: L' `aggregatore della community Django`_, dove aggregriamo contenuti dalla community globale Django. Molti scrittori nell'aggregatore scrivono questo tipo di materiale how-to.
ja: `Django community aggregator`_ は、世界中の Django コミュニティのコンテンツを集約しています。このアグリゲータでは、多くの書き手がこの種のHow To記事を書いています。
ko: `Django community aggregator`_\는 전세계 Django 커뮤니티의 콘텐츠를 모으는 곳입니다. 많은 저자들이 이러한 how-to 자료를 작성하고 있습니다.
pt_br: O `Django community aggregator`_, onde nós juntamos conteúdo da comunidade Django global. Muitos escritores do "aggregator" escrevem esse tipo de material.
zh_hans: `Django 聚合社区`_，我们将全球 Django 社区的内容聚合至此。聚合社区中的很多作者编写了本快速指南文档。

source: How to provide initial data for models
it: Come fornire i dati iniziali per i modelli
ja: モデルに初期データを投入する

source: It's sometimes useful to prepopulate your database with hard-coded data when you're first setting up an app. You can provide initial data with migrations or fixtures.
it: A volte è utile prepopolare il tuo database con dati hard-coded al primo setup di una applicazione. Puoi fornire i dati iniziali con migrazioni o fixture.
ja: アプリを最初にセットアップするとき、データベースに、ハードコーディングされたデータをあらかじめ入力しておくと便利なことがあります。マイグレーションまたはフィクスチャで初期データを提供できます。

source: Provide initial data with migrations
ja: マイグレーションで初期データを投入する

source: To automatically load initial data for an app, create a :ref:`data migration <data-migrations>`. Migrations are run when setting up the test database, so the data will be available there, subject to :ref:`some limitations <test-case-serialized-rollback>`.
ja: アプリの初期データを自動的にロードするには、 :ref:`データマイグレーション<data-migrations>` を作成します。マイグレーションはテストデータベースのセットアップ時に実行されるため、 :ref:`いくつかの条件<test-case-serialized-rollback>` を満たすことで、データが利用できるようになります。

source: Provide data with fixtures
ja: フィクスチャでデータを投入する

source: You can also provide data using :ref:`fixtures <fixtures-explanation>`, however, this data isn't loaded automatically, except if you use :attr:`.TransactionTestCase.fixtures`.
ja: :ref:`フィクスチャ<fixtures-explanation>` (fixture) を使ってデータを投入することもできますが、 :attr:`.TransactionTestCase.fixtures` を使わない限り、このデータは自動的にはロードされません。

source: A fixture is a collection of data that Django knows how to import into a database. The most straightforward way of creating a fixture if you've already got some data is to use the :djadmin:`manage.py dumpdata <dumpdata>` command. Or, you can write fixtures by hand; fixtures can be written as JSON, XML or YAML (with PyYAML_ installed) documents. The :doc:`serialization documentation </topics/serialization>` has more details about each of these supported :ref:`serialization formats <serialization-formats>`.
it: Una fixture è una collezione di dati che Django sa come importare nel database. Il modo più diretto di creare una fixture se hai già qualche dato è usare il comando :djadmin:`manage.py dumpdata <dumpdata>`. Oppure, puoi scrivere fixture a mano; le fixture possono essere scritte come documenti JSON, XML o YAML (con PyYAML_ installato). La :doc:`documentazione sulla serializzazione </topics/serialization>` dà più dettagli circa ciascuno di questi :ref:`serialization formats <serialization-formats>` supportati.
ja: フィクスチャは、Djangoがデータベースにインポートする方法を知っているデータのコレクションです。 すでにいくつかのデータがある場合、フィクスチャを作成する最も簡単な方法は :djadmin:`manage.py dumpdata <dumpdata>` コマンドを使用することです。 もしくは、フィクスチャを手動で書くこともできます; フィクスチャは JSON、XML、または (PyYAML_ をインストールして) YAML ドキュメントとして記述できます。 :doc:`シリアライズのドキュメント </topics/serialization>` でサポートされている各 :ref:`シリアライズフォーマット <serialization-formats>` の詳細を確認できます。
ko: 고정 장치는 Django가 데이터베이스로 가져오는 방법을 알고 있는 데이터의 모음입니다. 데이터가 이미 있는 경우 고정장치를 만드는 가장 간단한 방법은 :tembadmin:'manage.py dumpdata' 명령을 사용하는 것입니다. 또는 수동으로 고정장치를 작성할 수 있으며 고정장치는 JSON, XML 또는 YAML(PyYAML_installed) 문서로 작성할 수 있습니다. :doc:'직렬화 설명서'는 지원되는 각:ref:'직렬화 형식'에 대한 자세한 정보를 제공합니다.
pt_br: Uma fixture é uma coleção de dados que o Django sabe como importar para o banco de dados. A maneira mais fácil de criar uma "fixture" se você já tem algum dado é usar o comando :djadmin:`manage.py dumpdata <dumpdata>`. Ou, você pode escrever fixtures manualmente; "fixtures" podem ser escritas como documentos JSON, XML ou YAML (com PyYAML_ installed). O :doc:`documentos de serialização </topics/serialization>` tem mais detalhes sobre cada um destes :ref:`formatos de serialização <serialization-formats>`.
zh_hans: 固定内容是一个 Django 知道如何导入数据库的集合。若你已有一些可用数据，最直接的创建固定内容的方式是使用 :djadmin:`manage.py dumpdata <dumpdata>` 命令。或者，你可以手写固定内容；固定数据能被写作 JSON，XML 或 YAML （要求已安装 PyYAML_）文档。 :doc:`序列化文档 </topics/serialization>` 拥有更多这些支持的 :ref:`序列化格式 <serialization-formats>` 的细节信息。

source: As an example, though, here's what a fixture for a ``Person`` model might look like in JSON:
it: Ad esempio, però, ecco come potrebbe apparire una fixture per un modello ``Person`` in JSON:
ja: 例として、 ``Person`` モデルのフィクスチャをJSONで書くと次のようになります:
ko: 그러나 한 예로 JSON에서 "사람" 모델의 고정장치는 다음과 같습니다.

source: And here's that same fixture as YAML:
it: Ed ecco le stesse fixtures come YAML:
ja: YAML のフィクスチャだと以下のようになります:
ko: 그리고 YAML로 된 동일한 fixture 가 있습니다.
pt_br: E aqui a mesma "fixtre" como YAML:
zh_hans: 以下是一样的固定内容，YAML 格式：

source: You'll store this data in a ``fixtures`` directory inside your app.
it: Archivierai questi dati nella directory ``fixtures`` all'interno della tua app.
ja: このデータは、アプリケーション内の ``fixtures`` ディレクトリ内に保存しておくことができます。
ko: 이 데이터는 앱 안에 있는 "고정장치" 디렉토리에 저장됩니다.
pt_br: Você armazenará este dado em um diretório ``fixtures`` dentro de sua app.
zh_hans: 你会将该数据存入应用中的 ``fixtures`` 字典。

source: You can load data by calling :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, where ``<fixturename>`` is the name of the fixture file you've created. Each time you run :djadmin:`loaddata`, the data will be read from the fixture and reloaded into the database. Note this means that if you change one of the rows created by a fixture and then run :djadmin:`loaddata` again, you'll wipe out any changes you've made.
it: Puoi caricare i dati chiamando :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>``, dove ``<fixturename>`` è il nome del file di fixture che hai creato. Ogni volta che esegui :djadmin:`loaddata`, i dati verranno letti dalla fixture e ricaricati nel database. Nota che questo significa che se modifichi una delle righe create da una fixture e poi esegui di nuovo :djadmin:`loaddata`, cancellerai qualsiasi modifica tu abbia apportato.
ja: データを読み込むには、 :djadmin:`manage.py loaddata <loaddata>` ``<fixturename>`` を呼び出します。ここで ``<fixturename>`` は作成したフィクスチャファイルの名前です。 :djadmin:`loaddata` を実行するたびに、フィクスチャからデータが読み込まれ、データベースに再ロードされます。これは、フィクスチャによって作成された行の一つを変更してから :djadmin:`loaddata` を再度実行すると、変更が元に戻ってしまうことを意味します。

source: Tell Django where to look for fixture files
ja: フィクスチャファイルを探す場所を Django に教える

source: By default, Django looks for fixtures in the ``fixtures`` directory inside each app for, so the command ``loaddata sample`` will find the file ``my_app/fixtures/sample.json``. This works with relative paths as well, so ``loaddata my_app/sample`` will find the file ``my_app/fixtures/my_app/sample.json``.
ja: デフォルトでは、Django は各アプリの ``fixtures`` ディレクトリにあるフィクスチャを探すので、 ``loaddata sample`` コマンドは ``my_app/fixtures/sample.json`` ファイルを探します。これは相対パスでも動作するので、 ``loaddata my_app/sample`` では ``my_app/fixtures/my_app/sample.json`` ファイルが見つかります。

source: Django also looks for fixtures in the list of directories provided in the :setting:`FIXTURE_DIRS` setting.
ja: Django は :setting:`FIXTURE_DIRS` 設定で指定されたディレクトリのリストからもフィクスチャを探します。

source: To completely prevent default search form happening, use an absolute path to specify the location of your fixture file, e.g. ``loaddata /path/to/sample``.
ja: デフォルトの検索を完全に防ぐためには、フィクスチャファイルの場所の指定に絶対パスを使用してください。例えば、 ``loaddata /path/to/sample`` のようにします。

source: Namespace your fixture files
ja: フィクスチャファイルの名前空間を指定する

source: Django will use the first fixture file it finds whose name matches, so if you have fixture files with the same name in different applications, you will be unable to distinguish between them in your ``loaddata`` commands. The easiest way to avoid this problem is by *namespacing* your fixture files. That is, by putting them inside a directory named for their application, as in the relative path example above.
ja: Django は、名前が一致するフィクスチャファイルを最初に見つけると、そのフィクスチャ ファイルを使います。そのため、異なるアプリケーションに同じ名前のフィクスチャファイルがあると、 ``loaddata`` コマンドでそれらを区別できなくなります。この問題を避ける最も簡単な方法は、フィクスチャファイルを *名前空間* で区切ることです。つまり、上記の相対パスの例のように、アプリケーションに応じた名前のディレクトリにファイルを置くことです。
