Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: ``parser.parse()`` takes a tuple of names of block tags ''to parse until''. It returns an instance of ``django.template.NodeList``, which is a list of all ``Node`` objects that the parser encountered ''before'' it encountered any of the tags named in the tuple.
it: ``parser.parse()`` prende una tupla di nomi di tag di blocco "fino a quali fare l'analisi". Restituisce una istanza di ``django.template.NodeList``, che è una lista di tutti gli oggetti ``Node`` che il parser ha incontrato "prima" di incontrare un qualsiasi tag presente nella lista.
ja: ``parser.parse()`` はブロックタグの名前のタプルを受け取ります。これは ``django.template.NodeList`` のインスタンスを返します。 これはパーサがタプルで指定されたタグに遭遇する''前に''遭遇した全ての ``Node`` オブジェクトのリストです。
ko: '파서.파서'는 '까지' 구문 분석하기 위해' 블록 태그의 이름 두 개를 사용한다. 그것은 ``django.template"의 예를 반환한다.노드리스트'는 파서가 이전에 만났던 모든 "노드" 오브젝트 목록이며 튜플에서 명명된 태그 중 하나를 발견했다.
pt_br: ``parser.parse()`` recebe uma tupla de nomes de blocos de tags para parsear. Ele retorna uma instância de ``django.template.NodeList``, que é uma lista de todos os objetos ``Node`` que o analisador encontrou "antes" que tenha encontrado qualquer nome de tags na tupla.
zh_hans: ``parser.parse()`` 接受一个包含 “解析直到” 区块标签的元组。它返回一个 ``django.template.NodeList`` 实例，它解析器遇到元组中的标签前解析的 ``Node`` 对象。

source: In ``"nodelist = parser.parse(('endcomment',))"`` in the above example, ``nodelist`` is a list of all nodes between the ``{% comment %}`` and ``{% endcomment %}``, not counting ``{% comment %}`` and ``{% endcomment %}`` themselves.
it: In ``"nodelist = parser.parse(('endcomment',))"`` nell'esempio sopra, ``nodelist`` è una lista di nodi tra ``{% comment %}`` e ``{% endcomment %}``, senza contare ``{% comment %}`` e``{% endcomment %}`` stessi.
ja: 上の例 ``"nodelist = parser.parse(('endcomment',))"`` において、 ``nodelist`` は ``{% comment %}`` と ``{% endcomment %}`` の間にある全てのノードのリストであり、 ``{% comment %}`` と ``{% endcomment %}`` 自体は含まれません。
ko: 위의 예에서 "'끝글리스트 ='에서 "끝글리스트"는 ``{% comment %"와 "{% comment %"를 세지 않는 ``{% comment %"와 "{% comment %}" 사이의 모든 노드를 나열한 것이다.
pt_br: Em ``"nodelist = parser.parse(('endcomment',))"`` no exemplo acima, ``nodelist`` é uma lista de todos os nós entre o``{% comment %}`` e ``{% endcomment %}``, sem contar os próprios ``{% comment %}`` e ``{% endcomment %}``.
zh_hans: 上文例子 ``"nodelist = parser.parse(('endcomment',))"`` 中， ``nodelist`` 是一个包含了 ``{% comment %}`` 和 ``{% endcomment %}`` 之间所有节点的列表，但不包含 ``{% comment %}`` 和 ``{% endcomment %}`` 本身。

source: After ``parser.parse()`` is called, the parser hasn't yet "consumed" the ``{% endcomment %}`` tag, so the code needs to explicitly call ``parser.delete_first_token()``.
it: Dopo che ``parser.parse()`` è stato chiamato, il parser non ha ancora "consumato" il tag ``{% endcomment %}``, quindi il codice ha bisogno di chiamare splicitamente``parser.delete_first_token()``.
ja: ``parser.parse()`` が呼ばれた後、パーサはまだ ``{% endcomment %}`` タグを "消費" していないので、コードは明示的に ``parser.delete_first_token()`` を呼び出す必要があります。
ko: ``parser.parse()"가 호출된 후 파서는 아직 "{% end comment %" 태그를 "소비"하지 않았기 때문에 코드에서 "parser.delete_first_token()"이라고 명시적으로 불러야 한다.
pt_br: Depois que ``parser.parse()`` é chamado, o analisaor sintático ainda não "consumiu" a tag ``{% endcomment %}``, então o código precisa chamar explicitamente o ``parser.delete_first_token()``.
zh_hans: 在调用 ``parser.parse()`` 后，解析还未 “消费掉” ``{% endcomment %}`` 标签，所以代码需要显示地调用 ``parser.delete_first_token()``。

source: ``CommentNode.render()`` returns an empty string. Anything between ``{% comment %}`` and ``{% endcomment %}`` is ignored.
it: ``CommentNode.render()`` restituisce una stringa vuota. Ogni cosa tra ``{% comment %}`` e ``{% endcomment %}`` viene ignorata.
ja: ``CommentNode.render()`` は空の文字列を返します。 ``{% comment %}`` と ``{% endcomment %}`` の間はすべて無視されます。
ko: "commentNode.render()"는 빈 문자열을 반환합니다. "{% comment %"와 "{% end comment %}" 사이의 어떤 것도 무시된다.

source: Parsing until another block tag, and saving contents
it: Analizza fino ad un'altro tag, e salva i contenuti
ja: 別のブロックタグまでのパースと内容の保存
ko: 다른 블록 태그까지 구문 분석하고 내용 저장
pt_br: Analisando sintaticamente até um outro bloco da tag, e armazenando seu conteúdo.
zh_hans: 解析直到碰到另一区块标签，并保存内容。

source: In the previous example, ``do_comment()`` discarded everything between ``{% comment %}`` and ``{% endcomment %}``. Instead of doing that, it's possible to do something with the code between block tags.
it: Nell'esempio precedente, ``do_comment()`` ha scartato tutto quel che c'era tra ``{% comment %}`` e ``{% endcomment %}``. Invece di fare così, è possibile fare qualcosa con il codice che si trova tra i tra i tag.
ja: 先ほどの例では、 ``do_comment()`` は ``{% comment %}`` と ``{% endcomment %}`` の間をすべて破棄していました。その代わりに、ブロックタグの間のコードで好きなことができます。
ko: 앞의 예에서 "do_comment()"는 "{% comment %"와 "{% end comment %" 사이의 모든 것을 폐기했다. 대신 블록 태그 간에 코드를 사용하여 작업을 수행할 수 있습니다.
pt_br: No exemplo anterior, ``do_comment()`` descartou tudo entre``{% comment %}`` e ``{% endcomment %}``. Ao invés de fazer isso, é possível fazer alguma coisa com o código que está dentro do bloco de tags.
zh_hans: 在前文的例子中， ``do_comment`` 抛弃了 ``{% comment %}`` 和 ``{% endcomment %}`` 之间的所有内容。现在我们不这么做，我们要对区块标签之间的东西做点什么。

source: For example, here's a custom template tag, ``{% upper %}``, that capitalizes everything between itself and ``{% endupper %}``.
it: Per esempio, ecco un template tag personalizzato, ``{% upper %}``, che rende maiuscolo tutto quel che c'è tra sè stesso e ``{% endupper %}``.
ja: 例えば、これはカスタムテンプレートタグ ``{% upper %}`` で、それ自身と ``{% endupper %}`` の間をすべて大文字にします。
ko: 예를 들어,여기 "{% oper %}"라는 사용자 정의 템플릿 태그가 있는데, 이 태그는 자신들 사이의 모든 것을 대문자로 한다.
pt_br: Por exemplo, aqui uma tag de template, ``{% upper %}``, que coloca todas as letras em maiúsculo de tudo entre ela e ``{% endupper %}``.
zh_hans: 举个例子，这里有个模板标签， ``{% upper %}``，它将自己与 ``{% endupper %}`` 之间的内容全部大写。

source: Usage:
it: Utilizzo:
ja: 使い方:
ko: 용례
pt_br: Uso:
zh_hans: 用法：

source: As in the previous example, we'll use ``parser.parse()``. But this time, we pass the resulting ``nodelist`` to the ``Node``::
it: Come nell'esempio precedente, useremo ``parser.parse()``. Ma questa volta, passeremo la ``nodelist`` risultante a ``Node``::
ja: 上の例と同様に ``parser.parse()`` を使いますが、今回は次のように、結果の ``nodelist`` を ``Node`` に渡します。
ko: 앞의 예와 같이 "파서.파스()"를 사용할 것이다. 그러나 이번에는 ``노드 리스트"를 ``노드"에게 넘겼다.
pt_br: Como no exemplo anterior, usaremos ``parser.parse()``. Mas agora, passamos o ``nodelist`` resultante para o ``Node``::
zh_hans: 与之前的例子一样，我们将使用 ``parser.parse()``。但这次，我们将生成的 ``nodelist`` 传递给 ``Node``::

source: The only new concept here is the ``self.nodelist.render(context)`` in ``UpperNode.render()``.
it: L'unico concetto nuovo qui è ``self.nodelist.render(context)`` in ``UpperNode.render()``.
ja: ここで唯一の新しい概念は、``UpperNode.render()`` 内の ``self.nodelist.render(context)`` だけです。
ko: 여기서 유일한 새로운 개념은 ``UpperNode.render()"의 ``self.nodelist.render(컨텍스트)"이다.
pt_br: O único conceito novo aqui é o ``self.nodelist.render(context)`` no ``UpperNode.render()``.
zh_hans: 唯一的新概念是 ``UpperNode.render()`` 中的 ``self.nodelist.render(context)``。

source: For more examples of complex rendering, see the source code of :ttag:`{% for %}<for>` in :source:`django/template/defaulttags.py` and :ttag:`{% if %}<if>` in :source:`django/template/smartif.py`.
ja: 複雑なレンダリングの追加の例としては、:source:`django/template/defaulttags.py` 内の :ttag:`{% for %}<for>` や :source:`django/template/smartif.py` 内の :ttag:`{% if %}<if>` のソースコードを見てください。

source: How to delete a Django application
ja: Djangoアプリケーションを削除する

source: Django provides the ability to group sets of features into Python packages called :doc:`applications</ref/applications/>`. When requirements change, apps may become obsolete or unnecessary. The following steps will help you delete an application safely.
ja: Django は、一連の機能を :doc:`アプリケーション</ref/applications/>` と呼ばれる Python パッケージとしてグループ化する機能を提供しています。要件が変化すると、アプリは古くなったり不要になることがあります。以下のステップは、アプリケーションを安全に削除する助けとなります。

source: Remove all references to the app (imports, foreign keys etc.).
ja: アプリへのすべての参照を削除する (import、外部キーなど)

source: Remove all models from the corresponding ``models.py`` file.
ja: すべてのモデルを対応する ``models.py`` ファイルから削除する。

source: Create relevant migrations by running :djadmin:`makemigrations`. This step generates a migration that deletes tables for the removed models, and any other required migration for updating relationships connected to those models.
ja: :djadmin:`makemigrations` を実行して、関連するマイグレーションを作成する。このステップは、削除されるモデルに対するテーブルを削除するマイグレーションや、それらのモデルに接続されたリレーションを更新するために必要とされる他のマイグレーションを生成します。

source: :ref:`Squash <migration-squashing>` out references to the app in other apps' migrations.
ja: 他のアプリのマイグレーション内のアプリへの参照を :ref:`squash <migration-squashing>` する。

source: Apply migrations locally, runs tests, and verify the correctness of your project.
ja: ローカルでマイグレーションを適用し、テストを実行し、プロジェクトの健全性を確認する。

source: Deploy/release your updated Django project.
ja: 更新された Django プロジェクトをデプロイ/リリースする。

source: Remove the app from :setting:`INSTALLED_APPS`.
ja: アプリを :setting:`INSTALLED_APPS` から削除する。

source: Finally, remove the app's directory.
ja: 最後に、アプリのディレクトリを削除する。

source: How to use Django with Daphne
it: Come usare Django con Daphne
ja: Django を Daphne とともに使う
ko: 다프네와 함께 django를 사용하는 방법

source: :pypi:`Daphne <daphne>` is a pure-Python ASGI server for UNIX, maintained by members of the Django project. It acts as the reference server for ASGI.
ja: :pypi:`Daphne <daphne>` は、pure-Pythonで書かれたUNIX向けのASGIサーバーで、Djangoプロジェクトのメンバーによってメンテナンスされています。これはASGIのリファレンス実装のサーバーとして機能します。

source: Installing Daphne
it: Installare Daphne
ja: Daphneのインストール
ko: 다프네 설치

source: You can install Daphne with ``pip``:
ja: ``pip`` で Daphne をインストールします:

source: Running Django in Daphne
it: Eseguire Django con Daphne
ja: Daphne で Django を実行
ko: 다프네에서 djagno 작동

source: When Daphne is installed, a ``daphne`` command is available which starts the Daphne server process. At its simplest, Daphne needs to be called with the location of a module containing an ASGI application object, followed by what the application is called (separated by a colon).
it: Quando Daphne è installato, è disponibile un comando ``daphne`` che avvia il processo server. Nella sua forma più semplice, Daphne necessita di essere chiamato con la locazione di un modulo che contiene un oggetto di applicazione ASGI, seguito da come si chiama l'applicazione (separati dai due punti).
ja: Daphne がインストールされると、Daphne サーバプロセスを起動する ``daphne`` コマンドが利用できるようになります。Daphne を呼び出すには、ASGI アプリケーションオブジェクトを含むモジュールの場所と、それに続いてアプリケーションの名前を（コロンで区切って）指定する必要があります。
ko: 다프네가 설치되면 다프네 서버 프로세스를 시작하는 ``다프네" 명령이 나온다. 간단히 말해, 다프네는 ASGI 애플리케이션 개체를 포함하는 모듈의 위치로 호출되어야 하며, 그 다음에 애플리케이션 이름이 콜론으로 구분됩니다.

source: For a typical Django project, invoking Daphne would look like:
ja: 典型的な Django プロジェクトでは、Daphne の起動は次のようになります:

source: This will start one process listening on ``127.0.0.1:8000``. It requires that your project be on the Python path; to ensure that run this command from the same directory as your ``manage.py`` file.
it: Questo avvierà il processo che ascolta su ``127.0.0.1:8000``. Richiede che il tuo progetto sia sul percorso di Python; per assicurartene, lancia questo comando dalla stessa directory del tuo file ``manage.py``.
ja: このコマンドは ``127.0.0.1:8000`` を待ち受けるプロセスを1つ起動します。プロジェクトは Python のパス上にある必要があります。それを確実にするために、 ``manage.py`` ファイルと同じディレクトリからこのコマンドを実行してください。
ko: 이로써 "127.0.0.1:8000"에 대한 청취가 시작된다. 프로젝트가 Python 경로에 있어야 합니다. ``관리"와 동일한 디렉토리에서 이 명령을 실행해야 합니다.

source: Integration with ``runserver``
ja: ``runserver`` との統合

source: Daphne provides a :djadmin:`runserver` command to serve your site under ASGI during development.
ja: Daphneは開発中にASGIでサイトを動かすための :djadmin:`runserver` コマンドを提供しています。

source: This can be enabled by adding ``daphne`` to the start of your :setting:`INSTALLED_APPS` and adding an ``ASGI_APPLICATION`` setting pointing to your ASGI application object::
ja: これは :setting:`INSTALLED_APPS` の先頭に ``daphne`` を追加し、ASGI アプリケーションオブジェクトを指す ``ASGI_APPLICATION`` 設定を追加することで有効になります:

source: How to use Django with Hypercorn
it: Come utilizzare Django con Hypercorn
ja: Django を Hypercorn とともに使う
ko: 하이퍼콘과 함께 장고를 사용하는 방법

source: Hypercorn_ is an ASGI server that supports HTTP/1, HTTP/2, and HTTP/3 with an emphasis on protocol support.
it: Hypercorn_ è un server ASGI che supporta HTTP/1, HTTP/2 e HTTP/3 con enfasi sul supporto al protocollo.
ja: Hypercorn_ は、プロトコルのサポートに重点を置く HTTP/1、HTTP/2、HTTP/3 をサポートする ASGI サーバーです。
ko: Hypercorn_은(는) 프로토콜 지원을 강조하여 HTTP/1, HTTP/2 및 HTTP/3을 지원하는 ASGI 서버입니다.

source: Installing Hypercorn
it: Installa Hypercorn
ja: Hypercorn のインストール
ko: 하이퍼콘 설치

source: You can install Hypercorn with ``pip``:
ja: ``pip`` で Hypercorn をインストールします:

source: Running Django in Hypercorn
it: Utilizzare Django in Hypercorn
ja: Hypercorn で Django を実行
ko: 하이퍼콘에서 Django 실행

source: When Hypercorn is installed, a ``hypercorn`` command is available which runs ASGI applications. Hypercorn needs to be called with the location of a module containing an ASGI application object, followed by what the application is called (separated by a colon).
it: Quando Hypercorn è installato, è disponibile un comando ``hypercorn`` per lanciare le applicazioni ASGI. Hypercorn necessita di essere chiamato nella locazione di un modulo contenente un oggetto ASGI, seguito da come si chiama l'applicazione (separati dai due punti).
ja: Hypercorn をインストールすると、ASGI アプリを実行する ``hypercorn`` コマンドが利用できるように鳴ります。Hypercorn は、ASGI アプリケーション オブジェクトがあるモジュールの場所で実行し、アプリケーションの名前 (コロン区切り) を指定する必要があります。
ko: 하이퍼콘을 설치하면 ASGI 응용 프로그램을 실행하는 "하이퍼콘" 명령을 사용할 수 있다. 하이퍼콘은 ASGI 애플리케이션 개체를 포함하는 모듈의 위치로 호출되어야 하며 그 다음에 애플리케이션 이름이 콜론으로 구분됩니다.

source: For a typical Django project, invoking Hypercorn would look like:
ja: 典型的な Django プロジェクトでは、Hypercorn の呼び出しは次のようになります。

source: For more advanced usage, please read the `Hypercorn documentation <Hypercorn_>`_.
it: Per un utilizzo più avanzato, leggi la `documentazione di Hypercorn <Hypercorn_>`_.
ja: より高度な使い方については、 `Hypercorn documentation <Hypercorn_>`_ を読んでください。
ko: 좀 더 고급스러운 용법은 '하이퍼콘 설명서'를 읽어주세요.

source: How to deploy with ASGI
it: Come distribuire con ASGI.
ja: ASGI とともにデプロイするには
ko: ASGI를 사용하여 배포하는 방법

source: As well as WSGI, Django also supports deploying on ASGI_, the emerging Python standard for asynchronous web servers and applications.
it: Così come WSGI, Django supporta anche il deploy su ASGI_, lo standard emergente di Pyhon per i web server e le applicazioni asincrone.
ja: WSGI だけでなく、Django は非同期ウェブサーバやアプリケーションのための新しい Python 標準である ASGI_ でのデプロイもサポートしています。
ko: WSGI뿐만 아니라, Django는 비동기 웹 서버와 애플리케이션을 위한 새로운 Python 표준인 ASGI_에 대한 배포도 지원합니다.

source: Django's :djadmin:`startproject` management command sets up a default ASGI configuration for you, which you can tweak as needed for your project, and direct any ASGI-compliant application server to use.
it: Il comando di gestione di Django :djadmin:`startproject` imposta una configurazione ASGI di default per te, che puoi migliorare a seconda delle necessità del tuo progetto, e orientare ogni server per le applicazioni che sia ASGI-compliant al suo utilizzo.
ja: Django の :djadmin:`startproject` 管理用コマンドは、デフォルトの ASGI 設定をセットアップします。必要に応じて、あなたのプロジェクトと ASGI 準拠の Web サーバに合わせて微調整することができます。
ko: Django의 :djadmin:'start project' 관리 명령은 프로젝트에 필요한 대로 수정할 수 있는 기본 ASGI 구성을 설정하고 ASGI 호환 애플리케이션 서버를 사용하도록 지시합니다.

source: Django includes getting-started documentation for the following ASGI servers:
it: Django comprende la documentazione per iniziare ad utilizzare i seguenti server ASGI:
ja: Django には以下の ASGI サーバのために、手引きとなるドキュメントが用意されています。
ko: Django에는 다음 ASGI 서버에 대한 시작 설명서가 포함되어 있습니다.

source: The ``application`` object
it: L'oggetto ``application``
ja: ``application`` オブジェクト
ko: 애플리케이션 객체
pt_br: O objeto ``Application``
zh_hans: ``application`` 对象

source: Like WSGI, ASGI has you supply an ``application`` callable which the application server uses to communicate with your code. It's commonly provided as an object named ``application`` in a Python module accessible to the server.
it: Come WSGI, ASGI ti richiede di fornire una ``applicazione`` chiamabile che l'application server utilizza per comunicare con il tuo codice. Normalmente è fornita come un oggetto chiamato ``application`` in un modulo Python accessibile al server.
ja: WSGI と同様に、ASGI は ``application`` という呼び出し可能オブジェクトを提供しており、アプリケーション サーバはこれを使用してあなたのコードと通信します。これは一般的に、サーバにアクセスできる Python モジュールの中で ``application`` という名前のオブジェクトとして提供されています。
ko: WSGI와 마찬가지로 ASGI는 애플리케이션 서버가 코드와 통신하기 위해 사용하는 "애플리케이션" 호출 케이블을 제공합니다. 그것은 일반적으로 서버가 접근할 수 있는 파이썬 모듈에서 "애플리케이션"이라는 이름의 객체로 제공된다.

source: The :djadmin:`startproject` command creates a file :file:`<project_name>/asgi.py` that contains such an ``application`` callable.
it: Il comando :djadmin:`startproject` crea un file :file:`<project_name>/asgi.py` che contiene questa ``application`` richiamabile.
ja: :djadmin:`startproject` コマンドは、この ``application`` 呼び出し可能オブジェクトを含む :file:`<project_name>/asgi.py` ファイルを生成します。
ko: :djadmin:'start project' 명령은 :file:'/asgi 파일을 생성합니다.그러한 ``응용프로그램"을 포함한 py는 호출할 수 있다.

source: It's not used by the development server (``runserver``), but can be used by any ASGI server either in development or in production.
it: Non è usato dal server di sviluppo (``runserver``), ma può essere utilizzato da ogni server ASGI sia in sviluppo che in produzione.
ja: 開発サーバー (``runserver``) では使用されませんが、開発環境と本番環境のどちらでも、任意の ASGI サーバーからも使用できます。
ko: 개발 서버('runserver')에서 사용하는 것이 아니라 ASGI 서버가 개발 또는 프로덕션에서 사용할 수 있습니다.

source: ASGI servers usually take the path to the application callable as a string; for most Django projects, this will look like ``myproject.asgi:application``.
it: I server ASGI normalmente prendono il percorso dell'applicazione richiamabile come stringa; per molti progetti Django, avrà questo aspetto: ``myproject.asgi:application``.
ja: ASGI サーバーは通常、呼び出し可能オブジェクト application へのパスを文字列として取ります。たとえば、ほとんどの Django プロジェクトでは、``myproject.asgi:application`` のような文字列になります。
ko: ASGI 서버는 대개 문자열로 호출할 수 있는 응용 프로그램의 경로를 택하는데 대부분의 Django 프로젝트에서 이것은 ``my project.asgi: application"처럼 보일 것이다.

source: While Django's default ASGI handler will run all your code in a synchronous thread, if you choose to run your own async handler you must be aware of async-safety.
it: Mentre l'handler di default di Django avvierà tutto il tuo codice un thread sincrono, se scegli di avviare il tuo handler asincrono devi essere al corrente della async-safety.
ja: Django のデフォルトの ASGI ハンドラは全てのコードを同期スレッドで実行します が、独自の非同期ハンドラを実行する場合は、非同期安全性を意識する必要があります。
ko: Django의 기본 ASGI 처리기는 모든 코드를 동기 스레드에서 실행하지만, 자신의 비동기 처리기를 실행하도록 선택하는 경우에는 비동기 안전성을 알고 있어야 합니다.

source: Do not call blocking synchronous functions or libraries in any async code. Django prevents you from doing this with the parts of Django that are not async-safe, but the same may not be true of third-party apps or Python libraries.
it: Non chiamare funzioni sincrone o librerie bloccanti in alcun codice asincrono. Django ti impedisce di farlo con le parti di Django che non sono async-safe, ma lo stesso potrebbe non essere vero per applicazioni di terze parti o librerie Python.
ja: 非同期コードの中で、ブロッキングな同期関数やライブラリを呼び出さないでください。Django は、非同期安全でない Django の部分でこのようなことができないようにしていますが、サードパーティのアプリや Python ライブラリではそうとは限りません。
ko: 어떤 비동기 코드에서도 동기 함수나 라이브러리 차단을 호출하지 마십시오. Django는 비동기식 안전이 아닌 Django 부분에서는 이 작업을 수행할 수 없도록 방지하지만 타사 앱이나 Python 라이브러리에서는 그렇지 않을 수 있습니다.

source: Configuring the settings module
it: Configura il modulo settings
ja: Settings モジュールを設定する
ko: 설정 모듈 구성
pt_br: Configurando o módulo de definições.
zh_hans: 配置 settings 模块

source: When the ASGI server loads your application, Django needs to import the settings module — that's where your entire application is defined.
it: Quando il server ASGI carica la tua applicazione, Django ha bisogno di importare il modulo settings - che è il posto dove la tua intera applicazione è definita.
ja: ASGI サーバがアプリケーションをロードするとき、Django は settings モジュールをインポートする必要があります――アプリケーション全体がここで定義されます。
ko: ASGI 서버가 응용프로그램을 로드할 때 Django는 전체 응용프로그램이 정의된 설정 모듈을 가져와야 합니다.

source: Django uses the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to locate the appropriate settings module. It must contain the dotted path to the settings module. You can use a different value for development and production; it all depends on how you organize your settings.
it: Django usa la variabile d'ambiente envvar:`DJANGO_SETTINGS_MODULE` per trovare il modulo di impostazioni appropriato. Deve contenere il percorso puntato al modulo delle impostazioni. Puoi usare valori diversi per lo sviluppo e la produzione; dipende tutto da come organizzi le tue impostazioni.
ja: Django は適切な Settings モジュールを見つけるために、 :envvar:`DJANGO_SETTINGS_MODULE` 環境変数を使用します。これは設定モジュールへのドット区切りのパスを含んでいなければなりません。開発時と実運用時で別々の値を使用することも可能です。どのように設定を組織するか次第です。
ko: Django는 :envvar를 사용합니다.'DJANGO_SETTINGS_MODULE' 환경변수로서 적절한 설정모듈을 찾을 수 있다. 설정 모듈에 대한 점선 경로를 포함해야 합니다. 개발 및 프로덕션에 다른 값을 사용할 수 있습니다. 모든 값은 설정을 구성하는 방법에 따라 다릅니다.
pt_br: O Django usa a variável de ambiente :envvar:`DJANGO_SETTINGS_MODULE` para localizar o módulo de definições apropriado. Este deve conter um caminho pontuado para o módulo de definições. Você pode usar um valor diferente para desenvolvimento e produção; Tudo depende de como você organiza suas definições.
zh_hans: Django 利用 :envvar:`DJANGO_SETTINGS_MODULE` 环境变量来定位合适的配置模块。它必须包含到配置模块的点式路径。开发环境和生产环境可以配置不同值；这都取决于你是如何组织配置的。

source: If this variable isn't set, the default :file:`asgi.py` sets it to ``mysite.settings``, where ``mysite`` is the name of your project.
it: Se questa variabile non è impostata, il file predefinito :file:`asgi.py` lo imposta a ``mysite.settings``, dove ``mysite`` è il nome del tuo progetto.
ja: この変数が指定されていない場合、デフォルトの :file:`asgi.py` は ``mysite.settings`` を設定します。 ``mysite`` はプロジェクトの名前です。
ko: 이 변수가 설정되지 않은 경우 기본값:file:'asgi'입니다.py는 그것을 ``내 사이트"로 설정한다."내 사이트"가 프로젝트의 이름인 설정"입니다.

source: Applying ASGI middleware
it: Caricare il middleware ASGI
ja: ASGI ミドルウェアの適用
ko: ASGI 미들웨어 적용

source: To apply ASGI middleware, or to embed Django in another ASGI application, you can wrap Django's ``application`` object in the ``asgi.py`` file. For example::
it: Per applicare un middleware ASGI, o per incorporare Django in un'altra applicazione ASGI, puoi avvolgere l'oggetto ``application`` di Django nel file ``asgi.py``. Per esempio::
ja: ASGI ミドルウェアを適用したり、他の ASGI アプリケーションに Django を組み込むには、 Django の ``application`` オブジェクトを ``asgi.py`` ファイルでラップします。例:
ko: ASGI 미들웨어를 적용하거나 Django를 다른 ASGI 애플리케이션에 포함시키려면 Django의 ``응용" 개체를 "asgi"에 포장하면 된다.파이브 파일 예:

source: How to use Django with Uvicorn
it: Come utilizzare Django con Uvicorn
ja: Django を Uvicorn とともに使う
ko: django와 유비콘 사용방법

source: Uvicorn_ is an ASGI server based on ``uvloop`` and ``httptools``, with an emphasis on speed.
it: Uvicorn_ è un server ASGI basato su ``uvloop`` e ``httptools``, con enfasi sulla velocità.
ja: Uvicorn_ は ``uvloop`` と ``httptools`` をベースにした速度重視のASGIサーバーです。
ko: Uvicorn은 속도를 중시하는 "uvloop"과 "http tools"에 기반을 둔 ASGI 서버이다.

source: Installing Uvicorn
it: Installare Uvicorn
ja: Uvicorn のインストール
ko: Uvicorn 설치

source: You can install Uvicorn with ``pip``:
ja: ``pip`` で Uvicorn をインストールします:

source: Running Django in Uvicorn
it: Avviare Django in Uvicorn
ja: Uvicorn で Django を実行
ko: Uvicorn에서 django 실행
