Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Notice that we always return a ``Hand`` instance from these methods. That's the Python object type we want to store in the model's attribute.
it: Nota che restituiamo sempre una istanza di ``Hand`` da questi metodi. Quello è il tipo di oggetto Python che vogliamo salvare nell'attributo del model.
ja: これらのメソッドからは常に ``Hand`` インスタンスが返されることに注意してください。これは、モデルの属性に保存したいPythonオブジェクトの型です。
ko: "우리는 항상 이러한 방법에서 ``Hand"의 예를 되돌려 놓는다는 것을 주목하라. 모델의 속성에 저장하려는 Python 개체 유형입니다.
pt_br: Perceba que sempre retornamos uma instância destes métodos. Este é o tipo do objeto Python que queremos armazenar no atributo do modelo.
zh_hans: 注意，我们总是为这些方法返回一个 ``Hand`` 实例。这就是我们要保存在模型属性中的 Python 对象类型。

source: For ``to_python()``, if anything goes wrong during value conversion, you should raise a :exc:`~django.core.exceptions.ValidationError` exception.
it: Per ``to_python()``, se qualcosa va storto durante una conversione di valore, dovresti lanciare una eccezione :exc:`~django.core.exceptions.ValidationError`.
ja: ``to_python()`` において、値の変換中に何か問題が発生した場合は、 :exc:`~django.core.exceptions.ValidationError` 例外を発生させる必要があります。
ko: ``to_python()``에서, 만약 가치 변환 중에 잘못된 것이 있다면, 당신은 :exc:`~django.core.exceptions.ValidationError`예외를 제기해야 한다.
pt_br: Para ``to_python()``, se qualquer coisa der errado durante a conversão do valor, deve-se gerar a exceção :exc:`~django.core.exceptions.ValidationError`.
zh_hans: 对于 ``to_python()`` 来说，如果在值转换过程中出现任何问题，你应该抛出一个 :exc:`~django.core.exceptions.ValidationError` 异常。

source: Converting Python objects to query values
it: Convertire oggetti Python in query di valori
ja: Python オブジェクトをクエリ変数に変換する
ko: 파이썬 개체를 질의 값으로 변환하는 중
pt_br: Convertendo objetos Python para valores em queries
zh_hans: 将 Python 转为查询值

source: Since using a database requires conversion in both ways, if you override :meth:`~Field.from_db_value` you also have to override :meth:`~Field.get_prep_value` to convert Python objects back to query values.
it: Poichè l'utilizzo di un database richiede conversioni in entrambi i sensi, se fai override di :meth:`~Field.from_db_value` devi anche fare override di :meth:`~Field.get_prep_value` per riconvertire gli oggetti Python in query values.
ja: データベースを使用するには両方の変換が必要なので、 :meth:`~Field.from_db_value` をオーバーライドする場合は、 :meth:`~Field.get_prep_value` もオーバーライドして Python オブジェクトをクエリの値に戻す必要があります。
ko: 데이터베이스를 사용하려면 두 가지 방식으로 변환해야 하므로 :meth:'~Field.from_value'를 재정의할 경우 :meth:'~Field.get_prep_value'도 재정의해야 Python 개체를 다시 쿼리 값으로 변환할 수 있습니다.

source: If your custom field uses the ``CHAR``, ``VARCHAR`` or ``TEXT`` types for MySQL, you must make sure that :meth:`.get_prep_value` always returns a string type. MySQL performs flexible and unexpected matching when a query is performed on these types and the provided value is an integer, which can cause queries to include unexpected objects in their results. This problem cannot occur if you always return a string type from :meth:`.get_prep_value`.
it: Se il tuo campo custom usa tipi ``CHAR``, ``VARCHAR`` o ``TEXT`` per MySQL, devi assicurarti che :meth:`.get_prep_value` restituisca sempre un tipo stringa. MySQL esegue match flessibili ed inaspettati quando si esegue una query su questi tipi ed il valore che si fornisce è un integer, che può causare l'inclusione di valori inattesi nei risultati. Questo problema non si pone se restituisci sempre un tipo stringa da :meth:`.get_prep_value`.
ja: カスタムフィールドでMySQLの ``CHAR`` 、``VARCHAR`` 、``TEXT`` 型を使用する場合は、 :meth:`.get_prep_value` が常に文字列型を返すようにする必要があります。MySQL はこれらの型に対して整数を指定してクエリを実行したとき、柔軟で想定困難なマッチングを行うため、クエリの結果に予想外のオブジェクトが含まれてしまうことがあります。この問題は :meth:`.get_prep_value` から常に文字列型を返せば発生しません。
ko: 사용자 지정 필드가 MySQL에 대해 "CAR", "VARCHAR" 또는 "TEXT" 유형을 사용하는 경우 :meth:methget_prep_value"가 항상 문자열 유형을 반환하는지 확인해야 한다. 이러한 유형에 대해 쿼리가 수행되고 제공된 값이 정수인 경우 MySQL은 유연하고 예상치 못한 일치를 수행하므로 쿼리에 예기치 않은 개체가 결과에 포함될 수 있습니다. 문자열 유형을 항상 :meth:meth:>get_prep_value'에서 반환하는 경우에는 이 문제가 발생할 수 없습니다.
pt_br: Caso seu campo personalizado use os tipos ``CHAR``, ``VARCHAR`` or ``TEXT`` parao MySQL, assegure que o :meth:`.get_prep_value` sempre retorne um tipo string. O MySQL responde a pesquisa de maneira variável e inesperada quando uma query é executada com estes tipos e o valor fornecido é um inteiro, o que pode resultar em queries qeu contenham objetos inesperados nos seus resultados. Este problema não pode ocorrer se sempre retornar um tipo string do :meth:`.get_prep_value`.
zh_hans: 如果你使用了 MySQL 的 ``CHAR``，``VARCHAR`` 或 ``TEXT`` 类型，你必须确保 :meth:`.get_prep_value` 总是返回一个字符串。在 MySQL 中对这些类型操作时非常灵活，甚至有时超出预期，在传入值为正数时，检出结果可能包含非期望的结果。这个问题不会在你总为 :meth:`.get_prep_value` 返回字符串类型的时候出现。

source: Converting query values to database values
it: Convertire query values in valori di database
ja: クエリの変数をデータベースの変数に変換する
ko: 질의 값을 데이터베이스 값으로 변환하는 중
pt_br: Convertendo valores de queries para valores de banco de dados
zh_hans: 将查询值转为数据库值

source: Some data types (for example, dates) need to be in a specific format before they can be used by a database backend. :meth:`~Field.get_db_prep_value` is the method where those conversions should be made. The specific connection that will be used for the query is passed as the ``connection`` parameter. This allows you to use backend-specific conversion logic if it is required.
it: Alcuni tipi di dato (per esempio, date) devono trovarsi in uno specifico formato prima di poter essere usati da un backend database. :meth:`~Field.get_db_prep_value` è il metodo in cui si dovrebbero effettuare queste conversioni. La connessione specifica che sarà usata per la query è passata come parametro ``connection``. Questo ti permette usare logica specifica del backend per la coversione, se questa è richiesta.
ja: いくつかのデータ型(例えば、日付)はデータベースのバックエンドで使用する前に特定の形式にする必要があります。 :meth:`~Field.get_db_prep_value` はこれらの変換を行うメソッドです。クエリに使用される特定の接続は ``connection`` パラメータとして渡されます。これにより、必要に応じてバックエンド固有の変換ロジックを使用できます。
ko: 일부 데이터 유형(예: 날짜)은 데이터베이스 백엔드에서 사용하려면 특정 형식이어야 합니다. :meth:'~Field.get_db_prep_value'는 이러한 변환을 수행해야 하는 방법입니다. 쿼리에 사용될 구체적인 연결은 "연결" 매개변수로 전달된다. 이렇게 하면 필요한 경우 백엔드별 변환 로직을 사용할 수 있습니다.
pt_br: Alguns tipos de dados (por exemplo datas) precisam estar em um formato específico antes deles poderem ser usados por um "backend" de banco de dados. O :meth:`~Field.get_db_prep_value` é um método onde estas conversões devem ser feitas. A conexão específica que será usada para a query é passada pelo parâmetro ``connection``. Isso lhe possibilita usar a lógica de conversão espeçifica para um backend se isso for necessário.
zh_hans: 某些数据类型（比如 dates）在数据库后端处理前要转为某种特定格式。 :meth:`~Field.get_db_prep_value` 实现了这种转换。查询所以使用的连接由 ``connection`` 参数指定。这允许你在需要时指定后台要求的转换逻辑。

source: For example, Django uses the following method for its :class:`BinaryField`::
it: Per esempio, Django usa il metodo seguente per il suo :class:`BinaryField`::
ja: 例えば、Django は :class:`BinaryField` で以下のメソッドを使います:
ko: 예를 들어, Django는 다음 방법을 사용하여 다음을 수행합니다.:class:`BinaryField`::
pt_br: Por exemplo, o Django usa o seguinte método para isso :class:`BinaryField`::
zh_hans: 例如，Django 为其 :class:`BinaryField` 利用以下方法::

source: In case your custom field needs a special conversion when being saved that is not the same as the conversion used for normal query parameters, you can override :meth:`~Field.get_db_prep_save`.
it: Nel caso che il tuo campo personalizzato richieda una conversione speciale al salvataggio che non sia la stessa usata per i parametri di query, puoi fare override di :meth:`~Field.get_db_prep_save`.
ja: カスタムフィールドを保存する際に、通常のクエリパラメータで使われる変換とは別の特別な変換が必要な場合、 :meth:`~Field.get_db_prep_save` をオーバーライドできます。
ko: 저장 시 일반 쿼리 파라미터에 사용되는 변환과 다른 특수 변환이 필요한 경우 meth:'~Field.db_prep_save'를 재정의할 수 있습니다.
pt_br: No caso do seu campo personalizado precisar de uma conversão especial quando for salvo e isso não é o mesmo que a conversão usada para parâmetros de query, você pode sobrescrever :meth:`~Field.get_db_prep_save`.
zh_hans: 万一自定义字段需要与普通查询参数使用的转换不同的转换规则，你可以重写 :meth:`~Field.get_db_prep_save`。

source: Preprocessing values before saving
it: Pre elaborazione dei valori prima del salvataggio
ja: 保存する前に値を前処理する場合
ko: 저장하기 전에 값 사전 처리
pt_br: Processando valores antes de salvar
zh_hans: 在保存前预处理数值

source: If you want to preprocess the value just before saving, you can use :meth:`~Field.pre_save`. For example, Django's :class:`~django.db.models.DateTimeField` uses this method to set the attribute correctly in the case of :attr:`~django.db.models.DateField.auto_now` or :attr:`~django.db.models.DateField.auto_now_add`.
it: Se vuoi preprocessare il valore proprio prima di salvarlo, puoi sare :meth:`~Field.pre_save`. Per esempio, :class:`~django.db.models.DateTimeField` di Django usa questo metodo per impostare l'attributo correttamente in caso di :attr:`~django.db.models.DateField.auto_now` o :attr:`~django.db.models.DateField.auto_now_add`.
ja: 保存する直前に値を前処理したい場合は :meth:`~Field.pre_save` を使います。例えば、 Django の :class:`~django.db.models.DateTimeField` はこのメソッドを使って、 :attr:`~django.db.models.DateField.auto_now` や :attr:`~django.db.models.DateField.auto_now_add` に正しく属性を設定します。
ko: 저장하기 직전에 값을 사전 처리하려는 경우:meth:`~Field.pre_save`.을 사용할 수 있다. 예를 들어, django 의 :class:`~django.db.models.DateTimeField는 이 메소드를 사용하여 :attr:`~django.db.models.DateField.auto_now` or :attr:`~django.db.models.DateField.auto_now_add`. 의 경우들의 속성을 알맞게 집합한다.
pt_br: Caso queira processar o valor logo antes de salvar, use :meth:`~Field.pre_save`. Por exemplo, o :class:`~django.db.models.DateTimeField` do Django usa este método para atribuir o atributo correto no caso de :attr:`~django.db.models.DateField.auto_now` ou :attr:`~django.db.models.DateField.auto_now_add`.
zh_hans: 如果你要在保存前预处理值，你可以调用 :meth:`~Field.pre_save`。举个例子，Django 的 :class:`~django.db.models.DateTimeField` 在 :attr:`~django.db.models.DateField.auto_now` 或 :attr:`~django.db.models.DateField.auto_now_add` 中利用此方法正确设置属性。

source: If you do override this method, you must return the value of the attribute at the end. You should also update the model's attribute if you make any changes to the value so that code holding references to the model will always see the correct value.
it: Se fai override di questo metodo, alla fine devi restituire il valore dell'attributo. Dovresti anche aggiornare l'attributo del model se fai cambiamenti al valore, così che il codice che abbia riferimenti al model possa sempre vedere il valore corretto.
ja: もしこのメソッドをオーバーライドするならば、最後にその属性の値を返す必要があります。さらに、もしその値になんらかの変更を加えたならば、そのモデルへの参照を含んでいるコードが常に正しい値を指すように、モデルの属性を更新しなくてはなりません。
ko: 이 메서드를 재정의하는 경우 속성 값을 마지막에 반환해야 합니다. 모델에 대한 코드 유지 참조가 항상 올바른 값을 볼 수 있도록 값을 변경한 경우에도 모델의 속성을 업데이트해야 합니다.
pt_br: Caso reescreva este método, é devido retornar o valor do atributo no fim. Deve-se também atualizar o atributo do modelo se houve mudanças no valor para que o código que mantenha referencias ao modelo sempre veja o valor correto.
zh_hans: 如果你重写了此方法，你必须在最后返回该属性的值。如果修改了值，那么你也需要更新模型属性，这样持有该引用的模型总会看到正确的值。

source: Specifying the form field for a model field
it: Specificare il form field per un model field
ja: モデルフィールドのフォームフィールドの指定
ko: 모델필드의 폼필드 명시
pt_br: Especificando o campo de um formulário para o campo de um modelo.
zh_hans: 为模型字段指定表单字段

source: To customize the form field used by :class:`~django.forms.ModelForm`, you can override :meth:`~Field.formfield`.
it: Per personalizzare il campo del form usato da :class:`~django.forms.ModelForm`, puoi fare override di :meth:`~Field.formfield`.
ja: :class:`~django.forms.ModelForm` で使用するフォームフィールドをカスタマイズするには、 :meth:`~Field.formfield` をオーバーライドします。
ko: :class:`~django.forms.ModelForm`, 의 사용할 양식 필드를 사용자 정의하려면:meth:`~Field.formfield`. 오버라이드할수 있다.
pt_br: Para personalizar o campo de formulário usado pelo :class:`~django.forms.ModelForm`, você pode reescrever o :meth:`~Field.formfield`.
zh_hans: 为了自定义 :class:`~django.forms.ModelForm` 使用的表单属性，你必须重写 :meth:`~Field.formfield`。

source: The form field class can be specified via the ``form_class`` and ``choices_form_class`` arguments; the latter is used if the field has choices specified, the former otherwise. If these arguments are not provided, :class:`~django.forms.CharField` or :class:`~django.forms.TypedChoiceField` will be used.
it: La classe del campo del form può essere specificata con gli argomenti ``form_class`` e ``choices_form_class``; il secondo è usato se il campo specifica delle scelte, altrimenti il primo. Se questi argomenti non sono forniti, saranno usati :class:`~django.forms.CharField` or :class:`~django.forms.TypedChoiceField`.
ja: フォームフィールドのクラスは ``form_class`` と ``choices_form_class`` 引数で指定できます。これらの引数を指定しなければ、 :class:`~django.forms.CharField` または :class:`~django.forms.TypedChoiceField` が使用されます。
ko: 양식 필드 클래스는 "form_class"와 "choices_form_class" 인수를 통해 지정할 수 있으며, 필드에는 선택사항이 있는 경우 후자를 사용하고, 그렇지 않은 경우 전자를 사용한다. 이러한 인수가 제공되지 않은 경우 :class:'~django' 입니다.양식.CharField' 또는 :class:'~django' 입니다..TypeedChoiceField'가 사용됩니다.
pt_br: A classe do campo de formulário pode ser especificada via o ``form_class`` e os argumentos de ``choices_form_class``; o último é especificado se o campo tiver opções (choices) especificadas, do contrário o primeiro. Se estes argumentos não são fornecidos, será usada a :class:`~django.forms.CharField` ou :class:`~django.forms.TypedChoiceField`.
zh_hans: 表单字段类能通过 ``form_class`` 和 ``choices_form_class`` 参数指定；如果字段指定了选项，则使用后者，反之前者。若未提供这些参数，将会使用 :class:`~django.forms.CharField` 或 :class:`~django.forms.TypedChoiceField`。

source: All of the ``kwargs`` dictionary is passed directly to the form field's ``__init__()`` method. Normally, all you need to do is set up a good default for the ``form_class`` (and maybe ``choices_form_class``) argument and then delegate further handling to the parent class. This might require you to write a custom form field (and even a form widget). See the :doc:`forms documentation </topics/forms/index>` for information about this.
it: Tutto il dizionario ``kwargs`` viene passato direttamente nel metodo ``__init__()`` del form. Normalmente, tutto quel che devi fare è impostare un buon default per l'argomento ``form_class`` (e magari ``choices_form_class``). Questo ti potrebbe richiedere di scrivere un campo form personalizzato (ed anche un form widget). Vedi :doc:`documentazione dei form </topics/forms/index>` per avere informazioni su questo.
ja: すべての ``kwargs`` 辞書は、フォームフィールドの ``__init__()`` メソッドに直接渡されます。通常、 ``form_class`` ( または ``choices_form_class`` ) 引数に適切なデフォルト値を設定し、それ以降の処理を親クラスに委譲するだけです。そのためには、カスタムフォームフィールド (そしてフォームウィジェット) を書く必要があるかもしれません。これについては :doc:`フォームのドキュメント</topics/forms/index>` を参照してください。
ko: 모든 ``kwags" 사전은 양식장의 ``_init__()" 방식에 직접 전달된다. 보통 당신이 해야 할 일은 ``form_class" (그리고 어쩌면 "choices_form_class") 논쟁에 대한 좋은 디폴트를 설정한 다음 부모 계층에게 더 많은 처리를 위임하는 것이다. 사용자 정의 양식 필드 및 양식 위젯을 작성해야 할 수 있습니다. 자세한 내용은 :doc:'양식 문서'를 참조하십시오.
pt_br: Todos os dicionários ``kwargs`` é passado diretamente para o método `__init__()`` do campo do formulário. Normalmente, tudo o que você precisa fazer é definir um bom padrão para o argumento do ``form_class`` (e talvez ``choices_form_class``) e delegar futuras manipulações para a classe pai. Isso talvez requeira que seja escrito um campo de form personalizado (e mesmo o widget de formulário). Veja o :doc:`forms documentation </topics/forms/index>` para informações sobre isso.
zh_hans: 完整的 ``kwargs`` 被直接传递给表单字段的 ``__init__()`` 方法。一般的，你要做的全部工作就是为 ``form_class`` 参数配置一个合适的默认值，并在随后委托父类处理。这可能要求你编写一个自定义表单字段（甚至表单视图）。查看 :doc:`表单文件材料 </topics/forms/index>` 获取相关信息。

source: Continuing our ongoing example, we can write the :meth:`~Field.formfield` method as::
it: Continuando con il nostro esempio, possiamo scrivere il metodo :meth:`~Field.formfield` come::
ja: 上の例に続き、 :meth:`~Field.formfield` メソッドは次のように書けます:
ko: 계속 예를 들면 :meth:'Field.formfield' 메소드를 다음과 같이 작성할 수 있습니다.
pt_br: Continuando nosso exemplo em andamento, podemos escrever o método :meth:`~Field.formfield` como::
zh_hans: 承接上面的例子，我们能这样编写 :meth:`~Field.formfield` 方法::

source: This assumes we've imported a ``MyFormField`` field class (which has its own default widget). This document doesn't cover the details of writing custom form fields.
it: Questo presume che abbiamo importato una classe per il campo ``MyFormField`` (che ha il proprio widget predefinito). Questo documento non copre i dettagli relativi alla scrittura di form field personalizzati.
ja: これは ``MyFormField`` フィールドクラス (デフォルトのウィジェットを持ちます) のインポートを想定しています。このドキュメントでは、カスタムフォームフィールドの書き方の詳細は説明しません。
ko: 이것은 우리가 (기본 위젯이 있는) ``MyFormField" 필드 클래스를 수입했다고 가정한다. 이 문서에서는 사용자 정의 양식 필드 작성에 대한 세부 정보를 다루지 않습니다.
pt_br: Isso assume que importamos uma classe de campo ``MyModelField`` (o qual tem seu próprio widget padrão). Este documento não cobre os detalhes de escrever um campo de formulário personalizado.
zh_hans: 这假定我们已导入 ``MyFormField`` 字段类（它有默认视图）。本页文档未覆盖编写自定义表单字段的细节。

source: Emulating built-in field types
it: Emulare tipi di campo built-in
ja: 組み込みフィールド・タイプのエミュレート
ko: 내장된 필드 유형 에뮬레이션
pt_br: Emulando tipos de campos internos.
zh_hans: 仿造内置字段类型

source: If you have created a :meth:`.db_type` method, you don't need to worry about :meth:`.get_internal_type` -- it won't be used much. Sometimes, though, your database storage is similar in type to some other field, so you can use that other field's logic to create the right column.
it: Se hai creato un metodo :meth:`.db_type`, non devi preoccuparti del :meth:`.get_internal_type` -- non verrà usato spesso. Qualche volta, però, lo storage del tuo database è di tipo simile a quello di qualche altro campo, quindi puoi usare la logica di quest'altro campo per creare la giusta colonna.
ja: もし :meth:`.db_type` メソッドを作成したのなら、 :meth:`.get_internal_type` はあまり使わないので気にしなくても大丈夫です。しかし、データベースストレージの型は他のフィールドと似ていることがあるので、正しいカラムを作成するために他のフィールドのロジックを使うこともできます。
ko: :meth:methdb_type' method를 생성했다면 :meth:meth:malget_internal_type'에 대해 걱정할 필요가 없습니다. 많이 사용되지 않습니다. 그러나 데이터베이스 저장소의 유형이 다른 필드와 비슷할 때도 있으므로 다른 필드의 논리를 사용하여 올바른 열을 만들 수 있습니다
pt_br: Se você criou um método :meth:`.db_type`, não precisa se preocupar sobre :meth:`.get_internal_type` -- isso não será usado muito. As vezes, porém, seu armazenamento no banco de dados é similar em tipo a outro campo, então você pode usar a lógica deste outro campo para criar a coluna correta.
zh_hans: 若你已创建了 :meth:`.db_type` 方法，你无需担心 :meth:`.get_internal_type` 方法——它并不常用。虽然很多时候，数据库存储行为和其他字段类似，所以你能直接用其它字段的逻辑创建正确的列。

source: No matter which database backend we are using, this will mean that :djadmin:`migrate` and other SQL commands create the right column type for storing a string.
it: Non importa quale database stiamo usando per il backend, questo significa che :djadmin:`migrate` e altri comandi SQL creano il giusto tipo di colonna per il salvataggio di una stringa.
ja: どのデータベースのバックエンドを使用していても、:djadmin:`migrate` やその他のSQLコマンドは文字列を格納するための正しいカラムタイプを作成します。
ko: 어떤 데이터베이스 백엔드를 사용하든, 이것은 :djadmin:'migrate'와 다른 SQL 명령어가 문자열을 저장하기 위한 올바른 열 유형을 생성한다는 것을 의미한다.
pt_br: Não importa qual backend de banco de dados que esteja sendo usado, isso quer dizer que o :djadmin:`migrate` e outros comandos SQL criam o tipo de coluna correto para armazenar uma string.
zh_hans: 无论我们使用了哪个数据库后端， :djadmin:`migrate` 或其它 SQL 命令总会在保存字符串时为其创建正确的列类型。

source: If :meth:`.get_internal_type` returns a string that is not known to Django for the database backend you are using -- that is, it doesn't appear in ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- the string will still be used by the serializer, but the default :meth:`~Field.db_type` method will return ``None``. See the documentation of :meth:`~Field.db_type` for reasons why this might be useful. Putting a descriptive string in as the type of the field for the serializer is a useful idea if you're ever going to be using the serializer output in some other place, outside of Django.
it: Se :meth:`.get_internal_type` ritorna una stringa che non è nota a Django per il database di backend che stai utilizzando -- cioè, non appare in ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- la stringa sarà ugualmente usata dal serializzatore, ma il metodo di default :meth:`~Field.db_type` ritornerà ``None``. Vedi la documentazione di :meth:`~Field.db_type` per capire i motivi per cui questo potrebbe essere utile. Inserire una stringa descrittiva come tipo del campo per il serializzatore è una buona idea semmai dovessi usare l'output del serializzatore da qualche altra parte, al di fuori di Django.
ja: もし :meth:`.get_internal_type` が、使用しているデータベースのバックエンドで Django が知らない文字列 (つまり、``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` にない文字列) を返した場合、シリアライザはその文字列を使用しますが、デフォルトの :meth:`~Field.db_type` メソッドは ``None`` を返します。これが便利な理由は :meth:`~Field.db_type` のドキュメントを参照してください。シリアライザのフィールドの型として説明的な文字列を入れるのは、シリアライザの出力を Django 以外の他の場所で使う場合に便利なアイデアです。
ko: :meth :meth:malcget_internal_type'이 사용 중인 데이터베이스 백엔드에 대해 Django에 알 수 없는 문자열을 반환하는 경우 즉, "django.db.backends"에는 나타나지 않습니다.base.DataWrapper.data_types' -- 이 문자열은 직렬화기에서 계속 사용되지만 기본값인 meth:'~Field.db_type' 메서드는 "없음"을 반환합니다. 유용한 이유는 :meth:'~Field.db_type' 문서를 참조하십시오. 설명 문자열을 직렬화기의 필드 유형으로 삽입하는 것은 Django 이외의 다른 위치에서 직렬화기 출력을 사용할 경우에 유용합니다.
pt_br: Se o :meth:`.get_internal_type` retorna uma string que não é conhecida para o Django para o backend de banco de dados que está sendo usado -- que é, ele não aparece no ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` -- a string ainda será usada pelo serializador, mas o método padrão :meth:`~Field.db_type` retornará ``None``. Veja a documentação do :meth:`~Field.db_type` pelas razões pelas quais este talvez seja útil.
zh_hans: 若 :meth:`.get_internal_type` 返回了当前数据库后端（即 ``django.db.backends.<db_name>.base.DatabaseWrapper.data_types`` 中未出现的后端）无法理解的字符串——该字符串仍会被序列化器使用的，但是默认的 :meth:`~Field.db_type` 方法会返回 ``None``。查阅文档 :meth:`~Field.db_type` 了解为啥有用。如果您打算在 Django 之外的其他地方使用序列化器输出，那么将描述性字符串作为序列化器的字段类型是一个有用的想法。

source: Converting field data for serialization
it: Conversione dei dati del campo per la serializzazione
ja: シリアライズするためにフィールドデータを変換する場合
ko: 직렬화를 위한 필드 데이터 변환
pt_br: Convertendo dado do campo para serialização
zh_hans: 为序列化转换字段数据

source: To customize how the values are serialized by a serializer, you can override :meth:`~Field.value_to_string`. Using :meth:`~Field.value_from_object` is the best way to get the field's value prior to serialization. For example, since ``HandField`` uses strings for its data storage anyway, we can reuse some existing conversion code::
it: Per personalizzare il modo in cui i valori vengono serializzati da un serializzatore, puoi fare l'override di :meth:`~Field.value_to_string`. Usare :meth:`~Field.value_from_object` è il modo migliore di ottenere il valore del campo prima della serializzazione. Ad esempio, dato che ``HandField`` usa delle stringhe per il salvataggio dei dati, possiamo riutilizzare una parte del codice di conversione esistente.
ja: シリアライザによる値のシリアライズ方法をカスタマイズするには、 :meth:`~Field.value_to_string` をオーバーライドします。 :meth:`~Field.value_from_object` を使うのは、シリアライズの前にフィールドの値を取得する最も良い方法です。例えば、 ``HandField`` はデータの保存に文字列を使うので、既存の変換コードを再利用できます:
ko: 일련 번호에 의해 값이 직렬화되는 방식을 사용자 정의하기 위해 meth:'~Field.value_to_string'을 재정의할 수 있습니다. :meth:'~Field.value_from_object'를 사용하면 직렬화 전에 필드 값을 얻을 수 있습니다. 예를 들어 "핸드필드"는 어쨌든 데이터 스토리지에 문자열을 사용하기 때문에 다음과 같은 기존 변환 코드를 재사용할 수 있다.
zh_hans: 自定义序列化器序列化值的流程，你要重写 :meth:`~Field.value_to_string`。使用 :meth:`~Field.value_to_string` 是在序列化之前获取字段值的最佳方法。举个例子，由于 ``HandField`` 使用字符串存储数据，我们能复用一些已有代码::

source: Some general advice
it: Alcuni consigli generali
ja: 一般的なアドバイス
ko: 일반적인 조언
pt_br: Alguns avisos gerais
zh_hans: 一些通用建议
