Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: Fixtures are also used by the :ref:`testing framework <topics-testing-fixtures>` to help set up a consistent test environment.
it: Le fixtures sono anche usate dal :ref:`framework di test <topics-testing-fixtures>` come ausilio per approntare un ambiente di test consistente.
ja: フィクスチャは :ref:`テストフレームワーク <topics-testing-fixtures>` でも利用でき、テスト環境の一貫性を保つのに役立ちます。
ko: 또한 :ref:'testing framework'에서는 고정장치를 사용하여 일관된 테스트 환경을 설정할 수 있습니다.
pt_br: As "Fixtures" são também usadas pelo :ref:`testing framework <topics-testing-fixtures>` para auxiliar na configuração de um ambiente de teste consistente.
zh_hans: 固定内容通常备 :ref:`测试框架 <topics-testing-fixtures>` 用于创建永久的测试环境。

source: How to integrate Django with a legacy database
it: Come integrare Django con un database legacy
ja: レガシーなデータベースと Django の統合

source: While Django is best suited for developing new applications, it's quite possible to integrate it into legacy databases. Django includes a couple of utilities to automate as much of this process as possible.
it: Mentre Django è adatto a sviluppare nuove applicazioni, e tuttavia possibile integrarlo con database obsoleti. Django include alcuni strumenti per automatizzare il più possibile il processo.
ja: Django は新しいアプリケーションを開発するのに最適ですが、レガシーなデータベースと統合することも可能です。Django には、それを自動化するいくつかのユーティリティが含まれています。
ko: Django는 새로운 애플리케이션을 개발하는 데 가장 적합하지만, 기존 데이터베이스에 통합하는 것이 가능합니다. Django에는 이 프로세스를 최대한 자동화하기 위한 몇 가지 유틸리티가 포함되어 있습니다.
pt_br: Enquanto o Django é melhor para desenvolver novas aplicações, é possível integrá-lo a um banco de dados existente. O Django inclue algumas ferramentas para automatzar tanto quanto possível o processo.
zh_hans: 虽然 Django 很适合开发新应用，但也能用它集成旧数据库。Django 包含了一整套套件来尽可能自动处理类似的任务。

source: This document assumes you know the Django basics, as covered in the :doc:`tutorial </intro/tutorial01>`.
it: Questo documento presume che tu sappia le basi di Django, come ?descritto? nella sezione :doc:`tutorial </intro/tutorial01>`.
ja: このドキュメントは :doc:`チュートリアル </intro/tutorial01>` に書かれているような、Django についての基本的な知識を持っていることを想定しています。
ko: 이 문서에서는 :doc:'tutorial'에서 설명한 대로 Django 기본 사항을 알고 있다고 가정합니다.
pt_br: Este documento assume que você conhece o básico de django, como coberto em :doc:`tutorial </intro/tutorial01>`.
zh_hans: 本文假设你有 Django 基础，基础内容由 :doc:`教程 </intro/tutorial01>` 介绍。

source: Once you've got Django set up, you'll follow this general process to integrate with an existing database.
it: Una volt che hai configurato Django, puoi seguire questo processo indicativo per integrarlo con un database esistente.
ja: Django のセットアップが完了したら、次の一般的なプロセスに従うことで、既存のデータベースと統合することができます。
ko: Django를 설정하면 이 일반 프로세스에 따라 기존 데이터베이스와 통합됩니다.
pt_br: Uma vez que tenha o Django configurado, seguirá este processo geral para integrar com o banco de dados existente.
zh_hans: 你配置完 Django 后，你就能跟着此常规操作去集成旧数据库了。

source: Give Django your database parameters
it: Dai a Django i tuoi parametri del database
ja: Django に既存データベースのパラメータを与える
ko: Django에게 데이터베이스 매개 변수를 제공하십시오.
pt_br: Forneça ao Django os parâmetros do seu banco de dados.
zh_hans: 将数据库参数告诉 Django

source: You'll need to tell Django what your database connection parameters are, and what the name of the database is. Do that by editing the :setting:`DATABASES` setting and assigning values to the following keys for the ``'default'`` connection:
it: Dovrai dire a Django quali sono i parametri di connessione al tuo database e quale sia il nome del database. Fallo modificando l'impostazione :setting:`DATABASES` ed assegnando valori alle seguenti chiavi per la connessione ``'default'``:
ja: まず、Django に既存のデータベース接続のパラメータとデータベースの名前を教えてあげる必要があります。そのために、設定ファイルの :setting:`DATABASES` を編集して、``'default'`` 接続の以下のキーに対して値を設定します。
ko: 데이터베이스 연결 매개 변수가 무엇이고 데이터베이스 이름이 무엇인지 Django에게 알려야 합니다. 다음과 같은 설정을 편집하여 작업을 수행합니다.'데이터베이스' 설정 및 "기본값" 연결을 위해 다음 키에 값을 할당합니다.
pt_br: Você precisa informar ao Django quais são ps parâmetros de conexão do seu banco de dados, e o nome do banco de dados. Faça isso editando a definição :setting:`DATABASES` e assinalando os valores das seguintes chaver para a conexão ``'default'``:
zh_hans: 你需要告诉 Django 数据库连接参数和数据库名称。通过编写 :setting:`DATABASES` 配置项并为 ``'默认'`` 连接指定下列值：

source: Auto-generate the models
it: Generazione automatica dei modelli
ja: モデルを自動生成する
ko: 자동으로 생성된 모델
pt_br: Criar automaticamente os modelos
zh_hans: 自动生成这些模型

source: Django comes with a utility called :djadmin:`inspectdb` that can create models by introspecting an existing database. You can view the output by running this command:
ja: Django には :djadmin:`inspectdb` と呼ばれるユーティリティが付属しており、既存のデータベースを調査することでモデルを作成できます。次のコマンドを実行すると出力が表示できます。

source: Save this as a file by using standard Unix output redirection:
ja: 通常の Unix 出力のリダイレクトにより、ファイルとして保存します。

source: This feature is meant as a shortcut, not as definitive model generation. See the :djadmin:`documentation of inspectdb <inspectdb>` for more information.
it: Questa caratteristica è intesa come shortcut, non come generazione definitiva di un modello. Vedi la :djadmin:`documentazione di inspectdb <inspectdb>` per avere più informazioni.
ja: この機能は最終的なモデル生成ではなく、ショートカットとしての手段です。さらなる情報は、:djadmin:`documentation of inspectdb <inspectdb>` を参照してください。
ko: 이 기능은 결정적인 모델 생성이 아닌 바로 가기 기능을 의미합니다. 자세한 내용은 :djadmin:'inspectdb' 설명서를 참조하십시오.
pt_br: Este comandoé um atalho, não um gerador de modelos definitivos. Veja o :djadmin:`documentation of inspectdb <inspectdb>` para mais informações.
zh_hans: 该功能仅是一个快捷方式，不是最佳的创建模型的方法。参考 :djadmin:`inspectdb 文档 <inspectdb>` 获取更多信息。

source: Once you've cleaned up your models, name the file ``models.py`` and put it in the Python package that holds your app. Then add the app to your :setting:`INSTALLED_APPS` setting.
it: Una volta che hai ripulito i modelli, nomina il file ``models.py`` e mettilo nel package Python che accoglie la tua applicazione. Poi aggiungi l'applicazione alla tua impostazione :setting:`INSTALLED_APPS`.
ja: モデルをクリーンアップしたら、ファイルを ``models.py`` と名付け、アプリが含まれる Python パッケージの中に配置します。そして、アプリを :setting:`INSTALLED_APPS` の設定に追加します。
ko: 모델을 정리했으면 파일의 이름을 "모델"로 지정하십시오.py'를 앱이 들어 있는 python 패키지에 넣어주세요. 그런 다음 앱을 :seting:'에 추가합니다.설치되었습니다.APPs의 설정입니다.
pt_br: Uma vez que tenha limpado seus modelos, nomeie arquivo ``models.py``e coloque-o no pacote Python que contém sua aplicação. Entã adicione a app dentro da sua definição de :setting:`INSTALLED_APPS`.
zh_hans: 只要你整理完这些模型，就可以将文件重命名为 ``models.py`` 并将其放入持有应用的 Python 包中。随后，将应用添加至 :setting:`INSTALLED_APPS` 配置。

source: By default, :djadmin:`inspectdb` creates unmanaged models. That is, ``managed = False`` in the model's ``Meta`` class tells Django not to manage each table's creation, modification, and deletion::
it: Di default, :djadmin:`inspectdb` crea modelli unmanaged. Cioè, ``managed = False`` nel ``Meta`` del modello dice a Django di non gestire la creazione, la modifica e la cancellazione di ogni tabella::
ja: デフォルトでは、:djadmin:`inspectdb` は未管理 (unmanaged) なモデルを作成します。つまり、モデルの ``Meta`` クラス内の ``managed = False`` により、Django はテーブルの作成・変更・削除を管理しなくなります。
ko: 기본적으로 :djadmin:'inspectdb'는 관리되지 않는 모델을 생성합니다. 즉, 모델의 ``메타" 클래스에 있는 ``관리된 = False"는 Django에게 각 테이블의 생성, 수정 및 삭제를 관리하지 말라고 말합니다.
pt_br: Por padrão, o :djadmin:`inspectdb` cria modelos não gerenciáveis. Quer dizer, ``managed = False`` na ``Meta`` classe do modelo, diz ao Django para não gerenciar a criação, modificação e deleção de cada tabela::
zh_hans: 默认情况下， :djadmin:`inspectdb` 创建未托管的模型。也就是说，模型的 `Meta`` 类中的 ``managed = False`` 告诉 Django 不要管理这些表的创建，修改和删除::

source: If you do want to allow Django to manage the table's lifecycle, you'll need to change the :attr:`~django.db.models.Options.managed` option above to ``True`` (or remove it because ``True`` is its default value).
it: Se non vuoi permettere a Django di gestire il ciclo di vita della tabella, avrai bisogno di cambiare l'opzione :attr:`~django.db.models.Options.managed` di cui sopra a ``True`` (o rimuoverlo perchè ``True`` è il valore predefinito).
ja: Django にテーブルのライフサイクルの管理を行ってほしい場合、上記の :attr:`~django.db.models.Options.managed` オプションを ``True`` に設定 (あるいは、``True`` がデフォルト値なので削除) できます。
ko: Django가 테이블의 라이프사이클을 관리하도록 허용하려면 :attr:'~django.db.models를 변경해야 합니다.위의 옵션.managed는 "True"에 대한 옵션(또는 "True"가 기본값이기 때문에 제거)을 의미합니다.

source: Install the core Django tables
it: Installa le tabelle di base di Django
ja: core Django テーブルのインストール
ko: 코어 Django 테이블을 설치합니다
pt_br: Instalando as Tabelas do núcleo do Django.
zh_hans: 安装核心 Django 表

source: Next, run the :djadmin:`migrate` command to install any extra needed database records such as admin permissions and content types:
ja: 次に、:djadmin:`migrate` コマンドを実行すると、追加で必要な admin 権限などのデータベースレコードがインストールされます。

source: Test and tweak
it: Test ed aggiustamenti
ja: テストと修正
ko: 테스트 및 조정하십시오.
pt_br: Teste e ajustes
zh_hans: 测试和调整

source: Those are the basic steps -- from here you'll want to tweak the models Django generated until they work the way you'd like. Try accessing your data via the Django database API, and try editing objects via Django's admin site, and edit the models file accordingly.
it: Questi sono i passi base -- da qui potrai voler mettere a punto i modelli che Django ha generato finchè non funzionano come vuoi. Prova ad accedere ai tuoi dati con l'API del database di Django e prova a modificare gli oggetti con il sito di amministrazione di Django ed a modificare i modelli in accordo.
ja: 以上は基本的なステップです。ここからは、Django が生成したモデルを期待通りに動作するようになるまで微調整することになるでしょう。必要に応じて、Django データベース API 経由でデータにアクセスしたり、Django の admin サイトで objects を編集したり、models ファイルを編集してみてください。
ko: 이것이 기본 단계입니다. 여기서 Django가 만든 모델을 원하는 방식으로 작동할 때까지 수정해야 합니다. Django 데이터베이스 API를 통해 데이터에 액세스하고 Django의 관리 사이트를 통해 개체를 편집한 다음 그에 따라 모델 파일을 편집하십시오.
pt_br: Estes são os passos básicos -- daqui em diante você irá querer ajustar os modelos que o Django gerou até que funcionem do jeito que você goste. Tente acessar seus dados através da API de banco de dados do Django, e tente editá-los via o site admin do Django, e edite o arquivo de modelo de acordo.
zh_hans: 这些是基本步骤——这样，你就能调整 Django 生成的模型，直到他们达到你的要求。试着通过 Django 数据库 API 访问数据，试着通过 Django 后台站点编辑数据，也可以直接编辑模型文件。

source: How to configure and use logging
it: Come configurare ed utilizzare i log
ja: ロギングの設定と利用

source: :ref:`Django logging reference <logging-ref>`
it: :ref:`riferimento del sistema di logging di Django <logging-ref>`
ja: :ref:`Django のロギング リファレンス <logging-ref>`

source: :ref:`Django logging overview <logging-explanation>`
it: :ref:`Panoramica del logging di Django <logging-explanation>`
ja: :ref:`Django のロギングの概要 <logging-explanation>`

source: Django provides a working :ref:`default logging configuration <default-logging-configuration>` that is readily extended.
it: Django offre una :ref:`configurazione predefinita di logging <default-logging-configuration>` funzionante che può essere prontamente estesa.
ja: Django はそのままで動作する :ref:`デフォルトのロギング設定 <default-logging-configuration>` を持っており、すぐに拡張可能です。

source: Make a basic logging call
it: Esegui una chiamata di base al sistema di log
ja: 基本的なロギング呼び出しを作成する

source: To send a log message from within your code, you place a logging call into it.
it: Per inviare un messaggio di log dal tuo codice, inserisci una chiamata di logging.
ja: ログメッセージをコード内から送信するには、コードにロギングの呼び出しを書く必要があります。

source: Don't be tempted to use logging calls in ``settings.py``.
it: Non utilizzare le chiamate al sistema di log all'interno di ``settings.py``.
ja: ``settings.py`` でログ呼び出しを使用しようとしないでください。

source: The way that Django logging is configured as part of the ``setup()`` function means that logging calls placed in ``settings.py`` may not work as expected, because *logging will not be set up at that point*. To explore logging, use a view function as suggested in the example below.
it: Il modo in cui il logging di Django è configurato come parte della funzione ``setup()`` significa che le chiamate di logging poste in ``settings.py`` potrebbero non funzionare come ci si aspetta, perchè *il logging non sarà pronto a quel punto*. Per esplorare il logging, usa una funzione di view come suggerito nell'esempio qui sotto.
ja: Django のロギングは ``setup()`` 関数の一部として設定されるため、 ``settings.py`` でロギングを呼び出しても期待通りに動作しないかもしれません。ロギングを調べるには、以下の例で推奨されているようにビュー関数を使用してください。

source: First, import the Python logging library, and then obtain a logger instance with :py:func:`logging.getLogger`. Provide the ``getLogger()`` method with a name to identify it and the records it emits. A good option is to use ``__name__`` (see :ref:`naming-loggers` below for more on this) which will provide the name of the current Python module as a dotted path::
it: Prima, importa la libreria di logging di Python e poi ottieni una istanza di logger con :py:func:`logging.getLogger`. Fornisci il metodo ``getLogger()`` con un nome che lo identifica ed i record che emette. Una buona opzione è usare ``__name__`` (vedi :ref:`naming-loggers` qui sotto per saperne di più) che offrirà il nome del modulo Python corrente come percorso puntato::
ja: まず、Python の logging ライブラリをインポートし、:py:func:`logging.getLogger` でロガーのインスタンスを取得します。``getLogger()`` メソッドに、ロガーとロガーが出力するレコードを識別するための名前を指定します。そのための良い方法は ``__name__`` を使用することです (これについては以下の :ref:`naming-loggers` を参照してください)。これは、次のように、現在の Python モジュールの名前をドット区切りのパスで返します。

source: It's a good convention to perform this declaration at module level.
it: E' una buona convenzione eseguire questa dichiarazione a livello di modulo.
ja: この宣言はモジュール・レベルで行うのがよいとされています。

source: And then in a function, for example in a view, send a record to the logger::
it: E quindi in una funzione, per esempio in una vista, invia un record al sistema di logging::
ja: そして、ビューなどの関数内で、logger にレコードを送信します。

source: When this code is executed, a :py:class:`~logging.LogRecord` containing that message will be sent to the logger. If you're using Django's default logging configuration, the message will appear in the console.
it: Quando questo codice viene eseguito, verrà inviato al logger un :py:class:`~logging.LogRecord` contenente quel messaggio. Se stai usando la configurazione di logging predefinita di Django, il messaggio apparirà sulla console.
ja: このコードが実行されると、そのメッセージを含む :py:class:`~logging.LogRecord` が logger に送られます。Django のデフォルトの logging 設定を使っている場合、メッセージはコンソールに表示されます。

source: The ``WARNING`` level used in the example above is one of several :ref:`logging severity levels <topic-logging-parts-loggers>`: ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, ``CRITICAL``. So, another example might be::
it: Il livello ``WARNING`` usato nell'esempio qui sopra è uno dei molti :ref:`livelli di severità del logging <topic-logging-parts-loggers>`: ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, ``CRITICAL``. Così, un altro esempio potrebbe essere::
ja: 上の例で使われている ``WARNING`` レベルは、いくつかある :ref:`ログの重大度レベル <topic-logging-parts-loggers>`: ``DEBUG``, ``INFO``, ``WARNING``, ``ERROR``, ``CRITICAL`` の一つです。したがって、別の例は次のようになります。

source: Records with a level lower than ``WARNING`` will not appear in the console by default. Changing this behavior requires additional configuration.
it: I record con un livello più basso di ``WARNING`` non appariranno in console di default. Cambiare questo comportamento richiede configurazioni aggiuntive.
ja: ``WARNING`` より低いレベルのレコードはデフォルトではコンソールに表示されません。この動作を変更するには追加の設定が必要です。

source: Customize logging configuration
it: Personalizza la configurazione del sistema di log
ja: ロギングの設定をカスタマイズする

source: Although Django's logging configuration works out of the box, you can control exactly how your logs are sent to various destinations - to log files, external services, email and so on - with some additional configuration.
it: Anche se la configurazione di logging di Django funziona da sè, puoi controllare esattamente come i tuoi log sono inviati a varie destinazioni - ai file di log, servizi esterni, email e così via - con qualche configurazione aggiuntiva.
ja: Djangoのロギング設定は初期状態で動作しますが、追加の設定を行うことで、ログを様々な宛先（ログファイル、外部サービス、メールなど）に送信するのを正確にコントロールできます。

source: You can configure:
it: Puoi configurare:
ja: 以下のものを設定できます。

source: logger mappings, to determine which records are sent to which handlers
it: la mappatura del logger, per determinare quale record deve essere inviato a quale gestore
ja: どのレコードがどのハンドラに送られるかを決定するためのロガーマッピング

source: handlers, to determine what they do with the records they receive
it: i gestori, per determinare cosa devono fare con i log che ricevono
ja: 受け取ったレコードをどう処理するかを決めるハンドラー

source: filters, to provide additional control over the transfer of records, and even modify records in-place
it: i filtri, per fornire un controllo addizionale sul trasferimento dei record e eventualmente per effettuare delle modifiche al volo
ja: レコードの転送をさらにコントロールし、レコードをその場で変更することもできるフィルタ

source: formatters, to convert :class:`~logging.LogRecord` objects to a string or other form for consumption by human beings or another system
it: formattatori, per convertire oggetti :class:`~logging.LogRecord` a stringa o altre forme per il consumo da parte degli umani o di un altro sistema.
ja: :class:`~logging.LogRecord` オブジェクトを、人間や他のシステムで利用できるように文字列や他の形式に変換するためのフォーマッタ

source: There are various ways of configuring logging. In Django, the :setting:`LOGGING` setting is most commonly used. The setting uses the :ref:`dictConfig format <logging-config-dictschema>`, and extends the :ref:`default logging configuration <default-logging-definition>`.
it: Ci sono diversi modi di configurare il logging. In Django, l'impostazione :setting:`LOGGING` viene usata più comunemente. L'impostazione usa il :ref:`formato dictConfig <logging-config-dictschema>` ed estende la :ref:`configurazione di logging di default <default-logging-definition>`.
ja: ロギングの設定には様々な方法があります。Django では、 :setting:`LOGGING` 設定が最もよく使われます。この設定は :ref:`dictConfig フォーマット <logging-config-dictschema>` を使い、 :ref:`デフォルトのロギング設定<default-logging-definition>` を拡張します。

source: See :ref:`configuring-logging` for an explanation of how your custom settings are merged with Django's defaults.
it: Vedi :ref:`configuring-logging` per una spiegazione di come le tue impostazioni personalizzate vengono fuse con le impostazioni predefinite di Django.
ja: カスタム設定が Django のデフォルトとどのようにマージされるかについては :ref:`configuring-logging` を参照してください。

source: See the :mod:`Python logging documentation <python:logging.config>` for details of other ways of configuring logging. For the sake of simplicity, this documentation will only consider configuration via the ``LOGGING`` setting.
it: Vedi la :mod:`documentazione del logging di Python <python:logging.config>` per avere dettagli su altri modi di configurare il logging. Per amor di semplicità, questa documentazione considererà solamente la configurazione tramite l'impostazione ``LOGGING``.
ja: その他のロギングの設定方法の詳細については :mod:`Python logging documentation <python:logging.config>` を参照してください。簡単にするために、このドキュメントでは ``LOGGING`` 設定による設定のみを考えます。

source: Basic logging configuration
it: Configurazione di base del sistema di log
ja: ロギングの基本的な設定

source: When configuring logging, it makes sense to
it: Quando si configurano i log, ha senso fare
ja: ロギングを設定する場合、以下のようにします。

source: Create a ``LOGGING`` dictionary
it: Creare un dizionario di ``LOGGING``
ja: ``LOGGING`` 辞書を作成する

source: In your ``settings.py``::
it: Nel tuo ``settings.py``::
ja: ``settings.py`` に以下を追加します:

source: It nearly always makes sense to retain and extend the default logging configuration by setting ``disable_existing_loggers`` to ``False``.
it: Ha quasi sempre senso trattenere ed estendere la configurazione di logging predefinita impostando ``disable_existing_loggers`` a ``False``.
ja: ほとんどの場合、 ``disable_existing_loggers`` を ``False`` に設定することで、デフォルトのロギング設定を保持し、拡張できます。

source: Configure a handler
it: Configura un gestore
ja: ハンドラを設定する

source: This example configures a single handler named ``file``, that uses Python's :class:`~logging.FileHandler` to save logs of level ``DEBUG`` and higher to the file ``general.log`` (at the project root):
it: Questo esempio configura un singolo handler chiamato ``file``, che usa il :class:`~logging.FileHandler` di Python per salvare i log con livello ``DEBUG`` e superiore sul file ``general.log`` (nella radice del progetto):
ja: この例では、Python の :class:`~logging.FileHandler` を使って、レベル ``DEBUG`` 以上のログを (プロジェクトルート内の) ``general.log`` ファイルに保存する ``file`` という名前のハンドラを設定します:

source: Different handler classes take different configuration options. For more information on available handler classes, see the :class:`~django.utils.log.AdminEmailHandler` provided by Django and the various :py:mod:`handler classes <logging.handlers>` provided by Python.
it: Differenti classi handler accettano differenti opzioni di configurazione. Per avere più informazioni sulle classi handler disponibili, vedi :class:`~django.utils.log.AdminEmailHandler`, fornita da Django e le varie various :py:mod:`classi handler <logging.handlers>` fornite da Python.
ja: 異なるハンドラクラスは異なる設定オプションを取ります。利用可能なハンドラクラスの詳細については、 Django が提供する :class:`~django.utils.log.AdminEmailHandler` や Python が提供する様々な :py:mod:`handler class <logging.handlers>` を参照してください。

source: Logging levels can also be set on the handlers (by default, they accept log messages of all levels). Using the example above, adding:
it: I livelli di log possono essere anche configurati sul gestore (di default, accettano log di tutti i livelli). Usando l'esempio precedente, aggiungendo:
ja: ログレベルはハンドラで設定することもできます（デフォルトでは、ハンドラはすべてのレベルのログメッセージを受け取ります）。上の例を使うと、次のように書けます:

source: would define a handler configuration that only accepts records of level ``DEBUG`` and higher.
it: definirebbe una configurazione di gestione che accetta solo record di livello ``DEBUG`` e superiore.
ja: これで、レベル ``DEBUG`` 以上のレコードだけを受け付けるようにハンドラを設定できます。

source: Configure a logger mapping
it: Configura la mappatura del sistema di log
ja: ロガーマッピングを設定する

source: To send records to this handler, configure a logger mapping to use it for example:
it: Per inviare record a questo handler, configurare una mappatura del logger per usarlo ad esempio:
ja: このハンドラにレコードを送信するには、ロガーマッピングをそのハンドラを使うように設定します。例えば:

source: The mapping's name determines which log records it will process. This configuration (``''``) is *unnamed*. That means that it will process records from *all* loggers (see :ref:`naming-loggers` below on how to use the mapping name to determine the loggers for which it will process records).
it: Il nome del mapping determina quali record di log elaborerà. Questa configurazione (``''``) è *senza nome*. Questo significa che elaborerà record da *tutti* i logger (vedi :ref:`naming-loggers` qua sotto per sapere come usare il nome di mapping per determinare i logger per i quali processerà i record).
ja: マッピングの名前はどのログレコードを処理するかを決定します。この設定 (``""``) は *無名* です。つまり、 *すべての* ロガーからのレコードを処理します（レコードを処理するロガーを決定するためにマッピング名を使用する方法については、以下の :ref:`naming-loggers` を参照してください）。

source: It will forward messages of levels ``DEBUG`` and higher to the handler named ``file``.
it: Questo inoltrerà i messaggi di livello ``DEBUG`` e superiore all'handler chiamato ``file``.
ja: これは ``DEBUG`` レベル以上のメッセージを ``file`` というハンドラーに転送します。

source: Note that a logger can forward messages to multiple handlers, so the relation between loggers and handlers is many-to-many.
it: Nota che un logger può inoltrare messaggi a più gestori, così la relazione tra logger e gestori è molti-a-molti.
ja: ロガーは複数のハンドラーにメッセージを転送できるので、ロガーとハンドラーの関係は多対多であることに注意してください。

source: If you execute::
it: Se esegui::
ja: このコードを実行したら、:

source: in your code, you will find that message in the file ``general.log`` in the root of the project.
it: nel tuo codice, troverai quel messaggio nel file ``general.log`` nella radice del progetto.
ja: プロジェクトルートの ``general.log`` ファイルにそのメッセージが保存されるでしょう。

source: Configure a formatter
it: Configurare un formatter
ja: フォーマッタを設定する
