Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/howto.po
Languages: it, ja, ko, pt_br, zh_hans

source: If you use some other installation process, you might have to manually :ref:`uninstall the old Django version <removing-old-versions-of-django>` and should look at the complete installation instructions.
pt_br: Se você usa outros processos de instalação, tavez seja necessário manualmente :ref:`desinstalar a versão antig do Django <removing-old-versions-of-django>` e deve dar uma olhada nas instruções completas de instalação.

source: When the new environment is set up, :doc:`run the full test suite </topics/testing/overview>` for your application. In Python 2.7+, deprecation warnings are silenced by default. It is useful to turn the warnings on so they are shown in the test output (you can also use the flag if you test your app manually using ``manage.py runserver``):
pt_br: Quando o novo ambiente é configurado, :doc:`rode a aplicação de teste completa </topics/testing/overview>` para sua aplicação. No Python 2.7+, os alertas sobre descontinuidade são desligados por padrão. É útil ligar os alertas para que eles sejam mostrados nas saídas dos testes (você pode também usar os parâmetros se você testa sua aplicação manualmente usando ``manage.py runserver``):

source: This document will guide you through installing Python 3.5 and Django on Windows. It also provides instructions for installing `virtualenv`_ and `virtualenvwrapper`_, which make it easier to work on Python projects. This is meant as a beginner's guide for users working on Django projects and does not reflect how Django should be installed when developing patches for Django itself.
pt_br: este documento irá lhe guiar através da instalação do Python 3.5 e Django no Windows. Ele também fornece instruções para instalar o `virtualenv`_ e `virtualenvwrapper`_, os quais facilitam trabalhar com projetos Python. Ele serve como um guia de iniciantes para os usuários trabalhando em projetos Django e não reflete como o Django deveria ser instalado quando for para desenvolver "patches" para o próprio Django.
zh_hans: 本文会通过安装在 Windows 上安装 Python 3.5 和 Django 指导你。同时也提供了关于安装 `virtualenv`_ 和 `virtualenvwrapper` 的介绍，它们使得编写 Python 工程变的非常简单。这是为从事 Django 项目的用户提供的入门指南，而介绍为 Django 本身开发补丁时该如何安装 Django。

source: The steps in this guide have been tested with Windows 7, 8, and 10. In other versions, the steps would be similar. You will need to be familiar with using the Windows command prompt.
pt_br: Os passos para este guia foram testados no windows 7, 8, e 10. Em outras versões, os passos devem ser similares. Você deve estar familiarizado com o uso da linha de comando do Windows.
zh_hans: 下列步骤已在 Windows 7, 8 和 10 上测试通过。其它版本上，步骤类似。你需要熟悉如何使用 Windows 的命令提示符。

source: Django is a Python web framework, thus requiring Python to be installed on your machine. At the time of writing, Python 3.5 is the latest version.
pt_br: Django é um framework web Python, então requer que o Python seja instalado no computador. Enquanto escrevo, o Python 3.5 é a última versão.
zh_hans: Django 是一个 Python Web 框架，因此需要在您的机器上安装 Python。在本文撰写时，Python 最新的版本是 3.5。

source: To install Python on your machine go to https://python.org/downloads/. The website should offer you a download button for the latest Python version. Download the executable installer and run it. Check the box next to ``Add Python 3.5 to PATH`` and then click ``Install Now``.
pt_br: Para instalar o Python na sua máquina acesse https://python.org/downloads/. O site web deve oferecer um botão para baixar a última versão do Python. Baixe o executável do instalador e execute-o. Selecione a opçao próximo a ``Add Python 3.5 to PATH`` e então clique ``Install Now``.
zh_hans: 为了把 Python 安装到你的机器上，请打开https://python.org/downloads/。这个网站应该为你提供了一个最新的 Python 版本的下载按钮。下载可执行安装包并且运行它。运行后，选择把 ``Python 3.5 添加到环境变量`` ，然后点击``马上安装``。

source: `pip`_ is a package manage for Python. It makes installing and uninstalling Python packages (such as Django!) very easy. For the rest of the installation, we'll use ``pip`` to install Python packages from the command line.
pt_br: O `pip`_ é o gerenciador de pacotes do Python. Ele faz com que instalar e desinstalar pacotes Python (tal como Django) muito fácil. Para o resto da instalação, usaremos o ``pip`` para instalar pacotes Python da linha de comando.
zh_hans: `pip`_ 是 Python 的包管理器。它使得 Python 包（例如 Django）的安装和卸载变的非常简单。剩下的安装流程中，我们会用 ``pip`` 从命令行安装 Python 包。

source: Install ``virtualenv`` and ``virtualenvwrapper``
pt_br: Instalando ``virtualenv`` e ``virtualenvwrapper``
zh_hans: 安装 ``virtualenv`` 和 ``virtualenvwrapper``

source: `virtualenv`_ and `virtualenvwrapper`_ provide a dedicated environment for each Django project you create. While not mandatory, this is considered a best practice and will save you time in the future when you're ready to deploy your project. Simply type::
pt_br: O `virtualenv`_ e `virtualenvwrapper`_ nos dá um ambiente dedicado para cada projeto Django que você criar. Enquanto isso não é obrigatório, é considerado a melhor prática e irá lhe economizar tempo no futuro quando estiver pronto para implantar seu sistema. Simplesmente digite:
zh_hans: `virtualenv`_ 和 `virtualenvwrapper`_ 为每个 Django 项目提供独立环境。虽然不是必要的，但这是个不错的主意，会在你准备部署项目时节约时间。仅需输入::

source: Then create a virtual environment for your project::
pt_br: Então crie um ambiente virtual para seu projeto::
zh_hans: 然后为您的项目创建一个虚拟环境::

source: The virtual environment will be activated automatically and you'll see "(myproject)" next to the command prompt to designate that. If you start a new command prompt, you'll need to activate the environment again using::
pt_br: O ambiente virtual será ativado automaticamente e você irá ver "(myproject)" próximo ao "prompt" na linha de comando que indica isso. Se você iniciar uma noa linha de comando, você irá precisar ativar o ambiente novamente usando::
zh_hans: 虚拟环境会自动激活，你能在命令提示符旁边看到 "(myproject)" 指向该环境。若你打开了新的命令提示符，你需要用以下代码再次激活它::

source: Django can be installed easily using ``pip``.
pt_br: O Django pode ser instaladao facilmente usando o ``pip``.

source: In the command prompt, execute the following command::
pt_br: Na linha de comando, execute o seguinte comando::

source: If you are connecting to the internet behind a proxy, there might be problem in running the command ``pip install django``. Set the environment variables for proxy configuration in the command prompt as follows::
pt_br: Se você está conectado na internet atrás de um proxy, pode haver um problema ao rodar o comando ``pip install django``. Defina as variáveis de ambiente para configuração do proxy na linha de comando como a seguir::
zh_hans: 若你通过代理连接互联网，运行命令 ``pip install django`` 时可能会有问题。在命令提示符中为代理配置如下环境变量::

source: Writing database migrations
pt_br: Escrevendo migrações de banco de dados
zh_hans: 编写数据库迁移语句

source: Copy the ``AddField`` operation from the auto-generated migration (the first of the three new files) to the last migration and change ``AddField`` to ``AlterField``. For example:
pt_br: Copie a operação ``AddField`` da migração gerada automaticamente (o primeiro dos três novos arquivos) para a última migração e altere ``AddFiled`` para ``AlterField``. Por exemplo:

source: In the first empty migration file, add a :class:`~django.db.migrations.operations.RunPython` or :class:`~django.db.migrations.operations.RunSQL` operation to generate a unique value (UUID in the example) for each existing row. For example:
pt_br: No primeiro arquivo de migração vazio, adicione um :class:`~django.db.migrations.operations.RunPython` ou uma operaçãoi :class:`~django.db.migrations.operations.RunSQL` para gerar os valores únicos(UUID no exemplo) para cada registro existente. Por exemplo:

source: This also allows the result to be used in ``ORDER BY`` and ``DISTINCT ON`` clauses. For example ``Experiment.objects.order_by('change__abs')`` generates::
zh_hans: 这也允许结果用于 ``ORDER BY`` 和 ``DISTINCT ON`` 子句。例如 ``Experiment.objects.order_by('change__abs')`` 会生成::

source: And on databases that support distinct on fields (such as PostgreSQL), ``Experiment.objects.distinct('change__abs')`` generates::
zh_hans: 在支持字段去重的数据库（例如 PostgreSQL）上，语句 ``Experiment.objects.distinct('change__abs')`` 会生成::

source: Ordering and distinct support as described in the last two paragraphs was added.
zh_hans: 上两段所提到的排序与去重的支持被加入了。

source: The ``handle()`` method takes one or more ``poll_ids`` and sets ``poll.opened`` to ``False`` for each one. If the user referenced any nonexistent polls, a :exc:`CommandError` is raised. The ``poll.opened`` attribute does not exist in the :doc:`tutorial</intro/tutorial01>` and was added to ``polls.models.Question`` for this example.
zh_hans: ``handle()`` 方法接受一个或多个 ``poll_ids``，并将每个 ``poll.opened`` 设置为 ``False``。若用户传入了不存在的 polls，将会抛出 :exc:`CommandError`。:doc:`教程 </intro/tutorial01>` 中不存在 ``poll.opened`` 属性，只是这里为了本例添加至 ``polls.models.Question`` 的。

source: The ``@no_translations`` decorator is new. In older versions, translations are deactivated before running a command unless the command's ``leave_locale_alone`` attribute (now removed) is set to ``True``.
zh_hans: ``@no_tanslations`` 装饰器是新的。在旧版本中，运行命令时，翻译行为默认是关闭的，除非命令的 ``leave_locale_alone`` 属性（现已移除）被置为 ``True``。

source: ``kwargs`` was added.
zh_hans: ``kwargs`` 被添加了。

source: Internally, these strings are of type :class:`~django.utils.safestring.SafeText`. You can test for them using code like::
zh_hans: 实质上，这些字符串是 :class:`~django.utils.safestring.SafeText` 类的实例。你能用以下代码测试它们::

source: With the default file upload settings, files smaller than :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE` may be stored with a different mode than larger files as described in :setting:`FILE_UPLOAD_PERMISSIONS`.
zh_hans: 默认文件上传配置下，大小小于 :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE` 的文件可能与 :setting:`FILE_UPLOAD_PERMISSIONS` 中描述的大文件的存储模式不同。

source: Setting :setting:`FILE_UPLOAD_PERMISSIONS` ensures all files are uploaded with the same permissions.
zh_hans: 配置项 :setting:`FILE_UPLOAD_PERMISSIONS` 确保了所有的文件均已相同的权限上传。

source: Django includes default views and templates for several HTTP error codes. You may want to override the default templates by creating the following templates in your root template directory: ``404.html``, ``500.html``, ``403.html``, and ``400.html``. The :ref:`default error views <error-views>` that use these templates should suffice for 99% of Web applications, but you can :ref:`customize them <customizing-error-views>` as well.
zh_hans: Django 为好几个 HTTP 错误代码提供了默认的视图和模板。你能通过在根模板目录创建下列模板文件的方式重写默认模板： ``404.html``， ``500.html``， ``403.html`` 和 ``400.html``。 使用这些模板的 :ref:`默认错误视图 <error-views>` 能满足 99% 的 Web 应用，不过你也能 :ref:`自定义它们 <customizing-error-views>`。

source: Once you've got mod_wsgi installed and activated, edit your Apache server's `httpd.conf`_ file and add the following. If you are using a version of Apache older than 2.4, replace ``Require all granted`` with ``Allow from all`` and also add the line ``Order deny,allow`` above it.
zh_hans: 安装并激活 mod_wsgi 后，编辑 Apache 服务器的 `httpd.conf`_ 文件，并添加以下内容。若你正在使用的 Apache 版本号早于 2.4，用 ``Allow from all`` 替换 ``Require all granted``，并在其上添加一行 ``Order deny,allow``。

source: If you install your project's Python dependencies inside a `virtualenv`_, add the path to the virtualenv using ``WSGIPythonHome``. See the `mod_wsgi virtualenv guide`_ for more details.
zh_hans: 如果你在某个 `virtualenv`_ 内为应用安装项目的 Python 依赖，将该 virtualenv 的路径添加至 ``WSGIPythonHome`` 。参考 `mod_wsgi virtualenv 指引`_ 获取更多细节。

source: uWSGI operates on a client-server model. Your Web server (e.g., nginx, Apache) communicates with a `django-uwsgi` "worker" process to serve dynamic content.
zh_hans: uWSGI 以客户端-服务端模式运行。Web 服务器（例如 nginx，Apache）与一个 `django-uwsgi` "worker" 进程交互，提供动态内容。

source: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` must appear before other middleware that intercepts 404 errors, such as :class:`~django.middleware.locale.LocaleMiddleware` or :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`. Put it towards the top of your :setting:`MIDDLEWARE` setting.
zh_hans: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` 必须出现在其它拦截 404 错误的中间层之前，例如 :class:`~django.middleware.locale.LocaleMiddleware` 或 :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware`。将其置于 :setting:`MIDDLEWARE` 配置项的顶部。

source: Filtering sensitive data is a hard problem, and it's nearly impossible to guarantee that sensitive data won't leak into an error report. Therefore, error reports should only be available to trusted team members and you should avoid transmitting error reports unencrypted over the Internet (such as through email).
zh_hans: 过滤敏感数据是个极度困难的问题，且几乎不可能不将敏感数据泄露至错误报告。因此，错误报告应该只对可信任的团队成员开放，并且，你应该避免直接通过明文传输错误报告（例如通过邮件）。

source: Django on Jython
zh_hans: 基于 Jython 的 Django

source: Jython_ is an implementation of Python that runs on the Java platform (JVM).
zh_hans: Jython_ 是运行在 Java 平台(JVM) 的 Python 实现。

source: If you want to use Jython (which supports only Python 2.7 at the time of this writing), you must use Django 1.11.x (the last series to support Python 2). Jython support may be readded to Django if a Python 3 compatible Jython is released.
zh_hans: 若你想使用 Jython（编写文本时，它只支持 Python 2.7），你必须使用 Django 1.11.x（支持 Python 2 的最终版本）。若兼容 Python 3 的 Jython 发布了，你可能能在这里读到 Django 关于 Jython 支持的内容。

source: The response will automatically set the MIME type :mimetype:`application/pdf` based on the filename extension. This tells browsers that the document is a PDF file, rather than an HTML file or a generic `application/octet-stream` binary content.
zh_hans: 响应会自动基于文件扩展名将 MIME 类型设置为 :mimetype:`application/pdf`。这告诉浏览器该文档是个 PDF 文件，而不是 HTML 文件或普通的 `application/octet-stream` 二进制内容。

source: When ``as_attachment=True`` is passed to ``FileResponse``, it sets the appropriate ``Content-Disposition`` header and that tells Web browsers to pop-up a dialog box prompting/confirming how to handle the document even if a default is set on the machine. If the ``as_attachment`` parameter is omitted, browsers will handle the PDF using whatever program/plugin they've been configured to use for PDFs.
zh_hans: 将 ``as_attachment=True`` 传递给 ``FileResponse`` 时，它会设置合适的 ``Content-Disposition`` 头，这将告诉 Web 浏览器弹出一个对话框，提示或确认如何处理该文档，即便设备已配置默认行为。若省略了 ``as_attachment`` 参数，浏览器会用已配置的用于处理 PDF 的程序或插件来处理该 PDF。

source: Hooking into the ReportLab API is easy: The same buffer passed as the first argument to ``canvas.Canvas`` can be fed to the :class:`~django.http.FileResponse` class.
zh_hans: 使用 ReportLab API 非常简单：作为第一个参数传递给 ``canvas.Canvas`` 的缓冲区也能传递给 :class:`~django.http.FileResponse` 类。

source: Overriding templates
zh_hans: 复写模板

source: Another common tactic is to serve static files from a cloud storage provider like Amazon's S3 and/or a CDN (content delivery network). This lets you ignore the problems of serving static files and can often make for faster-loading Web pages (especially when using a CDN).
zh_hans: 另一种常见的策略是从类似亚马逊 S3 的云存储服务商或 CDN (content delivery network) 提供静态文件服务。这能让你忽略提供静态文件服务可能出现的问题，提供 Web 页面加载速度（尤其是在用 CDN 的时候）。

source: If you're upgrading through more than one feature version (e.g. A.B to A.B+2), it's usually easier to upgrade through each feature release incrementally (A.B to A.B+1 to A.B+2) rather than to make all the changes for each feature release at once. For each feature release, use the latest patch release (A.B.C).
zh_hans: 若你更新的版本跨度超过两个（例如 A.B 更新至 A.B+2），通常增量更新（A.B 到 A.B+1 再到 A.B+2）每个版本会比一次性更新更简单。对于每个发布特性，使用最新的补丁版本（A.B.C）。

source: If you're not using the Django test runner, you may need to also ensure that any console output is not captured which would hide deprecation warnings. For example, if you use `py.test`:
zh_hans: 若你未使用 Django 的 test runner，你可能还需要确认没有终端输出被截胡，这可能会影藏过期警告。例如，若你使用 `py.test`：

source: To install pip on your machine, go to https://pip.pypa.io/en/latest/installing/, and follow the ``Installing with get-pip.py`` instructions.
zh_hans: 想要在您的机器上安装 pip，请转至 https://pip.pypa.io/en/latest/installing/，并按照 ``通过 get-pip.py 安装`` 说明进行操作。
