Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/index.po
Languages: it, pl

source: Django documentation
it: Documentazione di Django
pl: Dokumentacja Django

source: Everything you need to know about Django.
it: Tutto ciò che devi sapere su Django.
pl: Wszystko, co powinieneś wiedzieć o Django.

source: Getting help
it: Ottieni aiuto
pl: Uzyskiwanie pomocy

source: Having trouble? We'd like to help!
it: Hai problemi? Saremo felici di aiutarti!
pl: Masz kłopoty? Chcielibyśmy pomóc!

source: Try the :doc:`FAQ <faq/index>` -- it's got answers to many common questions.
it: Prova il :doc:`FAQ <faq/index>` -- troverai le risposte alle domande più frequenti.
pl: Wypróbuj :doc:`FAQ <faq/index>` -- zawiera ono odpowiedzi na wiele powszechnych pytań.

source: Looking for specific information? Try the :ref:`genindex`, :ref:`modindex` or the :doc:`detailed table of contents <contents>`.
it: Stai cercando informazioni specifiche? Prova il :ref:`genindex`, :ref:`modindex` o il :doc: tavola dettagliata dei contenuti <contents>`.
pl: Szukasz konkretnej informacji? Wypróbuj :ref:`indeks kodu <genindex>`, :ref:`indeks modułów <modindex>` lub :doc:`szczegółowy spis treści <contents>`.

source: Search for information in the archives of the |django-users| mailing list, or `post a question`_.
pl: Poszukaj informacji w archiwach listy mailingowej |django-users| albo `zadaj pytanie`_.

source: Ask a question in the `#django IRC channel`_, or search the `IRC logs`_ to see if it's been asked before.
pl: Zadaj pytanie na `kanale IRC #django`_ lub przeszukaj `logi IRC`_, by sprawdzić, czy nie zostało zadane wcześniej.

source: Report bugs with Django in our `ticket tracker`_.
it: Segnala le anomalie di Django avvalendoti del nostro `sistema di ticketing`_.
pl: Zgłoś błędy w Django w naszym `systemie zgłoszeń`_.

source: How the documentation is organized
it: Com'è organizzata la documentazione
pl: Jak dokumentacja jest zorganizowana

source: Django has a lot of documentation. A high-level overview of how it's organized will help you know where to look for certain things:
it: Django ha una documentazione molto ampia. Una visione d'insieme di com'è strutturata ti aiuterà a capire dove cercare determinate cose:
pl: Django ma dużo dokumentacji. Wysokopoziomowy opis, jak jest ona zorganizowana, pomoże ci wiedzieć, gdzie szukać poszczególnych rzeczy:

source: :doc:`Tutorials </intro/index>` take you by the hand through a series of steps to create a Web application. Start here if you're new to Django or Web application development. Also look at the ":ref:`index-first-steps`" below.
pl: :doc:`Tutoriale </intro/index>` prowadzą cię za rękę przez kolejne kroki tworzenia aplikacji webowej. Zacznij tutaj, jeśli jesteś nowy w Django lub w dewelopmencie aplikacji internetowych. Spójrz też na „:ref:`index-first-steps`” poniżej.

source: :doc:`Topic guides </topics/index>` discuss key topics and concepts at a fairly high level and provide useful background information and explanation.
it: :doc:`Guide agli argomenti </topics/index>` discutono gli argomenti chiave e i concetti ad un livello abbastanza elevato, e forniscono utili infomazioni e spiegazioni di base.
pl: :doc:`Przewodniki tematyczne </topics/index>` omawiają kluczowe tematy i pojęcia na dość wysokim poziomie oraz zawierają przydatne informacje ogólne i wyjaśnienia.

source: :doc:`Reference guides </ref/index>` contain technical reference for APIs and other aspects of Django's machinery. They describe how it works and how to use it but assume that you have a basic understanding of key concepts.
it: :doc:`Guide di riferimento </ref/index>` contengono riferimenti tecnici per le API e per altri aspetti del complesso di Django. Descrivono come funzione e come utilizzarlo, ma presumono la conoscenza dei concetti fondamentali.
pl: :doc:`Podręczniki </ref/index>` zawierają dokumentację techniczną dla API i innych aspektów machinerii Django. Opisują, jak to działa i jak tego używać, ale zakładają podstawowe rozumienie kluczowych pojęć.

source: :doc:`How-to guides </howto/index>` are recipes. They guide you through the steps involved in addressing key problems and use-cases. They are more advanced than tutorials and assume some knowledge of how Django works.
it: :doc:`Guide How-to </howto/index>` sono procedure. Ti guidano attraverso i passi necessari alla soluzioni di problemi fondamentali e di casi d'uso. Sono più avanzati dei tutorial e pressuppongono una certa conoscenza del funzionamento di Django.
pl: :doc:`Przewodniki „Jak to zrobić” </howto/index>` są instrukcjami. Prowadzą cię przez kolejne kroki składające się na rozwiązanie kluczowych problemów i przypadków użycia. Są bardziej zaawansowane niż tutoriale i zakładają trochę wiedzy o tym, jak działa Django.

source: First steps
it: Primi passi
pl: Pierwsze kroki

source: Are you new to Django or to programming? This is the place to start!
it: Non conosci ancora Django o non hai mai programmato? Questo è il posto giusto da dove cominciare!
pl: Jesteś nowy w Django lub w programowaniu? Tu powinieneś zacząć!

source: **From scratch:** :doc:`Overview <intro/overview>` | :doc:`Installation <intro/install>`
it: **Partendo da zero:** :doc:`Panoramica <intro/overview>` | :doc:`Istallatione <intro/install>`
pl: **Od podstaw:** :doc:`Przegląd <intro/overview>` | :doc:`Instalacja <intro/install>`

source: **Tutorial:** :doc:`Part 1: Requests and responses <intro/tutorial01>` | :doc:`Part 2: Models and the admin site <intro/tutorial02>` | :doc:`Part 3: Views and templates <intro/tutorial03>` | :doc:`Part 4: Forms and generic views <intro/tutorial04>` | :doc:`Part 5: Testing <intro/tutorial05>` | :doc:`Part 6: Static files <intro/tutorial06>` | :doc:`Part 7: Customizing the admin site <intro/tutorial07>`
it: **Tutorial:** :doc:`Parte 1: Richieste e risposte <intro/tutorial01>` | :doc:`Parte 2: Model e il sito per l'amministrazione <intro/tutorial02>` | :doc:`Parte 3: View e template <intro/tutorial03>` | :doc:`Parte 4: Form e view generiche <intro/tutorial04>` | :doc:`Parte 5: Test <intro/tutorial05>` | :doc:`Parte 6: File statici <intro/tutorial06>` | :doc:`Parte 7: Personalizzare il sito di amministrazione <intro/tutorial07>`
pl: **Tutorial:** :doc:`Część 1: Żądania i odpowiedzi <intro/tutorial01>` | :doc:`Część 2: Modele i panel administracyjny <intro/tutorial02>` | :doc:`Część 3: Widoki i szablony <intro/tutorial03>` | :doc:`Część 4: Formularze i widoki generyczne <intro/tutorial04>` | :doc:`Część 5: Testowanie <intro/tutorial05>` | :doc:`Część 6: Statyczne pliki <intro/tutorial06>` | :doc:`Część 7: Dostosowywanie panelu administracyjnego <intro/tutorial07>`

source: **Advanced Tutorials:** :doc:`How to write reusable apps <intro/reusable-apps>` | :doc:`Writing your first patch for Django <intro/contributing>`
it: **Tutorials Avanzati:** :doc:`Come scrivere apps riutilizzabili <intro/reusable-apps>` | :doc:`Scrivere la tua prima patch per Django <intro/contributing>`
pl: **Zaawansowane tutoriale:** :doc:`Jak pisać aplikacje wielokrotnego użytku <intro/reusable-apps>` | :doc:`Pisane pierwszej poprawki do Django <intro/contributing>`

source: The model layer
it: Il livello del modello
pl: Warstwa modelu

source: Django provides an abstraction layer (the "models") for structuring and manipulating the data of your Web application. Learn more about it below:
it: Django fornisce un livello di astrazione (i "models") per strutturare e manipolare i dati delle vostre applicazioni Web. Per saperne di più leggete qui sotto:
pl: Django daje dostęp do warstwy abstrakcji („modeli”) do strukturyzacji i manipulowania danymi twojej aplikacji internetowej. Dowiedz się więcej poniżej:

source: **Models:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
pl: **Modele:** :doc:`Wprowadzenie do modeli <topics/db/models>` | :doc:`Typy pól <ref/models/fields>` | :doc:`Opcje meta <ref/models/options>` | :doc:`Klasa Model <ref/models/class>`

source: **QuerySets:** :doc:`Executing queries <topics/db/queries>` | :doc:`QuerySet method reference <ref/models/querysets>` | :doc:`Lookup expressions <ref/models/lookups>`
pl: **QuerySety:** :doc:`Wykonywanie kwerend <topics/db/queries>` | :doc:`Podręcznik metod klasy QuerySet <ref/models/querysets>` | :doc:`Wyrażenia lookup <ref/models/lookups>`

source: **Model instances:** :doc:`Instance methods <ref/models/instances>` | :doc:`Accessing related objects <ref/models/relations>`
it: **Istanze di Model:** :doc:`Metodi delle istanze <ref/models/instances>` | :doc:`Accesso ai relativi oggetti <ref/models/relations>`
pl: **Instancje modeli:** :doc:`Metody instancyjne <ref/models/instances>` | :doc:`Dostęp do powiązanych obiektów <ref/models/relations>`

source: **Migrations:** :doc:`Introduction to Migrations<topics/migrations>` | :doc:`Operations reference <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Writing migrations <howto/writing-migrations>`
it: **Migrazioni:** :doc:`Introduzione alle migrazioni<topics/migrations>` | :doc:`riferimento alle operazioni <reef/migration-operations>` | :doc:`Editor dello schema <ref/schema-editor>` | :doc:`Scrivere migrazioni <howto/writing-migrations>`
pl: **Migracje:** :doc:`Wprowadzenie do Migracji<topics/migrations>` | :doc:`Podręcznik Operacji <ref/migration-operations>` | :doc:`SchemaEditor <ref/schema-editor>` | :doc:`Pisanie migracji <howto/writing-migrations>`

source: **Advanced:** :doc:`Managers <topics/db/managers>` | :doc:`Raw SQL <topics/db/sql>` | :doc:`Transactions <topics/db/transactions>` | :doc:`Aggregation <topics/db/aggregation>` | :doc:`Search <topics/db/search>` | :doc:`Custom fields <howto/custom-model-fields>` | :doc:`Multiple databases <topics/db/multi-db>` | :doc:`Custom lookups <howto/custom-lookups>` | :doc:`Query Expressions <ref/models/expressions>` | :doc:`Conditional Expressions <ref/models/conditional-expressions>` | :doc:`Database Functions <ref/models/database-functions>`
it: **Avanzate:** :doc:`Managers <topics/db/managers>` | :doc:`SQL diretto<topics/db/sql>` | :doc:`Transazioni <topics/db/transactions>` | :doc:`Aggregazioni <topics/db/aggregation>` | :doc:`Ricerca <topics/db/search>` | :doc:`Campi personalizzati <howto/custom-model-fields>` | :doc:`Database multipli <topics/db/multi-db>` | :doc:`Consultazioni personalizzate <howto/custom-lookups>` | :doc:`Espressioni di interrogazioni <ref/models/expressions>` | :doc:`Espressioni condizionali<ref/models/conditional-expressions>` | :doc:`Funzioni del database <ref/models/database-functions>`
pl: **Zaawansowane:** :doc:`Klasa Manager <topics/db/managers>` | :doc:`Surowy SQL <topics/db/sql>` | :doc:`Transakcje <topics/db/transactions>` | :doc:`Agregacja <topics/db/aggregation>` | :doc:`Wyszukiwanie <topics/db/search>` | :doc:`Własne pola <howto/custom-model-fields>` | :doc:`Wiele baz danych <topics/db/multi-db>` | :doc:`Własne lookupy <howto/custom-lookups>` | :doc:`Wyrażenia zapytań <ref/models/expressions>` | :doc:`Wyrażenia warunkowe <ref/models/conditional-expressions>` | :doc:`Funkcje bazodanowe <ref/models/database-functions>`

source: **Other:** :doc:`Supported databases <ref/databases>` | :doc:`Legacy databases <howto/legacy-databases>` | :doc:`Providing initial data <howto/initial-data>` | :doc:`Optimize database access <topics/db/optimization>` | :doc:`PostgreSQL specific features <ref/contrib/postgres/index>`
it: **Altro:** :doc:`Database Supportati <ref/databases>` | :doc:`Database Legacy <howto/legacy-databases>` | :doc:`Fornire i dati iniziali <howto/initial-data>` | :doc:`Ottimizzare l'accesso al database <topics/db/optimization>` | :doc:`Caratteristiche specifiche di PostgreSQL<ref/contrib/postgres/index>`
pl: **Inne:** :doc:`Wspierane bazy danych <ref/databases>` | :doc:`Zastane bazy danych <howto/legacy-databases>` | :doc:`Określanie danych początkowych <howto/initial-data>` | :doc:`Optymalizowanie dostępów do bazy danych <topics/db/optimization>` | :doc:`Specyfika PostgreSQL <ref/contrib/postgres/index>`

source: The view layer
it: Il livello vista
pl: Warstwa widoku

source: Django has the concept of "views" to encapsulate the logic responsible for processing a user's request and for returning the response. Find all you need to know about views via the links below:
it: Django possiede il concetto delle "viste" per incapsulare la logica che gestisce una richiesta dell'utente e la fornitura di una risposta. Tutte le informazioni per comprendere le viste sono consultabili ai seguenti link:
pl: Django używa idei „widoku” do kapsułkowania logiki odpowiedzialnej za przetwarzanie zapytań użytkownika i zwracania odpowiedzi. Dowiedz się wszystkiego co musisz wiedzieć o widokach przez linki poniżej:

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>`
pl: **Podstawy:** :doc:`URLconf <topics/http/urls>` | :doc:`Funkcje widoków <topics/http/views>` | :doc:`Skróty <topics/http/shortcuts>` | :doc:`Dekoratory <topics/http/decorators>`

source: **Reference:** :doc:`Built-in Views <ref/views>` | :doc:`Request/response objects <ref/request-response>` | :doc:`TemplateResponse objects <ref/template-response>`
it: **Riferimento:** :doc:`Viste Predefinite <ref/views>` | :doc:`Oggetti Request/Reponse <ref/request-response>` | :doc:`Oggetti TemplateResponse <ref/template-response>`
pl: **Dokumentacja:** :doc:`Wbudowane widoki <ref/views>` | :doc:`Obiekty żądania/odpowiedzi <ref/request-response>` | :doc:`Obiekty TemplateResponse <ref/template-response>`

source: **File uploads:** :doc:`Overview <topics/http/file-uploads>` | :doc:`File objects <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Managing files <topics/files>` | :doc:`Custom storage <howto/custom-file-storage>`
it: **Upload di file:** :doc:`Panoramica <topics/http/file-uploads>` | :doc:`Oggetti file <ref/files/file>` | :doc:`API per storage <ref/files/storage>` | :doc:`Gestire i file <topics/files>` | :doc:`Storage personalizzato <howto/custom-file-storage>`
pl: **Wgrywanie plików:** :doc:`Przegląd <topics/http/file-uploads>` | :doc:`Obiekty File <ref/files/file>` | :doc:`Storage API <ref/files/storage>` | :doc:`Zarządzanie plikami <topics/files>` | :doc:`Własny storage <howto/custom-file-storage>`

source: **Class-based views:** :doc:`Overview <topics/class-based-views/index>` | :doc:`Built-in display views <topics/class-based-views/generic-display>` | :doc:`Built-in editing views <topics/class-based-views/generic-editing>` | :doc:`Using mixins <topics/class-based-views/mixins>` | :doc:`API reference <ref/class-based-views/index>` | :doc:`Flattened index<ref/class-based-views/flattened-index>`
it: **Viste basate su classi:** :doc:`Panoramica <topics/class-based-views/index>` | :doc:`Viste predefinite per la visualizzazzione <topics/class-based-views/generic-display>` | :doc:`Viste predefinite per modifiche <topics/class-based-views/generic-editing>` | :doc:`Usare i mixins <topics/class-based-views/mixins>` | :doc:`Riferimento all'API <ref/class-based-views/index>` | :doc:`Indice <ref/class-based-views/flattened-index>`
pl: **Widoki oparte na klasach:** :doc:`Przegląd <topics/class-based-views/index>` | :doc:`Wbudowane klasy wyświetlania <topics/class-based-views/generic-display>` | :doc:`Wbudowane klasy edycji <topics/class-based-views/generic-editing>` | :doc:`Używanie mixinów <topics/class-based-views/mixins>` | :doc:`Dokumentacja API <ref/class-based-views/index>` | :doc:`Uproszczony spis <ref/class-based-views/flattened-index>`

source: **Advanced:** :doc:`Generating CSV <howto/outputting-csv>` | :doc:`Generating PDF <howto/outputting-pdf>`
it: **Avanzato:** :doc:`Generare CSV <howto/outputting-csv>` | :doc:`Generare PDF <howto/outputting-pdf>`
pl: **Zaawansowane:** :doc:`Generowanie CSV <howto/outputting-csv>` | :doc:`Generowanie PDF <howto/outputting-pdf>`

source: **Middleware:** :doc:`Overview <topics/http/middleware>` | :doc:`Built-in middleware classes <ref/middleware>`
it: **Middleware:** :doc:`Panoramica <topics/http/middleware>` | :doc:`Classi predefinite per il middleware <ref/middleware>`
pl: **Middleware:** :doc:`Przegląd <topics/http/middleware>` | :doc:`Wbudowane klasy middleware <ref/middleware>`

source: The template layer
it: Il livello template
pl: Warstwa szablonu

source: The template layer provides a designer-friendly syntax for rendering the information to be presented to the user. Learn how this syntax can be used by designers and how it can be extended by programmers:
it: Il livello template fornisce una sintassi facile da usare per il designer, permettendo di generare le informazioni da presentare all'utente. Impara l'uso della sintassi come designer e il modo in cui può essere estesa dagli sviluppatori:
pl: Warstwa szablonów ma składnię przyjazną projektantom pozwalającą przygotować informację do zaprezentowania użytkownikowi. Dowiedz się, jak ta składnia może być wykorzystywana przez projektantów i jak może być rozszerzana przez programistów:

source: **The basics:** :doc:`Overview <topics/templates>`
it: **Fondamenti:** :doc:`Panoramica<topics/templates>`
pl: **Podstawy:** :doc:`Przegląd <topics/templates>`

source: **For designers:** :doc:`Language overview <ref/templates/language>` | :doc:`Built-in tags and filters <ref/templates/builtins>` | :doc:`Humanization <ref/contrib/humanize>`
it: **Per i designer:** :doc:`Panoramica del linguaggio <ref/templates/language>` | :doc:`Tags e filtri integrati<ref/templates/builtins>` | :doc:`Umanizzazione<ref/contrib/humanize>`
pl: **Dla projektantów:** :doc:`Opis języka <ref/templates/language>` | :doc:`Wbudowane tagi i filtry <ref/templates/builtins>` | :doc:`Uczłowieczanie <ref/contrib/humanize>`

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>`
pl: **Dla programistów:** :doc:`API Szablonów <ref/templates/api>` | :doc:`Niestandardowe tagi i filtry <howto/custom-template-tags>`

source: Forms
it: I Form
pl: Formularze

source: Django provides a rich framework to facilitate the creation of forms and the manipulation of form data.
it: Django fornisce una ricco framework per facilitare la creazione dei Form e la manipolazione dei suoi dati.
pl: Django dostarcza bogatego frameworka by ułatwić tworzenie formularzy i manipulacji danymi formularza.

source: **The basics:** :doc:`Overview <topics/forms/index>` | :doc:`Form API <ref/forms/api>` | :doc:`Built-in fields <ref/forms/fields>` | :doc:`Built-in widgets <ref/forms/widgets>`
it: **Fondamenti:** :doc:`Panoramica <topics/forms/index>` | :doc:`API del Form<ref/forms/api>` | :doc:`Campi predefiniti <ref/forms/fields>` | :doc:`Widget predefiniti <ref/forms/widgets>`
pl: **Podstawy:** :doc:`Przegląd <topics/forms/index>` | :doc:`API formularzy <ref/forms/api>` | :doc:`Pola wbudowane <ref/forms/fields>` | :doc:`Widżety wbudowane <ref/forms/widgets>`

source: **Advanced:** :doc:`Forms for models <topics/forms/modelforms>` | :doc:`Integrating media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Customizing validation <ref/forms/validation>`
it: **Avanzato:** :doc:`Form per i modelli <topics/forms/modelforms>` | :doc:`Integrare i media <topics/forms/media>` | :doc:`Formsets <topics/forms/formsets>` | :doc:`Personalizzare la validazione <ref/forms/validation>`
pl: **Zaawansowane:** :doc:`Formularze dla modeli <topics/forms/modelforms>` | :doc:`Integracja z mediami <topics/forms/media>` | :doc:`Zbiory formularzy <topics/forms/formsets>` | :doc:`Dostosowanie walidacji <ref/forms/validation>`

source: The development process
it: Il processo di sviluppo
pl: Proces rozwoju

source: Learn about the various components and tools to help you in the development and testing of Django applications:
it: Imparate a usare i vari strumenti e componenti per aiutarvi a sviluppare e testare le applicazioni in Django:
pl: Dowiedz się o różnych komponentach i narzędziach pomagających w rozwoju i testowaniu aplikacji Django:

source: **Settings:** :doc:`Overview <topics/settings>` | :doc:`Full list of settings <ref/settings>`
it: **Impostazioni:** :doc:`Panoramica <topics/settings>` | :doc:`Lista completa delle impostazioni <ref/settings>`
pl: **Ustawienia:** :doc:`Przegląd <topics/settings>` | :doc:`Pełna lista ustawień <ref/settings>`

source: **Applications:** :doc:`Overview <ref/applications>`
it: **Applicazioni:** :doc:`Panoramica <ref/applications>`
pl: **Aplikacje:** :doc:`Przegląd <ref/applications>`

source: **Exceptions:** :doc:`Overview <ref/exceptions>`
it: **Eccezioni:** :doc:`Panoramica <ref/exceptions>`
pl: **Wyjątki:** :doc:`Przegląd <ref/exceptions>`

source: **django-admin and manage.py:** :doc:`Overview <ref/django-admin>` | :doc:`Adding custom commands <howto/custom-management-commands>`
it: **django-admin.py e manage.py:** :doc:`Panoramica <ref/django-admin>` | :doc:`Aggiungere comandi personalizzati <howto/custom-management-commands>`
pl: **django-admin i manage.py:** :doc:`Przegląd <ref/django-admin>` | :doc:`Dodawanie własnych komend <howto/custom-management-commands>`

source: **Testing:** :doc:`Introduction <topics/testing/index>` | :doc:`Writing and running tests <topics/testing/overview>` | :doc:`Included testing tools <topics/testing/tools>` | :doc:`Advanced topics <topics/testing/advanced>`
it: **Test:** :doc:`Introduzione <topics/testing/index>` | :doc:`Scrivere ed eseguire i test <topics/testing/overview>` | :doc:`Strumenti di test inclusi <topics/testing/tools>` | :doc:`Argomenti avanzati <topics/testing/advanced>`
pl: **Testowanie:** :doc:`Wprowadzenie <topics/testing/index>` | :doc:`Pisanie i uruchamianie testów <topics/testing/overview>` | :doc:`Narzędzia testowania <topics/testing/tools>` | :doc:`Tematy zaawansowane <topics/testing/advanced>`

source: **Deployment:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>`
pl: **Wdrażanie:** :doc:`Przegląd <howto/deployment/index>` | :doc:`Serwery WSGI <howto/deployment/wsgi/index>` | :doc:`Wdrażanie statycznych plików <howto/static-files/deployment>` | :doc:`Śledzenie błędów kodu przez e-mail <howto/error-reporting>`

source: The admin
it: L'admin
pl: Administrator

source: Find all you need to know about the automated admin interface, one of Django's most popular features:
it: Trova tutto ciò che occorre sull'interfaccia di gestione automatizzata, una delle funzionalità di Django più popolari:
pl: Dowiedz się wszystkiego co potrzebne o zautomatyzowanym interfejsie administratora jednym z najbardziej popularnych cech Django:

source: :doc:`Admin site <ref/contrib/admin/index>`
it: :doc:`Gestisci il sito <ref/contrib/admin/index>`
pl: :doc:`Panel administratora <ref/contrib/admin/index>`

source: :doc:`Admin actions <ref/contrib/admin/actions>`
it: :doc:`Azioni di gestione <ref/contrib/admin/actions>`
pl: :doc:`Akcje <ref/contrib/admin/actions>`

source: :doc:`Admin documentation generator<ref/contrib/admin/admindocs>`
it: :doc:`Gestisci il generatore della documentazione<ref/contrib/admin/admindocs>`
pl: :doc:`Generator dokumentacji admina <ref/contrib/admin/admindocs>`

source: Security
it: Sicurezza
pl: Bezpieczeństwo

source: Security is a topic of paramount importance in the development of Web applications and Django provides multiple protection tools and mechanisms:
it: La sicurezza è un argomento di primaria importanza quando si sviluppano applicazioni per il Web e Django fornisce strumenti e meccanismi di protezione multipla:
pl: Bezpieczeństwo jest tematem najwyższej wagi przy tworzeniu aplikacji webowych. Django dostarcza wiele narzędzi i mechanizmów ochrony:
