Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/index.po
Languages: it, pl

source: :doc:`Security overview <topics/security>`
it: :doc:`Panoramica sulla sicurezza <topics/security>`
pl: :doc:`Bezpieczeństwo – przegląd <topics/security>`

source: :doc:`Disclosed security issues in Django <releases/security>`
it: :doc:`Problemi di sicurezza noti in Django <releases/security>`
pl: :doc:`Ujawnione błędy bezpieczeństwa w Django <releases/security>`

source: :doc:`Clickjacking protection <ref/clickjacking>`
it: :doc:`Protezione per clickjacking <ref/clickjacking>`
pl: :doc:`Zabezpieczenie przed atakiem typu clickjacking <ref/clickjacking>`

source: :doc:`Cross Site Request Forgery protection <ref/csrf>`
it: :doc:`protezione Cross Site Request Forgery<ref/csrf>`
pl: :doc:`Zabezpieczenie przed atakiem typu CSRF <ref/csrf>`

source: :doc:`Cryptographic signing <topics/signing>`
it: :doc:`Firma per la crittografia <topics/signing>`
pl: :doc:`Podpisywanie kryptograficzne <topics/signing>`

source: :ref:`Security Middleware <security-middleware>`
it: :ref:`Middleware di sicurezza<security-middleware>`
pl: :ref:`Middleware bezpieczeństwa <security-middleware>`

source: Internationalization and localization
it: Internazionalizzazione e localizzazione
pl: Unarodowienie i lokalizacja

source: Django offers a robust internationalization and localization framework to assist you in the development of applications for multiple languages and world regions:
it: Django offre un robusto framework di internazionalizzazione e localizzazione per assisterti nello sviluppo di applicazioni che richiedono diverse lingue e nazionalità:
pl: Django oferuje krzepki framework do umiędzynarodowiania i lokalizacji, aby pomagać w rozwijaniu aplikacji dla wielu języków i regionów świata:

source: :doc:`Overview <topics/i18n/index>` | :doc:`Internationalization <topics/i18n/translation>` | :ref:`Localization <how-to-create-language-files>` | :doc:`Localized Web UI formatting and form input <topics/i18n/formatting>`
it: :doc:`Panoramica <topics/i18n/index>` | :doc:`Internazionalizzazione <topics/i18n/translation>` | :ref:`Localizzazione <how-to-create-language-files>` | :doc:`Formattazione di Web UI e input di Form <topics/i18n/formatting>`
pl: :doc:`Przegląd <topics/i18n/index>` | :doc:`Umiędzynarodowianie <topics/i18n/translation>` | :ref:`Lokalizacja <how-to-create-language-files>` | :doc:`Zlokalizowane formatowanie interfejsu webowego i wejście formularzy <topics/i18n/formatting>`

source: :doc:`Time zones </topics/i18n/timezones>`
it: :doc:`Fusi orari </topics/i18n/timezones>`
pl: :doc:`Strefy czasowe </topics/i18n/timezones>`

source: Performance and optimization
it: Prestazioni e ottimizzazione
pl: Wydajność i optymalizacja

source: There are a variety of techniques and tools that can help get your code running more efficiently - faster, and using fewer system resources.
it: Ci sono diverse tecniche e strumenti che possono aiutarti a rendere il codice più efficiente nell'esecuzione - più veloce, usando meno risorse di sistema.
pl: Jest wiele technik i narzędzi, które pomogą ci uruchamiać kod bardziej wydajnie - szybciej i używając mniej zasobów systemowych.

source: :doc:`Performance and optimization overview <topics/performance>`
it: :doc:`Panoramica sulle prestazioni e ottimizzazione <topics/performance>`
pl: :doc:`Przegląd dotyczący wydajności i optymalizacji <topics/performance>`

source: Python compatibility
pl: Kompatybilność Pythona

source: Django aims to be compatible with multiple different flavors and versions of Python:
pl: Celem Django jest bycie kompatybilnym z wieloma różnymi odmianami i wersjami Pythona

source: :doc:`Jython support <howto/jython>`
pl: :doc:`Wsparcie języka Jython <howto/jython>`

source: :doc:`Python 3 compatibility <topics/python3>`
pl: :doc:`Kompatybilność z Pythonem 3 <topics/python3>`

source: Geographic framework
it: Framework geografico
pl: Framework geograficzny

source: :doc:`GeoDjango <ref/contrib/gis/index>` intends to be a world-class geographic Web framework. Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.
it: :doc:`GeoDjango <ref/contrib/gis/index>` vuole essere un framework geografico per il Web di classe mondiale. Il suo scopo è quello di rendere il più semplice possibile la creazione di applicazioni GIS per il Web e sfruttare la potenza dei dati di geolocalizzazione.
pl: :doc:`GeoDjango <ref/contrib/gis/index>` aspiruje do bycia światowej klasy geograficznym frameworkiem webowym. Jego celem jest ułatwianie, jak tylko jest to możliwe, budowania webowych aplikacji GIS i wykorzystywanie potencjału danych przestrzennych.

source: Common Web application tools
it: Strumenti comuni per l'applicazione Web
pl: Typowe narzędzia dla aplikacji webowych

source: Django offers multiple tools commonly needed in the development of Web applications:
it: Django offre molteplici strumenti comunemente richiesti per lo sviluppo di applicazioni Web:
pl: Django oferuje wiele narzędzi potrzebnych w tworzenie aplikacji webowych:

source: **Authentication:** :doc:`Overview <topics/auth/index>` | :doc:`Using the authentication system <topics/auth/default>` | :doc:`Password management <topics/auth/passwords>` | :doc:`Customizing authentication <topics/auth/customizing>` | :doc:`API Reference <ref/contrib/auth>`
it: **Autenticazione:** :doc:`Panoramica <topics/auth/index>` | :doc:`Usare il sistema di autenticazione <topics/auth/default>` | :doc:`Gestione della Password <topics/auth/passwords>` | :doc:`Personalizzare l'autenticazione <topics/auth/customizing>` | :doc:`Le API <ref/contrib/auth>`
pl: **Uwierzytelnianie:** :doc:`Przegląd <topics/auth/index>` | :doc:`Korzystanie z systemu uwierzytelniania <topics/auth/default>` | :doc:`Zarządzanie hasłami <topics/auth/passwords>` | :doc:`Dostosowywanie uwierzytelniania <topics/auth/customizing>` | :doc:`Dokumentacja API <ref/contrib/auth>`

source: :doc:`Caching <topics/cache>`
pl: :doc:`Cache'owanie <topics/cache>`

source: :doc:`Logging <topics/logging>`
it: :doc:`Registrare log <topics/logging>`
pl: :doc:`Zapisywanie logu <topics/logging>`

source: :doc:`Sending emails <topics/email>`
it: :doc:`Inviare email <topics/email>`
pl: :doc:`Wysyłanie e-maili <topics/email>`

source: :doc:`Syndication feeds (RSS/Atom) <ref/contrib/syndication>`
it: :doc:`Distribuzione feed (RSS/Atom) <ref/contrib/syndication>`
pl: :doc:`Syndykacja treści (RSS/Atom) <ref/contrib/syndication>`

source: :doc:`Pagination <topics/pagination>`
it: :doc:`Paginazione <topics/pagination>`
pl: :doc:`Paginacja <topics/pagination>`

source: :doc:`Messages framework <ref/contrib/messages>`
it: :doc:`Framework dei messaggi <ref/contrib/messages>`
pl: :doc:`Framework powiadomień <ref/contrib/messages>`

source: :doc:`Serialization <topics/serialization>`
it: :doc:`Serializzazione <topics/serialization>`
pl: :doc:`Serializacja <topics/serialization>`

source: :doc:`Sessions <topics/http/sessions>`
it: :doc:`Sessioni <topics/http/sessions>`
pl: :doc:`Sesje <topics/http/sessions>`

source: :doc:`Sitemaps <ref/contrib/sitemaps>`
it: :doc:`Mappe di sito <ref/contrib/sitemaps>`
pl: :doc:`Mapy strony <ref/contrib/sitemaps>`

source: :doc:`Static files management <ref/contrib/staticfiles>`
it: :doc:`Gestione statica dei file <ref/contrib/staticfiles>`
pl: :doc:`Zarządzanie statycznymi plikami <ref/contrib/staticfiles>`

source: :doc:`Data validation <ref/validators>`
it: :doc:`Validazione dei dati <ref/validators>`
pl: :doc:`Walidacja danych <ref/validators>`

source: Other core functionalities
it: Altre funzionalità di base
pl: Inne podstawowe funkcjonalności

source: Learn about some other core functionalities of the Django framework:
it: Imparate a usare alcune altre funzionalità fondamentali del framework di Django:
pl: Dowiedz się więcej o innych podstawowych funkcjonalnościach frameworka Django

source: :doc:`Conditional content processing <topics/conditional-view-processing>`
it: :doc:`Elaborazione condizionale dei contenuti <topics/conditional-view-processing>`
pl: :doc:`Warunkowe przetwarzanie zawartości <topics/conditional-view-processing>`

source: :doc:`Content types and generic relations <ref/contrib/contenttypes>`
it: :doc:`Tipi di contenuto e relazioni generiche <ref/contrib/contenttypes>`
pl: :doc:`Typy zawartości i relacje generyczne <ref/contrib/contenttypes>`

source: :doc:`Flatpages <ref/contrib/flatpages>`
it: :doc:`Le Flatpage <ref/contrib/flatpages>`
pl: :doc:`Flatpages („płaskie” strony) <ref/contrib/flatpages>`

source: :doc:`Redirects <ref/contrib/redirects>`
it: :doc:`Reindirizzamenti <ref/contrib/redirects>`
pl: :doc:`Przekierowania <ref/contrib/redirects>`

source: :doc:`Signals <topics/signals>`
it: :doc:`Segnali <topics/signals>`
pl: :doc:`Sygnały <topics/signals>`

source: :doc:`System check framework <topics/checks>`
it: :doc:`Framework dei controlli di sistema <topics/checks>`
pl: :doc:`Framework sprawdzeń systemu <topics/checks>`

source: :doc:`The sites framework <ref/contrib/sites>`
it: :doc:`Framework dei siti <ref/contrib/sites>`
pl: :doc:`Framework „witryn” <ref/contrib/sites>`

source: :doc:`Unicode in Django <ref/unicode>`
pl: :doc:`Unikod w Django <ref/unicode>`

source: The Django open-source project
it: Il progetto open-source Django
pl: Open-source'owy projekt Django

source: Learn about the development process for the Django project itself and about how you can contribute:
it: Imparate a usare il processo di sviluppo per il progetto Django stesso e su come si può contribuire:
pl: Dowiedz się o procesie rozwoju projektu Django i o tym jak możesz pomóc

source: **Community:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team organization <internals/organization>` | :doc:`Meet the team <internals/team>` | :doc:`Current roles <internals/roles>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
pl: **Społeczność:** :doc:`Jak się zaangażować <internals/contributing/index>` | :doc:`Proces wydań <internals/release-process>` | :doc:`Organizacja zespołu <internals/organization>` | :doc:`Poznaj zespół Django <internals/team>` | :doc:`Bieżące role <internals/roles>` | :doc:`Repozytorium kodu Django <internals/git>` | :doc:`Polityka bezpieczeństwa <internals/security>` | :doc:`Listy mailingowe <internals/mailing-lists>`

source: **Design philosophies:** :doc:`Overview <misc/design-philosophies>`
it: **Filosofia di design:** :doc:`Panoramica <misc/design-philosophies>`
pl: **Filozofie projektowania:** :doc:`Przegląd <misc/design-philosophies>`

source: **Documentation:** :doc:`About this documentation <internals/contributing/writing-documentation>`
it: **Documentazione:** :doc:`Informazioni su questa documentazione <internals/contributing/writing-documentation>`
pl: **Dokumentacja:** :doc:`O tej dokumentacji <internals/contributing/writing-documentation>`

source: **Third-party distributions:** :doc:`Overview <misc/distributions>`
it: **Distribuzioni di terze parti:** :doc:`Panoramica <misc/distributions>`
pl: **Dystybucje osób trzecich:** :doc:`Informacje <misc/distributions>`

source: **Django over time:** :doc:`API stability <misc/api-stability>` | :doc:`Release notes and upgrading instructions <releases/index>` | :doc:`Deprecation Timeline <internals/deprecation>`
it: **Django nel tempo:** :doc:`Stabilità delle API <misc/api-stability>` | :doc:`Note di rilascio e istruzioni per l'aggiornamento <releases/index>` | :doc:`Cronologia delle deprecazioni <internals/deprecation>`
pl: **Django na przestrzeni czasu:** :doc:`Stabliność API <misc/api-stability>` | :doc:`Informacje o wydaniach i instrukcje upgrade'ów <releases/index>` | :doc:`Oś czasu dezaktualizacji <internals/deprecation>`

source: Not found anything? See :doc:`faq/help` for information on getting support and asking questions to the community.
it: trovato nulla ? guarda :doc:`faq` per informazioni su come ricevere supporto e fare domsnde alla community

source: :doc:`Tutorials </intro/index>` take you by the hand through a series of steps to create a Web application. Start here if you're new to Django or Web application development. Also look at the ":ref:`index-first-steps`".
it: :doc:`Tutorial </intro/index>` ti guidano nei passi necessari nel creare una applicazione Web. Comincia da qui se non conosci Django o lo sviluppo di applicazioni Web. Vedi anche ":ref:`index-first-steps`".

source: **Models:** :doc:`Introduction to models <topics/db/models>` | :doc:`Field types <ref/models/fields>` | :doc:`Indexes <ref/models/indexes>` | :doc:`Meta options <ref/models/options>` | :doc:`Model class <ref/models/class>`
it: **Modelli:** :doc:`Introduzione ai modelli <topics/db/models>` | :doc:`Tipi di campi <ref/models/fields>` | :doc:`Indici <ref/models/indexes>` | :doc:`Meta opzioni <ref/models/options>` | :doc:`Classe modello <ref/models/class>`

source: **QuerySets:** :doc:`Making queries <topics/db/queries>` | :doc:`QuerySet method reference <ref/models/querysets>` | :doc:`Lookup expressions <ref/models/lookups>`
it: **QuerySets:** :doc:`Eseguire le interrogazioni <topics/db/queries>` | :doc:`Il metodo QuerySet <ref/models/querysets>` | :doc:`Le espressioni Lookup <ref/models/lookups>`

source: **The basics:** :doc:`URLconfs <topics/http/urls>` | :doc:`View functions <topics/http/views>` | :doc:`Shortcuts <topics/http/shortcuts>` | :doc:`Decorators <topics/http/decorators>` | :doc:`Asynchronous Support <topics/async>`
it: **Fondamenti:** :doc:`URLconfs <topics/http/urls>` | :doc:`Funzioni di View <topics/http/views>` | :doc:`Scorciatoie<topics/http/shortcuts>` | :doc:`I Decoratori <topics/http/decorators>`|:doc:`Supporto asincrono <topics/async>`

source: **For programmers:** :doc:`Template API <ref/templates/api>` | :doc:`Custom tags and filters <howto/custom-template-tags>` | :doc:`Custom template backend <howto/custom-template-backend>`
it: **Per gli sviluppatori** :doc:`Template API <ref/templates/api>` | :doc:`Custom tag and filtri <howto/custom-template-tags>` | :doc:`Custom template backend <howto/custom-template-backend>`

source: **Deployment:** :doc:`Overview <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`ASGI servers <howto/deployment/asgi/index>` | :doc:`Deploying static files <howto/static-files/deployment>` | :doc:`Tracking code errors by email <howto/error-reporting>` | :doc:`Deployment checklist <howto/deployment/checklist>`
it: **Rilascio:** :doc:`Panoramica <howto/deployment/index>` | :doc:`WSGI servers <howto/deployment/wsgi/index>` | :doc:`ASGI servers <howto/deployment/asgi/index>` | :doc:`Rilasciare file statici <howto/static-files/deployment>` | :doc:`Tracciare codici di errore via email <howto/error-reporting>` | :doc:`Cose da fare per il rilascio <howto/deployment/checklist>`

source: **Community:** :doc:`How to get involved <internals/contributing/index>` | :doc:`The release process <internals/release-process>` | :doc:`Team organization <internals/organization>` | :doc:`The Django source code repository <internals/git>` | :doc:`Security policies <internals/security>` | :doc:`Mailing lists <internals/mailing-lists>`
it: **Comunità:** :doc:`Come partecipare <internals/contributing/index>` | :doc:`Il processo di rilascio <internals/release-process>` | :doc:`Il team degli organizzatori <internals/organization>` | :doc:`Il repositorio del codice sorgente di Django <internals/git>` | :doc:`Le policy di sicurezza <internals/security>` | :doc:`Le mailing list <internals/mailing-lists>`
