Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: And of course, we will add some tests, to check that a ``Question`` whose ``pub_date`` is in the past can be displayed, and that one with a ``pub_date`` in the future is not:
el: Και φυσικά θα χρειαστεί να προσθέσουμε μερικά τεστ για να ελέγξουμε ότι η ερώτηση (``Question``) της οποίας το ``pub_date`` είναι στο παρελθόν εμφανίζεται ενώ αυτής που είναι στο μέλλον όχι:
ja: そしてもちろん、2つのテストを追加します。``pub_date`` が過去の ``Question`` が表示されることを確認するテストと、``pub_date`` が未来の ``Question`` が表示されないことを確認するテストです。
pl: I oczywiście dodamy kilka testów, aby sprawdzić że ``Question``, którego ``pub_date`` jest w przeszłości może zostać wyświetlone i takie z ``pub_date`` w przyszłości nie może:
zh_hans: 当然，我们将增加一些测试来检验 ``pub_date`` 在过去的 ``Question`` 可以显示出来，而 ``pub_date`` 在未来的不可以：

source: Ideas for more tests
el: Ιδέες για περισσότερα τεστ
it: Idee per altri test
ja: さらなるテストについて考える
pl: Pomysły na więcej testów
zh_hans: 更多的测试思路

source: We ought to add a similar ``get_queryset`` method to ``ResultsView`` and create a new test class for that view. It'll be very similar to what we have just created; in fact there will be a lot of repetition.
el: Χρωστάμε να προσθέσουμε μια παρόμοια μέθοδο ``get_queryset`` στο ``ResultsView`` και να δημιουργήσουμε μια νέα test class για αυτό το view. Θα είναι παρόμοια με αυτή που μόλις δημιουργήσαμε (``DetailView``). Στη πραγματικότητα θα είναι μια επανάληψη.
it: Dovremmo aggiungere un metodo simile a ``get_queryset`` a ``ResultsView`` e creare una nuova classe di test per quella view. Sarà molto simile a quello che abbiamo appena creato; in effetti ci saranno un sacco di ripetizioni.
ja: ``ResultsView`` にも同じように ``get_queryset`` メソッドを追加して、新しいテストクラスも作らなければならないようです。しかしこれは、今作ったばかりのものとそっくりになるでしょう。実際、テストは重複だらけになるはずです。
pl: Powinniśmy dodać podobną metodę ``get_queryset`` do ``ResultsView`` i stworzyć nową klasę testową dla tego widoku. Będzie bardzo podobna do tego, co przed chwilą stworzyliśmy; tak naprawdę będzie bardzo dużo powtórzone.
zh_hans: 我们应该给 ``ResultsView`` 也增加一个类似的 ``get_queryset`` 方法，并且为它创建测试。这和我们之前干的差不多，事实上，基本就是重复一遍。

source: We could also improve our application in other ways, adding tests along the way. For example, it's silly that ``Questions`` can be published on the site that have no ``Choices``. So, our views could check for this, and exclude such ``Questions``. Our tests would create a ``Question`` without ``Choices`` and then test that it's not published, as well as create a similar ``Question`` *with* ``Choices``, and test that it *is* published.
el: Θα μπορούσαμε επίσης να βελτιώσουμε την εφαρμογή μας και με άλλους τρόπους προσθέτοντας τεστ καθώς προχωράμε. Για παράδειγμα είναι λιγάκι ανόητο να μπορούν να γίνονται published οι ερωτήσεις (``Questions``) δίχως κάποιες απαντήσεις (``Choices``). Οπότε, τα views θα μπορούσα να ελέγξουν γι’ αυτό και να εξαιρέσουν (exclude) τέτοιες ερωτήσεις. Τα τεστ μας θα δημιουργούσαν μια ερώτηση χωρίς ``Choices`` και μετά θα έλεγχαν ότι αυτή η ερώτηση δεν θα γινόταν published. Ομοίως θα δημιουργούσαμε μια ερώτηση (σε άλλο τεστ) *με* ``Choices`` αυτή τη φορά και ελέγχαμε ότι αυτή η ερώτηση *θα γινόταν* published.
it: Noi potremmo migliorare la nostra applicazione in altri modi, aggiungendo test. Per esempio, è sciocco che ``Questions`` possa essere pubblicato sul sito ma non ha ``Choices``. Le nostre view potrebbero controllare questo scenario, ed escludere questo tipo di ``Questions``. I nostri test potrebbero creare una ``Question`` senza ``Choices`` e quindi testare che non sia pubblicata, così come potremmo creare una ``Question`` simile, ma *con* ``Choices`` e testare che *venga* pubblicata
ja: テストを追加することによって、同じように他の方法でアプリを改善できるでしょう。例えば、``Choices`` を一つも持たない馬鹿げた ``Questions`` が公開可能になっています。このような ``Questions`` を排除するようビューでチェックできます。 ``Choices`` がない ``Question`` を作成し、それが公開されないことをテストし、同じようにして、``Choices`` *がある* ``Question`` を作成し、それが公開 *される* ことをテストすることになるでしょう。
pl: Moglibyśmy ulepszyć naszą aplikację na inne sposoby, dodając po drodze testy. Na przykład głupie jest, że ``Questions``, które nie mają ``Choices`` mogą być publikowane na stronie. Więc nasze widoki mogłyby to sprawdzać i wykluczać takie ``Questions``. Nasze testy tworzyłyby ``Question`` bez ``Choices`` i następnie sprawdzały, czy nie jest opublikowane, jak również tworzyłyby podobne ``Question`` *z* ``Choices`` i sprawdzały, czy *jest* opublikowane.
zh_hans: 我们还可以从各个方面改进投票应用，但是测试会一直伴随我们。比方说，在目录页上显示一个没有选项 ``Choices`` 的投票问题就没什么意义。我们可以检查并排除这样的投票题。测试可以创建一个没有选项的投票，然后检查它是否被显示在目录上。当然也要创建一个有选项的投票，然后确认它确实被显示了。

source: Perhaps logged-in admin users should be allowed to see unpublished ``Questions``, but not ordinary visitors. Again: whatever needs to be added to the software to accomplish this should be accompanied by a test, whether you write the test first and then make the code pass the test, or work out the logic in your code first and then write a test to prove it.
el: Ίσως οι logged-in admin χρήστες να επιτρεπόταν να δουν τις unpublished ερωτήσεις, αλλά όχι οι συνηθισμένοι επισκέπτες. Για ακόμη μια φορά: οτιδήποτε χρειάζεται να προστεθεί στο software για να επιτευχθεί ο στόχος σας θα πρέπει να συνοδεύεται από ένα τεστ, είτε γράψετε το test πρώτο και μετά τον κώδικα για να κάνετε το τεστ να επιτύχει είτε γράψετε τον κώδικα πρώτα και μετά το τεστ για να αποδείξετε ότι ο κώδικας σας λειτουργεί.
it: Probabilmente gli utenti amministratori loggati dovrebbero poter vedere le ``Questions`` non pubblicate, ma non gli utenti normali. Sottolineamo: qualsiasi cosa venga aggiunta al codice per ottenere questo scopo, dovrebbe essere coperto da un test, sia che tu scriva prima il test e poi il codice per superare il test, sia che lavori sulla logica del codice e poi scrivi un test che la copra.
ja: もしかすると管理者としてログインしているユーザーは、一般の訪問者と違い、 まだ公開されていない ``Questions`` を見ることができるようにした方がいいかもしれません。また繰り返しになりますが、この問題を解決するためにソフトウェアにどんなコードが追加されべきであったとしても、そのコードにはテストが伴うべきです。テストを先に書いてからそのテストを通るコードを書くのか、あるいはコードの中で先にロジックを試してからテストを書いてそれを検証するのか、いずれにしてもです。
pl: Prawdopodobnie zalogowani administratorzy powinni móc widzieć nieopublikowane ``Questions``, lecz nie zwykli użytkownicy. Znów: cokolwiek powinno być dodane do oprogramowania, by to osiągnąć, powinnien mu towarzyszyć test. Niezależnie, czy najpierw napiszesz test a później stworzysz kod, który go przechodzi, czy najpierw wykujesz logikę w swoim kodzie a następnie napiszesz test, żeby ją potwierdzić.
zh_hans: 恩，也许你想让管理员能在目录上看见未被发布的那些投票，但是普通用户看不到。不管怎么说，如果你想要增加一个新功能，那么同时一定要为它编写测试。不过你是先写代码还是先写测试那就随你了。

source: At a certain point you are bound to look at your tests and wonder whether your code is suffering from test bloat, which brings us to:
el: Θα φτάσετε σε ένα σημείο όπου θα κοιτάζετε τα τεστ σας και θα αναρωτιέστε αν ο κώδικας σας υποφέρει από υπερβολικό αριθμό τεστ, κάτι το οποίο μας φέρνει στο εξής:
it: Ad un certo punto sarai obbligato a guardare i tuoi test e chiederti se il tuo codice soffra di eccesso di test , il che ci porta a:
ja: ある時点で、書いたテストが限界に達しているように見え、テストが膨らみすぎてコードが苦しくなってしまうのではないかという疑問が浮かんでくるでしょう。こうなって場合にはどうすれば良いのでしょうか？
pl: W pewnym momencie na pewno spojrzysz na swoje testy i zaczniesz zastanawiać się, czy Twój kod nie cierpi na testowe wzdęcia, co prowadzi nas do:
zh_hans: 在未来的某个时刻，你一定会去查看测试代码，然后开始怀疑：「这么多的测试不会使代码越来越复杂吗？」。别着急，我们马上就会谈到这一点。

source: When testing, more is better
el: Όταν τεστάρετε, το περισσότερο είναι καλύτερο
it: Nei test, di più è meglio
ja: テストにおいて、多いことはいいことだ
pl: Testując, im więcej tym lepiej
zh_hans: 当需要测试的时候，测试用例越多越好

source: It might seem that our tests are growing out of control. At this rate there will soon be more code in our tests than in our application, and the repetition is unaesthetic, compared to the elegant conciseness of the rest of our code.
el: Ίσως να φαίνεται ότι τα τεστ αρχίζουν και γίνονται τεράστια καθώς και μη ελέγξιμα. Σύντομα θα διαπιστώσετε ότι υπάρχει περισσότερος κώδικας στα τεστ παρά στην εφαρμογή την ίδια και ότι η επανάληψη είναι αντιαισθητική εν συγκρίσει με την κομψή περιεκτικότητα του υπόλοιπου κώδικα σας.
it: Potrebbe sembrare che i nostri test aumentino senza controllo. A questa velocità ci sarà in breve tempo più codice nei nostri test che nella nostra applicazione, e la ripetizione è antiestetica, in comparazione con l'eleganza della brevità del resto del nostro codice.
ja: 私たちのテストは、手がつけられないほど成長してしまっているように見えるかもしれません。この割合で行けば、テストコードがアプリケーションのコードよりもすぐに大きくなってしまうでしょう。そして繰り返しは、残りの私たちのコードのエレガントな簡潔さに比べて、美しくありません。
pl: Może się wydawać, że nasze testy zaczynają wymykać się spod kontroli. W takim tempie wkrótce będzie więcej kodu w naszych testach niż w naszej aplikacji, a powtórzenia są nieestetyczne, w porównaniu do eleganckiej zwięzłości reszty naszego kodu.
zh_hans: 貌似我们的测试多的快要失去控制了。按照这样发展下去，测试代码就要变得比应用的实际代码还要多了。而且测试代码大多都是重复且不优雅的，特别是在和业务代码比起来的时候，这种感觉更加明显。

source: **It doesn't matter**. Let them grow. For the most part, you can write a test once and then forget about it. It will continue performing its useful function as you continue to develop your program.
el: **Δεν πειράζει**. Αφήστε το να μεγαλώσει. Τις πιο πολλές φορές θα γράψετε ένα τεστ και μετά θα το ξεχάσετε. Εκείνο όμως θα κάνει τη δουλειά του όσο εσείς συνεχίζετε με την ανάπτυξη της εφαρμογής σας (και γενικά όλου του project σας).
it: ** Non importa **. Lascia che crescano. Per la maggior parte puoi scrivere un test una volta e poi dimenticartene. Continuerà a svolgere la sua funzione mentre continui a sviluppare il programma.
ja: **構いません**。 テストコードを大きくしましょう。たいていあなたはテストを一回書いてそのことを忘れます。プログラムを開発し終えるまで便利な関数を使いそれを続けましょう。
pl: **To nie ma znaczenia**. Pozwól im rosnąć. W większości przypadków możesz napisać test raz i później zapomnieć o nim. Będzie dalej wykazywał przydatność w trakcie twojej pracy nad programem.
zh_hans: **但是这没关系！** 就让测试代码继续肆意增长吧。大部分情况下，你写完一个测试之后就可以忘掉它了。在你继续开发的过程中，它会一直默默无闻地为你做贡献的。

source: Sometimes tests will need to be updated. Suppose that we amend our views so that only ``Questions`` with ``Choices`` are published. In that case, many of our existing tests will fail - *telling us exactly which tests need to be amended to bring them up to date*, so to that extent tests help look after themselves.
el: Μερικές φορές τα τεστ θα χρειαστεί να αναβαθμιστούν. Υποθέστε ότι βελτιώνουμε τα views ούτως ώστε μόνο οι ερωτήσεις (``Questions``) που έχουν απαντήσεις (``Choices``) θα γίνουν published. Σε αυτή την περίπτωση πολλά από τα τεστ μας θα αποτύχουν - *λέγοντας μας ακριβώς ποια τεστ θα χρειαστεί να βελτιώσουμε για να είναι συμβατά με την εφαρμογή μας*. Οπότε όσον αφορά την ανανέωση των τεστ, μην ανησυχείτε, τα τεστ φροντίζουν μόνα τους για τους εαυτούς τους.
it: A volte i test avranno bisogno di un aggiornamento. Mettiamo caso che cambiano le nostre view in modo che solo ``Questions`` con ``Choices`` vengano pubblicate. In questo caso, molti dei nostri test falliranno - *dicendoci esattamente quali test bisogna aggiornare, così che l'aggiornamento farà in modo da farli superare al prossimo giro.
ja: 時には、テストにアップデートが必要になることがあります。``Choices`` を持つ ``Questions`` だけを公開するよう、ビューを修正したときのことを思い出してください。この後、既存のテストの多くは失敗します。この失敗は、*どのテストが、最新の状態に対応するために修正する必要があるのか* をわたしたちに教えてくれているのです。テストはこの意味でも、テスト自身をチェックするのに役に立っています。
pl: Czasem trzeba zaktualizować testy. Załóżmy, że modyfikujemy nasze widoki tak,aby tylko ``Questions`` z ``Choices`` były publikowane. W tym przypadku wiele naszych istniejących testów nie powiedzie się – *mówiąc nam dokładnie które testy powinny zostać zmodyfikowane, aby były na bieżąco*, więc do takiego stopnia testy pomagają o siebie zadbać.
zh_hans: 但有时测试也需要更新。想象一下如果我们修改了视图，只显示有选项的那些投票，那么只前写的很多测试就都会失败。*但这也明确地告诉了我们哪些测试需要被更新*，所以测试也会测试自己。

source: At worst, as you continue developing, you might find that you have some tests that are now redundant. Even that's not a problem; in testing redundancy is a *good* thing.
el: Στη χειρότερη, καθώς αναπτύσσετε την εφαρμογή σας, ίσως βρεθείτε σε μια θέση όπου μερικά τεστ είναι πλέον περιττά. Και πάλι μην ανησυχείτε. Στον κόσμο του τεστ ο πλεονασμός (redundancy) είναι *καλό* στοιχείο.
it: Al peggio, dal momento che continui a sviluppare, potrai trovarti ad avere alcuni test che ora sono ridondanti. Nonostante questo, non è un problema; testare la ridondanza è una *buona* prassi.
ja: 最悪の場合、開発を続けていくにつれて、あるテストが今では冗長なものになっていることに気づいてしまうかもしれません。これも問題ではありません。テストにおいては、冗長であることは *良い* ことなのです。
pl: W najgorszym przypadku w trakcie pracy możesz zorientować się, że masz jakieś testy, które są teraz redundantne. Nawet to nie jest problemem; w testowaniu redundancja jest rzeczą *dobrą*.
zh_hans: 最坏的情况是，当你继续开发的时候，发现之前的一些测试现在看来是多余的。但是这也不是什么问题，多做些测试也 *不错*。

source: As long as your tests are sensibly arranged, they won't become unmanageable. Good rules-of-thumb include having:
el: Όσο τα τεστ σας είναι λογικά οργανωμένα δεν θα γίνουν αδιαχείριστα. Μερικοί κανόνες όσον αφορά τα τεστ είναι:
it: Finché i tuoi test sono organizzati in modo ragionevole, non diventeranno ingestibili. Le buone regole pratiche includono avere:
ja: テストを意味のあるものとなるように整えている限り、手に負えないものになることはありません。経験上、次のルールを守るようにすれば問題ありません。
pl: Tak długo jak twoje testy są sensownie ułożone, nie zaczną być nie do zarządzania. Na praktyczne zasady składa się posiadanie:
zh_hans: 如果你对测试有个整体规划，那么它们就几乎不会变得混乱。下面有几条好的建议：

source: a separate ``TestClass`` for each model or view
el: μια ξεχωριστή ``TestClass`` για κάθε μοντέλο ή view
it: Una ``TestClass`` separata per ogni model o view
ja: モデルやビューごとに ``TestClass`` を分割する
pl: oddzielnego ``TestClass`` dla każdego modelu lub widoku
zh_hans: 对于每个模型和视图都建立单独的 ``TestClass``

source: a separate test method for each set of conditions you want to test
el: μια ξεχωριστή μέθοδο τεστ για κάθε κατάσταση που θέλετε να τεστάρετε
it: un metodo test separato per ogni set di condizioni che tu vuoi testare
ja: テストしたい条件の集まりのそれぞれに対して、異なるテストメソッドを作る
pl: oddzielnej metody testowej dla każdego zbioru warunków, które chcesz sprawdzać
zh_hans: 每个测试方法只测试一个功能

source: test method names that describe their function
el: να ονομάζετε τις μεθόδους τεστ όσο πιο περιεκτικά γίνεται σχετικά με αυτό που προσπαθούν να τεστάρουν
it: nomi di metodi di test che descrivono la loro funzione
ja: テストメソッドの名前は、その機能を説明するようなものにする
pl: nazw metod testowych, które opisują swoje funkcje
zh_hans: 给每个测试方法起个能描述其功能的名字

source: Further testing
el: Επιεπλέον τεστ
it: Altri test
ja: さらなるテスト
pl: Dalsze testowanie
zh_hans: 深入代码测试

source: This tutorial only introduces some of the basics of testing. There's a great deal more you can do, and a number of very useful tools at your disposal to achieve some very clever things.
el: Αυτό ο οδηγός έκανε μια εισαγωγή στον κόσμο των τεστ. Υπάρχουν πολλά περισσότερα που μπορείτε να κάνετε όπως επίσης και περισσότερα εργαλεία που μπορείτε να χρησιμοποιήσετε για να φτιάξετε πολύ έξυπνα τεστ.
it: Questo tutorial introduce solo alcune delle basi del testing. C'è molto di più che puoi fare ed una serie di strumenti molto utili sono a tua disposizione per realizzare cose molto ingegnose.
ja: このチュートリアルでは、テストの基本の一部を紹介しました。この他にもあなたにできることはまだまだたくさんありますし、いろいろと賢いことを実現するに使えるとても便利なツールが数多く用意されています。
pl: Ten tutorial przedstawia tylko podstawy testowania. Jest bardzo wiele rzeczy, które moesz robić i parę bardzo przydatnych narzędzi do twojej dyspozycji, by osiągać sprytne rzeczy.
zh_hans: 在本教程中，我们仅仅是了解了测试的基础知识。你能做的还有很多，而且世界上有很多有用的工具来帮你完成这些有意义的事。

source: For example, while our tests here have covered some of the internal logic of a model and the way our views publish information, you can use an "in-browser" framework such as Selenium_ to test the way your HTML actually renders in a browser. These tools allow you to check not just the behavior of your Django code, but also, for example, of your JavaScript. It's quite something to see the tests launch a browser, and start interacting with your site, as if a human being were driving it! Django includes :class:`~django.test.LiveServerTestCase` to facilitate integration with tools like Selenium.
el: Για παράδειγμα, παρόλο που τα τεστ σε αυτό τον οδηγό κάλυψαν ένα κομμάτι από την εσωτερική λειτουργία του κώδικα μας (μέθοδος μοντέλου) και άλλο ένα από τον τρόπο που τα views κάνουν publish τις ερωτήσεις μας, μπορείτε να χρησιμοποιήσετε ένα "in-browser" framework όπως το Selenium_ για να τεστάρετε τον τρόπο με τον οποίο η HTML γίνεται render στον browser. Αυτά τα εργαλεία δεν σας επιτρέπουν να ελέγξετε μόνο τη συμπεριφορά του Django κώδικα σας αλλά και του κώδικα π.χ της Javascript (που πολύ πιθανόν να έχετε). Είναι αρκετά συναρπαστικό να μπορείτε να βλέπετε τα τεστ σας να ανοίγουν τον browser σας και να αλληλεπιδρούν με το site ακριβώς όπως ένας άνθρωπος θα το έκανε! Το Django περιλαμβάνει την κλάση :class:`~django.test.LiveServerTestCase` για να διευκολύνει την ενσωμάτωση (συνεργασία) με εργαλεία όπως το Selenium.
it: Per esempio, mentre alcuni nostri test qui hanno coperto un po' di logica interna di un modello ed il modo in cui le view pubblicano le informazioni, puoi usare un framework "in-browser" come Selenium_ per controllare il modo in cui il tuo HTML viene mostrato nel browser. Questi tool inoltre ti permettono di controllare non solo il comportamento del tuo codice Django ma anche, per esempio, del tuo JavaScript. E' veramente fantastico vedere come i test lanciano il browser e ci interagiscono, come se si trattasse di un essere umano! Django include :class:`~django.test.LiveServerTestCase` per facilitare l'integrazione con tool come Selenium.
ja: たとえば、ここでのテストでは、モデルの内部ロジックと、ビューの情報の公開の仕方をカバーしましたが、ブラウザが HTML を実際にどのようにレンダリングのするのかをテストする Selenium_ のような "in-browser" のフレームワークを使うこともできます。これらのツールは、Django が生成したコードの振る舞いだけでなく、たとえば、 JavaScript の振る舞いも確認できます。テストがブラウザを起動してサイトとインタラクションしているのを見るのはとても面白いですよ。まるで本物の人間がブラウザを操作しているかのように見えるんです！ Django には、Selenium のようなツールとの連携を容易にしてくれる :class:`~django.test.LiveServerTestCase` が用意されています。
pl: Na przykład, podczas gdy nasze testy tutaj pokryły część wewnętrznej logiki modelu i sposobu, w jaki nasze widoki publikują informacje, możesz użyć „przeglądarkowego” frameworku takiego jak Selenium_, by testować, w jaki sposób twój HTML tak naprawdę renderuje się w przeglądarce. Takie narzędzia pozwalają na sprawdzenie nie tylko zachowania twojego kodu Django, ale też na przykład twojego JavaScriptu. Jest coś w tym, widzieć testy odpalane w przeglądarce i jak wchodzą w interakcje z twoją stroną, tak jakby robił to człowiek! Django zawiera :class:`~django.test.LiveServerTestCase`, aby ułatwić integrację z narzędziami jak Selenium.
zh_hans: 举个例子，在上述的测试中，我们已经从代码逻辑和视图响应的角度检查了应用的输出，现在你可以从一个更加 "in-browser" 的角度来检查最终渲染出的 HTML 是否符合预期，使用 Selenium 可以很轻松的完成这件事。这个工具不仅可以测试 Django 框架里的代码，还可以检查其他部分，比如说你的 JavaScript。它假装成是一个正在和你站点进行交互的浏览器，就好像有个真人在访问网站一样！Django 它提供了 :class:`~django.test.LiveServerTestCase` 来和 Selenium 这样的工具进行交互。

source: If you have a complex application, you may want to run tests automatically with every commit for the purposes of `continuous integration`_, so that quality control is itself - at least partially - automated.
el: Αν έχετε μια περίπλοκη εφαρμογή ίσως να θέλετε να τρέχουν τα τεστ, αυτόματα, κάθε φορά που κάνετε commit για λόγους του `continuous integration`_, ούτως ώστε το ίδιο το quality control (έλεγχος ποιότητας) - να είναι τουλάχιστον μερικώς - αυτοματοποιημένο.
it: Se hai un'applicazione complessa, potresti voler eseguire i test automaticamente ad ogni commit ai fini dell'integrazione continua_, in modo che il controllo di qualità sia esso stesso, almeno parzialmente, automatizzato.
ja: 複雑なアプリケーションを開発する時には、継続的インテグレーション (`continuous integration`_) のために、コミットの度に自動的にテストを実行したいくなるかもしれませんね。継続的インテグレーションを行れば、品質管理それ自体が、少なくとも部分的には自動化できます。
pl: Jeśli masz złożoną aplikację, możesz chcieć uruchamiać testy automatycznie z każdym commitem w celu utrzymania `ciągłej integracji`_, aby kontrola jakości była – przynajmniej częściowo – zautomatyzowana.
zh_hans: 如果你在开发一个很复杂的应用的话，你也许想在每次提交代码时自动运行测试，也就是我们所说的持续集成 `continuous integration`_ ，这样就能实现质量控制的自动化，起码是部分自动化。

source: A good way to spot untested parts of your application is to check code coverage. This also helps identify fragile or even dead code. If you can't test a piece of code, it usually means that code should be refactored or removed. Coverage will help to identify dead code. See :ref:`topics-testing-code-coverage` for details.
el: Ένας καλός τρόπος για να εντοπίσετε τα μέρη της εφαρμογής σας που δεν έχουν γραφτεί τεστ για αυτά, είναι να ελέγξετε το κατά πόσο είναι καλυμμένος ο κώδικας σας με τεστ. Αυτό επίσης σας βοηθά στο να αναγνωρίσετε αδύναμο ή ακόμη και αχρησιμοποίητο-νεκρό κώδικα. Αν δεν μπορείτε να τεστάρετε ένα κομμάτι κώδικα, τότε αυτό ίσως σημαίνει ότι ο κώδικας θα πρέπει να ξαναγραφτεί ή να αφαιρεθεί τελείως. Το Coverage θα σας βοηθήσει (και είναι πολύ σημαντικό αυτό) να αναγνωρίσετε τον νεκρό κώδικα. Δείτε στην αναφορά :ref:`Δουλεύοντας με το coverage.py <topics-testing-code-coverage>` για περισσότερες λεπτομέρειες.
it: Un buon modo per individuare parti della tua applicazione non testate è controllare la code coverage. Questo aiuta anche a identificare codice morto o fragile. Se tu non riesci a testare un pezzo di codice, di solito significa che quel codice dovrebbe essere rimosso o rielaborato. La Coverage aiuta a identificare codice non più in uso. Vedi :ref:`topics-testing-code-coverage` per avere dettagli.
ja: アプリケーションのテストされていない部分を発見するには、コードカバレッジをチェックするのが良いやり方です。これはまた、脆弱なコードや使用されていないデッドコードの発見にも役に立ちます。テストできないコード片がある場合、ふつうは、そのコードはリファクタリングするか削除する必要があることを意味します。カバレッジはデッドコードの識別に役に立つでしょう。詳細は :ref:`topics-testing-code-coverage` を参照してください。
pl: Dobrym sposobem, aby dostrzec nietestowane części twojej aplikacji, jest sprawdzić pokrycie testami. To pomaga też znaleźć delikatny lub nawet martwy kod. Jeśli nie możesz przetestować kawałka kodu, zazwyczaj znaczy to, że powinien on zostać zrefaktorowany lub usunięty. Pokrycie pomoże ci znaleźć martwy kod. Zobacz :ref:`topics-testing-code-coverage` po szczegóły.
zh_hans: 一个找出代码中未被测试部分的方法是检查代码覆盖率。它有助于找出代码中的薄弱部分和无用部分。如果你无法测试一段代码，通常说明这段代码需要被重构或者删除。想知道代码覆盖率和无用代码的详细信息，查看文档 :ref:`topics-testing-code-coverage` 获取详细信息。

source: :doc:`Testing in Django </topics/testing/index>` has comprehensive information about testing.
el: Επίσης το άρθρο :doc:`Testing με το Django </topics/testing/index>` περιέχει περισσότερες πληροφορίες σχετικά με το testing.
it: :doc:`Testare in Django </topics/testing/index>` contiene informazioni complete sui test.
ja: :doc:`Django におけるテスト </topics/testing/index>` には、テストに関する包括的な情報がまとめられています。
pl: :doc:`Testowanie w Django </topics/testing/index>` zawiera obszerną informację na temat testowania.
zh_hans: 文档 :doc:`Django 中的测试 </topics/testing/index>` 里有关于测试的更多信息。

source: For full details on testing, see :doc:`Testing in Django </topics/testing/index>`.
el: Για περισσότερες πληροφορίες σχετικά με τα τεστ δείτε στο άρθρο :doc:`Testing με το Django </topics/testing/index>`.
it: Per i dettagli completi sui test, vedi :doc:`Testare in Django </topics/testing/index>`.
ja: テストの詳細は、:doc:`Djagnoにおけるテスト </topics/testing/index>` を参照してください。
pl: Po pełną informację na temat testowania, zobacz :doc:`Testowanie w Django </topics/testing/index>`.
zh_hans: 如果你想深入了解测试，就去看 :doc:`Django 中的测试 </topics/testing/index>` 。

source: When you're comfortable with testing Django views, read :doc:`part 6 of this tutorial</intro/tutorial06>` to learn about static files management.
el: Όταν είστε εξοικειωμένοι με το concept και τη λειτουργία των τεστ στο Django, διαβάστε το :doc:`έκτο μέρος αυτού του οδηγού </intro/tutorial06>` για να μάθετε περισσότερα σχετικά με τη διαχείριση των στατικών αρχείων (static files).
it: Quando ti senti pronto e preparato nel testare le view Django, leggi :doc:`parte 6 di questo tutorial</intro/tutorial06>` per imparare a gestire i file statici.
ja: テストやビューを使いこなせるようになったら、 :doc:`チュートリアルその6 </intro/tutorial06>` に進んで、静的ファイルの管理について学びましょう。
pl: Kiedy już czujesz się dobrze z testowaniem widoków Django, przeczytaj :doc:`część 6 tego tutoriala</intro/tutorial06>`, aby nauczyć się zarządzania plikami statycznymi.
zh_hans: 当你已经比较熟悉测试 Django 视图的方法后，就可以继续阅读 :doc:`教程第 6 部分</intro/tutorial06>` ，学习静态文件管理的相关知识。
