Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: A package can be imported with ``import foo.bar`` or ``from foo import bar``. For a directory (like ``polls``) to form a package, it must contain a special file ``__init__.py``, even if this file is empty.
el: Ένα package μπορεί να γίνει imported με τον κώδικα ``import foo.bar`` ή ``from foo import bar``. Για να μετατραπεί ένας φάκελος (όπως ο φάκελος ``polls``) σε package, θα πρέπει να περιέχει ένα ειδικό αρχείο με το όνομα ``__init__.py``, ακόμη και αν αυτό το αρχείο είναι κενό.
it: Un package puo essere importato con ``import foo.bar`` oppure ``from foo import bar``. Per una cartella ( come ``polls``) per creare un package, deve contenere un file speciale ``__init__.py``, anche se questo file puo restare vuoto.
ja: パッケージは ``import foo.bar`` または ``from foo import bar`` でインポートできます。パッケージ内のディレクトリ (例えば ``polls``) は ``__init__.py`` という特殊なファイルを、空のファイルでもいいので含む必要があります。
pl: Pakiet można zaimportować przez ``import foo.bar`` lub ``from foo import bar``. Aby katalog (jak ``polls``) stał się pakietem, musi zawierać specjalny plik ``__init__.py``, który może być pusty.
zh_hans: 一个包通过 ``import foo.bar`` 或 ``from foo import bar`` 的形式导入。一个目录（例如 ``polls``）要成为一个包，它必须包含一个特定的文件 ``__init__.py``，即便这个文件是空的。

source: A Django *application* is just a Python package that is specifically intended for use in a Django project. An application may use common Django conventions, such as having ``models``, ``tests``, ``urls``, and ``views`` submodules.
el: Ένα Django *application* είναι απλώς ένα Python package το οποίο προορίζεται για χρήση, αποκλειστικά, από ένα Django project. Ένα application (εφαρμογή) μπορεί να χρησιμοποιεί κοινές Django πρακτικές, όπως το να υπάρχουν submodules σαν τα ``models``, ``tests``, ``urls``, και ``views``.
ja: Django *アプリケーション* は単なる Python パッケージで、特に Django プロジェクトで使うよう意図されたものです。アプリは一般的な Django の慣例に則っているでしょう。例えば ``models`` 、``tests``, ``urls`` や ``views`` のサブモジュールがあったりです。
pl: *Aplikacja* Django jest tylko pakietem Pythona, który jest szczególnie przeznaczony do użycia w projekcie Django. Aplikacja może używać powszechnych w Django konwencji, jak posiadanie podmodułów ``models``, ``tests``, ``urls`` i ``views``.
zh_hans: Django *应用* 仅仅是专用于 Django 项目的 Python 包。应用会按照 Django 约定，创建好 ``models``, ``tests``, ``urls``, 以及 ``views`` 等子模块。

source: Later on we use the term *packaging* to describe the process of making a Python package easy for others to install. It can be a little confusing, we know.
el: Αργότερα χρησιμοποιούμε τον όρο *packaging* για να περιγράψουμε την διαδικασία που χρειάζεται για να δημιουργηθεί ένα Python package. Μπορεί να σας μπερδεύει λιγάκι. Καταλαβαίνουμε!
it: Più tardi usiamo il termine *packaging* per descrivere il processo di costruire un pacchetto python facile dagli altri per installare. Può essere un pochino confusonario, lo sappiamo
ja: 以降 *パッケージング* という言葉を、別の場所でインストールしやすいように Python パッケージを作るプロセスを表すのに用います。少し混乱するかもしれませんね。
pl: Dalej będziemy używać pojęcia *pakietowanie*, aby opisać proces robienia pakietu Pythona łatwego do instalacji dla innych. Mamy świadomość, że może to być nieco mylące.
zh_hans: 稍后，我们将解释术语 *打包* ——为了方便其它人安装 Python 包的处理流程。我知道，这可能会使你感到一点点迷惑。

source: Your project and your reusable app
el: Το project σας και η επαναχρησιμοποιήσιμη app
it: Il tuo progetto e la tua applicazione riutilizzabile
ja: プロジェクトと再利用可能アプリ
pl: Twój projekt i twoja aplikacja do ponownego wykorzystania
zh_hans: 你的项目和可复用应用

source: After the previous tutorials, our project should look like this::
el: Κατόπιν ολοκλήρωσης των προηγούμενων οδηγών, η δομή του project μας θα πρέπει να έχει αυτή τη μορφή::
it: Dopo i tutorial precedenti, il nostro progetto dovrebbe essere cosi ::
ja: 前のチュートリアルを終えると、プロジェクトはこのようになっていたはずです::
pl: Po poprzednich tutorialach, nasz projekt powinien wyglądać tak::
zh_hans: 通过前面的教程，我们的工程应该看起来像这样::

source: You created ``mysite/templates`` in :doc:`Tutorial 7 </intro/tutorial07>`, and ``polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>`. Now perhaps it is clearer why we chose to have separate template directories for the project and application: everything that is part of the polls application is in ``polls``. It makes the application self-contained and easier to drop into a new project.
el: Δημιουργήσατε τον φάκελο ``mysite/templates`` στον :doc:`Οδηγό 7 </intro/tutorial07>` και τον φάκελο ``polls/templates`` στον :doc:`Οδηγό 3 </intro/tutorial03>`. Τώρα ίσως φαίνεται πιο καθαρά ο λόγος που διαλέξαμε να έχουμε ξεχωριστούς template φακέλους για το project και για το application: οτιδήποτε είναι μέρος της εφαρμογής polls βρίσκεται μέσα στο ``polls``. Αυτό κάνει την εφαρμογή ανεξάρτητη και ευκολότερη να ενσωματωθεί μέσα σε ένα καινούργιο project.
it: Hai creato mysite/templates in :doc:`Tutorial 7 </intro/tutorial07> e `polls/templates`` in :doc:`Tutorial 3 </intro/tutorial03>. Ora forse è più chiaro perchè abbiamo scelto di separare le directories con i template tra progetto e applicazione: tutto ciò che fa parte dell'applicazione "polls" è dentro "polls". Questo rende l'applicazione più facile da rilasciare in un nuovo progetto poichè contiene tutte le informazioni dentro di se.
ja: すでに ``mysite/templates`` を :doc:`チュートリアル 7 </intro/tutorial07>` で、 ``polls/templates`` を :doc:`チュートリアル 3 </intro/tutorial03>` で作成しました。今になるとなぜテンプレートディレクトリをプロジェクトとアプリケーションに分けたかが明確にわかりますね。投票アプリケーションに関する全ては ``polls`` にあります。アプリケーションが自己完結していて、新規のプロジェクトにも導入しやすくなっています。
pl: Stworzyłeś ``mysite/templates`` w :doc:`Tutorialu 7 </intro/tutorial07>` i ``polls/templates`` w :doc:`Tutorialu 3 </intro/tutorial03>`. Teraz prawdopodobnie jest jaśniejsze dlaczego postanowiliśmy mieć osobne katalogi szablonów dla projektu i aplikacji: wszystko, co jest częścią aplikacji ankietowej jest w ``polls``. To powoduje, że aplikacja jest w jednym kawałku i prościej ją wrzucić w nowy projekt.

source: The ``polls`` directory could now be copied into a new Django project and immediately reused. It's not quite ready to be published though. For that, we need to package the app to make it easy for others to install.
el: Ο φάκελο ``polls`` μπορεί εύκολα να αντιγραφεί σε ένα καινούργιο Django project και αμέσως να επαναχρησιμοποιηθεί. Δεν είναι, όμως, ακόμη έτοιμο να διανεμηθεί (εκδοθεί). Γι’ αυτό θα πρέπει να μετατρέψουμε την εφαρμογή μας σε ένα package για να διευκολύνουμε τους άλλους που θα την εγκαταστήσουν.
it: La directory ``polls`` può essere copiata in un nuovo progetto Django e immediatamente riutilizzata. Non è completamente pronta per essere pubblicata. Per questo, dobbiamo creare un pacchetto dall'app per semplificare l'installazione da parte di altri.
ja: 今、 ``polls`` ディレクトリは新規の Django プロジェクトにコピーでき、すぐに再利用できる状態です。しかし公開するための準備が完璧というわけではありません。そのために、アプリをパッケージにして別の場所でインストールしやすいようにする必要があります。
pl: Katalog ``polls`` mógłby być teraz skopiowany do nowego projektu Django i od razu użyty. Ale nie jest zupełnie gotowy do bycia opublikowanym. Na tę potrzebę, musimy spakować naszą aplikację, aby ułatwić innym jej instalację.
zh_hans: 目录 ``polls`` 现在可以被拷贝至一个新的 Django 工程，且立刻被复用。不过现在还不是发布它的时候。为了这样做，我们需要打包这个应用，便于其他人安装它。

source: Installing some prerequisites
el: Εγκαθιστώντας μερικά προαπαιτούμενα
it: Installazione di alcuni prerequisiti
ja: 事前に必要な物をインストールする
pl: Instalowanie narzędzi
zh_hans: 安装必须环境

source: The current state of Python packaging is a bit muddled with various tools. For this tutorial, we're going to use setuptools_ to build our package. It's the recommended packaging tool (merged with the ``distribute`` fork). We'll also be using `pip`_ to install and uninstall it. You should install these two packages now. If you need help, you can refer to :ref:`how to install Django with pip<installing-official-release>`. You can install ``setuptools`` the same way.
el: Η παρούσα κατάσταση του Python packaging είναι λιγάκι συγκεχυμένη με διάφορα εργαλεία. Για αυτό τον οδηγό, θα χρησιμοποιήσουμε το εργαλείο setuptools_ για να χτίσουμε το package (πακέτο) μας. Είναι το προτεινόμενο εργαλείο για packaging (το οποίο έχει γίνει merged με το fork του ``distribute``). Θα χρησιμοποιήσουμε, επίσης, το `pip`_ για να το εγκαταστήσουμε και να το απεγκαταστήσουμε. Θα χρειαστεί να εγκαταστήσετε τα δύο αυτά πακέτα τώρα. Αν χρειάζεστε βοήθεια, μπορείτε να ανατρέξετε στο :ref:`πως να εγκαταστήσω το Django με το pip <installing-official-release>`. Μπορείτε να εγκαταστήσετε το πακέτο ``setuptools`` με τον ίδιο τρόπο.
it: Lo stato corrente del packaging di Python è un pochino confuso con vari tool. Per questo tutorial, useremo setuptools_ per costruire il nostro package. E' il tool di packaging raccomandato (in merge con il fork ``distribute``). Useremo anche `pip`_ per installarlo e disinstallarlo. Dovresti installare questi due package ora. Se ti serve aiuto, puoi fare riferimento a :ref:`come installare Django con pip1<installing-official-release>`. Puoi installare ``setuptools`` allo stesso modo.
ja: Python のパッケージングの現状は、複数のツールがあることで少しややこしいです。このチュートリアルでは setuptools_ をパッケージに使用します。これはおすすめのパッケージングツールです( forkされていた ``distribute`` はマージされました)。終わった後にアンインストールするために `pip`_ も使います。今はこの 2 つのパッケージをインストールしておいてください。分からなければ :ref:`Django をpip でインストールする <installing-official-release>`. を参照してください。 ``distribute`` も同じ方法でインストールできます。
pl: Bieżący stan pakietowania w Pythonie jest nieco zagmatwany przez wiele narzędzi. Na potrzeby tego tutorialu, użyjemy setuptools_, aby zbudować nasz pakiet. Są one zalecanym narzędziem pakietowania (zmergowane z forkiem ``distribute``). Będziemy też używać `pipa`_, aby go zainstalować i odinstalować. Powinieneś teraz zainstalować te dwa pakiety. Jeśli potrzebujesz pomocy, możesz zajrzeć do :ref:`jak zainstalować Django używając pipa<installing-official-release>`. W ten sam sposób możesz zainstalować ``setuptools``.
zh_hans: 目前，打包 Python 程序需要工具，有许多工具可以完成此项工作。在此教程中，我们将使用 setuptools_ 来打包我们的程序。这是推荐的打包工具（与 ``发布`` 分支合并）。我们仍旧使用 `pip`_ 来安装和卸载这个工具。现在，你需要安装这两个包。如果你需要帮助，你可以参考 :ref:`如何通过 pip 安装 Django<installing-official-release>`，你可以通过相同的方式安装 ``setuptools``。

source: Packaging your app
el: Πακετάροντας το app σας
it: Pacchettizzare la tua applicazione
ja: アプリケーションをパッケージングする
pl: Pakowanie twojej aplikacji
zh_hans: 打包你的应用

source: Python *packaging* refers to preparing your app in a specific format that can be easily installed and used. Django itself is packaged very much like this. For a small app like polls, this process isn't too difficult.
el: Το Python *packaging* αναφέρεται στην προετοιμασία του app σε μια συγκεκριμένη μορφή ούτως ώστε να μπορεί να εγκατασταθεί και να χρησιμοποιηθεί εύκολα. Το Django από μόνο του έχει πακεταριστεί με παρόμοιο τρόπο. Για μικρά apps όπως το polls, αυτή η διαδικασία δεν είναι δύσκολη.
it: Il *packaging* Python si riferisce al preparare la tua app in un formato specifico che può essere facilmente installato e riutilizzato. Django stesso è "impacchettato" così. Per piccole app come polls, è un processo non molto difficile.
ja: Python の *パッケージング* は特定のフォーマットでアプリを作っておくことを指します。このフォーマットは簡単にインストールして使えます。 Django 自体もこのようにパッケージ化されています。投票アプリのような小さなものでは、このプロセスはそれほど難しいものではありません。
pl: Pythonowe *pakietowanie* oznacza przygotowane twojej aplikacji w określonym formacie, który będzie mógł być prosto zainstalowany i użyty. Samo Django jest zapakowane właśnie w ten sposób. Dla małej aplikacji jak ankiety, ten proces nie jest zbyt skomplikowany.
zh_hans: Python 的 *打包* 将以一种特殊的格式组织你的应用，意在方便安装和使用这个应用。Django 本身就被打包成类似的形式。对于一个小应用，例如 polls，这不会太难。

source: First, create a parent directory for ``polls``, outside of your Django project. Call this directory ``django-polls``.
el: Αρχικά, δημιουργήστε ένα φάκελο για την εφαρμογή ``polls``, έξω από το Django project σας. Δώστε του όνομα ``django-polls``.
it: Primo, crea una directory principale per ``polls``, all'esterno del tuo progetto Django. Nomina questa cartella ``django-polls``.
ja: はじめに、 ``polls`` の親ディレクトリを、 Django プロジェクトの外に作りましょう。 ``django-polls`` というディレクトリにします。
pl: Najpierw stwórz katalog nadrzędny dla ``polls``, poza swoim projektem Django. Nazwij ten katalog ``django-polls``.
zh_hans: 首先，在你的 Django 项目目录外创建一个名为 ``django-polls`` 的文件夹，用于盛放 ``polls``。

source: Choosing a name for your app
el: Επιλέγοντας ένα όνομα για την εφαρμογή σας
it: Scegli un nome per la tua app
ja: アプリケーションの名前を選んでください
pl: Wybór nazwy dla twojej aplikacji
zh_hans: 为你的应用选择一个名字

source: When choosing a name for your package, check resources like PyPI to avoid naming conflicts with existing packages. It's often useful to prepend ``django-`` to your module name when creating a package to distribute. This helps others looking for Django apps identify your app as Django specific.
el: Όταν διαλέγετε ένα όνομα για την εφαρμογή σας, ελέγξτε πρώτα μέσω του PyPI για τυχόν ήδη πιασμένα ονόματα άλλων εφαρμογών. Συχνά, είναι χρήσιμο να χρησιμοποιείται τη λέξη ``django-`` πριν το όνομα της εφαρμογής σας που πρόκειται να διανείμετε. Αυτό βοηθάει τους άλλους όταν κοιτάζουν συγκεκριμένα για Django apps προκειμένου να αναγνωρίσουν την εφαρμογή σας ως django-specific.
it: Quando scegli un nome per il tuo package controlla le risorse come PyPI per evitare di generare conflitti con i nomi di packages esistenti. E' convenzione anteporre "django-" al nome del tuo modulo quando si crea un package da distribuire. Questo aiuta le persone alla ricerca di applicazioni per Django a identificare la tua come specifica per Django.
ja: パッケージの名前を決めるときま、 PyPI のようなリソースをチェックして、すでにあるパッケージとの名前の衝突を避ける必要があります。 Django アプリケーションのパッケージを作って配布する際には、モジュール名の先頭に ``django-`` を付けるのがよいでしょう。これによって Django アプリを探してる人が、作ったアプリが Django 特化のものであると分かりやすいからです。
pl: Wybierają nazwę dla swojego pakietu, sprawdź miejsca takie jak PyPI, aby uniknąć konfliktu nazw z istniejącymi pakietami. Często przydaje się dodać ``django-`` to nazwy twojego modułu tworząc pakiet do dystrybucji. To pomaga innym szukającym aplikacje Django rozróżnić twoją aplikację jako djangową.
zh_hans: 当为你的包选一个名字时，避免使用像 PyPI 这样已存在的包名，否则会导致冲突。当你创建你的发布包时，可以在模块名前增加 ``django-`` 前缀，这是一个很常用也很有用的避免包名冲突的方法。同时也有助于他人在寻找 Django 应用时确认你的 app 是 Django 独有的。

source: Application labels (that is, the final part of the dotted path to application packages) *must* be unique in :setting:`INSTALLED_APPS`. Avoid using the same label as any of the Django :doc:`contrib packages </ref/contrib/index>`, for example ``auth``, ``admin``, or ``messages``.
el: Τα application labels (δηλαδή, η τελευταία λέξη των application packages στη διαδρομή με τις τελείες) *πρέπει* να είναι μοναδικό στη ρύθμιση :setting:`INSTALLED_APPS`. Αποφύγετε να χρησιμοποιείτε το ίδιο label με οποιοδήποτε από αυτά των Django :doc:`contrib packages </ref/contrib/index>`, όπως για παράδειγμα ``auth``, ``admin`` ή ``messages``.
it: L' etichetta dell' applicazione (cioè, la parte finale del percorso puntato al package dell'applicazione) *deve* essere unica in :setting:`INSTALLED_APPS`. Evita di usare le stesse etichette di uno degli Django :doc:`contrib packages </ref/contrib/index>`, per esempio ``auth``, ``admin``, o ``messages``.
ja: アプリケーションラベル (アプリケーションパッケージのドット分けされたパスの最後の部分です)は :setting:`INSTALLED_APPS`の中で*必ず*ユニークでなければなりません。``auth``、``admin`` や ``messages``のようなDjango :doc:`contrib packages </ref/contrib/index>` のどれとも同じラベルを使うことは避けます。
pl: Etykiety aplikacji (czyli ostatnia część kropkowanej ścieżki do pakietów aplikacji) *musi* być unikalna w :setting:`INSTALLED_APPS`. Unikaj używania takich samych etykiet jak którykolwiek z :doc:`pakietów contrib </ref/contrib/index>`, na przykład ``auth``, ``admin`` lub ``messages``.
zh_hans: 应用标签（指用点分隔的包名的最后一部分）在 :setting:`INSTALLED_APPS` 中 *必须* 是独一无二的。避免使用任何与 Django :doc:`contrib packages </ref/contrib/index>` 文档中相同的标签名，比如 ``auth``，``admin``，``messages``。

source: Move the ``polls`` directory into the ``django-polls`` directory.
el: Μετακινήστε τον φάκελο ``polls`` μέσα στον φάκελο ``django-polls``.
it: Sposta la cartella ``polls`` nella cartella ``django-polls``.
ja: ``polls`` ディレクトリを ``django-polls`` ディレクトリに移動する
pl: Przenieś katalog ``polls`` do katalogu ``django-polls``.
zh_hans: 将 ``polls`` 目录移入 ``django-polls`` 目录。

source: Create a file ``django-polls/README.rst`` with the following contents:
el: Δημιουργήστε ένα αρχείο ``django-polls/README.rst`` με το ακόλουθο περιεχόμενο:
it: Crea un file ``django-polls/README.rst`` con il seguente contenuto:
ja: 以下の内容の ``django-polls/README.rst`` という名前のファイルを作成します:
pl: Stwórz plik ``django-polls/README.rst`` o następującej treści:
zh_hans: 创建一个名为 ``django-polls/README.rst`` 的文件，包含以下内容：

source: Create a ``django-polls/LICENSE`` file. Choosing a license is beyond the scope of this tutorial, but suffice it to say that code released publicly without a license is *useless*. Django and many Django-compatible apps are distributed under the BSD license; however, you're free to pick your own license. Just be aware that your licensing choice will affect who is able to use your code.
el: Δημιουργήστε ένα αρχείο ``django-polls/LICENSE``. Η επιλογή μιας άδειας (license) είναι πέρα από τους σκοπούς αυτού του οδηγού, αλλά αρκεί να πούμε ότι κώδικας που έχει δημοσιευτεί χωρίς άδεια είναι *άχρηστος*. Το Django και πολλά άλλα συμβατα με το Django apps είναι διανεμημένα κάτω από την BSD άδεια. Ωστόσο, είστε ελεύθεροι να διαλέξετε μια της αρέσκειας σας. Κρατήστε στο μυαλό σας, όμως, ότι η επιλογή της αδείας επηρεάζει το ποιος θα μπορεί να χρησιμοποιήσει τον κώδικα σας.
it: Crea un file ``django-polls/LICENSE`. Scegliere una licenza è oltre lo scopo di questo tutorial, ma è sufficiente dire che il codice rilasciato pubblicamente senza licenza è *inutile*. Django e molte app Django-compatibili sono distribuite sotto la licenza BSD; comunque, sei libero di scegliere la licenza che preferisci. Sii solo consapevole che la licenza che scegli influenzerà anche quelli che usano il tuo codice.
ja: ``django-polls/LICENSE`` ファイルを作成します。ライセンスの選択はこのチュートリアルの範疇を超えていますが、ライセンスなしで公にリリースされたコードは *役立たず* であると言えば十分です。 Django と多くの Django 互換アプリケーションはBSDライセンスの元に配布されます。でもどのライセンスを選択するかは自由です。ライセンスの選択は、誰がコードを使え得るかに影響すると注意してください。
pl: Stwórz plik ``django-polls/LICENSE``. Wybór licencji jest poza zakresem tego tutorialu, ale wystarczy powiedzieć, że kod wydany publicznie bez licencji jest *bezużyteczny*. Django i wiele kompatybilnych z Django aplikacji są rozpowszechniane na licencji BSD, aczkolwiek ty możesz wybrać swoją własną licencję. Bądź tylko świadom, że wybór licencji będzie miał wpływ na to, kto może używać twój kod.
zh_hans: 创建一个 ``django-polls/LICENSE`` 文件。选择一个非本教程使用的授权协议，但是要足以说明发布代码没有授权证书是 *不可能的* 。Django 和很多兼容 Django 的应用是以 BSD 授权协议发布的；不过，你可以自己选择一个授权协议。只要确定你选择的协议能够限制未来会使用你的代码的人。

source: Next we'll create a ``setup.py`` file which provides details about how to build and install the app. A full explanation of this file is beyond the scope of this tutorial, but the `setuptools docs <https://pythonhosted.org/setuptools/setuptools.html>`_ have a good explanation. Create a file ``django-polls/setup.py`` with the following contents:
ja: 次に ``setup.py`` ファイルを作りましょう。これはアプリケーションがどのようにビルド、インストールされるかを提供するものです。このファイルの網羅的な説明はこのチュートリアルの範疇を超えていますが、 `setuptools のドキュメント <https://pythonhosted.org/setuptools/setuptools.html>`_ には役立つ説明があります。以下のように ``django-polls/setup.py`` ファイルを作ってみましょう:

source: Only Python modules and packages are included in the package by default. To include additional files, we'll need to create a ``MANIFEST.in`` file. The setuptools docs referred to in the previous step discuss this file in more details. To include the templates, the ``README.rst`` and our ``LICENSE`` file, create a file ``django-polls/MANIFEST.in`` with the following contents:
el: Μόνο τα Python modules και τα packages περιλαμβάνονται στο package από προεπιλογή. Για να συμπεριλάβετε και πρόσθετα αρχεία, θα χρειαστεί να δημιουργήσουμε ένα αρχείο ``MANIFEST.in``. Το εγχειρίδιο του πακέτου setuptools αναφέρεται σε αυτό το αρχείο με λεπτομέρεια. Για να συμπεριλάβετε τα templates, το ``README.rst`` και το αρχείο ``LICENSE``, δημιουργήστε ένα αρχείο ``django-polls/MANIFEST.in`` με το ακόλουθο περιεχόμενο:
it: Solo i moduli ed i package Python sono inclusi di default nel package. Per includere altri file, dobbiamo creare un file ``MANIFEST.in``. I documenti setuptools a cui abbiamo fatto riferimento nello step precedente, discutono questo file in dettaglio. Per includere i template, il file ``README.rst`` ed il nostro file ``LICENSE``, crea un file ``django-polls/MANIFEST.in`` con i seguenti contenuti:
ja: デフォルトでは、パッケージには Python のモジュールとパッケージだけがまとめられます。追加のファイルを含めるには、``MANIFEST.in`` というファイルを作成する必要があります。前のステップで挙げた setuptools のドキュメントには、このファイルについて詳しい説明があります。テンプレート、``README.rst``、および ``LICENSE`` をパッケージに含めるには、``django-polls/MANIFEST.in`` というファイルを作成し、その中に次のように書きます。
pl: Domyślnie tylko pythonowe moduły i pakiety zawierają się w pakiecie. Aby zawrzeć dodatkowe pliki, musimy stworzyć plik ``MANIFEST.in``. Dokumentacja setuptools, do której odsyłaliśmy w poprzednim punkcie opisuje ten plik w szczegółach. Aby zawrzeć szablony, pliki ``README.rst`` i ``LICENSE``, stwórz plik ``django-polls/MANIFEST.in`` o następującej treści:
zh_hans: 默认包中只包含 Python 模块和包。为了包含额外文件，我们需要创建一个名为 ``MANIFEST.in`` 的文件。上一步中关于 setuptools 的文档详细介绍了这个文件。为了包含模板、``README.rst`` 和我们的 ``LICENSE`` 文件，创建文件 ``django-polls/MANIFEST.in`` 包含以下内容：

source: It's optional, but recommended, to include detailed documentation with your app. Create an empty directory ``django-polls/docs`` for future documentation. Add an additional line to ``django-polls/MANIFEST.in``::
el: Προτείνεται, παρόλο που είναι προαιρετικό, να συμπεριλάβετε ένα λεπτομερές εγχειρίδιο (documentation) με την εφαρμογή σας. Δημιουργήστε ένα κενό φάκελο ``django-polls/docs`` για μελλοντική προσθήκη του εγχειριδίου. Προσθέστε την ακόλουθη πρόσθετη γραμμή στο αρχείο ``django-polls/MANIFEST.in``::
it: Non è obbligatorio, ma si raccomanda, di includere una documentazione dettagliata con l'app. Crea una directory vuota ``django-polls/docs`` per la futura documentazione. Aggiungi una linea in ``django-polls/MANIFEST.in``::
ja: アプリケーションの詳細なドキュメントを含めるのは、任意ですが推奨されます。空のディレクトリ ``django-polls/docs`` を将来のドキュメンテーションのために作っておきましょう。 ``django-polls/MANAFEST.in`` に行を追加しておいてください::
pl: Opcjonalne, ale zalecane, jest zawarcie szczegółowej dokumentacji w twojej aplikacji. Stwórz pusty katalog ``django-polls/docs`` na przyszłą dokumentację. Dodaj nową linię w ``django-polls/MANIFEST.in``::
zh_hans: 在应用中包含详细文档是可选的，但我们推荐你这样做。创建一个空目录 ``django-polls/docs`` 用于未来编写文档。额外添加一行至 ``django-polls/MANIFEST.in`` ::

source: Note that the ``docs`` directory won't be included in your package unless you add some files to it. Many Django apps also provide their documentation online through sites like `readthedocs.org <https://readthedocs.org>`_.
el: Σημειώστε ότι ο φάκελος ``docs`` δεν θα συμπεριληφθεί στο package σας εκτός και αν προσθέσετε μερικά αρχεία μέσα. Σε περίπτωση που δεν το γνωρίζατε, πολλά Django apps παρέχουν το δικό τους documentation και online μέσα από ιστοσελίδες όπως η `readthedocs.org <https://readthedocs.org>`_.
it: Nota che la directory ``docs`` non verrà inclusa nel tuo package finchè non ci aggiungi dei file. Molte Django app offrono la loro documentazione online anche attraverso siti come `readthedocs.org <https://readthedocs.org>`_.
ja: ``MANIFEST.in`` に対象のファイルを追加しないと ``docs`` ディレクトリがパッケージに含まれないことに注意してください。多くの Django アプリではドキュメントを `readthedocs.org <https://readthedocs.org>`_ のようなサイトを通して提供しています。
pl: Zwróć uwagę, że katalog ``docs`` nie zostanie zawarty w twoim pakiecie dopóki nie dodasz do niego jakichś plików. Wiele aplikacji Django dostarcza swoją dokumentację online przez strony takie jak `readthedocs.org <https://readthedocs.org>`_.
zh_hans: 注意，现在 ``docs`` 目录不会被加入你的应用包，除非你往这个目录加几个文件。许多 Django 应用也提供他们的在线文档通过类似 `readthedocs.org <https://readthedocs.org>`_ 这样的网站。
