Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: If you are not using SQLite as your database, additional settings such as :setting:`USER`, :setting:`PASSWORD`, and :setting:`HOST` must be added. For more details, see the reference documentation for :setting:`DATABASES`.
el: Αν δεν χρησιμοποιείτε την SQLite, τότε θα πρέπει να δηλώσετε επιπρόσθετα στοιχεία όπως :setting:`USER`, :setting:`PASSWORD` και :setting:`HOST`. Για περισσότερες πληροφορίες, δείτε στην αντίστοιχη ενότητα του εγχειριδίου (documentation) σχετικά με :setting:`DATABASES`.
it: Se non stai usando SQLite come database, andranno aggiunte impostazioni come :setting:`USER`, :setting:`PASSWORD`, e :setting:`HOST`. Per maggiori dettagli, guarda :setting:`DATABASES`.
ja: データベースとして SQLite を使っていない場合、 :setting:`USER` や :setting:`PASSWORD` そして :setting:`HOST などの追加設定を加える必要があります。詳細については :setting:`DATABASES` のリファレンスドキュメントを参照してください。
pl: Jeśli nie używasz SQLite'a jako swojej bazy danych, musisz dodać dodatkowe ustawienia, takie jak :settings:`USER`, :setting:`PASSWORD` i :setting:`HOST`. Po więcej szczegółów, zobacz dokumentację :setting:`DATABASES`.
zh_hans: 如果你不使用 SQLite，则必须添加一些额外设置，比如 :setting:`USER` 、 :setting:`PASSWORD` 、 :setting:`HOST` 等等。想了解更多数据库设置方面的内容，请看文档：:setting:`DATABASES` 。

source: For databases other than SQLite
el: Για βάσεις δεδομένων πλην της SQLite
it: Per base dati diverse da SQLite
ja: SQLite 以外のデータベースの場合
pl: Dla baz danych innych niż SQLite
zh_hans: SQLite 以外的其它数据库

source: If you're using a database besides SQLite, make sure you've created a database by this point. Do that with "``CREATE DATABASE database_name;``" within your database's interactive prompt.
el: Αν χρησιμοποιείτε βάση δεδομένων διαφορετική από την SQLite, σιγουρευτείτε ότι έχετε δημιουργήσει κάποια βάση πριν προχωρήσετε. Κάντε το με την εντολή "``CREATE DATABASE database_name;``" μέσα από την interactive κονσόλα της βάσης δεδομένων σας.
it: Se stai utilizzando un database oltre a SQLite, assicurati di aver creato un database a questo punto. Fallo con "``CREATE DATABASE database_name;``" all'interno del prompt interattivo del tuo database.
ja: もし SQLite 以外を使っている場合、 database を今のうちに作っておいてください。 "``CREATE DATABASE database_name;``" とデータベースのインタラクティブプロンプトで実行してください。
pl: Jeśli używasz bazy danych innej niż SQLite, upewnij się, że do tego miejsca stworzyłeś bazę danych. Zrób to używając „``CREATE DATABASE nazwa_bazy_danych;``” w interaktywnym prompcie twojej bazy danych.
zh_hans: 如果你使用了 SQLite 以外的数据库，请确认在使用前已经创建了数据库。你可以通过在你的数据库交互式命令行中使用 "``CREATE DATABASE database_name;``" 命令来完成这件事。

source: Also make sure that the database user provided in :file:`mysite/settings.py` has "create database" privileges. This allows automatic creation of a :ref:`test database <the-test-database>` which will be needed in a later tutorial.
el: Επίσης σιγουρευτείτε ότι ο χρήστης (user) που δηλώσατε στην ρύθμιση :setting:`USER` στο αρχείο :file:`mysite/settings.py` έχει δικαιώματα "create database". Αυτό θα μας επιτρέψει την αυτόματη δημιουργία μιας :ref:`test database <the-test-database>` η οποία θα μας χρειαστεί αργότερα στον οδηγό.
it: Assicurati anche che l'utente del database fornito in :file:`mysite/settings.py` abbia i privilegi di "creazione del database". Ciò consente la creazione automatica di un :ref:`test database di test <the-test-database>` che sarà necessario in un tutorial successivo.
ja: :file:`mysite/settings.py` のデータベースユーザに 「データベース作成」の権限があることを確認します。これは、この後のチュートリアルの :ref:`テストDB <the-test-database>` を自動作成することができます。
pl: Również upewnij się, że użytkownik bazy danych podany w :file:`mysite/settings.py` ma uprawnienia „create database”. To pozwala na automatyczne tworzenie :ref:`testowej bazy danych <the-test-database>`, której będziemy potrzebować w późniejszym tutorialu.
zh_hans: 另外，还要确保该数据库用户中提供 :file:`mysite/settings.py` 具有 "create database" 权限。这使得自动创建的 :ref:`test database <the-test-database>` 能被以后的教程使用。

source: If you're using SQLite, you don't need to create anything beforehand - the database file will be created automatically when it is needed.
el: Αν χρησιμοποιείτε την SQLite, δεν χρειάζεται να δημιουργήσετε τίποτα εκ των προτέρων. Το αρχείο της βάσης δεδομένων θα δημιουργηθεί αυτόματα όταν χρειαστεί.
it: Se stai utilizzando SQLite, non hai bisogno di creare nulla, i file del database verrano creati automaticamente quando sarà necessario.
ja: SQLite を使っている場合は、前もってすることはありません。必要であればデータベースファイルが自動で生成されます。
pl: Jeśli używasz SQLite'a, nie potrzebujesz nic tworzyć – plik bazy danych zostawnie stworzony automatycznie, kiedy będzie potrzebny.
zh_hans: 如果你使用 SQLite，那么你不需要在使用前做任何事——数据库会在需要的时候自动创建。

source: While you're editing :file:`mysite/settings.py`, set :setting:`TIME_ZONE` to your time zone.
el: Όσο επεξεργάζεστε το αρχείο :file:`mysite/settings.py`, θέστε τη ρύθμιση :setting:`TIME_ZONE` στη δική σας ζώνη ώρας (π.χ για την Ελλάδα αυτό θα γίνει ``'Europe/Athens'``).
it: Mentre stai modificando :file:`mysite/settings.py`, imposta :setting:`TIME_ZONE` sul tuo fuso orario.
ja: :file:`mysite/settings.py` を編集する際、 :setting:`TIME_ZONE` に自分のタイムゾーンも設定します。
pl: W trakcie edycji :file:`mysite/settings.py`, ustaw :setting:`TIME_ZONE` na swoją strefę czasową.
zh_hans: 编辑 :file:`mysite/settings.py` 文件前，先设置 :setting:`TIME_ZONE` 为你自己时区。

source: Also, note the :setting:`INSTALLED_APPS` setting at the top of the file. That holds the names of all Django applications that are activated in this Django instance. Apps can be used in multiple projects, and you can package and distribute them for use by others in their projects.
el: Επίσης, σημειώστε τη ρύθμιση :setting:`INSTALLED_APPS` στην αρχή του αρχείου. Αυτή η ρύθμιση κρατάει τα ονόματα όλων των Django applications που θα ενεργοποιηθούν κατά τη λειτουργία του Django (με άλλα λόγια αυτά που θα είναι διαθέσιμα). Τα apps μπορουν να χρησιμοποιηθούν σε πολλαπλά projects και μπορείτε επίσης να τα πακετάρετε και να τα διανέμετε για χρήση από άλλους χρήστες στα δικά τους projects.
it: Notate pure il :setting: `INSTALLED_APPS` setting in cima al file. Questo contiene i nomi di tutte le applicazioni che sono attivate in questa instanza di Django. L'app può essere utilizzata in più progetti, inoltre puoi creare un python package e distribuirlo per essere utilizzato in altri progetti.
ja: 同じく、ファイル先頭にある :setting:`INSTALLED_APPS` に注意してください。これはこのDjangoインスタンスの中で有効化されているすべてのDjangoアプリケーションの名前を保持しています。アプリは複数のプロジェクトによって使用されることができますし、また、他の開発者が彼らのプロジェクトで使用するためにパッケージして配布することもできます。
pl: Zwróć również uwagę na ustawienie :setting:`INSTALLED_APPS` na początku pliku. Trzyma ono nazwy wszystkich aplikacji Django, które są aktywowane w tej instancji Django. Aplikacje mogę być używane w wielu projektach i możesz je pakować i udostępniać innym do użytku w ich projektach.
zh_hans: 此外，关注一下文件头部的 :setting:`INSTALLED_APPS` 设置项。这里包括了会在你项目中启用的所有 Django 应用。应用能在多个项目中使用，你也可以打包并且发布应用，让别人使用它们。

source: By default, :setting:`INSTALLED_APPS` contains the following apps, all of which come with Django:
el: Από προεπιλογή, η ρύθμιση :setting:`INSTALLED_APPS` περιέχει τα ακόλουθα apps, όπου όλα έρχονται προεγκατεστημένα με το Django:
it: Per impostazione predefinita :setting:`INSTALLED_APPS` contiene le seguenti app, tutte fornite con Django:
ja: デフォルトでは、 :settings:`INSTALLED_APPS` には以下のアプリケーションがはいっています。
pl: Domyślnie :setting:`INSTALLED_APPS` zawiera następujące aplikacje, które są w pakiecie z Django:
zh_hans: 通常， :setting:`INSTALLED_APPS` 默认包括了以下 Django 的自带应用：

source: :mod:`django.contrib.admin` -- The admin site. You'll use it shortly.
el: :mod:`django.contrib.admin` -- Το admin site. Θα φτάσετε εκεί σε λίγο.
it: :mod:`django.contrib.admin` -- Il admin site. Lo userai a breve.
ja: :mod:`django.contrib.admin` - 管理（admin）サイト。まもなく使います
pl: :mod:`django.contrib.admin` – Panel administracyjny. Niedługo go użyjesz.
zh_hans: :mod:`django.contrib.admin` -- 管理员站点， 你很快就会使用它。

source: :mod:`django.contrib.auth` -- An authentication system.
el: :mod:`django.contrib.auth` -- Το σύστημα πιστοποίησης (authentication)
it: :mod:`django.contrib.auth` -- Un sistema di autenticazione.
ja: :mod:`django.contrib.auth` - 認証システム
pl: :mod:`django.contrib.auth` – System uwierzyteniania.
zh_hans: :mod:`django.contrib.auth` -- 认证授权系统。

source: :mod:`django.contrib.contenttypes` -- A framework for content types.
el: :mod:`django.contrib.contenttypes` -- Ένα framework για content types.
it: :mod:`django.contrib.contenttypes` -- Un framework per i tipi di contenuto.
ja: :mod:`django.contrib.contenttypes` - コンテンツタイプフレームワーク
pl: :mod:`django.contrib.contenttypes` – Framework dla typów treści.
zh_hans: :mod:`django.contrib.contenttypes` -- 内容类型框架。

source: :mod:`django.contrib.sessions` -- A session framework.
el: :mod:`django.contrib.sessions` -- Το session framework.
it: :mod:`django.contrib.sessions` -- Un framework di sessione.
ja: :mod:`django.contrib.sessions` - セッションフレームワーク
pl: :mod:`django.contrib.sessions` – Framework dla sesji.
zh_hans: :mod:`django.contrib.sessions` -- 会话框架。

source: :mod:`django.contrib.messages` -- A messaging framework.
el: :mod:`django.contrib.messages` -- Το messaging framework.
it: :mod:`django.contrib.messages` -- Un framework di messaggistica.
ja: :mod:`django.contrib.messages` - メッセージフレームワーク
pl: :mod:`django.contrib.messages` – Framework powiadomień.
zh_hans: :mod:`django.contrib.messages` -- 消息框架。

source: :mod:`django.contrib.staticfiles` -- A framework for managing static files.
el: :mod:`django.contrib.staticfiles` -- Ένα framework για να διαχειρίζεστε τα static files (css, js, φωτογραφίες, εικονίδια κλπ).
it: :mod:`django.contrib.staticfiles` -- Un framework per la gestione dei file statici.
ja: :mod:`django.contrib.staticfiles` - 静的ファイルの管理フレームワーク
pl: :mod:`django.contrib.staticfiles` – Framework do zarządzania plikami statycznymi.
zh_hans: :mod:`django.contrib.staticfiles` -- 管理静态文件的框架。

source: These applications are included by default as a convenience for the common case.
el: Αυτά τα applications συμπεριλαμβάνονται στο Django ως διευκόλυνση καθώς χρησιμοποιούνται όλα συνήθως.
it: Queste applicazioni sono incluse di default come convenienza per l'uso comune.
ja: これらの機能はよく使われるのでデフォルトで付属しています。
pl: Aplikacje te są włączone domyślnie jako udogodnienie dla powszechnych spraw.
zh_hans: 这些应用被默认启用是为了给常规项目提供方便。

source: Some of these applications make use of at least one database table, though, so we need to create the tables in the database before we can use them. To do that, run the following command:
el: Επιπροσθέτως, μερικά από αυτά τα applications χρειάζονται τουλάχιστον έναν πίνακα στη βάση δεδομένων (database table). Για το λόγο αυτό, θα πρέπει να δημιουργήσουμε αυτούς του πίνακες στη βάση μας, πριν ξεκινήσουμε να τα χρησιμοποιούμε. Για να το κάνετε αυτό, τρέξτε την ακόλουθη εντολή (από κονσόλα και ευρισκόμενοι στο root φάκελο του project σας):
it: Alcune di queste applicazioni utilizzano almeno una tabella nel database, quindi dobbiamo creare le tabelle nel database prima di poterle utilizzare. Per farlo, esegui il seguente comando:
ja: これらのアプリケーションは最低1つデータベースのテーブルを使うので、使い始まる前にデータベースにテーブルを作る必要があります。以下のコマンドを実行してください:
pl: Niektóre z tych aplikacji używają przynajmniej jednej tabeli w bazie danych, więc musimy stworzyć tabele w bazie danych zanim będziemy mogli je użyć. Aby to zrobić, uruchom następującą komendę:
zh_hans: 默认开启的某些应用需要至少一个数据表，所以，在使用他们之前需要在数据库中创建一些表。请执行以下命令：

source: The :djadmin:`migrate` command looks at the :setting:`INSTALLED_APPS` setting and creates any necessary database tables according to the database settings in your :file:`mysite/settings.py` file and the database migrations shipped with the app (we'll cover those later). You'll see a message for each migration it applies. If you're interested, run the command-line client for your database and type ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite), or ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) to display the tables Django created.
el: Η εντολή :djadmin:`migrate` κοιτάζει στη ρύθμιση :setting:`INSTALLED_APPS` και δημιουργεί τυχόν απαραίτητους πίνακες, βάση της ρύθμισης :setting:`DATABASES` του αρχείου :file:`mysite/settings.py` και βάση των database migrations τα οποία υπάρχουν σε κάθε app (θα το δούμε αυτό σε λίγο). Θα δείτε ένα μήνυμα για κάθε migration που ολοκληρώνεται. Αν ενδιαφέρεστε, τρέξτε την εντολή (μέσα από την interactive κονσόλα της βάσης δεδομένων σας) ``\dt`` (για PostgreSQL), ``SHOW TABLES;`` (για MySQL), ``.schema`` (για SQLite) ή ``SELECT TABLE_NAME FROM USER_TABLES;`` (για Oracle) για να σας εμφανιστούν οι πίνακες που δημιούργησε το Django για σας.
ja: :djadmin:`migrate` コマンドは :setting:`INSTALLED_APPS` の設定を参照するとともに、 :file:`mysite/settings.py` ファイルのデータベース設定に従って必要なすべてのデータベースのテーブルを作成します。このデータベースマイグレーションはアプリと共に配布されます (これらについては後ほどカバーします)。マイグレーションを実施するたび、メッセージを見ることになります。もしこれに興味を引かれたら、Djangoが作成したテーブルを表示するために、コマンドラインクライアントであなたのデータベースの種類に合わせて ``\dt`` (PostgreSQL)、``SHOW TABLES;`` (MySQL)、 ``.schema`` (SQLite)、もしくは ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) とタイプしてみましょう。
pl: Komenda :djadmin:`migrate` spogląda w ustawienie :setting:`INSTALLED_APPS` i tworzy potrzebne tabele bazy danych w nawiązaniu do ustawień bazy danych w twoim pliku :file:`mysite/settings.py` i do migracji bazy danych zawartych w aplikacji (powiemy o tym później). Zobaczysz wiadomość o każdej migracji, która zostanie zastosowana. Jeśli jesteś zainsteresowany, uruchom klienta linii poleceń twojej bazy danych i wpisz ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MySQL), ``.schema`` (SQLite) lub ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle), aby wyświetlić tabele, które stworzyło Django.
zh_hans: 这个 :djadmin:`migrate` 命令检查 :setting:`INSTALLED_APPS` 设置，为其中的每个应用创建需要的数据表，至于具体会创建什么，这取决于你的 :file:`mysite/settings.py` 设置文件和每个应用的数据库迁移文件（我们稍后会介绍这个）。这个命令所执行的每个迁移操作都会在终端中显示出来。如果你感兴趣的话，运行你数据库的命令行工具，并输入 ``\dt`` (PostgreSQL)， ``SHOW TABLES;`` (MySQL)， ``.schema`` (SQLite)或者 ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) 来看看 Django 到底创建了哪些表。

source: For the minimalists
el: Για τους μινιμαλιστές
it: Per i minimalisti
ja: ミニマリストのために
pl: Dla minimalistów
zh_hans: 写给极简主义者

source: Like we said above, the default applications are included for the common case, but not everybody needs them. If you don't need any or all of them, feel free to comment-out or delete the appropriate line(s) from :setting:`INSTALLED_APPS` before running :djadmin:`migrate`. The :djadmin:`migrate` command will only run migrations for apps in :setting:`INSTALLED_APPS`.
el: Όπως είπαμε παραπάνω, οι προεπιλεγμένες εφαρμογές περιλαμβάνονται επειδή χρησιμοποιούνται συχνά, αλλά δεν τις χρειάζονται όλοι. Αν δεν χρειάζεστε κάποια ή καμία από αυτές, μπορείτε ελεύθερα να τις ορίσετε ως σχόλιο ή να διαγράψετε την αντίστοιχη γραμμή (γραμμές) από τη ρύθμιση :setting:`INSTALLED_APPS` πριν τρέξετε την εντολή :djadmin:`migrate`. Η djadmin:`migrate` θα τρέξει τα migrations μόνο για τις εφαρμογές που βρίσκονται στη ρύθμιση :setting:`INSTALLED_APPS` (και φυσικά δεν είναι σχόλια).
it: Come abbiamo detto sopra, le applicazioni predefinite sono incluse per il caso d'uso comune, ma non tutti ne hanno bisogno. Se non hai bisogno di nessuno o di tutti, sentiti libero di commentare o eliminare le righe appropriate da :setting:`INSTALLED_APPS` prima di eseguire :djadmin:`migrate`. Il comando :djadmin:`migrate` eseguirà solo le migrazioni per le app in :setting:`INSTALLED_APPS`.
ja: すでに述べたように、一般的な場合のためにデフォルトのアプリケーション群が含まれていますが、すべての人がそれを必要とするわけではありません。もしその中のどれかかすべてが必要ない場合、 :djadmin:`migrate` を実行する前に :setting:`INSTALLED_APPS` から適切な行(複数)をコメントアウトしたり削除しても構いません。:djadmin:`migrate` コマンドは :setting:`INSTALLED_APPS` のアプリのためだけに実行されます。
pl: Tak jak powiedzieliśmy wyżej, domyślne aplikacje są włączone dla powszechnych przypadków użycia, ale nie każdy je potrzebuje. Jeśli nie potrzebujesz żadnej z nich, nie krępuj się zakomentować lub usunąć odpowiednią linię (odpowiednie linie) z :setting:`INSTALLED_APPS` przed uruchomieniem :djadmin:`migrate`. Komenda :djadmin:`migrate` uruchomi migracje tylko dla aplikacji w :setting:`INSTALLED_APPS`.
zh_hans: 就像之前说的，为了方便大多数项目，我们默认激活了一些应用，但并不是每个人都需要它们。如果你不需要某个或某些应用，你可以在运行 :djadmin:`migrate` 前毫无顾虑地从 :setting:`INSTALLED_APPS` 里注释或者删除掉它们。 :djadmin:`migrate` 命令只会为在 :setting:`INSTALLED_APPS` 里声明了的应用进行数据库迁移。

source: Creating models
el: Δημιουργώντας τα μοντέλα
it: Creazione dei modelli
ja: モデルの作成
pl: Tworzenie modeli
zh_hans: 创建模型

source: Now we'll define your models -- essentially, your database layout, with additional metadata.
el: Σε αυτό το στάδιο θα ορίσουμε τα μοντέλα -- κατ' ουσίαν, το layout της βάσης δεδομένων, με μερικά πρόσθετα metadata.
it: Ora definiremo i tuoi modelli -- essenzialmente, la struttura del tuo database, con metadati aggiuntivi.
ja: これからモデルを定義します -- 追加的なメタデータとともにデータベースのレイアウトを行う、必須の作業です。
pl: Teraz zdefiniujemy twoje modele – w istocie layout twojej bazy danych z dodatkowymi meta-danymi.
zh_hans: 在 Django 里写一个数据库驱动的 Web 应用的第一步是定义模型 - 也就是数据库结构设计和附加的其它元数据。

source: Philosophy
el: Φιλοσοφία
it: Filosofia
ja: 設計哲学
pl: Filozofia
zh_hans: 设计哲学

source: A model is the single, definitive source of truth about your data. It contains the essential fields and behaviors of the data you're storing. Django follows the :ref:`DRY Principle <dry>`. The goal is to define your data model in one place and automatically derive things from it.
el: Ένα μοντέλο είναι η μοναδική και απόλυτη πηγή των πραγματικών δεδομένων σας. Περιέχει τα ουσιώδη χαρακτηριστικά (πεδία) και συμπεριφορές (μέθοδοι) των δεδομένων που αποθηκεύετε. Το Django ακολουθεί την :ref:`αρχή του DRY <dry>`. Ο στόχος είναι να ορίσετε (δηλώσετε) τα μοντέλα σας σε ένα μέρος και αυτόματα να αντλείτε πράγματα από εκεί.
it: Un modello è l'unica, definitiva fonte di verità sui tuoi dati. Contiene i campi essenziali e i comportamenti dei dati che stai memorizzando. Django segue il :ref:`Principio DRY <dry>`. L'obiettivo è quello di definire il tuo modello di dati in un unico posto e derivare automaticamente le cose da esso.
ja: モデルは、手持ちのデータに対する唯一の決定的なソースです。モデルには自分が格納したいデータにとって必要不可欠なフィー ルドと、そのデータの挙動を収めます。 Django は :ref:`DRY 則 <dry>` に従っています。 Django のモデルの目的は、ただ一つの場所でデータモデルを定義し、そこから自動的にデータを取り出すことにあります。
pl: Model jest pojedynczym, pełnym źródłem informacji o twoich danych. Zawiera zasadnicze pola i zachowania danych, które przechowujesz. Django stosuje się do :ref:`zasady DRY <dry>`. Celem jest zdefiniowanie modelu danych w jednym miejscu i automatyczne czerpanie z niego przez inne elementy.
zh_hans: 模型是真实数据的简单明确的描述。它包含了储存的数据所必要的字段和行为。Django 遵循 :ref:`DRY Principle <dry>` 。它的目标是你只需要定义数据模型，然后其它的杂七杂八代码你都不用关心，它们会自动从模型生成。

source: This includes the migrations - unlike in Ruby On Rails, for example, migrations are entirely derived from your models file, and are essentially just a history that Django can roll through to update your database schema to match your current models.
el: Τα migrations (που είδαμε παραπάνω) περιλαμβάνονται (ως έννοια) στα μοντέλα - για παράδειγμα, εν αντίθεση με την γλώσσα προγραμματισμού Ruby On Rails, τα migrations προκύπτουν αποκλειστικά από τα μοντέλα σας και ουσιαστικά αποτελούν ένα είδος ιστορικού το οποίο το Django μπορεί να ανατρέξει και να αλλάξει το schema της βάσης δεδομένων σας που να ταιριάζει στα τρέχοντα μοντέλα σας.
ja: これはマイグレーションを含みます - 例えば、Ruby On Railsと違って、Djangoは歴史的に、現在のモデルに合致するようデータベースのスキーマをアップデートするよう進むことを可能とすることで、マイグレーションは完全にモデルのファイルから生成されます。
pl: Wliczają się w to migracje – inaczej niż na przykład w Ruby On Rails, migracje całkowicie pochodzą z pliku modeli, i są co do istoty tylko historią, przez którą Django może przewijać, aby aktualizować schemat bazy danych, by był zgodny z bieżącymi modelami.
zh_hans: 来介绍一下迁移 - 举个例子，不像 Ruby On Rails，Django 的迁移代码是由你的模型文件自动生成的，它本质上只是个历史记录，Django 可以用它来进行数据库的滚动更新，通过这种方式使其能够和当前的模型匹配。

source: In our simple poll app, we'll create two models: ``Question`` and ``Choice``. A ``Question`` has a question and a publication date. A ``Choice`` has two fields: the text of the choice and a vote tally. Each ``Choice`` is associated with a ``Question``.
el: Στην απλή εφαρμογή ψηφοφορίας μας, θα δημιουργήσουμε δύο μοντέλα: το ``Question`` και το ``Choice``. Το ``Question`` μοντέλο θα έχει (ως χαρακτηριστικά-πεδία) μια ερώτηση και μια ημερομηνία κυκλοφορίας (έκδοσης) αυτής. Το ``Choice`` μοντέλο θα έχει δύο χαρακτηριστικά-πεδία: το κείμενο της απάντησης-επιλογής και ένα μετρητή για να κρατάει τον αριθμό που αυτή η απάντηση επιλέχθηκε. Κάθε ``Choice`` θα συνδέεται με το μοντέλο ``Question``.
ja: これから開発する簡単な poll アプリケーションでは、投票項目 (``Question``) と選択肢 (``Choice``) の二つのモデルを作成します。 ``Poll`` には質問事項 (question) と公開日 (publication date) の情報があります。 ``Choice`` には選択肢のテキストと投票数 (vote) という二つのフィールドがあります。各 ``Choice`` は一つの ``Question`` に関連づけられています。
pl: W naszej prostej aplikacji ankietowej, stworzymy dwa modele: ``Question`` and ``Choice``. ``Question`` ma pytanie i datę publikacji. ``Choice`` ma dwa pola: treść wyboru i podsumowanie głosów. Każdy ``Choice`` jest związane z ``Question``.
zh_hans: 在这个简单的投票应用中，需要创建两个模型：问题 ``Question`` 和选项 ``Choice``。``Question`` 模型包括问题描述和发布时间。``Choice`` 模型有两个字段，选项描述和当前得票数。每个选项属于一个问题。

source: These concepts are represented by simple Python classes. Edit the :file:`polls/models.py` file so it looks like this:
el: Αυτές οι έννοιες αναπαρίστανται στο Django με απλές Python classes. Επεξεργαστείτε το αρχείο :file:`polls/models.py` ούτως ώστε να δείχνει κάπως έτσι:
ja: Django では、こうした概念を簡単な Python クラスで表現できます。 :file:`polls/models.py` ファイルを以下のように編集してください:
pl: Te koncepty są reprezentowane przez proste klasy Pythona. Zmień plik :file:`polls/models.py`, aby wyglądał tak:
zh_hans: 这些概念可以通过一个简单的 Python 类来描述。按照下面的例子来编辑 :file:`polls/models.py` 文件：

source: The code is straightforward. Each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
el: Ο παραπάνω κώδικας φαίνεται ευθύς, καθαρός και κατανοητός. Κάθε μοντέλο αντιπροσωπεύεται από μία class η οποία κάνει subclass την :class:`django.db.models.Model` class. Κάθε μοντέλο έχει έναν αριθμό από class variables (χαρακτηριστικά), όπου καθένα από αυτά αναπαριστά ένα πεδίο στη βάση δεδομένων. Με άλλα λόγια κάθε class variable αντιστοιχεί σε μια στήλη στη βάση δεδομένων (database column).
ja: コードは単純明解ですね。各モデルは一つのクラスで表現され、いずれも :class:`django.db.models.Model` のサブクラスです。各モデルには複数のクラス変数があり、個々のクラス変数はモデルのデータベースフィールドを表現しています。
pl: Kod jest prostolinijny. Każdy model jest reprezentowany przez klasę, która dziedziczy po :class:`django.db.models.Model`. Każdy model ma kilka zmiennych klasowych, z których każda reprezentuje pole bazy danych w modelu.
zh_hans: 代码非常直白。每个模型被表示为 :class:`django.db.models.Model` 类的子类。每个模型有一些类变量，它们都表示模型里的一个数据库字段。
