Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Now, go to ``/polls/1/`` in your browser and vote in the question. You should see a results page that gets updated each time you vote. If you submit the form without having chosen a choice, you should see the error message.
el: Μεταβείτε στη σελίδα ``/polls/1/`` και ψηφίστε. Κάθε φορά που ψηφίζετε θα βλέπετε τη σελίδα με τα αποτελέσματα της ερώτησης. Αν κάνετε submit τη φόρμα δίχως να επιλέξετε κάποια απάντηση θα δείτε ένα μήνυμα σφάλματος.
it: Adesso, vai su ``/polls/1/`` nel browser e vota il sondaggio. Dovresti vedere la pagina dei risultati che si aggiorna ogni volta che voti. Se invii il form senza scegliere una risposta, dovresti vedere il messaggio di errore.
ja: ブラウザで ``/polls/1/`` を表示して投票してみましょう。票を入れるたびに、結果のページが更新されていることがわかるはずです。選択肢を選ばずにフォームを送信すると、エラーメッセージを表示されるはずです。
pl: Teraz wejdź na ``/polls/1/`` w swojej przeglądarce i zagłosuj w ankiecie. Powinieneś zobaczyć stronę wyników, która aktualizuje się za każdym razem, kiedy oddasz głosz. Jeśli wyślesz formularz bez wybranej odpowiedzi, powinieneś zobaczyć komunikat błędu.
zh_hans: 现在，在你的浏览器中访问 ``/polls/1/`` 然后为 Question 投票。你应该看到一个投票结果页面，并且在你每次投票之后都会更新。 如果你提交时没有选择任何 Choice，你应该看到错误信息。

source: The code for our ``vote()`` view does have a small problem. It first gets the ``selected_choice`` object from the database, then computes the new value of ``votes``, and then saves it back to the database. If two users of your website try to vote at *exactly the same time*, this might go wrong: The same value, let's say 42, will be retrieved for ``votes``. Then, for both users the new value of 43 is computed and saved, but 44 would be the expected value.
el: Ο κώδικας του view ``vote()`` έχει ένα μικρό προβληματάκι. Πρώτα ρωτάει την database (μέσω της ``get()``) για την ύπαρξη του ``choice`` με το συγκεκριμένο ID και αν βρεθεί επιστρέφει το ανάλογο object που είναι instance της ``polls.models.Choice`` class. Το object αυτό το ονομάζουμε ``selected_choice``. Κατόπιν υπολογίζουμε τη νέα τιμή του ``votes`` και μετά αποθηκεύουμε τη νέα τιμή (αυξημένη κατά ένα) πίσω στην βάση δεδομένων. Εδώ όμως δημιουργείται πρόβλημα. Αν δύο χρήστες προσπαθήσουν να ψηφίσουν στην ίδια ερώτηση *ακριβώς την ίδια χρονική στιγμή*, τότε δεν θα δουλέψει όπως πρέπει: Η ίδια τιμή, ας πούμε 42, θα είναι η αρχική (``votes``) και για τους δύο χρήστες. Τότε και στους δύο, η νέα τιμή 43 θα εμφανιστεί ως αποτέλεσμα, αλλά η τιμή 44 θα έπρεπε να είναι η αναμενόμενη (που δεν είναι).
it: Il codice per la view ``vote()`` ha un piccolo problema. Prende prende l'oggetto ``selected_choice`` dal db, poi li risalva nel database. Se due utenti del sito cercano di votare *esattamente* allo stesso momento, qualcosa potrebbe andare storto: lo stesso valore, diciamo 42, verrebbe ritirato per ``votes``. Poi, per entrambi gli utenti verrebbe calcolato il valore 43 e salvato ma 44 sarebbe il valore giusto.
ja: ``vote()``ビューのコードは小さな問題を抱えています。最初にデータベースから``selected_choice`` オブジェクトを取得し、そこで``votes``の新しい値を計算し、データベースにそれを戻して保存します。もしWebサイトのユーザー2人が*まったく同時に*投票しようとすると、誤りが発生します。``votes``の元の値が42だったとしましょう。その時、両方のユーザーに対して新しい値として43が計算され保存されます、しかし44が本来想定される値です。
pl: Jest mały problem w kodzie naszego widoku ``vote()``. Najpierw dostaje obiekt ``selected_choice`` z bazy danych, następnie oblicza nową wartość `` votes i dalej zapisuje ją z powrotem do bazy danych. Jeśli dwóch użytkowników twojej witryny spróbuje zagłosować *dokładnie w tym samym czasie*, może to pójść źle: Ta sama wartość, powiedzmy 42, będzie pobrana dla ``votes``. Następnie dla obu użytkowników nowa wartość 43 jest obliczona i zapisana, ale oczekiwaną wartością jest 44.
zh_hans: 我们的 ``vote()`` 视图代码有一个小问题。代码首先从数据库中获取了 ``selected_choice`` 对象，接着计算 ``vote`` 的新值，最后把值存回数据库。如果网站有两个方可同时投票在 *同一时间* ，可能会导致问题。同样的值，42，会被 ``votes`` 返回。然后，对于两个用户，新值43计算完毕，并被保存，但是期望值是44。

source: This is called a *race condition*. If you are interested, you can read :ref:`avoiding-race-conditions-using-f` to learn how you can solve this issue.
el: Αυτό ονομάζεται *race condition*. Αν ενδιαφέρεστε μπορείτε να διαβάσετε την αναφορά στο :ref:`αποφεύγοντας τα race conditions χρησιμοποιώντας την F <avoiding-race-conditions-using-f>` για να μάθετε πως μπορείτε να αποφύγετε τέτοιες (ακραίες) καταστάσεις.
it: Questa viene chiamata *race condition*. Se sei interessato, puoi leggere :ref:`avoiding-race-conditions-using-f` per sapere come risolvere questo problema.
ja: この問題は、「競合状態」と呼ばれています。この問題に興味がある人は、:ref:`avoiding-race-conditions-using-f` を読むと、この問題の解決方法がわかります。
pl: Nazywa się to *hazardem* (race condition). Jeśli jesteś zainteresowany, możesz przeczytać :ref:`avoiding-race-conditions-using-f`, aby dowiedzieć się, jak możesz rozwiązać ten problem.
zh_hans: 这个问题被称为 *竞争条件* 。如果你对此有兴趣，你可以阅读 :ref:`avoiding-race-conditions-using-f` 来学习如何解决这个问题。

source: Use generic views: Less code is better
el: Χρήση των generic views: Ο λιγότερος κώδικας είναι καλύτερος
it: Usa viste generiche: meno codice è meglio
ja: 汎用ビューを使う: コードが少ないのはいいことだ
pl: Użycie widoków generycznych: Im mniej kodu tym lepiej
zh_hans: 使用通用视图：代码还是少点好

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are very simple -- and, as mentioned above, redundant. The ``index()`` view, which displays a list of polls, is similar.
el: Το view ``detail()`` (από τον :doc:`Οδηγό 3 </intro/tutorial03>`) και το view ``results()`` είναι πολύ απλά και όπως αναφέρθηκε παραπάνω είναι πλεονασμός. Το ``index()`` view, το οποίο εμφανίζει μια λίστα των πέντε πρώτων ερωτήσεων είναι εξίσου παρόμοιο.
ja: ``detail()`` ( :doc:`チュートリアルその 3 </intro/tutorial03>` ) と ``results()`` ビューはとても簡単で、先程も述べたように冗長です。投票の一覧を表示する ``index()`` ビュー (チュートリアルその 3) も同様です。
pl: Widoki ``detail()`` (z :doc:`Tutoriala 3 </intro/tutorial03>`) i ``results()`` są bardzo proste – i, jak wspomnieliśmy wcześniej, redundantne. Widok ``index()``, który wyświetal listę ankiet, jest podobny.
zh_hans: ``detail()`` （在 :doc:`教程第3部分 </intro/tutorial03>` 中）和 ``results()`` 视图都很简单 —— 并且，像上面提到的那样，存在冗余问题。用来显示一个投票列表的 ``index()`` 视图（也在 :doc:`教程第 3 部分 </intro/tutorial03>` 中）和它们类似。

source: These views represent a common case of basic Web development: getting data from the database according to a parameter passed in the URL, loading a template and returning the rendered template. Because this is so common, Django provides a shortcut, called the "generic views" system.
el: Αυτά τα views αναπαριστούν μια κοινή πρακτική γενικά στο Web development: φέρνουν data από την database ανάλογα τις παραμέτρους που εισήχθησαν στο URL, φορτώνουν ένα template και επιστρέφουν ένα rendered template. Επειδή αυτό είναι τόσο κοινότυπο, το Django προσφέρει μια συντόμευση, η οποία ονομάζεται σύστημα "generic views".
it: Queste view rappresentano un caso comune di sviluppo Web: prendere dati dal database secondo un parametro passato nella URL, caricare un template e restituire il template. Dal momento che è così comune, Django offre una scorciatoia, chiamato sistema delle "view generiche".
ja: これらのビューは基本的な Web開発の一般的なケースを表します。すなわち、 URL を介して渡されたパラメータに従ってデータベースからデータを取り出し、テンプレートをロードして、レンダリングしたテンプレートを返します。これはきわめてよくあることなので、 Django では、汎用ビュー "generic view" というショートカットを提供しています。
pl: Te widoki reprezentują częsty przypadek w podstawowym web dewelopmencie: pobieranie danych z bazy danych na podstawie parametru podanego w URL, ładownie szablonu i zwracanie wyrenderowanego szablonu. Z powodu, że jest to tak powszechne, Django dostarcza skrót, nazwany systemem „generycznych widoków”.
zh_hans: 这些视图反映基本的 Web 开发中的一个常见情况：根据 URL 中的参数从数据库中获取数据、载入模板文件然后返回渲染后的模板。 由于这种情况特别常见，Django 提供一种快捷方式，叫做“通用视图”系统。

source: Generic views abstract common patterns to the point where you don't even need to write Python code to write an app.
el: Τα generic views απλοποιούν αυτές τις τόσο συνηθισμένες τακτικές σε βαθμό που δεν χρειάζεται να γράψετε καθόλου Python κώδικα για να φτιάξετε ένα app.
it: Le view generiche fanno astrazione di pattern comuni al punto che non hai nemmeno più bisogno di codice Python per scrivere una app.
ja: 汎用ビューとは、よくあるパターンを抽象化して、 Python コードすら書かずにアプリケーションを書き上げられる状態にしたものです。
pl: Widoki generyczne wyodrębniają powszechne wzorce do punktu, gdzie nie potrzebujesz nawet pisać pythonowego kodu, aby napisać aplikację.
zh_hans: 通用视图将常见的模式抽象化，可以使你在编写应用时甚至不需要编写Python代码。

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll just have to take a few steps to make the conversion. We will:
el: Θα μετατρέψουμε, τώρα, την εφαρμογή μας ούτως ώστε να χρησιμοποιεί αυτό το σύστημα των generic views, προκειμένου να διαγράψουμε πολλές γραμμές κώδικα. Πριν όμως, ας δούμε τι χρειάζεται:
ja: これまで作成してきた poll アプリを汎用ビューシステムに変換して、 コードをばっさり捨てられるようにしましょう。変換にはほんの数ステップしかか かりません。そのステップとは:
pl: Przekonwertujmy naszą aplikację ankietową, aby używała systemu widoków generycznych, abyśmy mogli usunąć sporo naszego własnego kodu. Musimy podjąć kilka kroków, aby dokonać konwersji. Będziemy:
zh_hans: 让我们将我们的投票应用转换成使用通用视图系统，这样我们可以删除许多我们的代码。我们仅仅需要做以下几步来完成转换，我们将：

source: Convert the URLconf.
el: Μετατροπή των URLconf.
it: Converti la URLconf.
ja: URLconf を変換する。
pl: Konwertować URLconf.
zh_hans: 转换 URLconf。

source: Delete some of the old, unneeded views.
el: Διαγραφή παλιού κώδικα, αχρησιμοποίητα views.
it: Cancella alcune delle vecchie, non necessarie viste.
ja: 古い不要なビューを削除する。
pl: Usuwać stare, niepotrzebne widoki.
zh_hans: 删除一些旧的、不再需要的视图。

source: Introduce new views based on Django's generic views.
el: Εισαγωγή σε νέου είδους views, βασισμένα πάνω στα generic views του Django.
it: Introduci nuove visualizzazioni basate sulle generic views di Django.
ja: 新しいビューに Djangoの汎用ビューを設定する。
pl: Wprowadzać nowe widoki oparte na generycznych widokach Django.
zh_hans: 基于 Django 的通用视图引入新的视图。

source: Read on for details.
el: Συνεχίστε να διαβάζετε για λεπτομέρειες.
it: Continua a leggere per i dettagli.
ja: 詳しく見てゆきましょう。
pl: Kontynuuj czytanie, aby dowiedzieć się szczegółów.
zh_hans: 请继续阅读来了解详细信息。

source: Why the code-shuffle?
el: Γιατί αυτή η σύγχυση με τον κώδικα;
it: Perchè il code-shuffle?
ja: なぜコードを入れ換えるの？
pl: Dlaczego podmiana kodu?
zh_hans: 为什么要重构代码？

source: Generally, when writing a Django app, you'll evaluate whether generic views are a good fit for your problem, and you'll use them from the beginning, rather than refactoring your code halfway through. But this tutorial intentionally has focused on writing the views "the hard way" until now, to focus on core concepts.
el: Σε γενικές γραμμές, όταν γράφετε ένα Django app, θα καταλάβετε από την αρχή αν θα πρέπει να χρησιμοποιήσετε τα generic views (για την επίλυση του προβλήματος σας), παρά να φτάσετε στο τέλος και μετά να ξαναγράψετε τον κώδικα (όπως κάναμε εμείς τώρα). Εδώ ακολουθήσαμε αυτή την τακτική προκειμένου να σας δείξουμε πως γράφετε ένα view “με το δύσκολο τρόπο” προκειμένου να επικεντρωθείτε σε βασικά concepts.
it: Solitamente, quando scrivi un'applicazione in Django, dovresti valutare quali viste generiche vanno bene per il tuo problema, invece di ristrutturare il codice a metà strada Ma questa guida era intenzionalmente focalizzato fino ad ora, sullo scrivere le viste nel modo più difficile, per mettere a punto i concetti principali.
ja: 一般に Django アプリケーションを書く場合は、まず自分の問題を解決するために汎用ビューが適しているか考えた上で、最初から汎用ビューを使い、途中まで書き上げたコードをリファクタすることはありません。ただ、このチュートリアルでは中核となるコンセプトに焦点を合わせるために、わざと「大変な」ビューの作成に集中してもらったのです。
pl: W ogólności, pisząc aplikację Django, ocenisz, czy widoki generyczne są dobre do twojego problemu i będziesz używał ich od początku zamiast robić refactoring kodu w połowie pracy. Ten tutorial specjalnie był skupiony na pisaniu widoków „w trudny sposób” aż do teraz, aby skupić się podstawowych konceptach.
zh_hans: 一般来说，当编写一个 Django 应用时，你应该先评估一下通用视图是否可以解决你的问题，你应该在一开始使用它，而不是进行到一半时重构代码。本教程目前为止是有意将重点放在以“艰难的方式”编写视图，这是为将重点放在核心概念上。

source: You should know basic math before you start using a calculator.
el: Θα πρέπει να γνωρίζετε βασικά μαθηματικά προτού χρησιμοποιήσετε το κομπιουτεράκι.
it: Dovresti conoscere la matematica di base prima di iniziare a usare una calcolatrice.
ja: 電卓を使う前に、算数の基本を知っておかねばならないのと同じです。
pl: Powinieneś znać podstawową matematykę zanim zaczniesz używać kalkulatora.
zh_hans: 就像在使用计算器之前你需要掌握基础数学一样。

source: Amend URLconf
el: Βελτιώση του URLconf
it: Correggere la URLconf
ja: URLconf の修正
pl: Modyfikacja URLconf
zh_hans: 改良 URLconf

source: First, open the ``polls/urls.py`` URLconf and change it like so:
el: Ανοίξτε πρώτα το URLconf αρχείο ``polls/urls.py`` και αλλάξτε το σε:
it: Prima di tutto, apri la URLconf ``polls/urls.py`` e cambiala così:
ja: まず、 URLconf の ``polls/urls.py`` を開き、次のように変更します:
pl: Najpierw otwórz URLconfa w ``polls/urls.py`` i zmień go tak:
zh_hans: 首先，打开 ``polls/urls.py`` 这个 URLconf 并将它修改成：

source: Note that the name of the matched pattern in the regexes of the second and third patterns has changed from ``<question_id>`` to ``<pk>``.
ja: 二つ目と三つ目の正規表現でマッチしたパターンの名前は ``<question_id>`` から ``<pk> `` へ変更されたことに注意してください。
pl: Zwróć uwagę, że nazwa dopasowanego wzorca w wyrażeniach regularnych drugiego i trzeciego wzorca zmieniła się z ``<question_id>`` na ``<pk>``.

source: Amend views
el: Βελτίωση των views
it: Correggere le viste
ja: views の修正
pl: Modyfikacja widoków
zh_hans: 改良视图

source: Next, we're going to remove our old ``index``, ``detail``, and ``results`` views and use Django's generic views instead. To do so, open the ``polls/views.py`` file and change it like so:
el: Επόμενο βήμα είναι να αφαιρέσουμε τα παλιά (πλέον) ``index``, ``detail`` και ``results`` views και να χρησιμοποιήσουμε τα generic views του Django. Για να γίνει αυτό, ανοίξτε το αρχείο ``polls/views.py`` και αλλάξτε το σε:
it: Poi, andremo a rimuovere le nostre vecchie view ``index``, ``detail`` e ``results`` per usare le view generiche di Django. Per farlo, apri il file ``polls/views.py`` e cambialo così:
ja: 次に、古い ``index`` 、 ``detail`` 、と ``results`` のビューを削除し、代わりに Django の汎用ビューを使用します。これを行うには、 ``polls/views.py`` ファイルを開き、次のように変更します:
pl: Następnie usuniemy nasze stare widoki ``index``, ``detail`` i ``results`` i użyjemy zamiast nich generycznych widoków Django. Aby to zrobić, otwórz plik ``polls/views.py`` i zmień go w ten sposób:
zh_hans: 下一步，我们将删除旧的 ``index``, ``detail``, 和 ``results`` 视图，并用 Django 的通用视图代替。打开 ``polls/views.py`` 文件，并将它修改成：

source: We're using two generic views here: :class:`~django.views.generic.list.ListView` and :class:`~django.views.generic.detail.DetailView`. Respectively, those two views abstract the concepts of "display a list of objects" and "display a detail page for a particular type of object."
el: Χρησιμοποιούμε δύο generic views: Το :class:`~django.views.generic.list.ListView` και το :class:`~django.views.generic.detail.DetailView`. Αντίστοιχα, αυτά τα δύο views απλοποιούν τα concepts της "προβολής μια λίστας από objects" και της "προβολής μιας σελίδας λεπτομερειών για ένα συγκεκριμένου τύπου object."
it: Stiamo usando due view generiche qui: :class:`~django.views.generic.list.ListView` e :class:`~django.views.generic.detail.DetailView`. Rispettivamente, queste due view astraggono il concetto di "mostrare una lista di oggetti" e "mostrare una pagina di dettaglio per un particolare tipo di oggetto".
ja: ここでは、:class:`~django.views.generic.list.ListView` と:class:`~django.views.generic.detail.DetailView` を使用しています。これらのビューはそれぞれ、「オブジェクトのリストを表示する」および「あるタイ プのオブジェクトの詳細ページを表示する」という二つの概念を抽象化しています。
pl: Używamy tutaj dwóch widoków generycznych: :class:`~django.views.generic.list.ListView` i :class:`~django.views.generic.detail.DetailView`. Odpowiednio, te dwa widoki abstrahują koncepty „wyświetlania listy obiektów” i „wyświetlania strony szczegółów dla wybranego typu obiektu”.
zh_hans: 我们在这里使用两个通用视图： :class:`~django.views.generic.list.ListView` 和 :class:`~django.views.generic.detail.DetailView` 。这两个视图分别抽象“显示一个对象列表”和“显示一个特定类型对象的详细信息页面”这两种概念。

source: Each generic view needs to know what model it will be acting upon. This is provided using the ``model`` attribute.
el: Κάθε generic view χρειάζεται να γνωρίζει το μοντέλο με το οποίο θα συνεργαστεί. Αυτό επιτυγχάνεται με το attribute ``model``.
it: Ogni view generica ha bisogno di sapere su che modello agirà. Questa cosa viene definita con l'attributo ``model``.
ja: 各汎用ビューは自分がどのモデルに対して動作するのか知っておく必要があります。これは、 ``model`` 属性を使用して提供されます。
pl: Każdy widok generyczny potrzebuje wiedzieć, na podstawie jakiego modelu będzie działał. Ta informacja jest dostarczona przez atrybut ``model``.
zh_hans: 每个通用视图需要知道它将作用于哪个模型。 这由 ``model`` 属性提供。

source: The :class:`~django.views.generic.detail.DetailView` generic view expects the primary key value captured from the URL to be called ``"pk"``, so we've changed ``question_id`` to ``pk`` for the generic views.
el: Το :class:`~django.views.generic.detail.DetailView` generic view περιμένει μια τιμή ενός primary key (ID, αν θέλετε) η οποία έχει “αιχμαλωτιστεί” στο URL υπό το όνομα ``"pk"``. Αυτός είναι ο λόγος που μετονομάσαμε το ``question_id`` σε ``pk``.
it: La view generica :class:`~django.views.generic.detail.DetailView` si aspetta che la chiave primaria che viene catturata dalla URL si chiami ``"pk"``, quindi abbiamo cambiato ``question_id`` in ``pk`` per le view generiche.
ja: :class:`~django.views.generic.detail.DetailView` 汎用ビューには、 ``"pk"`` という名前で URL からプライマリキーをキャプチャして渡すことになっていので、 汎用ビュー向けに ``question_id`` を ``pk`` に変更しています。
pl: Widok generyczny :class:`~django.views.generic.detail.DetailView` spodziewa się wartości klucza głównego zebranego z URL-a i nazwanego ``"pk"``, więc zmieniliśmy ``question_id`` na ``pk`` dla widoków generycznych.
zh_hans: :class:`~django.views.generic.detail.DetailView` 期望从 URL 中捕获名为 ``"pk"`` 的主键值，所以我们为通用视图把 ``question_id`` 改成 ``pk`` 。

source: By default, the :class:`~django.views.generic.detail.DetailView` generic view uses a template called ``<app name>/<model name>_detail.html``. In our case, it would use the template ``"polls/question_detail.html"``. The ``template_name`` attribute is used to tell Django to use a specific template name instead of the autogenerated default template name. We also specify the ``template_name`` for the ``results`` list view -- this ensures that the results view and the detail view have a different appearance when rendered, even though they're both a :class:`~django.views.generic.detail.DetailView` behind the scenes.
el: Από προεπιλογή, το generic view :class:`~django.views.generic.detail.DetailView` χρησιμοποιεί ένα template με το όνομα ``<appname>/<modelname>_detail.html``. Στην περίπτωση μας θα χρησιμοποιήσει το template με το όνομα ``"polls/question_detail.html"``. Μπορούμε να παρακάμψουμε (override) αυτή τη συμπεριφορά, θέτοντας την τιμή του attribute ``template_name`` σε μια δική μας. Ορίζουμε, επίσης, ένα δικό μας ``template_name`` και για το view ``results`` -- αυτό εξασφαλίζει ότι το results view και το detail view θα έχουν διαφορετική εμφάνιση όταν γίνουν rendered, παρά το γεγονός ότι και τα δύο είναι τύπου :class:`~django.views.generic.detail.DetailView`.
it: Di default, la view generica :class:`~django.views.generic.detail.DetailView` usa un template chiamato `<app name>/<model name>_detail.html``. Nel nostro caso, dovrebbe usare il template ``"polls/question_detail.html"``. L'attributo ``template_name`` è utile per usare un template specifico invece del nome di template generato automaticamente. Specifichiamo anche il ``template_name`` per la list view ``results`` -- questo ci assicura che la view dei risultati e la view dei dettagli abbiamo una interfaccia diversa quando vengono mostrate, anche se, dietro le quinte, sono entrambe :class:`~django.views.generic.detail.DetailView`.
ja: デフォルトでは、 :class:`~django.views.generic.detail.DetailView` 汎用ビューは ``<app name>/<model name>_detail.html`` という名前のテンプレートを使います。この場合、テンプレートの名前は ``"polls/question_detail.html"`` です。 ``template_name`` 属性は Django に自動生成されたデフォルトのテンプレート名ではなく、指定した名前を使うように伝えるために使われます。 ``results`` リストビューにも ``template_name`` を指定します。これは、 結果ビューと詳細ビューがお互い実は :class:`~django.views.generic.detail.DetailView` であるにも関わらず、レンダリングされたとき違った外観を持っているためです。
pl: Domyślnie widok generyczny :class:`~django.views.generic.detail.DetailView` używa szablonu o nazwie ``<app name>/<model name>_detail.html``. W naszym przypadku użyłby szablonu ``"polls/question_detail.html"``. Atrybut ``template_name`` jest używany, by kazać Django użyć wskazanego szablonu zamiast samo-wygenerowanej domyślnej nazwy szablonu. Wskazujemy również ``template_name`` dla widoku listy ``results`` – to powoduje, że widok wyników i widok szczegółów mają inny wygląd po wyrenderowaniu, mimo że oba są :class:`~django.views.generic.detail.DetailView` pod maską.
zh_hans: 默认情况下，通用视图 :class:`~django.views.generic.detail.DetailView` 使用一个叫做 ``<app name>/<model name>_detail.html`` 的模板。在我们的例子中，它将使用 ``"polls/question_detail.html"`` 模板。``template_name`` 属性是用来告诉 Django 使用一个指定的模板名字，而不是自动生成的默认名字。 我们也为 ``results`` 列表视图指定了 ``template_name`` —— 这确保 results 视图和 detail 视图在渲染时具有不同的外观，即使它们在后台都是同一个 :class:`~django.views.generic.detail.DetailView` 。

source: Similarly, the :class:`~django.views.generic.list.ListView` generic view uses a default template called ``<app name>/<model name>_list.html``; we use ``template_name`` to tell :class:`~django.views.generic.list.ListView` to use our existing ``"polls/index.html"`` template.
el: Ομοίως, το generic view :class:`~django.views.generic.list.ListView` χρησιμοποιεί, εξ ορισμού, ένα template με το όνομα ``<appname>/<modelname>_list.html``. Παρακάμπτουμε, και εδώ, τη συμπεριφορά αυτή θέτοντας τη τιμή του attribute ``template_name`` στο string ``"polls/index.html"``, το οποίο έχουμε ήδη υλοποιήσει.
it: In modo simile, la view generica :class:`~django.views.generic.list.ListView` usa un template di default chiamato ``<app name>/<model name>_list.html``; usiamo ``template_name`` per dire a :class:`~django.views.generic.list.ListView` di usare il nostro template esistente ``"polls/index.html"``.
ja: 同様に、 :class:`~django.views.generic.list.ListView` 汎用ビューは ``<app name>/<model name>_list.html`` というデフォルトのテンプレートを使うので、 ``template_name`` を使って :class:`~django.views.generic.list.ListView` に既存の ``"polls/index.html"`` テンプレートを使用するように伝えます。
pl: Podobnie widok generyczny :class:`~django.views.generic.list.ListView` używa domyślnego szablonu o nazwie ``<app name>/<model name>_list.html``; używamy ``template_name``, aby powiedzieć :class:`~django.views.generic.list.ListView`, by używała naszego istniejącego szablonu ``"polls/index.html"``.
zh_hans: 类似地，:class:`~django.views.generic.list.ListView` 使用一个叫做 ``<app name>/<model name>_list.html`` 的默认模板；我们使用 ``template_name`` 来告诉 :class:`~django.views.generic.list.ListView` 使用我们创建的已经存在的 ``"polls/index.html"`` 模板。
