Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: In our poll app, we'll create two models: ``Question`` and ``Choice``. A ``Question`` has a question and a publication date. A ``Choice`` has two fields: the text of the choice and a vote tally. Each ``Choice`` is associated with a ``Question``.
it: Nella nostra app sondaggio, creeremo due modelli: ``Question`` e ``Choice``. Una ``Question`` ha una domanda e una data di pubblicazione. Una ``Choice`` ha due campi: il testo della scelta e il conteggio dei voti. Ogni ``Choice`` è associato ad una ``Question``.

source: These concepts are represented by Python classes. Edit the :file:`polls/models.py` file so it looks like this:
it: Questi concetti sono rappresentati da classi Python. Modifica il file: file: `polls / models.py` in questo modo:

source: Here, each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
it: Qui, ogni modello è rappresentato da una classe che è sottoclasse di :class:`django.db.models.Model`. Ogni modello ha un certo numero di variabili di classe, ciascuna delle quali rappresenta un campo del database.

source: Migrations are how Django stores changes to your models (and thus your database schema) - they're files on disk. You can read the migration for your new model if you like; it's the file ``polls/migrations/0001_initial.py``. Don't worry, you're not expected to read them every time Django makes one, but they're designed to be human-editable in case you want to manually tweak how Django changes things.
it: Le migrazioni sono il modo in cui Django memorizza i cambiamenti ai tuoi modelli (e quindi allo schema del tuo database) - sono files sul disco. Puoi leggerle le migrazioni per i tuoi nuovi modelli se vuoi, all'interno del file ``polls/migrations/0001_initial.py``. Non preoccuparti, non devi leggerle ogni volta che Django ne crea una, ma sono progettate per essere modificabili dagli sviluppatori nel caso tu voglia modificare il modo in cui Django modifica le cose.

source: The foreign key relationship is made explicit by a ``FOREIGN KEY`` constraint. Don't worry about the ``DEFERRABLE`` parts; it's telling PostgreSQL to not enforce the foreign key until the end of the transaction.
it: La relazione di chiave esterna è resa esplicita da un vincolo ``FOREIGN KEY``. Non preoccuparti per le parti ``DEFERRABLE``; sta dicendo a PostgreSQL di non applicare la chiave esterna fino alla fine della transazione.

source: The :djadmin:`sqlmigrate` command doesn't actually run the migration on your database - instead, it prints it to the screen so that you can see what SQL Django thinks is required. It's useful for checking what Django is going to do or if you have database administrators who require SQL scripts for changes.
it: Il comando :djadmin:`sqlmigrate` non esegue effettivamente la migrazione sul tuo database - invece, la mostra sullo schermo in modo che tu possa vedere SQL è ritenuto necessario da Django. È utile per controllare cosa farà Django o se hai amministratori di database che richiedono script SQL per le modifiche.

source: The reason that there are separate commands to make and apply migrations is because you'll commit migrations to your version control system and ship them with your app; they not only make your development easier, they're also usable by other developers and in production.
it: Il motivo per cui esistono comandi separati per eseguire e applicare le migrazioni è perché invierai le migrazioni al tuo sistema di controllo della versione e le spedirai con la tua app; non solo semplificano lo sviluppo, ma sono anche utilizzabili da altri sviluppatori e in produzione.

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the :envvar:`DJANGO_SETTINGS_MODULE` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
it: Lo stiamo usando invece di digitare semplicemente "python", perchè :file:`manage.py` imposta la variabile d'ambiente :envvar:`DJANGO_SETTINGS_MODULE` , che fornisce a Django il percorso di importazione Python per il tuo file :file:`mysite/settings.py`.

source: Wait a minute. ``<Question: Question object (1)>`` isn't a helpful representation of this object. Let's fix that by editing the ``Question`` model (in the ``polls/models.py`` file) and adding a :meth:`~django.db.models.Model.__str__` method to both ``Question`` and ``Choice``:
it: Aspetta un attimo. ``<Question: Question object (1)>`` non è una rappresentazione utile di questo oggetto. Mettiamolo a posto modificando il modello `Question`` (nel file ``polls/models.py``) ed aggiungendo un metodo :meth:`~django.db.models.Model.__str__` sia a ``Question`` che a ``Choice``:
zh_hans: 等等。``<Question: Question object (1)>`` 对于我们了解这个对象的细节没什么帮助。让我们通过编辑 ``Question`` 模型的代码（位于 ``polls/models.py`` 中）来修复这个问题。给 ``Question`` 和 ``Choice`` 增加 :meth:`~django.db.models.Model.__str__` 方法。

source: Let's also add a custom method to this model:
it: Aggiungiamo anche un metodo personalizzato a questo modello:

source: Since :doc:`translation </topics/i18n/translation>` is turned on by default, if you set :setting:`LANGUAGE_CODE`, the login screen will be displayed in the given language (if Django has appropriate translations).
it: Poiché :doc:`translation </topics/i18n/translation>` è attivato di default, se imposti :setting:`LANGUAGE_CODE`, la schermata di login verrà visualizzata nella lingua indicata (se Django ha traduzioni appropriate).

source: Only one more thing to do: we need to tell the admin that ``Question`` objects have an admin interface. To do this, open the :file:`polls/admin.py` file, and edit it to look like this:
it: Solo un'altra cosa da fare: dobbiamo dire all'admin che gli oggetti ``Question`` hanno un'interfaccia di amministrazione. Per fare ciò, apri il file :file:`polls/admin.py` e modificalo in questo modo:

source: In Django, web pages and other content are delivered by views. Each view is represented by a Python function (or method, in the case of class-based views). Django will choose a view by examining the URL that's requested (to be precise, the part of the URL after the domain name).
it: In Django, le pagine web e gli altri contenuti sono serviti dalle views. Ogni view è rappresentata da una funzione Python (o un metodo, in caso di views basate su classi). Django sceglierà una view esaminando la URL che viene richiesta (per essere precisi, la parte di URL dopo il nome di dominio).

source: Now in your time on the web you may have come across such beauties as ``ME2/Sites/dirmod.htm?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B``. You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
it: Adesso, nel tempo che hai trascorso sul web potresti essere incappato in amenità come ``ME2/Sites/dirmod.htm?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B``. Sarai felice di sapere che Django ci permette di utilizzare pattern per le URL che sono molto più eleganti di quelli.

source: A URL pattern is the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
it: Un pattern URL è la forma generale di una URL - per esempio: ``/newsarchive/<year>/<month>/``.

source: To get from a URL to a view, Django uses what are known as 'URLconfs'. A URLconf maps URL patterns to views.
it: Per prendere una URL da una view, Django usa quelle che sono chiamate 'URLconfs'. Una URLconf mappa i pattern delle URL sulle view.
zh_hans: 为了将 URL 和视图关联起来，Django 使用了 'URLconfs' 来配置。URLconf 将 URL 模式映射到视图。

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :doc:`/topics/http/urls` for more information.
it: Questo tutorial fornisce istruzioni di base per l'uso di URLconfs e puoi fare riferimento a :doc:`/topics/http/urls` per maggiori informazioni.
zh_hans: 本教程只会介绍 URLconf 的基础内容，你可以看看 :doc:`/topics/http/urls` 以获取更多内容。

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.urls.path` calls:
it: Collega queste nuove view nel modulo ``polls.urls`` aggiungendo le seguenti chiamate :func:`~django.urls.path`:
zh_hans: 把这些新视图添加进 ``polls.urls`` 模块里，只要添加几个 :func:`~django.conf.urls.url` 函数调用就行：

source: When somebody requests a page from your website -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the patterns in order. After finding the match at ``'polls/'``, it strips off the matching text (``"polls/"``) and sends the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing. There it matches ``'<int:question_id>/'``, resulting in a call to the ``detail()`` view like so::
it: Quando qualcuno richiede una pagina dal tuo sito web -- diciamo, "/polls/34/", Django caricherà il modulo Python ``mysite.urls`` perchè è puntato nell'impostazione :setting:`ROOT_URLCONF`. Cerca la variabile chiamata ``urlpatterns`` e scorre i pattern in ordine. Dopo aver trovato un match con ``'polls/'``, toglie la parte di testo che combacia (``'polls/'``) ed invia la parte rimanente del testo -- ``"34/"`` -- alla URLconf 'polls.urls' per ulteriori elaborazioni. Lì combacia con ``'<int:question_id>/'``, finendo in una chiamata alla view ``detail()`` in questo modo::
zh_hans: 当某人请求你网站的某一页面时——比如说， "/polls/34/" ，Django 将会载入 ``mysite.urls`` 模块，因为这在配置项 :setting:`ROOT_URLCONF` 中设置了。然后 Django 寻找名为 ``urlpatterns`` 变量并且按序匹配正则表达式。在找到匹配项 ``'polls/'``，它切掉了匹配的文本（``"polls/"``），将剩余文本——``"34/"``，发送至 'polls.urls' URLconf 做进一步处理。在这里剩余文本匹配了 ``'<int:question_id>/'``，使得我们 Django 以如下形式调用 ``detail()``::

source: The ``question_id=34`` part comes from ``<int:question_id>``. Using angle brackets "captures" part of the URL and sends it as a keyword argument to the view function. The ``:question_id>`` part of the string defines the name that will be used to identify the matched pattern, and the ``<int:`` part is a converter that determines what patterns should match this part of the URL path.
it: La parte ``question_id=34`` viene da ``<int:question_id>``. L'utilizzo delle parentesi angolari "cattura" parte della URL e la invia come argomento keyword alla funzione view. La parte della stringa ``:question_id>`` definisce il nome che verrà utilizzato per identificare il pattern che ha combaciato, e la parte ``<int:`` è un convertitore che determina quale pattern dovrebbe combaciare in questa parte del percorso della URL.
zh_hans: ``question_id=34`` 由 ``<int:question_id>`` 匹配生成。使用尖括号“捕获”这部分 URL，且以关键字参数的形式发送给视图函数。上述字符串的 ``:question_id>`` 部分定义了将被用于区分匹配模式的变量名，而 ``int:`` 则是一个转换器决定了应该以什么变量类型匹配这部分的 URL 路径。

source: Within the ``templates`` directory you have just created, create another directory called ``polls``, and within that create a file called ``index.html``. In other words, your template should be at ``polls/templates/polls/index.html``. Because of how the ``app_directories`` template loader works as described above, you can refer to this template within Django as ``polls/index.html``.
it: Nella directory ``templates`` che hai appena creato, crea un'altra directory chiamata ``polls``, e in quella crea un file chiamato ``index.html``. In altre parole, il tuo template dovrebbe trovarsi in ``polls/templates/polls/index.html``. Siccome il caricamento dei template delle ``app_directories`` lavora come spiegato poco fa, puoi fare riferimento a questo template in Django come ``polls/index.html``.

source: Now we *might* be able to get away with putting our templates directly in ``polls/templates`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first template it finds whose name matches, and if you had a template with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the best way to ensure this is by *namespacing* them. That is, by putting those templates inside *another* directory named for the application itself.
it: Adesso *dovremmo* essere in grado di cavarcela mettendo i template direttamente in ``polls/templates`` (invece che creare un'altra sottodirectory ``polls``), ma sarebbe una cattiva idea. Django sceglierà il primo template che troverà il cui nome combaci con quello che cerca e sei hai un template con lo stesso nome in una applicazione *differente*, Django potrebbe non essere in grado di operare una distinzione. Dobbiamo essere in grado di far puntare Django a quello giusto, ed il miglior modo di assicurarcene è facendone il *namespacing*. Il che significa, mettendo questi template in un'*altra* directory chiamata come l'applicazione stessa.

source: To make the tutorial shorter, all template examples use incomplete HTML. In your own projects you should use `complete HTML documents`__.
it: Per rendere più corto il tutorial, tutti gli esempi dei templati utilizzano un HTML incompleto. Nei tuoi progetti devi usare `documenti HTML completi`__.

source: The problem with this hardcoded, tightly-coupled approach is that it becomes challenging to change URLs on projects with a lot of templates. However, since you defined the name argument in the :func:`~django.urls.path` functions in the ``polls.urls`` module, you can remove a reliance on specific URL paths defined in your url configurations by using the ``{% url %}`` template tag:
it: Il problema con questo approccio codificato e strettamente accoppiato è che diventa difficile cambiare URL su progetti con molti template. Comunque, dal momento che hai definito l'argomento nome nelle funzioni :func:`~django.urls.path` nel modulo ``polls.urls``, puoi rimuovere la dipendenza da percorsi URL specifici definiti nelle tue configurazioni url usando il tag di template ``{% url %}``.
zh_hans: 问题在于，硬编码和强耦合的链接，对于一个包含很多应用的项目来说，修改起来是十分困难的。然而，因为你在 ``polls.urls`` 的 :func:`~django.conf.urls.url` 函数中通过 name 参数为 URL 定义了名字，你可以使用 ``{% url %}`` 标签代替它：

source: When you're comfortable with writing views, read :doc:`part 4 of this tutorial </intro/tutorial04>` to learn the basics about form processing and generic views.
it: Quando ti senti a tuo agio a scrivere le view, leggi :doc:`la parte 4 di questo tutorial </intro/tutorial04>` per imparare le basi del processamento dei form e le view generiche.

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on form processing and cutting down our code.
it: Questo tutorial inizia dove finiva :doc:`Tutorial 3 </intro/tutorial03>`. Stiamo continuando l'applicazione Web-poll e ci concentreremo sul form processing e sulla riduzione del codice.

source: Write a minimal form
it: Scrivere un modulo minimale

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's good Web development practice in general.
it: Impostiamo la ``action`` del form a ``{% url 'polls:vote' question.id %}`` ed impostiamo ``method="post"``. Utilizzare ``method="post"`` (al contrario ``method="get"``) è molto importante , perchè l'atto di inviare questo form cambierà i dati a lato server. Tutte le volte che crei un form che altera i dati lato server, usa ``method="post"``. Questo suggerimento non è specifico per Django; è una buona pratica di sviluppo web in generale.

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a helpful system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
it: Siccome stiamo creando un form POST (che può avere l'effetto di modificare i dati), dobbiamo preoccuparci delle Cross Site Request Forgeries. Per fortuna, non ce ne dobbiamo preoccupare troppo, perchè Django ci offre un sistema che ci aiuta molto a proteggerci. In breve, tutti i form POST che sono indirizzati dalle url interne devono usare il tag :ttag:`{% csrf_token %}<csrf_token>`.

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's good Web development practice in general.
it: Come il commento Python sopra fa notare, dovresti sempre restituire un :class:`~django.http.HttpResponseRedirect` dopo aver avuto a che fare con successo con dei dati in POST. Questo suggerimento non è specifico per Django; è una buona pratica per lo sviluppo Web in generale.

source: The ``detail()`` (from :doc:`Tutorial 3 </intro/tutorial03>`) and ``results()`` views are very short -- and, as mentioned above, redundant. The ``index()`` view, which displays a list of polls, is similar.
it: Le view ``detail()`` (dal :doc:`Tutorial 3 </intro/tutorial03>`) e ``results()`` sono molto brevi -- e, come menzionato sopra, ridondanti. La view ``index()``, che mostra una lista di sondaggi, è simile.

source: Let's convert our poll app to use the generic views system, so we can delete a bunch of our own code. We'll have to take a few steps to make the conversion. We will:
it: Convertiamo la nostra app dei sondaggi affinchè utilizzi il sistema delle view generiche, in modo da poter cancellare un sacco di codice. Dovremo fare la conversione in qualche step.

source: Note that the name of the matched pattern in the path strings of the second and third patterns has changed from ``<question_id>`` to ``<pk>``.
it: Nota che il nome del pattern che combacia nelle stringhe dei percorsi del secondo e terzo pattern è cambiato da ``<question_id>`` a ``<pk>``.
zh_hans: 注意，第二个和第三个匹配准则中，路径字符串中匹配模式的名称已经由 ``<question_id>`` 改为 ``<pk>``。

source: In previous parts of the tutorial, the templates have been provided with a context that contains the ``question`` and ``latest_question_list`` context variables. For ``DetailView`` the ``question`` variable is provided automatically -- since we're using a Django model (``Question``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``question_list``. To override this we provide the ``context_object_name`` attribute, specifying that we want to use ``latest_question_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to tell Django to use the variable you want.
it: Nella parte precedente di questo tutorial, i template sono stati forniti con un contesto che contiene le variabili ``question`` e ``latest_question_list``. Per ``DetailView`` la variabile ``question`` viene fornita automaticamente -- visto che stiamo usando un modello Django (``Question``), Django è in grado di determinare un nome appropriato per la variabile di contesto. Comunque, per ListView, la variabile di contesto generata automaticamente è ``question_list``. Per sovrascrivere questo, forniamo l'attributo `context_object_name``, specificando che vogliamo usare ``latest_question_list`` al suo posto. Come approccio alternativo, puoi cambiare i tuoi template per rispecchiare le nuove variabili di contesto di default -- ma è molto più facile dire a Django di usare le variabili che vuoi.

source: Tests are routines that check the operation of your code.
it: I test sono routine che controllano il funzionamento del codice.

source: A change in any of those components could have unexpected consequences on the application's behavior. Checking that it still 'seems to work' could mean running through your code's functionality with twenty different variations of your test data to make sure you haven't broken something - not a good use of your time.
it: Una modifica in uno di questi componenti potrebbe avere conseguenze inaspettate sul comportamento dell'applicazione. Controllare che "tutto funzioni" potrebbe voler dire provare le funzionalità del tuo codice con decine di differenti varianti dei tuoi dati di test per essere sicuro di non aver danneggiato nulla con l'ultima modifica - non un bell'impiego del tuo tempo.

source: You might have created a brilliant piece of software, but you will find that many other developers will refuse to look at it because it lacks tests; without tests, they won't trust it. Jacob Kaplan-Moss, one of Django's original developers, says "Code without tests is broken by design."
it: Potresti anche aver creato un software brillante ma potresti scoprire che molti altri sviluppatori si rifiutano di dargli uno sguardo perchè manca dei test; senza test, non ci faranno affidamento. Jacob Kaplan-Moss, uno degli sviluppatori originali di Django, dice "Il codice senza test è marcio dalle fondamenta".

source: Some programmers follow a discipline called "`test-driven development`_"; they actually write their tests before they write their code. This might seem counter-intuitive, but in fact it's similar to what most people will often do anyway: they describe a problem, then create some code to solve it. Test-driven development formalizes the problem in a Python test case.
it: Alcuni programmatori seguono una disciplina chiamata "`test-driven development`_"; scrivono test anche prima di scrivere il codice. Può sembrare una cosa controintuitiva ma in effetti è simile a quel che molte persone farebbero in ogni caso; descrivono un problema, poi creano del codice per risolverlo. Il test-driven development formalizza il problema in un test case Python.

source: Confirm the bug by using the :djadmin:`shell` to check the method on a question whose date lies in the future:
it: Conferma il bug usando la :djadmin:`shell` per controllare il metodo su una domanda la cui data è futura:

source: Here we have created a :class:`django.test.TestCase` subclass with a method that creates a ``Question`` instance with a ``pub_date`` in the future. We then check the output of ``was_published_recently()`` - which *ought* to be False.
it: Qui abbiamo creato una sottoclasse :class:`django.test.TestCase` con un metodo che crea una istanza di ``Question`` con una ``pub_date`` nel futuro. Quindi controlliamo l'output di ``was_published_recently()`` - che *dovrebbe* essere False.

source: In the terminal, we can run our test:
it: Nel terminale, possiamo eseguire il nostro test:

source: Different error?
it: Errore diverso?

source: If instead you're getting a ``NameError`` here, you may have missed a step in :ref:`Part 2 <tutorial02-import-timezone>` where we added imports of ``datetime`` and ``timezone`` to ``polls/models.py``. Copy the imports from that section, and try running your tests again.
it: Se al contrario ottieni un ``NameError``, potresti esserti perso uno step nella :ref:`Parte 2 <tutorial02-import-timezone>` dove abbiamo aggiunto gli import di ``datetime`` e ``timezone`` a ``polls/models.py``. Copia gli import da quella sezione e prova a lanciare di nuovo i test.

source: ``manage.py test polls`` looked for tests in the ``polls`` application
it: ``manage.py test polls`` cerca i test nell'applicazione ``polls``
