Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django, especially from within templates. This powerful feature allows you to make global changes to the URL patterns of your project while only touching a single file.
el: Υπάρχει επίσης το πολύ δυνατό χαρακτηριστικό του Django, με το οποίο μπορείτε να ονομάσετε τα URL σας και να αναφέρεστε σε αυτά μόνο με το όνομα τους παρά με την διεύθυνση τους. Αυτό, θα το χρησιμοποιείτε συνέχεια στα templates σας (π.χ μέσα σε ένα ``<a href>`` HTML tag). Με αυτό τον τρόπο μπορείτε να αλλάζετε τις διευθύνσεις των URL πειράζοντας μόνο ένα αρχείο (``urls.py``) παρά να ψάχνετε σε άλλα μέρη (π.χ στα template σας) για να ανανεώσετε το URL (αφού, αλλιώς θα είχατε γράψει ολόκληρη τη διεύθυνση URL).
it: Assegnare un nome alla tua URL ti consente di fare riferimento ad esso in modo inequivocabile da qualsiasi altra parte in Django, specialmente all'interno dei template. Questa potente funzionalità ti consente di apportare modifiche globali al modello delle URL del tuo progetto toccando solo un singolo file.
pl: Nazwanie twojego URL-a pozwala odwołać się do niego jednoznacznie z każdego miejsca w Django, szczególnie z wnętrza szablonów. Ta potężna cecha pozwala ci na robienie globalnych zmian we wzorcach URL projektu przez zmianę w pojedynczym pliku.
zh_hans: 为你的 URL 取名能使你在 Django 的任意地方唯一地引用它，尤其是在模板中。这个有用的特性允许你只改一个文件就能全局地修改某个 URL 模式。

source: By default, the configuration uses SQLite. If you're new to databases, or you're just interested in trying Django, this is the easiest choice. SQLite is included in Python, so you won't need to install anything else to support your database. When starting your first real project, however, you may want to use a more scalable database like PostgreSQL, to avoid database-switching headaches down the road.
el: Προεπιλεγμένα, οι ρυθμίσεις αφορούν την βάση δεδομένων SQLite. Αν είστε νέος στις βάσεις δεδομένων ή απλά ενδιαφέρεστε στο να δοκιμάσετε το Django, τότε αυτή είναι η πιο εύκολη επιλογή. Η SQLite περιλαμβάνεται στην Python, με αποτέλεσμα να μην χρειάζεται να εγκαταστήσετε τίποτε άλλο για να υποστηρίξετε την βάση δεδομένων σας. Όταν ξεκινήσετε το πρώτο σας πραγματικό project, ωστόσο, ίσως χρειαστεί να χρησιμοποιήσετε από την αρχή μια πιο εύρωστη (robust) βάση δεδομένων όπως η PostgreSQL, για να αποφύγετε τυχόν πονοκεφάλους που θα προκύψουν κατά την αλλαγή βάσεων δεδομένων (από SQLite στην PostgreSQL) στο μέλλον.
it: Di default la configurazione usa SQLite. Se sei nuovo nel mondo dei database, o semplicemente sei interessato a provare django, questa è la scelta più semplice. SQLite è incluso in Python, quindi non è necessario installare altro per far funzionare il database. Quando inizi un progetto, tuttavia, potresti voler utilizzare un database più scalabile come PostgreSQL, per evitare mal di testa dovuti a un successivo cambio di database.
pl: Domyślnie konfiguracja używa SQLite'a. Jeśli jesteś nowy w bazach danych lub jesteś tylko zainteresowany wypróbowaniem Django, to najprostszy wybór. SQLite jest zawarty w Pythonie, więc nie będziesz musiał nic instalować, aby mieć bazę danych. Uruchamiając swój pierwszy prawdziwy projekt, będziesz chciał użyć bardziej skalowalnej bazy danych jak PostgreSQL, aby uniknąć bólu głowy związanego ze zmianami bazy danych po drodze.
zh_hans: 通常，这个配置文件使用 SQLite 作为默认数据库。如果你不熟悉数据库，或者只是想尝试下 Django，这是最简单的选择。Python 内置 SQLite，所以你无需安装额外东西来使用它。当你开始一个真正的项目时，你可能更倾向使用一个更具扩展性的数据库，例如 PostgreSQL，避免中途切换数据库这个令人头疼的问题。

source: To include the app in our project, we need to add a reference to its configuration class in the :setting:`INSTALLED_APPS` setting. The ``PollsConfig`` class is in the :file:`polls/apps.py` file, so its dotted path is ``'polls.apps.PollsConfig'``. Edit the :file:`mysite/settings.py` file and add that dotted path to the :setting:`INSTALLED_APPS` setting. It'll look like this:
el: Για να συμπεριλάβουμε την εφαρμογή στο project μας, θα χρειαστεί να προσθέσουμε μια αναφορά (reference) στην κλάση παραμετροποίησης (configuration class) της εφαρμογής μέσα στη ρύθμιση-λίστα :setting:`INSTALLED_APPS`. Εφόσον η κλάση ``PollsConfig`` υπάρχει μέσα στο αρχείο :file:`polls/apps.py`, το μονοπάτι για την αναφορά σε αυτή την κλάση είναι ``'polls.apps.PollsConfig'``. Σημειώστε ότι αναφερόμαστε σε αυτό χρησιμοποιώντας ένα string. Επεξεργαστείτε το γενικό αρχείο ρυθμίσεων του project σας, :file:`mysite/settings.py` και προσθέστε το παραπάνω μονοπάτι (path) στη ρύθμιση-λίστα :setting:`INSTALLED_APPS`. Θα δείχνει κάπως έτσι:
it: Per includere l'app nel nostro progetto, dobbiamo aggiungere un riferimento alla sua classe di configurazione nell'impostazione :setting:`INSTALLED_APPS`. Le classe ``PollsConfig`` è nel file :file:`polls/apps.py`, quindi il suo percorso separato da punti è ``'polls.apps.PollsConfig'``. Modifica il file :file:`mysite/settings.py` e aggiungi quel percorso separato da punti all'impostazione :setting:`INSTALLED_APPS` setting. Sarà simile a questo:
pl: Aby zawrzeć aplikację w naszym projekcie, musimy dodać odniesienie do jej klasy konfiguracyjnej w ustawieniu :setting:`INSTALLED_APPS`. Klasa ``PollsConfig`` jest w pliku :file:`polls/apps.py`, więc jej kropkowana ścieżka to ``'polls.apps.PollsConfig'``. Zmień plik :file:`mysite/settings.py` i dodaj tę kropkowaną ścieżkę do ustawienia :setting:`INSTALLED_APPS`. Będzie to wyglądało tak:
zh_hans: 为了在我们的工程中包含这个应用，我们需要在配置类 :setting:`INSTALLED_APPS` 中添加设置。因为 ``PollsConfig`` 类写在文件 :file:`polls/apps.py` 中，所以它的点式路径是 ``'polls.apps.PollsConfig'``。在文件 :file:`mysite/settings.py` 中 :setting:`INSTALLED_APPS` 子项添加点式路径后，它看起来像这样：

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.urls` for more information.
pl: Ten tutorial zawiera podstawowe instrukcje użytkowania URLconfów. Możesz przejść do :mod:`django.urls` po więcej informacji.

source: When somebody requests a page from your website -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the regular expressions in order. After finding the match at ``'^polls/'``, it strips off the matching text (``"polls/"``) and sends the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing. There it matches ``r'^(?P<question_id>[0-9]+)/$'``, resulting in a call to the ``detail()`` view like so::
pl: Kiedy ktoś żąda strony z twojej witryny – powiedzmy „/polls/34/”, Django załaduje moduł ``mysite.urls`` Pythona, ponieważ jest wskazany przez ustawienie :setting:`ROOT_URLCONF`. Odnajduje on zmienną nazwaną ``urlpatterns`` i trawersuje po kolei wyrażenia regularne. Po odnalezieniu dopasowania w ``'^polls/'``, odcina pasujący tekst (``„polls/”``) i wysyła pozostały tekst – ``„34/”`` – do URLconfa 'polls.urls' do dalszego przetwarzania. Tam dopasowuje go do ``r'^(?P<question_id>[0-9]+)/$'``, co kończy się wywołaniem widoku ``detail()`` w ten sposób::

source: We are using the :func:`~django.urls.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in :doc:`Tutorial 3 </intro/tutorial03>`, this :func:`~django.urls.reverse` call will return a string like ::
el: Χρησιμοποιούμε τη συνάρτηση :func:`~django.urls.reverse` στον constructor της κλάσης :class:`~django.http.HttpResponseRedirect`. Η συνάρτηση αυτή βοηθά στο να αποφύγουμε να γράφουμε ολόκληρα τα URLs (hardcode) μέσα στη συνάρτηση view (ή οπουδήποτε αλλού σε Python κώδικα). Σαν ορίσματα παίρνει το όνομα του URL (π.χ αυτό που έχουμε ορίσει ως name μέσα στη συνάρτηση ``url()`` στο αρχείο ``polls/urls.py``, με πρόθεμα το όνομα του application για τυχόν namespacing) και τυχόν arguments (είτε positional είτε named) τα οποία έχουν περαστεί μέσα στο URL (αυτά που “αιχμαλωτίστηκαν” λόγω των regular expressions). Στη δικιά μας περίπτωση, χρησιμοποιώντας το URLconf που δημιουργήσαμε στον :doc:`Οδηγό 3 </intro/tutorial03>`, η κλήση της συνάρτησης :func:`~django.urls.reverse` θα επιστρέψει ένα string όπως το παρακάτω::
it: In questo esempio stiamo usando la funzione :func:`~django.urls.reverse` nel costruttore :class:`~django.http.HttpResponseRedirect`. Questa funzione aiuta ad evitare di dover codificare la URL nella funzione view. E' dato il nome della view a cui vogliamo passare il controllo e la porzione della URL relativa alla variabile che punta alla URL. In questo caso, usando la URLconf che abbiamo impostato nel :doc:`Tutorial 3 </intro/tutorial03>`, questa chiamata :func:`~django.urls.reverse` restituirà una stringa come::
pl: Używamy funkcji :func:`~django.urls.reverse` w konstruktorze :class:`~django.http.HttpResponseRedirect` w tym przykładzie. Ta funkcja pomaga uniknąć konieczności hardkodowania URL-i w funkcji widoku. Daje jej się nazwę widoku, któremu chcemy przekazać kontrolę i zestaw zmiennych z wzorca URL-a, który prowadzi do tego widoku. W tym przypadku, używając URLconfa, którego napisaliśmy w :doc:`Tutorialu 3 </intro/tutorial03>`, to wywołanie :func:`~django.urls.reverse` zwróci taki ciąg znaków::
zh_hans: 在这个例子中，我们在 :class:`~django.http.HttpResponseRedirect` 的构造函数中使用 :func:`~django.core.urlresolvers.reverse` 函数。这个函数避免了我们在视图函数中硬编码 URL。它需要我们给出我们想要跳转的视图的名字和该视图所对应的 URL 模式中需要给该视图提供的参数。 在本例中，使用在 :doc:`教程第 3 部分 </intro/tutorial03>` 中设定的 URLconf， :func:`~django.core.urlresolvers.reverse` 调用将返回一个这样的字符串：

source: ... and using the ``assertIs()`` method, it discovered that its ``was_published_recently()`` returns ``True``, though we wanted it to return ``False``
el: ... και χρησιμοποιώντας τη μέθοδο ``assertIs()``, διαπίστωσε ότι η μέθοδος ``was_published_recently()`` επιστρέφει ``True``, αντί για ``False``
it: ...ed usando il metodo ``assertIs()``, ha scoperto che il suo ``was_published_recently()`` restituisce ``True``, anche se volevamo che restituisse ``False``
pl: …i używając metody ``assertls()`` odkrył, że jej ``was_published_recently()`` zwraca ``True``, chociaż chcieliśmy, aby zwracała ``False``
zh_hans: 接着使用 ``assertls()`` 方法，发现 ``was_published_recently()`` 返回了 ``True``，而我们期望它返回 ``False``。

source: :meth:`~django.test.utils.setup_test_environment` installs a template renderer which will allow us to examine some additional attributes on responses such as ``response.context`` that otherwise wouldn't be available. Note that this method *does not* setup a test database, so the following will be run against the existing database and the output may differ slightly depending on what questions you already created. You might get unexpected results if your ``TIME_ZONE`` in ``settings.py`` isn't correct. If you don't remember setting it earlier, check it before continuing.
el: Η μέθοδος :meth:`~django.test.utils.setup_test_environment` εγκαθιστά έναν template renderer ο οποίος μας επιτρέπει να ερευνήσουμε μερικά πρόσθετα attributes στα responses όπως το ``response.context`` το οποίο δεν θα ήταν διαθέσιμο αλλιώς. Σημειώστε ότι αυτή η μέθοδος *δεν* φτιάχνει καμία βάση δεδομένων για τεστ, κάτι το οποίο σημαίνει ότι θα τρέξει χρησιμοποιώντας την ήδη υπάρχουσα database. Επίσης σημειώστε ότι η έξοδος ίσως να είναι διαφορετική για εσάς ανάλογα τις ερωτήσεις που έχετε δημιουργήσει. Ίσως να λάβετε μη αναμενόμενα αποτελέσματα αν η ρύθμιση ``TIME_ZONE``, μέσα στο γενικό αρχείο ρυθμίσεων ``settings.py``, δεν είναι σωστή. Αν δεν την έχετε ρυθμίσει, κάντε το προτού προχωρήσετε.
it: :meth:`~django.test.utils.setup_test_environment` installa un template renderer che ci permetterà di esaminare alcuni attributi aggiuntivi sulle risposte come ``response.context`` che altrimenti non sarebbero disponibili. Nota che questo metodo *non* appronta un database di test, così che quel che segue non sia lanciato sul database esistente e che l'output possa differire in base alle domande già create. Potresti ottenere risultati inattesi se la tua ``TIME_ZONE`` in ``settings.py`` non è corretta. Se non ti ricordi di averla impostata prima, controlla prima di continuare.
pl: :meth:`~django.test.utils.setup_test_environment` instaluje renderer szablonów, który pozwala nam sprawdzać niektóre dodatkowe atrybuty odpowiedzi, takie jak ``response.context``, które inaczej nie byłyby dostępne. Miej na uwadze, że ta metoda *nie* uruchamia testowej bazy danych, więc poniższe będzie uruchamiane na istniejącej bazie danych i wynik może nieco się różnić w zależności od pytań, które dotychczas stworzyłeś. Możesz otrzymać nieprzewidywane wyniki, jeśli twoje ``TIME_ZONE`` w ``settings.py`` nie jest poprawne. Jeśli nie pamiętasz, abyś je wcześniej ustawiał, sprawdź zanim kontynuujesz.
zh_hans: :meth:`~django.test.utils.setup_test_environment` 提供了一个模板渲染器，允许我们为 responses 添加一些额外的属性，例如 ``response.context``，未安装此 app 无法使用此功能。注意，这个方法并 *不会* 配置测试数据库，所以接下来的代码将会在当前存在的数据库上运行，输出的内容可能由于数据库内容的不同而不同。如果你的 ``settings.py`` 中关于 ``TIME_ZONE`` 的设置不对，你可能无法获取到期望的结果。如果你之前忘了设置，在继续之前检查一下。

source: The ``{% static %}`` template tag generates the absolute URL of static files.
el: Το template tag ``{% static %}`` παράγει το absolute URL των static files.
it: Il template tag ``{% static %}`` genera l'URL assoluto dei file statici.
pl: Szablonowy tag ``{% static %}`` generuje bezwzględny URL plików statycznych.
zh_hans: ``{% static %}`` 模板标签会生成静态文件的绝对路径。

source: This tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We're continuing the Web-poll application and will focus on customizing Django's automatically-generated admin site that we first explored in :doc:`Tutorial 2 </intro/tutorial02>`.
el: Καλώς ορίσατε στο τελευταίο μέρος του οδηγού (tutorial) του Django! Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 6 </intro/tutorial06>`. Συνεχίζουμε με την εφαρμογή μας (Web-poll) και αυτή τη φορά θα επικεντρωθούμε στην παραμετροποίηση του διαχειριστικού site του Django το οποίο δημιουργείται αυτόματα για εσάς. Το Django admin το συναντήσαμε πρώτα στον :doc:`Οδηγό 2 </intro/tutorial02>`.
it: Questo tutorial inizia dove finiva il :doc:`Tutorial 6</intro/tutorial06>`. Continueremo lo sviluppo dell'applicazione Web-poll e ci concentreremo sulla personalizzazione del sito admin generato automaticamente da Django, che abbiamo visto per la prima volta nel :doc:`Tutorial 2</intro/tutorial02>`.
pl: Ten tutorial zaczyna się, gdzie został przerwany `Tutorial 6 </intro/tutorial06>`. Kontynuujemy tworzenie aplikacji internetowych ankiet i skupimy się na dostosowaniu do naszych potrzeb automatycznie wygenerowanego panelu administracyjnego Django, który pierwotnie odkrywaliśmy w `Tutorialu 2 </intro/tutorial02>`.
zh_hans: 这篇教程承接 :doc:`教程第 6 部分 </intro/tutorial06>` 结束的地方。我们继续修改在线投票应用，这次我们专注于自定义我们在 :doc:`教程第 2 部分 </intro/tutorial02>` 初见过的 Django 自动生成后台的过程。

source: You'll follow this pattern -- create a model admin class, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for a model.
el: Θα ακολουθείτε αυτή τη διαδικασία (αρχικά θα δημιουργείτε μια model admin class και έπειτα θα περνάτε αυτή τη κλάση ως δεύτερο όρισμα στη μέθοδο ``admin.site.register()``) κάθε φορά που θέλετε να αλλάξετε τυχόν επιλογές στο admin (admin options) για ένα μοντέλο.
it: Seguirai questo pattern -- crea una classe del modello di amministrazione, poi passala come secondo argomento a ``admin.site.register()`` -- ogni volta che vuoi cambiare le opzioni nel panello di amministrazione del modello.
pl: Będziesz realizował ten wzorzec stworzenie klasy model admin, następnie przekazanie jej jako drugiego argumentu do ``admin.site.register()`` – w dowolnym momencie, kiedy potrzebujesz zmienić opcje admina dla modelu.
zh_hans: 你需要遵循以下流程——创建一个模型后台类，接着将其作为第二个参数传给 ``admin.site.register()`` ——在你需要修改模型的后台管理选项时这么做。

source: Just like the static files, we *could* have all our templates together, in one big templates directory, and it would work perfectly well. However, templates that belong to a particular application should be placed in that application’s template directory (e.g. ``polls/templates``) rather than the project’s (``templates``). We'll discuss in more detail in the :doc:`reusable apps tutorial </intro/reusable-apps>` *why* we do this.
pl: Tak samo jak pliki statyczne, *moglibyśmy* mieć wszystkie nasze szablony razem, w jednym dużym katalogu na szablony i mogłoby to całkowicie dobrze działać. Jednakże szablony, które należą do poszczególnej aplikacji powinny być umieszczane raczej w katalogu szablonów tej aplikacji (np. ``polls/templates``) niż w katalogu szablonów projektu (``templates``). Omówimy bardziej szczegółowo w ``tutorialu aplikacji wielokrotnego użytku </intro/reusable-apps>` *dlaczego* to robimy.

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's a well-traveled path with documentation, tooling, and a community to support you. We'll walk you through the entire process, so you can learn by example.
it: Contribuire a Django è il miglior modo per affrontare le tue preoccupazioni. All'inizio questo può scoraggiare ma si tratta di un percorso "battuto" con la documentazione, i tool e la community, che ti supporta. Ti accompagneremo nell'intero processo, in modo che tu possa apprendere con degli esempi.

source: If you are looking for a reference on the details of making code contributions, see the :doc:`/internals/contributing/writing-code/index` documentation.
it: Se cerchi riferimenti sui dettagli per contribuire al codice, vedi la documentazione :doc:`/internals/contributing/writing-code/index`

source: Downloading a copy of Django's development version.
it: Scarica una copia della versione di sviluppo di Django

source: Submitting a pull request.
el: Υποβολή αιτήματος έλξης.
it: Mandare una pull request.
zh_hans: 提交一个 pull request（PR）。

source: The current version of Django doesn't support Python 2.7. Get Python 3 at `Python's download page <https://www.python.org/downloads/>`_ or with your operating system's package manager.
it: La versione correnti di Django non sopporta Python 2.7. Scarica Python 3 da `Python’s download page <https://www.python.org/downloads/>`_ oppure attraverso il packet manager del tuo sistema operativo.
zh_hans: 目前的 Django 版本不再支持 Python 2.7。你可以在 `Python 下载页 <https://www.python.org/downloads/>`_ 或通过操作系统的包管理器下载 Python 3。

source: See :ref:`install_python_windows` on Windows docs for additional guidance.
it: Vedi :ref:`install_python_windows` sulla documentazione di Windows per una guida aggiuntiva.

source: Low bandwidth connection?
it: Connessione lenta?

source: You can add the ``--depth 1`` argument to ``git clone`` to skip downloading all of Django's commit history, which reduces data transfer from ~250 MB to ~70 MB.
it: Puoi aggiungere l'argomento "--depth 1" a "git clone" per saltare il download della cronologia commit di Django che riduce il trasferimento di dati da ~250 MB a ~70 MB.

source: Now that you have a local copy of Django, you can install it just like you would install any package using ``pip``. The most convenient way to do so is by using a *virtual environment*, which is a feature built into Python that allows you to keep a separate directory of installed packages for each of your projects so that they don't interfere with each other.
el: Τώρα που έχετε ένα τοπικό αντίγραφο του Django, μπορείτε να το εγκαταστήσετε με το ``pip``, όπως θα εγκαθιστούσατε οποιοδήποτε άλλο πακέτο. ;Ένας καλός τρόπος είναι η δημιουργία *virtual environment* (απομονωμένο περιβάλλον εργασίας), που θα σας επιτρέψει να έχετε ένα χωριστό φάκελο με τα απαραίτητα πακέτα για κάθε πρότζεκτ σας.
it: Ora che hai una copia in locale di Django, puoi installarlo come installeresti qualunque altro pacchetto usando ``pip``. Il modo più pratico per farlo è usando un *ambiente virtuale*, ovvero una feature all'interno di Python che ti permette di tenere separata una cartella di ogni pacchetto installato per ognuno dei tuoi progetti cosicché non interferiscano tra loro.

source: It's a good idea to keep all your virtual environments in one place, for example in ``.virtualenvs/`` in your home directory.
it: È una buona idea mantenere tutti i tuoi ambienti virtuali in un unico posto, per esempio in ``.virtualenvs/`` all'interno della home.

source: Create a new virtual environment by running:
it: Crea un nuovo ambiente virtuale avviando:

source: The final step in setting up your virtual environment is to activate it:
it: Il passaggio finale nel settare il tuo ambiente virtuale è attivare:

source: You have to activate the virtual environment whenever you open a new terminal window.
it: Devi attivare il virtual environment tutte le volte che apri una nuova finestra del terminale.

source: To activate your virtual environment on Windows, run:
it: Per attivare il tuo ambiente virtuale su Windows, avvia:

source: The name of the currently activated virtual environment is displayed on the command line to help you keep track of which one you are using. Anything you install through ``pip`` while this name is displayed will be installed in that virtual environment, isolated from other environments and system-wide packages.
it: Il nome dell'ambiente virtuale attualmente attivo è mostrato sulla linea di comando per aiutarti a tenere in mente quale stai usando. Tutto ciò che installi usando "pip" mentre questo nome è mostrato verrà installato in quell'ambiente virtuale, isolato da altri ambienti e dai pacchetti del sistema.

source: Go ahead and install the previously cloned copy of Django:
it: Procedi e installa la copia precedentemente clonata di Django:

source: The installed version of Django is now pointing at your local copy by installing in editable mode. You will immediately see any changes you make to it, which is of great help when writing your first patch.
it: La versione installata di Django, in versione modificabile, ora punta alla tua copia locale. Vedrai immediatamente alcuni dei cambiamenti che vi apporterai, il che ti sarà di grande aiuto quando scriverai la tua prima patch.

source: Creating projects with a local copy of Django
it: Creazione di progetti con una copia locale di Django

source: It may be helpful to test your local changes with a Django project. First you have to create a new virtual environment, :ref:`install the previously cloned local copy of Django in editable mode <intro-contributing-install-local-copy>`, and create a new Django project outside of your local copy of Django. You will immediately see any changes you make to Django in your new project, which is of great help when writing your first patch.
it: Può essere utile testare i tuoi cambiamenti in locale con un progetto Django. Prima di tutto devi creare un nuovo virtual environment, :ref:`installare la copia locale precedentemente clonata di Django in modalità di modifica <intro-contributing-install-local-copy>` e creare un nuovo progetto Django al di fuori della tua copia locale di Django. Vedrai immediatamente tutti i cambiamenti che farai a Django nel tuo nuovo progetto, il che sarà di grande aiuto quando scriverai la tua prima patch.
