Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: You might have created a brilliant piece of software, but you will find that many other developers will simply refuse to look at it because it lacks tests; without tests, they won't trust it. Jacob Kaplan-Moss, one of Django's original developers, says "Code without tests is broken by design."
el: Μπορεί να έχετε δημιουργήσει ένα λογισμικό διαμάντι αλλά άλλοι προγραμματιστές αρνούνται να ρίξουν μια ματιά σε αυτό μόνο και μόνο επειδή στερείται τεστ. Χωρίς τεστ, δεν θα τον εμπιστευτούν. Ο Jacob Kaplan-Moss, ένας από τους αρχικούς προγραμματιστές του Django, λέει "Code without tests is broken by design."
ja: たとえあなたが輝かしいソフトウェアを作ったとしても、テストがないというそれだけの理由で、多くの開発者は見ることさえしてくれないでしょう。テストのないソフトは信用されないのです。Django を開発した Jacob Kaplan-Moss は次の言葉を残しています。「テストのないコードは、デザインとして壊れている。」
pl: Mógłbyś stworzyć wspaniały kawałek kodu, ale okaże się, że wielu deweloperów po prostu odmówi spojrzenia na niego, bo brakuje mu testów; bez testów, nie będą mu ufać. Jacob Kaplan-Moss, jeden z pierwotnych twórców Django mówi: „Kod bez testów jest popsuty z założenia”.
zh_hans: 你也许遇到过这种情况：你编写了一个绝赞的软件，但是其他开发者看都不看它一眼，因为它缺少测试。没有测试的代码不值得信任。 Django 最初开发者之一的 Jacob Kaplan-Moss 说过：“项目规划时没有包含测试是不科学的。”

source: That other developers want to see tests in your software before they take it seriously is yet another reason for you to start writing tests.
el: Προκειμένου άλλοι προγραμματιστές (developers) να δουν σοβαρά το δικό σας software, θα πρέπει να έχετε υλοποιήσει (γράψει) τα απαραίτητα τεστ.
it: Il fatto che altri sviluppatori vogliano vedere i test nel tuo software prima di prenderlo sul serio è ancora un altro motivo per iniziare a scrivere test.
ja: あなたのソフトウェアを他の開発者が真剣に見てもらうというのも、テストを書くべきもう一つの理由です。
pl: To, że inni deweloperzy chcą mieć testy w twoim oprogramowaniu zanim potraktują go na poważnie jest kolejnym powodem, byś zaczął pisać testy.
zh_hans: 其他的开发者希望在正式使用你的代码前看到它通过了测试，这是你需要写测试的另一个重要原因。

source: Tests help teams work together
el: Τα τεστ βοηθούν τις ομάδες να συνεργαστούν
it: I test aiutano i gruppi a lavorare insieme
ja: テストを書くことはチームで共同作業を行う上で役に立ちます。
pl: Testy pomagają zespołom pracować razem
zh_hans: 测试有利于团队协作

source: The previous points are written from the point of view of a single developer maintaining an application. Complex applications will be maintained by teams. Tests guarantee that colleagues don't inadvertently break your code (and that you don't break theirs without knowing). If you want to make a living as a Django programmer, you must be good at writing tests!
el: Οι προηγούμενες παράγραφοι γράφτηκαν από την σκοπιά ενός και μόνου developer ο οποίος διατηρεί ένα application. Οι περίπλοκες εφαρμογγές, όμως, θα διατηρούνται από ομάδες. Τα τεστ, εγγυώνται ότι οι συμμετέχοντες στην ομάδα δεν θα χαλάσουν (break) τον κώδικα σας ακούσια αλλά ούτε και εσείς θα χαλάσετε τον δικό του, ακούσια πάλι. Αν θέλετε να βγάλετε τα προς το ζην όντας ένας Django programmer, θα πρέπει να είστε καλός στη συγγραφή των τεστ!
it: I punti precedenti sono scritti dal punto di vista di un solo sviluppatore che mantiene una applicazione. Applicazioni complesse saranno manutenute da team. I test garantiscono che i colleghi non rompano inavvertitamente il codice (e che tu non danneggi il loro senza volerlo). Se vuoi vivere della programmazione Django, devi essere bravo a scrivere test!
ja: これまでの点は、1人の開発者でアプリケーションをメンテナンスしているという観点から書きました。しかし、複雑なアプリケーションはチームでメンテナンスされるようになるものです。テストは、あなたが書いたコードを他人がうっかり壊してしまうことから守ってくれます (そして、他の人が書いたコードをあなたが壊してしまうことからも)。Django のプログラマとして行きてゆくつもりなら、良いテストを絶対に書かなければなりません！
pl: Poprzednie punkty są napisane z perspektywy pojedynczego dewelopera opiekującego się aplikacją. Złożone aplikacje będą utrzymywane przez zespoły. Testy gwarantują, że koledzy nie zepsują przypadkowo twojego kodu (i że ty nie zepsujesz ich bez wiedzy o tym). Jeśli chcesz utrzymywać się jako programista Django, musisz być dobry w pisaniu testów!
zh_hans: 前面的几点都是从单人开发的角度来说的。复杂的应用可能由团队维护。测试的存在保证了协作者不会不小心破坏了了你的代码（也保证你不会不小心弄坏他们的）。如果你想作为一个 Django 程序员谋生的话，你必须擅长编写测试！

source: Basic testing strategies
el: Βασικές στρατηγικές τεστ
it: Strategie basilari di test
ja: 基本的なテスト方針
pl: Podstawowe strategie testowania
zh_hans: 基础测试策略

source: There are many ways to approach writing tests.
el: Υπάρχουν πολλοί τρόποι για να προσεγγίσει κανείς τη συγγραφή των τεστ.
it: Ci sono tanti modi per scrivere i test.
ja: テストを書くためのアプローチには、さまざまなものがあります。
pl: Jest wiele sposobów, w jaki można podejść do pisania testów.
zh_hans: 有好几种不同的方法可以写测试。

source: Some programmers follow a discipline called "`test-driven development`_"; they actually write their tests before they write their code. This might seem counter-intuitive, but in fact it's similar to what most people will often do anyway: they describe a problem, then create some code to solve it. Test-driven development simply formalizes the problem in a Python test case.
el: Κάποιοι προγραμματιστές ακολουθούν μια διαδικασία με το όνομα "`test-driven development`_". Ξεκινούν να γράφουν τα τεστ προτού γράψουν τον κώδικα τους. Αυτό μπορεί να ακούγεται αντί-διαισθητικό αλλά στην πραγματικότητα οι περισσότεροι ακολουθούν αυτή τη μέθοδο: αρχικά περιγράφουν το πρόβλημα και κατόπιν γράφουν κώδικα για να το λύσουν. Η λογική της διαδικασίας test-driven development μπορεί να μεταφερθεί πανεύκολα στα test cases της Python.
ja: プログラマの中には、「`テスト駆動開発`_」の原則に従っている人がいます。これは、実際にコードを書く前にテストを書く、という原則です。この原則は直感に反するように感じるかもしれませんが、実際には多くの人がどんなことでも普通にしていることに似ています。つまり、問題をきちんと言葉にしてから、その問題を解決するためのコードを書く、ということです。テスト駆動開発は、ここで言う問題を単に Python のテストケースとして形式化しただけのことです。
pl: Niektórzy programiści stosują się do zasady nazwanej „`test-driven development`_”; piszą oni testy zanim jeszcze napiszą swój kod. To może wydawać się nieintuicyjne, ale w praktyce jest podobne do tego, co większość ludzi często i tak robi: opisują problem, następnie tworzą pewien kod, aby go rozwiązać. Test-driven development po prostu formalizuje problem w pythonowym test-case'ie.
zh_hans: 一些开发者遵循 "`测试驱动`_" 的开发原则，他们在写代码之前先写测试。这种方法看起来有点反直觉，但事实上，这和大多数人日常的做法是相吻合的。我们会先描述一个问题，然后写代码来解决它。「测试驱动」的开发方法只是将问题的描述抽象为了 Python 的测试样例。

source: More often, a newcomer to testing will create some code and later decide that it should have some tests. Perhaps it would have been better to write some tests earlier, but it's never too late to get started.
el: Πιο συχνά, όσοι είναι νέοι στο χώρο των τεστ θα γράψουν πρώτα τον κώδικα και μετά θα αποφασίσουν ότι θα έπρεπε να είχαν γράψει μερικά τεστ. Ίσως θα ήταν καλύτερα να είχαν γραφτεί τα τεστ νωρίτερα, αλλά ποτέ δεν είναι αργά για να ξεκινήσει κανείς.
it: Molto più spesso, un principiante del testing creerà un po' di codice e poi deciderà che debba avere dei test. Magari sarebbe stato meglio scrivere alcuni test prima ma non è mai troppo tardi per iniziare.
ja: テストの初心者の多くは、先にコードを書いてから、その後でテストが必要だと考えるものです。おそらく、おそらく早くからいくつかテストを書いておいた方が良いですが、テストを始めるのに遅すぎるということはありません。
pl: Częściej ktoś nowy w testowanie stworzy pewien kod i później zdecyduje, że powinien on mieć jakieś testy. Prawdopodobnie lepiej byłoby napisać część testów wcześniej, ale nigdy nie jest za późno, żeby zacząć to robić.
zh_hans: 更普遍的情况是，一个刚接触自动化测试的新手更倾向于先写代码，然后再写测试。虽然提前写测试可能更好，但是晚点写起码也比没有强。

source: Sometimes it's difficult to figure out where to get started with writing tests. If you have written several thousand lines of Python, choosing something to test might not be easy. In such a case, it's fruitful to write your first test the next time you make a change, either when you add a new feature or fix a bug.
el: Μερικές φορές δεν ξέρεις πως να ξεκινήσεις να γράφεις τεστ. Αν έχετε γράψει μερικές χιλιάδες γραμμές Python κώδικα, είναι δύσκολο μετά να επιλέξεις κάτι για να γράψεις τεστ πάνω σε αυτό. Σε τέτοιες περιπτώσεις είναι πιο παραγωγικό να γράψετε το πρώτο σας τεστ κάθε φορά που κάνετε μια αλλαγή, είτε προσθέτετε κάποιο καινούργιο feature είτε διορθώνετε ένα bug.
it: A volte è difficile capire da dove cominciare per scrivere dei test. Se hai scritto molte centinaia di righe di Python, scegliere qualcosa da testare può non essere semplice. In questi casi, puoi scrivere il tuo primo test la prossima volta che apporti un cambiamento, che sia aggiungere una nuova feature o risolvere un bug.
ja: どこからテストを始めるべき場所を見つけるのが難しいこともあります。もしすでに数千行の Python コードがあったとしたら、テストすべき場所を選ぶのは簡単ではないかもしれません。そのような場合には、次に新しい機能やバグの修正を行う時に、最初のテストを書いてみると役に立つでしょう。
pl: Czasem trudno jest wymyślić, od czego zacząć w pisaniu testów. Jeśli napisałeś kilka tysięcy linii Pythona, wybranie czegoś do przetestowania może nie być łatwe. W takim przypadku owocnym jest napisać pierwszy test następnym razem, gdy wprowadzisz zmianę, czy to dodajesz nową funkcjonalność, czy naprawiasz błąd.
zh_hans: 有时候很难决定从哪里开始下手写测试。如果你才写了几千行 Python 代码，选择从哪里开始写测试确实不怎么简单。如果是这种情况，那么在你下次修改代码（比如加新功能，或者修复 Bug）之前写个测试是比较合理且有效的。

source: So let's do that right away.
el: Ας ξεκινήσουμε λοιπόν, αμέσως τώρα.
it: Quindi facciamo le cose in maniera giusta.
ja: それでは早速始めてみましょう。
pl: A więc zróbmy to teraz.
zh_hans: 所以，我们现在就开始写吧。

source: Writing our first test
el: Γράφοντας το πρώτο σας τεστ
it: Scrivere il nostro primo test
ja: 初めてのテスト作成
pl: Pisanie naszego pierwszego testu
zh_hans: 开始写我们的第一个测试

source: We identify a bug
el: Βρίσκουμε ένα bug
it: Identifichiamo un bug
ja: バグを見つけたとき
pl: Odnajdujemy błąd
zh_hans: 首先得有个 Bug

source: Fortunately, there's a little bug in the ``polls`` application for us to fix right away: the ``Question.was_published_recently()`` method returns ``True`` if the ``Question`` was published within the last day (which is correct) but also if the ``Question``’s ``pub_date`` field is in the future (which certainly isn't).
el: Ευτυχώς, υπάρχει ένα μικρό bug στην εφαρμογή μας (``polls``) και αξίζει να το διορθώσουμε ευθύς αμέσως: η μέθοδος ``Question.was_published_recently()`` επιστρέφει ``True`` αν η ερώτηση (``Question``) εκδόθηκε εντός εικοσιτεσσάρων ωρών (το οποίο είναι σωστό). Η ίδια μέθοδος επιστρέφει πάλι ``True`` αν το ``pub_date`` τοποθετείται στο μέλλον (κάτι το οποίο δεν μπορεί να ισχύει).
it: Fortunatamente, c'è un piccolo bug nell'applicazione ``polls`` che possiamo risolvere: il metodo ``Question.was_published_recently()`` restituisce ``True`` se ``Question`` è stata pubblicata entro un giorno (che è corretto) ma anche se il campo ``pub_date`` di ``Question`` è futuro (che certamente non va bene).
ja: 運よく、 ``polls`` のアプリケーションにはすぐに修正可能な小さなバグがありました。``Question.was_published_recently()`` のメソッドは ``Question`` が昨日以降に作成された場合に ``True`` を返すのですが(適切な動作)、 ``Question`` の ``pub_date`` が未来の日付になっている場合にも``True``を返してしまいます(不適切な動作)。
pl: Na szczęście w aplikacji ``polls`` jest mały błąd do naprawienia przez nas od razu: metoda ``Question.was_published_recently()`` zwraca ``True`` jeśli ``Question`` zostało opublikowane w ostatnim dniu (co jest poprawne) ale również jeśli pole ``pub_date`` instancji ``Question`` jest w przyszłości (co poprawne z pewnością nie jest).
zh_hans: 幸运的是，我们的 ``polls`` 应用现在就有一个小 bug 需要被修复：我们的要求是如果 Question 是在一天之内发布的， ``Question.was_published_recently()`` 方法将会返回 ``True`` ，然而现在这个方法在 ``Question`` 的 ``pub_date`` 字段比当前时间还晚时也会返回 True（这是个 Bug）。

source: To check if the bug really exists, using the Admin create a question whose date lies in the future and check the method using the :djadmin:`shell`::
ja: このバグが本当に存在するのかを確かめるために、 :djadmin:`shell`:: から未来の日付の ``Question`` を作成し、メソッドの結果を見てみましょう。
pl: Aby sprawdzić, czy bug naprawdę istnieje, używając Admina stwórz pytanie, którego data będzie w przyszłości i sprawdź metodę z użyciem :djadmin:`shell`a::
zh_hans: 你能从管理页面确认这个 bug 真实存在。在 :djadmin:`shell` 创建一个发布日期是未来某天的投票，在投票列表里你会看到它被标明为最近发布（published recently）::

source: Since things in the future are not 'recent', this is clearly wrong.
el: Εφόσον τα πράγματα στο μέλλον δε θεωρούνται 'πρόσφατα', τότε αυτό είναι ξεκάθαρα λάθος.
it: Siccome le cose nel futuro non sono 'recenti', questo è chiaramente sbagliato.
ja: 未来の日付は '最近' ではないため、この結果は明らかに間違っています。
pl: Ponieważ rzeczy w przyszłości nie są „recent”, to jest oczywiście źle.
zh_hans: 因为将来发生的是肯定不是最近发生的，所以代码明显是错误的。

source: Create a test to expose the bug
el: Δημιουργία ενός τεστ για την ανάδειξη του bug
it: Creare un test per esporre un bug
ja: バクをあらわにするためテストを作成します。
pl: Stwórz test, aby wskazać błąd
zh_hans: 创建一个测试来暴露这个 bug

source: What we've just done in the :djadmin:`shell` to test for the problem is exactly what we can do in an automated test, so let's turn that into an automated test.
el: Ότι ακριβώς κάναμε στο :djadmin:`shell` για να τεστάρουμε το πρόβλημα, θα το κάνουμε στο αυτοματοποιημένο τεστ που θα γράψουμε αμέσως τώρα.
it: Quel che abbiamo appena fatto nella :djadmin:`shell` per testare il problema è esattamente quel che facciamo nel nostro test automatizzato, quindi convertiamolo in un test automatico.
ja: 問題をテストするために :djadmin:`shell` でたった今したことこそ、自動テストでしたいことです。そこで、それを自動テストの中に取り込みましょう。
pl: To, co zrobiliśmy w :djadmin:`shell`u, aby sprawdzić obecność problemu jest dokładnie tym, co chcemy zrobić w zautomatyzowanym teście, więc obróćmy to w zautomatyzowany test.
zh_hans: 我们刚刚在 :djadmin:`shell` 里做的测试也就是自动化测试应该做的工作。所以我们来把它改写成自动化的吧。

source: A conventional place for an application's tests is in the application's ``tests.py`` file; the testing system will automatically find tests in any file whose name begins with ``test``.
el: Ένα βολικό μέρος για να κρατάτε όλα τα τεστ για την εφαρμογή σας είναι σε ένα ξεχωριστό αρχείο με το όνομα ``tests.py``. Το σύστημα (testing system) θα βρει αυτόματα όλα τα τεστ, αρκεί καθένα από αυτά να ξεκινούν με τη λέξη ``test``.
it: Il posto che per convenzione ospita i test di una applicazione è il file ``tests.py``; il sistema di testing troverà automaticamente i test in ogni file il cui nome inizia per ``test``.
ja: アプリケーションのテストを書く場所は、慣習として、アプリケーションの ``tests.py`` ファイル内ということになっています。テストシステムが ``test`` で始まる名前のファイルの中から、自動的にテストを見つけてくれます。
pl: Miejscem według konwencji na testy aplikacji jest plik ``tests.py`` aplikacji; system testowania automatycznie znajdzie testy w każdym pliku, którego nazwa zaczyna się od ``test``.
zh_hans: 按照惯例，Django 应用的测试应该写在应用的 ``tests.py`` 文件里。测试系统会自动的在所有以 ``tests`` 开头的文件里寻找并执行测试代码。

source: Put the following in the ``tests.py`` file in the ``polls`` application:
el: Γράψτε τον ακόλουθο κώδικα στο αρχείο ``tests.py`` μέσα στην εφαρμογή ``polls``:
it: Metti quanto segue nel file ``tests.py`` nell'applicazione ``polls``:
ja: ``polls`` アプリケーションの ``tests.py`` ファイルに次のコードを書きます。
pl: Wprowadź poniższe w plik ``tests.py`` aplikacji ``polls``:
zh_hans: 将下面的代码写入 ``polls`` 应用里的 ``tests.py`` 文件内：

source: What we have done here is created a :class:`django.test.TestCase` subclass with a method that creates a ``Question`` instance with a ``pub_date`` in the future. We then check the output of ``was_published_recently()`` - which *ought* to be False.
ja: ここではまず、:class:`django.test.TestCase` を継承したサブクラスを作り、未来の日付の ``pub_date`` を持つ ``Question`` のインスタンスを作っています。それから、``was_published_recently()`` の出力をチェックしています。これは False になるはずです。
pl: To, co tu zrobiliśmy, to storzyliśmy podklasę :class:`django.test.TestCase` z metodą, która tworzy instancję ``Question`` z ``pub_date`` w przyszłości. Następnie sprawdzamy wynik ``was_published_recently()`` – który *powinien* być False.
zh_hans: 我们创建了一个 :class:`django.test.TestCase` 的子类，并添加了一个方法，此方法创建一个 ``pub_date`` 时未来某天的 ``Question`` 实例。然后检查它的 ``was_published_recently()`` 方法的返回值——它 *应该* 是 False。

source: Running tests
el: Τρέχοντας τα τεστ
it: Eseguire i test
ja: テストの実行
pl: Uruchomienie testów
zh_hans: 运行测试

source: In the terminal, we can run our test::
ja: ターミナルから、次のコマンドでテストが実行できます。
pl: W terminalu możemy uruchomić nasz test::
zh_hans: 在终端中，我们通过输入以下代码运行测试::

source: and you'll see something like::
el: και θα δείτε κάτι σαν αυτό::
it: e vedrai qualcosa del genere::
ja: すると、次のような結果を得るでしょう。
pl: i zobaczysz coś takiego::
zh_hans: 你将会看到运行结果::

source: What happened is this:
el: Αυτά που συνέβησαν είναι τα εξής:
it: Quello che è successo è questo ::
ja: ここでは以下のようなことが起こりました。
pl: To, co się stało, to to:
zh_hans: 发生了什么呢？以下是自动化测试的运行过程：

source: ``python manage.py test polls`` looked for tests in the ``polls`` application
ja: ``python manage.py test polls`` は ``polls`` アプリケーションからテストを探します
pl: ``python manage.py test polls`` wyszukał testy w aplikacji ``polls``
zh_hans: ``python manage.py test polls`` 将会寻找 ``polls`` 应用里的测试代码

source: it found a subclass of the :class:`django.test.TestCase` class
el: βρήκε μια subclass της κλάσης :class:`django.test.TestCase`
it: ha trovato una sottoclasse di tipo :class:`django.test.TestCase`
ja: :class:`django.test.TestCase` クラスのサブクラスを発見します
pl: znalazł podklasę klasy :class:`django.test.TestCase`
zh_hans: 它找到了 :class:`django.test.TestCase` 的一个子类

source: it created a special database for the purpose of testing
el: δημιούργησε μια ειδική database για τους σκοπούς του τεστ
it: ha creato un database speciale con lo scopo di testing
ja: テストのための特別なデータベースを作成します
pl: stworzył specjalną bazę danych na potrzebę testowania
zh_hans: 它创建一个特殊的数据库供测试使用

source: it looked for test methods - ones whose names begin with ``test``
el: έψαξε για τεστ μεθόδους - εκείνες των οποίων το όνομα ξεκινά με τη λέξη ``test``
it: cerca metodi di test - quelli i cui nomi iniziano con ``test``
ja: テスト用のメソッドとして、``test`` で始まるメソッドを探します
pl: wyszukał metody testowe – te, których nazwy zaczynają się od ``test``
zh_hans: 它在类中寻找测试方法——以 ``test`` 开头的方法。

source: in ``test_was_published_recently_with_future_question`` it created a ``Question`` instance whose ``pub_date`` field is 30 days in the future
el: μέσα στην μέθοδο ``test_was_published_recently_with_future_question`` δημιούργησε ένα ``Question`` instance του οποίου το ``pub_date`` field είναι 30 μέρες στο μέλλον
it: in ``test_was_published_recently_with_future_question`` ha creato una istanza di ``Question`` il cui campo ``pub_date`` è avanti di 30 giorni nel futuro
ja: ``test_was_published_recently_with_future_question`` の中で、``pub_date`` フィールドに今日から30日後の日付を持つ ``Question`` インスタンスが作成されます
pl: w ``test_was_published_recently_with_future_question`` stworzył instancję ``Question``, której pole ``pub_date`` jest 30 dni w przyszłości
zh_hans: 在 ``test_was_published_recently_with_future_question`` 方法中，它创建了一个 ``pub_date`` 值为 30 天后的 ``Question`` 实例。

source: ... and using the ``assertEqual()`` method, it discovered that its ``was_published_recently()`` returns ``True``, though we wanted it to return ``False``
ja: そして最後に、``assertEqual()`` メソッドを使って、本当に返ってほしいのは ``False`` だったけれども、``was_published_recently()`` が ``True`` を返していることを発見します

source: The test informs us which test failed and even the line on which the failure occurred.
el: Το τεστ, μας ενημερώνει ποιο τεστ απέτυχε (τώρα έτυχε να έχουμε μονάχα ένα αλλά στο μέλλον δεν θα έχετε μόνο ένα) και ακόμη και την γραμμή του κώδικα στο τεστ όπου προέκυψε το failure.
it: Il test ci informa su quale test è fallito e ci dice anche la linea su cui si è verificato il fallimento.
ja: テストは私たちにテストの失敗を教えてくれるだけでなく、失敗が起こったコードの行数まで教えてくれています。
pl: Test informuje nas który test się nie powiódł i nawet w której linii ukazał się błąd.
zh_hans: 测试系统通知我们哪些测试样例失败了，和造成测试失败的代码所在的行号。

source: Fixing the bug
el: Διορθώνοντας το bug
it: Correggere il bug
ja: バグを修正する
pl: Naprawianie błędu
zh_hans: 修复这个 bug

source: We already know what the problem is: ``Question.was_published_recently()`` should return ``False`` if its ``pub_date`` is in the future. Amend the method in ``models.py``, so that it will only return ``True`` if the date is also in the past:
el: Γνωρίζουμε ήδη ποιο και που είναι το πρόβλημα: η μέθοδος ``Question.was_published_recently()`` θα πρέπει να επιστρέψει ``False`` αν το ``pub_date`` τοποθετηθεί στο μέλλον. Βελτιώστε τη μέθοδο μέσα στο αρχείο ``models.py``, ούτως ώστε να επιστρέφει ``True`` μόνο για παρελθοντικές ημερομηνίες:
it: Sappiamo già che il problema è: ``Question.was_published_recently()`` dovrebbe restituire ``False`` se la sua ``pub_date`` è futura. Correggi il metodo in ``models.py``, così che restiuisca ``True`` solo se la data è nel passato:
ja: 私たちはすでに問題の原因を知っています。それは、``Question.was_published_recently()`` は ``pub_date`` が未来の日付だった場合には ``False`` を返さなければならない、ということです。``models.py`` にあるメソッドを修正して、日付が過去だった場合にのみ ``True`` を返すようにしましょう。
pl: Wiemy już, co jest problemem: ``Question.was_published_recently()`` powinna zwracać ``False`` jeśli jej ``pub_date`` jest w przyszłości. Zmień metodę w ``models.py``, aby zwracała ``True`` tylko jeśli data jest też w przeszłości:
zh_hans: 我们早已知道，当 ``pub_date`` 为未来某天时， ``Question.was_published_recently()`` 应该返回 ``False``。我们修改 ``models.py`` 里的方法，让它只在日期是过去式的时候才返回 ``True``：

source: and run the test again::
el: και τρέξτε τα τεστ ξανά::
it: ed eseguire nuovamente il test ::
ja: そして、もう一度テストを実行します。
pl: i uruchom test ponownie::
zh_hans: 然后重新运行测试::

source: After identifying a bug, we wrote a test that exposes it and corrected the bug in the code so our test passes.
el: Αφού βρήκαμε ένα bug, γράψαμε ένα τεστ το οποίο το αναδεικνύει και τέλος διορθώσαμε το bug στο κώδικα ούτως ώστε το τεστ να θεωρηθεί επιτυχές.
it: Dopo aver identificato un bug, abbiamo scritto un test che lo evidenzia e corretto il bug nel codice in modo che il nostro test venga superato.
ja: バグを発見した後、私たちはそのバグをあぶり出してくれるようなテストを書いて、コード内のバグを直したので、テストは無事にパスされました。
pl: Po zidentyfikowaniu buga, napisaliśmy test, który go pokazuje i poprawiliśmy błąd w kodzie tak, aby test przechodził.
zh_hans: 发现 bug 后，我们编写了能够暴露这个 bug 的自动化测试。在修复 bug 之后，我们的代码顺利的通过了测试。

source: Many other things might go wrong with our application in the future, but we can be sure that we won't inadvertently reintroduce this bug, because simply running the test will warn us immediately. We can consider this little portion of the application pinned down safely forever.
el: Υπάρχει πιθανότητα πολλά άλλα πράγματα να πάνε στραβά με την εφαρμογή μας στο μέλλον αλλά μπορούμε να είμαστε σίγουροι ότι αυτό το συγκεκριμένο bug δεν θα ξαναεμφανιστεί στον κώδικα μας, αφού όταν τρέξουμε την σουίτα των τεστ του Django θα μας ειδοποιήσει αμέσως. Με άλλα λόγια έχουμε κάνει την εφαρμογή μας πιο ασφαλή-σταθερή κατά ένα βαθμό.
ja: このアプリケーションでは将来、たくさんの他のバグが生じるかもしれませんが、このバグがうっかり入ってしまうことは二度とありません。単にテストを実行するだけで、すぐに警告を受けられるからです。このアプリケーションの小さな部分をピンで留める、永遠に安全にすることができたと考えられます。
pl: Wiele innych rzeczy może pójść źle z naszą aplikacją w przyszłości, ale możemy być pewni, że nie zreintrodukujemy przypadkowo tego błędu, ponieważ po prostu uruchomienie testu błyskawicznie nas ostrzeże. Możemy traktować tę małą porcję aplikacji na zawsze jako bezpieczną.
zh_hans: 将来，我们的应用可能会出现其他的问题，但是我们可以肯定的是，一定不会再次出现这个 bug，因为只要简单的运行一遍测试，就会立刻收到警告。我们可以认为应用的这一小部分代码永远是安全的。

source: More comprehensive tests
el: Περισσότερα περιεκτικά τεστ
it: Test più completi
ja: より包括的なテスト
pl: Obszerniejsze testy
zh_hans: 更全面的测试

source: While we're here, we can further pin down the ``was_published_recently()`` method; in fact, it would be positively embarrassing if in fixing one bug we had introduced another.
el: Όσο είμαστε εδώ μπορούμε να βελτιστοποιήσουμε την μέθοδο ``was_published_recently()`` λιγάκι περισσότερο. Θα ήταν ντροπιαστικό, αν προσπαθώντας να διορθώσουμε ένα bug να έχουμε δημιουργήσει κάπου αλλού ένα άλλο (άθελα μας).
it: Già che ci siamo, possiamo aggiustare meglio il metodo ``was_published_recently()``; in effetti, potrebbe essere estremamente imbarazzante se nel tentativo di correggere un bug ne introducessimo un altro.
ja: 私たちがここにいる間、``was_published_recently()`` メソッドはさらにピンで留めることができます。実際、it would be positively embarrassing if in fixing one bug we had introduced another.
pl: Kiedy tu jesteśmy, możemy dalej przyprzeć do muru metodę ``was_published_recently()``; w zasadzie byłoby pozytywnie zawstydzające jeśli naprawiając jeden błąd wprowadziliśmy inny.
zh_hans: 我们已经搞定一小部分了，现在可以考虑全面的测试 ``was_published_recently()`` 这个方法以确定它的安全性，然后就可以把这个方法稳定下来了。事实上，在修复一个 bug 时不小心引入另一个 bug 会是非常令人尴尬的。
