Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: In order to resolve this ticket, we'll add a ``prefix`` attribute to the ``BaseForm`` class. When creating instances of this class, passing a prefix to the ``__init__()`` method will still set that prefix on the created instance. But not passing a prefix (or passing ``None``) will use the class-level prefix. Before we make those changes though, we're going to write a couple tests to verify that our modification functions correctly and continues to function correctly in the future.
ja: このチケットを解決するには､ ``prefix`` 属性を ``BaseForm`` に追加します｡このクラスのインスタンスを作成する時、 ``__init__()`` メソッドに ``prefix`` を渡すと、作成されたインスタンスに ``prefix`` がセットされます。 しかし ``prefix`` を渡さない(または ``None`` を与える)場合、クラスレベルのprefixが使用されます。変更を加える前に､変更が正しく動作し､これからも動作し続けることを確認するためにテストをいくつか追加します｡
pl: Aby rozwiązać zgłoszenie, dodamy atrybut ``prefix`` do klasy ``BaseForm``. Podczas tworzenia instancji tej klasy, podanie prefiksu do metody ``__init__()`` nadal będzie ustawiać ten prefiks na tworzonej instancji. Lecz nie podanie prefiksu (lub podanie ``None``) spowoduje użycie prefiksu na poziomie klasy. Ale zanim wprowadzimy te zmiany, napiszemy kilka testów, aby zweryfikować, że nasze modyfikacje działają poprawnie i będą działać poprawnie w przyszłości.
zh_hans: 为解决此工单，我们为 ``BaseForm`` 类添加了 ``prefix`` 属性。当创建该类实例时， 向 ``__init__()`` 方法传递 prefix 时，设置的仍然是实例属性 prefix。当不传递 prefix（或者传递值为 ``None``）时，将会使用类级别的 prefix。 在我们作出修改前，我们先写一些测试来验证我们修改的功能无误，进而确保它在将来也不会出现问题。

source: Navigate to Django's ``tests/forms_tests/tests/`` folder and open the ``test_forms.py`` file. Add the following code on line 1674 right before the ``test_forms_with_null_boolean`` function::
ja: Django の ``tests/forms_tests/tests/`` フォルダに移動して ``tests_forms.py`` ファイルを開きます。以下のコードを ``test_forms_with_null_boolean `` 関数の直前の 1674 行目に追加します::
pl: Przejdź do folderu Django ``tests/forms_tests/tests/`` i otwórz plik ``test_forms.py``. Dodaj poniższy kod w linii 1674, tuż przed funkcją ``test_forms_with_null_boolean``::
zh_hans: 前往 Django 的 ``tests/forms_tests/tests/`` 目录并打开 ``test_forms.py`` 文件。在 1674 行附近的 ``test_forms_with_null_boolean`` 函数之前插入以下代码：

source: This new test checks that setting a class level prefix works as expected, and that passing a ``prefix`` parameter when creating an instance still works too.
ja: この新しいテストは、 クラスレベルの ``prefix`` が期待通りに設定されていることと、インスタンスの生成時にまだ ``prefix`` パラメータが渡されていることを確認します。
pl: Ten nowy test sprawdza czy ustawienie prefiksu na poziomie klasy działa zgodnie z oczekiwaniami i czy przekazanie parametru ``prefix`` podczas tworzenia instancji też nadal działa.
zh_hans: 这个新测试用来检查：按预想设定了类级别的 prefix，创建实例时传递 ``prefix`` 参数仍然有效。

source: But this testing thing looks kinda hard...
el: Μήπως σας φάνηκε δύσκολο αυτό το τεστ;
it: Ma questa cosa del testing sembra una cosa difficile...
ja: でもテストをするのはすこし難しそうです……
pl: Ale to całe testowanie wygląda na dość ciężkie…
zh_hans: 但这种测试看起来有点困难……

source: If you've never had to deal with tests before, they can look a little hard to write at first glance. Fortunately, testing is a *very* big subject in computer programming, so there's lots of information out there:
el: Αν δεν έχετε γράψει ποτέ στο παρελθόν κάποιο τεστ και πρώτη φορά συναναστρέφεστε με αυτό, στην αρχή ίσως σας φανεί κάπως δύσκολο. Δεν υπάρχει όμως λόγος να ανησυχείτε καθώς η ενότητα testing είναι ένα *τεράστιο* κεφάλαιο στον προγραμματισμό, που σημαίνει ότι υπάρχει εκτενής και πολλή πληροφορία πάνω σε αυτό το θέμα:
it: Se non hai mai avuto a che fare con i test prima d'ora, potranno sembrarti un po' difficili da scrivere a prima vista. Per fortuna, fare i test è davvero un *grande* argomento nella programmazione, quindi ci sono molte informazioni:
ja: テストを書いたとこがない場合は､最初は難しく見えるかもしれません｡ですが実は､テスティングはプログラミングにおいて *とても* 重要なことです｡ここではテストについて詳細に紹介します｡
pl: Jeśli nie miałeś nigdy wcześniej do czynienia z testami, mogą wyglądać na trochę trudne do pisania na pierwszy rzut oka. Na szczęście testowanie jest *bardzo* dużym tematem w programowaniu komputerów, więc można znaleźć na jego temat wiele informacji:
zh_hans: 如果你之前从未处理过测试，那他们看起来会有点难以编写。幸运的是，测试是一个计算机编程中 *非常* 大的一个主题，所以这里有大量的相关资料：

source: A good first look at writing tests for Django can be found in the documentation on :doc:`/topics/testing/overview`.
el: Μια πρώτη ματιά για τη σύνταξη των τεστ για το Django μπορείτε να βρείτε στην ενότητα του εγχειριδίου (documentation) :doc:`σύνταξη και εκτέλεση των τεστ </topics/testing/overview>`.
it: Per iniziare a scrivere test per Django, un buon primo passo è leggere i documenti in :doc:`/topics/testing/overview`.
ja: Django のための良いテストの書き方は :doc:`/topics/testing/overview` のドキュメントに記載されています。
pl: Dobry artykuł na początek o pisaniu testów do Django można znaleźć w dokumentacji: :doc:`/topics/testing/overview`.
zh_hans: 浏览 :doc:`/topics/testing/overview` 大致看一下如何在 Django 中编写测试。

source: Dive Into Python (a free online book for beginning Python developers) includes a great `introduction to Unit Testing`__.
el: Το βιβλίο Dive Into Python (δωρεάν για αρχάριους developers στην γλώσσα προγραμματισμού Python) περιέχει μια πολύ καλή `εισαγωγή στο Unit Testing`__.
it: Buttati Into Python ( un libro online gratuito per i principianti sviluppatori di Python ) include alcuni ottimi progetti come `introduction to Unit Testing`__.
ja: Dive Into Python (Python初心者のための､オンラインの無料の本) では素晴らしい `初めてのユニットテスト`__ という章があります｡
pl: Dive Into Python (darmowa książka online dla początkujących Python-deweloperów) zawiera świetny `wstęp do testów jednostkowych`__.
zh_hans: 深入理解 Python（一本针对 Python 初学者的免费在线书籍），包含了不错的 `introduction to Unit Testing`__。

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the `Python unittest documentation`__.
ja: Dive Into Python を読んだあと､もう少し情報が欲しい場合は `Python のユニットテスト`__ のドキュメントを参照してください｡

source: Running your new test
el: Τρέχοντας το τεστ
it: Eseguire il tuo nuovo test
ja: 新しいテストを走らせる
pl: Uruchomienie twojego nowego testu
zh_hans: 运行你的新测试

source: Remember that we haven't actually made any modifications to ``BaseForm`` yet, so our tests are going to fail. Let's run all the tests in the ``forms_tests`` folder to make sure that's really what happens. From the command line, ``cd`` into the Django ``tests/`` directory and run:
ja: ``BaseForm `` にはまだ変更を加えていませんので､テストは落ちます｡ ``forms_tests `` フォルダの全テストを走らせて､実際に何が起こるか観てみましょう｡コマンドラインで ``tests/`` ディレクトリに ``cd`` して､以下を実行してください::
pl: Pamiętaj, że nie wprowadziliśmy jeszcze żadnych zmian do ``BaseForm``, więc nasze testy się powiodą. Uruchommy wszystkie testy w katalogu ``forms_tests``, aby upewnić się, że to rzeczywiście się dzieje. Z linii komend, wejdź ``cd`` do katalogu ``tests/`` Django i odpal:
zh_hans: 事实上，我们还没有对 ``BaseForm`` 做出任何修改，所以我们的测试将会失败。让我们运行 ``forms_tests`` 下所有的测试来看看会发生什么。在命令行中使用 ``cd`` 进入 Django 的 ``tests/`` 目录并运行：

source: If the tests ran correctly, you should see one failure corresponding to the test method we added. If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and class.
ja: テストが正しく実行されれば､追加したテストメソッドに対応する1つのテストが失敗するでしょう｡テストがすべて通れば､上記した新しいテストを正しいフォルダ､クラスに追加したことを確認してください｡
pl: Jeśli testy przebiegły poprawnie, powinieneś zobaczyć jeden błąd związany z metodą testującą, którą dodaliśmy. Jeśli wszystkie testy przeszły bez błędów, upewnij się, że dodałeś nowy test pokazany powyżej do odpowiedniego folderu i klasy.
zh_hans: 如果测试执行正确，你应该能看到一个错误，正好由我们刚添加的测试方法报告。如果所有测试都通过了，你应该确认下是否将上述新的测试代码加到了合适的文件夹和类里。

source: Writing the code for your ticket
el: Γράφοντας κώδικα για το ticket
it: Scrivere il codice per il tuo ticket
ja: チケットにコードを書く
pl: Pisanie kodu do twojego zgłoszenia
zh_hans: 为你的工单编写代码

source: Next we'll be adding the functionality described in ticket :ticket:`24788` to Django.
ja: 次は :ticket:`24788 ` で説明されている機能を Django に追加します｡
pl: Następnie będziemy dodawać do Django funkcjonalność opisaną w zgłoszeniu :ticket:`24788`.
zh_hans: 下一步我们将把在工单 :ticket:`24788` 中描述的功能添加进 Django。

source: Writing the code for ticket #24788
ja: チケット #24788 のコードを書いてみましょう
pl: Pisanie kodu do zgłoszenia #24788
zh_hans: 为工单 #24788 编写代码

source: Navigate to the ``django/django/forms/`` folder and open the ``forms.py`` file. Find the ``BaseForm`` class on line 72 and add the ``prefix`` class attribute right after the ``field_order`` attribute::
ja: ``django/django/contrib/forms`` フォルダーに行って､ ``forms.py`` ファイルを開いてください｡ 72行目にある ``BaseForm`` クラスを見つけて､以下の ``prefix`` クラス属性をすでにある ``field_order`` 属性の下に追加してください::
pl: Przejdź do folderu ``django/django/forms`` i otwórz plik ``forms.py``. Znajdź klasę ``BaseForm`` (linia 72.) i dodaj atrybut klasy ``prefix`` tuż za atrybutem ``field_order``::
zh_hans: 进入 ``django/django/forms/`` 文件夹并打开 ``forms.py`` 文件。找到第 72 行的 ``BaseForm`` 类，在 ``field_order`` 属性之后添加 ``prefix`` 类属性::

source: Verifying your test now passes
ja: テストが通ることを確認する
pl: Weryfikacja, czy twoje testy teraz przechodzą
zh_hans: 确保你的测试现在通过了

source: Once you're done modifying Django, we need to make sure that the tests we wrote earlier pass, so we can see whether the code we wrote above is working correctly. To run the tests in the ``forms_tests`` folder, ``cd`` into the Django ``tests/`` directory and run:
ja: Django への変更が完了したあと､コードが正しく動作すると確認するため､先ほど書いたテストを実行してください｡Djangoの ``form_tests`` フォルダーに ``cd`` で移動して､以下を実行してください::
pl: Gdy już skończysz modyfikować Django, musimy się upewnić, że testy, które napisaliśmy wcześniej przechodzą, aby sprawdzić czy kod, który napisaliśmy powyżej działa poprawnie. Aby uruchomić testy w folderze ``forms_tests``, wejdź ``cd`` w katalog ``tests/`` Django i uruchom:
zh_hans: 修改 Django 源码后，我们通过之前编写的测试方法来验证源码修改是否工作正常。运行测试 ``forms_tests`` 目录下所有的测试方法， ``cd`` 进入 Django 的 ``tests/`` 目录然后运行：

source: Oops, good thing we wrote those tests! You should still see one failure with the following exception::
ja: あぁ､テストを書いていて良かったですね｡以下のように1つテストが落ちています::
pl: Ups, całe szczęście że napisaliśmy te testy! Powinieneś widzieć dalej jedną porażkę z następującym wyjątkiem::
zh_hans: 哦，好消息是我们写了这些测试用例！不过，你仍收到一个异常::

source: We forgot to add the conditional statement in the ``__init__`` method. Go ahead and change ``self.prefix = prefix`` that is now on line 87 of ``django/forms/forms.py``, adding a conditional statement::
ja: ``__init__``メソッドの中に条件文を追加するのを忘れていました。``django/forms/forms.py`` の87行目の``self.prefix = prefix``を参照して変更します。条件文を追加しましょう::
pl: Zapomnieliśmy dodać wyrażenie warunkowe w metodzie ``__init__``. Zmień ``self.prefix = prefix``, które jest teraz w linii 87. pliku ``django/forms/forms.py``, dodając wyrażenie warunkowe::
zh_hans: 我们忘了在 ``__init__`` 方法中添加条件语句。在 ``django/forms/forms.py`` 中，更改现在在第 87 行的代码 ``self.prefix = prefix``，添加一个条件语句::

source: Re-run the tests and everything should pass. If it doesn't, make sure you correctly modified the ``BaseForm`` class as shown above and copied the new test correctly.
ja: 再実行すればテストがすべてパスするはずです｡もしそうでない場合､ ``BaseForm`` クラスと新しいテストが正しくコピーされているされていると確認してください｡
pl: Uruchom ponownie testy, wszystko powinno przejść. Jeśli nie przejdzie, upewnij się, że poprawnie zmodyfikowałeś klasę ``BaseForm`` jak jest pokazane powyżej i skopiowałeś poprawnie nowy test.
zh_hans: 重新运行测试方法会通过所有测试。如果没有通过测试，请重新确认是否按要求修改了上面提到的类 ``BaseForm``，以及新添加的测试方法是否被正确复制到指定位置。

source: Running Django's test suite for the second time
el: Εκτέλεση της σουίτας δοκιμών του Django για δεύτερη φορά
it: Eseguire la suite di test di Django per la seconda volta
ja: Django の テストスイートをもう一度走らせる
pl: Uruchamianie zestawu testów Django drugi raz
zh_hans: 第二次运行 Django 测试套件

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite just to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
el: Όταν έχετε επιβεβαιώσει ότι το patch και το τεστ δουλεύουν ορθά, τότε είναι ώρα για ένα τελευταίο τεστ όλης της σουίτας του Django, ούτως ώστε να είστε σίγουροι ότι οι αλλαγές που κάνατε (στο συγκεκριμένο οδηγό, στην ``BaseForm``) δεν επιφέρουν σφάλματα σε άλλα σημεία του Django. Ωστόσο, αν το patch περάσει επιτυχώς απ’ όλα τα τεστ, αυτό δεν εγγυάται ότι ο κώδικας σας δεν περιέχει σφάλματα (bug free). Βοηθάει, όμως, στην αναγνώριση πολλών σφαλμάτων που ειδάλλως θα περνούσαν απαρατήρητα.
ja: パッチとテストが正しく動作していることを確認できたら､ Django のテストをすべて走らせて､変更が Django の別の場所にバグを仕込んでいないか確認しましょう｡すべてのテストが通るという事は､追加したコードがバグフリーだと保証します｡大量のバグや手戻りを発見できます｡そうでないとバグを見逃してしまうでしょう｡
pl: Kiedy zweryfikowałeś, że twoje poprawki i testy działają poprawnie, dobrym pomysłem jest uruchomić cały zestaw testów Django, aby zweryfikować tylko, czy twoja zmiana nie wprowadziła żadnych bugów w innych obszarach Django.
zh_hans: 如果已经确认补丁以及测试结果都正常，就运行 Django 的测试套件，验证你的修改是否导致 Django 的其它部分引入了新的 bug。 虽然测试用例帮助识别容易被人忽略的错误，但测试通过并不能保证完全没有 bug 存在。

source: To run the entire Django test suite, ``cd`` into the Django ``tests/`` directory and run:
el: Για να τρέξετε ολόκληρη τη σουίτα δοκιμών του Django, πληκτρολογήστε ``cd tests/`` και τρέξτε:
it: Per eseguire l'intera suite test di Django, a riga di commando esegui``cd`` nella cartella ``tests/`` di Django ed esegui:
ja: Django の全てのテストスイートを走らせるには ``cd`` で Django の ``tests/`` ディレクトリ移動して実行してください:
pl: Aby uruchomić zestaw testów Django w całości, wejdź ``cd`` w katalog ``tests/`` Django i uruchom:
zh_hans: 运行 Django 完整的测试用例，``cd`` 进入 Django下的 ``tests/`` 目录并运行：

source: As long as you don't see any failures, you're good to go.
ja: どのテストも失敗していない間は、作業を続けることができます。
pl: Jeśli nie widzisz żadnych błędów, śmiało możesz iść dalej.
zh_hans: 只要没有看到测试异常，你就可以继续下一步。

source: Writing Documentation
el: Γράφοντας το εγχειρίδιο (documentation)
it: Scrivere la Documentazione
ja: ドキュメントを書く
pl: Pisanie dokumentacji
zh_hans: 书写文档

source: This is a new feature, so it should be documented. Add the following section on line 1068 (at the end of the file) of ``django/docs/ref/forms/api.txt``::
ja: この機能は新しいので､ドキュメントに書かれるべきです｡ ``django/docs/ref/forms/api.txt`` の 1068行目 (ファイルの最後) に追記してください::
pl: To nowa funkcjonalność, więc powinna zostać udokumentowana. Dodaj następującą sekcję w linii 1068. (na końcu pliku) w pliku ``django/docs/ref/forms/api.txt``::
zh_hans: 这个新功能信息应该被记录成文档。在 ``django/docs/ref/forms/api.txt`` 第 1068 行（在文件末）添加以下部分内容::

source: Since this new feature will be in an upcoming release it is also added to the release notes for Django 1.9, on line 164 under the "Forms" section in the file ``docs/releases/1.9.txt``::
ja: この新機能は将来のリリースに含まれるとともに、Django 1.9のリリースノート、ファイル ``docs/releases/1.9.txt`` 164行目以降の"Forms"のセクションに追加されています。
pl: Jako że ta nowa funkcjonalność będzie w nadchodzącym wydaniu, dodajemy ją też do informacji o wydaniu dla Django 1.9, w linii 164. w sekcji „Forms” w pliku ``docs/releases/1.9.txt``::
zh_hans: 由于一新功能将在未来的某个版本被加入，所以 Django 1.9 的发布说明里加入了相关内容，在文件 ``docs/releases/1.9.txt`` 第 164 行 "Forms" 部分::

source: For more information on writing documentation, including an explanation of what the ``versionadded`` bit is all about, see :doc:`/internals/contributing/writing-documentation`. That page also includes an explanation of how to build a copy of the documentation locally, so you can preview the HTML that will be generated.
el: Για περισσότερες πληροφορίες σχετικά με οδηγίες σύνταξης του εγχειριδίου (περιέχει και την εξήγηση του ``versionadded``), δείτε στο :doc:`γράφοντας το εγχειρίδιο </internals/contributing/writing-documentation>`. Αυτή η σελίδα εξηγεί και το πως να δημιουργήσετε ένα αντίγραφο του εγχειριδίου σας τοπικά (στον υπολογιστή σας), ούτως ώστε να δείτε πως θα φαίνεται online στο επίσημο site του Django.
it: Per avere ulteriori informazione riguardo la scrittura della documentazione, includendo una spiegazione di cosa sia `versionadded`, controlla :doc:`/internals/contributing/writing-documentation`. Quella pagina include una spiegazione di come creare una copia della documentazione in locale, in modo da poter avere un'anteprima dell'HTML che verrà generato.
ja: ドキュメントの書き方についてもっと知りたい場合は :doc:`/internals/contributing/writing-documentation` を参照してください｡ここでは､ ``versionadded` の書き方についてや､ ドキュメントのコピーをローカルでビルドしてみて､ HTML をプレビューする方法などが書かれています｡
pl: Po więcej informacji na temat pisania dokumentacji, wliczając wyjaśnienie o co chodzi w cząstce ``versionadded``, odsyłamy do :doc:`/internals/contributing/writing-documentation`. Ta strona zawiera również wyjaśnienie jak zbudować lokalnie kopię dokumentacji, aby móc obejrzeć HTML, który zostanie później wygenerowany.
zh_hans: 更多关于编写文档和 ``versionadded`` 的解释和信息，请参考 :doc:`/internals/contributing/writing-documentation`。这个页面还介绍了怎么在本地重新生成一份文档，方便你在本地预览文档。

source: Generating a patch for your changes
ja: 変更のパッチを生成する
pl: Generowanie patcha dla twoich zmian

source: Now it's time to generate a patch file that can be uploaded to Trac or applied to another copy of Django. To get a look at the content of your patch, run the following command:
ja: Trac にアップロードされたり､他のDjangoに適応されるパッチを作りましょう｡パッチの内容を見るために､以下のコマンドを実行してください:
pl: Nadszedł czas na wygenerowanie pliku patch, który będzie mógł być wgrany do Traca lub zastosowany na innej kopii Django. Aby uzyskać obraz zawartości twojego patcha, uruchom następującą komendę:

source: This will display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial.
ja: チュートリアルの初めでチェックアウトした最初のリビジョンと､(修正した) 現在の Django のコピーとの違いを表示します｡
pl: Spowoduje to wyświetlenie się różnic między twoją bieżącą kopią Djang (z twoimi zmianami) i rewizją, którą pierwotnie zcheck-outowałeś wcześniej w tym tutorialu.

source: Once you're done looking at the patch, hit the ``q`` key to exit back to the command line. If the patch's content looked okay, you can run the following command to save the patch file to your current working directory:
ja: パッチを見終わったら､ ``q`` キーをタイプしたコマンドラインに戻りましょう｡パッチの内容が良さそうなら､以下のコマンドを実行して､現在のワーキングディレクトリにパッチを保存してください:
pl: Kiedy skończysz oglądać patch, kliknij przycisk ``q``, aby wyjść i wrócić do linii komend. Jeśli treść patcha wyglądała w porządku, możesz uruchomić następującą komendę, aby zapisać plik patch w bieżącym katalogu roboczym:

source: You should now have a file in the root Django directory called ``24788.diff``. This patch file contains all your changes and should look this:
ja: Django のルートディレクトリに ``24788.diff`` というファイルが作られるでしょう｡このパッチは変更のすべてを含んでおり､このようになります:
pl: Powinieneś teraz mieć plik w głównym katalogu Django o nazwie ``24788.diff``. Ten plik patch zawiera wszystkie twoje zmiany i powinien wyglądać tak:

source: So what do I do next?
ja: 次はどうしましょうか?
pl: Więc co robimy dalej?

source: Congratulations, you've generated your very first Django patch! Now that you've got that under your belt, you can put those skills to good use by helping to improve Django's codebase. Generating patches and attaching them to Trac tickets is useful, however, since we are using git - adopting a more :doc:`git oriented workflow </internals/contributing/writing-code/working-with-git>` is recommended.
ja: おめでとうございます! Django への最初のパッチができました! パッチの書き方を習得したので､ Django のコードベースを改善するためにスキルを活かしましょう｡パッチを生成して､Tracのチケットに貼り付けるのは便利ですが､ git を使っている場合は､ `git ワークフロー </internals/contributing/writing-code/working-with-git>`_ の利用がオススメです｡
pl: Gratulacje, wygenerowałeś swojego pierwszego patcha Django! Teraz, kiedy masz już to narzędzie opanowane, możesz dobrze wykorzystać tę umiejętność pomagając udoskonalać kod Django. Generowanie patchy i załączanie ich do zgłoszeń w Tracu jest przydatne, ale odkąd używamy gita – zalecane jest przyjęcie workflow bardziej :doc:`zorientowanego na gita </internals/contributing/writing-code/working-with-git>`.

source: Since we never committed our changes locally, perform the following to get your git branch back to a good starting point:
ja: 変更をローカルでコミットしなかった場合は､ git のブランチを始めに戻すために以下を実行してください:
pl: Jako że nigdy nie commitowaliśmy lokalnie naszych zmian, zrób to co poniżej, aby przywrócić gałąź gita do dobrego punktu początkowego:

source: More information for new contributors
el: Περισσότερες πληροφορίες για του νέους στην συνεισφορά
it: Maggiori informazioni per nuovi contributori
ja: 新しい貢献者のための情報
pl: Więcej informacji dla nowych kontrybutorów
zh_hans: 针对新贡献者的更多注意事项

source: Before you get too into writing patches for Django, there's a little more information on contributing that you should probably take a look at:
el: Προτού ξεκινήσετε να γράφετε patches για το Django, υπάρχουν μερικές ακόμη πληροφορίες στις οποίες θα πρέπει να ρίξετε μια ματιά:
it: Prima che anche tu inizi a scrivere patch per Django, ci sono altre informazioni a cui dovresti prima dare un'occhio:
ja: Django へのパッチを書き始める前に､貢献するために見ておいたほうがいい情報があります:
pl: Zanim za bardzo wsiąkniesz w pisanie patchy Django, jest trochę więcej informacji o dawaniu wkładu, na które prawdopodobnie powinieneś spojrzeć:
zh_hans: 在你开始为 Django 编写补丁时，这里有些信息，你应该看一看：

source: You should make sure to read Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`. It covers Trac etiquette, how to claim tickets for yourself, expected coding style for patches, and many other important details.
el: Θα πρέπει να διαβάσετε το εγχειρίδιο του Django σχετικά με :doc:`κατάθεση patches και διεκδίκηση tickets </internals/contributing/writing-code/submitting-patches>`. Καλύπτει την δεοντολογία του Trac, πως να διεκδικήσετε tickets για τον εαυτό σας, προτεινόμενο στυλ γραφής κώδικα για patches και πολλές άλλες σημαντικές λεπτομέρειες.
it: Dovresti assicurarti di leggere la documentazione Django su :doc:`rivendicare tickets and sottomettere patch</internals/contributing/writing-code/submitting-patches>'. Riguarda l'etichetta Trac, come rivendicare ticket per te stesso, stile di coding per le patch, e molti altri dettagli importanti.
ja: Django のドキュメントの `チケットをクレームして､パッチを送信する </internals/contributing/writing-code/submitting-patches>`_ を読んでください｡ Trac でのエチケットやチケットをクレームする方法やパッチに適切なコーディングスタイルなど､重要なことを網羅できます｡
pl: Powinieneś się upewnić, że przeczytałeś dokumentację Django na temat :doc:`tworzenia zgłoszeń i wysyłania patchy </internals/contributing/writing-code/submitting-patches>`. Zawiera ona etykietę Traca, jak przypisywać sobie zgłoszenia, oczekiwany styl kodowania w patchach i wiele innych ważnych szczegółów.
zh_hans: 确保你阅读了 Django 的参考文档 :doc:`创建工单和提交补丁 </internals/contributing/writing-code/submitting-patches>`。它涵盖了Trac 规则，如何创建自己的工单，补丁期望的代码风格和其他一些重要信息。

source: First time contributors should also read Django's :doc:`documentation for first time contributors</internals/contributing/new-contributors/>`. It has lots of good advice for those of us who are new to helping out with Django.
el: Όσοι από εσάς συνεισφέρουν για πρώτη φορά στο Django θα πρέπει να διαβάσουν :doc:`το εγχειρίδιο του Django για τους νέους συνεισφέροντες </internals/contributing/new-contributors/>`. Περιέχει πολλές και χρήσιμες συμβουλές για εκείνους που θέλουν να βοηθήσουν-υποστηρίξουν την Django κοινότητα.
it: Chi vuole contribuire per la prima volta dovrebbe anche leggere la :doc:'documentazione per i nuovi contributori</internals/contributing/new-contributors/>' di Django. E' piena di buoni consigli per quelli di noi che sono nuovi nell'aiutare con Django.
ja: Django への初めての貢献者は :doc:`初めての貢献者へのドキュメント </internals/contributing/new-contributors/>` を読んでください｡Django に初めて協力する人たちへの良いアドバイスがあります｡
pl: Ci, którzy mają styczność pierwszy raz z wnoszeniem wkładu do kodu, powinni przeczytać też :doc:`dokumentację Django dla nowych kontrybutorów</internals/contributing/new-contributors/>`. Zawiera wiele dobrych rad dla tych, którzy są nowi w pomaganiu w Django.
zh_hans: 初次提交补丁应额外阅读 :doc:`首次贡献者文档</internals/contributing/new-contributors/>`。这里有很多对新手贡献者的建议。
