Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: If the value of "Date published" doesn't match the time when you created the question in :doc:`Tutorial 1</intro/tutorial01>`, it probably means you forgot to set the correct value for the :setting:`TIME_ZONE` setting. Change it, reload the page and check that the correct value appears.
el: Αν η τιμή του "Date published" δεν ταιριάζει με την ώρα που αποθηκεύσατε την ερώτηση πριν (το ``Question`` object), αυτό σημαίνει ότι πιθανόν παραλείψατε να θέσετε τη σωστή τιμή στη ρύθμιση :setting:`TIME_ZONE` του αρχείου :file:`mysite/settings.py`. Αλλάχτε το, επαναφορτώστε τη σελίδα και ελέγξτε αν εμφανίστηκε η σωστή τιμή.
it: Se il valore di "Data di pubblicazione" non corrisponde all'ora in cui hai creato la domanda in :doc:`Tutorial 1</intro/tutorial01>`, probabilmente significa che hai dimenticato di impostare il valore corretto per l'impostazione :setting:`TIME_ZONE`. Modificalo, ricarica la pagina e verifica che appaia il valore corretto.
ja: もし「Data published」の値があなたが以前 :doc:`チュートリアルその1</intro/tutorial01>` で作成した questionと一致しないのであれば、それはおそらくあなたが :setting:`TIME_ZONE` で正しい値を設定することを忘れていたことを意味します。これを変更して、ページをリロードし、正しい値が表示されるかチェックします。
pl: Jeśli wartość pola „Date published” nie zgadza się z czasem, w którym stworzyłeś pytanie w :doc:`Tutorialu 1 </intro/tutorial01>`, prawdopodobnie oznacza to, że zapomniałeś podać poprawnej wartości ustawienia :setting:`TIME_ZONE`. Zmień je, przeładuj stronę i sprawdź, że pojawia się poprawna wartość.
zh_hans: 如果显示的 “发布日期(Date Published)” 和你在 :doc:`教程 1</intro/tutorial01>` 里创建它们的时间不一致，这意味着你可能没有正确的设置 :setting:`TIME_ZONE` 。改变设置，然后重新载入页面看看是否显示了正确的值。

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts. Then click "Save and continue editing." Then click "History" in the upper right. You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
el: Αλλάξτε τώρα την τιμή του "Date published" κλικάροντας στα κουμπιά "Σήμερα" και "Τώρα". Μετά κλικάρετε στο κουμπί " Αποθήκευση και συνέχεια επεξεργασίας". Μετά κλικάρετε στο κουμπί "Ιστορικό" (πάνω δεξιά της σελίδας). Θα δείτε μια σελίδα στην οποία εμφανίζονται όλες οι αλλαγές που έχουν γίνει μέχρι τώρα στο συγκεκριμένο object μέσω του Django admin, μαζί με ημερομηνία και ώρα που έγινε η αλλαγή καθώς και τον χρήστη που την έκανε:
it: Modificare la "Data di pubblicazione" facendo clic sui collegamenti "Oggi" e "Adesso". Quindi fai clic su " Salva e continua le modifiche ". Quindi fai clic su "Cronologia" in alto a destra. Vedrai una pagina che elenca tutte le modifiche apportate a questo oggetto tramite l'amministratore Django, con il timestamp e il nome utente della persona che ha apportato la modifica:
ja: 「今日」や「現在」ショートカットをクリックして、「Date published」を変更してみましょう。変更したら、「保存して編集を続ける」を押します。次に、右上に ある「履歴 (History)」をクリックしてみましょう。ユーザが管理サイト上でオブジェクトに対して行った変更履歴の全てを、変更時刻と変更を行ったユーザ名付きでリストにしたページが表示されます:
pl: Zmień „Date published” klikając skróty „Dzisiaj” i „Teraz”. Następniej kliknij „Zapisz i kontynuuj edycję”. Następnie kliknij w „Historia” w prawym górnym rogu. Zobaczysz stronę wylistowującą wszystkie zmiany dokonane na tym obiekcie przez panel administracyjny Django, z czasem i nazwą użytkownika osoby, która zrobiła zmianę:
zh_hans: 通过点击 “今天(Today)” 和 “现在(Now)” 按钮改变 “发布日期(Date Published)”。然后点击 “保存并继续编辑(Save and add another)”按钮。然后点击右上角的 “历史(History)”按钮。你会看到一个列出了所有通过 Django 管理页面对当前对象进行的改变的页面，其中列出了时间戳和进行修改操作的用户名：

source: When you're comfortable with the models API and have familiarized yourself with the admin site, read :doc:`part 3 of this tutorial</intro/tutorial03>` to learn about how to add more views to our polls app.
el: Όταν νιώσετε άνετα με το API των μοντέλων (πειραματιστείτε με τις αναζητήσεις στην database, με τις συσχετίσεις των μοντέλων μεταξύ τους κλπ) και έχετε εξοικειωθεί με το διαχειριστικό περιβάλλον, συνεχίστε στο :doc:`τρίτο μέρος αυτού του οδηγού </intro/tutorial03>` για να μάθετε περισσότερα σχετικά με την προσθήκη views στην εφαρμογή μας (polls).
it: Quando sei a tuo agio con l'API dei modelli e hai familiarizzato con il sito di amministrazione, leggi la :doc:`parte 3 di questo tutorial</intro/tutorial03>` per sapere come aggiungere più visualizzazioni alla nostra app per i sondaggi.
ja: モデルのAPIや、あなた自身で親しみやすくしたadmin サイトが方があった方が具合がいいと思うときは、polls アプリにより多くのビュー追加する方法を学習するため :doc:`チュートリアルその3</intro/tutorial03>` を読みましょう。
pl: Jeśli czujesz się dobrze z API modeli i zaprzyjaźniłeś się z panelem administracyjnym, przeczytaj :doc:`3. część tego tutoriala </intro/tutorial03>`, aby dowiedzieć się jak dodać więcej widoków do naszej aplikacji ankietowej.
zh_hans: 当你熟悉了数据库 API 之后，你就可以开始阅读 :doc:`教程第 3 部分</intro/tutorial03>` ，下一部分我们将会学习如何为投票应用添加更多视图。

source: Writing your first Django app, part 3
el: Γράφοντας το πρώτο σας Django app, μέρος 3
it: Scrivere la tua prima applicazione in Django, parte 3
ja: はじめての Django アプリ作成、その 3
pl: Pisanie pierwszej aplikacji Django, część 3.
zh_hans: 编写你的第一个 Django 应用，第 3 部分

source: This tutorial begins where :doc:`Tutorial 2 </intro/tutorial02>` left off. We're continuing the Web-poll application and will focus on creating the public interface -- "views."
el: Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 2 </intro/tutorial02>`. Συνεχίζουμε με την εφαρμογή μας (σκοπός μας είναι φτιάξουμε ένα σύστημα ψηφοφορίας όπου θα γράφουμε τις ερωτήσεις και τι πιθανές επιλογές και ο κόσμος θα μπορεί να ψηφίζει). Αυτή τη φορά θα επικεντρωθούμε στην προβολή της ιστοσελίδας μας στο ευρύ κοινό, στα “views”.
it: Questo tutorial inizia dove :doc:`Tutorial 2 </intro/tutorial02>` si è interrotto. Stiamo continuando l'applicazione Web-poll e ci concentreremo sul crearne l'interfaccia pubblica -- "views".
ja: このチュートリアルは :doc:`チュートリアルその 2 </intro/tutorial02>` の続きです。ここでは、引続き Web 投票アプリケーションの開発を例にして、公開用のインタフェース、ビュー(view) の作成を焦点に解説します。
pl: Ten tutorial zaczyna się, gdzie skończył się :doc:`Tutorial 2 </intro/tutorial02>. Kontynuujemy z aplikacją web-ankiet i skupimy się na tworzeniu publicznego interfejsu – „widoków”.
zh_hans: 这一篇从 :doc:`教程第 2 部分 </intro/tutorial02>` 结尾的地方继续讲起。我们将继续编写投票应用，并且专注于如何创建公用界面——也被称为“视图”。

source: Overview
el: Επισκόπηση
it: Panoramica
ja: オーバービュー
pl: Przegląd
zh_hans: 概况

source: A view is a "type" of Web page in your Django application that generally serves a specific function and has a specific template. For example, in a blog application, you might have the following views:
el: Ένα view είναι ένας "τύπος" μιας ιστοσελίδας (Web page) σε ένα Django application το οποίο, σε γενικές γραμμές, εξυπηρετεί μια συγκεκριμένη συνάρτηση και έχει ένα συγκεκριμένο template. Για παράδειγμα, ένα blog application, μπορεί να περιέχει τα ακόλουθα views:
it: Una view è un "tipo" di pagina web Django nella tua applicazione Django che generalmente serve come funzione specifica ed ha un template specifico. Per esempio, in una applicazione blog, potresti avere le seguenti views:
ja: ビューとは、 Django のアプリケーションにおいて特定の機能を提供するウェブペー ジの「型 (type)」であり、各々のテンプレートを持っています。例えばブログアプリケーションなら、以下のようなビューがあるでしょう:
pl: Widok jest „typem” strony internetowej w tworzej aplikacji Django, który w ogólności służy określonej funkcji i ma określony szablon. Na przykład w aplikacji blogowej, możesz mieć następujące widoki:
zh_hans: Django 中的视图的概念是「一类具有相同功能和模板的网页的集合」。比如，在一个博客应用中，你可能会创建如下几个视图：

source: Blog homepage -- displays the latest few entries.
el: Blog homepage -- προβάλει τα μερικά από τα τελευταία entries (καταχωρήσεις).
it: Home page del blog -- mostra le ultime voci.
ja: Blog ホームページ - 最新エントリーをいくつか表示
pl: Strona główna bloga – wyświetla kilka najnowszych wpisów.
zh_hans: 博客首页——展示最近的几项内容。

source: Entry "detail" page -- permalink page for a single entry.
el: Σελίδα "λεπτομερειών" μιας entry (καταχώρησης) -- μια permalink σελίδα για ένα συγκεκριμένο entry.
it: Pagina di "dettaglio" della voce -- pagina permanente per una singola voce.
ja: エントリー詳細ページ - 1エントリーへのパーマリンク (permalink) ページ
pl: Strona „szczegółów” wpisu – strona na pojedynczy wpis.
zh_hans: 内容“详情”页——详细展示某项内容。

source: Year-based archive page -- displays all months with entries in the given year.
el: Σελίδα archive ανά ημερολογιακό χρόνο -- προβάλει όλους τους μήνες που έχουν καταχωρήσεις για το δοθέντα έτος.
it: Pagina di archivio in base all'anno -- visualizza tutti i mesi con le voci nell'anno specificato.
ja: 年ごとのアーカイブページ - 指定された年のエントリーの月を全て表示
pl: Roczna strona archiwum – wyświetla wszystkie miesiące z wpisami w danym roku.
zh_hans: 以年为单位的归档页——展示选中的年份里各个月份创建的内容。

source: Month-based archive page -- displays all days with entries in the given month.
el: Σελίδα archive ανά ημερολογιακό μήνα -- προβάλει όλες τις μέρες που έχουν καταχωρήσεις για το δοθέντα μήνα.
it: L'archivio mensile -- mostra tutti i giorni con le relative pubblicazioni in un dato mese.
ja: 月ごとのアーカイブページ - 指定された月のエントリーの日をすべて表示
pl: Miesięczna strona archiwum – wyświetla wszystkie dni z wpisami w danym miesiącu.
zh_hans: 以月为单位的归档页——展示选中的月份里各天创建的内容。

source: Day-based archive page -- displays all entries in the given day.
el: Σελίδα archive ανά ημερολογιακή μέρα -- προβάλει όλα τα entries μια συγκεκριμένη μέρα.
it: L'archivio giornaliero -- mostra tutte le pubblicazioni in un determinato giorno.
ja: 日ごとのアーカイブページ - 指定された日の全てのエントリーを表示
pl: Dzienna strona archiwum – wyświetla wszystkie wpisy z danego dnia.
zh_hans: 以天为单位的归档页——展示选中天里创建的所有内容。

source: Comment action -- handles posting comments to a given entry.
el: Προσθήκη σχολίου -- χειρίζεται τα σχόλια πάνω στα posts για ένα συγκεκριμένο entry.
it: L'azione per i commenti -- gestisce la possibilità di commentare una determinata pubblicazione.
ja: コメント投稿 - エントリーに対するコメントの投稿を受付
pl: Komentowanie – obsługuje dodawanie komentarzy do danego wpisu.
zh_hans: 评论处理器——用于响应为一项内容添加评论的操作。

source: In our poll application, we'll have the following four views:
el: Στη δική μας εφαρμογή, θα έχουμε τα ακόλουθα τέσσερα views:
it: Nella nostra applicazione di sondaggi, avremo le seguenti quattro visualizzazioni:
ja: 投票アプリケーションでは、以下4つのビューを作成します:
pl: W naszej aplikacji ankietowej będziemy mieć następujące cztery widoki:
zh_hans: 而在我们的投票应用中，我们需要下列几个视图：

source: Question "index" page -- displays the latest few questions.
el: Αρχική σελίδα ("index") ερωτήσεων -- προβάλει τις τελευταίες ερωτήσεις.
it: L' "indice" delle domande -- mostra una selezione delle ultime domande.
ja: 質問 "インデックス" ページ -- 最新の質問をいくつか表示
pl: Strona „główna” pytań – wyświetla klika najnowszych pytań.
zh_hans: 问题索引页——展示最近的几个投票问题。

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
el: Σελίδα "λεπτομερειών" μιας ερώτησης -- προβάλει μια ερώτηση, χωρίς αποτελέσματα, αλλά με μια φόρμα (η οποία θα περιέχει τις επιλογές της ερώτησης) προς ψήφιση.
it: La pagina "dettagli" della domanda -- mostra il testo della domanda, senza risultati ma con un form per votare.
ja: 質問 "詳細" ページ -- 結果を表示せず、質問テキストと投票フォームを表示
pl: Strona „szczegółów” pytania – wyświetla treść pytania, bez wyników, ale z formularzem do głosowania.
zh_hans: 问题详情页——展示某个投票的问题和不带结果的选项列表。

source: Question "results" page -- displays results for a particular question.
el: Σελίδα "αποτελεσμάτων" μιας ερώτησης -- προβάλει τα αποτελέσματα μιας συγκεκριμένης ερώτησης.
it: La pagina "risultati" delle domande -- mostra i risultati per una determinata domanda.
ja: 質問 "結果" ページ -- 特定の質問の結果を表示
pl: Strona „wyników” pytania – wyświetla wyniki dla wybranego pytania.
zh_hans: 问题结果页——展示某个投票的结果。

source: Vote action -- handles voting for a particular choice in a particular question.
el: Προσθήκη ψήφου -- χειρίζεται τη ψήφο μιας συγκεκριμένης επιλογής μιας συγκεκριμένης ερώτησης.
it: L'azione del voto -- gestisce il voto per una scelta particolare in una azione particolare.
ja: 投票ページ -- 特定の質問の選択を投票として受付
pl: Akcja głosowania – obsługuje głosowanie na konkretny wybór w wybranym pytaniu.
zh_hans: 投票处理器——用于响应用户为某个问题的特定选项投票的操作。

source: In Django, web pages and other content are delivered by views. Each view is represented by a simple Python function (or method, in the case of class-based views). Django will choose a view by examining the URL that's requested (to be precise, the part of the URL after the domain name).
el: Στο Django, οι ιστοσελίδες όπως επίσης και άλλα περιεχόμενα εξυπηρετούνται από τα views. Κάθε view αντιπροσωπεύεται από μια απλή Python συνάρτηση (ή μέθοδο, στην περίπτωση των class-based views). Το Django θα διαλέξει το view ανάλογα το URL το οποίο ζητήθηκε (πιο συγκεκριμένα, το μέρος του URL μετά το domain name).
ja: Django へだ、各ページとコンテンツはビューによって提供されます。各ビューは単純に Python 関数 (クラスベースビューの場合はメソッド) として実装されています。 Django はビューを、リクエストされたURLから決定します (正確には、URLのドメイン移行の部分)
pl: W Django strony i inna treść są dostarczane przez widoki. Każdy widok jest reprezentowany przez prostą funkcję Pythona (lub metodę, w przypadku widoków opartych na klasach). Django wybierze widok sprawdzając URL, który jest zażądany (aby być dokładnym, część URL-a po nazwie domeny).
zh_hans: 在 Django 中，网页和其他内容都是从视图派生而来。每一个视图表现为一个简单的 Python 函数（或者说方法，如果是在基于类的视图里的话）。Django 将会根据用户请求的 URL 来选择使用哪个视图（更准确的说，是根据 URL 中域名之后的部分）。

source: Now in your time on the web you may have come across such beauties as "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
el: Ίσως μέχρι τώρα έχετε δει στην διαδικτυακή σας περιήγηση μερικές ομορφιές όπως "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B". Ίσως θα σας χαροποιήσει το γεγονός ότι το Django χρησιμοποιεί (και το κάνει) πολύ πιο κομψά *URL patterns* εν συγκρίσει με αυτά.
ja: インターネットサーフィンをしてるときなどに、 "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B" のような美しいURLを見かけることがあるでしょう。 Django はこんなものよりもっとエレガントな "URLパターン" を提供していると知っておいてください。
pl: Teraz w swoim czasie w Internecie można natknąć się na takie piękności jak „ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B”. Będziesz zadowolony wiedząc, że Django pozwala nam na znacznie bardziej eleganckie *wzorce adresów URL* niż ten.
zh_hans: 在你上网的过程中，很可能看见过像这样美丽的 URL： "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B" 。别担心，Django 里的 *URL 规则* 要比这优雅的多！

source: A URL pattern is simply the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
el: Ένα URL pattern (μοτίβο) είναι απλά μια γενική φόρμα ενός URL – για παράδειγμα: ``/newsarchive/<year>/<month>/``.
ja: URLパターンはURLをシンプルに一般化したものです。例えば "/newsarchive/<year>/<month>/" などです。
pl: Wzorzec URL jest po prostu ogólną formą URL-a – na przykład: ``/newsarchive/<year>/<month>/``.
zh_hans: 一个 URL 模式定义了某种 URL 的基本格式——举个例子：``/newsarchive/<year>/<month>/``。

source: To get from a URL to a view, Django uses what are known as 'URLconfs'. A URLconf maps URL patterns (described as regular expressions) to views.
ja: URLからビューには、 Django は 'URLconfs' として知られているものを使います。 URLconf は (正規表現で表される) URLパターンとビューを対応付けます。
pl: Aby przejść z URL-a do widoku, Django używa czegoś, co znane jest jako 'URLconfs'. URLconf mapuje wzorce URL (opisane jako wyrażenia regularne) na widoki.

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.core.urlresolvers` for more information.
ja: このチュートリアルでは基本的な URLconf の使い方を紹介します。詳細については :mod:`django.core.urlresolvers` を参照してください。

source: Writing more views
el: Γράφοντας περισσότερα views
it: Scrivere altre visualizzazioni
ja: もっとビューを書いてみる
pl: Pisanie kolejnych widoków
zh_hans: 编写更多视图

source: Now let's add a few more views to ``polls/views.py``. These views are slightly different, because they take an argument:
el: Ας προσθέσουμε τώρα μερικά views παραπάνω, στο αρχείο ``polls/views.py``. Αυτά τα views είναι ελαφρώς διαφορετικά, επειδή παίρνουν και όρισμα (argument):
it: Adesso aggiungiamo poche altre view a ``polls/views.py``. Queste view sono leggermente differenti, perchè prendono un argomento:
ja: それではもう少しviewを``polls/vies.py``に追加していきましょう。これから追加するviewでは引数をとります。
pl: Teraz dodajmy kilka więcej widoków do ``polls/views.py``. Te widoki są nieco inne, bo biorą argument:
zh_hans: 现在让我们向 ``polls/views.py`` 里添加更多视图。这些视图有一些不同，因为他们接收参数：

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.conf.urls.url` calls:
ja: 新しいviewを``polls.urls``に追加します。:func:`~django.conf.urls.url` 呼び出すview
pl: Podłącz te nowe widoki do modułu ``polls.urls`` dodając następujące wywołania :func:`~django.conf.urls.url`:

source: Take a look in your browser, at "/polls/34/". It'll run the ``detail()`` method and display whatever ID you provide in the URL. Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
el: Ρίξτε μια ματιά με τον browser σας στη σελίδα, "/polls/34/". Με το που πατήσετε enter, το GET request που κάνατε για αυτό το URL θα κάνει trigger το Django project σας, θα γίνει σκανάρισμα των URLs, θα ταιριάξει το δεύτερο URL pattern το οποίο με τη σειρά του θα καλέσει τη μέθοδο ``detail()`` και η τελευταία θα προβάλει το μήνυμα μαζί με το ID που εισήχθη στο URL (το response το οποίο επιστρέφει η ``detail`` συνάρτηση). Τώρα δοκιμάστε το "/polls/34/results/" και το "/polls/34/vote/" -- αυτά τα URLs θα εμφανίσουν μια σελίδα placeholder για τα αποτελέσματα και τις ψηφοφορίες αντίστοιχα.
it: Dai un'occhiata al tuo browser, su "/polls/34/". Lancerà il metodo ``detail()`` e mostrerà qualsiasi ID gli fornirai nella URL. Prova anche "/polls/34/results/" e "/polls/34/vote/" -- mostreranno il placeholder dei risultati e le pagine per le votazioni.
ja: お使いのブラウザで、 "/polls/34/" を見てください。 ``detail()`` メソッドが実行され、URLで提供したIDが表示されます。"/polls/34/results/" と "/polls/34/vote/" も試してください。結果と投票ページのプレースホルダがそれぞれ表示されます。
pl: Spójrz na „/polls/34/” w swojej przeglądarce. Uruchomi to metodę ``detail()`` i wyświetli jakiekolwiek ID podasz w URL-u. Spróbuj też „/polls/34/results/” i „/polls/34/vote/” – te wyświetlą strony wyników i głosowania.
zh_hans: 然后看看你的浏览器，如果你转到 "/polls/34/" ，Django 将会运行 ``detail()`` 方法并且展示你在 URL 里提供的问题 ID。再试试 "/polls/34/vote/" 和 "/polls/34/vote/" ——你将会看到暂时用于占位的结果和投票页。

source: When somebody requests a page from your website -- say, "/polls/34/", Django will load the ``mysite.urls`` Python module because it's pointed to by the :setting:`ROOT_URLCONF` setting. It finds the variable named ``urlpatterns`` and traverses the regular expressions in order. The :func:`~django.conf.urls.include` functions we are using simply reference other URLconfs. Note that the regular expressions for the :func:`~django.conf.urls.include` functions don't have a ``$`` (end-of-string match character) but rather a trailing slash. Whenever Django encounters :func:`~django.conf.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
ja: 誰かがWebサイトの "/polls/34/" をリクエストすると、 Django は :setting:`ROOT_URLCONF` に指定されている、 Python モジュール ``mysite.urls`` をロードします。そのモジュール内の ``urlpatterns`` という変数を探し、その中に入っている正規表現を順に検査してゆきます。:func:`~django.conf.urls.include` 関数は、単に他の URLconf の参照に使用します。 :func:`~django.conf.urls.include` 関数の正規表現は、 ``$``(終端マッチ文字) ではなく、スラッシュがあることに注意してください。 Django は func:`~django.conf.urls.include` を 見つけたとき、マッチした URL 一部を区切って、さらなる処理のために、インクルードした URLconf に残りの部分を送ります。

source: The idea behind :func:`~django.conf.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
ja: :func:`~django.conf.urls.include` の背景にある考えは、 URL のプラグ & プレイを簡単に作ることです。 polls には独自の URLconf (``polls/urls.py``) を持っているので、 "/polls/" 、 "/fun_polls/" や、 "/content/polls/" といった、どんなパスルート下にも置けて、どこに置いてもきちんと動作します。
pl: Pomysłem leżącym za :func:`~django.conf.urls.include` jest ułatwienie podłączania URL-i. Skoro ankiety są w swoim własnym URLconfie (``polls/urls.py``), mogą być umieszczone pod „/polls/” lub pod „/fun_polls/” lub pod „/content/polls/” lub dowolnym innym początkiem ścieżki i aplikacja wciąż będzie działać.

source: Here's what happens if a user goes to "/polls/34/" in this system:
ja: このシステムでユーザが "/polls/34/" にアクセスすると、次のように処 理されます:

source: Django will find the match at ``'^polls/'``
ja: Django は ``'^polls/'`` へのマッチを検出します。

source: Then, Django will strip off the matching text (``"polls/"``) and send the remaining text -- ``"34/"`` -- to the 'polls.urls' URLconf for further processing which matches ``r'^(?P<question_id>[0-9]+)/$'`` resulting in a call to the ``detail()`` view like so::
ja: Django はマッチ部分のテキスト (``"polls/"``) を取り去り、残りのテキスト ``"34/"`` を 'polls.urls' という URLconf に送り、``r'^(?P<question_id>[0-9]+)/$'`` にマッチする処理をさらに行い、``detail()`` ビューが呼ばれます::

source: The ``question_id='34'`` part comes from ``(?P<question_id>[0-9]+)``. Using parentheses around a pattern "captures" the text matched by that pattern and sends it as an argument to the view function; ``?P<question_id>`` defines the name that will be used to identify the matched pattern; and ``[0-9]+`` is a regular expression to match a sequence of digits (i.e., a number).
ja: ``question_id='34'`` の部分は、 ``(?P<question_id>[0-9]+)`` から来ています。パターンの前後に括弧を使用すると、そのパターンにマッチしたテキストを "キャプチャ" し、ビュー関数の引数として、それを送信します。 ``?P<question_id>`` はマッチしたパターンを識別するために使用する名前を定義します。 ``[0-9]+`` は一桁以上の数字(すなわち、数)にマッチする正規表現です。
pl: Część ``question_id='34'`` pochodzi z ``(?P<question_id>[0-9]+)``. Użycie nawiasów dookoła wzorca „wyłapuje” tekst dopasowany do tego wzorca i wysyła go jako arguement do funkcji widoku; ``?P<question_id>`` definiuje nazwę, która zostanie użyta, aby zidentyfikować dopasowany wzorzec; a ``[0-9]+`` jest wyrażeniem regularnym do dopasowania do sekwencji cyfr (na przykład liczby).

source: Because the URL patterns are regular expressions, there really is no limit on what you can do with them. And there's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
ja: URL パターンは正規表現であるため、正規表現で実現できる限り制限はありません。また、 ``.html`` のような文字列を URL に追加する必要もありません。ただし、次のようにすれば、表現できます::
pl: Dzięki temu, że wzorce URL są wyrażeniami regularnymi, naprawdę nie ma ograniczenia, co możesz z nimi zrobić. I nie ma potrzeby dodawać wstawek do URL-i typu ``.html`` – chyba że tego chcesz, w takim przypadku możesz zrobić coś takiego::

source: But, don't do that. It's silly.
el: Αλλά μην το κάνετε. Είναι ανόητο και μη επαγγελματικό.
ja: とはいえ、こんな阿呆なことはやめましょう。
pl: Ale nie rób tego. To głupie.
zh_hans: 但是，别这样做，这太傻了。

source: Write views that actually do something
el: Γράφοντας views οι οποίες κάνουν κάτι
it: Scrivi delle visualizzazioni che fanno effettivamente qualcosa
ja: 実際に動作するビューを書く
pl: Pisanie widoków, które faktycznie coś robią
zh_hans: 写一个真正有用的视图
