Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: On some versions of Ubuntu the above command might fail. Use the ``virtualenv`` package instead, first making sure you have ``pip3``:
ja: いくつかのバージョンのUbuntuでは上記のコマンドは失敗するでしょう。まず ``pip3`` があることを確認し、 ``virtualenv`` パッケージを使用します。
pl: Na niektórych wersjach Ubuntu powyższa komenda może nie zadziałać. W takim przypadku użyj w zamian pakietu ``virtualenv``, upewniając się przed tym, że posiadasz ``pip3``:
zh_hans: 在 Ubuntu 的某些版本使用以上命令可能会失败。可以换成 ``virtualenv`` 这个包名试试，不过，你要先确保已安装 ``pip3``：

source: The final step in setting up your virtualenv is to activate it:
ja: virtualenvを有効化すれば設定は終わりです:
pl: Ostatnim krokiem w procesie konfigurowania Twojego środowiska wirtualnego jest jego aktywacja:
zh_hans: 最后一步是激活你的 virtualenv 设置：

source: If the ``source`` command is not available, you can try using a dot instead:
el: Αν η εντολή ``source`` δεν είναι διαθέσιμη, χρησιμοποιήστε την τελεία, όπως:
it: Se il commando ``source`` non è disponibile, puoi invece usare un punto:
ja: もし ``source`` コマンドが使えない場合、代わりに ``.`` を試してみてください:
pl: Jeśli komenda ``source`` nie jest dostępna, możesz spróbować zamiast niej użyć kropki:
zh_hans: 如果 ``source`` 命令不可用，你可以试试 . ：

source: To activate your virtualenv on Windows, run:
ja: Windows上でvirtualenvを有効にするために、実行してください:
pl: Aby aktywować swoje środowisko wirtualne w systemie Windows, uruchom:
zh_hans: 在 Windows 上激活你的 virtualenv，运行：

source: You have to activate the virtualenv whenever you open a new terminal window. virtualenvwrapper__ is a useful tool for making this more convenient.
ja: ターミナルの新しいウィンドウを開いたときは、virtualenvを有効にする必要があります。 virtualenvwrapper__ はこれをより簡単にできるツールです。
pl: Musisz aktywować swoje środowisko wirtualne zawsze, kiedy otwierasz nowe okno terminala. virtualenvwrapper__ jest przydatnym narzędziem ułatwiającym ten proces.
zh_hans: 在你打开一个终端前，你必须先激活 virtualenv。 virtualenvwrapper__ 是个不错的工具，简化了此操作。

source: Anything you install through ``pip`` from now on will be installed in your new virtualenv, isolated from other environments and system-wide packages. Also, the name of the currently activated virtualenv is displayed on the command line to help you keep track of which one you are using. Go ahead and install the previously cloned copy of Django:
ja: これより ``pip`` を通じてインストールした何もかもが、他の環境やシステムワイドなパッケージから分離されて、新しいvirtualenvにインストールされます。また、どの環境を使っているのかがわかるように現在有効なvirtualenvの名前がコマンドラインに表示されます。先ほどクローンしたDjangoのコピーをインストールして作業を続行します:
pl: Wszystko, co zainstalujesz poprzez ``pip`` od teraz będzie instalowane w Twoim nowym środowisku wirtualnym, odizolowane od innych środowisk i pakietów w systemie. Ponadto nazwa aktualnie aktywowanego środowiska wirtualnego jest wyświetlana w wierszu poleceń, aby ułatwić Ci śledzenie, którego z nich używasz. Śmiało zainstaluj wcześniej sklonowaną kopię Django:
zh_hans: 从现在开始你通过 ``pip`` 安装的软件包都将被安装在新的 virtualenv ，与其他环境和系统级包隔离。此外，命令行上显示了当前激活的 virtualenv 的名称，以帮助您跟踪您正在使用哪个环境。来吧，安装之前克隆的 Django 副本：

source: The installed version of Django is now pointing at your local copy. You will immediately see any changes you make to it, which is of great help when writing your first patch.
el: Η εγκατεστημένη έκδοση του Django είναι τώρα μέσα στο virtualenv σας και μπορείτε να κάνετε ``import django`` σε Python κονσόλα χωρίς να σας επιστρέψει σφάλμα (cannot import module django). Τώρα μπορείτε να δείτε απ’ ευθείας τις αλλαγές που κάνετε σε αυτό το πακέτο, το οποίο είναι εξαιρετικά χρήσιμο, ειδικά όταν θα γράψετε το πρώτο σας patch αρχείο.
ja: 現在インストールされたDjangoはあなたのローカルコピーを参照しています。あなたが行ったどのような変更も迅速に確認できます、これはあなたが最初のパッチを作成するときの大きな助けになります。
pl: Zainstalowana wersja Django od teraz wskazuje na Twoją lokalną kopię. Dzięki temu natychmiastowo będziesz widział wszelkie zmiany, których dokonasz co jest bardzo przydatne podczas pisania Twojej pierwszej poprawki.
zh_hans: 现在安装的 Django 版本就是你本地副本的版本。你将立刻见到任何你对它的修改，这对你编写第一个补丁很有帮助。

source: Rolling back to a previous revision of Django
ja: 旧リビジョンの Django に戻す
pl: Powracanie do poprzedniej wersji Django
zh_hans: 回滚至之前的 Django 版本

source: For this tutorial, we'll be using ticket :ticket:`24788` as a case study, so we'll rewind Django's version history in git to before that ticket's patch was applied. This will allow us to go through all of the steps involved in writing that patch from scratch, including running Django's test suite.
ja: このチュートリアルでは、ケーススタディとして :ticket:`24788` を用います。そのために、まず Django のバージョンをパッチが適用される前の git のバージョンに戻します。これによりスクラッチからパッチの作成、 Django のテストスイートの実行を含む全ての手順を解説します。
pl: Na potrzeby tutoriala, użyjemy zgłoszenia :ticket:`24788` jako studium przypadku, więc przewiniemy historię wersji Django w git'cie do momentu zanim dodana została poprawka tego zgłoszenia. To pozwoli nam przejść wszystkie kroki składające się na napisanie tej poprawki od podstaw, włączając uruchomienie pakietu testów Django.
zh_hans: 这个教程中，我们使用工单 :ticket:`24788` 来作为学习用例，所以我们回顾 git 中 Django 的版本历史，找到一个这个问题的补丁没有提交之前的版本。 这样的话我们就可以参与到从草稿到完成补丁的全过程，包括运行 Django 的测试套件。

source: **Keep in mind that while we'll be using an older revision of Django's trunk for the purposes of the tutorial below, you should always use the current development revision of Django when working on your own patch for a ticket!**
ja: **チュートリアルでは trunk ではない古いリビジョンの Django を使用しますが、自分のパッチを作成する場合は Django の最新の開発版を使用する必要があります!**
pl: **Zwróć uwagę, że mimo iż będziemy używać starszej wersji trunka Django na potrzeby poniższego tutoriala, powinieneś zawsze używać bieżącej wersji deweloperskiej Django pracując nad poprawką do zgłoszenia!**
zh_hans: **请记住，我们将用 Django 的老版本来到达学习的目的，通常情况下你应当使用当前最新的开发版本来提交补丁并解决工单！**

source: The patch for this ticket was written by Paweł Marczewski, and it was applied to Django as `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Consequently, we'll be using the revision of Django just prior to that, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.
ja: このチケットのパッチは Paweł Marczewski 氏により書かれ、これは `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__ で Django に適用されました。よって `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__ が適用される前の Django のリビジョンを使用します。
pl: Poprawka do tego zgłoszenia została napisana przez Pawła Marczewskiego i została zastosowana w Django jako `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__. Stąd użyjemy wersji Django bezpośrednio ją poprzedzającej, `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__.
zh_hans: 这个补丁由 Paweł Marczewski 开发，并 Git commit 到 Django 源码 `commit 4df7e8483b2679fc1cba3410f08960bac6f51115`__。因此, 我们要回到补丁提交之前的版本号， `commit 4ccfc4439a7add24f8db4ef3960d02ef8ae09887`__。

source: Navigate into Django's root directory (that's the one that contains ``django``, ``docs``, ``tests``, ``AUTHORS``, etc.). You can then check out the older revision of Django that we'll be using in the tutorial below:
ja: Django のルートディレクトリ (このディレクトリには ``django``, ``docs``, ``tests``, ``AUTHORS``, 等が含まれています) へ移動します。次にチュートリアルで使用する Django の旧リビジョンをチェックアウトします。
pl: Wejdź do głównego katalogu Django (to ten, który zawiera ``django``, ``docs``, ``tests``, ``AUTHORS`` itd.). Następnie możesz zcheckoutować starszą wersję Django, którą będziemy używać w poniższym tutorialu:
zh_hans: 首先打开 Django 源码的根目录（这个目录包含了 ``django``， ``docs``， ``tests``， ``AUTHORS``，等等）。然后你可以 check out 下面教程要用的较早版本的 Django ：

source: Running Django's test suite for the first time
el: Εκτέλεση της σουίτας δοκιμών του Django για πρώτη φορά
it: Eseguire la suite di test di Django per la prima volta
ja: 最初に Django のテストスイートを実行する
pl: Uruchomienie zestawu testów Django po raz pierwszy
zh_hans: 首先运行 Django 的测试套件

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes haven't completely broken Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand just to get familiar with what its output is supposed to look like.
ja: Django へ貢献する際、変更したコードが Django の他の領域にバグを混入しないことが非常に重要です。変更後に Django の正常動作を確認するには Django のテストスイートを実行します。すべてのテストに合格した場合は、その変更により Django が壊れていないことが確認できます。Django のテストスイートを実行したことが一度もない場合、その出力結果を把握しておくために一度テストスイートを実行しておくことを推奨します。
pl: Dając wkład w kod Django, bardzo ważne jest, aby twoje zmiany nie wprowadzały błędów w innych obszarach Django. Jednym ze sposobów, aby sprawdzić, czy Django nadal działa po twoich zmianach jest uruchomienie zestawu testów Django. Jeśli wszystkie testy nadal przechodzą, wtedy masz podstawy, by sądzić, że twoje zmiany nie popsuły kompletnie Django. Jeśli nigdy wcześniej nie uruchamiałeś zestawu testów Django, dobrym pomysłem jest uprzednio uruchomienie ich raz, tylko po to, abyś zaznajomił się, jak powinien wyglądać ich efekt.
zh_hans: 当你贡献代码给 Django 的时候，你修改的代码千万不要给其它部分引入新的 bug。 有个办法可以在你更改代码之后检查 Django 是否能正常工作，就是运行 Django 的测试套件。如果所有的测试用例都通过，你就有理由相信你的改动完全没有破坏 Django。如果你从来没有运行过 Django 的测试套件，那么比较好的做法是事先运行一遍，熟悉下正常情况下应该输出什么结果。

source: Before running the test suite, install its dependencies by first ``cd``-ing into the Django ``tests/`` directory and then running:
ja: Django のテストスイートを走らせる前に、まずは Djangoの ``tests/`` ディレクトリに ``cd`` で移動して、依存関係をインストールしてください:
pl: Przed uruchomieniem modułu testów zainstaluj jego zależności przed z``cd``owanie do katalogu ``tests/`` Django a następnie uruchomienie:
zh_hans: 运行测试套件之前，先 ``cd`` 进入 Django 的 ``test/`` 目录，安装其依赖，运行：

source: Now we are ready to run the test suite. If you're using GNU/Linux, Mac OS X or some other flavor of Unix, run:
ja: テストスイートを実効する準備が出来ました。もし GNU/Linux, Mac OS X 等 Unix 系OSを使用している場合、下記のコマンドを実行します:
pl: Teraz jesteśmy gotowi uruchomić zestaw testów. Jeśli używasz GNU/Linuksa lub jakiś inny rodzaj Uniksa, uruchom:

source: Now sit back and relax. Django's entire test suite has over 9,600 different tests, so it can take anywhere from 5 to 15 minutes to run, depending on the speed of your computer.
ja: それでは一息つきましょう。Django 全体のテストスイートは 9600 以上のテストが含まれており、コンピュータの速度により 5 〜 15分程度かかります。
pl: Teraz usiądź i odpręż się. Cały zestaw testów Django ma ich ponad 9600, więc ich wykonywanie może zająć coś pomiędzy 5 a 15 minutami, w zależności od szybkości twojego komputera.
zh_hans: 现在坐下来放松一下。Django 完整的测试套件有超过 9600 种不同的测试，所以它需要运行 5 到 15 分钟，这取决于你的电脑的速度。

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
ja: Django のテストスイートを実行中に、各テストの状態を文字のストリームで確認することができます。 ``E`` はテストにエラーが発生したことを表し、 ``F`` はテストのアサーションが失敗したことを表しています。これらは共にテスト失敗となります。``x`` と ``s`` はそれぞれ期待する失敗とスキップを表しています。ドットはテストの成功を表しています。
pl: Kiedy uruchomisz zestaw testów Django, zobaczysz strumień znaków oznaczających status każdego testu w trakcie uruchomienia. ``E`` oznacza, że został zgłoszony błąd podczas testu, ``F`` oznacza, że asercje testu nie zostały spełnione. Obie z nich są traktowane jako porażki testów. Jednocześnie ``x`` i ``s`` oznaczają kolejno spodziewane porażki i ominięte testy. Kropki oznaczają pomyślne przechodzenie testu.
zh_hans: Django 的测试套件运行时，您将看到一个字符流代表每个测试的运行的状态。 ``E`` 表示测试中出现异常， ``F`` 表示断言失败。这两种情况都被认为测试失败， ``x`` 和 ``s`` 分别表示与期望结果不同和跳过测试，点表示测试通过。

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial).
ja: スキップされたテストは、テストを実行するために必要な外部ライブラリがインストールされていないことが原因です; 依存については :ref:`running-unit-tests-dependencies` を参照し、関連するテストを実行してください (このチュートリアルでは必要ありません)。

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See :ref:`running-unit-tests` for more information.
el: Όταν ολοκληρωθούν τα τεστ, θα σας εμφανιστεί κάποιο μήνυμα που θα σας ενημερώνει για την επιτυχή ή όχι εκτέλεση τους. Εφόσον δεν έχετε κάνει κάποια αλλαγή μέχρι τώρα στον πηγαίο κώδικα του Django, όλα τα τεστ θα **πρέπει** να έχουν επιτυχή έκβαση. Αν δείτε τυχόν σφάλματα ή αποτυχίες κάποιων τεστ, σιγουρευτείτε ότι έχετε ακολουθήσει κατάλληλα τα ανωτέρω βήματα. Δείτε στο :ref:`τρέχοντας τα unit τεστ <running-unit-tests>` για περισσότερες πληροφορίες. Αν χρησιμοποιείτε την Python 3.5+, θα υπάρξουν κάποιες αποτυχίες μερικών τεστ οι οποίες οφείλονται σε προειδοποιήσεις υποβάθμισης (deprecation warnings) στις οποίες μπορείτε να μην δώσετε σημασία. Αυτές οι αποτυχίες έχουν αποκατασταθεί στην τρέχουσα έκδοση του Django. Σας υπενθυμίζουμε ότι σε αυτόν τον οδηγό χρησιμοποιούμε μια παλιά έκδοση του Django.
it: Una volta che il test è terminato, dovresti venir salutato con un messaggio che ti informa se la suite di test ha avuto successo o ha fallito. Poichè non hai ancora fatto modifiche al codice Django, l'intera suite di test **dovrebbe** aver successo. Se invece fallisce o dà errore assicurati di aver seguito tutti i passaggi precedenti correttamente. Guarda :ref:`running-unit-tests` per ulteriori informazioni.
ja: テストが終了するとテストが成功したか､失敗したかを知らせるメッセージが表示されます｡まだ Django のコードに変更を加えていなければ､テストは全て **パスするはずです** ｡もし失敗するかエラーが起こる場合は､これまでの全ステップを適切に実行してください｡ :ref:`running-unit-tests` で､よりテストについて知れます｡

source: Note that the latest Django trunk may not always be stable. When developing against trunk, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
ja: 開発中の､最新の Django ではステーブルとは限りません｡トランクバージョンで開発を行う場合､ `Django の継続インテグレーションビルド`__ をチェックしてください｡これで､テストの失敗があなたのマシンだけのものか､ Django 公式のビルドによるものかが分かります｡各ビルドについてのリンクをクリックすれば､ "Configuration Matrix" という､ 各 Python のバージョン､ DB バックエンドに対応したテストの失敗を閲覧できます｡
pl: Zwróć uwagę, że najnowsza wersja trunka Django może nie zawsze być stabilna. Kiedy dewelopujesz z użyciem trunka, możesz sprawdzić `Django's continous integration builds`__, aby zweryfikować czy porażki są specyficzne dla twojej maszyny czy są również obecne w oficjalnych buildach Django. Jeśli klikniesz, aby zobaczyć poszczególny build, możesz zobaczyć „Configuration Matrix”, która pokazuje porażki uzyskane w poszczególnych wersjach Pythona i bazodanowego backendu.
zh_hans: 注意最新版本 Django 分支不总是稳定的。当在分支上开发时，你可以查看代码持续集成构建页面的信息 `Django's continuous integration builds`__ 来判断测试错误只在你指定的电脑上发生，还是官方版本中也存在该错误。如果点击某个构建信息，可以通过 "Configuration Matrix" 查看错误发生时 Python 以及后端数据库的信息。

source: For this tutorial and the ticket we're working on, testing against SQLite is sufficient, however, it's possible (and sometimes necessary) to :ref:`run the tests using a different database <running-unit-tests-settings>`.
el: Για το συγκεκριμένο οδηγό και για το ticket πάνω στο οποίο δουλεύουμε, τα τεστ που αφορούν την SQLite είναι αρκετά, ωστόσο, είναι δυνατόν (και μερικές φορές απαραίτητο) να :ref:`τρέχουμε τεστ χρησιμοποιώντας διαφορετικές βάσεις δεδομένων <running-unit-tests-settings>`.
it: Per questa guida e il ticket su cui stiamo lavorando, testare con SQLite è sufficiente, comunque, è possibile (e a volte necessario) :ref:'eseguire i tests usando una banca dati differente.
ja: このチュートリアルや､各チケットで作業する際は､ SQLite のテストで十分です｡しかし可能 (か必要な場合は) :ref:`他のデータベースでテストを実行する <running-unit-tests-settings>` を参照してください｡
pl: Na potrzeby tego tutorialu i zgłoszenia, nad którym pracujemy, testowanie z użyciem SQLite wystarczy, chociaż jest możliwe (i czasem niezbędne), aby :ref:`uruchomić testy używając innej bazy danych <running-unit-tests-settings>`.
zh_hans: 在本教程以及处理工单所用分支中，测试使用数据库 SQLite 即可，然而在某些情况下需要（有时需要） ，参考 :ref:`run the tests using a different database `。

source: Writing some tests for your ticket
el: Γράφοντας μερικά τεστ για το ticket
it: Scrivere alcuni test per il tuo ticket
ja: チケットにテストを書く
pl: Pisanie testów do twojego zgłoszenia
zh_hans: 为你的工单写一些测试用例

source: In most cases, for a patch to be accepted into Django it has to include tests. For bug fix patches, this means writing a regression test to ensure that the bug is never reintroduced into Django later on. A regression test should be written in such a way that it will fail while the bug still exists and pass once the bug has been fixed. For patches containing new features, you'll need to include tests which ensure that the new features are working correctly. They too should fail when the new feature is not present, and then pass once it has been implemented.
el: Στις περισσότερες περιπτώσεις, για να θεωρηθεί ένα patch αποδεκτό για την ενσωμάτωση του στο Django, θα πρέπει να περιέχει τεστ. Για περιπτώσεις που αφορούν κάποια επιδιόρθωση σφάλματος (bug fix), θα πρέπει να γραφτεί ένα τεστ οπισθοδρόμησης (regression test) του οποίου η σημασία είναι η βεβαίωση ότι το σφάλμα (που επρόκειτο να διορθωθεί) δεν θα ξαναεμφανιστεί σε μεταγενέστερη έκδοση του Django. Ένα regression τεστ θα πρέπει να γραφτεί με τέτοιο τρόπο ούτως ώστε θα αποτυγχάνει (fail) όσο το σφάλμα θα υπάρχει και θα επιτυγχάνει όταν το σφάλμα διορθωθεί. Για patches τα οποία περιέχουν καινούργιο κώδικα (δεν προσπαθούν, δηλαδή, να διορθώσουν υπάρχον κώδικα αλλά προσθέτουν νέα χαρακτηριστικά-λειτουργία), θα χρειαστεί να συμπεριλάβετε τεστ τα οποία εξασφαλίζουν ότι το καινούργιο χαρακτηριστικό λειτουργεί ορθά (π.χ δημιουργία ενός καινούργιου django.db.models.fields ή δημιουργία καινούργιου template tag). Τα τεστ αυτά, θα πρέπει να αποτυγχάνουν όταν τα καινούργια αυτά χαρακτηριστικά δεν υπάρχουν (π.χ σε παλαιότερες εκδόσεις του Django) και αντιθέτως να επιτυγχάνουν όταν αυτά (τα χαρακτηριστικά) εμφανιστούν.
it: Nella maggior parte dei casi, affinchè una patch venga accettata in Django deve includere dei test. Per patch di correzione bug, questo significa che è necessario scrivere un test di regressione per assicurarsi che il bug non verrà mai reintrodotto in Django in futuro. Un test di regressione dovrebbe essere scritto in modo da fallire fintanto che il bug esiste ancora, e aver successo quando il bug invece è stato corretto. Per patch contenenti nuove funzionalità, avrai bisogno di includere test che assicurano che le nuove funzionalità stanno funzionando correttamente. Dovrebbero fallire se le nuove funzionalità non sono presenti, e aver successo quando invece sono implementate.
ja: 大抵の場合､ Django にアクセプトされるパッチはテストを含んでいます｡リグレッションテストを書くことで､ Django にバグを再混入していないと後に保証できます｡レグレッションテストは､バグが存在しているときに落ちるように書き､バグが修正された後にパスするように書かれるべきです｡新機能を含むパッチでは､その新機能が正しく動作すると保証するためにテストが必要です｡その際も同じように､新機能が無い際には落ち､実装されてから通るテストを書くべきです｡
pl: W większości przypadków, aby poprawka została wcielona do Django, musi zawierać testy. Dla poprawek błędów znaczy to napisanie testu regresyjnego, aby upewnić się, że bug nie zostanie wprowadzony z powrotem w przyszłości. Test regresyjny powinien zostać napisany w taki sposób, aby nie przechodził jeśli bug nadal istnieje i aby przechodził wtedy, kiedy bug zostanie naprawiony. Dla poprawek zawierających nowe funkcjonalności, musisz załączyć testy, które pozwolą się upewnić, że ta nowa funkcja działa poprawnie. One też powinny nie przechodzić kiedy nie ma nowej funkcji i przechodzić wtedy, kiedy zostanie ona zaimplementowana.
zh_hans: 大多数情况下，Django 的补丁必需包含测试。Bug 修复补丁的测试是一个回归测试，确保该 Bug 不会再次在 Django 中出现。该测试应该在 Bug 存在时测试失败，在 Bug 已经修复后通过测试。新功能补丁的测试必须验证新功能是否正常运行。新功能的测试将在功能正常时通过测试，功能未执行时测试失败。

source: A good way to do this is to write your new tests first, before making any changes to the code. This style of development is called `test-driven development`__ and can be applied to both entire projects and single patches. After writing your tests, you then run them to make sure that they do indeed fail (since you haven't fixed that bug or added that feature yet). If your new tests don't fail, you'll need to fix them so that they do. After all, a regression test that passes regardless of whether a bug is present is not very helpful at preventing that bug from reoccurring down the road.
el: Μια καλή πρακτική για να επιτύχετε τα παραπάνω είναι να γράψετε πρώτα τα τεστ, προτού κάνετε οποιεσδήποτε αλλαγές στον πηγαίο κώδικα. Αυτού του είδους το development ονομάζεται `test-driven development`__ και μπορεί να εφαρμοστεί από απλά patches μέχρι ολόκληρα projects. Αφού γράψετε τα τεστ, μπορείτε να τα τρέξετε για να διαπιστώσετε ότι όντως αποτυγχάνουν (λογικό, αφού δεν έχετε γράψει ακόμη κώδικα που να διορθώνει το σφάλμα ή κώδικα που προσθέτει κάποιο καινούργιο χαρακτηριστικό στο Django). Αν τα τεστ σας δεν αποτυγχάνουν, θα πρέπει να φροντίσετε ώστε να το κάνουν. Αν ένα regression test περνά, ανεξαρτήτως αν το σφάλμα (bug) υπάρχει ή όχι, δεν βοηθάει καθόλου και θα δυσκολέψει το έργο (όχι μόνο το δικό σας) της αποσφαλμάτωσης (debugging) στο μέλλον.
it: Un buon modo per farlo è quello di scrivere i nuovi test all'inizio, prima di fare modifiche al codice. Questo stile di sviluppo è chiamato 'test-driven development'__ e può essere applicato su interi progetti o singole patch. Dopo aver scritto i test, puoi eseguirli per verificare che effettivamente falliscono (poichè non hai corretto il bug o non hai ancora aggiunto quella funzionalità). Se i tuoi nuovi test non falliscono, devi correggerli affinchè lo facciano. Dopotutto, un test di regressione che passa indipendentemente dal fatto che un bug sia presente o no non è molto utile nel prevenire che esso possa ricomparire in futuro.
ja: これをするには､コードに変更を加える前に先にテストを書くのが良いでしょう｡この開発手法は `テスト駆動開発`__ と呼ばれ､プロジェクト全体にも単一のパッチにも適応可能です｡テストを書いた後には､テストを走らせて確かに落ちることを確認します (バグ修正や昨日の追加はまだしてないので落ちます)｡ 新しいテストが落ちない場合は落ちるよう修正しましょう｡ともかく､バグが存在していようとも通るテストは将来バグが再発するのを防ぐのに､何の役にもたちません｡
pl: Dobrym sposobem na to jest napisanie twoich testów najpierw, przed jakimikolwiek zmianami w kodzie. Taki styl pracy jest nazywany `test-driven development`__ i może być zastosowany zarówno do całych projektów jak i pojedynczych poprawek. Po napisaniu testów możesz je uruchomić, aby upewnić się, że nie przechodzą (bo przecież nie naprawiłeś tego błędu lub nie dodałeś tej funkcjonalności). Jeśli twoje nowe testy przechodzą pomyślnie, musisz poprawić je, aby nie przechodziły. Koniec końców test regresyjny, który przechodzi pomyślnie niezależnie od obecności buga w kodzie, nie pomoże za bardzo w ochronie przed pojawieniem się go w przyszłości.
zh_hans: 最好的方式是在修改代码之前写测试单元代码。这种开发风格叫做 `test-driven development`__ 被应用在项目开发和单一补丁开发过程中。单元测试编写完毕后，执行单元测试，此时测试失败（因为目前还没有修复 bug 或添加新功能），如果测试成功通过，你需要重新修改单元测试保证测试失败。因为单元测试并不能阻止 bug 发生。

source: Now for our hands-on example.
el: Ας εργαστούμε λοιπόν στο παράδειγμα μας.
it: Ora vediamo il nostro esempio.
ja: ハンズオンでの例題
pl: Pora na nasz praktyczny przykład.
zh_hans: 现在看我们的操作示例。

source: Writing some tests for ticket #24788
ja: チケット #24788 にテストを書いてみましょう
pl: Pisanie kilku testów do zgłoszenia #24788
zh_hans: 为工单 #24788 写测试

source: Ticket :ticket:`24788` proposes a small feature addition: the ability to specify the class level attribute ``prefix`` on Form classes, so that::
ja: チケット :ticket:`24788` は、Formクラスにおいてクラスレベルの属性 ``prefix`` を指定可能にするという小さな機能追加を、このように提案しています:
pl: Zgłoszenie :ticket:`24788` jest propozycją dodania małej funkcjonalności: możliwości ustalenia atrybutu ``prefix`` na poziomie klasy dla klas From, aby::
zh_hans: 工单 :ticket:`24788` 提议增加小特性：为表单类指定类级别的属性 ``prefix``，以便::
