Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: To verify that Django can be seen by Python, type ``python`` from your shell. Then at the Python prompt, try to import Django:
el: Για να σιγουρευτείτε ότι το Django μπορεί να το βρει η Python, πληκτρολογήστε ``python`` σε μια κονσόλα (γραμμή εντολών). Κατόπιν, μέσα στην Python κονσόλα, προσπάθήστε να κάνετε import το Django:
it: Per verificare che Django possa essere visto da Python, scrivi ``python`` dalla tua barra di comando. Successivamente all'avvio di Python, prova a importare Django:
ja: Djnago が Python から見れるか確認をするには、シェルで ``python`` とタイプして、 Python プロンプトから Django をインポートします:
pl: Aby zweryfikować czy Django jest widoczne dla Pythona, wpisz ``python`` w linię komend. Później przy prompcie Pythona, spróbuj zaimportować Django:
zh_hans: 若要验证 Django 是否能被 Python 识别，可以在 shell 中输入 ``python``。 然后在 Python 提示符下，尝试导入 Django：

source: You may have another version of Django installed.
el: Το αποτέλεσμα ίσως να είναι διαφορετικό με το δικό σας, ανάλογα την έκδοση που χρησιμοποιείτε. Όσο δεν λάβατε κάποιο σφάλμα είστε έτοιμοι!
it: Potresti avere installata un'altra versione di Django.
ja: 別バージョンの Django がインストールされてるかもしれません。
pl: Możesz mieć zainstalowane inne wersje Django.
zh_hans: 当然了，你也可能安装的是其它版本的 Django。

source: That's it!
el: Αυτό ήταν!
it: Tutto qui!
ja: これだけです!
pl: Tak jest!
zh_hans: 搞定！

source: That's it -- you can now :doc:`move onto the tutorial </intro/tutorial01>`.
el: Αυτό ήταν – μπορείτε τώρα να :doc:`περιηγηθείτε στον οδηγό μας (tutorial) </intro/tutorial01>`.
it: Tutto qui -- ora puoi :doc:`procedere con il tutorial </intro/tutorial01>`.
ja: これだけです。 `チュートリアルに進みましょう </intro/tutorial01>` 。
pl: To wszystko – możesz teraz :doc:`rozpocząć tutorial </intro/tutorial01>`.
zh_hans: 搞定，现在你可以 :doc:`move onto the tutorial </intro/tutorial01>`。

source: Django at a glance
el: Μια πρώτη ματιά στο Django
it: Django a prima vista
ja: Django の概要
pl: Django w skrócie
zh_hans: 初识 Django

source: Because Django was developed in a fast-paced newsroom environment, it was designed to make common Web-development tasks fast and easy. Here's an informal overview of how to write a database-driven Web app with Django.
el: Επειδή το Django αναπτύχθηκε σε ένα ειδησεογραφικό περιβάλλον με γρήγορους μεταβαλλόμενα ρυθμούς, σχεδιάστηκε με τέτοιο τρόπο ούτως ώστε οι συνηθισμένες Web εργασίες να διεκπεραιώνονται γρήγορα και εύκολα. Παρακάτω παρουσιάζεται μια γενική εικόνα του πως να γράψετε μια Web εφαρμογή (app) με βάση δεδομένων χρησιμοποιώντας το Django.
it: Poichè Django è stato sviluppato in una redazione dal ritmo serrato, è stato progettato per rendere le comuni pratiche di Web-development facili e veloci. Ecco qui una panoramica su come scrivere una database-driven Web app in Django
ja: Django は変転の激しいニュースルーム環境で開発された経緯から、よくある Web 開発タスクを迅速かつ簡単化するように設計されました。ここでは Django による データベース中心の Web アプリケーション開発をざっと見てみましょう。
pl: Jako że Django było rozwijane w dynamicznym środowisku prasowego newsroomu, zostało zaprojektowane w taki sposób, aby robić częste web-deweloperskie zadania szybko i prosto. Poniżej przedstawiamy nieformalny opis jak napisać opartą na bazie danych aplikację webową z Django.
zh_hans: Django 最初被设计用于具有快速开发需求的新闻类站点，目的是要实现简单快捷的网站开发。以下内容简要介绍了如何使用 Django 实现一个数据库驱动的 Web 应用。

source: The goal of this document is to give you enough technical specifics to understand how Django works, but this isn't intended to be a tutorial or reference -- but we've got both! When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
el: Ο στόχος αυτού το άρθρου είναι να σας δώσει μερικά τεχνικά στοιχεία (γνώσεις, αν θέλετε) προκειμένου να καταλάβετε πως λειτουργεί το Django. Δεν αποτελεί, ωστόσο, κάποιον οδηγό ή αναφορά για να ανατρέξετε (παρόλο που τα έχουμε και τα δύο)! Όταν είστε έτοιμοι για να ξεκινήσετε κάποιο project, μπορείτε να :doc:`ξεκινήσετε με τον οδηγό (tutorial) </intro/tutorial01>` ή να ανατρέξετε σε πιο λεπτομερείς κείμενα :doc:`όπως το εγχειρίδιο (documentation) του Django</topics/index>`.
it: Il fine di questo documento è fornirti abbastanza specifiche tecniche da comprendere come funziona Django ma non vuole essere un tutorial o un manuale -- ma abbiamo entrambi! Quando sei pronto ad iniziare un progetto, puoi :doc:`iniziare con il tutorial </intro/tutorial01>` o :doc:`esplorare la documentazione più dettagliata </topics/index>`.
ja: このドキュメントの目的は、 Django の技術的な仕様について述べ、どのように動 作するかを理解してもらうことにあり、チュートリアルやリファレンス用ではあり ません。 (とはいえ、チュートリアルもリファレンスも別に用意していますよ！) プロジェクトを作成する準備ができたら、 :doc:`チュートリアルを始めれます </intro/tutorial01>` 。もしくは :doc:`より詳細なドキュメントを読む </topics/index>` こともできます。
pl: Celem tego dokumentu jest prezentacja takiej ilości technicznej specyfiki, abyś zrozumiał jak Django działa, ale nie jest on przeznaczony do bycia tutorialem lub dokumentacją – mamy ich oboje! Kiedy będziesz gotowy, aby zacząć projekt, możesz :doc:`rozpocząć tutorial </intro/tutorial01>` lub :doc:`zanurzyć się w bardziej szczegółowej dokumentacji </topics/index>`.
zh_hans: 为了让您充分理解 Django 的工作原理，这份文档为您详细描述了相关的技术细节，不过这并不是一份入门教程或者是参考文档（我们当然也为您准备了这些）。如果您想要马上开始一个项目，可以从 :doc:`实例教程 </intro/tutorial01>` 开始入手，或者直接开始阅读详细的 :doc:`参考文档 </topics/index>` 。

source: Design your model
el: Σχεδιάστε το μοντέλο σας
it: Progetta il tuo modello
ja: モデルの設計
pl: Zaprojektuj swój model
zh_hans: 设计模型

source: Although you can use Django without a database, it comes with an `object-relational mapper`_ in which you describe your database layout in Python code.
el: Το Django μπορείτε να το χρησιμοποιήσετε χωρίς τη χρήση κάποιας βάσης δεδομένων (στατικές σελίδες). Από την άλλη, για τη δημιουργία δυναμικών σελίδων, το Django σας δίνει τη δυνατότητα να σχεδιάσετε τη διάταξη της βάσης δεδομένων (database layout) σε κώδικα γραμμένο αποκλειστικά σε Python, με τη χρήση του `object-relational mapper`_ το οποίο είναι προεγκατεστημένο.
it: Seppure puoi usare Django senza un database, esso viene fornito di un 'object-relational mapper'_ nel quale descrivi lo schema del tuo database in codice Python.
ja: データベースなしで Django を使うこともできますが、 Django には Python コードでデータベースのレイアウトを記述した `オブジェクトリレーショナルマッパー`_ (object-relational mapper) が付属しています。
pl: Pomimo że możesz używać Django bez bazy danych, ma on wbudowany `mapper obiektowo-relacyjny`_, za pomocą którego możesz opisać układ swojej bazy danych pythonowym kodem.
zh_hans: Django 无需数据库就可以使用，它提供了 `对象关系映射器`_ 通过此技术，你可以使用 Python 代码来描述数据库结构。

source: The :doc:`data-model syntax </topics/db/models>` offers many rich ways of representing your models -- so far, it's been solving many years' worth of database-schema problems. Here's a quick example:
el: Το άρθρο :doc:`σχεδίαση μοντέλων </topics/db/models>` προσφέρει πολλούς τρόπους σχεδίασης και αναπαράστασης των μοντέλων σας – μέχρι τώρα, έχει λύσει πολλών χρόνων προβλήματα που έχουν να κάνουν με τη σχεδίαση του schema της βάσης δεδομένων. Να ένα γρήγορο παράδειγμα:
it: La :doc:`sintassi data-model </topics/db/models>` offre molti ricchi modi di rappresentare i tuoi modelli -- finora, ha risolto molti anni di problemi legati agli schemi dei database. Ecco un rapido esempio:
ja: :doc:`データモデル構文 </topics/db/models>` ではモデルを表現するさまざまな方法が提供されています。これまでのところ、長年におけるデータベーススキーマの問題を解決してきた実績があります。 簡単な例を示しましょう:
pl: :doc:`Składnia modeli danych </topics/db/models>` oferuje wiele bogatych sposobów przedstawiania modeli – do tej pory było to rozwiązywanie trwających wiele lat problemów schematu bazy danych. Oto krótki przykład:
zh_hans: 你可以使用强大的 :doc:`数据-模型语句</topics/db/models>` 来描述你的数据模型，这解决了数年以来在数据库模式中的难题。以下是一个简明的例子：

source: Install it
el: Εγκαταστήστε το
it: Installalo
ja: モデルのインストール
pl: Zainstaluj
zh_hans: 应用数据模型

source: Next, run the Django command-line utility to create the database tables automatically:
el: Επόμενο βήμα είναι να τρέξετε την κατάλληλη εντολή του Django (μέσα από την κονσόλα) ούτως ώστε να δημιουργηθούν αυτόματα οι πίνακες στη βάση δεδομένων:
ja: 次に、データベーステーブルを自動でつくる Django のコマンドラインユーティリティを実行します:
pl: Następnie uruchom narzędzie linii poleceń Django, aby automatycznie stworzyć tabele w bazie danych:
zh_hans: 然后，运行 Django 命令行工具来创建数据库表：

source: The :djadmin:`migrate` command looks at all your available models and creates tables in your database for whichever tables don't already exist, as well as optionally providing :doc:`much richer schema control </topics/migrations>`.
el: Η εντολή :djadmin:`migrate` κοιτάζει όλα τα μοντέλα σας και δημιουργεί (αν δεν υπάρχουν) πίνακες στη βάση δεδομένων (database tables). Επίσης, προαιρετικά, παρέχει :doc:`έναν πλούσιο μηχανισμό ελέγχου του schema της βάσης δεδομένων </topics/migrations>`.
ja: :djadmin:`migrate` コマンドは利用できるモデルを探し出し、テーブルが既に存在していない場合にはデータベースにテーブルを作成し、必要に応じて :doc:`より強力なスキーマの制御 </topics/migrations>` を提供します。
pl: Komenda :djadmin:`migrate` spogląda na wszystkie dostępne modele i tworzy tabele w bazie danych, jeśli jeszcze nie istnieją, oraz opcjonalnie daje `wiele bogatszą kontrolę nad schematem </topics/migrations>`.
zh_hans: 这个 :djadmin:`migrate` 命令查找你所有可用的模型并将在数据库中创建那些不存在的表，还可提供了可选的 :doc:`丰富 schema 控制</topics/migrations>`。

source: Enjoy the free API
el: Απολαύστε το δωρεάν API
it: Prova le API disponibili
ja: 自動生成される API で楽しむ
pl: Ciesz się wolnym API
zh_hans: 享用便捷的 API

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary:
el: Με αυτά, έχετε ένα δωρεάν και πλούσιο :doc:`Python API </topics/db/queries>` για να αποκτήσετε πρόσβαση στα δεδομένα σας (που βρίσκονται μέσα στους πίνακες). Το API δημιουργείται “επί ποδός” (on the fly), δεν απαιτείται κώδικας για να το δημιουργήσει:
ja: これだけで、制約のない充実した :doc:`Python API </topics/db/queries>` を使っ て自分のデータにアクセスできます。API はオンザフライで生成され、コードを作 成する必要はありません:
pl: Przez wolne i bogate :doc:`pythonowe API </topics/db/queries>` masz dostęp do swoich danych. API jest tworzone w locie, nie wymaga generowania kodu:
zh_hans: 接下来，你就可以使用一套便捷而丰富的 :doc:`Python API </topics/db/queries>` 访问你的数据。这些 API 是即时创建的，而不用显式的生成代码：

source: A dynamic admin interface: it's not just scaffolding -- it's the whole house
el: Ένα δυναμικό διαχειριστικό περιβάλλον: δεν είναι απλά οικοδομή – είναι ολόκληρο το σπίτι
it: Un'interfaccia di amministrazione dinamica: non è solo impalcatura -- è tutta la casa
ja: 作業場 (scaffold) ではなく完成品 (whole house) の、動的な admin インタフェース
pl: Dynamiczny interfejs administracyjny: to nie tylko rusztowanie – to cały dom
zh_hans: 一个动态管理接口：并非徒有其表

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a website that lets authenticated users add, change and delete objects. It's as easy as registering your model in the admin site:
el: Αφού ορίσετε τα μοντέλα σας, το Django μπορεί αυτόματα να δημιουργήσει για εσάς ένα επαγγελματικό, έτοιμο προς παραγωγή (production ready) :doc:`διαχειριστικό περιβάλλον </ref/contrib/admin/index>` -- ένα website που επιτρέπει σε εξουσιοδοτημένους χρήστες να προσθέσουν, αλλάξουν και διαγράψουν objects. Είναι τόσο εύκολο όσο να καταχωρήσετε (register) τα μοντέλα σας στο admin site:
ja: モデルを定義したら、 Django は玄人向きの実運用に耐える :doc:`管理インタフェー ス </ref/contrib/admin/index>` を自動的に生成します。 このインタフェースは、認証をパスしたユーザがオブジェクトを追加、変更、削除できる Web サイトです。管理インタフェースの作成は簡単で、モデルクラスを admin サイトに追加するだけです:
pl: Gdy twoje modele są już zdefiniowane, Django może automatycznie stworzyć profesjonalny, gotowy na produkcję :doc:`interfejs administracyjny </ref/contrib/admin/index>` – witrynę, która pozwala uwierzytelnionym użytkownikom dodawać, zmieniać i usuwać obiekty. Wystarczy tylko zarejestrować model w witrynie administracyjnej:
zh_hans: 当你的模型完成定义，Django 就会自动生成一个专业的生产级 :doc:`管理接口</ref/contrib/admin/index>` ——一个允许认证用户添加、更改和删除对象的 Web 站点。你只需简单的在 admin 站点上注册你的模型即可：

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces just to manage content.
el: Η φιλοσοφία πίσω από το Django admin interface είναι ότι το site σας θα επεξεργάζεται από κάποιο προσωπικό ή πελάτη ή απλά από εσάς τον ίδιο -- και εσείς δεν θέλετε να ασχολείστε με τη δημιουργία backend interfaces μόνο και μόνο για να διαχειρίζεστε το περιεχόμενο.
ja: サイトの編集はスタッフ、顧客、もしくはあなた自身の手で行われるものであり、 コンテンツの管理だけのためにバックエンドインタフェースを作りたくはない、という思想がここにはあります。
pl: Filozofia tutaj jest następująca: twoja strona jest edytowana przez obsługę, klienta lub może po prostu ciebie – i nie chcesz musieć tworzyć backendowych interfejsów tylko do zarządzania treścią.
zh_hans: 这样设计所遵循的理念是，站点编辑人员可以是你的员工、你的客户、或者就是你自己——而你大概不会乐意去废半天劲创建一个只有内容管理功能的后台管理界面。

source: One typical workflow in creating Django apps is to create models and get the admin sites up and running as fast as possible, so your staff (or clients) can start populating data. Then, develop the way data is presented to the public.
el: Ένας τυπικός μπούσουλας στη σχεδίαση Django apps είναι να δημιουργείτε μοντέλα και αμέσως μετά να τα καταχωρείτε (register) με το admin site ούτως ώστε να μπορείτε να τα διαχειρίζεστε όσο γίνεται πιο γρήγορα. Έτσι, το προσωπικό σας (ή οι πελάτες σας) θα μπορούν να καταχωρούν δεδομένα (περιεχόμενο) και να αναπτύξουν το τρόπο με το οποίο θα τα παρουσιάσουν στο ευρύ κοινό.
it: Un classico modus operandi nella creazione delle app Django è creare i modelli e avere il pannello di amministratore online il prima possibile, in modo che lo staff o i clienti possano iniziare a inserire i dati. Dopo di che è possibile iniziare a sviluppare come presentare quei dati agli utenti.
ja: 作者たちが Django アプリケーションを作成するときの典型的なワークフローは、 モデルを作成し、 admin サイトを組み上げてできるだけ早期に立ち上げ、スタッフ (や顧客) がデータを投入できるようにしておいてから、データを公開するための方法を開発してゆくというものです。
pl: Jednym z typowych workflow w tworzeniu aplikacji Django jest stworzenie modelu i uruchomienie administracji tak szybko jak to możliwe, aby obsługa (lub klienci) mogli zacząć uzupełniać dane. Następnie, skupienie się na sposobie prezentacji tych danych odbiorcom.
zh_hans: 创建 Django 应用的典型流程是，先建立数据模型，然后搭建管理站点，之后你的员工（或者客户）就可以向网站里填充数据了。后面我们会谈到如何展示这些数据。

source: Design your URLs
el: Σχεδίαση των URLs
it: Progetta le tue URL
ja: URL を設計する
pl: Zaprojektuj swoje URL-e
zh_hans: 规划 URLs

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn't put any cruft in URLs, like ``.php`` or ``.asp``.
el: Μια καθαρή και κομψή σχεδίαση του URL αποτελεί σημαντική λεπτομέρεια για μια υψηλών προδιαγραφών Web εφαρμογή. Το Django ενθαρρύνει τον όμορφο URL σχεδιασμό και δεν εισάγει άσχημες καταλήξεις στα URLs, όπως ``.php`` ή ``.asp``.
it: Uno schema di URL chiaro ed elegante è un importane dettaglio in applicazione Web di alta qualità. Django incoraggia a ben strutturare le URL e non inserire elementi superflui come ``.php`` o `.asp``.
ja: すっきりとして洗練された URL スキームは、高品質な Web アプリケーションを実 現する上で重要な要素です。 Django は美しい URL の設計を助け、 ``.php`` や ``.asp`` のようなお粗末なゴミを URL に入れさせません。
pl: Prosty, elegancki schemat URL-i jest ważnym detalem w wysokiej jakości aplikacji webowej. Django wspiera piękne projekty URL i nie dodaje żadnych wstawek do URL-i, typu ``.php`` lub ``.asp``.
zh_hans: 简洁优雅的 URL 规划对于一个高质量 Web 应用来说至关重要。Django 推崇优美的 URL 设计，所以不要把诸如 ``.php`` 和 ``.asp`` 之类的冗余的后缀放到 URL 里。

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`. A table of contents for your app, it contains a simple mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
el: Για να σχεδιάσετε URLs για ένα app, θα πρέπει να δημιουργήσετε ένα Python module το οποίο θα λέγεται :doc:`URLconf </topics/http/urls>`. Θα αναπαριστά ένα πίνακα περιεχομένων του app σας. Θα περιέχει μια απλή αντιστοίχιση μεταξύ URL πατρόν (patterns) και Python callback συναρτήσεων. Τα URLconfs χρησιμεύουν, επίσης, στο να αποσυνδέσουν τα URLs (ολόκληρα τα paths, π.χ /example/info/contact) από τον Python κώδικα.
ja: 特定のアプリケーション用の URL を設計するには、 `URLconf </topics/http/urls>` と呼ばれる Python モジュールを一つ作成します。 URLconf はいわばアプリケーションの目次にあたり、 URL のパターンを Python のコールバック関数に対応づけています。 URLconf はまた、 URL と Python コードを脱カップ リングする働きも持っています。
pl: Aby zaprojektować URL-e dla aplikacji, tworzysz moduł Pythona zwany :doc:`URLconf </topics/http/urls>`. Spis treści dla twojej aplikacji, zawiera proste mapowanie pomiędzy wzorcami URL i pythonowymi funkcjami callback. Pliki URLconf służą również do oddzielania URL-i z kodu Python.
zh_hans: 为了设计你自己的 :doc:`URLconf </topics/http/urls>` ，你需要创建一个叫做 URLconf 的 Python 模块。这是网站的目录，它包含了一张 URL 和 Python 回调函数之间的映射表。URLconf 也有利于将 Python 代码与 URL 进行解耦（译注：使各个模块分离，独立）。

source: Here's what a URLconf might look like for the ``Reporter``/``Article`` example above:
el: Ένα URLconf module θα έδειχνε κάπως έτσι, αναφορικά με το παράδειγμα ``Reporter``/``Article`` πιο πάνω:
it: Ecco come dovrebbe essere un URLconf per l'esempio precedente ``Reporter``/``Article``:
ja: ``Reporter``/``Article`` の例では、 URLconf は以下のようになります:
pl: Tak mógłby wyglądać URLconf dla powyższego przykładu ``Reporter``/``Article``:
zh_hans: 下面这个 URLconf 适用于前面 ``Reporter``/``Article`` 的例子：

source: The code above maps URLs, as simple `regular expressions`_, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
ja: 上のコードはシンプルな `正規表現`_ と Python のコールバック関数("ビュー")をマッピングしています。正規表現は、 URL から値を取得するために括弧を用います。ユーザがページを要求すると、 Django はそれぞれのパターンを順番にチェックし、要求された URL に最初に一致したパターンで停止します。(もしそれらのどれとも一致しなかった時、 Django は特殊ケースである404ビューを呼び出します。)正規表現はロード時にコンパイルされるため、これらは非常に高速に動作します。

source: Once one of the regexes matches, Django imports and calls the given view, which is a simple Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the regex.
ja: 一度正規表現が一致すると、 Django は Python の関数であるビュー (view) をインポートし呼び出します。各ビューは、リクエストのメタデータを含むリクエストオブジェクトと、正規表現でキャプチャされた値を受け取ります。
pl: Gdy któreś z wyrażeń regularnych pasuje, Django importuje i wywołuje podany widok, który jest prostą pythonową funkcją. Każdy widok dostaje w parametrze obiekt „request” – który zawiera metadane żądania – i wartości zebrane w wyrażeniu regularnym.

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, '2005', '05', '39323')``.
ja: 例えば、ユーザが "/articles/2005/05/39323/" という URL をリクエストすると、 Django は ``news.views.article_detail(request, '2005', '05', '39323')`` のような関数呼び出しを行います。
pl: Na przykład, jeśli użytkownik zażądałby URL-a „/articles/2005/05/39323/”, Django wywołałoby funkcję ``news.views.article_detail(request, '2005', '05', '39323')``.

source: Write your views
el: Γράψτε τα views σας
it: Scrivi le tue viste
ja: ビューの自作
pl: Napisz swoje widoki
zh_hans: 编写视图

source: Each view is responsible for doing one of two things: Returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :class:`~django.http.Http404`. The rest is up to you.
el: Κάθε view είναι υπεύθυνο να κάνει ένα από δύο πράγματα: Θα επιστρέφει ένα :class:`~django.http.HttpResponse` object το οποίο θα περιέχει τα δεδομένα της ζητούμενης σελίδας ή θα κάνει raise κάποιο exception όπως το :class:`~django.http.Http404`. Τα υπόλοιπα άπτονται σε εσάς.
it: Ogni view è responsabile nel fare una di queste due cose: Ritornare un'istanza della classe :class:`~django.http.HttpResponse` che contiene il contenuto della pagina richiesta, o lancia un'eccezione come :class:`~django.http.Http404`. Il resto dipende da te.
ja: 各ビュー (view) には二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :class:`~django.http.Http404` のような例外の送出です。それ以外の処理はユーザ次第です。
pl: Każdy widok jest odpowiedzialny za zrobienie jednej z dwóch rzeczy: Zwrócenie obiektu :class:`~django.http.HttpResponse` zawierającego treść dla żądanej strony lub rzucenie wyjątku takiego jak :class:`~django.http.Http404`. Reszta zależy od ciebie.
zh_hans: 视图函数的执行结果只可能有两种：返回一个包含请求页面元素的 :class:`~django.http.HttpResponse` 对象，或者是抛出 :class:`~django.http.Http404` 这类异常。至于执行过程中的其它的动作则由你决定。

source: Generally, a view retrieves data according to the parameters, loads a template and renders the template with the retrieved data. Here's an example view for ``year_archive`` from above:
el: Γενικά, ένα view ανακτά τα δεδομένα ανάλογα τις παραμέτρους, φορτώνει το template και κάνει render το template με τα δεδομένα που ανέκτησε. Αναφερόμενοι στο παραπάνω παράδειγμα και πιο συγκεκριμένα στο πρώτο URL regex, θα υλοποιήσουμε το ``year_archive`` view:
it: Genericamente, una view riceve dati in base ai parametri passati, carica e renderizza il template con i dati ricevuti. Ecco una view di esempio per ``year_archive`` sopra citata:
ja: 一般的に、ビューはパラメーターに従ってデータベースからデータを取り出し、テンプレートをロードして、取り出したデータでテンプレートをレンダリングします。 上の ``year_archive`` のビューを例に示しましょう:
pl: W ogólności, widok pobiera dane stosowne do parametrów, ładuje szablon i renderuje go z pobranymi danymi. Tutaj jest przykładowy widok dla ``year_archive`` z powyżej:
zh_hans: 通常来说，一个视图的工作就是：从参数获取数据，装载一个模板，然后将根据获取的数据对模板进行渲染。下面是一个 ``year_archive`` 的视图样例：

source: This example uses Django's :doc:`template system </topics/templates>`, which has several powerful features but strives to stay simple enough for non-programmers to use.
el: Αυτό το παράδειγμα χρησιμοποιεί το :doc:`template system </topics/templates>` του Django, το οποίο παρέχει πολλά ισχυρά χαρακτηριστικά και παράλληλα προσπαθεί να παραμείνει απλό στη χρήση του για αυτούς που δεν είναι προγραμματιστές.
it: Questo esempio usa Django's :doc:`template system </topics/templates>`, il quale ha una serie di potenti caratteristiche, ma prova a rimanere abbastanza semplice per un uso per i non-programmatori.
ja: この例では Django の :doc:`テンプレートシステム </topics/templates>` を使っ ています。テンプレートシステムは、強力な機能をいくつも備えながらも、非プロ グラマが使いこなせる程度に簡単な仕組みです。
pl: Ten przykład wykorzystuje :doc:`system szablonów </topics/templates>` Django, który ma kilka potężnych funkcji, ale stara się pozostać wystarczająco prosty w użyciu dla nie-programistów.
zh_hans: 这个例子使用了 Django :doc:`模板系统 </topics/templates>` ，它有着很多强大的功能，而且使用起来足够简单，即使不是程序员也可轻松使用。

source: Design your templates
el: Σχεδιάστε τα templates σας
it: Progetta i tuoi template
ja: テンプレートを設計する
pl: Zaprojektuj swoje szablony
zh_hans: 设计模板

source: The code above loads the ``news/year_archive.html`` template.
el: Ο κώδικας παραπάνω φορτώνει το template με το όνομα ``news/year_archive.html``.
it: Il codice precedente carica il template ``news/year_archive.html``.
ja: 上のコードでは ``news/article_detail.html`` という名前のテンプレートをロー ドしています。
pl: Kod powyżej ładuje szablon ``news/year_archive.html``.
zh_hans: 上面的代码加载了 ``news/year_archive.html`` 模板。
