Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: The foreign key relationship is made explicit by a ``FOREIGN KEY`` constraint. Don't worry about the ``DEFERRABLE`` parts; that's just telling PostgreSQL to not enforce the foreign key until the end of the transaction.
el: Η συσχέτιση του foreign key γίνεται κατηγορηματικά με τον ``FOREIGN KEY`` περιορισμό (constraint). Μην ανησυχείτε για τα πεδία ``DEFERRABLE``. Αυτά λένε στην PostgreSQL να μην επιβάλλουν το foreign key μέχρις ότου ολοκληρωθεί η συναλλαγή (transaction).
ja: 外部キーリレーションシップは``FOREIGN KEY`` 制約で明確化されます。``DEFERRABLE``の部分については心配しないでください; これはただPostgreSQLに外部キーをトランザクション終了まで強制しないよう伝えているだけです。
pl: Relacja klucza obcego jest wyraźna przez constraint ``FOREIGN KEY``. Nie przejmuj się częścią ``DEFERRABLE``; to tylko mówi PostgreSQLowi, aby nie egzekwował więzu klucza obcego aż do końca transakcji.
zh_hans: 外键关系由 ``FOREIGN KEY`` 生成。你不用关心 ``DEFERRABLE`` 部分，它只是告诉 PostgreSQL，请在事务全都执行完之后再创建外键关系。

source: It's tailored to the database you're using, so database-specific field types such as ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), or ``integer primary key autoincrement`` (SQLite) are handled for you automatically. Same goes for the quoting of field names -- e.g., using double quotes or single quotes.
el: Η εντολή αυτή (:djadmin:`sqlmigrate`) είναι βασισμένη στην βάση δεδομένων που χρησιμοποιείτε. Επομένως, συγκεκριμένα database πεδία όπως ``auto_increment`` (MySQL), ``serial`` (PostgreSQL) ή ``integer primary key autoincrement`` (SQLite) διαχειρίζονται από το Django για σας, αυτόματα. Το ίδιο ισχύει και για το quoting των field names – π.χ, αν χρησιμοποιείτε διπλά quotes (``””``) ή μονά (``’’``).
it: È adattato al database che stai utilizzando, quindi vengono gestiti per te automaticamente i tipi di campo specifici del database come ``auto_increment`` (MySQL), ``serial`` (PostgreSQL), o ``integer primary key autoincrement`` (SQLite). Lo stesso vale per la citazione dei nomi dei campi -- es: utilizzando virgolette doppie o virgolette singole.
ja: これはあなたが使用しているデータベースに合わせて、``auto_increment`` (MySQL)、 ``serial`` (PostgreSQL) もしくは `integer primary key autoincrement`` (SQLite) のようなデータベースに特化した型が自動的に選択され生成されます。フィールド名のクォーティングをダブルクォートにするか、シングルクォートにするかも同じように扱われます。
pl: Jest to dostosowane do bazy danych, której używasz, więc pola typowe dla bazy danych, takie jak ``auto_increment`` (MySQL), ``serial`` (PostgreSQL) lub ``integer primary key autoincrement`` (SQLite) są obsługiwane dla ciebie automatycznie. To samo tyczy się wstawiania nazw pól w cudzysłowy – na przykład używania pojedynczego lub podwójnego cudzysłowu.
zh_hans: 生成的 SQL 语句是为你所用的数据库定制的，所以那些和数据库有关的字段类型，比如 ``auto_increment`` (MySQL)、 ``serial`` (PostgreSQL)和 ``integer primary key autoincrement`` (SQLite)，Django 会帮你自动处理。那些和引号相关的事情 - 例如，是使用单引号还是双引号 - 也一样会被自动处理。

source: The :djadmin:`sqlmigrate` command doesn't actually run the migration on your database - it just prints it to the screen so that you can see what SQL Django thinks is required. It's useful for checking what Django is going to do or if you have database administrators who require SQL scripts for changes.
el: Η εντολή :djadmin:`sqlmigrate` δεν εκτελεί την SQL εντολή (δεν εκτελεί το migration, αν θέλετε) στην βάση δεδομένων σας – απλά το εκτυπώνει στην κονσόλα για να πάρετε μια γεύση του παραγόμενου κώδικα (από το Django). Είναι χρήσιμο όταν θέλετε να δείτε τι επρόκειτο να εκτελέσει το Django ή αν έχετε διαχειριστές βάσεων δεδομένων οι οποίοι χρειάζονται αυτά τα SQL scripts για τυχόν αλλαγές (προτού τις εκτελέσετε εσείς).
ja: :djadmin:`sqlmigrate` コマンドは実際にはデータベースにマイグレーションを実行しません。ただ、Djangoが必要としているSQLが何であるかをスクリーンに表示するだけです。これはDjangoが何をしようとしているかを確認したり、データベース管理者に変更のためのSQLスクリプトを要求されているときに役に立ちます。
pl: Komenda :djadmin:`sqlmigrate` nie uruchomi migracji na twojej bazie danych – po prostu drukuje ją na ekran, abyś zobaczył, jaki kod SQL jest według Django wymagany. Jest to przydatne do sprawdzenia co zamierza zrobić Django lub jeśli masz administratorów bazy danych, którzy oczekują skryptów SQL na potrzeby zmian.
zh_hans: 这个 :djadmin:`sqlmigrate` 命令并没有真正在你的数据库中的执行迁移 - 它只是把命令输出到屏幕上，让你看看 Django 认为需要执行哪些 SQL 语句。这在你想看看 Django 到底准备做什么，或者当你是数据库管理员，需要写脚本来批量处理数据库时会很有用。

source: If you're interested, you can also run :djadmin:`python manage.py check <check>`; this checks for any problems in your project without making migrations or touching the database.
el: Αν ενδιαφέρεστε μπορείτε να τρέξετε την εντολή :djadmin:`python manage.py check <check>`. Η εντολή αυτή ελέγχει όλο το project σας για τυχόν λάθη (συντακτικά, λογικά κλπ) δίχως να δημιουργεί migrations ή να αλληλεπιδρά με την database σας.
it: Se sei interessato, puoi anche eseguire :djadmin:`python manage.py check <check>`; che verifica eventuali problemi nel progetto senza effettuare migrazioni o toccare il database.
ja: もし興味があれば :djadmin:`python manage.py check <check>` を実行することもできます; これはマイグレーションを作成したりデータベースにふれることなくプロジェクトになんの問題がないか確認します 。
pl: Jeśli jesteś zainteresowany, możesz też uruchomić :djadmin:`python manage.py check <check>`; sprawdzi to jakiekolwiek problemy w twoim projekcie bez robienia migracji lub dotykania bazy danych.
zh_hans: 如果你感兴趣，你也可以试试运行 :djadmin:`python manage.py check <check>` ;这个命令帮助你检查项目中的问题，并且在检查过程中不会对数据库进行任何操作。

source: Now, run :djadmin:`migrate` again to create those model tables in your database:
el: Τώρα μπορείτε να τρέξετε την εντολή :djadmin:`migrate` για να δημιουργήσετε τους πίνακες και τις συσχετίσεις μεταξύ τους στην βάση δεδομένων σας:
it: Ora, esegui: djadmin: `migrate` di nuovo per creare quelle tabelle modello nel tuo database:
ja: :djadmin:`migrate` を再度実行し、 モデルのテーブルをデータベースに作成しましょう。
pl: Teraz uruchom ponowinie :djadmin:`migrate`, aby stworzyć te tabele modeli w twojej bazie danych:
zh_hans: 现在，再次运行 :djadmin:`migrate` 命令，在数据库里创建新定义的模型的数据表：

source: The :djadmin:`migrate` command takes all the migrations that haven't been applied (Django tracks which ones are applied using a special table in your database called ``django_migrations``) and runs them against your database - essentially, synchronizing the changes you made to your models with the schema in the database.
el: Η εντολή :djadmin:`migrate` λαμβάνει υπόψη της όλα τα migrations τα οποία δεν έχουν εφαρμοστεί (το Django γνωρίζει ποια migrations έχουν εφαρμοστεί χρησιμοποιώντας έναν ειδικό πίνακα στην βάση δεδομένων υπό το όνομα ``django_migrations``) και τα τρέχει ένα-ένα - στη ουσία, πραγματοποιεί ένα είδους συγχρονισμό μεταξύ των αλλαγών των μοντέλων σας και του schema της βάσης σας.
it: Il comando :djadmin:`migrate` prende tutte le migrazioni che non sono state applicate (Django tiene traccia di quali sono applicate usando una tabella speciale nel tuo database chiamata ``django_migrations``) e le esegue sul tuo database - essenzialmente, sincronizzando le modifiche apportate ai modelli con lo schema nel database.
ja: :djadmin:`migrate` コマンドはすべての適用されていないマイグレーション(Djangoはデータベース内の``django_migrations``と呼ばれる特別なテーブルを利用してどれが適用されているかを追跡しています)を捕捉してデータベースに対してそれを実行します - 重要なのは、モデルに対して行った変更はデータベースのスキーマに同期するということです。
pl: Komenda :djadmin:`migrate` bierze wszystkie migracje, które jeszcze nie zostały zastosowane (Django śledzi, które są już zastosowane używając specjalnej tabeli w twojej bazie danych nazwanej ``django_migrations``) i uruchamia je na twojej bazie danych – to znaczy synchronizuje zmiany, które zrobiłeś w modelach ze schematem danych w bazie danych.
zh_hans: 这个 :djadmin:`migrate` 命令选中所有还没有执行过的迁移（Django 通过在数据库中创建一个特殊的表 ``django_migrations`` 来跟踪执行过哪些迁移）并应用在数据库上 - 也就是将你对模型的更改同步到数据库结构上。

source: Migrations are very powerful and let you change your models over time, as you develop your project, without the need to delete your database or tables and make new ones - it specializes in upgrading your database live, without losing data. We'll cover them in more depth in a later part of the tutorial, but for now, remember the three-step guide to making model changes:
el: Τα migrations είναι εξαιρετικά δυνατό χαρακτηριστικό του Django και σας επιτρέπει να αλλάζετε τα μοντέλα σας (όποτε το κρίνεται απαραίτητο) χωρίς να χρειαστεί να διαγράφετε κάθε φορά τη βάση ή τους πίνακες σας και να τους δημιουργείτε εκ νέου. Ειδικεύεται στο να εκσυγχρονίζει την βάση σας σε πραγματικό χρόνο χωρίς να χάνετε τα ήδη αποθηκευμένα δεδομένα σας. Θα καλύψουμε τα migrations, εκτενώς, σε επόμενο μέρος του οδηγού, αλλά προς το παρόν θυμηθείτε τα τρία βήματα που πρέπει να ακολουθήσετε για να αλλάζετε τα μοντέλα σας:
it: Le migrazioni sono molto potenti e ti consentono di modificare i tuoi modelli nel tempo, mentre sviluppi il tuo progetto, senza la necessità di eliminare il tuo database o tabelle e crearne di nuove - è specializzato nell'aggiornamento del tuo database in tempo reale, senza perdere dati. Li tratteremo in modo più approfondito in una parte successiva del tutorial, ma per ora, ricorda la procedura in tre passaggi per apportare modifiche al modello:
ja: マイグレーションは、データベースやテーブルを削除しまた新しいものを作成する必要なく、プロジェクトを開発するように、いつでもモデルを変更可能とする強力なツールです - データを失うことなしにデータベースをライブでアップグレードするよう特化しています。これらについてチュートリアルの後の部分でより深くカバーします、しかし今は、モデルの変更を実施するための3ステップガイドを覚えておいてください:
pl: Migracje są potężnym narzędziem, pozwalając ci zmieniać twoje modele w czasie, gdy rozwijasz swój projekt, bez konieczności usuwania bazy danych lub tabel i tworzenia nowych – specjalizuje się w upgrade'owaniu twojej bazy danych na żywo, bez tracenia danych. Omówimy je bardziej dogłębnie w późniejszej części tutorialu, lecz teraz zapamiętaj trzy kroki do tworzenia zmian w modelach:
zh_hans: 迁移是非常强大的功能，它能让你在开发过程中持续的改变数据库结构而不需要重新删除和创建表 - 它专注于使数据库平滑升级而不会丢失数据。我们会在后面的教程中更加深入的学习这部分内容，现在，你只需要记住，改变模型需要这三步：

source: Change your models (in ``models.py``).
el: Αλλάξτε τα μοντέλα σας (στο αρχείο ``models.py``).
it: Modifica i tuoi modelli (in ``models.py``).
ja: モデルを変更する (``models.py`` の中の)
pl: Zmień swoje modele (w ``models.py``).
zh_hans: 编辑 ``models.py`` 文件，改变模型。

source: Run :djadmin:`python manage.py makemigrations <makemigrations>` to create migrations for those changes
el: Τρέξτε την εντολή :djadmin:`python manage.py makemigrations <makemigrations>` για να δημιουργηθούν τα migrations για τις αλλαγές που κάνατε.
it: Eseguire: djadmin: `python manage.py makemigrations` per creare le migrazioni per queste modifiche
ja: これらの変更のためのマイグレーションを作成するために :djadmin:`python manage.py makemigrations <makemigrations>` を実行します。
pl: Uruchom :djadmin:`python manage.py makemigrations <makemigrations>`, aby stworzyć migracje dla tych zmian
zh_hans: 运行 :djadmin:`python manage.py makemigrations <makemigrations>` 为模型的改变生成迁移文件。

source: Run :djadmin:`python manage.py migrate <migrate>` to apply those changes to the database.
el: Τρέξτε την εντολή :djadmin:`python manage.py migrate <migrate>` για να εκτελέσετε τις αλλαγές στη βάση δεδομένων.
it: Eseguire: djadmin: `python manage.py migrate <migrate>` per applicare le modifiche al database.
ja: データベースにこれらの変更を適用するために :djadmin:`python manage.py migrate <migrate>` を実行します。
pl: Uruchom :djadmin:`python manage.py migrate <migrate>`, aby zastosować te zmiany na bazie danych.
zh_hans: 运行 :djadmin:`python manage.py migrate <migrate>` 来应用数据库迁移。

source: The reason that there are separate commands to make and apply migrations is because you'll commit migrations to your version control system and ship them with your app; they not only make your development easier, they're also useable by other developers and in production.
ja: マイグレーションの作成と適用のコマンドが分割されている理由は、マイグレーションをバージョン管理システムにコミットし、アプリとともに配布するためです。これによって、あなたの開発が容易になるだけでなく、他の開発者や本番環境にとって使いやすいものになります。
pl: Powodem, dla którego komendy do tworzenia i stosowania migracji są rozdzielne, jest to, że będziesz commitował migracje do swojego systemu kontroli wersji i zawrzesz je w swojej aplikacji; one nie tylko ułatwiają dewelopment, ale też są użyteczne dla innych deweloperów i w produkcji.
zh_hans: 数据库迁移被分解成生成和应用两个命令是为了让你能够在代码控制系统上提交迁移数据并使其能在多个应用里使用；这不仅仅会让开发更加简单，也给别的开发者和生产环境中的使用带来方便。

source: Read the :doc:`django-admin documentation </ref/django-admin>` for full information on what the ``manage.py`` utility can do.
el: Διαβάστε στο άρθρο :doc:`εγχειρίδιο (documentation) του django-admin </ref/django-admin>` για περισσότερες πληροφορίες των δυνατοτήτων της εντολής ``manage.py``. Εναλλακτικά μπορείτε να γράψετε στην κονσόλα την εντολή ``python manage.py`` για να ρίξετε μια γρήγορη ματιά στις διαθέσιμες εντολές.
it: Read the :doc:`documentazione di django-admin </ref/django-admin>` per le informazioni complete su cosa può fare l'utility ``manage.py``.
ja: ``manage.py`` ユーティリティでできることについては :doc:`django-admin のドキュメント </ref/django-admin>` を読んで下さい。
pl: Przeczytaj :doc:`dokumentację django-admin </ref/django-admin>`, aby uzyskać pełną informację, co może robić narzędzie ``manage.py``.
zh_hans: 通过阅读文档 :doc:`Django 后台文档 </ref/django-admin>` ，你可以获得关于 ``manage.py`` 工具的更多信息。

source: Playing with the API
el: Παίζοντας με το API
it: Giocare con le API
ja: API で遊んでみる
pl: Zabawa z API
zh_hans: 初试 API

source: Now, let's hop into the interactive Python shell and play around with the free API Django gives you. To invoke the Python shell, use this command:
el: Ας μεταβούμε τώρα στην interactive Python κονσόλα (shell) και ας παίξουμε λίγο με το δωρεάν API το οποίο μας παρέχει το Django. Για να μεταβούμε στο Python shell, πληκτρολογήστε την εντολή (βεβαιωθείτε ότι βρίσκεστε στο root φάκελο του project σας, εκεί που βρίσκεται το αρχείο ``manage.py``):
it: Ora, andiamo nella shell interattiva di Python e giochiamo con l'API inclusa che Django ti offre. Per richiamare la shell Python, usa questo comando:
ja: さぁ、 Python 対話シェルを起動して、 Django が提供する API で遊んでみましょう。 Python シェルを起動するには、以下のコマンドを実行します:
pl: Teraz wskoczmy do interaktywnego shella Pythona i pobawmy się z otwartym API, które daje Django. Aby wywołać Pythonowego shella, użyj tej komendy:
zh_hans: 现在让我们进入交互式 Python 命令行，尝试一下 Django 为你创建的各种 API。通过以下命令打开 Python 命令行：

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
el: Εκτελούμε δηλαδή με την Python το script ``manage.py`` το οποίο εκτελεί την εντολή ``shell``. Δεν χρησιμοποιούμε σκέτο τη λέξη "python", επειδή το αρχείο :file:`manage.py` θέτει την μεταβλητή περιβάλλοντος (environment variable) ``DJANGO_SETTINGS_MODULE``, η οποία δίνει στο Django το Python import μονοπάτι για το αρχείο :file:`mysite/settings.py`.
ja: 単に “python” を実行しないのは、 Django に :file:`mysite/settings.py` ファイルへの import パスを与える ``DJANGO_SETTINGS_MODULE`` の環境変数を :file:`manage.py` で設定しているからです。
pl: Używamy tego zamiast po prostu napisać „python”, ponieważ :file:`manage.py` ustawia zmienną środowiskową ``DJANGO_SETTINGS_MODULE``, która daje Django pythonową ścieżkę importu do twojego pliku :file:`mysite/settings.py`.
zh_hans: 我们使用这个命令而不是简单的使用 "Python" 是因为 :file:`manage.py` 会设置 ``DJANGO_SETTINGS_MODULE`` 环境变量，这个变量会让 Django 根据 :file:`mysite/settings.py` 文件来设置 Python 包的导入路径。

source: Bypassing manage.py
ja: manage.py を使わずに済ませる方法
pl: Omijanie manage.py

source: If you'd rather not use :file:`manage.py`, no problem. Just set the :envvar:`DJANGO_SETTINGS_MODULE` environment variable to ``mysite.settings``, start a plain Python shell, and set up Django:
ja: :file:`manage.py` を使用しなくても問題ありません。環境変数 :envvar:`DJANGO_SETTINGS_MODULE` を ``mysite.settings`` に設定して、標準のPython shellを起動しDjangoをセットアップします。
pl: Jeśli wolisz nie używać :file:`manage.py`, nie ma problemu. Ustaw po prostu zminną środowiskową :envvar:`DJANGO_SETTINGS_MODULE` na ``mysite.settings``, uruchom zwykłego shella Pythona i ustaw Django:

source: If this raises an :exc:`AttributeError`, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
ja: :exc:`AttributeError` が発生したするのであれば、おそらくこのチュートリアルに合致しないDjangoを使用しているのでしょう。より古いチュートリアルに切り替えるか、Djangoのバージョンを新しくして下さい。
pl: Jeśli spowoduje to :exc:`AttributeError`, prawdopodobnie używasz wersji Django, która nie jest zgodna z wersją tego tutoriala. Powinieneś przełączyć się albo na starszą wersję tutoriala, albo nowszą wersję Django.

source: You must run ``python`` from the same directory :file:`manage.py` is in, or ensure that directory is on the Python path, so that ``import mysite`` works.
ja: ``import mysite`` の動作のために、:file:`manage.py` があるのと同じディレクトリ、もしくはPythonのパスが通っていることを保証されたディレクトリから``python``を実行しなくてはなりません。
pl: Musisz uruchomić ``python`` z tego samego katalogu, w którym jest :file:`manage.py` lub upewnić się, że ten katalog jest na ścieżce Pythona, aby zadziałało ``import mysite``.

source: For more information on all of this, see the :doc:`django-admin documentation </ref/django-admin>`.
ja: 詳しくは :doc:`django-admin.py のドキュメント </ref/django-admin>` を参照してください。
pl: Po więcej informacji o tym wszystkim, zobacz :doc:`dokumentację django-admin </ref/django-admin>`.

source: Once you're in the shell, explore the :doc:`database API </topics/db/queries>`::
el: Όταν είστε μέσα στο shell, μπορείτε να εξερευνήσετε το :doc:`database API </topics/db/queries>`::
it: Una volta che sei nella shell, esplora le :doc:`API del database </topics/db/queries>`::
ja: シェルに入ったら :doc:`データベース API </topics/db/queries>` の世界を探検してみましょう::
pl: Kiedy już jesteś w shellu, zbadaj :doc:`API bazy danych </topics/db/queries>`::
zh_hans: 当你成功进入命令行后，来试试 :doc:`database API </topics/db/queries>` 吧::

source: Wait a minute. ``<Question: Question object>`` is, utterly, an unhelpful representation of this object. Let's fix that by editing the ``Question`` model (in the ``polls/models.py`` file) and adding a :meth:`~django.db.models.Model.__str__` method to both ``Question`` and ``Choice``:
ja: ちょっと待ってください。 ``<Question: Question object>``はこのオブジェクトの表現としてまったく役に立ちません。(``polls/models.py`` ファイルの中にある) ``Question``モデルを編集してこれを修正しましょう。:meth:`~django.db.models.Model.__str__` メソッドを``Question`` と ``Choice`` の両方に追加します:
pl: Poczekaj minutę. ``<Question: Question object>`` jest dość niepomocną reprezentacją tego obiektu. Naprawmy to zmieniając model ``Question`` (w pliku ``polls/models.py``) i dodając metodę :meth:`~django.db.models.Model.__str__` zarówno do ``Question`` jak i ``Choice`.

source: It's important to add :meth:`~django.db.models.Model.__str__` methods to your models, not only for your own convenience when dealing with the interactive prompt, but also because objects' representations are used throughout Django's automatically-generated admin.
el: Είναι σημαντικό να προσθέσετε την μέθοδο :meth:`~django.db.models.Model.__str__` στα μοντέλα σας, όχι μόνο για δική σας διευκόλυνση (προβολή μέσα από την κονσόλα) αλλά και γιατί το διαχειριστικό κομμάτι του Django (admin) χρησιμοποιεί ευρέως την μέθοδο αυτή (όπως θα δείτε αργότερα) για να σας παρουσιάσει τα ονόματα των entries της βάσης σας.
it: E' importante aggiungere il metodo :meth:`~django.db.models.Model.__str__` ai tuoi modelli, non solo per tua convenienza quando hai a che fare con il prompt interattivo ma anche perchè le rappresentazioni degli oggetti sono utilizzate nell'admin auto-generato di Django.
ja: あなた自身のインタラクティブシェルでの表示での利便性のためだけではなく、Djangoの自動生成adminでオブジェクトの表現として使用されるという理由からも :meth:`~django.db.models.Model.__str__` メソッドをモデルに追加することは重要です。
pl: Dodanie metod :meth:`~django.db.models.Model.__str__` do twoich modeli jest ważne, nie tylko dla twojej własnej wygody, gdy używasz interaktywnego prompta, ale także dlatego, że reprezentacje obiektów są używane w automatycznie generowanym panelu administracyjnym Django.
zh_hans: 给模型增加 :meth:`~django.db.models.Model.__str__` 方法是很重要的，这不仅仅能给你在命令行里使用带来方便，Django 自动生成的 admin 里也使用这个方法来表示对象。

source: Note these are normal Python methods. Let's add a custom method, just for demonstration:
el: Σημειώστε ότι όλα αυτά είναι απλές μέθοδοι της Python. Ας προσθέσουμε μια δική μας μέθοδο, για λόγους επίδειξης:
ja: これらは通常の Python メソッドということに注意してください。デモ用にカスタムのメソッドを追加してみましょう:
pl: Zwróć uwagę, że są to normalne metody Pythona. Dodajmy własną metodę, tylko na pokaz:
zh_hans: 注意：这些都是常规的 Python方法。让我们添加一个自定义的方法，这只是为了演示：

source: Note the addition of ``import datetime`` and ``from django.utils import timezone``, to reference Python's standard :mod:`datetime` module and Django's time-zone-related utilities in :mod:`django.utils.timezone`, respectively. If you aren't familiar with time zone handling in Python, you can learn more in the :doc:`time zone support docs </topics/i18n/timezones>`.
el: Σημειώστε την προσθήκη του ``import datetime`` και ``from django.utils import timezone``, ούτως ώστε να αναφερθούμε στο module της Python :mod:`datetime` και στο module του Django :mod:`django.utils.timezone`, αντίστοιχα. Αν δεν είστε εξοικειωμένοι με τον χειρισμό των ζωνών ώρας (time zone) στην Python, μπορείτε να μάθετε περισσότερα στο άρθρο :doc:`time zone support docs </topics/i18n/timezones>`.
it: Nota l'aggiunta di ``import datetime`` e ``from django.utils import timezone`` per fare rispettivamente riferimento al modulo standard :mod:`datetime` ed alle utility di Django relative alle time-zone in :mod:`django.utils.timezone`. Se non hai familiarità con la gestione delle time zone in Python, puoi saperne di più consultando la :doc:`documentazione di supporto per le time zone </topics/i18n/timezones>`.
ja: ``import datetime`` と ``from django.utils import timezone`` で Python の 標準モジュール :mod:`datetime` と Django のタイムゾーン関連ユーティリティの :mod:`django.utils.timezone` を参照していることに注意してください。 Python でのタイムゾーンの取り扱いに不慣れな場合は、 `タイムゾーンサポートドキュメント </topics/i18n/timezones>` を参照してください。
pl: Zwróć uwagę na ``import datetime`` i ``from django.utils import timezone``, odwołujące się kolejno do standardowego modułu Pythona :mod:`datetime` i narzędzi Django związanych ze strefami czasowymi w :mod:`django.utils.timezone`. Jeśli nie jesteś zaznajomiony z obsługą stref czasowych w Pythonie, możesz dowiedzieć się więcej w :doc:`dokumentacji wsparcia stref czasowych </topics/i18n/timezones>`.
zh_hans: 新加入的 ``import datetime`` 和 ``from django.utils import timezone`` 分别导入了 Python 的标准 :mod:`datetime` 模块和 Django 中和时区相关的 :mod:`django.utils.timezone` 工具模块。如果你不太熟悉 Python 中的时区处理，看看 :doc:`时区支持文档 </topics/i18n/timezones>` 吧。

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
el: Αποθηκεύστε τις αλλαγές στα μοντέλα σας (δεν χρειάζεται να τρέξετε τις εντολές ``makemigrations`` ή ``migrate`` γιατί δεν άλλαξε κάτι στα πεδία των μοντέλων σας) και ξεκινήστε εκ νέου ένα Python interactive shell τρέχοντας πάλι την εντολή ``python manage.py shell``::
it: Salva le modifiche ed avvia una nuova shell interattiva di Python, lanciando di nuovo `python manage.py shell``:
ja: 変更を保存して、もう一度 ``python manage.py shell`` を実行して新しい Python 対話シェルを始めましょう::
pl: Zapisz te zmiany i uruchom nowy interaktywny shell Pythona uruchamiając znów ``python manage.py shell``::
zh_hans: 保存文件然后通过 ``python manage.py shell`` 命令再次打开 Python 交互式命令行：
