Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: You can get a local copy of the HTML documentation following a few easy steps:
el: Μπορείτε να έχετε ένα τοπικό αντίγραφο του HTML documentation ακολουθώντας τα παρακάτω βήματα:
ja: 以下の簡単なステップを踏めば、 HTML ドキュメントのローカルコピーを手に入れられます。
pl: Możesz uzyskać lokalną kopię dokumentacji HTML w kilku prostych krokach:
zh_hans: 经过几步简单的操作，你可以获得一份网页文档的备份：

source: Django's documentation uses a system called Sphinx__ to convert from plain text to HTML. You'll need to install Sphinx by either downloading and installing the package from the Sphinx website, or with ``pip``:
el: Το documentation του Django χρησιμοποιεί ένα σύστημα που ονομάζεται Sphinx__ προκειμένου να μετατρέψει το απλό κείμενο σε HTML. Θα χρειαστεί να εγκαταστήσετε το Sphinx είτε κατεβάζοντας το απ’ την επίσημη ιστοσελίδα και έπειτα εγκαθιστώντας το ή χρησιμοποιώντας το ``pip``:
it: La documentazione di Django utilizza un sistema chiamato Sphinx__ per convertire da testo semplice a HTML. Dovrai installare Sphinx scaricando e installando il pacchetto dal sito web di Sphinx o con ``pip``:
ja: Django のドキュメントは、 Sphinx__ というシステムを使ってプレーンテキストから HTML への変換を行っています。 Sphinx のウェブサイトから Sphinx をダウンロードしてインストールするか、次のコマンドで ``pip`` を使ってインストールします。
pl: Dokumentacja Django używa systemu o nazwie Sphinx__ do konwersji z czystego tekstu do HTML. Będziesz musiał zainstalować Sphinksa pobierając lub instalując pakiet ze strony Sphinksa lub przy użyciu ``pip``a:
zh_hans: Django 文档使用了一个叫做 Sphinx__ 的系统将纯文本转换为网页。你可以通过 Sphinx 的官方网站或 ``pip`` 来下载和安装它：

source: Then, just use the included ``Makefile`` to turn the documentation into HTML:
el: Έπειτα, χρησιμοποιήστε το συμπεριλαμβανόμενο αρχείο ``Makefile`` για να μετατρέψετε το documentation σε HTML:
ja: そして、次のコマンドで、Django のドキュメントディレクトリにある ``Makefile`` を使って、ドキュメントを HTML に変換するだけです。
pl: Następnie po prostu użyj dostępnego ``Makefile``a, aby przerobić dokumentację na HTML:
zh_hans: 接着，仅需使用其中的 ``Makefile`` 工具将文档转换为网页：

source: You'll need `GNU Make`__ installed for this.
el: Θα χρειαστεί να έχετε εγκατεστημένο το `GNU Make`__ για να δουλέψει.
it: Avrai bisogno dell'installazione di `GNU Make`__ per questo.
ja: これを実行するには、`GNU Make`__ がインストールされている必要があります。
pl: Będziesz potrzebował do tego zainstalowanego `GNU Make`__.
zh_hans: 你需要为此安装 `GNU Make`__ 工具。

source: If you're on Windows you can alternatively use the included batch file:
el: Αν χρησιμοποιείτε Windows μπορείτε, εναλλακτικά, να χρησιμοποιήσετε το συμπεριλαμβανόμενο batch αρχείο:
it: Se sei in ambiente Windows puoi in alternativa usare il file batch incluso:
ja: もし Windows の場合は、ドキュメントディレクトリにあるバッチファイルを使用して変換できます。
pl: Jeśli używasz Windows, możesz użyć alternatywnie dostępnego pliku batch:
zh_hans: 如果你是 Windows 系统，你应该使用其中的批处理文件：

source: The HTML documentation will be placed in ``docs/_build/html``.
el: Η όλη διαδικασία με το Sphinx θα δουλέψει για εκδόσεις μεγαλύτερες ή ίσης της 0.6, αλλά προτείνουμε να χρησιμοποιήσετε το Sphinx 1.0.2 ή νεώτερο.
it: La documentazione HTML verrà piazzata in ``docs/_build/html``.
ja: HTML ドキュメントが ``docs/_build/html`` に生成されます。
pl: Dokumentacja HTML zostanie umieszczona w ``docs/_build/html``.
zh_hans: 这个 HTML 文档将会被放置在 ``docs/_build/html``。

source: Generation of the Django documentation will work with Sphinx version 0.6 or newer, but we recommend going straight to Sphinx 1.0.2 or newer.
ja: Django ドキュメントの生成は Sphinx バーション0.6以上で行えますが、1.0.2以上を推奨しています。

source: Differences between versions
el: Διαφορές μεταξύ εκδόσεων
it: Differenze tra versioni
ja: バージョンごとの違い
pl: Różnice pomiędzy wersjami
zh_hans: 版本之间的差异

source: As previously mentioned, the text documentation in our Git repository contains the "latest and greatest" changes and additions. These changes often include documentation of new features added in the Django development version -- the Git ("trunk") version of Django. For that reason, it's worth pointing out our policy on keeping straight the documentation for various versions of the framework.
ja: 前述したように、 Git リポジトリに入っているテキストドキュメントは変更や追加によって「最新最良」の状態にあります。変更によって、開発版、すなわち Git (“trunk”) 版の Django に新たに登場した機能がテキストに記載されることがよくあります。このため、Django の各バージョン間で一貫したドキュメンテーションポリシをここで示しておきます。
pl: Jak zostało wcześniej wspomniane, tekstowa dokumentacja w naszym repozytorium Git zawiera „najnowsze i najlepsze” zmiany i dodatki. W tych zmianach zawiera się często dokumentacja nowych funkcjonalności dodanych w wersji deweloperskiej Django – wersji gitowej („trunku”) Django. Z tego powodu warto zwrócić uwagę na naszą politykę prostego utrzymywania dokumentacji dla różnych wersji frameworku.
zh_hans: 如前所述，我们 Git 仓库中的纯文本文档包含“最新最好”的修改和扩展。这些修改通常也包含介绍 Django 开发版中的新特性的文档——Django 的 Git（“trunk”）版本。因此，保存各个版本的文档是值得的。

source: We follow this policy:
el: Ακολουθούμε την παρακάτω πολιτική:
it: Seguiamo questa policy:
ja: 私たちは以下の方針に従います。
pl: Realizujemy tę politykę:
zh_hans: 我们遵循以下原则：

source: The primary documentation on djangoproject.com is an HTML version of the latest docs in Git. These docs always correspond to the latest official Django release, plus whatever features we've added/changed in the framework *since* the latest release.
ja: djangoproject.com の第一のドキュメントは Git の 最新の docs から生成される HTML 形式のドキュメントです。これらのドキュメントは、常に最新の Django 公式リリースと、最新のリリース *以後* に追加／変更された機能に対応しています。
pl: Podstawową dokumentacją na djangoproject.com jest wersja HTML najnowszych docs w Gicie. Ta dokumentacja zawsze odpowiada najnowszemu oficjalnemu wydaniu Django oraz także wszystkim funkcjonalnościom, które dodaliśmy/zmieniliśmy we frameworku *od* ostatniego wydania.
zh_hans: djangoproject.com 上的主要文档是 Git 中最新文档的 HTML 版本。 这些文档总是对应于官方最新的 Django 发布版本，包含所有 *自* 最新发布版起，我们在框架中添加或修改的功能。

source: As we add features to Django's development version, we try to update the documentation in the same Git commit transaction.
ja: Django の開発版に機能を追加する場合、可能ならば、同じ Git のコミットトランザクションにおいて、ドキュメントの変更もコミットします。
pl: Dodając funkcjonalności do wersji deweloperskiej Django, staramy się aktualizować dokumentację w tej samej transakcji „commit w Gicie.
zh_hans: 当我们为 Django 的开发版本添加功能时，我们会在相同的 Git commit 事务中更新文档。

source: To distinguish feature changes/additions in the docs, we use the phrase: "New in version X.Y", being X.Y the next release version (hence, the one being developed).
ja: 追加／変更された機能を区別するため、「バージョン X.Y で新たに追加された機能です (New in version X.Y)」 というフレーズを使います。X.Y は次の (開発中の) リリースバージョンです。
pl: Aby odróżnić zmiany/dodawanie funkcjonalności w dokumentacji, używamy wyrażenia: „New in version X.Y”, gdzie X.Y jest następną wersją wydania (stąd tą, która jest rozwijana).
zh_hans: 为区分文档中功能的修改或添加，我们使用短语：“在版本 X.Y 新增”，X.Y是指下一个发布版本（因此，这个这本正在开发中）。

source: Documentation fixes and improvements may be backported to the last release branch, at the discretion of the committer, however, once a version of Django is :ref:`no longer supported<backwards-compatibility-policy>`, that version of the docs won't get any further updates.
ja: ドキュメントの修正や改善は、コミッターの判断により、最後のリリースブランチにバックポートされることがあります。しかし、あるバージョンが :ref:`サポート終了<backwards-compatibility-policy>` の状態にされた場合、そのバージョンのドキュメントは、それ以上いかなる更新もされません。
pl: Poprawki i ulepszenia dokumentacji mogą zostać zbackportowane do gałęzi ostatniego wydania, według osądu osoby commitującej, jednakże kiedy wersja Django :ref:`przestaje być wspierana<backwards-compatibility-policy>`, ta wersja dokumentacji nie dostanie żadnych dalszych aktualizacji.

source: The `main documentation Web page`_ includes links to documentation for all previous versions. Be sure you are using the version of the docs corresponding to the version of Django you are using!
ja: `Web のドキュメントのメインページ`_ には、以前の全てのバージョンのドキュメントへのリンクがあるので、今使っている Django のバージョンと、今読んでいるドキュメントのバージョンとが、ちゃんと同じものであるか、十分に注意するようにしてください！
pl: Strona `main documentation Web page`_ zawiera linki do dokumentacji we wszystkich poprzednich wersjach. Upewnij się, że używasz wersji dokumentacji odpowiadającej wersji Django, której używasz!
zh_hans: `主要文档页面`_ 包含了指向所有旧版本文档的链接。确保你正在阅读和你使用的 Django 版本匹配的文档！

source: The first step to contributing to Django is to get a copy of the source code. First, `fork Django on GitHub <https://github.com/django/django/fork>`__. Then, from the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
el: Το πρώτο βήμα για την συνεισφορά στο Django είναι να αποκτήσετε ένα αντίγραφο του πηγαίου κώδικα. Πρώτα, κάντε `fork το Django από το GitHub <https://github.com/django/django/fork>`__. Από την γραμμή εντολών, χρησιμοποιείστε την εντολή ``cd`` για να μεταβείτε στον φάκελο στον οποίο θέλετε να αποθηκεύσετε τον πηγαίο κώδικα του Django. Αν δεν υπάρχει κάποιος φάκελος της αρεσκείας σας, τότε χρησιμοποιήστε την εντολή ``mkdir`` για να τον δημιουργήσετε και μετά την εντολή ``cd επιθυμητός_φάκελος`` για να αποθηκεύσετε εκεί τον πηγαίο κώδικα.
it: Il primo passo per contribuire a Django è ottenere una copia del codice sorgente. Prima, fare il fork : `fork Django on GitHub <https://github.com/django/django/fork>`__. Dopo, dalla riga di commando, utilizza il comando "cd" per navigare fino alla directory dove vorrai posizionare la tua copia locale di Django.
pl: Pierwszym krokiem do współtworzenia Django jest uzyskanie kopii kodu źródłowego. Najpierw `rozwidlij Django na GitHubie <https://github.com/django/django/fork>`__. Następnie użyj polecenia ``cd`` w linii poleceń, aby przejść do katalogu, gdzie będziesz chciał trzymać swoją lokalną kopię Django.
zh_hans: 为 Django 做贡献的第一步就是获取源代码副本。首先， `fork Github 上的 Django 项目 <https://github.com/django/django/fork>`。接下来，在命令行中，使用 ``cd`` 命令切换至某个你想存放 Django 源码的目录。

source: If you encounter an error during the installation, your system might be missing a dependency for one or more of the Python packages. Consult the failing package's documentation or search the Web with the error message that you encounter.
el: Αν αντιμετωπίσατε κάποιο πρόβλημα κατά την εγκατάσταση, ίσως να λείπει απ' το σύστημα σας κάποιο dependency (τα dependencies είναι και αυτά με τη σειρά τους πακέτα) για ένα ή περισσότερα Python πακέτα. Συμβουλευτείτε το εγχειρίδιο των πακέτων που δεν εγκαταστάθηκαν ή αναζητήστε στο ίντερνετ το σφάλμα, όπως ακριβώς αυτό εμφανίστηκε όταν προέκυψε.
it: Se ti imbatti in un errore durante l'installazione, al tuo sistema potrebbe mancare una dipendenza per uno o più pacchetti di Python. Consulta la documentazione per i pacchetti mancanti o cerca sul Web il messaggio d'errore che ottieni.
pl: Jeśli napotkasz błąd w trakcie instalacji, może to oznaczać, że w twoim systemie brakuje zależności dla jednego lub więcej pythonowych pakietów. Sprawdź dokumentację pakietów, które zgłaszają błąd lub przeszukaj sieć z komunikatem błędu, który napotkałeś.
zh_hans: 如果安装过程中发生了错误，可能是你的系统缺少一个或多个 Python 依赖包。请参考安装失败的包的文档或者在网上搜索提示的错误信息。

source: Skipped tests are typically due to missing external libraries required to run the test; see :ref:`running-unit-tests-dependencies` for a list of dependencies and be sure to install any for tests related to the changes you are making (we won't need any for this tutorial). Some tests are specific to a particular database backend and will be skipped if not testing with that backend. SQLite is the database backend for the default settings. To run the tests using a different backend, see :ref:`running-unit-tests-settings`.
el: Τα παραλειπόμενα τεστ (τεστ που δεν έγιναν) προκύπτουν συνήθως λόγω έλλειψης κάποιων εξωτερικών βιβλιοθηκών (external libraries) οι οποίες χρειάζονται για να τρέξει το τεστ. Δείτε στο :ref:`Τρέχοντας όλα τα τεστ <running-unit-tests-dependencies>` για μια λίστα με όλα τα dependencies (εξαρτώμενα πακέτα – εξωτερικές βιβλιοθήκες). Επίσης σιγουρευτείτε ότι έχετε εγκαταστήσει τα απαραίτητα πακέτα (στα οποία εξαρτώνται τα τεστ) προτού τρέξετε κάποιο τεστ (δεν θα χρειαστούμε κάποιο από αυτά σε αυτόν τον οδηγό). Μερικά τεστ είναι γραμμένα και συνδέονται με μια συγκεκριμένη βάση δεδομένων και δεν θα τρέξουν αν δεν υπάρχει εγκατεστημένη η αντίστοιχη βάση δεδομένων καθώς και το πακέτο (βιβλιοθήκη) που συνδέει την database με το Django (π.χ για την PostgreSQL το πακέτο είναι το ``psycopg2``). Η SQLite είναι η βάση δεδομένων που χρησιμοποιεί το Django ως προεπιλογή. Μπορείτε επίσης να :ref:`τρέξετε τα τεστ χρησιμοποιώντας μια διαφορετική βάση δεδομένων <running-unit-tests-settings>`.
it: Quando i test vengono saltati, questo accade a causa di librerie mancanti necessarie per eseguire il test; guarda :ref:`running-unit-tests-dependencies` per la lista delle dipendenze e assicurati di installare quelle relative ai test delle modifiche che stai facendo (non ne avremo bisogno in questa guida). Alcuni test sono per specifiche banche dati e verranno saltati se non state utilizzando quelle relative ad essi. SQLite è la banca dati di default. Per eseguire i test usandone una differente, guarda :ref:`running-unit-tests-settings`.
pl: Testy omijane są zazwyczaj z powodu brakujących zewnętrznych bibliotek wymaganaych do uruchomienia testu; zobacz :ref:`running-unit-tests-dependencies`, aby obejrzeć listę zależności i upewnij się, że zainstalowałeś te, które są związane ze zmianami, które wprowadzasz (nie będziemy potrzebować żadnej w tym tutorialu). Niektóre testy są właściwe dla wybranego back-endu bazodanowego i zostaną ominięte, jeśli test nie odbywa się z tym back-endem. Aby uruchomić testy z użyciem innego back-endu, sprawdź :ref:`running-unit-tests-settings`.
zh_hans: 缺失外部依赖库通常会导致测试被跳过；查看 :ref:`running-unit-tests-dependencies` 获取依赖库列表，如果你修改了测试代码，请同时安装相关依赖库（本教程无需额外依赖库）。某些测试使用了特定的数据库后端，如果当前测试设置并未使用此数据库后端，那么这些相关的测试也会被跳过。SQLite 是默认的数据库后端。如果想使用其他后端进行测试，查看 :ref:`running-unit-tests-settings`。

source: Once the tests complete, you should be greeted with a message informing you whether the test suite passed or failed. Since you haven't yet made any changes to Django's code, the entire test suite **should** pass. If you get failures or errors make sure you've followed all of the previous steps properly. See :ref:`running-unit-tests` for more information. If you're using Python 3.5+, there will be a couple failures related to deprecation warnings that you can ignore. These failures have since been fixed in Django.
pl: Kiedy testy się skończą, powinieneś zobaczyć komunikat informujący, czy zestaw testów udał się czy odniósł porażkę. Nie zrobiłeś żadnych zmian w kodzie Django, więc cały zestaw testów **powinien** się udać. Jeśli otrzymujesz porażki lub błędy upewnij się, że poprzednie kroki wykonałeś odpowiednio. Zobacz więcej informacji w :ref:`running-unit-tests`. Jeśli używasz Pythona 3.5+, zobaczysz kilka porażek związanych z ostrzeżeniami o dezaktualizacji, które możesz zignorować. Te błędy zostały już poprawione w Django.
zh_hans: 一旦测试完成，你将被告知测试通过与否。正因你尚未修改 Django 代码，整个测试套件 **应该** 成功通过。如果遇到失败或错误，请确认是否遵照了之前所有的步骤。查看 :ref:`running-unit-tests` 了解更多。如果你使用的是 Python 3.5+，可能会产生一些和 deprecation 警告相关的失败，可忽略。这些失败已在 Django 中得到修复。

source: After reading those, if you want something a little meatier to sink your teeth into, there's always the Python :mod:`unittest` documentation.
el: Αφού διαβάσετε τα ανωτέρω και επιθυμείτε να εμβαθύνετε τις γνώσεις σας περί του θέματος, υπάρχει πάντα το εγχειρίδιο :mod:`unittest` της Python.
it: Dopo aver letto queste cose, se vuoi qualcosa di più succulento per i tuoi denti, c'è sempre la documentazione Python :mod:`unittest`
pl: Po ich przeczytaniu, jeśli chcesz zanurzyć zęby w czymś bardziej mięsistym, jest zawsze dokumentacja :mod:`unittest` Pythona.
zh_hans: 读到这里，你还想深入了解的话，可以查看 Python :mod:`unittest`。

source: Django on Jython
pl: Django na Jythonie

source: The code above maps URLs, as simple :ref:`regular expressions <regex-howto>`, to the location of Python callback functions ("views"). The regular expressions use parenthesis to "capture" values from the URLs. When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the regular expressions are compiled at load time.
pl: Kod powyżej mapuje URL-e, jako proste :ref:`wyrażenia regularne <regex-howto>`, do lokalizacji pythonowych funkcji callback („widoków”). Wyrażenia regularne używają nawiasów, aby „zebrać” wartośc z URL-i. Gdy użytkownik wysyła żądanie strony, Django przelatuje przez wszystkie wzorce, po kolei, i zatrzymuje się na pierwszym, który spełnia żądany URL. (Jeśli żaden z nich nie pasuje, Django wywołuje specjalny widok 404.) Działa to niesamowicie szybko, gdyż wyrażenia regularne są kompilowane w czasie ładowania.

source: This advanced tutorial begins where :doc:`Tutorial 7 </intro/tutorial07>` left off. We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
el: Αυτός ο οδηγός για προχωρημένους ξεκινά μετά το τέλος του :doc:`Οδηγού 7 </intro/tutorial07>`. Θα μετατρέψουμε την εφαρμογή ψηφοφορίας μας (Web-poll) σε ένα ξεχωριστό-ανεξάρτητο Python package το οποίο μπορείτε να επαναχρησιμοποιήσετε σε άλλα projects και να τα μοιραστείτε με άλλους προγραμματιστές.
it: Questo tutorial avanzato inizia dove :doc: Tutorial</intro/tutorial07> era rimasto. Trasformeremo il nostro Web-poll in un pacchetto python indipendente che potrai riutilizzare in nuovi progetti e condividere con altre persone.
pl: Ten tutorial dla zaawansowanych zaczyna się, gdzie :doc:`Tutorial 7 </intro/tutorial07>` się skończył. Będziemy przerabiać naszą web-ankietę na samodzielny pakiet Pythona, który będziesz mógł wykorzystać w nowym projekcie i którym będziesz mógł podzielić się z innymi.
zh_hans: 这篇进阶指南从 :doc:`Tutorial 7 </intro/tutorial07>` 结尾的地方继续讲起。我们将会把我们的 Web-poll 放进一个独立的 Python 包中，以便你在新的项目中重用它或将它与他人分享。

source: If you haven't recently completed Tutorials 1–7, we encourage you to review these so that your example project matches the one described below.
el: Αν δεν έχετε ολοκληρώσει πρόσφατα τον Οδηγό του Django (μέρη 1 εως 7), σας ενθαρρύνουμε να ρίξετε μια ματιά (ή ακόμη και να τον ακολουθήσετε πλήρως) ούτως ώστε το project σας να συμβαδίζει με αυτό που θα ακολουθήσει.
it: Se non hai completato di recente i Tutorial 1–7, ti invitiamo a rivederli in modo che il tuo progetto di esempio corrisponda a quello descritto di seguito.
pl: Jeśli nie ukończyłeś niedawno Tutoriali 1–7, zachęcamy cię do powtórzenia ich, aby twój przykładowy projekt pasował do tego opisanego poniżej.
zh_hans: 如果你尚未完成教程 1-7，我们推荐你先浏览一遍教程，这样你的样例工程会和下面的一致。

source: A Python :term:`package` provides a way of grouping related Python code for easy reuse. A package contains one or more files of Python code (also known as "modules").
el: Ο όρος Python :term:`package` παρέχει έναν τρόπο να ομαδοποιούμε Python κώδικα για εύκολη επαναχρησιμοποίηση. Ένα package περιέχει ένα ή περισσότερα αρχεία από Python κώδικα (επίσης γνωστά και ως "modules").
it: Un :term:`package` di Python fornisce una modo di raggruppare codice Python correlato per un riutilizzo piu semplice. Un package contiene uno o piu file scritti in Python ( conosciuti anche come "modules" ).
pl: Pythonowy :term:`package` jest sposobem na zgrupowanie związanego kodu Pythona na potrzeby łatwego ponownego użycia. Pakiet zawiera jeden lub więcej plików z kodem Pythona (znane także jako „moduły”).
zh_hans: 一个 :term:`package` 提供了一组关联的 Python 代码的简单复用方式。一个包（“模块”）包含了一个或多个 Python 代码文件。

source: Next we'll create a ``setup.py`` file which provides details about how to build and install the app. A full explanation of this file is beyond the scope of this tutorial, but the `setuptools docs <https://setuptools.readthedocs.io/en/latest/>`_ have a good explanation. Create a file ``django-polls/setup.py`` with the following contents:
el: Επόμενο βήμα είναι να δημιουργήσουμε ένα αρχείο ``setup.py`` το οποίο θα παρέχει λεπτομέρειες σχετικά με το πως μπορεί κανείς να χτίσει (build) και να εγκαταστήσει (install) την εφαρμογή. Η πλήρης εξήγηση αυτού του αρχείου είναι πέρα από τους σκοπούς αυτού του οδηγού αλλά το εγχειρίδιο (documentation) του `setuptools <https://setuptools.readthedocs.io/en/latest/>`_ είναι αρκετά περιεκτικό. Δημιουργήστε ένα αρχείο ``django-polls/setup.py`` με το ακόλουθο περιεχόμενο:
pl: Następnie stworzymy plik ``setup.py``, który zawiera szczegóły jak zbudować i zainstalować aplikację. Pełne wytłumaczenie tego pliku nie należy do tego tutorialu, ale `dokumentacja setuptools <https://setuptools.readthedocs.io/en/latest/>`_ ma dobre tłumaczenie. Stwórz plik ``django-polls/setup.py`` z następującą treścią:
zh_hans: 下一步我们将创建 ``setup.py`` 用于说明如何构建和安装应用的细节。关于此文件的完整介绍超出了此教程的范围，但是 `setuptools docs <https://setuptools.readthedocs.io/en/latest/>`_ 有详细的介绍。创建文件 ``django-polls/setup.py`` 包含以下内容：

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. If you're a Python beginner, read :ref:`more about packages <tut-packages>` in the official Python docs.
el: :file:`mysite/__init__.py`: Ένα κενό αρχείο που λέει στην Python ότι αυτός ο φάκελος θα πρέπει να θεωρηθεί ως Python package. Αν είστε καινούργιος στην Python, διαβάστε :ref:`περισσότερα σχετικά με τα packages <tut-packages>` στην επίσημη ιστοσελίδα της Python.
it: :file:`mysite/__init__.py`: Un file vuoto che indica a Python che questa directory dovrebbe essere considerata un pacchetto Python. Se sei un principiante di Python, leggi :ref:`ulteriori informazioni sui pacchetti <tut-packages>` nella documentazione ufficiale di Python.
pl: :file:`mysite/__init__.py`: Pusty plik, który mówi Pythonowi, że ten katalog powinien być uważany za pakiet Pythona. Jeśli jesteś początkujący w Pythonie, przeczytaj :ref:`więcej o pakietach <tut-packages>` w oficjalnej dokumentacji Pythona.
zh_hans: :file:`mysite/__init__.py`：一个空文件，告诉 Python 这个目录应该被认为是一个 Python 包。如果你是 Python 初学者，阅读官方文档中的 :ref:`更多关于包的知识 <tut-packages>`。

source: Your apps can live anywhere on your :ref:`Python path <tut-searchpath>`. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
el: Τα apps σας μπορούν να βρίσκονται οπουδήποτε ορίζει το :ref:`Python path <tut-searchpath>` σας. Σε αυτό τον οδηγό, θα δημιουργήσουμε το app ψηφοφορίας (το φάκελο δηλαδή) στην ίδια θέση που βρίσκεται και το αρχείο :file:`manage.py` προκειμένου να μπορεί να γίνει imported ως ένα δικό του top-level module, παρά ένα submodule του ``mysite``. Θα καταλάβετε τι εννοούμε με αυτό στη συνέχεια.
pl: Twoje aplikacje mogą żyć gdziekolwiek na twojej :ref:`ścieżce Pythona <tut-searchpath>`. W tym tutorialu stworzymy aplikację ankietową tużo obok twojego pliku :file:`manage.py`, aby mogła być zaimportowana jako jego własny moduł najwyższego poziomu, zamiast podmodułu ``mysite``.
zh_hans: 你的应用可以存放在任何 :ref:`Python path <tut-searchpath>` 中定义的路径。在这个教程中，我们将在你的 :file:`manage.py` 同级目录下创建投票应用。这样它就可以作为顶级模块导入，而不是 ``mysite`` 的子模块。

source: The :func:`~django.conf.urls.include` function allows referencing other URLconfs. Note that the regular expressions for the :func:`~django.conf.urls.include` function doesn't have a ``$`` (end-of-string match character) but rather a trailing slash. Whenever Django encounters :func:`~django.conf.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
pl: Funkcja :func:`~django.conf.urls.include` function pozwala na odniesienia do innych URLconfów. Zwróć uwagę, że wyrażenia regularne dla funkcji :func:`~django.conf.urls.include` nie zawierają ``$`` (znaku końca linii) ale ukośnik rozdzielający. Kiedykolwiek Django napotyka :func:`~django.conf.urls.include`, odcina tę część URL-a, która została dopasowana do tego punktu i wysyła pozostłą część ciągu znaków do zaincludowanego URLconfa, do dalszego przetworzenia.
