Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: In previous parts of the tutorial, the templates have been provided with a context that contains the ``question`` and ``latest_question_list`` context variables. For ``DetailView`` the ``question`` variable is provided automatically -- since we're using a Django model (``Question``), Django is able to determine an appropriate name for the context variable. However, for ListView, the automatically generated context variable is ``question_list``. To override this we provide the ``context_object_name`` attribute, specifying that we want to use ``latest_question_list`` instead. As an alternative approach, you could change your templates to match the new default context variables -- but it's a lot easier to just tell Django to use the variable you want.
el: Στα προηγούμενα μέρη του οδηγού, προμηθεύαμε τα templates με τα context variables ``question`` και ``latest_question_list``. Για το ``DetailView`` η μεταβλητή (variable) ``question`` παρέχεται αυτόματα στο template -- έτυχε, γιατί χρησιμοποιούμε ίδιο όνομα για το μοντέλο μας (``Question``) και το Django γνωρίζει πως να καθορίσει ένα κατάλληλο όνομα για το context variable. Ωστόσο, όσον αφορά το ListView, το αυτοματοποιημένο όνομα που παράγεται για το context variable είναι ``question_list``. Για να το παρακάμψουμε αυτό χρησιμοποιούμε το attribute ``context_object_name``, δηλώνοντας έτσι ότι θέλουμε να χρησιμοποιήσουμε το ``latest_question_list`` αντί του άλλου. Μια εναλλακτική προσέγγιση είναι να αλλάξετε τα templates σας και να αντικαταστήσετε τα ``latest_question_list`` με ``question_list`` και να μην θέσετε καθόλου το attribute ``context_object_name`` μέσα στο ListView. Αλλά είναι πιο εύκολο να πείτε στο Django να χρησιμοποιήσει την μεταβλητή που θέλετε παρά να μπείτε στη διαδικασία να αλλάζετε όλα τα templates σας.
ja: このチュートリアルの前の部分では、 ``question`` や ``latest_question_list`` といった変数の入ったコンテキストをテンプレートに渡していました。 ``DetailView`` には、 ``question`` という変数が自動的に渡されます。なぜなら、 Django モデル (``Question``) を使用していて、 Django はコンテキスト変数にふさわしい名前を決めることができるからです。一方で、 ListView では、自動的に生成されるコンテキスト変数は ``question_list`` になります。これを上書きするには、 ``context_object_name`` 属性を与え、 ``latest_question_list`` を代わりに使用すると指定します。この代替アプローチとして、新しいデフォルトのコンテキスト変数を一致するようにテンプレートを変えることもできます。しかし、ただ Django に使用したい変数名を伝えるほうが簡単でしょう。
pl: W poprzednich częściach tutoriala szablonom dawaliśmy kontekst, który zawierał zmienne kontekstu ``question`` i ``latest_question_list``. Dla ``DetailView`` zmienna ``question`` jest dostarczona automatycznie – ponieważ używamy modelu Django (``Question``), Django może wyznaczyć odpowiednią nazwę dla zmiennej kontekstowej. Jednak dla ListView automatycznie generowaną zmienną kontekstową jest ``question_list``. Aby to nadpisać nadajemy wartość atrybutowi ``context_object_name``, wskazując, że chcemy użyć zamiast niej ``latest_question_list``. Alternatywnym podejściem byłoby zmienienie szablonów, aby zgadzały się z nowymi domyślnymi zmiennymi kontekstowymi – ale dużo prościej jest powiedzieć Django, aby używało zmiennej, jakiej chcesz.
zh_hans: 在之前的教程中，提供模板文件时都带有一个包含 ``question`` 和 ``latest_question_list`` 变量的 context。对于 ``DetailView`` ， ``question`` 变量会自动提供—— 因为我们使用 Django 的模型 (Question)， Django 能够为 context 变量决定一个合适的名字。然而对于 ListView， 自动生成的 context 变量是 ``question_list``。为了覆盖这个行为，我们提供 ``context_object_name`` 属性，表示我们想使用 ``latest_question_list``。作为一种替换方案，你可以改变你的模板来匹配新的 context 变量 —— 这是一种更便捷的方法，告诉 Django 使用你想使用的变量名。

source: Run the server, and use your new polling app based on generic views.
el: Τρέξτε τον server και παίξτε με τη νέα σας εφαρμογή που είναι βασισμένη στα generic views.
it: Esegui il server e usa la tua nuova applicazione di sondaggio basata su visualizzazioni generiche.
ja: サーバを実行して、新しく汎用ビューベースにした投票アプリケーションを使ってみましょう。
pl: Uruchom serwer i użyj nowej aplikacji ankietowej opartej na widokach generycznych.
zh_hans: 启动服务器，使用一下基于通用视图的新投票应用。

source: For full details on generic views, see the :doc:`generic views documentation </topics/class-based-views/index>`.
el: Για όλες τις λεπτομέρειες πάνω στα generic views, δείτε το άρθρο :doc:`εγχειρίδιο (documentation) των generic views </topics/class-based-views/index>`.
it: Per i dettagli completi sulle viste generiche, vedere la: doc:`generic views documentation </topics/class-based-views/index>`.
ja: 汎用ビューの詳細は、:doc:`汎用ビューのドキュメント </topics/class-based-views/index>` を参照してください。
pl: Po wszystkie szczegóły widoków generycznych, sprawdź :doc:`dokumentację widoków generycznych </topics/class-based-views/index>`.
zh_hans: 更多关于通用视图的详细信息，请查看 :doc:`通用视图的文档 </topics/class-based-views/index>`

source: When you're comfortable with forms and generic views, read :doc:`part 5 of this tutorial</intro/tutorial05>` to learn about testing our polls app.
el: Όταν είστε εξοικειωμένοι με τις φόρμες και τα generic views διαβάστε το :doc:`πέμπτο μέρος αυτού του οδηγού </intro/tutorial05>` για να μάθετε πως να κάνετε τεστ (test) στην εφαρμογή σας.
it: Quando hai dimestichezza con i moduli e le visualizzazioni generiche, leggi la :doc:`parte 5 di questo tutorial</intro/tutorial05>` per scoprire come testare la nostra app per i sondaggi.
ja: フォームや汎用ビューを使いこなせるようになったら、 :doc:`チュートリアルその5 </intro/tutorial05>` に進んで、投票アプリのテストについて学びましょう。
pl: Kiedy już czujesz się dobrze z formularzami i widokami generycznymi, przeczytaj :doc:`część 5 tego tutoriala</intro/tutorial05>`, aby nauczyć się testowania naszej ankietowej aplikacji.
zh_hans: 当你对你所写的表单和通用视图感到满意后，请阅读 :doc:`教程的第 5 部分 </intro/tutorial05>` 来了解如何测试我们的投票应用。

source: Writing your first Django app, part 5
el: Γράφοντας το πρώτο σας Django app, μέρος 5
it: Scrivere la tua prima applicazione in Django, parte 5
ja: はじめての Django アプリ作成、その 5
pl: Pisanie pierwszej aplikacji Django, część 5.
zh_hans: 编写你的第一个 Django 应用，第 5 部分

source: This tutorial begins where :doc:`Tutorial 4 </intro/tutorial04>` left off. We've built a Web-poll application, and we'll now create some automated tests for it.
el: Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 4 </intro/tutorial04>`. Έχουμε φτιάξει μια εφαρμογή ψηφοφορίας (Web-poll application) και τώρα θα δημιουργήσουμε μερικά αυτοματοποιημένα τεστ για αυτήν.
it: Questo tutoria inizia dove :doc:`Tutorial 4 </intro/tutorial04>` si è concluso. Abbiamo creato una applicazione Web chiamata sondaggi, e ora creeremo dei test automatici per la nostra applicazione.
ja: このチュートリアルは :doc:`チュートリアル 4 </intro/tutorial04>` の続きです。Web 投票アプリケーションが完成したので、今度は自動テストを作ってみましょう。
pl: Ten tutorial zaczyna się, gdzie skończył się :doc:`Tutorial 4 </intro/tutorial04>`. Zbudowaliśmy aplikację web-ankietową, teraz stworzymy dla niej kilka zautomatyzowanych testów.
zh_hans: 这一篇从 :doc:`教程第 4 部分 </intro/tutorial04>` 结尾的地方继续讲起。我们在前几章成功的构建了一个在线投票应用，在这一部分里我们将为它创建一些自动化测试。

source: Introducing automated testing
el: Εισαγωγή στα αυτοματοποιημένα τεστ
it: Introduzione ai test automatici
ja: 自動テストの導入
pl: Wprowadzenie do zautomatyzowanych testów
zh_hans: 自动化测试简介

source: What are automated tests?
el: Τι είναι τα αυτοματοποιημένα τεστ;
it: Cosa sono i test automatici?
ja: 自動テストとは何ですか？
pl: Czym są zautomatyzowane testy?
zh_hans: 自动化测试是什么？

source: Tests are simple routines that check the operation of your code.
el: Τα τεστ (tests) δεν είναι τίποτε άλλο παρά απλές ρουτίνες οι οποίες ελέγχουν τη λειτουργία του κώδικα σας.
ja: テストとは、コードの動作を確認する単純なプログラムです。
pl: Testy są prostymi rutynami, które sprawdzają działanie twojego kodu.
zh_hans: 测试，是用来检查代码正确性的一些简单的程序。

source: Testing operates at different levels. Some tests might apply to a tiny detail (*does a particular model method return values as expected?*) while others examine the overall operation of the software (*does a sequence of user inputs on the site produce the desired result?*). That's no different from the kind of testing you did earlier in :doc:`Tutorial 2 </intro/tutorial02>`, using the :djadmin:`shell` to examine the behavior of a method, or running the application and entering data to check how it behaves.
el: Το τεστ δραστηριοποιείται σε διαφορετικά επίπεδα. Μερικά τεστ μπορεί να εφαρμοστούν σε μια μικρή λεπτομέρεια (*επιστρέφει μια συγκεκριμένη μέθοδος ενός μοντέλου τις αναμενόμενες τιμές;*) ενώ άλλα εξετάζουν την συνολική εικόνα λειτουργίας του λογισμικού (*παράγει το επιθυμητό αποτέλεσμα η σειρά των inputs ενός χρήστη στο site;*). Αυτό δεν είναι κάτι διαφορετικό από το τεστ που κάνατε νωρίτερα στον :doc:`Οδηγό 2 </intro/tutorial02>`, χρησιμοποιώντας την εντολή :djadmin:`shell` για να εξετάσετε τη συμπεριφορά των μεθόδων ή να τρέξετε την εφαρμογή και κατά την αλληλεπίδραση μαζί της, να δείτε πως συμπεριφέρεται.
it: Il testing opera a livelli differenti. Alcuni test si posso applicare a piccoli dettagli (*un modello particolare restituisce i valori come ci si aspetta?*) mentre altri esaminano le operazioni del software a linee più generali (*la sequenza di input dell'utente sul sito produce l'output desiderato?*). Non è differente dal tipo di test che hai fatto nel :doc:`Tutorial 2 </intro/tutorial02>`, usando la :djadmin:`shell` per esaminare il comportamento di un metodo o lanciando l'applicazione ed inserendo i dati per controllare come si comporta.
ja: テストは異なるレベルで実行されます。あるテストは、小さな機能に対して行われるもの (*ある特定のモデルのメソッドは期待通りの値を返すか？*) かもしれませんし、別のテストは、ソフトウェア全体の動作に対して行われるもの (*サイト上でのユーザの一連の入力に対して、期待通りの結果が表示されるか？*) かもしれません。こうしたテストは、前に :doc:`チュートリアル その2 </intro/tutorial02>` で :djadmin:`shell` を用いてメソッドの動作を確かめたことや、実際にアプリケーションを実行して値を入力して結果がどうなるのかを確かめるといったことと、何も違いはありません。
pl: Testowanie działa na różnych poziomach. Niektóre testy mogą mieć zastosowanie do małych detali (*czy szczególna metoda modelu zwraca spodziewane wartości?*), podczas gdy inne sprawdzają ogólne działanie software'u (*czy sekwecja wejścia od użytkownika na stronie daje pożądany rezultat?*). Nie różni się to niczym od rodzaju testów, które robiłeś wcześniej w :doc:`Tutorialu 2 </intro/tutorial02>`, używając :djadmin:`shell`, by sprawdzić zachowanie metody, lub uruchamiając aplikację i wprowadzające dane, by sprawdzić, jak się zachowuje.
zh_hans: 测试在不同的层次中都存在。有些测试只关注某个很小的细节（某个模型的某个方法的返回值是否满足预期？），而另一些测试可能检查对某个软件的一系列操作（*某一用户输入序列是否造成了预期的结果？*）。其实这和我们在 :doc:`教程第 2 部分 </intro/tutorial02>`，里做的并没有什么不同，我们使用 :djadmin:`shell` 来测试某一方法的功能，或者运行某个应用并输入数据来检查它的行为。

source: What's different in *automated* tests is that the testing work is done for you by the system. You create a set of tests once, and then as you make changes to your app, you can check that your code still works as you originally intended, without having to perform time consuming manual testing.
el: Αυτό που διαφέρει στα *αυτοματοποιημένα* τεστ είναι ότι η δουλειά των τεστ γίνεται για σας από το σύστημα. Δημιουργείτε μια φορά ένα σετ από τεστ και μετά καθώς η εφαρμογή σας αλλάζει, μπορείτε να ελέγξετε ότι ο κώδικας σας δουλεύει όπως αρχικά είχατε σχεδιάσει χωρίς να χρονοτριβείτε με χειροκίνητα τεστ.
it: La differenza nell' automatizzare i test è che il sistema svolge i test al posto tuo. Tu crei un insieme di test una volta, e ogni volta che effettui una modifica alla tua applicazione, puoi controllare che il codice funzioni come ti aspettavi originariamente, senza dover impiegare tempo a svolgere test manualmente.
ja: *自動* テストが他と異なる点は、テスト作業がシステムによって実行されることです。一度テストセットを作成すると、それからはアプリに変更を加えるたびに、あなたの意図した通りにコードが動作するか確認できます。手動でテストする時間がかかることはありません。
pl: To, co jest innego w testach *zautomatyzowanych*, to to, że testowanie wykonywanie jest dla ciebie przez system. Raz tworzysz zestaw testów i później, kiedy robisz zmiany w swojej aplikacji, możesz sprawdzić, czy twój kod nadal działa jak to pierwotnie zamierzałeś, bez konieczności wykonywania pochłaniających czas testów ręcznych.
zh_hans: 真正不同的地方在于，*自动化* 测试是由某个系统帮你自动完成的。当你创建好了一系列测试，每次修改应用代码后，就可以自动检查出修改后的代码是否还像你曾经预期的那样正常工作。你不需要花费大量时间来进行手动测试。

source: Why you need to create tests
el: Γιατί χρειάζεται να δημιουργείτε τεστ
it: Perché devi creare dei test
ja: なぜテストを作成せねばならないのか
pl: Dlaczego potrzebujesz tworzyć testy
zh_hans: 为什么你需要写测试

source: So why create tests, and why now?
el: Γιατί, λοιπόν, δημιουργούμε τεστ και γιατί τώρα;
it: Quindi perche creare test, e perche ora?
ja: どうしてテストを作るのか？また、なぜ今なのか？
pl: Więc dlatego tworzyć testy i dlaczego teraz?
zh_hans: 但是，为什么需要测试呢？又为什么是现在呢？

source: You may feel that you have quite enough on your plate just learning Python/Django, and having yet another thing to learn and do may seem overwhelming and perhaps unnecessary. After all, our polls application is working quite happily now; going through the trouble of creating automated tests is not going to make it work any better. If creating the polls application is the last bit of Django programming you will ever do, then true, you don't need to know how to create automated tests. But, if that's not the case, now is an excellent time to learn.
el: Ίσως να αισθάνεστε ότι έχετε αρκετά στο κεφάλι σας ήδη (μαθαίνετε Python, μαθαίνετε Django) για να σας προστεθεί άλλη μια γνώση η οποία, σκέφτεστε, ίσως σας φανεί περιττή ή ακόμα και άχρηστη. Παρ’ όλ’ αυτά η εφαρμογή μας λειτουργεί περίφημα. Γιατί να μπούμε στον κόπο να φτιάξουμε αυτοματοποιημένα τεστ; Δεν θα κάνει την εφαρμογή μας καλύτερη, έτσι δεν είναι; Αν είναι να φτιάξετε μόνο αυτή την εφαρμογή με το Django και μετά δεν ασχοληθείτε άλλο, τότε ναι, δεν χρειάζεται να γνωρίζετε πως να φτιάξετε αυτοματοποιημένα τεστ. Αλλά αν δεν είναι έτσι, τώρα είναι μια καλή στιγμή να μάθετε πως.
it: Potresti sentire di avere abbastanza da fare solo per imparare Python / Django, e avere ancora un'altra cosa da imparare e da fare può sembrare gravoso e forse non necessario. Dopotutto, la nostra applicazione per i sondaggi ora funziona abbastanza bene; affrontare il problema della creazione di test automatizzati non lo farà funzionare meglio. Se la creazione dell'applicazione sondaggi è l'ultima parte della programmazione Django che farai mai, allora è vero, non hai bisogno di sapere come creare test automatizzati. Ma se non è così, ora è un ottimo momento per imparare.
ja: これまで学んだ Python/Django の知識に満足し、さらに別のことを学ぶのは大変で不必要なことだと思われるかもしれません。だって投票アプリケーションはきちんと動いているし、わざわざ自動テストを導入したところでアプリケーションがより良くなるわけではないのだから。もし Django プログラミングを学ぶことの全ての目的がこの投票アプリケーションを作ることであるのならば確かに自動テストの導入は必要ないと思います。しかし、そうではないのならば自動テストについて学ぶことは役に立つことでしょう。
pl: Możesz mieć wrażenie, że masz wystarczająco dużo na talerzu ucząc się tylko Pythona/Django i mając znów kolejną rzecz do nauki może wydawać się przytłaczające i może niepotrzebne. Ostatecznie nasza aplikacja ankietowa pracuje teraz całkiem szczęśliwie; przechodzenie przez problem tworzenia zautomatyzowanych testów nie spowoduje, że będzie działać choć trochę lepiej. Jeśli tworzenie aplikacji ankietowej jest ostatnim programowaniem w Django, jaki kiedykolwiek zrobisz, wtedy prawda, nie potrzebujesz wiedzieć, jak robić zautomatyzowane testy. Ale jeśli to nie jest twój przypadek, teraz jest wspaniały czas do nauki.
zh_hans: 你可能觉得学 Python/Django 对你来说已经很满足了，再学一些新东西的话看起来有点负担过重并且没什么必要。毕竟，我们的投票应用看起来已经完美工作了。写一些自动测试并不能让它工作的更好。如果写一个投票应用是你想用 Django 完成的唯一工作，那你确实没必要学写测试。但是如果你还想写更复杂的项目，现在就是学习测试写法的最好时机了。

source: Tests will save you time
el: Τα τεστ θα σας γλιτώσουν πολύτιμο χρόνο
it: I test ti faranno risparmiare tempo
ja: テストはあなたの時間を節約します
pl: Testy oszczędzą ci czas
zh_hans: 测试将节约你的时间

source: Up to a certain point, 'checking that it seems to work' will be a satisfactory test. In a more sophisticated application, you might have dozens of complex interactions between components.
el: Μέχρι ένα σημείο η λογική του 'τεστάρω για να δω αν λειτουργεί' θα δουλεύει μια χαρά. Σε πιο εκλεπτυσμένες-περίπλοκες εφαρμογές μπορεί να έχετε δεκάδες, αν όχι εκατοντάδες, αλληλεπιδράσεις μεταξύ των οντοτήτων σας (models, views κλπ) και η παραπάνω λογική να μην μπορεί πλέον να σας φανεί χρήσιμη.
it: Fino a un certo punto accertarsi che l'app 'sembra funzionare' potrebbe essere un test soddisfacente. In applicazioni sofisticate, potresti avere dozzine di complesse interazioni tra i componenti.
ja: ある一定の基準まで、'動くであろうことを確認すること'が十分なテストでしょう。高機能なアプリケーションでは、コンポーネント間で複雑な連携が数多くあるかもしれません。
pl: Do pewnego momentu, „sprawdzenie czy zdaje się działać” będzie satysfakcjonującym testem. W bardziej złożonej aplikacji możesz mieć tuziny złożonych interakcji pomiędzy komponentami.
zh_hans: 在某种程度上，能够「判断出代码是否正常工作」的测试，就称得上是个令人满意的了。在更复杂的应用程序中，组件之间可能会有数十个复杂的交互。

source: A change in any of those components could have unexpected consequences on the application's behavior. Checking that it still 'seems to work' could mean running through your code's functionality with twenty different variations of your test data just to make sure you haven't broken something - not a good use of your time.
el: Μια αλλαγή σε μια από αυτές τις οντότητες μπορεί να έχει μη αναμενόμενα αποτελέσματα στη συμπεριφορά της εφαρμογής σας. Αν εφαρμόσετε την παραπάνω λογική του 'φαίνεται να δουλεύει' ίσως χρειαστεί να ελέγξετε τον (και να ανατρέξετε στον) κώδικα σας με πάνω από είκοσι διαφορετικές εκδόσεις των τεστ δεδομένων σας, μόνο και μόνο για να σιγουρευτείτε ότι αυτή και μόνο η αλλαγή δεν επηρέασε αρνητικά κάποιο άλλο κομμάτι του κώδικα σας (κάποια άλλη οντότητα). Όλα αυτά χειροκίνητα - όχι και πολύ καλή αξιοποίηση του χρόνου σας.
ja: プログラムの変更によって予想だにしない箇所の挙動が変わってしまう可能性があります。それを確かめるためには、様々なテストデータを用いてプログラムを走らせて '正しく動いていそう' であることを確認する必要があります - これは効率がよくありません。
pl: Zmiana w jakimkolwiek z tych komponentów może mieć nieprzewidziane konsekwencje w zachowaniu aplikacji. Sprawdzenie, czy nadal „zdaje się działać” może znaczyć przechodzenie przez całą funkcjonalność twojego kodu z dwudziestoma różnymi wariacjami danych testowych tylko po to, by upewnić się, czy czegoś nie zepsułeś – nie jest to dobrze wykorzystany czas.
zh_hans: 在更加复杂的应用中，各种组件之间的交互可能会及其的复杂。改变其中某一组件的行为，也有可能会造成意想不到的结果。判断「代码是否正常工作」意味着你需要用大量的数据来完整的测试全部代码的功能，以确保你的小修改没有对应用整体造成破坏——这太费时间了。

source: That's especially true when automated tests could do this for you in seconds. If something's gone wrong, tests will also assist in identifying the code that's causing the unexpected behavior.
el: Αυτό είναι αλήθεια όταν τα αυτοματοποιημένα τεστ μπορούν να κάνουν την παραπάνω δουλειά για εσάς, σε δευτερόλεπτα. Αν κάτι πάει στραβά, τα τεστ θα σας βοηθήσουν στην αναγνώριση του κώδικα που δεν είχε την αναμενόμενη συμπεριφορά (δεν έτρεξε, δηλαδή, όπως του είχατε υπαγορεύσει).
it: Specialmente quando i test automatici possono fare tutto questo per te in pochi secondi. Se qualcosa va storto, i test ti assisteranno nel trovare il codice che ha causato il comportamento inaspettato.
ja: 自動テストを導入することによってプログラムが正しく動くことの確認を一瞬で終わらせることができ、またテストはプログラムのどこで予期せぬ動作が起きたかを見極めるのに役立つことでしょう。
pl: Jest to szczególnie prawdą kiedy zautomatyzowane testy mogą zrobić to za ciebie w sekundy. Jeśli coś poszło źle, testy pomogą też w zidentyfikowaniu kodu, który powoduje nieprzewidziane zachowanie.
zh_hans: 尤其是当你发现自动化测试能在几秒钟之内帮你完成这件事时，就更会觉得手动测试实在是太浪费时间了。当某人写出错误的代码时，自动化测试还能帮助你定位错误代码的位置。

source: Sometimes it may seem a chore to tear yourself away from your productive, creative programming work to face the unglamorous and unexciting business of writing tests, particularly when you know your code is working properly.
el: Καμιά φορά ίσως σας φανεί ως αγγαρεία να ξεφύγετε από το παραγωγικό και δημιουργικό κομμάτι της δουλειάς σας μόνο και μόνο για να μπείτε στη διαδικασία γραφής των ανιαρών τεστ, ειδικά όταν γνωρίζετε ότι η εφαρμογή σας λειτουργεί ορθά.
it: A volte, potrebbe sembrare un lavoro che toglie tempo alla tua produttività, dover programmare per affrontare il compito poco affascinante e poco emozionante di scrivere test, soprattutto quando sai che il tuo codice sta funzionando a dovere.
ja: テストを書くという行為は、特にプログラムが適切に動くと分かっているときには、生産的でも創造的でもないつまらないことのように思われるかもしれません。
pl: Czasem może wydawać się żmudne odrywać się od produktywnej, kreatywnej pracy programistycznej, aby zmierzyć się z szarym i nie ekscytującym biznesem pisania testów, szczególnie kiedy wiesz, że twój kod działa dobrze.
zh_hans: 有时候你会觉得，和富有创造性和生产力的业务代码比起来，编写枯燥的测试代码实在是太无聊了，特别是当你知道你的代码完全没有问题的时候。

source: However, the task of writing tests is a lot more fulfilling than spending hours testing your application manually or trying to identify the cause of a newly-introduced problem.
el: Από την άλλη, το κομμάτι της συγγραφής των τεστ θα προσθέσει μεγαλύτερη αξιοπιστία στον κώδικα σας από το να τεστάρετε τον κώδικα χειροκίνητα ή να προσπαθείτε να αναγνωρίσετε τη πηγή ενός νεοεισερχόμενου προβλήματος.
it: Tuttavia, scrivere test è molto più soddisfacente che passare ore a testare manualmente l'applicazione o cercare di identificare la causa di un problema appena introdotto.
ja: しかしテストを書くことは、何時間もかけてアプリケーションの動作を確認したり、新しく発生した問題の原因を探したりすることよりもずっとやりがいのあることなのです。
pl: Jednakże zadanie pisania testów jest o wiele bardziej satysfakcjonujące niż spędzanie godzin na testowaniu ręcznie swojej aplikacji lub na próbach identyfikacji przyczyny nowo-wprowadzonego problemu.
zh_hans: 然而，编写测试还是要比花费几个小时手动测试你的应用，或者为了找到某个小错误而胡乱翻看代码要有意义的多。

source: Tests don't just identify problems, they prevent them
el: Τα τεστ όχι μόνο αναγνωρίζουν τα προβλήματα αλλά τα εμποδίζουν επίσης
it: I test non si limitano a identificare i problemi, ma li prevengono
ja: またテストは問題点を検出するのみならず、問題が発生するのを防ぐこともできます。
pl: Testy nie tylko identyfikują problemy, one pomagają ich unikać
zh_hans: 测试不仅能发现错误，而且能预防错误

source: It's a mistake to think of tests merely as a negative aspect of development.
el: Είναι λάθος να νομίζετε ότι τα τεστ συμβάλλουν αρνητικά στην ανάπτυξη των εφαρμογών.
it: È uno sbaglio pensare che i test siano un aspetto negativo dello sviluppo.
ja: テストを単に開発の負な面と考えることは誤りです。
pl: Błędem jest myśleć o testach głównie jako negatywnym aspekcie dewelopmentu.
zh_hans: 「测试是开发的对立面」，这种思想是不对的。

source: Without tests, the purpose or intended behavior of an application might be rather opaque. Even when it's your own code, you will sometimes find yourself poking around in it trying to find out what exactly it's doing.
el: Φανταστείτε τους προγραμματιστές να μην είχαν στα εργαλεία τους τα τεστ. Χωρίς αυτά, ο στόχος ή η αναμενόμενη συμπεριφορά μιας εφαρμογής θα ήταν θολή-σκοτεινή. Ακόμα και αν είναι δικός σας κώδικας, θα χρειαστεί, μερικές φορές, να ψάξετε μέσα στον κώδικα για να διαπιστώσετε τι κάνει.
it: Senza test, il fine o il comportamento atteso di una applicazione potrebbe essere piuttosto opaco. Anche se è il tuo codice, talvolta ti ritroverai a frugarci dentro cercando di capire che cosa fa esattamente.
ja: テストなくしては、アプリケーションの目的や意図した動作というものが曖昧になってしまうことがあります。自分自身で書いたコードであっても、時にはそのコードがすることを正確に理解するのに時間がかかってしまうことがあります。
pl: Bez testów cel lub zamierzone działanie aplikacji może być raczej nieprzejrzyste. Nawet jeśli to twój własny kod, czasem okaże się, że czasem w nim węszysz próbując odkryć co dokładnie robi.
zh_hans: 如果没有测试，整个应用的行为意图会变得更加的不清晰。甚至当你在看自己写的代码时也是这样，有时候你需要仔细研读一段代码才能搞清楚它有什么用。

source: Tests change that; they light up your code from the inside, and when something goes wrong, they focus light on the part that has gone wrong - *even if you hadn't even realized it had gone wrong*.
el: Τα τεστ τα αλλάζουν όλα αυτά. Φωτίζουν τον κώδικα σας από μέσα και όταν κάτι πάει στραβά, ξέρετε ακριβώς ποιο ήταν αυτό το κομμάτι, *ακόμη και αν δεν είχατε συνειδητοποιήσει ότι αυτό το κομμάτι πήγε στραβά*.
it: I test operano un cambiamento; illuminano il tuo codice dall'interno e quando qualcosa va storto, gettano luce sulla parte che ha fallito -- *anche quando non ti sei nemmeno accorto che ha fallito*.
ja: テストはこの状況を大きく変え、いわばコードを内側から照らし出してくれます。そして、何か間違ったことをしてしまった時には、*自分自身では間違っていると気づかなかった場合でさえ*、間違いが起きた場所にスポットライトを当ててくれるのです。
pl: Testy to zmieniają; oświetlają twój kod z wnętrza i kiedy coś pójdzie nie tak, skupiają światłona części, która poszła źle – *nawet kiedy się nie zorientowałeś, że poszło źle*.
zh_hans: 而测试的出现改变了这种情况。测试就好像是从内部仔细检查你的代码，当有些地方出错时，这些地方将会变得很显眼——*就算你自己没有意识到那里写错了*。

source: Tests make your code more attractive
el: Τα τεστ κάνουν τον κώδικα σας πιο προσιτό
it: I test rendono il tuo codice più attraente
ja: テストは、コードをより魅力的にします
pl: Testy powodują, że twój kod jest bardziej atrakcyjny
zh_hans: 测试使你的代码更有吸引力
