Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Let's update our poll detail template ("polls/detail.html") from the last tutorial, so that the template contains an HTML ``<form>`` element:
el: Ας αναβαθμίσουμε το HTML template ("polls/detail.html"), από τον προηγούμενο οδηγό, στο οποίο εμφανίζουμε τις λεπτομέρειες της ψηφοφορίας. Αυτή τη φορά θα προσθέσουμε ένα HTML ``<form>`` element:
it: Aggiorniamo il nostro template per i dettagli del questionario ("polls/detail.html") dall'ultimo tutorial, così che il template contenga un elemento HTML ``<form>``:
ja: それでは、前回のチュートリアルで作成した投票詳細テンプレート ("polls/detail.html") を更新して、HTML の ``<form>`` 要素を入れましょう。
pl: Zaktualizujmy nasz szablon szczegółów ankiety („polls/detail.html”) z ostatniego tutoriala, aby zawierał element HTML ``<form>``:
zh_hans: 让我们更新一下在上一个教程中编写的投票详细页面的模板 ("polls/detail.html") ，让它包含一个 HTML ``<form>`` 元素：

source: A quick rundown:
el: Εδώ συμβαίνουν τα εξής:
it: Una rapida carrellata:
ja: 簡単に説明:
pl: Krótkie sprawozdanie:
zh_hans: 简要说明：

source: The above template displays a radio button for each question choice. The ``value`` of each radio button is the associated question choice's ID. The ``name`` of each radio button is ``"choice"``. That means, when somebody selects one of the radio buttons and submits the form, it'll send the POST data ``choice=#`` where # is the ID of the selected choice. This is the basic concept of HTML forms.
el: Το παραπάνω template εμφανίζει ένα radio button για κάθε επιλογή ερώτησης. Η τιμή (``value``) κάθε radio button είναι το ID αυτού. Το όνομα (``name``) σε όλα τα radio buttons είναι ``"choice"``. Αυτό σημαίνει ότι, όταν κάποιος επιλέγει κάποια από τις πιθανές απαντήσεις και κάνει submit τη φόρμα, τότε θα σταλούν (στον server) τα εξής δεδομένα με τη μέθοδο POST (POST data): ``choice=#`` όπου # είναι το ID της επιλεγμένης απάντησης (στέλνεται, δηλαδή, το name του input μαζί με το value του ίδιου σε μια μορφή key=value). Αυτό είναι το βασικό concept των HTML forms.
it: Il template di cui sopra mostra un radio button per ogni scelta del sondaggio. Il ``valore`` di ogni radio button è l'ID associato alla scelta. Il ``nome`` di ogni radio button è ``"choice"``. Questo significa che quando qualcuno seleziona uno dei radio button ed invia il form, manderà il dato ``choice=#`` in POST, dove # è l'ID della scelta selezionata. Questo è il concetto alla base dei form HTML.
ja: 上のテンプレートは、各質問の選択肢のラジオボタンが表示されます。各ラジオボタンの ``value`` は、関連する質問の選択肢のIDです。各ラジオボタンの ``name`` は ``"choice"`` です。投票者がラジオボタンの1つを選択し、フォームを送信する場合には、POSTデータ ``choice=#`` を送信します。＃の場所には選択肢のIDが入ります。これは、HTMLフォームの基本的な概念です。
pl: Powyższy szablon wyświetla przycisk opcji dla każdej z odpowiedzi. Atrybut ``value`` każdego przycisku opcji to ID związanej z pytaniem odpowiedzi. Atrybut ``name`` każdego przycisku opcji to ``"choice"``. To znaczy, że kiedy ktoś wybierze jeden z przycisków opcji i wyśle formularz, formularz wyśle dane POST ``choice=#``, gdzie # jest ID wybranej odpowiedzi. To jest podstawowa idea formularzy HTML.
zh_hans: 上面的模板在 Question 的每个 Choice 前添加一个单选按钮。 每个单选按钮的 ``value`` 属性是对应的各个 Choice 的 ID。每个单选按钮的 ``name`` 是 ``"choice"`` 。这意味着，当有人选择一个单选按钮并提交表单提交时，它将发送一个 POST 数据 ``choice=#`` ，其中# 为选择的 Choice 的 ID。这是 HTML 表单的基本概念。

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``. Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side. Whenever you create a form that alters data server-side, use ``method="post"``. This tip isn't specific to Django; it's just good Web development practice.
el: Θέτουμε το ``action`` της φόρμας σε ``{% url 'polls:vote' question.id %}`` και θέτουμε επίσης και τη μέθοδο που θα σταλεί στον server (``method="post"``). Είναι πολύ σημαντικό να χρησιμοποιήσουμε τη μέθοδο POST (``method="post"``) και όχι τη GET (``method="get"``) γιατί όταν κάνουμε submit τη συγκεκριμένη φόρμα σκοπεύουμε να αλλάξουμε τα data στο server (πιο συγκεκριμένα στην database). Οποτεδήποτε δημιουργείτε φόρμες που αλλάζουν (δημιουργούν νέα data - Create, αλλάζουν ήδη υπάρχοντα data - Update ή διαγράφουν data - Delete) τα δεδομένα στον server, τότε καλό είναι να χρησιμοποιείτε τη μέθοδο POST (``method="post"``). Αυτή η συμβουλή δεν είναι συγκεκριμένη για το Django. Είνα απλά μια πολύ καλή πρακτική στο Web development.
ja: フォームの ``action`` を ``{% url 'polls:vote' question.id %}`` に設定し、 さらに、 ``method="post"`` を設定します。``method="post"`` を使用する (``method="get"`` ではなく) ことは非常に重要です。なぜなら、フォームの送信はサーバ側のデータの更新につながるからです。サーバ側のデータを更新するフォームを作成する場合は、 ``method="post"`` を使いましょう。これは、 Django 固有のものではなく、いわば Web 開発の王道です。
pl: Ustawiamy atrybut ``action`` formularza na ``{% url 'polls:vote' question.id %}`` i ustawiamy ``method="post"``. Użycie ``method="post"`` (w opozycji do ``method="get"``) jest bardzo ważne, ponieważ akt wysłania formularza zmieni dane po stronie serwera. Kiedykolwiek tworzysz formularz, który zmienia dane po stronie serwera, używaj ``method="post"``. Ta wskazówka nie dotyczy tylko Django; jest dobrą praktyką w web-dewelopmencie.
zh_hans: 我们设置表单的 ``action`` 为 ``{% url 'polls:vote' question.id %}`` ，并设置 ``method="post"`` 。使用 ``method="post"``（与其相对的是 ``method="get"`）是非常重要的，因为这个提交表单的行为会改变服务器端的数据。 无论何时，当你需要创建一个改变服务器端数据的表单时，请使用 ``method="post"`` 。这不是 Django 的特定技巧；这是优秀的网站开发技巧。

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
el: Το ``forloop.counter`` δείχνει τον αριθμό που ο βρόγχος επανάληψης :ttag:`for` έχει τρέξει. Αυτό το κάνουμε για να λάβει κάθε ``input`` element μοναδικό id.
it: ``forloop.counter`` indica quante volte il tag :ttag:`for` ha attraversato suo loop
ja: ``forloop.counter`` は、ttag:`for` タグのループが何度実行されたかを表す値です。
pl: ``forloop.counter`` mówi ile razy tag :ttag:`for` przeszedł przez swoją pętlę
zh_hans: ``forloop.counter`` 指示 :ttag:`for` 标签已经循环多少次。

source: Since we're creating a POST form (which can have the effect of modifying data), we need to worry about Cross Site Request Forgeries. Thankfully, you don't have to worry too hard, because Django comes with a very easy-to-use system for protecting against it. In short, all POST forms that are targeted at internal URLs should use the :ttag:`{% csrf_token %}<csrf_token>` template tag.
el: Εφόσον δημιουργούμε μια POST φόρμα (η οποία επιδρά στο server αλλάζοντας τα δεδομένα), θα πρέπει να ανησυχούμε για τα Cross Site Request Forgeries. Ευτυχώς, δεν θα πρέπει να ανησυχείτε πολύ, γιατί το Django έρχεται με ένα πανεύκολο σύστημα προστασίας από το CSRF. Εν ολίγοις, όλες οι POST φόρμες των οποίων τα actions αφορούν εσωτερικά URLs θα πρέπει να χρησιμοποιούν το template tag :ttag:`{% csrf_token %}<csrf_token>.
ja: POST フォーム(データを改ざんされる恐れのある) を作成しているので、クロス サイトリクエストフォージェリを心配する必要があります。ありがたいことに、 Django がこれに対応するとても使いやすい仕組みを提供してくれているので、あまり心配する必要はありません。手短に言うと、全ての自サイトへの POST フォームに、 :ttag:`{% csrf_token %}<csrf_token>` テンプレートタグを使います。
pl: Jako że stworzymy formularz POST (który może mieć efekt modyfikacji danych), musimy martwić się o cross-site request forgeries. Na szczęście, nie musisz przejmować się za bardzo, bo Django oferuje bardzo prosty w użyciu system przed nimi chroniący. W skrócie: wszystkie formularze POST, które są skierowane na wewnętrzne URL-e powinny używać szablonowego taga :ttag:`{% csrf_token %}<csrf_token>`.
zh_hans: 由于我们创建一个 POST 表单（它具有修改数据的作用），所以我们需要小心跨站点请求伪造。 谢天谢地，你不必太过担心，因为 Django 已经拥有一个用来防御它的非常容易使用的系统。 简而言之，所有针对内部 URL 的 POST 表单都应该使用 :ttag:`{% csrf_token %}<csrf_token>` 模板标签。

source: Now, let's create a Django view that handles the submitted data and does something with it. Remember, in :doc:`Tutorial 3 </intro/tutorial03>`, we created a URLconf for the polls application that includes this line:
el: Ας δημιουργήσουμε τώρα ένα Django view το οποίο θα χειριστεί τα δεδομένα τα οποία έγιναν submit από τη φόρμα. Θυμηθείτε ότι στον :doc:`Οδηγό 3 </intro/tutorial03>`, δημιουργήσαμε ένα URLconf, το οποίο περιλαμβάνει τη γραμμή:
it: Adesso, creiamo una view Django che gestisce i dati in submit e ci fa qualcosa. Ricorda che nel :doc:`Tutorial 3 </intro/tutorial03>`, abbiamo creato una URLconf per l'applicazione sondaggio che include questa linea:
ja: 送信されたデータを処理するための Django のビューを作成しましょう。 :doc:`チュートリアルその 3 </intro/tutorial03>` で、以下のような投票アプリケーションの URLconf を作成したことを思い出しましょう:
pl: Teraz stwórzmy widok Django, który obsługuje wysłane dane i coś z nimi robi. Pamiętaj, w :doc:`Tutorialu 3 </intro/tutorial03>`, stworzyliśmy URLconfa dla aplikacji ankietowej, który zawiera tę linię:
zh_hans: 现在，让我们来创建一个 Django 视图来处理提交的数据。记住，在 :doc:`教程第 3 部分 </intro/tutorial03>` 中，我们为投票应用创建了一个 URLconf ，包含这一行：

source: We also created a dummy implementation of the ``vote()`` function. Let's create a real version. Add the following to ``polls/views.py``:
el: Δημιουργήσαμε επίσης μια πρόχειρη υλοποίηση της συνάρτησης (view) ``vote()``. Ας αναβαθμίσουμε και αυτό το view για να χειριστεί τα data. Προσθέστε τα ακόλουθα στο αρχείο ``polls/views.py``:
it: Abbiamo anche creato una implementazione dummy della funzione ``vote()``. Creiamone una versione reali. Aggiungi quanto di seguito a ``polls/views.py``:
ja: すでに、 ``vote()`` 関数のダミー実装を作成しました。今度は、本物を実装しましょう。以下を ``polls/views.py`` に追加してください:
pl: Stworzyliśmy także zaślepkową implementację funkcji ``vote()``. Stwórzmy prawdziwą wersję. Dodaj następujący kod do ``polls/views.py``:
zh_hans: 我们还创建了一个 ``vote()`` 函数的虚拟实现。让我们来创建一个真实的版本。 将下面的代码添加到 ``polls/views.py`` ：

source: This code includes a few things we haven't covered yet in this tutorial:
el: Ο παραπάνω κώδικας περιλαμβάνει μερικά πράγματα τα οποία δεν έχουμε καλύψει μέχρι τώρα στον οδηγό:
it: Questo codice comprende alcuni aspetti non ancora trattati in questo tutorial:
ja: このコードには、これまでのチュートリアルで扱っていなかったことがいくつか入っています:
pl: Ten kod zawiera kilka rzeczy, których jeszcze nie omówiliśmy w tym tutorialu:
zh_hans: 以上代码中有些内容还未在本教程中提到过：

source: :attr:`request.POST <django.http.HttpRequest.POST>` is a dictionary-like object that lets you access submitted data by key name. In this case, ``request.POST['choice']`` returns the ID of the selected choice, as a string. :attr:`request.POST <django.http.HttpRequest.POST>` values are always strings.
el: Το object :attr:`request.POST <django.http.HttpRequest.POST>` έχει τη μορφή ενός dictionary το οποίο σας επιτρέπει να έχετε πρόσβαση στα submitted data μέσω του ονόματος του key (όπως ακριβώς λειτουργεί ένα dictionary στην Python). Στην περίπτωση μας, το ``request.POST['choice']`` επιστρέφει το ID της επιλεγμένης απάντησης, υπό τη μορφή ενός string. Όλες οι τιμές μέσα το object :attr:`request.POST <django.http.HttpRequest.POST>` έχουν τη μορφή string.
it: :attr:`request.POST <django.http.HttpRequest.POST>` è un oggetto simil-dizionario che ti lascia accedere ai dati in submit per nome di chiave. In questo caso, ``request.POST['choice']`` restituisce l'ID della scelta selezionata, come stringa. I valori :attr:`request.POST <django.http.HttpRequest.POST>` sono sempre stringhe.
ja: :attr:`request.POST <django.http.HttpRequest.POST>` は送信したキーの名前でデータにアクセスできる辞書のようなオブジェクトです。この場合、 ``request.POST['choice']`` は、選択された選択肢の ID を文字列として返します。 :attr:`request.POST <django.http.HttpRequest.POST>` の値は常に文字列です。
pl: :attr:`request.POST <django.http.HttpRequest.POST>` to słownikowy obiekt, który daje dostęp do wysłanych danych według nazwy klucza. W tym przypadku ``request.POST['choice']`` zwraca ID wybranej odpowiedzi jako stringa. Wartości :attr:`request.POST <django.http.HttpRequest.POST>` są zawsze stringami.
zh_hans: :attr:`request.POST <django.http.HttpRequest.POST>` 是一个类字典对象，让你可以通过关键字的名字获取提交的数据。 这个例子中， ``request.POST['choice']`` 以字符串形式返回选择的 Choice 的 ID。 :attr:`request.POST <django.http.HttpRequest.POST>` 的值永远是字符串。

source: Note that Django also provides :attr:`request.GET <django.http.HttpRequest.GET>` for accessing GET data in the same way -- but we're explicitly using :attr:`request.POST <django.http.HttpRequest.POST>` in our code, to ensure that data is only altered via a POST call.
el: Σημειώστε ότι το Django παρέχει επίσης ανάλογη πρόσβαση στα GET data (αν χρησιμοποιηθεί το ``method="get"``) μέσω του object :attr:`request.GET <django.http.HttpRequest.GET>` -- αλλά στο συγκεκριμένο παράδειγμα χρησιμοποιούμε αποκλειστικά την :attr:`request.POST <django.http.HttpRequest.POST>`, για να σιγουρευτούμε ότι τα data θα αλλάξουν (στη βάση δεδομένων) μόνο από κάποιο POST call (και ότι τυχόν από κάπου αλλού).
it: Nota che Django ti offre anche :attr:`request.GET <django.http.HttpRequest.GET>` per accedere ai dati in GET allo stesso modo -- ma stiamo esplicitamente usando :attr:`request.POST <django.http.HttpRequest.POST>` nel nostro codice, per assicurarci che i dati vengano alterati solo con una chiamata POST.
ja: Django では、GET データにアクセスするために同様に :attr:`request.GET <django.http.HttpRequest.GET>` を提供しています。ただし、このコードでは、POST を経由した呼び出しでないとデータを更新させないようにするために、:attr:`request.POST <django.http.HttpRequest.POST>` を明示的に使っています。
pl: Zwróć uwagę, że Django ma także :attr:`request.GET <django.http.HttpRequest.GET>` dające dostęp do danych GET w ten sam sposób – ale my specjalnie używamy :attr:`request.POST <django.http.HttpRequest.POST>` w naszym kodzie, aby upewnić się, że dane są zmieniane tylko przez wywołanie POST.
zh_hans: 注意，Django 还以同样的方式提供 :attr:`request.GET <django.http.HttpRequest.GET>` 用于访问 GET 数据 —— 但我们在代码中显式地使用 :attr:`request.POST <django.http.HttpRequest.POST>` ，以保证数据只能通过 POST 调用改动。

source: ``request.POST['choice']`` will raise :exc:`KeyError` if ``choice`` wasn't provided in POST data. The above code checks for :exc:`KeyError` and redisplays the question form with an error message if ``choice`` isn't given.
el: Το object ``request.POST['choice']`` θα κάνει raise το exception :exc:`KeyError` (όπως και ένα κοινό Python dictionary) αν το key ``choice`` δεν βρεθεί (δεν υπάρχει, δηλαδή, στα POST data). Ο παραπάνω κώδικας κάνει handle το exception αυτό με το να επανεμφανίσει τη φόρμα ψηφοφορίας με ένα ανάλογο μήνυμα σφάλματος (error message).
it: ``request.POST['choice']`` solleverà :exc:`KeyError` se ``choice`` non è presente tra i dati in POST. Il codice sopra controlla :exc:`KeyError` e mostra di nuovo il form della domanda con un messaggio di errore se ``choice`` non viene fornita.
ja: POST データに ``choice`` がなければ、 ``request.POST['choice']`` は :exc:`KeyError` を送出します。上のコードでは :exc:`KeyError` をチェックし、 ``choice`` がない場合にはエラーメッセージ付きの質問フォームを再表示します。
pl: ``request.POST['choice']`` zgłosi :exc:`KeyError` jeśli atrybutu ``choice`` nie było wśród danych POST. Powyższy kod sprawdza :exc:`KeyError` i ponownie wyświetla formularz pytania z komunikatem błędu, jeśli ``choice`` nie został wskazany.
zh_hans: 如果在 ``request.POST['choice']`` 数据中没有提供 ``choice`` ， POST 将引发一个 :exc:`KeyError` 。上面的代码检查 :exc:`KeyError` ，如果没有给出 ``choice`` 将重新显示 Question 表单和一个错误信息。

source: After incrementing the choice count, the code returns an :class:`~django.http.HttpResponseRedirect` rather than a normal :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` takes a single argument: the URL to which the user will be redirected (see the following point for how we construct the URL in this case).
el: Αφού αυξήσουμε το πλήθος των ψήφων (κατά ένα, κάθε φορά), ο κώδικας επιστρέφει ένα object :class:`~django.http.HttpResponseRedirect` παρά ένα συνηθισμένο :class:`~django.http.HttpResponse`. Το object :class:`~django.http.HttpResponseRedirect` αρχικοποιείται (initializes) με ένα όρισμα (argument): το URL στο οποίο θα ανακατευθυνθεί ο χρήστης (δείτε τις ακόλουθες δύο παραγράφους σχετικά με το πως χτίζουμε το URL σε αυτή την περίπτωση).
it: Dopo aver incrementato il conteggio delle scelte, il codice restituisce una :class:`~django.http.HttpResponseRedirect` piuttosto che una normale :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` prende un solo argomento: la URL alla quale l'utente sarà redirezionato (vedi il punto seguente per sapere come costruiamo la URL in questo caso).
ja: choice のカウントをインクリメントした後、このコードは、 通常の :class:`~django.http.HttpResponse` ではなく :class:`~django.http.HttpResponseRedirect` を返します。 :class:`~django.http.HttpResponseRedirect` はひとつの引数をとります: リダイレクト先のURL (このような場合にURLを構築する方法については、以下のポイントを参照してください)
pl: Po zwiększeniu licznika odpowiedzi, kod zwraca :class:`~django.http.HttpResponseRedirect` zamiast normalnej :class:`~django.http.HttpResponse`. :class:`~django.http.HttpResponseRedirect` bierze jeden argument: URL, do którego użytkownik będzie przekierowany (zobacz następny punkt, aby dowiedzieć się, jak w tym przypadku kontruujemy URL-e).
zh_hans: 在增加 Choice 的得票数之后，代码返回一个 :class:`~django.http.HttpResponseRedirect` 而不是常用的 :class:`~django.http.HttpResponse` 、 :class:`~django.http.HttpResponseRedirect` 只接收一个参数：用户将要被重定向的 URL（请继续看下去，我们将会解释如何构造这个例子中的 URL）。

source: As the Python comment above points out, you should always return an :class:`~django.http.HttpResponseRedirect` after successfully dealing with POST data. This tip isn't specific to Django; it's just good Web development practice.
el: Όπως προαναφέραμε θα πρέπει πάντα το view να επιστρέφει ένα object :class:`~django.http.HttpResponseRedirect` μετά από επιτυχή χειρισμό δεδομένων που έγιναν submit με τη μέθοδο POST. Για ακόμη μια φορά, αυτή η συμβουλή δεν αφορά αποκλειστικά το Django, είναι απλώς καλή πρακτική για το Web development.
ja: 上記の Python コメントが指摘するように、POST データが成功した後に :class:`~django.http.HttpResponseRedirect` を常に返す必要があります。これは Django 固有のものではありません。それは良い Web 開発のプラクティスです。
pl: Tak jak wskazuje komentarz powyżej w Pythonie, powinieneś zawsze zwracać :class:`~django.http.HttpResponseRedirect` po poradzeniu sobie z danymi POST. Ta wskazówka nie jest szczególna dla Django; to po prostu dobra praktyka w web-dewelopmencie.
zh_hans: 正如上面的 Python 注释指出的，你应该在成功处理 POST 数据后总是返回一个 :class:`~django.http.HttpResponseRedirect` 。 这不是 Django 的特殊要求，这是那些优秀网站在开发实践中形成的共识。

source: We are using the :func:`~django.core.urlresolvers.reverse` function in the :class:`~django.http.HttpResponseRedirect` constructor in this example. This function helps avoid having to hardcode a URL in the view function. It is given the name of the view that we want to pass control to and the variable portion of the URL pattern that points to that view. In this case, using the URLconf we set up in :doc:`Tutorial 3 </intro/tutorial03>`, this :func:`~django.core.urlresolvers.reverse` call will return a string like ::
ja: この例では :class:`~django.http.HttpResponseRedirect` の中で :func:`~django.core.urlresolvers.reverse` を使用しています。この関数を使うと、ビュー関数中での URL のハードコードを防げます。この関数に、ビューの名前を渡し、同時に URL パターンからビューにマップするときに取り出される変数を指定します。この例では、 :doc:`チュートリアルその 3</intro/tutorial03>` で設定した URLconf に従って、 :func:`~django.core.urlresolvers.reverse` を呼ぶと次の文字列を返します::

source: where the ``3`` is the value of ``question.id``. This redirected URL will then call the ``'results'`` view to display the final page.
el: όπου ``3`` είναι η τιμή του ``question.id``. Αυτό το URL θα καλέσει το view με το όνομα ``'results'`` για να εμφανίσει τη σελίδα (το rendered template, δηλαδή, ``polls/detail.html``). Όταν λέμε rendered template ας εξηγήσουμε τι εννοούμε. Είναι πολύ απλό. Μέσα σε ένα template (συνήθως μια HTML σελίδα), συνήθως βάζουμε περιεχόμενο το οποίο αναμένουμε να “γεμίσει” με μια τιμή από κάπου (συνήθως από το view που κάλεσε αυτό το template). Είδαμε κάτι τέτοιο στον :doc:`Οδηγό 3 </intro/tutorial03>` όπου στο template ``polls/detail.html`` βάλαμε την έκφραση {{ choice.choice_text }} μέσα σε ένα ``<li></li>`` HTML element. Αυτή η τιμή θα “γεμίσει” από το context που θα περάσει το view στο template (μέσω της ``render()`` φυσικά). Το context δεν είναι τίποτε άλλο παρά ένα dictionary όπου τα keys ονομάζονται context variables. Υπολογίστηκαν κάποιες τιμές στο view και με κάποιον τρόπο θα πρέπει να περαστούν στο template. Όταν το template γεμίσει με τις απαραίτητες τιμές τότε έχει γίνει rendered.
it: dove il ``3`` è il valore di ``question.id``. Questa URL redirezionata poi chiamerà la view ``'results'`` per mostrare la pagina finale.
ja: この ``3`` は ``question.id`` の値です。 リダイレクト先の URL は ``'results'`` ビューを呼び出し、最終的なページを表示します。
pl: gdzie ``3`` jest wartością ``question.id``. Ten przekierowany URL później wywoła widok ``'results'``, aby wyświetlić ostateczną stronę.
zh_hans: 其中 ``3`` 是 ``question.id`` 的值。重定向的 URL 将调用 ``'results'`` 视图来显示最终的页面。

source: As mentioned in :doc:`Tutorial 3 </intro/tutorial03>`, ``request`` is an :class:`~django.http.HttpRequest` object. For more on :class:`~django.http.HttpRequest` objects, see the :doc:`request and response documentation </ref/request-response>`.
el: Όπως αναφέρθηκε στον :doc:`Οδηγό 3 </intro/tutorial03>`, το ``request`` είναι ένα object της κλάσης :class:`~django.http.HttpRequest`. Για περισσότερες πληροφορίες σχετικά με τα objects της κλάσης :class:`~django.http.HttpRequest`, δείτε το άρθρο :doc:`εγχειρίδιο του request και response </ref/request-response>`.
it: Come menzionato in :doc:`Tutorial 3 </intro/tutorial03>`, ``request`` è un oggetto :class:`~django.http.HttpRequest`. Per saperne di più sugli oggetti :class:`~django.http.HttpRequest`, vedi la :doc:`documentazione su request e response </ref/request-response>`.
ja: :doc:`チュートリアルその 3 </intro/tutorial03>` で触れたように、 ``request`` は :class:`~django.http.HttpRequest` オブジェクトです。 :class:`~django.http.HttpRequest` オブジェクトの詳細は :doc:`リクエスト・レスポンスオブジェクトのドキュメント </ref/request-response>` を参照してください。
pl: Jak wspomniano w :doc:`Tutorialu 3 </intro/tutorial03>`, ``request`` jest obiektem :class:`~django.http.HttpRequest`. Po więcej informacji na temat obiektów :class:`~django.http.HttpRequest`, zobacz :doc:`dokumentację żądań i odpowiedzi </ref/request-response>`.
zh_hans: 正如在 :doc:`教程第 3 部分 </intro/tutorial03>` 中提到的，:class:`~django.http.HttpRequest` 是一个 :class:`~django.http.HttpRequest` 对象。更多关于 :class:`~django.http.HttpRequest` 对象的内容，请参见 :doc:`请求和响应的文档 </ref/request-response>` 。

source: After somebody votes in a question, the ``vote()`` view redirects to the results page for the question. Let's write that view:
el: Όταν κάποιος ψηφίσει στην ερώτηση, τότε το view ``vote()`` θα ανακατευθύνει το χρήστη στη σελίδα των αποτελεσμάτων για αυτή την ερώτηση. Ας γράψουμε αυτό το view:
it: Dopo che qualcuno ha votato una domanda, la vista ``vote()`` reindirizza alla pagina dei risultati per la domanda. Scriviamo quella vista:
ja: 誰かが質問の投票すると、 ``vote()`` ビューは質問の結果ページにリダイレクトします。このビューを書きましょう:
pl: Po tym, jak ktoś zagłosuje w danym pytaniu, widok ``vote()`` przekieruje go na stronę wyników dla pytania. Napiszmy ten widok:
zh_hans: 当有人对 Question 进行投票后， ``vote()`` 视图将请求重定向到 Question 的结果界面。让我们来编写这个视图：

source: This is almost exactly the same as the ``detail()`` view from :doc:`Tutorial 3 </intro/tutorial03>`. The only difference is the template name. We'll fix this redundancy later.
el: Αυτό το view είναι σχεδόν πανομοιότυπο με το ``detail()`` από τον :doc:`Οδηγό 3 </intro/tutorial03>`. Η μόνη διαφορά είναι το όνομα του template. Θα φτιάξουμε αυτό τον πλεονασμό αργότερα. Μας αρέσει να ακολουθάμε την τακτική DRY (don’t repeat yourself).
it: Questa è praticamente la stessa view di ``detail()`` dal :doc:`Tutorial 3 </intro/tutorial03>`. L'unica differenza è il nome di template. Metteremo a posto questa ridondanza più tardi.
ja: :doc:`チュートリアルその 3 </intro/tutorial03>` の ``detail()`` とほぼ同じです。テンプレートの名前のみ違います。この冗長さは後で修正することにします。
pl: Jest prawie identyczny z widokiem ``detail()`` z :doc:`Tutoriala 3 </intro/tutorial03>`. Jedyna różnica to nazwa szablonu. Naprawimy tę redundancję później.
zh_hans: 这和 :doc:`教程第 3 部分 </intro/tutorial03>` 中的 ``detail()`` 视图几乎一模一样。唯一的不同是模板的名字。 我们将在稍后解决这个冗余问题。

source: Now, create a ``polls/results.html`` template:
el: Τώρα, δημιουργήστε το template με το όνομα ``polls/results.html``:
it: Ora, crea un template ``polls/results.html`` :
ja: それでは ``polls/results.html`` テンプレートを作成します:
pl: Teraz stwórzmy szablon ``polls/results.html``:
zh_hans: 现在，创建一个 ``polls/results.html`` 模板：
