Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Each view is responsible for doing one of two things: returning an :class:`~django.http.HttpResponse` object containing the content for the requested page, or raising an exception such as :exc:`~django.http.Http404`. The rest is up to you.
el: Κάθε view είναι υπεύθυνο στο να κάνει ένα από δύο πράγματα: να επιστρέφει ένα :class:`~django.http.HttpResponse` object το οποίο περιέχει το περιεχόμενο για την σελίδα που ζητήθηκε ή να κάνει raise κάποιο exception όπως το :exc:`~django.http.Http404`. Τα υπόλοιπα εξαρτώνται από εσάς.
it: Ogni view è responsabile di fare una delle due cose: restituire un oggetto :class:`~django.http.HttpResponse` con il contenuto della pagina richiesta oppure sollevare una eccezione come :exc:`~django.http.Http404`. Il resto spetta a te.
ja: 各ビューには二つの役割があります: 一つはリクエストされたページのコ ンテンツを含む :class:`~django.http.HttpResponse` オブジェクトを返すこと、もう一つは :exc:`~django.http.Http404` のような例外の送出です。それ以外の処理はユーザ次第です。
pl: Każdy widok jest odpowiedzialny za zrobienie jednej z dwóch rzeczy: zwrócenie obiektu :class:`~django.http.HttpResponse` zawierającego treść dla żądanej strony lub rzucenie wyjątku takiego jak :exc:`~django.http.Http404`. Reszta zależy od ciebie.
zh_hans: 每个视图必须要做的只有两件事：返回一个包含被请求页面内容的 :class:`~django.http.HttpResponse` 对象，或者抛出一个异常，比如 :exc:`~django.http.Http404` 。至于你还想干些什么，随便你。

source: Your view can read records from a database, or not. It can use a template system such as Django's -- or a third-party Python template system -- or not. It can generate a PDF file, output XML, create a ZIP file on the fly, anything you want, using whatever Python libraries you want.
el: Το view σας μπορεί να διαβάσει records από την βάση δεδομένων ή όχι. Μπορεί να χρησιμοποιήσει ένα template system όπως αυτό του Django -- ή κάποιο τρίτο Python template system -- ή όχι. Μπορεί να παράγει κάποιο PDF αρχείο, να εξάγει XML, να δημιουργεί κάποιο ZIP αρχείο, να εξάγει JSON δεδομένα, βασικά μπορεί να κάνει τα πάντα χρησιμοποιώντας οποιεσδήποτε βιβλιοθήκες Python επιθυμείτε.
it: La tua view può leggere dati dal database oppure no. Può usare un sistema di template come quello di Django -- o un sistema di template per Python di terze parti -- o no. Può generare un file PDF, un XML in output, creare un file ZIP sul momento, usare qualsiasi libreria Python tu voglia.
ja: ビューはデータベースからレコードを読みだしても、読み出さなくてもかまいません。 Django のテンプレートシステム、あるいはサードパーティの Python テンプ レートシステムを使ってもよいですし、使わなくてもかまいません。 PDF ファイルを生成しても、 XML を出力しても、 ZIP ファイルをその場で生成してもかまいません。 Python ライブラリを使ってやりたいことを何でも実現できます。
pl: Twój widok może czytać rekordy z bazy danych lub nie. Może używać systemu szablonów takiego jak Django – lub innego systemu szablonów Python – lub nie. Może generować plik PDF, zwracać XML, tworzyć w locie plik ZIP, cokolwiek chcesz, używając dowolnych bibliotek Pythona, których chcesz.
zh_hans: 你的视图可以从数据库里读取记录，可以使用一个模板引擎（比如 Django 自带的，或者其他第三方的），可以生成一个 PDF 文件，可以输出一个 XML，创建一个 ZIP 文件，你可以做任何你想做的事，使用任何你想用的 Python 库。

source: All Django wants is that :class:`~django.http.HttpResponse`. Or an exception.
el: Το μόνο που απαιτείται από το Django είναι ένα :class:`~django.http.HttpResponse` ή μια exception.
it: Tutto quel che Django vuole è quella :class:`~django.http.HttpResponse`. Oppure un'eccezione.
ja: Django にとって必要なのは :class:`~django.http.HttpResponse` か、あるいは例外です。
pl: Wszystko, czego chce Django, to ten :class:`~django.http.HttpResponse`. Lub wyjątek.
zh_hans: Django 只要求返回的是一个 :class:`~django.http.HttpResponse` ，或者抛出一个异常。

source: Because it's convenient, let's use Django's own database API, which we covered in :doc:`Tutorial 2 </intro/tutorial02>`. Here's one stab at a new ``index()`` view, which displays the latest 5 poll questions in the system, separated by commas, according to publication date:
el: Επειδή είναι βολικό, θα χρησιμοποιήσουμε το database API του Django, το οποίο καλύψαμε στον :doc:`Οδηγό 2 </intro/tutorial02>`. Παρακάτω βλέπετε ένα καινούργιο view με το όνομα ``index()``, το οποίο εμφανίζει τις τελευταίες 5 ερωτήσεις (που υπάρχουν στην βάση δεδομένων), διαχωρισμένες με κόμμα, βάση της ημερομηνίας που καταχωρήθηκαν (δημιουργήθηκαν):
it: Dal momento che conviene, usiamo l'API database di Django, che abbiamo visto nella :doc:`guida 2 </intro/tutorial02>`. Ecco una prova per la nuova view ``index()``, che mostra le ultime 5 domande dei sondaggi nel sistema, separati dalla virgola, secondo la data di pubblicazione:
ja: 簡単のため、 `チュートリアルその 2 </intro/tutorial02>` で解説した Django のデータベース API を使ってみましょう。 ``index()`` ビューを、システム上にある最新の 5 件の質問項目をカンマで区切り、日付順に表示させてみます:
pl: Użyjmy własnego bazodanowego API Django, które omówiliśmy w :doc:`Tutorialu 2 </intro/tutorial02>`, ponieważ jest wygodne. Tu jest próba w nowym widoku ``index()``, która wyświetla ostatnie 5 pytań ankietowych w systemie, oddzielone przecinkami, według daty publikacji:
zh_hans: 因为 Django 自带的数据库 API 很方便，我们曾在 :doc:`教程第 2 部分 </intro/tutorial02>` 中学过，所以我们试试在视图里使用它。我们在 ``index()`` 函数里插入了一些新内容，让它能展示数据库里以发布日期排序的最近 5 个投票问题，以空格分割：

source: There's a problem here, though: the page's design is hard-coded in the view. If you want to change the way the page looks, you'll have to edit this Python code. So let's use Django's template system to separate the design from Python by creating a template that the view can use.
el: Υπάρχει ένα πρόβλημα εδώ, όμως: ο σχεδιασμός της σελίδας (design) είναι γραμμένος στο view. Αν χρειαστεί να αλλάξετε τον τρόπο εμφάνιση της σελίδας σας, θα χρειαστεί να επεξεργαστείτε αυτόν τον Python κώδικα. Ας κάνουμε κάτι καλύτερο. Ας χρησιμοποιήσουμε το template system του Django για να διαχωρίσουμε το design από τον Python κώδικα δημιουργώντας ένα template που το view μπορεί να χρησιμοποιήσει.
it: Eppure c'è un problema qui: il design della pagina è codificato nella view. Se vuoi cambiare il modo in cui la pagina appare, dovrai modificare questo codice Python. Usiamo il sistema di template di Django per separare il design da Python creando un template che la view possa usare.
ja: このコードには問題があります。ビューの中で、ページのデザインがハードコードされています。ページの見栄えを変更するたびに、 Python コードを編集する必要があります。 Django のテンプレートシステムを使って、ビューから使用できるテンプレートを作成し、Python からデザインを分離しましょう。
pl: Chociaż mamy tutaj problem: design strony jest zahardcodowany w widoku. Jeśli chcesz zmienić sposób, w jaki wygląda strona, będziesz musiał zmienić ten kod Pythona. Użyjmy systemu szablonów Django, aby oddzielić design od Pythona tworząc szablon, który będzie mógł użyć widok.
zh_hans: 这里有个问题：页面的设计写死在视图函数的代码里的。如果你想改变页面的样子，你需要编辑 Python 代码。所以让我们使用 Django 的模板系统，只要创建一个视图，就可以将页面的设计从代码中分离出来。

source: First, create a directory called ``templates`` in your ``polls`` directory. Django will look for templates in there.
el: Για αρχή, δημιουργήστε ένα φάκελο με το όνομα ``templates`` κάτω από τον φάκελο ``polls``. Το Django θα κοιτάξει για templates εκεί.
it: Per prima cosa, crea una directory chiamata ``templates`` nella tua directory ``polls``. Django cercherà i templates lì dentro.
ja: 最初に、 ``polls`` ディレクトリの中に、 ``templates`` ディレクトリを作成します。 Django はそこからテンプレートを探します。
pl: Najpierw stwórzmy katalog o nazwie ``templates`` w twoim katalogu ``polls``. Django będzie tam szukał szablonów.
zh_hans: 首先，在你的 ``polls`` 目录里创建一个 ``templates`` 目录。Django 将会在这个目录里查找模板文件。

source: Your project's :setting:`TEMPLATES` setting describes how Django will load and render templates. The default settings file configures a ``DjangoTemplates`` backend whose :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` option is set to ``True``. By convention ``DjangoTemplates`` looks for a "templates" subdirectory in each of the :setting:`INSTALLED_APPS`.
el: Η ρύθμιση :setting:`TEMPLATES` του project σας περιγράφει πως το Django θα φορτώνει και θα κάνει render τα templates. Η προεπιλεγμένη ρύθμιση στο αρχείο settings παραμετροποιεί το ``DjangoTemplates`` backend του οποίου η ρύθμιση :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` είναι ρυθμισμένη στο ``True``. Έτσι, το ``DjangoTemplates`` ψάχνει για ένα υπό-φάκελο "templates" σε κάθε εφαρμογή (app) που είναι περασμένη στη ρύθμιση :setting:`INSTALLED_APPS`.
it: L'impostazione :setting:`TEMPLATES` del tuo progetto descrive come Django caricherà e mostrerà i template. Il file di impostazioni di default configura un backend `DjangoTemplates`` la cui opzione :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` è impostata a True. Per convenzione ``DjangoTemplates`` cerca una sottocartella "templates" in ognuna delle :setting:`INSTALLED_APPS`.
ja: Django がどのようにテンプレートをロードしレンダリングするかについて、プロジェクトの :setting:`TEMPLATES` の設定を説明します。デフォルトの ``DjangoTemplates`` の設定ファイルは、 :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` のオプションが ``True`` に設定されています。設定により、 ``DjangoTemplates`` は :setting:`INSTALLED_APPS` のそれぞれのサブディレクトリの "templates" を検索します。
pl: Ustawienie :setting:`TEMPLATES` twojego projektu opisuje jak Django będzie ładował i renderował szablony. Domyślny plik ustawień konfiguruje backend ``DjangoTemplates``, którego opcja :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` jest ustawiona na ``True``. Według konwencji ``DjangoTemplates`` szuka podkatalogu „templates” w każdej z :setting:`INSTALLED_APPS`.
zh_hans: 你项目的 :setting:`TEMPLATES` 配置项描述了 Django 如何载入和渲染模板。默认的设置文件设置了 ``DjangoTemplates`` 后端，并将 :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` 设置成了 True。这一选项将会让 ``DjangoTemplates`` 在每个 :setting:`INSTALLED_APPS` 文件夹中寻找 "templates" 子目录。这就是为什么尽管我们没有像在第二部分中那样修改 DIRS 设置，Django 也能正确找到 polls 的模板位置的原因。

source: Within the ``templates`` directory you have just created, create another directory called ``polls``, and within that create a file called ``index.html``. In other words, your template should be at ``polls/templates/polls/index.html``. Because of how the ``app_directories`` template loader works as described above, you can refer to this template within Django simply as ``polls/index.html``.
el: Μέσα στο φάκελο ``templates`` που μόλις δημιουργήσατε, δημιουργήστε άλλο έναν φάκελο με το όνομα ``polls`` και μέσα σε αυτό το φάκελο ένα HTML αρχείο με το όνομα ``index.html``. Με άλλα λόγια, το template σας θα πρέπει να βρίσκεται στο ``polls/templates/polls/index.html``. Λόγω του μηχανισμού λειτουργίας του φορτωτή template (template loader) ``app_directories`` όπως αναφέρθηκε παραπάνω, μπορείτε να αναφερθείτε σε αυτό το template μέσα στο Django ως ``polls/index.html``.
ja: 先ほど作成した ``templates`` ディレクトリ内では、 ``polls`` と呼ばれる別のディレクトリを作成し、その中に ``index.html`` というファイルを作成します。つまり、テンプレートは ``polls/templates/polls/index.html`` にする必要があります。そのため、 ``app_directories`` テンプレートローダは前述したように、Django 内でこのテンプレートを ``polls/index.html`` として参照することができます。
pl: W katalogu ``templates``, który właśnie stworzyłeś, stwórz kolejny katalog o nazwie ``polls`` i w tym katalogu stwórz plik o nazwie ``index.html``. Innymi słowy, twój szablon powinien być pod ``polls/templates/polls/index.html``. Ponieważ loader szablonów ``app_directories`` działa jak opisano powyżej, możesz odwoływać się do tego szablonu w Django po prostu ``polls/index.html``.
zh_hans: 在你刚刚创建的 ``templates`` 目录里，再创建一个目录 ``polls``，然后在其中新建一个文件 ``index.html`` 。换句话说，你的模板文件的路径应该是 ``polls/templates/polls/index.html`` 。因为 Django 会寻找到对应的 ``app_directories`` ，所以你只需要使用 ``polls/index.html`` 就可以引用到这一模板了。

source: Template namespacing
it: Spazio nomi template
ja: テンプレートの名前空間
pl: Przestrzeń nazw szablonu
zh_hans: 模板命名空间

source: Now we *might* be able to get away with putting our templates directly in ``polls/templates`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first template it finds whose name matches, and if you had a template with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those templates inside *another* directory named for the application itself.
el: *Ίσως* θα αναρωτηθήκατε γιατί βάλαμε το template μέσα σε υπό-φάκελο (polls) και όχι μέσα στο φάκελο ``polls/templates``. Αν το κάναμε έτσι, τότε δεν θα ήταν και τόσο καλή ιδέα. Το Django θα ψάξει και θα βρει το πρώτο template βάση ονόματος. Αν, λοιπόν, εσείς έχετε ένα άλλο template με το ίδιο όνομα σε μία *διαφορετική* εφαρμογή, τότε το Django δεν θα είναι σε θέση να ξεχωρίσει ποια από τα δύο να χρησιμοποιήσει. Πρέπει καθοδηγήσουμε το Django στην επιλογή του template που θέλουμε και ο ευκολότερος τρόπος είναι να χρησιμοποιήσουμε την τεχνική *namespace*. Αυτό επιτυγχάνεται βάζοντας τα templates μέσα σε έναν *υπό-φάκελο* ο οποίος θα έχει το ίδιο όνομα με το όνομα της εφαρμογής.
ja: 作ったテンプレートを ``polls`` という別のサブディレクトリを作らずに、直接 ``polls/templates`` の中に置いてもいいのではないか、と思うかもしれませんね。しかし、それは実際には悪い考えです。Django は、名前がマッチした最初のテンプレートを使用するので、もし *異なる* アプリケーションの中に同じ名前のテンプレートがあった場合、Django はそれらを区別することができません。そのため、Django に正しいテンプレートを教えてあげる必要がありますが、一番簡単な方法は、それらに *名前空間を与える* ことです。アプリケーションと同じ名前をつけた *もう一つの* ディレクトリの中にテンプレートを置いたのは、そういうわけなのです。
pl: Teraz *moglibyśmy* poradzić sobie umieszczając nasze szablony bezpośrednio w ``polls/templates`` (zamiast tworzyć kolejny podkatalog ``polls``), ale w rzeczywistości byłoby to złym pomysłem. Django wybierze pierwszy szablon, którego nazwa się zgadza i jeśli miałbyś szablon o takiej samej nazwie w *innej* aplikacji, Django nie byłoby w stanie ich odróżnić. Musimy być w stanie wskazać Django odpowiedni szablon i najprostszym sposobem, aby to zapewnić jest *znamespace'owanie* ich. To znaczy umieszczenie tych szablonów w *innym* katalogu nazwanym dla samej aplikacji.
zh_hans: 虽然我们现在可以将模板文件直接放在 ``polls/templates`` 文件夹中（而不是再建立一个 ``polls`` 子文件夹），但是这样做不太好。Django 将会选择第一个匹配的模板文件，如果你有一个模板文件正好和另一个应用中的某个模板文件重名，Django 没有办法 *区分* 它们。我们需要帮助 Django 选择正确的模板，最简单的方法就是把他们放入各自的 *命名空间* 中，也就是把这些模板放入一个和 *自身* 应用重名的子文件夹里。

source: Put the following code in that template:
el: Βάλτε τον ακόλουθο κώδικα στο template:
it: Inserisci il seguente codice nel template:
ja: テンプレートには次のコードを書きます:
pl: Umieść następujący kod w tym szablonie:
zh_hans: 将下面的代码输入到刚刚创建的模板文件中：

source: Now let's update our ``index`` view in ``polls/views.py`` to use the template:
el: Τώρα, ας ανανεώσουμε το ``index`` view μέσα στο αρχείο ``polls/views.py`` ούτως ώστε να χρησιμοποιήσει το νέο μας template:
it: Ora aggiorniamo la nostra vista ``index`` in ``polls/views.py`` per utilizzare il modello:
ja: テンプレートを使用するために ``polls/views.py`` の ``index`` ビューを更新してみましょう:
pl: Teraz zaktualizujmy nasz widok ``index`` w ``polls/views.py``, aby używał szablonu:
zh_hans: 然后，让我们更新一下 ``polls/views.py`` 里的 ``index`` 视图来使用模板：

source: That code loads the template called ``polls/index.html`` and passes it a context. The context is a dictionary mapping template variable names to Python objects.
el: Αυτός ο κώδικας φορτώνει το template με το όνομα ``polls/index.html`` και περνάει σε αυτό ένα context. Το context είναι ένα dictionary το οποίο αντιστοιχεί template variable ονόματα σε Python objects.
it: Il codice carica il template chiamato ``polls/index.html`` e gli passa un context. Il context è un dizionario che associa i nomi delle variabili nel template agli oggetti Python.
ja: このコードは、 ``polls/index.html`` というテンプレートをロードし、コンテキストを渡します。コンテキストは、テンプレート変数名を Python オブジェクトへのマッピングしている辞書です。
pl: Ten kod ładuje szablon o nazwie ``polls/index.html`` i przekazuje mu kontekts. Kontekst jest słownikiem mapującym nazwy zmiennych szablonu do obiektów Pythona.
zh_hans: 上述代码的作用是，载入 ``polls/index.html`` 模板文件，并且向它传递一个上下文(context)。这个上下文是一个字典，它将模板内的变量映射为 Python 对象。

source: Load the page by pointing your browser at "/polls/", and you should see a bulleted-list containing the "What's up" question from :doc:`Tutorial 2 </intro/tutorial02>`. The link points to the question's detail page.
el: Πηγαίνετε στη σελίδα με το browser σας στο "/polls/" και θα πρέπει να δείτε μια λίστα (με κουκίδες) η οποία περιέχει την ερώτηση "What's up" που φτιάξαμε στον :doc:`Οδηγό 2 </intro/tutorial02>`. Το link δείχνει στην σελίδα με τις λεπτομέρειες της ερώτησης.
it: Carica la pagina puntando il browser su "/polls/", e dovresti vedere una lista puntata che contiene la domanda "Come va" dal :doc:`Tutorial 2 </intro/tutorial02>`. Il link punta alla pagina di dettaglio della domanda.
ja: ブラウザで "/polls/" を開くと、 :doc:`チュートリアルその2 </intro/tutorial02>` で作った、 "What's up" という質問の入ったブレットリストを表示します。リンクは質問の詳細ページを指します。
pl: Załaduj stronę kierując swoją przeglądarkę na „/polls/”. Powinnieneś zobaczyć wypunktowaną listę zawierającą pytanie „What's up” z :doc:`Tutoriala 2 </intro/tutorial02>`. Link kieruje do strony szczegółów pytania.
zh_hans: 用你的浏览器访问 "/polls/" ，你将会看见一个无序列表，列出了我们在 :doc:`教程第 2 部分 </intro/tutorial02>` 中添加的 “What's up” 投票问题，链接指向这个投票的详情页。

source: A shortcut: :func:`~django.shortcuts.render`
el: Η συντόμευση: :func:`~django.shortcuts.render`
it: Una scorciatoia: :func:`~django.shortcuts.render`
ja: ショートカット: :func:`~django.shortcuts.render`
pl: Skrót: :func:`~django.shortcuts.render`
zh_hans: 一个快捷函数： :func:`~django.shortcuts.render`

source: It's a very common idiom to load a template, fill a context and return an :class:`~django.http.HttpResponse` object with the result of the rendered template. Django provides a shortcut. Here's the full ``index()`` view, rewritten:
el: Είναι πολύ συνηθισμένο να φορτώνεται ένα template, να γεμίζεται ένα context και να επιστρέφεται ένα :class:`~django.http.HttpResponse` object του οποίου το αποτέλεσμα θα είναι το rendered template. Το Django παρέχει μια συντόμευση για όλα αυτά. Ορίστε πάλι το ``index()`` view, γραμμένο από την αρχή:
it: E' un idioma molto comune per caricare un template, quello di riempire un context e restituire un oggetto :class:`~django.http.HttpResponse` con il risultato del template mostrato. Django fornisce una scorciatoia. Ecco la view ``index()`` completa, riscritta::
ja: テンプレートをロードしてコンテキストに値を入れ、テンプレートをレンダリングした結果を :class:`~django.http.HttpResponse` オブジェクトで返す、というイディオムは非常によく使われます。 Django はこのためのショートカットを提供します。これを使って ``index()`` ビューを書き換えてみましょう:
pl: To popularny idiom do ładowania szablonu, wypełniania kontekstu i zwracania obiektu :class:`~django.http.HttpResponse` z wynikiem wyrenderowanego szablonu. Djano daje skrót. Tutaj jest pełen widok ``index()``, napisany na nowo:
zh_hans: 「载入模板，填充上下文，再返回由它生成的 :class:`~django.http.HttpResponse` 对象」是一个非常常用的操作流程。于是 Django 提供了一个快捷函数，我们用它来重写 ``index()`` 视图：

source: Note that once we've done this in all these views, we no longer need to import :mod:`~django.template.loader` and :class:`~django.http.HttpResponse` (you'll want to keep ``HttpResponse`` if you still have the stub methods for ``detail``, ``results``, and ``vote``).
el: Σημειώστε ότι, αφού χρησιμοποιήσουμε την :func:`~django.shortcuts.render` για *όλες* τις views, δεν χρειάζεται πλέον να κάνουμε import τα :mod:`~django.template.loader` και :class:`~django.http.HttpResponse`. Παραταύτα, θα χρειαστεί να κρατήσετε το ``HttpResponse`` αν έχετε ακόμη τις μεθόδους για το``detail``, ``results`` και ``vote`` view.
it: Nota che una volta che abbiamo fatto questo in tutte le view, non abbiamo più bisogno di importare :mod:`~django.template.loader` e :class:`~django.http.HttpResponse` (potresti voler tenere ``HttpResponse`` nel caso tu non abbia ancora i metodi stub per ``detail``, ``results`` e ``vote``).
ja: この作業によって、 :mod:`~django.template.loader` や :class:`~django.http.HttpResponse` ( ``detail`` 、 ``results`` や ``vote`` のスタブメソッドがある場合は ``HttpResponse`` のままにします) を import する必要はなくなりました。
pl: Zwróć uwagę, że kiedy zrobiliśmy to w tych wszystkich widokach, nie potrzebujemy już importować :mod:`~django.template.loader` i :class:`~django.http.HttpResponse` (będziesz chciał zatrzymać ``HttpResponse`` jeśli wciąż masz zaczątki metod dla ``detail``, ``results`` i ``vote``).
zh_hans: 注意到，我们不再需要导入 :mod:`~django.template.loader` 和 :class:`~django.http.HttpResponse` 。不过如果你还有其他函数（比如说 ``detail``, ``results``, 和 ``vote`` ）需要用到它的话，就需要保持 ``HttpResponse`` 的导入。

source: The :func:`~django.shortcuts.render` function takes the request object as its first argument, a template name as its second argument and a dictionary as its optional third argument. It returns an :class:`~django.http.HttpResponse` object of the given template rendered with the given context.
el: Η συνάρτηση :func:`~django.shortcuts.render` παίρνει ως πρώτο όρισμα το request object, ως δεύτερο το όνομα του template και ένα dictionary ως τρίτο προαιρετικό. Επιστρέφει ένα :class:`~django.http.HttpResponse` object του δηλωθέν template το οποίο template έχει γίνει rendered βάση του δοθέν context.
it: La funzione :func:`~django.shortcuts.render` prende l'oggetto request come primo argomento, un nome di template come secondo argomento ed un dizionario come terzo argomento opzionale. Restituisce un oggetto :class:`~django.http.HttpResponse` del template dato reso con il contesto dato.
ja: :func:`~django.shortcuts.render` 関数は、第1引数として request オブジェクト、第2引数としてテンプレート名、第3引数としてその他のオプション辞書を受け取ります。この関数はテンプレートを指定のコンテキストでレンダリングし、 :class:`~django.http.HttpResponse` オブジェクトを返します。
pl: Funkcja :func:`~django.shortcuts.render` bierze obiekt request jako swój pierwszy argument, nazwę szablonu jako drugi argument i słownik jako swój opcjonalny trzeci argument. Zwraca obiekt :class:`~django.http.HttpResponse` danego szablonu wyrenderowany z danym kontekstem.
zh_hans: :func:`~django.shortcuts.render` 函数的第一个参数是一个请求 :class:`~django.http.HttpResponse` 对象，第二个参数是需要载入的模板的名字。第三个参数是需要用于渲染模板的上下文字典，这个参数是可选的。函数返回一个 :class:`~django.http.HttpResponse` 对象，内容为指定模板用指定上下文渲染后的结果。

source: Raising a 404 error
el: Raising σφάλμα 404
it: Generazione di un errore 404
ja: 404 エラーの送出
pl: Zgłaszanie błędu 404
zh_hans: 抛出 404 错误

source: Now, let's tackle the question detail view -- the page that displays the question text for a given poll. Here's the view:
el: Σε αυτό το σημείο θα πειράξουμε το view που αφορά στις λεπτομέρειες μιας ερώτησης -- τη σελίδα, δηλαδή, η οποία εμφανίζει την ερώτηση για μια συγκεκριμένη ψηφοφορία. Αυτό είναι το view:
it: Adesso affrontiamo la questione della view del dettaglio -- la pagina che mostra il testo della domanda per un dato sondaggio. Ecco la view:
ja: 指定された投票の質問文を表示するページの詳細ビューを片付けましょう。ビューは次のようになります:
pl: Teraz zawalczmy z widokiem szczegółów pytania – strony, która wyświetla treść pytania dla danej ankiety. Tutaj jest widok:
zh_hans: 现在，我们来处理投票详情视图——它会显示指定投票的问题标题。下面是这个视图的代码：

source: The new concept here: The view raises the :exc:`~django.http.Http404` exception if a question with the requested ID doesn't exist.
el: Το νέο concept εδώ είναι: Το view κάνει raise την exception :exc:`~django.http.Http404` αν η ερώτηση με το συγκεκριμένο ID δεν υπάρχει (στη βάση δεδομένων).
it: Il concetto nuovo qui: La view solleva l'eccezione :exc:`~django.http.Http404` se non esiste un sondaggio con l'ID richiesto.
ja: 新しい概念がでて来ました。このビューはリクエストした ID を持つ質問が存在しないときに :exc:`~django.http.Http404` を送出します。
pl: Nowy koncept tutaj: Widok zgłasza wyjątek :exc:`~django.http.Http404` jeśli pytanie o żądanym ID nie istnieje.
zh_hans: 这里有个新原则。如果指定问题 ID 所对应的问题不存在，这个视图就会抛出一个 :exc:`~django.http.Http404` 异常。

source: We'll discuss what you could put in that ``polls/detail.html`` template a bit later, but if you'd like to quickly get the above example working, a file containing just:
el: Θα συζητήσουμε τι μπορείτε να βάλετε μέσα στο template με το όνομα ``polls/detail.html`` λίγο αργότερα, αλλά τώρα αν βιάζεστε να δείτε πως θα φαίνεται γράψτε τα ακόλουθα στο αρχείο ``polls/detail.html``:
it: Discuteremo cosa potresti mettere in quel template ``polls/detail.html`` un po' più tardi, ma se ti piacerebbe avere l'esempio di cui sopra funzionale in un tempo rapido, un file che contiene solo:
ja: ``polls/detail.html`` テンプレートに何を書けばよいかは後で解説しますが、さしあたって上の例題を動かしたければ、さ しあたって上の例題を動かしたければ、単に:
pl: Omówimy trochę później co mógłbyś umieścić w tym szablonie ``polls/detail.html``, ale jeśli chcesz, aby powyższy przykład szybko zaczął działać, plik zawierający tylko:
zh_hans: 我们稍后再讨论你需要在 ``polls/detail.html`` 里输入什么，但是如果你想试试上面这段代码是否正常工作的话，你可以暂时把下面这段输进去：

source: will get you started for now.
el: Αυτό θα σας δώσει μια ιδέα.
it: ti farà iniziare per ora.
ja: と書いておいてください。
pl: pomoże ci wystartować na teraz.
zh_hans: 这样你就能测试了。
