Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: For more information on model relations, see :doc:`Accessing related objects </ref/models/relations>`. For more on how to use double underscores to perform field lookups via the API, see :ref:`Field lookups <field-lookups-intro>`. For full details on the database API, see our :doc:`Database API reference </topics/db/queries>`.
el: Για περισσότερες πληροφορίες σχετικά με τις συσχετίσεις των μοντέλων, δείτε στο άρθρο :doc:`Πρόσβαση συσχετισμένων objects </ref/models/relations>`. Για περισσότερες πληροφορίες σχετικά με το πώς να χρησιμοποιείτε τη διπλή κάτω παύλα για queries στην db μέσω του API, δείτε στο άρθρο :ref:`Αναζητήσεις στα fields <field-lookups-intro>`. Για περισσότερες λεπτομέρειες σχετικά με το database API, δείτε το άρθρο :doc:`Αναφορά στο Database API </topics/db/queries>`.
it: Per avere più informazioni sulle relazioni dei modelli, vedi :doc:`Accesso agli oggetti collegati </ref/models/relations>`. Per saperne di più su come usare il doppio underscore per fare field lookup con le API, vedi :ref:`Field lookups <field-lookups-intro>`. Per tutti i dettagli sulle API del database, vedi la nostra :doc:`Database API reference </topics/db/queries>`.
ja: モデルのリレーションについては :doc:`リレーション先オブジェクトにアクセスする </ref/models/relations>` を参照してください。 API を通じた、フィールドルックアップのためのダブルアンダースコアの使い方は :ref:`フィールドルックアップ <field-lookups-intro>` を参照してください。データーベース API の詳細は :doc:`データベース API リファレンス </topics/db/queries>` を参照してください。
pl: Po więcej informacji na temat relacji między modelami, zobacz :doc:`Dostęp do powiązanych obiektów </ref/models/relations>`.
zh_hans: 阅读 :doc:`访问关系对象 </ref/models/relations>` 文档可以获取关于数据库关系的更多内容。想知道关于双下划线的更多用法，参见 :ref:`查找字段 <field-lookups-intro>` 文档。数据库 API 的所有细节可以在 :doc:`数据库 API 参考 </topics/db/queries>` 文档中找到。

source: Introducing the Django Admin
el: Εισαγωγή στο Django Admin
it: Presentazione dell'Amministrazione di Django
ja: Django Adminの紹介
pl: Wprowadzenie do panelu administracyjnego Django
zh_hans: 介绍 Django 管理页面

source: Generating admin sites for your staff or clients to add, change, and delete content is tedious work that doesn't require much creativity. For that reason, Django entirely automates creation of admin interfaces for models.
el: Η δημιουργία των διαχειριστικών ιστοσελίδων (admin sites) για το προσωπικό σας ή τους πελάτες σας (ή ακόμη και για σας τον ίδιο) προκειμένου να προσθέσετε, αλλάξετε ή να διαγράψετε περιεχόμενο είναι μια ανιαρή διαδικασία η οποία δεν χρειάζεται και πολύ δημιουργικότητα. Για το λόγο αυτό το Django αυτοματοποιεί πλήρως την δημιουργία του διαχειριστικού interface για τα μοντέλα σας.
it: Generare un sito di amministrazione affinchè il tuo staff o i tuoi clienti possano aggiungere, cambiare e cancellare contenuti è un lavoro noioso e che non richiede molta creatività. Per questa ragione, Django automatizza interamente la creazione delle interfacce di amministrazione per i modelli.
ja: あなたのスタッフや顧客のためのコンテンツ追加、変更そして削除のための管理サイトの生成は、創造性を要求されない退屈な仕事です。そのため、Djangoはモデルのための管理インタフェース群の生成を完全に自動化します。
pl: Wygenerowanie strony administracyjnej dla pracowników lub klientów do dodawania, zmieniania i usuwania treści jest żmudną pracą, która nie wymaga dużo kreatywności. Z tego powodu Django całkowicie automatyzuje tworzenie interfejsu administracyjnego.
zh_hans: 为你的员工或客户生成一个用户添加，修改和删除内容的后台是一项缺乏创造性和乏味的工作。因此，Django 全自动地根据模型创建后台界面。

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site. Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site. Django solves the problem of creating a unified interface for site administrators to edit content.
el: Το Django έχει γραφτεί σε ένα ειδησεογραφικό περιβάλλον, με πλήρη διαχωρισμό των εννοιών "εκδότες περιεχομένου" και "δημόσιο" site. Οι site managers χρησιμοποιούν το σύστημα για να εισάγουν νέα γεγονότα, αποτελέσματα αγώνων κλπ και αυτό το περιεχόμενο προβάλλεται στο "δημόσιο" site. Το Django λύνει το πρόβλημα της δημιουργίας ενός ενοποιημένου interface για τους site administrators με σκοπό την επεξεργασία του περιεχομένου.
it: Django è stato scritto in un ambiente di redazione, con una netta separazione tra gli "editori di contenuti" e il sito "pubblico". I gestori del sito utilizzano il sistema per aggiungere notizie, eventi, risultati sportivi, ecc. e il contenuto viene visualizzato sul sito pubblico. Django risolve il problema della creazione di un'interfaccia unificata per gli amministratori del sito per modificare i contenuti.
ja: Django はニュースルーム環境で開発されました。ニュースルーム環境では、 「コンテンツの作成者 (content publisher)」と「公開 (public) 」サイトをきわめて明確に区別しています。サイト管理者は新たな話題やイベント、 スポーツのスコアなどの入力にシステムを使い、コンテンツは公開用サイト上で表示されます。 Django は、サイト管理者向けの一元化されたコンテンツ編集インタフェースを提供しています。
pl: Django było pisane w środowisku publicystów, z bardzo wyraźnym oddzieleniem „wydawców treści” i „publiczną” witryną. Managerowie stron korzystają z systemu, aby dodać nowe historie, wydarzenia, wyniki sportowe, itp. i ta zawartość jest wyświetlana na publicznej witrynie. Django rozwiązuje problem tworząc jednolity interfejs dla administratorów witryn do edycji treści.
zh_hans: Django 产生于一个公众页面和内容发布者页面完全分离的新闻类站点的开发过程中。站点管理人员使用管理系统来添加新闻、事件和体育时讯等，这些添加的内容被显示在公众页面上。Django 通过为站点管理人员创建统一的内容编辑界面解决了这个问题。

source: The admin isn't intended to be used by site visitors. It's for site managers.
el: Το admin site δεν είναι σχεδιασμένο για να χρησιμοποιηθεί από τους επισκέπτες της ιστοσελίδας σας. Είναι μόνο για αυτούς που θα διαχειρίζονται το site (site managers).
it: L'amministratore non è concepito per essere utilizzato dai visitatori del sito. È per coloro che gestiscono il sito.
ja: admin はサイトの訪問者でなく、サイト管理者に使われることを意図しています。
pl: Panel administracyjny nie jest przeznaczony do użycia przez odwiedzających stronę. Jest dla menadżerów witryny.
zh_hans: 管理界面不是为了网站的访问者，而是为管理者准备的。

source: Creating an admin user
el: Δημιουργώντας έναν χρήστη admin
it: Creazione di un utente amministratore
ja: 管理ユーザーを作成する
pl: Tworzenie konta administratora
zh_hans: 创建一个管理员账号

source: First we'll need to create a user who can login to the admin site. Run the following command:
el: Πρώτα απ’όλα θα χρειαστεί να δημιουργήσουμε έναν χρήστη ο οποίος θα έχει πρόσβαση στο διαχειριστικό περιβάλλον (admin site). Τρέξτε την εντολή:
it: Per prima cosa dobbiamo creare un utente che possa accedere al sito di amministrazione. Esegui il seguente comando:
ja: まず最初に私達はadminサイトにログインできるユーザーを作成する必要があります。下記のコマンドを実行します:
pl: Najpierw musimy stworzyć użytkownika, który może logować się do panelu administracyjnego. Uruchom następującą komendę:
zh_hans: 首先，我们得创建一个能登录管理页面的用户。请运行下面的命令：

source: Enter your desired username and press enter.
el: Γράψτε το επιθυμητό όνομα χρήστη (username) και πιέστε enter.
it: Inserisci la username scelta e premi enter.
ja: 好きなユーザー名を入力しEnterを押してください。
pl: Wprowadź swoją pożądaną nazwę użytkownika i naciśnij enter.
zh_hans: 键入你想要使用的用户名，然后按下回车键：

source: You will then be prompted for your desired email address:
el: Μετά θα πρέπει να γράψετε μια διεύθυνση email:
it: Ti verrà quindi chiesto di inserire l'indirizzo email desiderato:
ja: 希望するemailアドレスを入力するよう促されます:
pl: Zostaniesz poproszony o swój adres e-mail:
zh_hans: 然后提示你输入想要使用的邮件地址：

source: The final step is to enter your password. You will be asked to enter your password twice, the second time as a confirmation of the first.
el: Το τελευταίο βήμα είναι η επιλογή ενός συνθηματικού (password). Θα κληθείτε να γράψετε το συνθηματικό σας δύο φορές, (η δεύτερη φορά αποτελεί επιβεβαίωση της πρώτης).
it: Il passaggio finale è inserire la tua password. Ti verrà chiesto di inserire la tua password due volte, la seconda come conferma della prima.
ja: 最後のステップはパスワードの入力です。2回目のパスワードが1回目と同じことを確認するため、パスワードの入力を2回求められます。
pl: Ostatnim krokiem jest wprowadzenie hasła. Zostaniesz poproszony o wprowadzenie swojego hasła dwa razy, drugi raz na potwierdzenie pierwszego.
zh_hans: 最后一步是输入密码。你会被要求输入两次密码，第二次的目的是为了确认第一次输入的确实是你想要的密码。

source: Start the development server
el: Εκκίνηση του development server
it: Avvia il server di sviluppo
ja: 開発サーバーの起動
pl: Uruchom serwer deweloperski
zh_hans: 启动开发服务器

source: The Django admin site is activated by default. Let's start the development server and explore it.
el: Το Django admin site είναι ενεργό από προεπιλογή. Ας τρέξουμε τον development server και ας το εξερευνήσουμε.
it: Il sito di amministrazione di Django è attivato di default. Avviamo il server di sviluppo ed esploriamolo.
ja: Django adminサイトはデフォルトで有効化されます。開発サーバーを起動して探索を始めましょう。
pl: Panel administracyjny Django jest domyślnie uruchomiony. Uruchommy serwer deweloperski i poznajmy go.
zh_hans: Django 的管理界面默认就是启用的。让我们启动开发服务器，看看它到底是什么样的。

source: If the server is not running start it like so:
el: Αν ο server δεν τρέχει, ξεκινήστε τον με την εντολή:
it: Se il server non è in esecuzione, avvialo con:
ja: もしサーバーが起動していなかったら、このようにして起動しましょう:
pl: Jeśli serwer nie jest uruchomiony, wystartuj go w ten sposób:
zh_hans: 如果开发服务器未启动，用以下命令启动它：

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/. You should see the admin's login screen:
el: Τώρα, ανοίξτε έναν Web browser και μεταβείτε στη σελίδα "/admin/" στο local domain σας -- π.χ, http://127.0.0.1:8000/admin/. Θα πρέπει να δείτε την login οθόνη της Django admin σελίδας:
it: Ora apri un browser Web e vai a "/admin/" sul tuo dominio locale, ad esempio http://127.0.0.1:8000/admin/. Dovresti vedere la schermata di accesso dell'amministratore:
ja: 次はブラウザを起動して、ローカルドメインの “/admin/” 、つまり http://127.0.0.1:8000/admin/ にアクセスします。以下のような admin のログイ ン画面が表示されるはずです:
pl: Teraz otwórz przeglądarkę internetową i wejdź na „/admin/” swojej lokalnej domeny – na przykład http://127.0.0.1:8000/admin/. Powinieneś zobaczyć ekran logowania panelu administracyjnego:
zh_hans: 现在，打开浏览器，转到你本地域名的 "/admin/" 目录， -- 比如 "http://127.0.0.1:8000/admin/" 。你应该会看见管理员登录界面：

source: Since :doc:`translation </topics/i18n/translation>` is turned on by default, the login screen may be displayed in your own language, depending on your browser's settings and if Django has a translation for this language.
el: Επειδή η :doc:` μετάφραση </topics/i18n/translation>` είναι ενεργοποιημένη από προεπιλογή, πιθανόν η οθόνη εισόδου (login screen) να είναι στην δική σας γλώσσα, ανάλογα τις ρυθμίσεις γλώσσας του browser σας (θα πρέπει η Ελληνική γλώσσα να βρίσκεται πρώτη στη λίστα) και αν το Django υποστηρίζει την γλώσσα σας (σίγουρα υποστηρίζει την Ελληνική).
ja: :doc:`translation </topics/i18n/translation>`はデフォルトでonになっています。 あなたのブラウザの設定とDjangoの翻訳状況によって、ログインスクリーンはあなたの言語で表示されるかもしれません。
pl: :doc:`Tłumaczenie </topics/i18n/translation>` jest domyślnie włączone, więc ekran logowania może zostać wyświetlony w twoim języku, zależnie od ustawień twojej przeglądarki i jeśli Django ma tłumaczenie dla tego języka.
zh_hans: 因为 :doc:`翻译 </topics/i18n/translation>` 功能默认是开着的，所以登录界面可能会使用你的语言，取决于你浏览器的设置和 Django 是否拥有你语言的翻译。

source: Enter the admin site
el: Επίσκεψη στο admin site
it: Accedi al sito di amministrazione
ja: admin サイトに入る
pl: Wejście do panelu administracyjnego
zh_hans: 进入管理站点页面

source: Now, try logging in with the superuser account you created in the previous step. You should see the Django admin index page:
el: Προσπαθήστε τώρα να κάνετε login με τα credentials που δώσατε πριν. Θα πρέπει να δείτε την αρχική σελίδα του Django admin:
it: Ora prova ad accedere con l'account superutente che hai creato nel passaggio precedente. Dovresti vedere la pagina principale di Django admin:
ja: 今回は、前のステップで作成したスーパーユーザーのアカウントでログインを試してみましょう。Django adminのインデックスページが表示されるはずです:
pl: Teraz spróbuj się zalogować kontem superusera, które stworzyłeś w poprzednim kroku. Powinieneś zobaczyć stronę główną panelu administracyjnego Django:
zh_hans: 现在，试着使用你在上一步中创建的超级用户来登录。然后你将会看到 Django 管理页面的索引页：

source: You should see a few types of editable content: groups and users. They are provided by :mod:`django.contrib.auth`, the authentication framework shipped by Django.
el: Θα πρέπει να δείτε μερικούς τύπους περιεχομένου οι οποίοι μπορούν να επεξεργαστούν: ομάδες (groups) και χρήστες (users). Αυτοί παρέχονται από το authentication framework :mod:`django.contrib.auth`, το οποίο έρχεται προεγκατεστημένο με το Django.
it: Dovresti vedere alcuni tipi di contenuto modificabile: gruppi e utenti. Sono forniti da :mod:`django.contrib.auth`, il framework di autenticazione fornito da Django.
ja: groupsとusersといういくつかのタイプの編集可能なコンテンツが閲覧できるはずです。これらはDjangoに含まれる認証フレームワーク :mod:`django.contrib.auth` によって提供されます。
pl: Powinieneś zobaczyć kilka typów modyfikowalnej treści: grupy i użytkowników. Pochodzą one z :mod:`django.contrib.auth`, frameworka uwierzytelniania Django.
zh_hans: 你将会看到几种可编辑的内容：组和用户。它们是由 :mod:`django.contrib.auth` 提供的，这是 Django 开发的认证框架。

source: Make the poll app modifiable in the admin
el: Κάντε την εφαρμογή σας (poll) τροποποιήσιμη στο admin
it: Rendi l'applicazione Sondaggi modificabile nell'amministrazione
ja: Poll アプリを admin 上で編集できるようにする
pl: Udostępnij aplikację ankietową do modyfikowania w panelu administracyjnym
zh_hans: 向管理页面中加入投票应用

source: But where's our poll app? It's not displayed on the admin index page.
el: Φαίνεται όμως να λείπει η εφαρμογή μας. Δεν εμφανίζεται καθόλου στο διαχειριστικό site.
it: Ma dov'è la nostra app per i sondaggi? Non viene visualizzato nella pagina principale dell'amministratore.
ja: ところで、 polls アプリはどこにあるんでしょう？ admin のインデクスページを見ても表示されていませんね。
pl: Ale gdzie jest nasza aplikacja ankietowa? Nie wyświetla się na stronie głównej panelu.
zh_hans: 但是我们的投票应用在哪呢？它没在索引页面里显示。

source: Just one thing to do: we need to tell the admin that ``Question`` objects have an admin interface. To do this, open the :file:`polls/admin.py` file, and edit it to look like this:
el: Έχει μείνει μόνο ένα πράγμα να κάνουμε: θα πρέπει να πούμε στο admin ότι τα``Question`` objects θα έχουν admin interface. Για να το κάνετε αυτό, ανοίξτε το αρχείο :file:`polls/admin.py` και επεξεργαστείτε το ούτως ώστε να δείχνει κάπως έτσι:
ja: やるべきことは一つです: adminに"Question"オブジェクト達はadmin インタフェースを持つことを伝える必要があります。これを行うために、ファイル :file:`polls/admin.py` を開いてこのように編集しましょう:
pl: Jest do zrobienia tylko jedna rzecz: musimy powiedzieć panelowi, że obiekty ``Question`` mają interfejs administracyjny. Aby to zrobić, otwórz plik :file:`polls/admin.py` i zmień go, aby wyglądał tak:
zh_hans: 只需要做一件事：我们得告诉管理页面，问题 ``Question`` 对象需要被管理。打开 :file:`polls/admin.py` 文件，把它编辑成下面这样：

source: Explore the free admin functionality
el: Εξερευνήστε την δωρεάν διαχειριστική λειτουργία
it: Esplora la funzionalità disponibili nell'amministrazione
ja: admin の機能を探究してみる
pl: Poznaj funkcjonalność wolnego panelu administracyjnego
zh_hans: 体验便捷的管理功能

source: Now that we've registered ``Question``, Django knows that it should be displayed on the admin index page:
el: Τώρα που έχουμε κάνει register το μοντέλο ``Question`` στο admin, το Django ξέρει πως πρέπει να εμφανίσει στην αρχική σελίδα του admin, την εφαρμογή σας:
it: Ora che abbiamo registrato ``Question``, Django sa che dovrebbe essere visualizzato nell'indice dell'amministratore:
ja: 今では私たちが"Question"を登録したので、Djangoはadmin インデクスページにこれを表示すべきだということを知っています:
pl: Kiedy już zarejestrowaliśmy ``Question``, Django wie, że powinno być wyświetlane na stronie głównej panelu:
zh_hans: 现在我们向管理页面注册了问题 ``Question`` 类。Django 知道它应该被显示在索引页里：

source: Click "Questions". Now you're at the "change list" page for questions. This page displays all the questions in the database and lets you choose one to change it. There's the "What's up?" question we created earlier:
el: Κλικάρετε στο "Questions". Τώρα είστε στη λεγόμενη "change list" σελίδα για τις ερωτήσεις. Αυτή η σελίδα εμφανίζει όλες τις ερωτήσεις (που είναι αποθηκευμένες στην βάση δεδομένων) και σας επιτρέπει να κλικάρετε πάνω τους και να τις επεξεργαστείτε. Εδώ φαίνεται και η ερώτηση που δημιουργήσαμε πριν ("What's up?"):
it: Fare clic su "Domande". Ora sei nella pagina "elenco modifiche" per le domande. Questa pagina mostra tutte le domande nel database e ti permette di sceglierne una per cambiarla. C'è la domanda "Che succede?" che abbiamo creato in precedenza:
ja: "Questions"をクリックしましょう。questionsのための"change list"ページが表示されます。このページにはデータベースの中のすべてのquestionsが表示され、あなたはこの中のひとつを変更のために選択することができます。ここに私たちが以前作成した"What's UP?" questionもあります:
pl: Kliknij w „Questions”. Jesteś teraz na stronie „change list” dla pytań. Ta strona wyświetla wszystkie pytania w bazie danych i pozwala wybrać ci jedno do zmiany. Jest tutaj pytanie „What's up?”, które stworzyliśmy wcześniej:
zh_hans: 点击 "Questions" 。现在看到是问题 "Questions" 对象的列表 "change list" 。这个界面会显示所有数据库里的问题 Question 对象，你可以选择一个来修改。这里现在有我们在上一部分中创建的 “What's up?” 问题。

source: Click the "What's up?" question to edit it:
el: Κλικάρετε Click the "What's up?" question to edit it:
it: Fai clic sulla domanda "Che succede?" per modificarla:
ja: "What's up?" questionを編集するためにクリックしましょう:
pl: Kliknij w pytanie „What's up?”, aby je edytować:
zh_hans: 点击 “What's up?” 来编辑这个问题（Question）对象：

source: Things to note here:
el: Μερικά πράγματα που αξίζει να σημειώσετε:
it: Cose da notare qui:
ja: 以下の点に注意してください:
pl: Rzeczy, na które należy zwrócić tutaj uwagę:
zh_hans: 注意事项：

source: The form is automatically generated from the ``Question`` model.
el: Η φόρμα δημιουργείται αυτόματα από το ``Question`` μοντέλο.
it: Il modulo viene generato automaticamente dal modello ``Domanda``.
ja: フォームは ``Question`` モデルから自動的に生成されます。
pl: Formularz jest automatycznie wygenerowany z modelu ``Question``.
zh_hans: 这个表单是从问题 ``Question`` 模型中自动生成的

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget. Each type of field knows how to display itself in the Django admin.
el: Τα διαφορετικού τύπου πεδία του μοντέλου ``Question`` (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) αντιστοιχούν στα ανάλογα HTML input πεδία (widgets). Κάθε τύπος πεδίου γνωρίζει ποιο HTML input element να χρησιμοποιήσει στο Django admin (π.χ τα πεδία χαρακτήρων - ``CharField``s αντιστοιχούν στο ``<input type=”text” />`` ενώ τα αριθμητικά ημερομηνία - ``IntegerField``s αντιστοιχούν στο ``<input type=”number” />``).
it: I diversi tipi di campo del modello (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) corrispondono al widget di input HTML appropriato. Ogni tipo di campo sa come mostrarsi nell'amministratore di Django.
ja: モデルのフィールドの型 (:class:`~django.db.models.DateTimeField` 、 :class:`~django.db.models.CharField` など) によって適切な HTML 入力ウィジェッ トが対応しています。各種のフィールドには Django 管理サイトでデー タを表示する方法が定義されています。
pl: Różne typu pól modeli (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) mają odpowiednie widgety kontrolek HTML. Każdy typ pola wie jak się wyświetlać w panelu Django.
zh_hans: 不同的字段类型（日期时间字段 :class:`~django.db.models.DateTimeField` 、字符字段 :class:`~django.db.models.CharField`）会生成对应的 HTML 输入控件。每个类型的字段都知道它们该如何在管理页面里显示自己。

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts. Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
el: Κάθε :class:`~django.db.models.DateTimeField` λαμβάνει ένα δωρεάν JavaScript plugin. Οι ημερομηνίες (dates) λαμβάνουν μια συντόμευση με το όνομα "Σήμερα" (όταν το κλικάρετε επιλέγεται η τωρινή ημερομηνία) καθώς και ένα ημερολόγιο (που εμφανίζεται σαν popup). Οι ώρες λαμβάνουν μια συντόμευση με το όνομα "Τώρα" (όταν το κλικάρετε επιλέγεται η τρέχουσα ώρα) και ένα βολικό popup το οποίο προβάλλει κοινότυπες ώρες προκειμένου να διαλέξετε αυτή που σας ταιριάζει.
it: Ogni :class:`~django.db.models.DateTimeField` include delle scorciatoie JavaScript. Le date ricevono una scorciatoia "Oggi" e un popup del calendario, mentre le ore ottengono una scorciatoia "Adesso" e un comodo popup che elenca gli orari comunemente inseriti.
ja: 各 :class:`~django.db.models.DateTimeField` は JavaScript ショートカットがついています。日付 (dates) のカラムには「今日 (today)」 へのショートカットとカレンダーポップアップボタンがあります。 時刻 (times) には「現在 (now)」へのショートカットと、よく入力される時刻のリストを表示するポップアップボタンがあります。
pl: Każde :class:`~django.db.models.DateTimeField` dostaje wolne javascriptowe skróty. Daty dostają skrót „Dzisiaj” i popup z kalendarzem a czas dostaje skrót „Teraz” i wygodny popup, który wylistowuje często wprowadzane godziny.
zh_hans: 每个日期时间字段 :class:`~django.db.models.DateTimeField` 都有 JavaScript 写的快捷按钮。日期有转到今天（Today）的快捷按钮和一个弹出式日历界面。时间有设为现在（Now）的快捷按钮和一个列出常用时间的方便的弹出式列表。

source: The bottom part of the page gives you a couple of options:
el: Το κάτω μέρος της σελίδας (το οποίο με την ρύθμιση :attr:`~django.contrib.admin.ModelAdmin.save_on_top ` μέσα στο αρχείο :file:`polls/admin.py`, μπορεί να εμφανιστεί και στο πάνω μέρος) σας δίνει ορισμένες επιλογές:
it: La parte inferiore della pagina offre un paio di opzioni:
ja: ページの末尾の部分には操作ボタンがいくつか表示されています:
pl: Dolna część strony daje ci klika możliwości:
zh_hans: 页面的底部提供了几个选项：

source: Save -- Saves changes and returns to the change-list page for this type of object.
el: Αποθήκευση -- Αποθηκεύει τυχόν αλλαγές και σας επιστρέφει στην σελίδα change list για αυτό το object.
it: Salva -- Salva le modifiche e rimanda alla pagina dell'elenco delle modifiche per questo tipo di oggetto.
ja: 保存 (Save) – 変更を保存して、このモデルのチェンジリストのページに戻ります。
pl: Zapisz – Zapisuje zmiany i powraca do strony change-list dla tego typu obiektów.
zh_hans: 保存（Save） - 保存改变，然后返回对象列表。

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
el: Αποθήκευση και συνέχεια επεξεργασίας -- Αποθηκεύει τυχόν αλλαγές και επαναφορτώνει την ίδια σελίδα για αυτό το object.
it: Salva e continua a modificare -- Salva le modifiche e ricarica la pagina di amministrazione per questo oggetto.
ja: 保存して編集を続ける (Save and continue editing) – 変更を保存して、このオブジェクトの編集ページをリロードします。
pl: Zapisz i kontynuuj edycję – Zapisuje zmiany i przeładowuję stronę panelu dla tego obiektu.
zh_hans: 保存并继续编辑（Save and continue editing） - 保存改变，然后重新载入当前对象的修改界面。

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
el: Αποθήκευση και προσθήκη καινούργιου -- Αποθηκεύει τυχόν αλλαγές και επαναφορτώνει την ίδια σελίδα, άδεια χωρίς τις τιμές του object που αποθηκεύτηκε προκειμένου να γίνει καταχώρηση νέου.
it: Salva e aggiungi un altro -- Salva le modifiche e carica un nuovo modulo vuoto per questo tipo di oggetto.
ja: 保存してもう一つ追加 (Save and add another) – 変更を保存して、このモデルのオブジェクトを新規追加するための空の編集ページをロードします。
pl: Zapisz i dodaj nowe – Zapisuje zmiany i ładuje nowy, pusty formularz dla tego typu obiektu.
zh_hans: 保存并新增（Save and add another） - 保存改变，然后添加一个新的空对象并载入修改界面。

source: Delete -- Displays a delete confirmation page.
el: Διαγραφή -- Σας ανακατευθύνει σε μια ενδιάμεση σελίδα επιβεβαίωσης της διαγραφής του object.
it: Delete -- Displays a delete confirmation page. Elimina -- Mostra una pagina di conferma dell'eliminazione.
ja: 削除 (Delete) – 削除確認ページを表示します。
pl: Usuń – Wyświetla stronę potwierdzenia usunięcia.
zh_hans: 删除（Delete） - 显示一个确认删除页面。
