Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Writing your first Django app, part 6
el: Γράφοντας το πρώτο σας Django app, μέρος 6
it: Scrivere la tua prima applicazione in Django, parte 6
ja: はじめての Django アプリ作成、その 6
pl: Pisanie pierwszej aplikacji Django, część 6.
zh_hans: 编写你的第一个 Django 应用，第 6 部分

source: This tutorial begins where :doc:`Tutorial 5 </intro/tutorial05>` left off. We've built a tested Web-poll application, and we'll now add a stylesheet and an image.
el: Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 5 </intro/tutorial05>`. Έχουμε φτιάξει μια γεμάτη με τεστ εφαρμογή ψηφοφορίας (Web-poll) και τώρα θα βελτιώσουμε την εμφάνιση της προσθέτοντας ένα stylesheet (CSS) και μια εικόνα.
it: Questo tutorial inizia da dove :doc:`Tutorial 5 </intro/tutorial05>` è finito. Abbiamo costruito un'applicazione Web-poll testata, e ora andremo ad aggiungere un foglio di stile e un'immagine.
ja: このチュートリアルは :doc:`チュートリアル 5 </intro/tutorial05>` の続きです。Web 投票アプリケーションのテストが完成したので、今度はスタイルシートや画像を追加しましょう。
pl: Ten tutorial zaczyna się, gdzie skończył się :doc:`Tutorial 5 </intro/tutorial05>`. Zbudowaliśmy testowaną aplikację web-ankietową, teraz dodamy arkusz stylów i grafikę.
zh_hans: 这一篇从 :doc:`教程第 5 部分 </intro/tutorial05>` 结尾的地方继续讲起。在上一节中我们为网络投票应用编写了测试，而现在我们要为它加上样式和图片。

source: Aside from the HTML generated by the server, web applications generally need to serve additional files — such as images, JavaScript, or CSS — necessary to render the complete web page. In Django, we refer to these files as "static files".
el: Πέρα από την HTML που παράγεται από τον server, τα web applications, σε γενικές γραμμές, χρειάζονται να κάνουν serve και πρόσθετα αρχεία — όπως εικόνες, γραμματοσειρές, JavaScript αρχεία, CSS κλπ — αρχεία απαραίτητα ούτως ώστε μια πλήρης ιστοσελίδα να γίνει render. Στο Django, αναφερόμαστε σε αυτά τα αρχεία ως "static files".
it: Insieme all'HTML generato dal server, le applicazioni web di solito hanno bisogno di servire altri file -- come immagini, JavaScript, o CSS -- necessari per generare la pagina web in completo. In Django, ci riferiamo a questi file chiamandoli "file statici".
ja: サーバで生成するHTML以外に、Webアプリケーションは一般的に完全なWebページをレンダリングするために、画像、JavaScript、CSSなど必要なファイルを提供する必要があります。Djangoでは、これらのファイルを "静的 (static) ファイル" と呼びます。
pl: Oprócz od HTML-u wygenerowanego przez serwer, aplikacje webowe zazwyczaj muszą serwować dodatkowe pliki – takie jak grafiki, JavaScript lub CSS – niezbędne do wyrenderowania pełnej strony internetowej. W Django nazywamy te pliki „plikami statycznymi”.
zh_hans: 除了服务端生成的 HTML 以外，网络应用通常需要一些额外的文件——比如图片，脚本和样式表——来帮助渲染网络页面。在 Django 中，我们把这些文件统称为“静态文件”。

source: For small projects, this isn't a big deal, because you can just keep the static files somewhere your web server can find it. However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
el: Για τα μικρής κλίμακας projects, αυτό δεν είναι και πολύ σημαντικό, επειδή μπορείτε να κρατήσετε αυτά τα αρχεία (τα οποία δεν θα είναι πολλά) κάπου που ο web server σας να μπορεί να τα βρει. Ωστόσο, στα μεγαλύτερης κλίμακας projects (ειδικά εκείνων που αποτελούνται από πολλά apps) που έχουν να κάνουν με πολλαπλά σετ από static files, όπου το κάθε app έχει το δικό του σετ, τα πράγματα αρχίζουν να δυσκολεύουν.
ja: 小さなプロジェクトではこのことは大きな問題になりません。 Web サーバが見つけられる場所で静的ファイルを単に管理することができるからです。しかし、もっと大きな プロジェクトで、特に複数のアプリケーションからなる場合は、各アプリケーションが 持っている静的ファイルの集まりを複数扱うことになり、ややこしくなってきます。
pl: W małych projektach to nieduży problem, bo możesz po prostu trzymać pliki statyczne gdzieś, gdzie może odnaleźć je web serwer. Jednak w dużych projektach – szczególnie tych złożonych z wielu aplikacji – raczenie sobie z wieloma zbiorami plików statycznych każdej aplikacji zaczyna być wyzwaniem.
zh_hans: 对于小项目来说，这个问题没什么大不了的，因为你可以把这些静态文件随便放在哪，只要服务程序能够找到它们就行。然而在大项目——特别是由好几个应用组成的大项目——中，处理不同应用所需要的静态文件的工作就显得有点麻烦了。

source: That's what ``django.contrib.staticfiles`` is for: it collects static files from each of your applications (and any other places you specify) into a single location that can easily be served in production.
el: Αυτό ακριβώς κάνει το ``django.contrib.staticfiles``: συγκεντρώνει όλα τα static files από κάθε εφαρμογή σας (και οποιοδήποτε άλλο μέρος εσείς καθορίσετε) σε μια τοποθεσία (που εσείς πάλι καθορίζετε) από την οποία μπορούν εύκολα να γίνουν served σε παραγωγικό περιβάλλον (production).
it: Questo è il motivo per cui serve ``django.contrib.staticfiles``: colleziona file statici da ogni applicazione (e da ogni altro posto che specifichi) in una singola destinazione che può essere facilmente servita in produzione.
ja: ``django.contrib.staticfiles`` はまさにそのためにあります。これは静的なファイ ルを各アプリケーションから (さらに指定した別の場所からも) 一つの場所に集め、運用環境で公開しやすくするものです。
pl: Do tego mamy ``django.contrib.staticfiles``: zbiera ono pliki statyczne z każdej z twoich aplikacji (i każdego innego miejsca, które wskażesz) w jedną lokację, która może być prosto zaserwowana na produkcji.
zh_hans: 这就是 ``django.contrib.staticfiles`` 存在的意义：它将各个应用的静态文件（和一些你指明的目录里的文件）统一收集起来，这样一来，在生产环境中，这些文件就会集中在一个便于分发的地方。

source: Customize your *app's* look and feel
el: Προσαρμογή της εμφάνισης της *εφαρμογής* σας
it: Personalizza l'aspetto e il design della tua *applicazione*
ja: *アプリ* の構造をカスタマイズする
pl: Dostosuj wygląd i pracę z twoją *aplikacją*
zh_hans: 自定义 *应用* 的界面和风格

source: First, create a directory called ``static`` in your ``polls`` directory. Django will look for static files there, similarly to how Django finds templates inside ``polls/templates/``.
el: Πρώτα, δημιουργήστε ένα φάκελο με το όνομα ``static`` μέσα στο φάκελο ``polls`` (μέσα, δηλαδή, στην εφαρμογή σας). Το Django θα ψάξει για τυχόν static files μέσα εκεί, ομοίως όπως ψάχνει για templates μέσα στο φάκελο ``polls/templates/``.
it: Innanzitutto, crea una directory chiamata ``static`` nella tua directory ``polls``. Django cercherà i file statici lì, in modo simile a come Django trova i modelli all'interno di ``polls/templates/``.
ja: 最初に、 ``polls`` ディレクトリの中に、 ``static`` ディレクトリを作成します。Django はそこから静的ファイルを探します。Django が ``polls/templates/`` からテンプレートを探す方法と同様です。
pl: Najpierw stwórz katalog o nazwie ``static`` w swoim katalogu ``polls``. Django będzie tam szukało plików statycznych, w podobny sposób jak szuka szablonów w ``polls/templates/``.
zh_hans: 首先，在你的 ``polls`` 目录下创建一个名为 ``static`` 的目录。Django 将在该目录下查找静态文件，这种方式和 Diango 在 ``polls/templates/`` 目录下查找 template 的方式类似。

source: Django's :setting:`STATICFILES_FINDERS` setting contains a list of finders that know how to discover static files from various sources. One of the defaults is ``AppDirectoriesFinder`` which looks for a "static" subdirectory in each of the :setting:`INSTALLED_APPS`, like the one in ``polls`` we just created. The admin site uses the same directory structure for its static files.
el: Η ρύθμιση του Django :setting:`STATICFILES_FINDERS` περιέχει μια λίστα από finders οι οποίοι γνωρίζουν πως να βρίσκουν τα static files από διάφορα μέρη. Μια από τις προεπιλογές είναι η ``AppDirectoriesFinder`` η οποία κοιτάζει να βρει έναν υπό-φάκελο με το όνομα "static" σε κάθε εφαρμογή η οποία συγκαταλέγεται στη λίστα της ρύθμισης :setting:`INSTALLED_APPS` (όπως ο υπό-φάκελος που μόλις δημιουργήσαμε μέσα στην εφαρμογή ``polls``). Το admin site χρησιμοποιεί την ίδια αρχιτεκτονική φακέλων για τα δικά του static files.
it: L'impostazione :setting:`STATICFILES_FINDERS` di Django contiene una lista di "cercatori" che sanno come trovare i file statici da diverse fonti. Uno dei predefiniti è ``AppDirectoriesFinder``, che cerca in una sottodirectory chiamata "static" per ciascuna delle app inserite in :setting:`INSTALLED_APPS`, come quella in ``polls`` che abbiamo appena creato. Il sito admin usa la stessa struttura di directory per i suoi file statici.
ja: Django の :setting:`STATICFILES_FINDERS` は、さまざまなソースから静的ファイルを検索する方法を知っているファインダのリストです。デフォルトのファイダの一つは ``AppDirectoriesFinder`` で、:setting:`INSTALLED_APPS` に書かれた各アプリケーションに対して、ちょうど今作った ``polls`` のような "static" サブディレクトリを検索してくれます。管理サイトの静的ファイルにも、これと同じディレクトリ構造が使われます。
pl: Ustawienie Django :setting:`STATICFILES_FINDERS` zawiera listę finderów, które wiedzą jak odnajdywać pliki statyczne w różnych źródłach. Jednym z domyślnych jest ``AppDirectoriesFinder``, który szuka „statycznego” podkatalogu w każdej z :setting:`INSTALLED_APPS`, takiego jak ten, który właśnie stworzyliśmy w ``polls``. Panel administracyjny używa takiej samej struktury katalogów dla swoich statycznych plików.
zh_hans: Django 的 :setting:`STATICFILES_FINDERS` 设置包含了一系列的查找器，它们知道去哪里找到 static 文件。``AppDirectoriesFinder`` 是默认查找器中的一个，它会在每个 :setting:`INSTALLED_APPS` 中指定的应用的子文件中寻找名称为 ``static`` 的特定文件夹，就像我们在 ``polls`` 中刚创建的那个一样。管理后台采用相同的目录结构管理它的静态文件。

source: Within the ``static`` directory you have just created, create another directory called ``polls`` and within that create a file called ``style.css``. In other words, your stylesheet should be at ``polls/static/polls/style.css``. Because of how the ``AppDirectoriesFinder`` staticfile finder works, you can refer to this static file in Django simply as ``polls/style.css``, similar to how you reference the path for templates.
el: Μέσα στον φάκελο ``static`` που μόλις δημιουργήσατε, δημιουργήστε άλλο έναν φάκελο με το όνομα ``polls`` και μέσα σε αυτόν δημιουργήστε ένα αρχείο με το όνομα ``style.css``. Με άλλα λόγια, το stylesheet θα πρέπει να βρίσκεται στη διαδρομή ``polls/static/polls/style.css``. Λόγω του τρόπου λειτουργίας του ``AppDirectoriesFinder`` staticfile finder, μπορείτε να αναφέρεστε στο αρχείο αυτό ως ``polls/style.css``, παρόμοια με το πως αναφέρεστε στη διαδρομή (path) για τα templates σας.
ja: 今作った ``static`` ディレクトリの中に、``polls`` という名前の新しいディレクトリを作り、さらにその中に、``style.css`` という名前のファイルを作成します。つまり、このスタイルシートは ``polls/static/polls/style.css`` に保存します。``AppDirectoriesFinder`` の動作のしくみのおかげで、Django では、ただ ``polls/style.css`` と書くだけでこの静的ファイルを参照することができます。これは、テンプレートのパスを参照する時と同じです。
pl: W katalogu ``static``, który właśnie stworzyłeś, stwórz inny katalog o nazwie ``polls`` i w nim stwórz plik o nazwie ``style.css``. Innymi słowy twój arkusz stylów powinien być w ``polls/static/polls/style.css``. Z powodu jak działa finder plików statycznych ``AppDirectoriesFinder``, możesz odwoływać się do tego pliku statycznego w Django po prostu jako do ``polls/style.css``, podobnie jak wskazujesz ścieżkę do szablonów.
zh_hans: 在你刚创建的 ``static`` 文件夹中创建一个名为 ``polls`` 的文件夹，再在 ``polls`` 文件夹中创建一个名为 ``style.css`` 的文件。换句话说，你的样式表路径应是 ``polls/static/polls/style.css``。因为 ``AppDirectoriesFinder`` 的存在，你可以在 Django 中简单地使用以 ``polls/style.css`` 的形式引用此文件，类似你引用模板路径的方式。

source: Static file namespacing
it: Namespacing dei file statici
ja: 静的ファイルの名前空間
pl: Przestrzeń nazw plików statycznych
zh_hans: 静态文件命名空间

source: Just like templates, we *might* be able to get away with putting our static files directly in ``polls/static`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the easiest way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
el: Όπως ακριβώς συμβαίνει με τα templates, θα *μπορούσαμε* να αποθηκεύαμε τα static files μας απ’ ευθείας στο φάκελο ``polls/static`` (παρά να δημιουργήσουμε άλλον έναν φάκελο μέσα εκεί με το όνομα ``polls``), αλλά δεν θα ήταν καλή ιδέα. Το Django θα επιλέξει το πρώτο static file που θα βρει το οποίο θα ταιριάξει στο όνομα που ψάχνει. Αν έχετε ένα static file με το ίδιο όνομα σε μια *άλλη* εφαρμογή, τότε το Django δεν θα μπορέσει να διαχωρίσει ποια από τα δύο να χρησιμοποιήσει. Χρειαζόμαστε ένα τρόπο να καθοδηγήσουμε το Django στο σωστό αρχείο. Ο ευκολότερος τρόπος να το κάνουμε είναι να εφαρμόσουμε την τεχνική του *namespacing* στα static files. Δηλαδή, να τοποθετούμε αυτά τα static files μέσα σε *άλλον έναν* φάκελο με το ίδιο όνομα με αυτό της εφαρμογής.
ja: テンプレートと同様に、``polls`` という別のサブディレクトリを作らずに、直接 ``polls/static`` の中に静的ファイルを置いてもいいのではないか、と思うかもしれませんね。しかし、それは実際には悪い考えです。Django は、名前がマッチした最初のテンプレートを使用するので、もし *異なる* アプリケーションの中に同じ名前のテンプレートがあった場合、Django はそれらを区別することができません。そのため、Django に正しいテンプレートを教えてあげる必要がありますが、一番簡単な方法は、それらに *名前空間を与える* ことです。アプリケーションと同じ名前をつけた *もう一つの* ディレクトリの中にテンプレートを置いたのは、そういうわけなのです。
pl: Tak samo jak z szablonami, *moglibyśmy* poradzić sobie umieszczając nasze pliki statyczne bezpośrednio w ``polls/static`` (zamiast tworzyć kolejny podkatalog ``polls``), ale w rzeczywistości byłoby to złym pomysłem. Django wybierze pierwszy statyczny plik, którego nazwa się zgadza i jeśli miałbyś plik statyczny o takiej samej nazwie w *innej* aplikacji, Django nie byłoby w stanie ich odróżnić. Musimy być w stanie wskazać Django odpowiedni plik i najprostszym sposobem, aby to zapewnić jest *znamespace'owanie* ich. To znaczy umieszczenie tych plików statycznych w *innym* katalogu nazwanym dla samej aplikacji.
zh_hans: 虽然我们 *可以* 像管理模板文件一样，把 static 文件直接放入 ``polls/static`` ——而不是创建另一个名为 ``polls`` 的子文件夹，不过这实际上是一个很蠢的做法。Django 只会使用第一个找到的静态文件。如果你在 *其它* 应用中有一个相同名字的静态文件，Django 将无法区分它们。我们需要指引 Django 选择正确的静态文件，而最简单的方式就是把它们放入各自的 *命名空间* 。也就是把这些静态文件放入 *另一个* 与应用名相同的目录中。

source: Put the following code in that stylesheet (``polls/static/polls/style.css``):
el: Τοποθετήστε τον ακόλουθο κώδικα στο αρχείο CSS (``polls/static/polls/style.css``):
it: Inserisci il seguente codice in quel foglio di stile (``polls/static/polls/style.css``):
ja: スタイルシートに次のコードを配置します (``polls/static/polls/style.css``):
pl: Umieść następujący kod w tym arkuszu stylów (``polls/static/polls/style.css``):
zh_hans: 将以下代码放入样式表(``polls/static/polls/style.css``)：

source: Next, add the following at the top of ``polls/templates/polls/index.html``:
el: Μετά, προσθέστε τα ακόλουθα στην αρχή του αρχείου ``polls/templates/polls/index.html``:
it: Poi, aggiungi il seguente codice all'inizio di ``polls/templates/polls/index.html``:
ja: 次に、``polls/templates/polls/index.html`` の上部に追加します:
pl: Następnie dodaj poniższe na początku ``polls/templates/polls/index.html``:
zh_hans: 下一步，在 ``polls/templates/polls/index.html`` 的文件头添加以下内容：

source: ``{% load staticfiles %}`` loads the :ttag:`{% static %} <staticfiles-static>` template tag from the ``staticfiles`` template library. The ``{% static %}`` template tag generates the absolute URL of the static file.
ja: ``{% load staticfiles %}`` は、:ttag:`{% static %} <staticfiles-static>` テンプレートタグを ``staticfiles`` のテンプレートライブラリから読み込みます。そして、``{% static %}`` テンプレートタグは、静的ファイルの絶対URLを生成します。

source: That's all you need to do for development. Reload ``http://localhost:8000/polls/`` and you should see that the question links are green (Django style!) which means that your stylesheet was properly loaded.
ja: 開発でするべきことはこれだけです。``http://localhost:8000/polls/`` をリロードすれば、質問のリンクが緑色 (Django のスタイル！) に変わったはずです。これで、スタイルシートがちゃんと読み込まれたことがわかりました。
pl: To wszystko, co musisz zrobić dla dewelopmentu. Przeładuj ``http://localhost:8000/polls/`` a powinieneś zobaczyć, że linki pytań są zielone (styl Django!), co znaczy, że twój arkusz stylów został właściwie załadowany.
zh_hans: 以上就是你全部需要做的事。浏览器重载 ``http://localhost:8000/polls/``，然后你可以看到投票链接是绿色的（Django 样式），这意味着你的样式表被正确加载了。

source: Adding a background-image
el: Προσθέτοντας μια background-image
it: Aggiunta di un'immagine di sfondo
ja: 背景画像を追加する
pl: Dodawanie obrazu tła
zh_hans: 添加一个背景图

source: Next, we'll create a subdirectory for images. Create an ``images`` subdirectory in the ``polls/static/polls/`` directory. Inside this directory, put an image called ``background.gif``. In other words, put your image in ``polls/static/polls/images/background.gif``.
el: Επόμενο βήμα είναι να δημιουργήσουμε έναν υπό-φάκελο για τις εικόνες μας. Δημιουργήστε, λοιπόν, ένα φάκελο με το όνομα ``images`` στη διαδρομή ``polls/static/polls/``. Μέσα σε αυτό το φάκελο αποθηκεύστε μια εικόνα με το όνομα ``background.gif``. Με άλλα λόγια το full path της εικόνας θα είναι το ``polls/static/polls/images/background.gif``.
it: Successivamente, creeremo una sottocartella per le immagini. Crea una sottocartella dentro la cartella ``polls/static/polls/``. Dentro questa cartella, metti un'immagine chiamata ``background.gif``. In altre parole, metti la tua immagine dentro ``polls/static/polls/images/background.gif``.
ja: つぎに、画像のためのサブディレクトリを作りましょう。``images`` サブディレクトリを ``polls/static/polls/`` ディレクトリの中に作成します。このディレクトリの中に、``background.gif`` という名前の画像を置きます。つまり、画像は ``polls/static/polls/images/background.gif`` に置きます。
pl: Następnie stworzymy podkatalog na grafiki. Stwórz podkatalog ``images`` w katalogu ``polls/static/polls/``. W tym katalogu umieść grafikę o nazwie ``background.gif``. Innymi słowy umieść swój obrazek w ``polls/static/polls/images/background.gif``.
zh_hans: 接着，我们会创建一个用于存在图像的目录。在 ``polls/static/polls`` 目录下创建一个名为 ``images`` 的子目录。在这个目录中，放一张名为 ``background.gif`` 的图片。换言之，在目录 ``polls/static/polls/images/background.gif`` 中放一张图片。

source: Then, add to your stylesheet (``polls/static/polls/style.css``):
el: Μετά προσθέστε στο CSS αρχείο σας τα παρακάτω (``polls/static/polls/style.css``):
it: Quindi, aggiungi al tuo foglio di stile (``polls/static/polls/style.css``):
ja: さらに、スタイルシート (``polls/static/polls/style.css``) に次のコードを追加します。
pl: Potem dodaj do swojego arkusza stylów (``polls/static/polls/style.css``):
zh_hans: 随后，在你的样式表（``polls/static/polls/style.css``）中添加：

source: Reload ``http://localhost:8000/polls/`` and you should see the background loaded in the bottom right of the screen.
ja: ``http://localhost:8000/polls/`` をリロードすれば、画面の右下に、読み込まれた背景画像が表示されるはずです。
pl: Odśwież ``http://localhost:8000/polls/`` a powinieneś zobaczyć tło załadowane w prawym dolnym rogu ekranu.

source: Of course the ``{% static %}`` template tag is not available for use in static files like your stylesheet which aren't generated by Django. You should always use **relative paths** to link your static files between each other, because then you can change :setting:`STATIC_URL` (used by the :ttag:`static` template tag to generate its URLs) without having to modify a bunch of paths in your static files as well.
el: Είναι προφανές ότι το template tag ``{% static %}`` δεν θα είναι διαθέσιμο για static files τα οποία δεν παράγονται από το Django. Θα πρέπει πάντα να χρησιμοποιείτε **relative paths** για να συνδέσετε μεταξύ τους τα static files. Αν το κάνετε αυτό θα μπορείτε, έπειτα, να αλλάζετε τη ρύθμιση :setting:`STATIC_URL` (η οποία χρησιμοποιείται από το :ttag:`static` template tag για να δημιουργεί τα URLs) χωρίς να χρειαστεί να αλλάζετε ένα σωρό από μονοπάτια (paths) στα static files σας. Με άλλα λόγια μην χρησιμοποιείτε absolute paths για τα static files. Η δουλειά του ``{% static %}`` είναι να μετατρέπει τα relative paths σε absolute URLs.
ja: もちろん、``{% static %}`` テンプレートタグは、スタイルシートのような Django が生成しない静的ファイル内では使用できません。そのため、2つの静的ファイルを互いにリンクするときには、必ず **相対パス** を使用するべきです。そうすれば、:setting:`STATIC_URL` (:ttag:`static` テンプレートタグが URL を生成する時に使われる) を変更しても、静的ファイルのパスを書き換えずに済みます。
pl: Oczywiście szablonowy tag ``{% static %}`` nie jest dostępny do użycia w plikach statycznych takich jak twój arkusz stylów, które nie są wygenerowane przez Django. Powinieneś zawsze używać **ścieżek względnych** do łączenia plików statycznych pomiędzy nimi, ponieważ wtedy możesz zmienić :setting:`STATIC_URL` (używany przez szablonowy tag :ttag:`static` do wygenerowania jego URL-i) bez bycia zmuszonym do modyfikacji też rzeszy ścieżek w twoich plikach statycznych.
zh_hans: 当然，``{% static %}`` 模板标签在静态文件（例如样式表）中是不可用的，因为它们不是由 Django 生成的。你仍需要使用 *相对路径* 的方式在你的静态文件之间互相引用。这样之后，你就可以任意改变 :setting:`STATIC_URL`（由 :ttag:`static` 模板标签用于生成 URL），而无需修改大量的静态文件。

source: These are the **basics**. For more details on settings and other bits included with the framework see :doc:`the static files howto </howto/static-files/index>` and :doc:`the staticfiles reference </ref/contrib/staticfiles>`. :doc:`Deploying static files </howto/static-files/deployment>` discusses how to use static files on a real server.
el: Αυτά είναι τα **βασικά**. Για περισσότερες πληροφορίες σχετικά με τις ρυθμίσεις και άλλα εργαλεία τα οποία συμπεριλαμβάνονται στο Django δείτε στο άρθρο :doc:`διαχείριση των static files </howto/static-files/index>` και στο :doc:`η εφαρμογή staticfiles </ref/contrib/staticfiles>`. Το άρθρο :doc:`production server και static files </howto/static-files/deployment>` συζητά πως να χρησιμοποιήσετε τα static files σε ένα πραγματικό server.
it: Queste sono le **basi**. Per maggiori dettagli sulla configurazione e altri particolari del framework vedi :doc:`l'howto dei file statici</howto/static-files/index>` e :doc:`la guida di riferimento di staticfiles </ref/contrib/staticfiles>`. :doc:`Distribuire i file statici</howto/static-files/deployment>` spiega invece come usare i file statici su un server reale.
ja: これらは静的ファイルの **基本** です。設定方法やフレームワークの機能の詳細については、:doc:`静的ファイルの配信 </howto/static-files/index>` と :doc:`staticfiles のリファレンス </ref/contrib/staticfiles>` を読んでください。:doc:`静的ファイルのデプロイ </howto/static-files/deployment>` では、実際のサーバでの静的ファイルの使い方について説明しています。
pl: To są **podstawy**. Po więcej szczegółów na temat ustawień i innych kawałków zawartych we frameworku, zobacz :doc:`howto plików statycznych </howto/static-files/index>` i :doc:`dokumentację staticfiles </ref/contrib/staticfiles>`. :doc:`Demployment plików statycznych </howto/static-files/deployment>` porusza kwestię, jak używać plików statycznych na prawdziwym serwerze.
zh_hans: 这些只是 **基础** 。更多关于设置和框架的资料，参考 :doc:`静态文件解惑 </howto/static-files/index>` 和 :doc:`静态文件指南 </ref/contrib/staticfiles>`。:doc:`部署静态文件 </howto/static-files/deployment>` 介绍了如何在真实服务器上使用静态文件。

source: When you're comfortable with the static files, read :doc:`part 7 of this tutorial </intro/tutorial07>` to learn how to customize Django's automatically-generated admin site.
el: Όταν είστε εξοικειωμένοι με τα static files, διαβάστε το :doc:`έβδομο μέρος αυτού του οδηγού </intro/tutorial07>` για να μάθετε περισσότερα με την παραμετροποίηση του διαχειριστικού site του Django (admin site) το οποίο δημιουργείται αυτόματα.
it: Quando ti senti a tuo agio con i file statici, leggi :doc:`la parte 7 di questo tutorial</intro/tutorial07>` per imparare a personalizzare il sito admin che viene generato automaticamente da Django.
ja: 静的ファイルを使いこなせるようになったら、:doc:`チュートリアル その7 </intro/tutorial07>` に進んで、Django が自動生成する管理サイトのカスタマイズをしてみましょう。
pl: Kiedy już czujesz się dobrze z plikami statycznymi, przeczytaj :doc:`część 7 tego tutoriala </intro/tutorial07>`, aby dowiedzieć się, jak dostosowywać wygenerowany automatycznie panel administracyjny Django.
zh_hans: 当你熟悉静态文件后，阅读 :doc:`此教程的第 7 部分 </intro/tutorial07>` 来学习如何自定义 Django 自动生成后台网页的过程。

source: Writing your first Django app, part 7
el: Γράφοντας το πρώτο σας Django app, μέρος 7
it: Scrivere la tua prima applicazione in Django, parte 7
ja: はじめての Django アプリ作成、その 7
pl: Pisanie pierwszej aplikacji Django, część 7.
zh_hans: 编写你的第一个 Django 应用，第 7 部分

source: This tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We're continuing the Web-poll application and will focus on customizing the Django's automatically-generated admin site that we first explored in :doc:`Tutorial 2 </intro/tutorial02>`.
ja: このチュートリアルは :doc:`チュートリアル その6 </intro/tutorial06>` の続きです。ここでは、引き続き Web 投票アプリケーションの開発を続け、:doc:`チュートリアル その2</intro/tutorial02>` で少し触れた、Django が 自動生成する管理サイトのカスタマイズに焦点を当てます。

source: Customize the admin form
el: Παραμετροποιώντας την admin form
it: Personalizzare il modulo di amministrazione
ja: admin フォームのカスタマイズ
pl: Dostosuj formularz panelu administracyjnego
zh_hans: 自定义后台表单
