Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django. One way to check that Django still works after you make your changes is by running Django's test suite. If all the tests still pass, then you can be reasonably sure that your changes work and haven't broken other parts of Django. If you've never run Django's test suite before, it's a good idea to run it once beforehand to get familiar with its output.
it: Quando contribuisci a Django, è molto importante che i cambiamenti che apporti al codice non introducano bug in altre aree di Django. Un modo di controllare che Django funzioni ancora dopo aver apportato i cambiamenti è quello di lanciare la suite di test di Django. Se tutti i test hanno successo, allora puoi essere ragionevolmente sicuro che i tuoi cambiamenti funzionino e che non hai pregiudicato la funzionalità di altre parti di Django. Se non hai mai lanciato la suite di test di Django, è una buona idea lanciarla prima per cominciare ad avere familiarità con i suoi output.

source: Before running the test suite, install its dependencies by ``cd``-ing into the Django ``tests/`` directory and then running:
it: Prima di eseguire la suite di test, installa le dipendenze usando "cd" per entrare nella cartella di Django "test/" e poi eseguire:

source: Now we are ready to run the test suite. If you're using GNU/Linux, macOS, or some other flavor of Unix, run:
it: Ora siamo pronti per far partire la nostra suite di test. Se stai usando GNU/Linux, macOS, o altre variazioni di Unix, esegui:
zh_hans: 现在你可以运行测试套件。如果你用的是 GNU/Linux， macOS 或者其它类 Unix 系统，运行：

source: Now sit back and relax. Django's entire test suite has thousands of tests, and it takes at least a few minutes to run, depending on the speed of your computer.
it: Adesso siedi e rilassati. L'intera suite di test di Django si compone di centinaia di test e ci vorrà qualche minuto perchè giri, dipendentemente dalla velocità del tuo computer.

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it completes. ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed. Both of these are considered to be test failures. Meanwhile, ``x`` and ``s`` indicated expected failures and skipped tests, respectively. Dots indicate passing tests.
it: Mentre la suite di test di Django è in esecuzione, vedrai scorrere lettere rappresentanti lo stato di ogni test man mano che viene completato. "E" indica che un errore è stato trovato, e "F" indica che le asserzioni del test sono fallite. Entrambi i casi sono considerati come fallimenti. Nel mentre, "x" e "s" hanno indicato probabili fallimenti e test omessi. I punti indicano i test passati.

source: Note that the latest Django "main" branch may not always be stable. When developing against "main", you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds. If you click to view a particular build, you can view the "Configuration Matrix" which shows failures broken down by Python version and database backend.
it: Considera che l'ultima versione del ramo "main" potrebbe non essere sempre stabile. Quando sviluppi basandoti su "main", puoi controllare `Django's continuous integration builds`__ per determinare se i fallimenti sono relativi alla tua macchina o sono presenti nella build ufficiale di Django. Se controlli una build specifica, puoi vedere la sezione "Configuration Matrix" che mostra i fallimenti dovuti alla versione di Python e al database utilizzato.

source: Working on a feature
it: Lavorare su una funzionalità

source: For this tutorial, we'll work on a "fake ticket" as a case study. Here are the imaginary details:
it: Per questa guida, lavoreremo su un "ticket falso" come caso di studio. Queste sono le ipotesi:

source: Ticket #99999 -- Allow making toast
it: Ticket #99999 -- Permette di fare un toast

source: Django should provide a function ``django.shortcuts.make_toast()`` that returns ``'toast'``.
it: Django dovrebbe avere a disposizione una funzione "django.shortcuts.make_toast()" che ritorna "toast".

source: We'll now implement this feature and associated tests.
it: Aggiungeremo ora questa funzionalità e i test associati.

source: Creating a branch for your patch
el: Δημιουργία ενός τμήματος για το αρχείου σας
it: Creare una branch per la tua patch
zh_hans: 为你的补丁创建一个分支

source: Before making any changes, create a new branch for the ticket:
el: Πριν κάνετε αλλαγές, δημιουργήστε ένα νέο τμήμα για το εισητήριο
it: Prima di fare qualsiasi modifica, crea una nuova branch per il ticket:
zh_hans: 在做出任何修改之前，为你的工单创建一个分支：

source: You can choose any name that you want for the branch, "ticket_99999" is an example. All changes made in this branch will be specific to the ticket and won't affect the main copy of the code that we cloned earlier.
it: Puoi scegliere qualunque nome che desideri per il ramo, "ticket_99999" è un esempio. Tutte le modifiche fatte su questo ramo saranno specifiche per il ticket e non andranno a modificare la copia principale del codice che abbiamo clonato in precedenza.

source: Writing a test for ticket #99999
it: Scrivere un test per il ticket #99999

source: In order to resolve this ticket, we'll add a ``make_toast()`` function to the top-level ``django`` module. First we are going to write a test that tries to use the function and check that its output looks correct.
it: Per risolvere questo ticket, aggiungeremo una funzione ``make_toast()`` nel modulo ``django``. Innanzitutto andremo a scrivere un test che prova a usare la funzione e controlla che l'output sia corretto.

source: Navigate to Django's ``tests/shortcuts/`` folder and create a new file ``test_make_toast.py``. Add the following code::
it: Naviga fino alla cartella di Django "tests/shortcuts/" e crea un nuovo file "test_make_toast.py". Aggiungi il seguente codice::

source: This test checks that the ``make_toast()`` returns ``'toast'``.
it: Questo test controlla che "make_toast()" ritorna "toast".

source: Since we haven't made any modifications to ``django.shortcuts`` yet, our test should fail. Let's run all the tests in the ``shortcuts`` folder to make sure that's really what happens. ``cd`` to the Django ``tests/`` directory and run:
it: Poichè non abbiamo fatto ancora alcuna modifica a "django.shortcuts", il nostro test dovrebbe fallire. Eseguiamo tutti i test nella cartella "shortcuts" per assicurarci che è proprio ciò che sta accadendo. "cd" nella cartella di Django "tests/" ed esegui:

source: If the tests ran correctly, you should see one failure corresponding to the test method we added, with this error::
it: Se il test viene eseguito correttamente, dovresti vedere un fallimento corrispondente al metodo del test che abbiamo aggiunto, con questo errore::

source: If all of the tests passed, then you'll want to make sure that you added the new test shown above to the appropriate folder and file name.
it: Se tutti i test vengono superati, assicurati di aggiungere il test mostrato in precedenza nella cartella e con il nome file appropriati.

source: Next we'll be adding the ``make_toast()`` function.
it: Successivamente aggiungeremo la funzione ``make_toast()``.

source: Navigate to the ``django/`` folder and open the ``shortcuts.py`` file. At the bottom, add::
it: Vai alla cartella ``django/`` ed apri il file ``shortcuts.py``. Alla fine, aggiungi:

source: Now we need to make sure that the test we wrote earlier passes, so we can see whether the code we added is working correctly. Again, navigate to the Django ``tests/`` directory and run:
it: Ora dobbiamo assicurarci che il test che abbiamo scritto in precedenza venga superato, quindi possiamo vedere se il codice che abbiamo scritto funziona correttamente. Ancora una volta, posizionati nella cartella Django ``tests/`` ed esegui:

source: Everything should pass. If it doesn't, make sure you correctly added the function to the correct file.
it: Tutto dovrebbe funzionare. In caso contrario, assicurati di aver aggiunto la funzione al file corretto.

source: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
it: Once you've verified that your patch and your test are working correctly, it's a good idea to run the entire Django test suite to verify that your change hasn't introduced any bugs into other areas of Django. While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed. Una volta verificato che la tua patch e il tuo test funziona correttamente, è una buona idea lanciare l'intera test suite per verificare che i tuoi cambiamenti non hanno introdotto alcun bug in altre aree del codice di Django. Nonostante il completo superamento dell'intera suite di test non garantisce che il tuo codice sia senza bug, aiuta a identificare molti bug a regressioni che potrebbero non essere notate.

source: This is a new feature, so it should be documented. Open the file ``docs/topics/http/shortcuts.txt`` and add the following at the end of the file::
it: Questa è una nuova funzionalità, per cui dovrebbe essere documentata. Apri il file "docs/topics/http/shortcuts.txt" e aggiungi ciò che segue alla fine del file::

source: Since this new feature will be in an upcoming release it is also added to the release notes for the next version of Django. Open the release notes for the latest version in ``docs/releases/``, which at time of writing is ``2.2.txt``. Add a note under the "Minor Features" header::
it: Poichè questa nuova funzionalità sarà in un imminente rilascio viene anche aggiunta alle note di rilascio per la prossima versione di Django. Apri le note di rilascio per l'ultima versione in "docs/releases/", che mentre sto scrivendo è "2.2.txt". Aggiungi una nota sotto l'intestazione "Minor Features":

source: Previewing your changes
el: Προβολή των αλλαγών σας
it: Visualizzare l'anteprima delle tue modifiche
zh_hans: 预览你的修改

source: Now it's time to go through all the changes made in our patch. To stage all the changes ready for commit, run:
it: Ora è il momento di esaminare tutte le modifiche apportate nell'aggiornamento. Per preparare tutte le modifiche pronte per il commit, lancia:

source: Then display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial with:
it: Mostra le differenze tra la tua copia attuale di Django ( con le tue modifiche ) e la revisione di quello che avevi scaricato seguendo la guida.

source: Use the arrow keys to move up and down.
el: Χρησιμοποιήστε τα βέλη για να κινηθείτε προς τα επάνω και προς τα κάτω.
it: Usa le freccettine per muoverti su e giu.
zh_hans: 使用方向键上下移动

source: When you're done previewing the patch, hit the ``q`` key to return to the command line. If the patch's content looked okay, it's time to commit the changes.
el: Αφότου ρίξετε μια ματιά στο κείμενο, πιέστε το πλήκτρο ``q`` για να βρεθείτε πάλι στη γραμμή εντολών. Αν το περιεχόμενο του patch δείχνει σωστό, μπορείτε να κάνετε commit τις αλλαγές (υποτίθεται ότι βρίσκεστε στο root directory του project):
it: Quando hai finito di controllare l'anteprima della tua patch, clicca il tasto ``q`` per ritornare alla linea di comando. Se il contenuto della patch sembra giusto, è' il momento di committare i cambiamenti.
zh_hans: 当你检查完补丁后，敲击 ``q`` 键返回到命令行。如果补丁内容看起来没问题，可以提交这些修改了。

source: Committing the changes in the patch
el: Κάνοντας commit τις αλλαγές του patch
it: Salvare le modifiche nella patch
zh_hans: 提交补丁中的修改

source: To commit the changes:
el: Για να κάνετε commit τις αλλαγές γράψτε:
it: Per confermare le modifiche:
zh_hans: 为了提交这些修改：

source: This opens up a text editor to type the commit message. Follow the :ref:`commit message guidelines <committing-guidelines>` and write a message like:
el: Η παραπάνω εντολή ανοίγει έναν επεξεργαστή κειμένου για να γράψετε το μήνυμα του commit. Ακολουθήστε τις :ref:`οδηγίες για ένα σωστό μήνυμα commit <committing-guidelines>` και γράψτε ένα μήνυμα όπως:
it: Questo apre l'editor di test per inserire il messaggio di commit. Segui le linee guida del :ref:'messaggio di commit<committing-guidelines>' e scrivi un messaggio tipo:
zh_hans: 这会打开文本编辑器以便输入提交信息。参考 :ref:`commit message guidelines <committing-guidelines>` 输入类似这样的信息：

source: Pushing the commit and making a pull request
el: Κάνοντας push το commit καθώς και ένα pull request
it: Inviare il commit e creare una pull request
zh_hans: 推送这次提交并生成一个 pull 请求

source: After committing the patch, send it to your fork on GitHub (substitute "ticket_99999" with the name of your branch if it's different):
it: Dopo aver committato la patch, invia il tuo fork su GitHub ( sostituendo "ticket_99999" con il nome del tuo branch, se è diverso):

source: You can create a pull request by visiting the `Django GitHub page <https://github.com/django/django/>`_. You'll see your branch under "Your recently pushed branches". Click "Compare & pull request" next to it.
el: Μπορείτε να δημιουργήσετε ένα pull request πηγαίνοντας στην `επίσημη σελίδα του Django στο GitHub <https://github.com/django/django/>`_. Εκεί θα δείτε το δικό σας branch κάτω από την ετικέτα "Your recently pushed branches". Κάντε κλικ στο "Compare & pull request".
it: Puoi creare una pull request vistando la `Django GitHub page <https://github.com/django/django/>`_. Vedrai il tuo branch nella sezione "Your recently pushed branches". Clicca "Compare & pull request" di fianco.
zh_hans: 你可以访问 `Django GitHub page <https://github.com/django/django/>`_ 创建一个 pull 请求。 你会在“你最近推送的分支”下看到你的分支。 单击旁边的 "Compare & pull request"。

source: Please don't do it for this tutorial, but on the next page that displays a preview of the patch, you would click "Create pull request".
el: Παρακαλούμε να μην το κάνετε για αυτό τον οδηγό, αλλά στην επόμενη σελίδα που θα εμφανιστεί μια προεπισκόπιση του patch σας, θα κάνετε κλικ στο "Create pull request".
it: Per favore non farlo per questa guida ma sulla prossima pagina che mostra un'anteprima della patch, cliccheresti "Crea richiesta pull".
zh_hans: 本教程中请不要这么做。不过，在接下来显示补丁预览的页面，你可以单击 "Create pull request"。

source: Next steps
el: Επόμενα βήματα
it: Prossimi passi
zh_hans: 下一步

source: Congratulations, you've learned how to make a pull request to Django! Details of more advanced techniques you may need are in :doc:`/internals/contributing/writing-code/working-with-git`.
el: Συγχαρητήρια! Μόλις μάθατε πως να κάνετε pull requests στο Django! Λεπτομέρειες για περισσότερο ανεπτυγμένες τεχνικές, που ίσως χρειαστείτε, θα βρείτε στο :doc:`/internals/contributing/writing-code/working-with-git`.
it: Congratulazioni, hai imparato a fare una richiesta pull a Django! Dettagli su tecniche più avanzate di cui potresti aver bisogno sono in :doc:`/internals/contributing/writing-code/working-with-git`.
zh_hans: 恭喜，你已经学会了如何为 Django 创建 pull request！如需获知更多高级技巧，参考 :doc:`/internals/contributing/writing-code/working-with-git`。

source: Now you can put those skills to good use by helping to improve Django's codebase.
el: Τώρα μπορείτε να χρησιμοποιήσετε αυτές τις τεχνικές για καλό σκοπό βελτιώνοντας τον πηγαίο κώδικα του Django.
it: Ora puoi utilizzare queste conoscenze aiutando a migliorare il codice di Django.
zh_hans: 现在你可以活用这些技能帮助改善 Django 的代码库。

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
it: Se non vedi l'ora di cominciare (e nessuno si lamenterà per questo!), prova a dare un'occhiata alla lista dei `ticket facili che hanno bisogno di una patch`__ e dei `ticket facili che hanno una patch da migliorare`__. Se hai familiarità nella scrittura di test automatici, puoi anche dare un'occhiata alla lista dei `ticket facili che hanno bisogno di test`__. Ricorda di seguire le linee guida su come diventare l'assegnatario di un ticket che sono menzionate nel link alla documentazione di Django su :doc:`reclamare i ticket e inviare patch</internals/contributing/writing-code/submitting-patches>`.

source: What's next after creating a pull request?
el: Τι γίνετε μετά, αφότου δημιουργήσω ένα pull request;
it: Cosa fare dopo aver creato una pull request?
zh_hans: 创建完 pull request，下一步做什么呢？

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After submitting a pull request, update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See :doc:`/internals/contributing/triaging-tickets` for details.
el: Όταν ένα ticket συνοδεύεται από ένα patch, θα χρειαστεί να κοιταχτεί και από άλλους. Αφού κατατεθεί ένα pull request, θα πρέπει να ενημερώσετε τα metadata του ticket θέτοντας τα κατάλληλα flags πάνω σε αυτό, πχ "has patch", "doesn't need tests" κλπ, ούτως ώστε άλλοι προγραμματιστές να μπορέσουν να το βρουν και να το κοιτάξουν και εκείνοι. Η συνεισφορά δεν σημαίνει πάντα να γράφετε ένα patch από το μηδέν. Αναθεωρώντας ήδη υπάρχοντα patches αποτελεί μια πολύ σημαντική συνεισφορά. Δείτε λεπτομέρειες στο :doc:`/internals/contributing/triaging-tickets`.
it: Dopo che un ticket ottiene una patch, necessita di una revisione da parte di un altro paio di occhi. Dopo aver inviato una pull request, aggiorna i metadati del ticket impostando il flag in modo che indichi "has patch", "doesn't need tests" ecc..., così che altri possano trovarlo e rivederlo. Contribuire non vuol dire sempre scrivere una patch da zero. Rivedere le patch esistenti è un tipo di contributo altresì utile. Vedi :doc:`/internals/contributing/triaging-tickets` per ulteriori dettagli.
zh_hans: 工单有了补丁后，需要他人来复审。提交 pull 请求后，为工单打上如“有补丁”，“无需测试”之类的标签，如此他人便可查找到该工单以便复审。从头开始编写补丁固然是贡献的一种方式，但复审已有补丁同样能帮助 Django。 查看 :doc:`/internals/contributing/triaging-tickets` 了解更多。

source: Before you can use Django, you'll need to get it installed. We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a minimal installation that'll work while you walk through the introduction.
it: Prima di poter usare Django, devi installarlo. Abbiamo una :doc:`guida completa di installazione</topics/install>` che illustra tutte le possibilità; questa guida ti porterà ad una installazione minimale che andrà bene fintanto che seguirai l'introduzione.

source: Get the latest version of Python at https://www.python.org/downloads/ or with your operating system's package manager.
it: Ottieni l'ultima versione di Python a https://www.python.org/downloads/ o con il package manager del tuo sistema operativo.
zh_hans: 最新版本的 Python 可以通过访问 https://www.python.org/downloads/ 或者操作系统的包管理工具获取。

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MariaDB, MySQL, or Oracle. To install such a database, consult the :ref:`database installation information <database-installation>`.
it: Questo step è necessario solamente se vuoi lavorare con motori di database "gradi" come PostgreSQL, MariaDB, MySQL o Oracle. Per installare questi database, consulta :ref:`informazioni per l'installazione dei database <database-installation>`.

source: You've got three options to install Django:
it: Hai tre opzioni per installare Django:

source: Install a version of Django :ref:`provided by your operating system distribution <installing-distribution-package>`.
el: Εγκατάσταση μιας έκδοσης του Django η οποία :ref:`παρέχεται από τη διανομή του λειτουργικού σας συστήματος <installing-distribution-package>`.
it: Installa una versione di Django :ref:`fornita dalla distribuzione del tuo sistema operativo `<installing-distribution-package>.
zh_hans: 安装 Django :ref:`provided by your operating system distribution <installing-distribution-package>`。

source: Next, run the Django command-line utilities to create the database tables automatically:
it: Passo successivo, utilizza Django da linea di comando per creare le tabelle nel database automaticamente:

source: The :djadmin:`makemigrations` command looks at all your available models and creates migrations for whichever tables don't already exist. :djadmin:`migrate` runs the migrations and creates tables in your database, as well as optionally providing :doc:`much richer schema control </topics/migrations>`.
it: Il comando :djadmin:`makemigrations` scorre tutti i modelli disponibili e crea migrazioni per tutte le tabelle che ancora non esistono. :djadmin:`migrate` lancia tutte le migrazioni e crea le tabelle nel tuo database, fornendo allo stesso tempo come opzione un :doc:`controllo dello schema molto più ricco</topics/migrations>`.

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data. The API is created on the fly, no code generation necessary::
it: Così, hai ottenuto una :doc:`Python API </topics/db/queries>` ricca e gratuita per accedere ai tuoi dati. La API viene creata sul momento, senza creazione di codice::

source: Once your models are defined, Django can automatically create a professional, production ready :doc:`administrative interface </ref/contrib/admin/index>` -- a website that lets authenticated users add, change and delete objects. The only step required is to register your model in the admin site:
it: Una volta che i modelli sono definiti, Django può creare una automaticamente una :doc:`interfaccia amministrativa</ref/contrib/admin/index>` professionale e production-ready -- un sito web che permette agli utenti autenticati di aggiungere, cambiare e cancellare oggetti. L'unico step richiesto è quello di registrare il tuo modello nel sito di amministrazione:

source: The philosophy here is that your site is edited by a staff, or a client, or maybe just you -- and you don't want to have to deal with creating backend interfaces only to manage content.
it: La filosofia qui è che il tuo sito viene modificato da uno staff, un cliente o magari proprio da te -- e tu non vuoi dover avere a che fare con la creazione dell'interfaccia di backend solo per gestire il contenuto.

source: To design URLs for an app, you create a Python module called a :doc:`URLconf </topics/http/urls>`. A table of contents for your app, it contains a mapping between URL patterns and Python callback functions. URLconfs also serve to decouple URLs from Python code.
it: Per pianificare le URL di un app, crea un modulo Python chiamato a :doc:`URLconf </topics/http/urls>`. Una tabella di contenuti della tua app, contiene una corrispondenza tra il pattern URL e le funzioni di callback Python. URLconfs è utile anche per disaccoppiare le URL dal codice Python.
