Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/distributing/#uploading-your-project-to-pypi>`_ for doing this.
zh_hans: 将你的包发布至公共仓库，比如 `the Python Package Index (PyPI)`_。 `packaging.python.org <https://packaging.python.org>`_ 有一个不错的 `教程 <https://packaging.python.org/distributing/#uploading-your-project-to-pypi>`_ 说明如何发布至公共仓库。

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <https://virtualenv.pypa.io/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
el: Τυπικά, αυτές οι καταστάσεις, προκύπτουν μόνο αν διατηρείτε πολλαπλά Django projects. Σε τέτοιες περιπτώσεις, η καλύτερη λύση είναι να χρησιμοποιήσετε ένα `virtualenv <https://virtualenv.pypa.io/>`_. Αυτό το εργαλείο σας επιτρέπει να διατηρείτε πολλαπλά απομονωμένα Python environments, όπου το καθένα έχει ένα δικό του αντίγραφο βιβλιοθηκών καθώς και namespace των packages. Ίσως να μπορεί να παρομοιαστεί με το virtualbox -- πολλά λειτουργικά περιβάλλοντα όπου το καθένα είναι απομονωμένο από το άλλο.
zh_hans: 一般来说，这些状况只在你同时运行多个 Django 项目时出现。当这个问题出现时，最好的解决办法是使用 `virtualenv <https://virtualenv.pypa.io/>`_。这个工具允许你同时运行多个相互独立的Python环境，每个环境都有各自库和应用包命名空间的拷贝。

source: This tutorial is written for Django |version|, which supports Python 3.4 and later. If the Django version doesn't match, you can refer to the tutorial for your version of Django by using the version switcher at the bottom right corner of this page, or update Django to the newest version. If you're using an older version of Python, check :ref:`faq-python-version-support` to find a compatible version of Django.
zh_hans: 这个教程是为了 Django |version| 写的，它支持 Python 3.4 和后续版本。如果 Django 的版本不匹配，你可以通过页面右下角的版本切换器切换到对应你版本的教程，或更新至最新版本。如果你正在使用一个较老版本的 Python，在 :ref:`faq-python-version-support` 查找一个合适的 Django 版本。

source: There's no need to add URL cruft such as ``.html`` -- unless you want to, in which case you can do something like this::
zh_hans: 为每个 URL 加上不必要的东西，例如 ``.html`` ，是没有必要的。不过如果你非要加的话，也是可以的::
