Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: We use this approach to teach you how to override templates. In an actual project, you would probably use the :attr:`django.contrib.admin.AdminSite.site_header` attribute to more easily make this particular customization.
el: Χρησιμοποιούμε αυτή τη διαδικασία για να σας δείξουμε πως μπορείτε να κάνετε override τα templates. Σε ένα πραγματικό project, το πιο πιθανόν είναι να χρησιμοποιήσετε το attibute :attr:`django.contrib.admin.AdminSite.site_header` κάνοντας την παραπάνω διαδικασία ακόμα πιο εύκολη.
it: Usiamo questo approccio per insegnarti come sovrascrivere i modelli. In un progetto reale, probabilmente useresti l'attributo: :attr:`django.contrib.admin.AdminSite.site_header` per realizzare più facilmente questa particolare personalizzazione.
ja: 他のテンプレートのオーバーライドも、このような方法で行います。実際のプロジェクトで今行ったのと同じカスタマイズを行いたい場合には、:attr:`django.contrib.admin.AdminSite.site_header` 属性を使えば、もっと簡単に設定できます。
pl: Używamy tego podejścia, aby nauczyć cię jak nadpisywać szablony. W prawdziwym projekcie, prawdopodobnie użyłbyś atrybutu :attr:`django.contrib.admin.AdminSite.site_header`, aby w prostszy sposób zrobić tę konkretną zmianę.
zh_hans: 我们会用这个方法来教你复写模板。在一个实际工程中，你可能更期望使用 :attr:`django.contrib.admin.AdminSite.site_header` 来进行简单的定制。

source: This template file contains lots of text like ``{% block branding %}`` and ``{{ title }}``. The ``{%`` and ``{{`` tags are part of Django's template language. When Django renders ``admin/base_site.html``, this template language will be evaluated to produce the final HTML page, just like we saw in :doc:`Tutorial 3 </intro/tutorial03>`.
el: Αυτό το αρχείο template περιέχει αρκετό κείμενο όπως ``{% block branding %}`` και ``{{ title }}``. Τα tags ``{%`` και ``{{`` είναι μέρος της γλώσσας template του Django. Όταν το Django κάνει render το αρχείο ``admin/base_site.html``, αυτή η γλώσσα θα τρέξει και θα γεμίσει αυτά τα tags με διάφορες τιμές για να παραχθεί στο τέλος η HTML σελίδα που θα επιστρέψει πίσω στον χρήστη (ως response), όπως είδαμε στον :doc:`Οδηγό 3 </intro/tutorial03>`.
it: Questo file di template contiene molto testo come ``{% block branding %}`` e ``{{ title }}``. I tag ``{%`` e ``{{`` sono parte del linguaggio di template di Django. Quando Django mostra ``admin/base_site.html``, questo linguaggio di template sarà valutato per produrre la pagina HTML finale, come abbiamo visto in :doc:`Tutorial 3 </intro/tutorial03>`.
ja: このテンプレートファイルは "{% block branding %}" や "{{ title }}" のようなテキストを多く含んでいます。 "{%" と "{{" タグは Django のテンプレート言語の一部です。 :doc:`チュートリアル その3 </intro/tutorial03>` で見たように、Djangoが "admin/base_site.html" をレンダリングする時に、このテンプレート言語が評価され、最終的なHTMLページが生成されます。
pl: Ten plik szablonu zawiera pełno tekstów typu ``{% block branding %}`` i ``{{ title }}``. Tagi ``{%`` i ``{{`` są częścią języka szablonów Django. Kiedy Django renderuje ``admin/base_site.html``, ten język szablonów jest ewaluowany i produkuje ostateczną stronę HTML, tak jak widzieliśmy w :doc:`Tutorialu 3 </intro/tutorial03>`.
zh_hans: 这个模板文件包含很多类似 ``{% block branding %}`` 和 ``{{ title }}`` 的文本。 ``{%`` 和 ``{{`` 标签是 Django 模板语言的一部分。当 Django 渲染 ``admin/base_site.html`` 时，这个模板语言会被求值，生成最终的网页，就像我们在 :doc:`教程第 3 部分 </intro/tutorial03>` 所学的一样。

source: Note that any of Django's default admin templates can be overridden. To override a template, just do the same thing you did with ``base_site.html`` -- copy it from the default directory into your custom directory, and make changes.
el: Σημειώστε ότι κάθε template του Django μπορεί να γίνει overridden. Το μόνο που έχετε να κάνετε είναι να ακολουθήσετε την ίδια διαδικασία που κάναμε παραπάνω για το αρχείο ``base_site.html`` -- το αντιγράφετε από την αρχική του θέση (πηγαίο κώδικα του Django) στο φάκελο που κρατάει τα templates της εφαρμογής σας. Αφού αντιγραφεί, μετά είστε ελεύθεροι να κάνετε τυχόν αλλαγές της αρέσκειας σας.
ja: Django のデフォルトの admin 用テンプレートは上書き可能です。上書きするには、ただ ``base_site.html`` にしたことと同じことをしてください。デフォルトのディレクトリからカスタム用のディレクトリにコピーして、変更してください。
pl: Zwróć uwagę, że każdy domyślny szablon panelu administracyjnego Django może być nadpisany. Aby nadpisać szablon, po prostu zrób tę samą czynność, którą zrobiłeś z ``base_site.html`` – skopiuj je z domyślnego katalogu do swojego własnego katalogu i zrób zmiany.
zh_hans: 注意，所有的 Django 默认后台模板均可被复写。若要复写模板，像你修改 ``base_site.html`` 一样修改其它文件——先将其从默认目录中拷贝到你的自定义目录，再做修改。

source: Customizing your *application's* templates
el: Παραμετροποιώντας τα templates της *εφαρμογής* σας
it: Personalizzare i template della tua *applicazione*
ja: *アプリケーション用の* テンプレートをカスタマイズする
pl: Zmiana szablonów twojej ``aplikacji``
zh_hans: 自定义你 *应用的* 模板

source: Astute readers will ask: But if :setting:`DIRS <TEMPLATES-DIRS>` was empty by default, how was Django finding the default admin templates? The answer is that, since :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is set to ``True``, Django automatically looks for a ``templates/`` subdirectory within each application package, for use as a fallback (don't forget that ``django.contrib.admin`` is an application).
el: Οι προσεκτικοί αναγνώστες θα αναρρωτηθούν: Αφού η ρύθμιση (λίστα) :setting:`DIRS <TEMPLATES-DIRS>` είναι κενή αρχικά, πως ξέρει το Django που να βρει τα προεπιλεγμένα admin templates; Η απάντηση έχει ως εξής: εφόσον η ρύθμιση (boolean) :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` έχει την τιμή ``True``, το Django αυτόματα κοιτάζει στο φάκελο ``templates/`` κάθε εφαρμογής (που συμπεριλαμβάνεται στη ρύθμιση-λίστα :setting:`INSTALLED_APPS`), για τη χρήση τους ως fallback (μην ξεχνάτε ότι το ``django.contrib.admin`` είναι και αυτό μια εφαρμογή).
it: I lettori più attenti chiederanno: Ma se: l'impostazione: `DIRS <TEMPLATES-DIRS>` era vuota per impostazione predefinita, come ha fatto Django a trovare i modelli di amministrazione predefiniti? La risposta è che, poiché :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` è impostato su ``True``, Django cerca automaticamente una sottodirectory ``templates/`` all'interno di ogni pacchetto dell'applicazione, da usare come fallback (non dimenticare che ``django.contrib.admin`` è un'applicazione).
ja: するどい読者はこう質問されるでしょう: :setting:`DIRS <TEMPLATES-DIRS>` はデフォルトで空っぽなのに、Djangoはなぜデフォルトのadminテンプレートを見つけることができたのだろう? その答えは:setting:`APP_DIRS <TEMPLATES-APP_DIRS>` が ``True`` に設定されているため、Djangoは自動的に各アプリケーションのパッケージのサブディレクトリからフォールバックとして``templates/``を探すからです(``django.contrib.admin`` は一つのアプリケーションだということを忘れないでください)。
pl: Bystrzy czytelnicy zapytają: Ale skoro :setting:`DIRS <TEMPLATES-DIRS>` było domyślnie puste, jak Django odnajdywało domyślne szablony admina? Odpowiedzią jest, tak długo jak :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` jest ustawione na ``True``, Django automatycznie szuka podkatalogu ``templates/`` w każdym pakiecie aplikacji, aby użyć go jako fallback (nie zapomnij, że ``django.contrib.admin`` jest aplikacją).
zh_hans: 机智的同学可能会问： :setting:`DIRS <TEMPLATES-DIRS>` 默认是空的，Django 是怎么找到默认的后台模板的？因为 :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` 被置为 ``True``，Django 会自动在每个应用包内递归查找 ``templates/`` 子目录（不要忘了 ``django.contrib.admin`` 也是一个应用）。

source: Our poll application is not very complex and doesn't need custom admin templates. But if it grew more sophisticated and required modification of Django's standard admin templates for some of its functionality, it would be more sensible to modify the *application's* templates, rather than those in the *project*. That way, you could include the polls application in any new project and be assured that it would find the custom templates it needed.
el: Η εφαρμογή ψηφοφορίας μας δεν είναι πολύ περίπλοκη και δεν χρειάζεται κάποια μεγάλη παραμετροποίηση των admin templates. Αλλά αν αναπτυχθεί και μεγαλώσει σε τέτοιο βαθμό που να χρειάζεται απαραιτήτως διάφορες λειτουργικές επεμβάσεις στα default templates του Django, τότε θα ήταν πιο λογικό να γίνει σε επίπεδο *application* (μέσα στο φάκελο templates της εφαρμογής σας) παρά σε επίπεδο *project* (μέσα στο φάκελο templates του project σας). Με αυτό τον τρόπο, θα μπορέσετε να συμπεριλάβετε την εφαρμογή ψηφοφορίας σας σε κάποιο μελλοντικό project και θα είστε σίγουροι ότι τα templates αυτής της εφαρμογής θα εφαρμοστούν αμέσως στο νέο project.
it: La nostra applicazione per i sondaggi non è molto complessa e non necessita di modelli di admin personalizzati. Ma se diventasse più sofisticato e richiedesse la modifica dei modelli di amministrazione standard di Django per alcune delle sue funzionalità, sarebbe più sensato modificare i modelli *nell'applicazione*, piuttosto che quelli nel *progetto*. In questo modo, potresti includere l'applicazione sondaggi in qualsiasi nuovo progetto e avere la certezza che troverà i modelli personalizzati di cui ha bisogno.
ja: 投票アプリケーションはそれほど複雑ではないので、カスタムのアドミンテンプレートは必要ないでしょう。しかしより凝ったものに成長したり、機能のため標準の admin テンプレートの変更は必要となった場合、 *アプリケーションの* テンプレートを編集するのは、 *プロジェクト* のそれを編集するより賢い選択になるでしょう。それにより、投票アプリケーションを他のどの新しいプロジェクトに追加できます。そのアプリが必要としているカスタムテンプレートを見つけることも見つけることもできます。
pl: Nasza aplikacja ankietowa nie jest bardzo złożona i nie potrzebuje customowych szablonów admina. Lecz gdyby urosła do bardziej skomplikowanej i wymagała modyfikacji standardowych szablonów admina do jakiś swoich funkcjonalności, byłoby bardziej rozsądne modyfikować szablony *aplikacji* niż te w *projekcie*. W ten sposób mógłbyś zawrzeć aplikację ankietową w dowolnym nowym projekcie i miałbyś pewność, że odnajdzie customowe szablony, których potrzebuje.
zh_hans: 我们的投票应用不是非常复杂，所以无需自定义后台模板。不过，如果它变的更加复杂，需要修改 Django 的标准后台模板功能时，修改 *应用* 的模板会比 *工程* 的更加明智。这样，在其它工程包含这个投票应用时，可以确保它总是能找到需要的自定义模板文件。

source: See the :ref:`template loading documentation <template-loading>` for more information about how Django finds its templates.
el: Δείτε στο :ref:`εγχειρίδιο (documentation) φόρτωσης των templates <template-loading>` για περισσότερες πληροφορίες σχετικά με το πως το Django βρίσκει-αναζητά τα templates.
it: Vedi la :ref:`documentazione sul caricamento dei template <template-loading>` per ulteriori informazioni su come Django trova i suoi template.
ja: Django のテンプレートの検索方法に関する詳しい情報は、:ref:`テンプレート読み込み ドキュメント <template-loading>` を参照してください。
pl: W :ref:`dokumentacji ładowania szablonów <template-loading>` więcej informacji o tym, jak Django odnajduje swoje szablony.
zh_hans: 更多关于 Django 如何查找模板的文档，参见 :ref:`加载模板文档 <template-loading>`。

source: Customize the admin index page
el: Παραμετροποιώντας την αρχική σελίδα του Django admin
it: Personalizza l'indice dell'amministrazione
ja: admin index ページをカスタムする
pl: Dostosuj stronę indeksu panelu administracyjnego
zh_hans: 自定义后台主页

source: On a similar note, you might want to customize the look and feel of the Django admin index page.
el: Ομοίως, ίσως να θέλετε να παραμετροποιήσετε (να φέρετε στα μέτρα σας) την εμφάνιση της αρχικής σελίδας του Django admin.
it: In modo simile, potresti voler personalizzare l'aspetto della pagina dell'indice di amministrazione di Django.
ja: 近い話題として、 Django の admin index ページのルックアンドフィールをカスタマイズもできます。
pl: W podobnym tonie możesz chcieć zmienić wygląd i odbiór strony indeksu panelu admina Django.
zh_hans: 在类似的说明中，你可能想要自定义 Django 后台索引页的外观。

source: By default, it displays all the apps in :setting:`INSTALLED_APPS` that have been registered with the admin application, in alphabetical order. You may want to make significant changes to the layout. After all, the index is probably the most important page of the admin, and it should be easy to use.
el: Από προεπιλογή, εμφανίζονται όλες οι εφαρμογές (κατά αλφαβητική σειρά) που συμπεριλαμβάνονται στη ρύθμιση (λίστα) :setting:`INSTALLED_APPS` και έχουν γίνει register με το admin. Αν θέλετε να κάνετε σημαντικές αλλαγές στην εμφάνιση της αρχικής σελίδας δεν έχετε παρά να βάλετε τη φαντασία σας να δουλέψει. Είναι γνωστό ότι η εμφάνιση της αρχικής σελίδας του admin είναι η πιο σημαντική και θα πρέπει να είναι εύκολο να την παραμετροποιήσετε.
it: Di default, mostra tutte le app in :setting:`INSTALLED_APPS` che sono state registrate con l'applicazione di admin, in ordine alfabetico. Potresti voler apportare modifiche significative al layout. Dopotutto, l'indice è probabilmente la pagina più importante dell'amministratore e dovrebbe essere facile da usare.
ja: デフォルトでは、admin アプリケーションに登録されている :settings:`INSTALLED_APPS` のすべてのアプリケーションが、アルファベット順に表示されてしまいまうので、レイアウトを大きく変更したくなることがあるでしょう。なんといっても、index ページはおそらく admin の中でも最も重要なページなので、使いやすくあるべきですからね。
pl: Domyślnie wyświetla ona wszystkie aplikacje w :setting:`INSTALLED_APPS`, które zostały zarejestrowane z aplikacją admin, w kolejności alfabetycznej. Możesz chcieć dokonać istotnych zmian w wyglądzie. W końcu, strona główna jest prawdopodobnie najważniejszą stroną admina i powinna być łatwa w użyciu.
zh_hans: 默认情况下，它展示了所有配置在 :setting:`INSTALLED_APPS` 中，已通过后台应用注册，按拼音排序的应用。你可能想对这个页面的布局做重大的修改。毕竟，索引页是后台的重要页面，它应该便于使用。

source: The template to customize is ``admin/index.html``. (Do the same as with ``admin/base_site.html`` in the previous section -- copy it from the default directory to your custom template directory). Edit the file, and you'll see it uses a template variable called ``app_list``. That variable contains every installed Django app. Instead of using that, you can hard-code links to object-specific admin pages in whatever way you think is best.
el: To template προς παραμετροποίηση είναι το ``admin/index.html`` (κάντε το ίδιο όπως κάνατε για το αρχείο ``admin/base_site.html`` πριν -- αντιγράψτε το από τον πηγαίο κώδικα του Django στον τοπικό φάκελο templates της εφαρμογής σας). Κατά τη διάρκεια επεξεργασίας του αρχείου θα δείτε ότι χρησιμοποιείται μια template variable με το όνομα ``app_list``. Αυτή η μεταβλητή περιέχει κάθε εγκατεστημένη εφαρμογή στο Django (είναι μέσα στο :setting:`INSTALLED_APPS` και register στο admin). Αντί αυτού, μπορείτε να γράψετε hard-code συνδέσμους σε object-specific admin σελίδες με όποιον τρόπο πιστεύετε ότι είναι καλύτερος.
it: Il modello da personalizzare è ``admin/index.html``. (Fai lo stesso di ``admin/base_site.html`` nella sezione precedente - copialo dalla directory predefinita alla directory del tuo modello personalizzato). Modifica il file e vedrai che utilizza una variabile di modello chiamata ``app_list``. Quella variabile contiene tutte le app Django installate. Invece di usarlo, puoi codificare link a pagine di amministrazione specifiche degli oggetti nel modo che ritieni migliore.
ja: カスタマイズ対象のテンプレートは "admin/index.html" です。 (前セクションで "admin/base_site.html" にしたことと同じことをしてください。デフォルトのディレクトリからコピーして、カスタムテンプレートのディレクトリに配置してください)。編集してみると "app_list" というテンプレート変数が使われているのがわかるでしょう。この変数にはインストールされた全 Django アプリが含まれています。これを使う代わりに、オブジェクトごとの管理ページヘのリンクをハードコードすることができます。
pl: Szablon do dostosowania to ``admin/index.html``. (Zrób to samo co z ``admin/base_site.html`` w poprzedniej sekcji – skopiuj go z domyślnego katalogu do swojego katalogu zmienionych szablonów). Zedytuj plik. Zobaczysz, że używa on zmiennej szablonu o nazwie ``app_list``. Ta zmienna zawiera wyszystkie zainstalowane aplikacje Django. Zamiast jej używać możesz zahardcode'ować linki do adminowych stron obiektów w dowolny sposób, który uznasz za najlepszy.
zh_hans: 需要自定义的模板是 ``admin/index.html``。（像上一节修改 ``admin/base_site.html`` 那样修改此文件——从默认目录中拷贝此文件至自定义模板目录）。打开此文件，你将看到它使用了一个叫做 ``app_list`` 的模板变量。这个变量包含了每个安装的 Django 应用。你可以用任何你期望的硬编码链接（链接至特定对象的管理页）替代使用这个变量。

source: The beginner tutorial ends here. In the meantime, you might want to check out some pointers on :doc:`where to go from here </intro/whatsnext>`.
el: Ο οδηγός για αρχάριους τελειώνει κάπου εδώ. Στο μεταξύ μπορείτε να δείτε προτεινόμενες κατευθύνσεις για το τι να κάνετε έπειτα, στο άρθρο :doc:`τι να κάνω μετά από εδώ </intro/whatsnext>`.
it: Il tutorial per principianti termina qui. Nel frattempo, potresti voler controllare alcuni suggerimenti su :doc:`dove andare da qui </intro/whatsnext>`.
ja: これで、初めての人のためのチュートリアルはおしまいです。:doc:`次のステップへ </intro/whatsnext>` では、ここから進める場所について説明しています。
pl: Tutorial dla początkujących kończy się tutaj. W międzyczasie możesz chcieć sprawdzić niektóre z kierunków wskazanych w :doc:`gdzie iść dalej </intro/whatsnext>`.
zh_hans: 初学者教程到这就结束了。随后，你可能想阅读 :doc:`下一步看什么 </intro/whatsnext>`，看看下一步能做什么。

source: If you are familiar with Python packaging and interested in learning how to turn polls into a "reusable app", check out :doc:`Advanced tutorial: How to write reusable apps</intro/reusable-apps>`.
el: Αν είστε εξοικειωμένοι με το Python packaging και ενδιαφέρεστε να μάθετε πως να μετατρέψετε την εφαρμογή ψηφοφορίας σε "επαναχρησιμοποιήσιμη εφαρμογή", δείτε το άρθρο :doc:`Οδηγός για προχωρημένους: Πως να γράψετε επαναχρησιμοποιήσιμα apps </intro/reusable-apps>`.
it: Se hai familiarità con la creazione di pacchetti Python e sei interessato a imparare come trasformare i sondaggi in una "app riutilizzabile", controlla :doc:`Tutorial avanzato: come scrivere app riutilizzabili</intro/reusable-apps>`.
ja: Python のパッケージングについて知っていて、polls アプリケーションを「再利用可能なアプリケーション」へと変える方法について学びたい場合は、:doc:`チュートリアル 応用編: 再利用可能なアプリケーションの書き方 </intro/reusable-apps>` を読んでみてください。
pl: Jeśli jesteś zaznajomiony z pakietowaniem w Pythonie i zainteresowany jak uczynić ankiety „aplikacją reusable”, sprawdź :doc:`Zaawansowany tutorial: Jak pisać aplikacje do ponownego wykorzystania</intro/reusable-apps>`.
zh_hans: 如果你很熟悉 Python 打包，且对学习如何把投票应用改成“可复用应用”感兴趣，查看 :doc:`进阶教程：如何创建可复用应用 </intro/reusable-apps>`。

source: What to read next
el: Τι να διαβάσετε μετά
it: Cosa leggere dopo
ja: 次のステップへ
pl: Co czytać dalej
zh_hans: 下一步看什么

source: So you've read all the :doc:`introductory material </intro/index>` and have decided you'd like to keep using Django. We've only just scratched the surface with this intro (in fact, if you've read every single word, you've read about 5% of the overall documentation).
el: Έχετε, λοιπόν, διαβάσει όλο το :doc:`εισαγωγικό κομμάτι (Ξεκινώντας) </intro/index>` και αποφασίσατε ότι θέλετε να χρησιμοποιήσετε το Django. Το μόνο που κάναμε στην εισαγωγή ήταν να ξύσουμε την επιφάνεια (στην πραγματικότητα, αν διαβάσατε κάθε λέξη, έχετε καλύψει μόλις το 5% του συνόλου του εγχειριδίου του Django).
it: Quindi hai letto tutto il :doc:`materiale introduttivo </intro/index>` e hai deciso di continuare a usare Django. Abbiamo appena scalfito la superficie con questa introduzione (infatti, se hai letto ogni singola parola, hai letto circa il 5% della documentazione complessiva).
ja: さあ、ここにきたあなたは、:doc:`入門編 </intro/index>` をあらかた読み終えて、 Django を使い続ける決心をしたことだと思います。入門編では、Django のほんの表面的な部分に触れただけにすぎません (実際、入門編の分量は、全体のドキュメ ントの 5% にも満たないのです)。
pl: Więc przeczytałeś cały :doc:`materiał wprowadzający </intro/index>` i zdecydowałeś, że chciałbyś dalej używać Django. Tym wprowadzeniem tylko musnęliśmy powierzchnię (w rzeczywistości jeśli przeczytałeś każde słowo, przeczytałeś około 5% całej dokumentacji).
zh_hans: 如果你已经读完了 :doc:`介绍文档 </intro/index>`，且对继续使用 Django 感兴趣。不过，你读的是整体文档的精简版（实际上，如果你逐字阅读了此文档，你已经阅读了整体文档的 5%）。

source: So what's next?
el: Επόμενα βήματα;
it: Quindi, qual è il prossimo?
ja: さて、次は何をしましょうか？
pl: Więc co dalej?
zh_hans: 那么下一步做什么？

source: Well, we've always been big fans of learning by doing. At this point you should know enough to start a project of your own and start fooling around. As you need to learn new tricks, come back to the documentation.
el: Ανέκαθεν ήμασταν φαν της λογικής ‘μαθαίνω μέσα από πράξεις’. Μέχρι αυτό το σημείο γνωρίζετε αρκετά για να ξεκινήσετε ένα project μόνοι σας και να παίξετε λίγο μαζί του. Όταν θελήσετε να μάθετε νέες τεχνικές-κόλπα δεν έχετε παρά να επισκεφτείτε το documentation του Django.
it: Bene, siamo sempre stati grandi fan dell'imparare facendo. A questo punto dovresti sapere abbastanza per iniziare un tuo progetto e iniziare a sperimentare. Quando avrai bisogno di imparare nuovi trucchi, torna nella documentazione.
ja: そうですね、私たちは「なすことによって学ぶ (learning by doing)」ことがとても大好きですよね。今や、読者のみなさんは自分のプロジェクトを作成して、いろいろと遊んでみるのに十分な段階にあります。もし新しい技を学ぶ必要が出てきたら、その時は、いつでもここに戻って来てください。
pl: Cóż, zawsze byliśmy wielkimi fanami nauki przez robienie. W tym miejscu powinieneś wiedzieć wystarczająco dużo, aby rozpocząć własny projekt i zacząć się wygłupiać. Kiedy będziesz potrzebował nauczyć się nowych trików, wróć do dokumentacji.
zh_hans: 不错，我们已经通过边学边做成为了 Django 的死忠粉了。此时，你应该已经知道如何开始你自己的工程，且会到处搜索其它文档了。想知道更多技巧的话，请回到文档页。

source: We've put a lot of effort into making Django's documentation useful, easy to read and as complete as possible. The rest of this document explains more about how the documentation works so that you can get the most out of it.
el: Έχουμε προσπαθήσει πάρα πολύ ούτως ώστε να κάνουμε το documentation του Django όσο γίνεται πιο χρήσιμο, πλήρες και εύκολο στην ανάγνωση. Στη συνέχεια του παρόντος άρθρου θα ασχοληθούμε με το πως λειτουργεί το documentation προκειμένου να μπορείτε να επωφεληθείτε τα μέγιστα από αυτό.
ja: 私たちは、Django ドキュメントを有意義で、読みやすく、可能な限り完全なものにしようと努力しています。このドキュメントの残りの部分では、読者の皆さんが Django のドキュメントをできるだけ活用できるように、ドキュメントがどういうしくみになっているのかを説明しています。
pl: Włożyliśmy wiele wysiłku w uczynienie dokumentacji Django użyteczną, łatwą w czytaniu i możliwie wyczerpującą. Reszta tego dokumentu wyjaśnia więcej jak działa dokumentacja, abyś mógł z niej dostać jak najwięcej.
zh_hans: 为了使 Django 的文档达到更易使用，更易阅读，更加全面的目的，我们付出了巨大的努力。本文档的剩余部分将更详细地介绍此文档的工作方式，以便您可以充分利用它。

source: (Yes, this is documentation about documentation. Rest assured we have no plans to write a document about how to read the document about documentation.)
el: (Ναι! Αυτό είναι ένα documentation για το documentation. Μείνετε ήσυχοι όμως, δεν σκοπεύουμε να αφιερώσουμε ολόκληρο άρθρο στο πως να διαβάσετε ένα documentation.)
it: (Sì, questa è documentazione sulla documentazione. Puoi essere certo che non abbiamo intenzione di scrivere un documento su come leggere il documento sulla documentazione.)
ja: (そう、これはいわばドキュメントのドキュメントです。ただし、このドキュメントのドキュメントの読み方を説明するドキュメント、などといったものを書いたりはしませんから、安心してくださいね。)
pl: (Tak, to jest dokumentacja dokumentacji. Bądź spokojny – nie mamy planów pisać dokumentu o tym, jak czytać dokument o dokumentacji.)
zh_hans: （是的，这就是传说中的说明文档的说明文档。请放心，我们不打算写一篇关于如何阅读此文档的文档。）

source: Finding documentation
el: Βρίσκοντας κάτι μέσα στο εγχειρίδιο
it: Trovare la documentazione
ja: ドキュメントの探し方
pl: Odnajdywanie dokumentacji
zh_hans: 查找文档

source: Django's got a *lot* of documentation -- almost 450,000 words and counting -- so finding what you need can sometimes be tricky. A few good places to start are the :ref:`search` and the :ref:`genindex`.
el: Το Django έχει *πλούσιο* εγχειρίδιο -- περίπου 450,000 λέξεις που συνεχίζουν να αυξάνονται -- οπότε το να βρει κανείς αυτό που αναζητά μπορεί να αποδειχθεί δύσκολο. Μερικά σημεία για να ξεκινήσετε είναι η σελίδα :ref:`Αναζήτησης <search>` και η σελίδα :ref:`Περιεχομένων <genindex>`.
ja: Django には、いまや約 450,000 語以上のたくさんドキュメントがあるので、その中から必要なものを捜し出すのは大変です。そういうときは、:ref:`search` や :ref:`genindex` から辿るとよいでしょう。
pl: Django ma *obszerną* dokumentację – prawie 450 000 słów i więcej – więc odnalezienie tego, co potrzebujesz, może czasem być zawiłe. Kilkoma dobrymi miejscami do startu są :ref:`search` i :ref:`genindex`.
zh_hans: Django有 *许多* 的文档——差不多有 450000 字（英文单词），所以查找你需要的文档可能需要点技巧。对此，有几个不错的去处，:ref:`search` 和 :ref:`genindex`。

source: Or you can just browse around!
el: Ή, απλά, μπορείτε να περιηγηθείτε σε ολόκληρο το site!
it: O puoi semplicemente curiosare!
ja: もちろん、片っ端から読み進むのもいいですけどね。
pl: Lub możesz po prostu przeglądać zawartość!
zh_hans: 或者你可以只是四处看看！

source: How the documentation is organized
el: Πως είναι οργανωμένο το documentation
it: Com'è organizzata la documentazione
ja: ドキュメントの構成
pl: Jak zorganizowana jest dokumentacja
zh_hans: 文档是如何组成
