Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: To create your app, make sure you're in the same directory as :file:`manage.py` and type this command:
el: Για να δημιουργήσετε το app, σιγουρευτείτε ότι βρίσκεστε στο ίδιο επίπεδο με το αρχείο :file:`manage.py` και πληκτρολογήστε την εντολή:
it: Per creare la tua app, sii sicuro di essere nella stessa cartella di :file:`manage.py` e scrivi il seguente commando:
ja: アプリケーションを作るには、 :file:`manage.py` と同じディレクトリに入って、このコマンドを実行します:
pl: Aby stworzyć swoją aplikację, upewnij się, że jesteś w tym samym katalogu co :file:`manage.py` i wpisz tę komendę:
zh_hans: 请确定你现在处于 :file:`manage.py` 所在的目录下，然后运行这行命令来创建一个应用：

source: That'll create a directory :file:`polls`, which is laid out like this::
el: Συγχαρητήρια και πάλι! Μόλις φτιάξατε την πρώτη σας εφαρμογή στο Django. Βέβαια δεν κάνει τίποτα ακόμα αλλά θα φτάσουμε και εκεί. Η εντολή θα δημιουργήσει ένα φάκελο :file:`polls`, ο οποίος αναπτύσσεται ως εξής::
it: Creiamo la nostra cartella :file:`polls`,che viene disposta in questo modo ::
ja: このコマンドは :file:`polls` というディレクトリを作成します。中身はこのようになっています::
pl: Stworzy ona katalog :file:`polls`, który jest tak rozplanowany::
zh_hans: 这将会创建一个 :file:`polls` 目录，它的目录结构大致如下：

source: This directory structure will house the poll application.
el: Αυτή η δομή θα εσωκλείει ολόκληρη την εφαρμογή μας.
it: La struttura di questa cartella contiene la nostra applicazione sondaggio.
ja: このディレクトリ構造が、 poll アプリケーションの全体像です。
pl: Ta struktora katalogów będzie domem dla aplikacji ankietowej.
zh_hans: 这个目录结构包括了投票应用的全部内容。

source: Write your first view
el: Γράφοντας το πρώτο σας view
it: Scrivi la tua prima vista
ja: はじめてのビュー作成
pl: Napisz swój pierwszy widok
zh_hans: 编写第一个视图

source: Let's write the first view. Open the file ``polls/views.py`` and put the following Python code in it:
el: Ας γράψουμε το πρώτο μας view. Ανοίξτε το αρχείο ``polls/views.py`` και γράψτε τον ακόλουθο Python κώδικα:
it: Scriviamo la nostra prima vista. Apri il file ``polls/views.py`` e scrivi il seguente codice Python:
ja: 最初のビューを書いてみましょう。 ``polls/views.py`` を開いて、以下の Python コードを書いてください:
pl: Napiszmy pierwszy widok. Otwórz plik ``polls/views.py`` i umieść tam następujący pythonowy kod:
zh_hans: 让我们开始编写第一个视图吧。打开 ``polls/views.py``，把下面这些 Python 代码输入进去：

source: This is the simplest view possible in Django. To call the view, we need to map it to a URL - and for this we need a URLconf.
el: Αυτή είναι η πιο απλή μορφή view στο Django. Για να καλέσετε το view, θα πρέπει να το συσχετίσουμε με ένα URL - και γι' αυτό θα χρειαστούμε ένα URLconf.
it: Questa è il metodo più semplice di scrivere una vista in Django. Per fare una chiamata alla vista, dobbiamo mapparla in una URL - e per questo abbiamo bisogno di URLconf.
ja: Django上で最も単純なビューです。ビューを呼ぶために、 URL を対応付けしてやる必要があります。 URLconf が必要ですね。
pl: To jest najprostszy widok, jaki jest możliwy w Django. Aby go wywołać, potrzebujemy zmapować go na URL – i do tego potrzebujemy URLconf.
zh_hans: 这是 Django 中最简单的视图。如果想看见效果，我们需要将一个 URL 映射到它——这就是我们需要 URLconf 的原因了。

source: To create a URLconf in the polls directory, create a file called ``urls.py``. Your app directory should now look like::
el: Για τη δημιουργία του URLconf στον φάκελο polls, δημιουργήστε ένα αρχείο με το όνομα ``urls.py``. Ο φάκελος της εφαρμογής σας θα πρέπει να δείχνει έτσι::
it: Per creare una URLconf nella cartella polls, crea un file col nome ``urls.py``. La cartella della tua app ora dovrebbe essere come::
ja: polls ディレクトリに URLconf を作るには ``urls.py`` というファイルを作ります。アプリのディレクトリはこのようになっているはずです::
pl: Aby stworzyć URLconf w katalogu ankiet, stwórzmy plik o nazwie ``urls.py``. Katalog twojej aplikacji powinien teraz wyglądać tak::
zh_hans: 为了创建 URLconf，请在 polls 目录里新建一个 ``urls.py`` 文件。你的应用目录现在看起来应该是这样：

source: In the ``polls/urls.py`` file include the following code:
el: Μέσα στο αρχείο ``polls/urls.py`` συμπεριλάβετε τον παρακάτω κώδικα:
it: Nel file ``polls/urls.py`` includi il seguente codice:
ja: ``polls/urls.py`` ファイルには以下のコードを書いてください:
pl: W pliku ``polls/urls.py`` zawrzyj następujący kod:
zh_hans: 在 ``polls/urls.py`` 中，输入如下代码：

source: The next step is to point the root URLconf at the ``polls.urls`` module. In ``mysite/urls.py``, add an import for ``django.conf.urls.include`` and insert an :func:`~django.conf.urls.include` in the ``urlpatterns`` list, so you have:
ja: 次のステップはルートのURLconfに``polls.urls`` モジュールの記述を反映させることです。``mysite/urls.py``に ``django.conf.urls.include`` のimportを追加して、 ``urlpatterns``のリストに :func:`~django.conf.urls.include` を挿入します。するとこのようになります:
pl: Następnym krokiem jest wskazanie URLconfowi w korzeniu na moduł ``polls.urls``. W ``mysite/urls.py`` dodaj import dla ``django.conf.urls.include`` i wstaw :func:`~django.conf.urls.include` na listę ``urlpatterns``, aby mieć:

source: When to use :func:`~django.conf.urls.include()`
ja: :func:`~django.conf.urls.include()` を使うとき
pl: Kiedy używać :func:`~django.conf.urls.include()`

source: You should always use ``include()`` when you include other URL patterns. ``admin.site.urls`` is the only exception to this.
el: Θα πρέπει πάντα να χρησιμοποιείτε στην ``include()`` όταν θέλετε να περιλάβετε άλλα URL patterns. Το ``admin.site.urls`` είναι η μόνη εξαίρεση σε αυτό τον κανόνα.
it: Dovresti usare sempre ``include()`` quando includi altri pattern URL. L'unica eccezione a questo è ``admin.site.urls``.
ja: URLパターンをインクルードするときはいつでも ``include()``を使うべきです。``admin.site.urls``はこれについての唯一の例外です。
pl: Powinieneś używać ``include()`` zawsze, gdy uwzględniasz inne wzorce URL. ``admin.site.urls`` jest jedynym wyjątkiem od tej reguły.
zh_hans: 当包括其它 URL 模式时你应该总是使用 ``include()`` ， ``admin.site.urls`` 是唯一例外。

source: Doesn't match what you see?
ja: 自分のレイアウトと違う場合
pl: Nie zgadza się z tym, co widzisz?

source: If you're seeing ``include(admin.site.urls)`` instead of just ``admin.site.urls``, you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
ja: もし ``admin.site.urls`` ではなく ``include(admin.site.urls)`` を閲覧している場合、古いチュートリアルを参照するか、新しいバージョンの Django を入手してください。
pl: Jeśli widzisz ``include(admin.site.urls)`` zamiast tylko ``admin.site.urls``, prawdopodobnie używasz wersję Django, która nie jest zgodna z wersją tego tutoriala. Powinieneś przełączyć się albo na starszą wersję tutoriala, albo nowszą wersję Django.

source: You have now wired an ``index`` view into the URLconf. Lets verify it's working, run the following command:
ja: これで"index"ビューをURLconfに接続を接続しました。下記のコマンドを実行して、動作を確認しましょう:
pl: Podłączyłeś właśnie widok ``index`` do URLconf. Zweryfikujmy, czy działa. Uruchom następujące polecenie:
zh_hans: 你现在把 ``index`` 视图添加进了 URLconf。可以验证是否正常工作，运行下面的命令:

source: Go to http://localhost:8000/polls/ in your browser, and you should see the text "*Hello, world. You're at the polls index.*", which you defined in the ``index`` view.
el: Επισκεφτείτε την σελίδα http://localhost:8000/polls/ με τον browser σας και θα πρέπει να δείτε το κείμενο "*Hello, world. You're at the polls index.*", το οποίο γράψαμε στην ``index`` view.
it: Nel tuo browser vai all'indirizzo http://localhost:8000/polls/ , e dovresti vedere il testo "*Hello, world. You're at the polls index.*", che hai definito nella view ``index``.
ja: ブラウザで http://localhost:8000/polls/ にアクセスすると、"*Hello, world. You're at the polls index.*" と表示されるのが確認できるでしょう。これはビューの``index``で定義したものです。
pl: Przejdź do http://localhost:8000/polls/ w swojej przeglądarce. Powinieneś zobaczyć napis „*Hello, world. You're at the polls index.*”, który zdefiniowałeś w widoku ``index``.
zh_hans: 用你的浏览器访问 http://localhost:8000/polls/，你应该能够看见 "*Hello, world. You're at the polls index.*" ，这是你在 ``index`` 视图中定义的。

source: The :func:`~django.conf.urls.url` function is passed four arguments, two required: ``regex`` and ``view``, and two optional: ``kwargs``, and ``name``. At this point, it's worth reviewing what these arguments are for.
ja: :func:`~django.conf.urls.url` 関数は4つの引数を受け取り、そのうち2つが必須です。 ``regex`` と ``view`` 、オプションで ``kwargs`` と ``name`` です。ここで引数が何のためにあるものかを見ておきましょう。
pl: Do funkcji :func:`~django.conf.urls.url` są przekazane cztery argumenty, dwa wymagane: ``regex`` i ``view`` oraz dwa opcjonalne: ``kwargs`` i ``name``. Warto w tym momencie dowiedzieć się, do czego służą.

source: :func:`~django.conf.urls.url` argument: regex
ja: :func:`~django.conf.urls.url` 引数: regex
pl: Argument :func:`~django.conf.urls.url`: regex

source: The term "regex" is a commonly used short form meaning "regular expression", which is a syntax for matching patterns in strings, or in this case, url patterns. Django starts at the first regular expression and makes its way down the list, comparing the requested URL against each regular expression until it finds one that matches.
ja: "regex" という単語は省略形で、一般的に "regular expression" という意味があります。これは文字列にマッチするパターンの構文で、この場合はURLパターンにあたります。 Django ははじめの正規表現から開始し、リストを順に下に見ていきます。リクエストされたURLと各正規表現を、マッチするものが見つかるまで比較します。
pl: Termin „regex” jest powszechnie używaną krótką formą oznaczającą „wyrażenie regularne”, które jest składnią do dopasowywania wzorców w ciągach znaków, lub w tym przypadku, wzorcach URL-i. Django zaczyna od pierwszego wyrażenia regularnego i idzie w dół listy, porównując zażądany URL z wszystkimi wyrażeniami regularnymi aż odnajdzie takie, które pasuje.

source: Note that these regular expressions do not search GET and POST parameters, or the domain name. For example, in a request to ``https://www.example.com/myapp/``, the URLconf will look for ``myapp/``. In a request to ``https://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
ja: これらの正規表現はGETやPOSTパラメーター、そしてドメイン名をサーチ検索しないことに注意します。例えば、 ``https://www.example.com/myapp/`` へのリクエストにおいては、URLconfは``myapp/``を見ます。``https://www.example.com/myapp/?page=3`` へのリクエストにおいても、URLconfは``myapp/``を見ます。
pl: Zwróć uwagę, że te wyrażenia regularne nie przeszukują parametrów GET i POST lub nazwy domeny. Na przykład, w żądaniu do ``https://www.example.com/myapp/``, URLconf będzie szukał ``myapp/``. W żądaniu do ``https://www.example.com/myapp/?page=3``, URLconf też będzie szukał ``myapp/``.

source: If you need help with regular expressions, see `Wikipedia's entry`_ and the documentation of the :mod:`re` module. Also, the O'Reilly book "Mastering Regular Expressions" by Jeffrey Friedl is fantastic. In practice, however, you don't need to be an expert on regular expressions, as you really only need to know how to capture simple patterns. In fact, complex regexes can have poor lookup performance, so you probably shouldn't rely on the full power of regexes.
ja: 正規表現についてわからないことがあれば `Wikipediaのエントリー`_ と :mod:`re` モジュールのドキュメントを参照してください。オライリーから出版されている Jeffery Friendl の "Mastering Reglar Expressions" も参考になります。しかし実際問題としては、正規表現のエキスパートになる必要はありません。単純なパターンをキャプチャする方法を知っていれば十分です。それに複雑な正規表現はルックアップのパフォーマンスが悪いので、正規表現のフルパワーに依存するのはよくありません。
pl: Jeśli potrzebujesz pomocy z wyrażeniami regularnymi, zobacz `wpis na Wikipedii`_ i dokumentację modułu :mod:`re`. Również fantastyczna jest książka O'Reilly'ego „Mastering Regular Expressions” napisana przez Jeffreya Friedla. Jednakże w praktyce nie musisz być ekspertem od wyrażeń regularnych, bo tak naprawdę potrzebujesz jedynie wiedzieć jak wyłapywać proste wzorce. Tak naprawdę złożone wyrażenia regularne mogą mieć słabą wydajność wyszukiwania, więc prawdopodobnie nie powinieneś polegać na pełnej ich mocy.

source: Finally, a performance note: these regular expressions are compiled the first time the URLconf module is loaded. They're super fast (as long as the lookups aren't too complex as noted above).
ja: パフォーマンスノート: 正規表現は URLconf モジュールが読み込まれた最初にコンパイルされるので、高速に動作します (先ほど述べたように複雑すぎない場合)。
pl: Ostatatecznie, uwaga na temat wydajności: te wyrażenia regularne są kompilowane, gdy po raz pierwszy ładowany jest moduł URLconf. Są super-szybkie (tak długo jak same wyrażenia nie są zbyt skomplikowane, tak jak zauważyliśmy wyżej).

source: :func:`~django.conf.urls.url` argument: view
ja: :func:`~django.conf.urls.url` 引数: view
pl: Argument :func:`~django.conf.urls.url`: view

source: When Django finds a regular expression match, Django calls the specified view function, with an :class:`~django.http.HttpRequest` object as the first argument and any “captured” values from the regular expression as other arguments. If the regex uses simple captures, values are passed as positional arguments; if it uses named captures, values are passed as keyword arguments. We'll give an example of this in a bit.
ja: Django がマッチする正規表現を見つけると、 Django は所定のビュー関数を呼び出します。その際は :class:`~django.http.HttpRequest` オブジェクトを第一引数に、その他、正規表現から「キャプチャされた」値を他の引数に関数を呼び出します。正規表現が単純にキャプチャをしている場合は位置引数として、名前付きでキャプチャしている場合はキーワード引数として呼び出します。少し例を提示します。
pl: Kiedy Django znajdzie pasujące wyrażenie regularne, wywołuje podaną funkcję widoku z obiektem :class:`~django.http.HttpRequest` jako pierwszym argumentem i dowolnymi „złapanymi” wartościami z wyrażenia regularnego jako pozostałymi argumentami. Jeśli regex używa prostych złapań, wartości są przekazane jako argumenty pozycyjne; jeśli używa nazwanych złapań, wartości są przekazane jako argumenty nazwane. Za chwilę damy tego przykład.

source: :func:`~django.conf.urls.url` argument: kwargs
ja: :func:`~django.conf.urls.url` 引数: kwargs
pl: Argument :func:`~django.conf.urls.url`: kwargs

source: Arbitrary keyword arguments can be passed in a dictionary to the target view. We aren't going to use this feature of Django in the tutorial.
el: Επίσης, στο Django view μπορούν να περαστούν, προαιρετικά και αυθαίρετα keyword arguments. Σε αυτό τον οδηγό δεν θα χρησιμοποιήσουμε αυτή τη δυνατότητα.
it: Argomenti arbitrari di parole chiave possono essere passati in un dizionario alla vista di destinazione. Non useremo questa funzionalità di Django nel tutorial.
ja: 任意のキーワード引数を辞書として対象のビューに渡せます。この機能はチュートリアルでは使いません。
pl: Arbitralne argumenty słownikowe mogą być przekazane w słowniku do docelowego widoku. Nie będziemy używać tej funkcjonalności Django w tym tutorialu.
zh_hans: 任意个关键字参数可以作为一个字典传递给目标视图函数。本教程中不会使用这一特性。

source: :func:`~django.conf.urls.url` argument: name
ja: :func:`~django.conf.urls.url` 引数: name
pl: Argument :func:`~django.conf.urls.url`: name

source: Naming your URL lets you refer to it unambiguously from elsewhere in Django especially templates. This powerful feature allows you to make global changes to the url patterns of your project while only touching a single file.
ja: URL に名前付けをしておけば Django のどこからでも明確に参照できます。とくにテンプレートで有効です。この便利な機能のおかげで、プロジェクトのURLにグローバルな変更を加える場合にも1つのファイルを変更するだけで済むようになります。

source: When you're comfortable with the basic request and response flow, read :doc:`part 2 of this tutorial </intro/tutorial02>` to start working with the database.
el: Όταν αισθανθείτε άνετα με αυτό τον οδηγό και με τη λειτουργία της Web request-Web response διαδικασίας μπορείτε να συνεχίσετε στο :doc:`δεύτερο μέρος αυτού του οδηγού </intro/tutorial02>` για να εργαστείτε με τη βάση δεδομένων.
it: Quando sei a tuo agio con il flusso base di richiesta e risposta, leggi :doc:`parte 2 di questo tutorial </intro/tutorial02>` per iniziare a lavorare con il database.
ja: 基本的なリクエストとレスポンスのフローがお好みの場合は、データベースを使った作業を始めるために :doc:`チュートリアルその2 </intro/tutorial02>` を読みましょう。
pl: Jeśli czujesz się dobrze z przepływem żądań i odpowiedzi, przeczytaj :doc:`drugą część tego tutoriala </intro/tutorial02>`, aby zacząć pracę z bazą danych.
zh_hans: 当你了解了基本的请求和响应流程后，请阅读 :doc:`教程的第 2 部分 </intro/tutorial02>` 开始使用数据库.

source: Writing your first Django app, part 2
el: Γράφοντας το πρώτο σας Django app, μέρος 2
it: Scrivere la tua prima applicazione in Django, parte 2
ja: はじめての Django アプリ作成、その2
pl: Pisanie pierwszej aplikacji Django, część 2.
zh_hans: 编写你的第一个 Django 应用，第 2 部分

source: This tutorial begins where :doc:`Tutorial 1 </intro/tutorial01>` left off. We'll setup the database, create your first model, and get a quick introduction to Django's automatically-generated admin site.
el: Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 1 </intro/tutorial01>`. Εδώ, θα ασχοληθούμε με τις ρυθμίσεις της βάσης δεδομένων, θα δημιουργήσουμε το πρώτο μας μοντέλο και θα κάνουμε μια μικρή εισαγωγή στο διαχειριστικό site (admin site) του Django, το οποίο δημιουργείται αυτόματα.
it: Questo tutorial inizia dove il :doc:`Tutorial 1 </intro/tutorial01>` si era interrotto. Configureremo il database, creeremo il tuo primo modello e avremo una rapida introduzione al sito di amministrazione generato automaticamente da Django.
ja: このチュートリアルは :doc:`チュートリアルその 1 </intro/tutorial01>` の続きです。ここでは、データベースをセットアップして、最初のモデルを作成し、そして Django が自動的に生成してくれる管理 (admin) サイトについて、簡単なイントロダクションをします。
pl: Ten tutorial zaczyna się, gdzie skończył się :doc:`Tutorial 1 </intro/tutorial01>`. Będziemy uruchamiać bazę danych, stworzymy twój pierwszy model i przejdziemy krótki wstęp do automatycznie generowanego panelu administracyjnego Django.
zh_hans: 这部分教程从 :doc:`教程第 1 部分 </intro/tutorial01>` 结尾的地方继续讲起。我们将建立数据库，创建您的第一个模型，并主要关注 Django 提供的自动生成的管理页面。

source: Database setup
el: Ρύθμιση της Βάσης Δεδομένων
it: Configurazione del database
ja: Database の設定
pl: Konfiguracja bazy danych
zh_hans: 数据库配置

source: Now, open up :file:`mysite/settings.py`. It's a normal Python module with module-level variables representing Django settings.
el: Στον προηγούμενο οδηγό δεν ασχοληθήκαμε καθόλου με το αρχείο :file:`mysite/settings.py` παρόλο που είπαμε ότι αποτελεί την καρδιά ενός project. Το αρχείο αυτό αποτελεί ένα κοινό Python module στου οποίου οι μεταβλητές (variables) αναπαριστούν τις ρυθμίσεις του Django. Ανοίξτε το αρχείο αυτό.
it: Ora, apri :file:`mysite/settings.py`. Si tratta di un modulo Python normale con le variabili a livello di modulo che rappresentano le impostazioni di Django.
ja: それでは、 :file:`mysite/settings.py` を開いてください。これは、 Django の設定を表現するモジュールレベルの変数を持つ通常の Python モジュールです。
pl: Otwórz teraz :file:`mysite/settings.py`. To normalny moduł Pythona ze zmiennymi poziomu modułu reprezentującymi ustawienia Django.
zh_hans: 现在，打开 :file:`mysite/settings.py` 。这是个包含了 Django 项目设置的 Python 模块。

source: By default, the configuration uses SQLite. If you're new to databases, or you're just interested in trying Django, this is the easiest choice. SQLite is included in Python, so you won't need to install anything else to support your database. When starting your first real project, however, you may want to use a more robust database like PostgreSQL, to avoid database-switching headaches down the road.
ja: デフォルトでは、データベースとしてSQLiteを利用するように設定されています。もしあなたがデータベースに詳しくなく、もしくはDjangoに興味を持って試してみているところならば、SQLiteを利用するのが最も簡単でしょう。SQLiteはPythonに標準で組み込まれているため、データベースを利用するために何か別のものをインストールする必要がありません。ただし、あなたが実際に利用されるプロジェクトを開発するならば、いつか将来にデータベースを変更する手間を考えると、PostgreSQLのように、より堅牢なデータベースを利用したくなるでしょう。

source: If you wish to use another database, install the appropriate :ref:`database bindings <database-installation>` and change the following keys in the :setting:`DATABASES` ``'default'`` item to match your database connection settings:
el: Αν επιθυμείτε να χρησιμοποιήσετε διαφορετική βάση δεδομένων από την SQLite, εγκαταστήστε πρώτα τις κατάλληλες :ref:`βιβλιοθήκες βάσης δεδομένων <database-installation>` και μετά αλλάξτε τα ακόλουθα keys στη ρύθμιση :setting:`DATABASES` ``'default'`` ούτως ώστε να ταιριάζουν με τη δική σας σύνδεση στη βάση δεδομένων:
it: Se desideri utilizzare un altro database, installa l'appropriato :ref:`database bindings <database-installation>` e modifica le seguenti chiavi nella voce :setting:`DATABASES` ``'default'`` in modo che corrispondano alle impostazioni di connessione del database:
ja: 他のデータベースを使いたい場合、適当な :ref:`データベースのバインディング <database-installation>` をインストールして、設定ファイルの :setting:`DATABASES` の``'default'`` アイテム内の以下のキーを、それぞれデータベースの接続設定に合ったものに変更してください。
pl: Jeśli chcesz używać innej bazy danych, zainstaluj odpowiednie :ref:`wiązania dla niej <database-installation>` i zmień następujące klucze elemencie ``'default'`` ustawienia :setting:`DATABASES`, aby zgadzały się z ustawieniami połączenia do twojej bazy danych:
zh_hans: 如果你想使用其他数据库，你需要安装合适的 :ref:`database bindings <database-installation>` ，然后改变设置文件中 :setting:`DATABASES` ``'default'`` 项目中的一些键值：

source: :setting:`ENGINE <DATABASE-ENGINE>` -- Either ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, or ``'django.db.backends.oracle'``. Other backends are :ref:`also available <third-party-notes>`.
el: :setting:`ENGINE <DATABASE-ENGINE>` -- Είτε ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, ή ``'django.db.backends.oracle'``. Άλλα backends είναι :ref:`επίσης διαθέσιμα <third-party-notes>`.
it: :setting:`ENGINE <DATABASE-ENGINE>` -- In alternativa``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'``, o ``'django.db.backends.oracle'``. Altri backend :ref:`sono anche disponibili <third-party-notes>`.
ja: :setting:`ENGINE <DATABASE-ENGINE>` -- ``'django.db.backends.sqlite3'``、``'django.db.backends.postgresql'``、``'django.db.backends.mysql'`` または ``'django.db.backends.oracle'`` のいずれかにします。:ref:`その他のバックエンド <third-party-notes>` も利用可能です。
pl: :setting:`SILNIK <DATABASE-ENGINE>` – ``'django.db.backends.sqlite3'``, ``'django.db.backends.postgresql'``, ``'django.db.backends.mysql'`` lub ``'django.db.backends.oracle'``. :ref:`Dostępne są także <third-party-notes>` inne back-endy.
zh_hans: :setting:`ENGINE <DATABASE-ENGINE>` -- 可选值有 ``'django.db.backends.sqlite3'``，``'django.db.backends.postgresql'``，``'django.db.backends.mysql'``，或 ``'django.db.backends.oracle'``。其它 :ref:`可用后端 <third-party-notes>`。

source: :setting:`NAME` -- The name of your database. If you're using SQLite, the database will be a file on your computer; in that case, :setting:`NAME` should be the full absolute path, including filename, of that file. The default value, ``os.path.join(BASE_DIR, 'db.sqlite3')``, will store the file in your project directory.
el: :setting:`NAME` -- Το όνομα της βάσης δεδομένων σας. Αν χρησιμοποιείτε την SQLite, το όνομα της βάσης θα είναι το ίδιο με το όνομα του αρχείου στον υπολογιστή σας. Σε αυτή την περίπτωση, το :setting:`NAME` θα είναι το πλήρες μονοπάτι (path) συμπεριλαμβανομένου και του ονόματος+κατάληξη του αρχείου. Η προεπιλεγμένη τιμή, ``os.path.join(BASE_DIR, 'db.sqlite3')``, θα αποθηκεύσει το αρχείο στο root φάκελο του project σας.
ja: :setting:`NAME` -- データベースの名前です。SQLite を使用している場合、データベースはコンピュータ上のファイルになります。その場合、:setting:`NAME` には、そのファイルのファイル名を含んだ絶対パスを指定する必要があります。デフォルト値は ``os.path.join(BASE_DIR, 'db.sqlite3')`` で、ファイルはプロジェクトのディレクトリに保存されます。
pl: :setting:`NAME` – nazwa twojej bazy danych. Jeśli używasz SQLite'a, baza danych będzie plikiem na twoim komputerze; w tym przypadku :setting:`NAME` powinno być pełną bezwzględną ścieżką, zawierającą nazwę, tego pliku. Domyślna wartość, ``os.path.join(BASE_DIR, 'db.sqlite3')``, przechowa plik w katalogu twojego projektu.
zh_hans: :setting:`NAME` - 数据库的名称。如果使用的是 SQLite，数据库将是你电脑上的一个文件，在这种情况下， :setting:`NAME` 应该是此文件的绝对路径，包括文件名。默认值 ``os.path.join(BASE_DIR, 'db.sqlite3')`` 将会把数据库文件储存在项目的根目录。
