Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: If your background is in plain old PHP (with no use of modern frameworks), you're probably used to putting code under the Web server's document root (in a place such as ``/var/www``). With Django, you don't do that. It's not a good idea to put any of this Python code within your Web server's document root, because it risks the possibility that people may be able to view your code over the Web. That's not good for security.
el: Αν στο παρελθόν εργαζόσασταν με PHP (χωρίς τη χρήση κάποιου μοντέρνου framework), τότε μάλλον θα έχετε συνηθίσει να αποθηκεύετε το project σας στον root φάκελο του Web server σας (όπως για παράδειγμα στο ``/var/www``). Με το Django, δεν το κάνετε κατ' αυτό τον τρόπο. Δεν είναι καλή ιδέα να βάλετε οποιοδήποτε κομμάτι του Python κώδικα στο root φάκελο του Web server επειδή αυξάνει την πιθανότητα κάποιοι να μπορούν να δουν τον κώδικα σας μέσω του Web. Αυτό, επίσης, δεν είναι καθόλου καλό όσον αφορά την ασφάλεια (security).
it: Se provieni da semplice vecchio PHP (senza uso di framework moderni), probabilmente sei abituato a mettere il codice diremmente sotto la document root del server Web (in un posto quale ``/var/www``). Con Django, non fai così. Non è una buona idea mettere alcuno di questo codice Python all'interno della document root del tuo server Web, perché rischi la possibilità che il pubblico possa vedere il tuo codice attraverso il Web. Non è una buona idea per la sicurezza.
ja: (モダンなフレームワークを使わない) 古いプレーンな PHP の経験があるなら、これまでは Web サーバのドキュメントルート下 (``/var/www`` といった場所) にコードを配置してきたことでしょう。 Django ではそうしないでください｡ Python コードを Web サーバーのドキュメントルート下に置かないでください｡コードをドキュメントルート下に置くと、 誰かがコードを Web を介して読めるようになってしまうからです。これは安全上良くありません。
pl: Jeśli w przeszłości używałeś zwykłego starego PHP (bez użycia nowoczesnych frameworków), prawdopodobnie zwykłeś umieszczać kod w głównym katalogu serwera WWW (takim jak ``/var/www``). W Django nie robi się w ten sposób. Nie jest dobrym pomysłem umieszczać jakiegokolwiek z tego kodu Pythona w katalogu głównym serwera WWW, ponieważ stwarza to ryzyko pojawienia się możliwości, aby ktoś był w stanie widzieć twój kod w Internecie. Nie jest to bezpieczne.
zh_hans: 如果你曾经是原生 PHP 程序员（没有使用过现代框架），你可能会习惯于把代码放在 Web 服务器的文档根目录(诸如 ``/var/www``)。当使用 Django 时不需要这样做。把所有 Python 代码放在 Web 服务器的根目录不是个好主意，因为这样会有风险。比如会提高人们在网站上看到你的代码的可能性。这不利于网站的安全。

source: Put your code in some directory **outside** of the document root, such as :file:`/home/mycode`.
el: Αντιθέτως, μπορείτε να βάλετε τον κώδικα σας σε κάποιον φάκελο **έξω** από το root φάκελο του Web server, όπως :file:`/home/mycode`.
it: Metti il tuo codice in qualche directory **fuori** dalla document root, quale :file:`/home/mycode`.
ja: コードはドキュメントルートの外､例えば ``/home/mycode`` の ような場所に置きましょう。
pl: Umieść swój kod w jakimś katalogu **poza** katalogiem głównym, na przykład w :file:`/home/mycode`.
zh_hans: 把你的代码放在文档根目录 **以外** 的某些地方吧，比如 `/home/mycode`。

source: Let's look at what :djadmin:`startproject` created::
el: Ας δούμε τώρα τι δημιούργησε η εντολή :djadmin:`startproject`::
it: Diamo un'ochiata a cosa :djadmin:`startproject` ha creato::
ja: :djadmin:`startproject` が何を作成したかをみてみましょう::
pl: Spójrzmy co stworzyło :djadmin:`startproject`::
zh_hans: 让我们看看 :djadmin:`startproject` 创建了些什么::

source: These files are:
el: Αυτά τα αρχεία είναι:
it: Questi file sono:
ja: ファイルはそれぞれ以下のような役割を持っています::
pl: Te pliki to:
zh_hans: 这些目录和文件的用处是：

source: The outer :file:`mysite/` root directory is just a container for your project. Its name doesn't matter to Django; you can rename it to anything you like.
el: Ο φάκελος :file:`mysite/` είναι ο root φάκελος του project σας. Το όνομα του δεν ενδιαφέρει το Django. Μπορείτε να το μετονομάσετε όπως θέλετε (είναι το όνομα που δώσατε στην εντολή ``django-admin startproject``).
ja: 外側の :file:`mysite/` ルートディレクトリは、このプロジェクトのただの入れ物です。 この名前は Django に関係しませんので、好きな名前に変更できます。
pl: Zewnętrzny katalog główny :file:`mysite/` jest tylko pojemnikiem na twój projekt. Jego nazwa nie ma znaczenia dla Django; możesz zmienić jego nazwę na dowolną, jaką chcesz.
zh_hans: 最外层的:file: `mysite/` 根目录只是你项目的容器， Django 不关心它的名字，你可以将它重命名为任何你喜欢的名字。

source: :file:`manage.py`: A command-line utility that lets you interact with this Django project in various ways. You can read all the details about :file:`manage.py` in :doc:`/ref/django-admin`.
el: :file:`manage.py`: Αυτό το αρχείο αποτελεί εντολή (κονσόλας) την οποία μπορείτε να χρησιμοποιήσετε (και θα το κάνετε) για να αλληλεπιδράτε με το project σας για διάφορους λόγους (π.χ δημιουργία πινάκων στη database, εκκίνηση του προ-εγκατεστημένου server κλπ). Μπορείτε να διαβάσετε όλες τις λεπτομέρειες σχετικά με το αρχείο :file:`manage.py` στο :doc:`/ref/django-admin`.
it: :file:`manage.py`: Una utility da linea di comando che ti permette di interagire con questo progetto in svariate maniere. Puoi leggere tutti i dettagli a proposito di :file:`manage.py` in in :doc:`/ref/django-admin`.
ja: :file:`manage.py`: Django プロジェクトに対する様々な操作を行うためのコマンドラインユーティリティです｡詳しくは :doc:`/ref/django-admin` 内の :file:`manage.py` を参照してください｡
pl: :file:`manage.py`: Narzędzie linii komend, które pozwala ci oddziaływać z tym projektem Django na wiele sposobów. Możesz przeczytać szczegóły na temat :file:`manage.py` w :doc:`/ref/django-admin`.
zh_hans: :file:`manage.py`: 一个让你用各种方式管理 Django 项目的命令行工具。你可以阅读 :doc:`/ref/django-admin` 获取所有 :file:`manage.py` 的细节。

source: The inner :file:`mysite/` directory is the actual Python package for your project. Its name is the Python package name you'll need to use to import anything inside it (e.g. ``mysite.urls``).
el: Ο εσωτερικός φάκελος :file:`mysite/` είναι ένα τυπικό Python package για το project σας. Το όνομα του (έχει σημασία) θα το χρησιμοποιήσετε για να κάνετε import οτιδήποτε σε άλλα Python packages (π.χ ``import mysite.urls``).
it: La cartella interna :file:`mysite/` è il vero pacchetto Python per il tuo progetto. Il suo nome è il nome del pacchetto Python che dovrai usare per importare qualsiasi cosa dall'interno di esso. (es. ``mysite.urls``).
ja: 内側の :file:`mysite/` ディレクトリは、このプロジェクトの本当の Python パッケージです。この名前が Python パッケージの名前であり、 import の際に 使用する名前です (例えば import ``mysite.urls``) 。
pl: Wewnętrzny katalog :file:`mysite/` jest właściwym pakietem Pythona dla twojego projektu. Jego nazwa jest nazwą pakietu Pythona, którą musisz używać, aby zaimportować cokolwiek w tym pakiecie (np. ``mysite.urls``).
zh_hans: 里面一层的 :file:`mysite/` 目录包含你的项目，它是一个纯 Python 包。它的名字就是当你引用它内部任何东西时需要用到的 Python 包名。 (比如 ``mysite.urls``).

source: :file:`mysite/__init__.py`: An empty file that tells Python that this directory should be considered a Python package. (Read `more about packages`_ in the official Python docs if you're a Python beginner.)
ja: :file:`mysite/__init__.py`: このディレクトリが Python パッケージであることを Python に知らせるための空のファイルです。(Python の初心者は、 Python の公式 ドキュメントの `パッケージの詳しい説明`_ を読んで下さい。)

source: :file:`mysite/settings.py`: Settings/configuration for this Django project. :doc:`/topics/settings` will tell you all about how settings work.
el: :file:`mysite/settings.py`: Ένα αρχείο που κρατά όλες τις ρυθμίσεις/παραμέτρους για αυτό το Django project (είναι η καρδιά ενός project). Το άρθρο :doc:`/topics/settings` θα σας εξηγήσει όλα όσα χρειάζεστε σχετικά με το πως δουλεύουν οι ρυθμίσεις αυτές.
it: :file:`mysite/settings.py`: Settaggi/configurazione per questo progetto Django. :doc:`/topics/settings` ha tutte le informazioni di cui hai bisogno su come funzionano i settaggi.
ja: :file:`mysite/settings.py`: Django プロジェクトの設定ファイルです。 設定の仕組みは :doc:`/topics/settings` を参照してください。
pl: :file:`mysite/settings.py`: Ustawienia/konfiguracja dla tego projektu Django. :doc:`/topics/settings` powie ci wszystko o tym, jak działają ustawienia.
zh_hans: :file:`mysite/settings.py`：Django 项目的配置文件。如果你想知道这个文件是如何工作的，请查看 :doc:`/topics/settings` 了解细节。

source: :file:`mysite/urls.py`: The URL declarations for this Django project; a "table of contents" of your Django-powered site. You can read more about URLs in :doc:`/topics/http/urls`.
el: :file:`mysite/urls.py`: Το αρχείο αυτό κρατά τους ορισμούς των URLs για αυτό το project. Με άλλα λόγια είναι ένας "πίνακας περιεχομένων" του Django site σας. Μπορείτε να διαβάστε περισσότερα για τα URLs στο άρθρο :doc:`/topics/http/urls`.
it: :file:`mysite/urls.py`: Le dichiarazione di URL per questo progetto Django; una "tavola di contenuti" del tuo sito Django. Per saperne di più sulle URLs, leggi :doc:`/topics/http/urls`.
ja: :file:`mysite/urls.py`: Django プロジェクトの URL 宣言、いうなれば Django サイトにおける「目次」に相当します。詳しくは :doc:`/topics/http/urls` を参照 してください。
pl: :file:`mysite/urls.py`: Deklaracje URL-i dla tego projektu Django; „spis treści” twojej strony opartej na Django. Możesz przeczytać więcej o URL-ach w :doc:`/topics/http/urls`.
zh_hans: :file:`mysite/urls.py`：Django 项目的 URL 声明，就像你网站的“目录”。阅读 :doc:`/topics/http/urls` 文档来获取更多关于 URL 的内容。

source: :file:`mysite/wsgi.py`: An entry-point for WSGI-compatible web servers to serve your project. See :doc:`/howto/deployment/wsgi/index` for more details.
el: :file:`mysite/wsgi.py`: Αυτό το αρχείο αποτελεί ένα σημείο εισόδου για τους Web servers οι οποίοι είναι συμβατοί με το WSGI specification. Δείτε περισσότερα στο άρθρο :doc:`πως να δουλέψω με το WSGI </howto/deployment/wsgi/index>` για περισσότερες λεπτομέρειες.
it: :file:`mysite/wsgi.py`: Un punto d'ingresso per web server compatibili con WSGI per servire il tuo progetto. Vedi :doc:`/howto/deployment/wsgi/index` per maggiori dettagli.
ja: :file:`mysite/wsgi.py`: プロジェクトをサーブするためのWSGI互換Webサーバーとのエントリーポイントです。詳細は :doc:`/howto/deployment/wsgi/index` を参照してください。
pl: :file:`mysite/wsgi.py`: Punkt wejściowy dla serwerów WWW kompatybilnych z WSGI do serwowania twojego projektu. Zobacz :doc:`/howto/deployment/wsgi/index` dla większej ilości szczegółów.
zh_hans: :file:`mysite/wsgi.py`：作为你的项目的运行在 WSGI 兼容的Web服务器上的入口。阅读 :doc:`/howto/deployment/wsgi/index` 了解更多细节。

source: The development server
el: Ο development server
it: Il server di sviluppo
ja: 開発用サーバー
pl: Serwer deweloperski
zh_hans: 用于开发的简易服务器

source: Let's verify your Django project works. Change into the outer :file:`mysite` directory, if you haven't already, and run the following commands:
el: Τώρα που δημιουργήσαμε ένα Django project, θα πρέπει να σιγουρευτούμε ότι λειτουργεί. Από κονσόλα (γραμμή εντολών) μεταβείτε στο root φάκελο του project σας (:file:`mysite`) και τρέξτε την ακόλουθη εντολή:
it: Verifichiamo che il tuo progetto in Django funzioni. Entra nella cartella esterna :file:`mysite`, se non l'hai ancora fatto, e chiama i seguenti comandi:
ja: Django のプロジェクトがうまく動作するか確認しましょう。外側の :file:`mysite` ディレクトリに移動ができたら下記のコマンドを実行してください:
pl: Zweryfikujmy czy twój projekt Django działa. Przejdź do zewnętrzenego katalogu :file:`mysite`, jeśli jeszcze tego nie zrobiłeś, i uruchom następujące polecenia:
zh_hans: 让我们来确认一下你的 Django 项目是否真的创建成功了。如果你的当前目录不是外层的 :file:`mysite` 目录的话，请切换到此目录，然后运行下面的命令：

source: You'll see the following output on the command line:
el: Θα δείτε την ακόλουθη έξοδο, στη κονσόλα:
it: Vedrai il seguente output nella linea di comando:
ja: コマンドライン上で下記の出力が確認できるでしょう:
pl: Zobaczysz następujące wyjście w linii komend:
zh_hans: 你应该会看到如下输出：

source: Ignore the warning about unapplied database migrations for now; we'll deal with the database shortly.
el: Αγνοήστε την προειδοποίηση (warning) περί unapplied migrations προς το παρόν. Θα ασχοληθούμε με αυτό σε λίγο (αφορά την βάση δεδομένων).
it: Per ora ignora gli avvisi relativi alle migrazione del database non applicate, ci preoccuperemo a breve del database.
ja: 適用されていないデータベースマイグレーションについての警告はここでは無視します、後ほどすぐにデータベースとともにたっぷりと取り組みます。
pl: Zignoruj na razie ostrzeżenie o niezastosowanych migracjach bazy danych; zajmiemy się bazą danych za chwilę.
zh_hans: 忽略有关未应用最新数据库迁移的警告，稍后我们处理数据库。

source: You've started the Django development server, a lightweight Web server written purely in Python. We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
el: Μόλις εκκινήσατε τον Django development server, ένας ελαφρύς Web server γραμμένος αμιγώς σε Python. Συμπεριλάβαμε αυτή τη λειτουργία στο Django για να βλέπετε και να αναπτύσσετε το project σας γρήγορα, χωρίς να χρειαστεί να ασχολείστε με ρυθμίσεις του production server (όπως ο Apache), μέχρις ότου φθάσετε στο σημείο και ανεβάσετε το site σας στο internet.
it: Hai fatto partire il server di sviluppo di Django, un web server leggero scritto interamanete in Python. L'abbiamo incluso in Python così puoi sviluppare cose rapidamente, senza avere a che fare col configurare un server di produzione -- quale Apache -- finché non sei pronto ad andare in produzione.
ja: これで、 Django 開発サーバを起動しました。 Django 開発サーバは Python だけで書かれた軽量な Web サーバです。このサーバは、開発を迅速に行い、運用に適した状態になるまで Apache のような運用サーバの設定をいじらなくても良いようにするためのものです。
pl: Wystartowałeś serwer deweloperski Django, lekki web-serwer napisany w całości w Pythonie. Zawarliśmy go w Django, abyś mógł dewelopować rzeczy błyskawicznie, nie musząc zajmować się konfiguracją produkcyjnego serwera – jak na przykład Apache – dopóki nie będziesz gotowy na produkcję.
zh_hans: 你刚刚启动的是 Django 自带的用于开发的简易服务器，它是一个用纯 Python 写的轻量级的 Web 服务器。我们将这个服务器内置在 Django 中是为了让你能快速的开发出想要的东西，因为你不需要进行配置生产级别的服务器（比如 Apache）方面的工作，除非你已经准备好投入生产环境了。

source: Now's a good time to note: **don't** use this server in anything resembling a production environment. It's intended only for use while developing. (We're in the business of making Web frameworks, not Web servers.)
el: Τώρα είναι ένα καλό σημείο να σημειωθεί το εξής: **ποτέ μα ποτέ** μην χρησιμοποιήσετε αυτό τον server (Django developemnt server) σε παραγωγικό περιβάλλον (production environment). Έχει σχεδιαστεί αποκλειστικά για αναπτυξιακούς λόγους (δηλαδή μόνο για να τρέχει τοπικά στον υπολογιστή σας). Εξάλλου εμείς ασχολούμαστε με τη δημιουργία Web frameworks και όχι Web servers.
it: Adesso è un buon momento per notare: **non** usare questo server per nulla che somegli ad un ambiente di produzione. È inteso solo per uso durante lo sviluppo. (Il nostro lavoro è fare framework, non server per il Web.)
ja: ここでちょっと注意しておきましょう。このサーバは開発中の利用だけを考えて作られています。絶対に運用環境では **使わないでください** (筆者たちの専門は Web フレームワークであって、Web サーバではありません)。
pl: Teraz jest dobry moment, by zwrócić na to uwagę: **nie** używaj tego serwera w czymkolwiek podobnym do produkcyjnego środowiska. Jest on przewidziany tylko do użytku podczas dewelopmentu. (Jesteśmy w świecie tworzenia web-frameworków, nie web-serwerów.)
zh_hans: 现在是个提醒你的好时机：**千万不要** 将这个服务器用于和生产环境相关的任何地方。这个服务器只是为了开发而设计的。(我们在 Web 框架方面是专家，在 Web 服务器方面并不是。)

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Welcome to Django" page, in pleasant, light-blue pastel. It worked!
ja: さあ、これでサーバが起動したので、ブラウザで http://127.0.0.1:8000/ にアクセスしてみてください。 “Welcome to Django” と表示された、明るいパステル調のライトブルーのページが出るはずです。やりましたね！
pl: Kiedy serwer jest już uruchomiony, odwiedź http://127.0.0.1:8000/ w swojej przeglądarce internetowej. Zobaczysz stronę „Welcome to Django”, w przyjemnych jasnoniebieskich pastelowych kolorach. Zadziałało!

source: Changing the port
el: Αλλαγή της πόρτας
it: Cambiare la porta
ja: ポート番号の変更
pl: Zmiana portu
zh_hans: 更换端口

source: By default, the :djadmin:`runserver` command starts the development server on the internal IP at port 8000.
el: Από προεπιλογή, η εντολή :djadmin:`runserver` ξεκινά έναν development server στην εσωτερική διεύθυνση IP που ακούει στην πόρτα 8000.
it: Di default, il comando :djadmin:`runserver` avvia il server di sviluppo sull'IP interno alla porta 8000.
ja: デフォルトでは :djadmin:`runserver` コマンドは内部 IP のポート 8000 で起動します。
pl: Domyślnie komenda :djadmin:`runserver` uruchamia serwer deweloperski na wewnętrznym IP na porcie 8000.
zh_hans: 默认情况下，:djadmin:`runserver` 命令会将服务器设置为监听本机内部 IP 的 8000 端口。

source: If you want to change the server's port, pass it as a command-line argument. For instance, this command starts the server on port 8080:
el: Αν θελήσετε να αλλάξετε την πόρτα, δεν έχετε παρά να το περάσετε ως όρισμα στην εντολή. Για παράδειγμα, η παρακάτω εντολή ξεκινά τον server στην πόρτα 8080:
it: Se vuoi cambiare la porta del server, passala come argomento alla linea di comando. Per esempio, questo comando avvia il server sulla porta 8080:
ja: サーバーのポートを変えたい場合は、以下のようにコマンドライン引数を渡してください。このコマンドによってポート 8080 で起動させれます:
pl: Jeśli chcesz zmienić port serwera, podaj go jako argument w linii komend. Na przykład, to polecenie uruchamia serwer na porcie 8080:
zh_hans: 如果你想更换服务器的监听端口，请使用命令行参数。举个例子，下面的命令会使服务器监听 8080 端口：

source: If you want to change the server's IP, pass it along with the port. So to listen on all public IPs (useful if you want to show off your work on other computers on your network), use:
ja: サーバの IP を指定するときには、ポート番号も一緒に指定します。従って、 全ての IP からのリクエストを受け付ける (サーバを他のコンピュータから可視にする) には、以下のようにします:
pl: Jeśli chcesz zmienić IP serwera, podaj go razem z portem. Więc: aby nasłuchiwać na wszystkich publicznych IP (przydatne jeśli chcesz pokazać swoją pracę na innych komputerach w twojej sieci), użyj:

source: Full docs for the development server can be found in the :djadmin:`runserver` reference.
ja: 開発サーバーの詳細な説明は :djadmin:`runserver` のリファレンスを参照して下さい。
pl: Pełną dokumentację serwera deweloperskiego można znaleźć w dokumentacji :djadmin:`runserver`.

source: Automatic reloading of :djadmin:`runserver`
el: Αυτόματη ανανέωση του :djadmin:`runserver`
it: Ricaricamento automatico di :djadmin:`runserver`
ja: :djadmin:`runserver` の自動リロード
pl: Automatyczne przeładowywanie :djadmin:`runserver`
zh_hans: 会自动重新加载的服务器 :djadmin:`runserver`

source: The development server automatically reloads Python code for each request as needed. You don't need to restart the server for code changes to take effect. However, some actions like adding files don't trigger a restart, so you'll have to restart the server in these cases.
el: Ο development server ανανεώνεται (reloads) αυτόματα κάθε φορά που αποθηκεύετε ή αλλάζετε κάποιο αρχείο (φυσικά μέσα στο project σας). Με αυτό τον τρόπο δεν χρειάζεται να κάνετε χειροκίνητα το reload του server για να δεχτεί τυχόν αλλαγές που πραγματοποιήθηκαν. Ωστόσο, υπάρχουν περιπτώσεις που ο server δεν ανανεώνεται αυτόματα, όπως στην προσθήκη ή αφαίρεση κάποιου αρχείου. Εκεί πρέπει να γίνει χειροκίνητα η επαναφόρτωση του server.
it: Quando necessario, il ssrver di sviluppo ricarica automaticamente il codice Python per ogni richiesta. Non c'è bisogno di far ripartire il server per applicare le modifiche al codice. Ciò nonostante, alcune azioni quali l'aggiunta di file non causano un riavvio. In questi casi dovrai quindi riavviare il server.
ja: 開発サーバーは必要に応じてリクエストごとにPythonコードを自動的にリロードします。コード変更の効果を得るためにサーバーを再起動する必要はありません。しかしながら、ファイルの追加のようないくつかの行動は再起動をトリガーしません、このような場合はサーバーを再起動する必要があります。
pl: Serwer deweloperski automatycznie przeładowuje kod Pythona dla każdego żądania, wedle potrzeby. Nie musisz restartować serwera, aby zmiany w kodzie miały efekt. Jednakże niektóre działania, jak dodawanie plików, nie powodują restartu, więc będziesz musiał zrestartować serwer w tych przypadkach.
zh_hans: 用于开发的服务器在需要的情况下会对每一次的访问请求重新载入一遍 Python 代码。所以你不需要为了让修改的代码生效而频繁的重新启动服务器。然而，一些动作，比如添加新文件，将不会触发自动重新加载，这时你得自己手动重启服务器。

source: Creating the Polls app
el: Δημιουργώντας το app ψηφοφορίας
it: Creazione dell'applicazione Sondaggi
ja: Polls アプリケーションをつくる
pl: Tworzenie aplikacji Ankiety
zh_hans: 创建投票应用

source: Now that your environment -- a "project" -- is set up, you're set to start doing work.
el: Τώρα που το περιβάλλον εργασίας σας -- το "project" – είναι έτοιμο, μπορείτε να ξεκινήσετε να δημιουργείτε.
it: Ora che il tuo ambiente -- un "progetto" -- è impostato, sei pronto per iniziare a lavorare.
ja: さあ、これで自分用の環境、すなわちプロジェクトが立ち上がり、作業にとりかかる準備ができました。
pl: Teraz, kiedy twoje środowisko – „projekt” – jest uruchomione, jesteś gotowy zabrać się do pracy.
zh_hans: 现在你的开发环境——这个“项目” ——已经配置好了，你可以开始干活了。

source: Each application you write in Django consists of a Python package that follows a certain convention. Django comes with a utility that automatically generates the basic directory structure of an app, so you can focus on writing code rather than creating directories.
el: Κάθε application που γράφετε στο Django αποτελείται από ένα Python package (ένας φάκελος που περιέχει το αρχείο ``__init__.py``) το οποίο πρέπει να ακολουθεί ορισμένους κανόνες. Για άλλη μια φορά, το Django σας παρέχει την ανάλογη εντολή για να δημιουργήσετε αυτόματα τη δομή αυτού του φακέλου (Python package) ούτως ώστε να επικεντρωθείτε στο να γράψετε κώδικα παρά στο να δημιουργείτε φακέλους και υποφακέλους.
it: Ogni applicazione che scrivi in Django è compposta da un pacchetto Python che segue alcune convenzioni. Django fornisce una utility che genera in automatico la struttura di base delle cartelle di una app, così puoi concentrarti sulla scrittura del codice invece che creare le cartelle.
ja: Django 内に追加する各アプリケーションは以下の規則に従った Python パッケージで構成されます。 Django には基本的なディレクトリ構造を自動生成するユーティリティが含まれているので、ディレクトリを作ることでなくコードを書くことに集中できます。
pl: Każda aplikacjia, którą piszesz w Django, składa się z pakietu Pythona, który realizuję pewną konwencję. Django zawiera narzędzie, które automatycznie generuje podstawową strukturę katalogów aplikacji, abyś mógł skupić się na pisaniu kodu zamiast na tworzeniu katalogów.
zh_hans: 在 Django 中，每一个应用都是一个 Python 包，并且遵循着相同的约定。Django 自带一个工具，可以帮你生成应用的基础目录结构，这样你就能专心写代码，而不是创建目录了。

source: Projects vs. apps
it: Progetti contro applicazioni
ja: プロジェクトとアプリケーション
pl: Projekty versus aplikacje
zh_hans: 项目 VS 应用

source: What's the difference between a project and an app? An app is a Web application that does something -- e.g., a Weblog system, a database of public records or a simple poll app. A project is a collection of configuration and apps for a particular website. A project can contain multiple apps. An app can be in multiple projects.
el: Πολύ πιθανόν μέχρι τώρα να έχετε αναρωτηθεί ποια η διαφορά ανάμεσα σε ένα project και ένα app. Η εφαρμογή (app ή application αν θέλετε) είναι μια Web εφαρμογή που κάνει κάτι -- π.χ, ένα σύστημα Weblog, μια database που κρατάει δεδομένα διαθέσιμα προς το ευρύ κοινό, ένα καλάθι από ένα e-shop ή μια απλή εφαρμογή ψηφοφορίας. Το project είναι μια συλλογή από διάφορες επιλογές/παραμέτρους και εφαρμογές για ένα συγκεκριμένο website. Ένα project μπορεί να περιέχει πολλαπλές εφαρμογές. Ομοίως, ένα app μπορεί να εμπεριέχεται σε πολλαπλά projects.
ja: プロジェクトとアプリケーションの違いとは何でしょうか？アプリケーションとは、実際に何らかの処理を行う Web アプリケーションを指します。例えばブログシステムや公開レコードのデータベース、単純な投票アプリといった具合です。プロジェクトとは、あるウェブサイト向けに設定とアプリケーションを集めたものです。一つのプロジェクトには複数のアプリケーションを入れられ ます。また、一つのアプリケーションは複数のプロジェクトで使えます。
pl: Jaka jest różnica pomiędzy projektem a aplikacją? Aplikacja jest aplikacją webową, która coś robi – na przykład system blogowy, baza danych publicznych wpisów lub prosta aplikacja ankietowa. Projekt jest zbiorem konfiguracji i aplikacji dla konkretnej witryny. Projekt może zawierać wiele aplikacji. Aplikacja może być w wielu projektach.
zh_hans: 项目和应用有啥区别？应用是一个专门做某件事的网络应用程序——比如博客系统，或者公共记录的数据库，或者简单的投票程序。项目则是一个网站使用的配置和应用的集合。项目可以包含很多个应用。应用可以被很多个项目使用。

source: Your apps can live anywhere on your `Python path`_. In this tutorial, we'll create our poll app right next to your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
ja: アプリケーションは `Python パス`_ のどこにでも置けます。このチュートリアルでは投票アプリケーションを :file:`manage.py` のすぐ隣に作ります。なので、 ``mysite`` のサブモジュールとしてでなく、トップレベルのモジュールとしてインポートできます。
