Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Add two more test methods to the same class, to test the behavior of the method more comprehensively:
el: Προσθέστε δύο ακόμη μεθόδους τεστ στην ίδια κλάση, για να τεστάρουμε την συμπεριφορά της μεθόδου πιο περιεκτικά:
it: Aggiungi altri due metodi di test alla stessa classe, per testare il comportamento del metodo in modo più esteso:
ja: このメソッドの振る舞いをより包括的にテストするために、同じクラスにさらに2つのテストを追加しましょう。
pl: Dodaj dwie metody testowe więcej do tej samej klasy, aby przetestować zachowanie metody bardziej wszechstronnie:
zh_hans: 我们在上次写的类里再增加两个测试，来更全面的测试这个方法：

source: And now we have three tests that confirm that ``Question.was_published_recently()`` returns sensible values for past, recent, and future questions.
el: Τώρα έχουμε τρία τεστ, τα οποία επιβεβαιώνουν ότι η μέθοδος ``Question.was_published_recently()`` επιστρέφει λογικές τιμές για παρελθοντικές, παρούσες και μελλοντικές τιμές του ``pub_date``.
it: Ed adesso abbiamo tre test che confermano che ``Question.was_published_recently()`` restuisce valori ragionevoli per le domande passate, recenti e future.
ja: これで、``Question.was_published_recently()`` が過去、現在、そして未来の質問に対して意味のある値を返すことを確認する3つのテストが揃いました。
pl: I mamy teraz trzy testy, które potwierdzają, że ``Question.was_published_recently()`` zwraca sensowne wartości dla przeszłych, ostatnich i przyszłych pytań.
zh_hans: 现在，我们有三个测试来确保 ``Question.was_published_recently()`` 方法对于过去，最近，和将来的三种情况都返回正确的值。

source: Again, ``polls`` is a simple application, but however complex it grows in the future and whatever other code it interacts with, we now have some guarantee that the method we have written tests for will behave in expected ways.
el: Υπενθυμίζουμε ότι η εφαρμογή μας, ``polls`` είναι μια απλή εφαρμογή. Ωστόσο, στο μέλλον, όσο περίπλοκη και να γίνει και ο οποιοσδήποτε άλλος κώδικας (ίσως από άλλη δική μας εφαρμογή) αλληλεπιδράσει με την εφαρμογή αυτή, μπορούμε να εγγυηθούμε ότι η μέθοδος στην οποία έχουμε γράψει τα τεστ θα συμπεριφέρεται σε αναμενόμενα πλαίσια.
ja: 繰り返しになりますが、``polls`` は簡単なアプリケーションであっても、将来このアプリケーションが他のどんなコードと関係するようになっても、複雑さは増していきます。メソッドに対してテストを書いたおかげで、今ではそのメソッドが期待したとおりに動作することを、ある程度保証でききるようになったのです。
pl: Znowu, ``polls`` jest prostą aplikacją, ale jakkolwiek złożona będzie w przyszłości i z jakimkolwiek kodem będzie w interakcji, mamy teraz pewną gwarancję, że metoda, dla której napisaliśmy testy będzie zachowywała się w przewidywalne sposoby.
zh_hans: 再次申明，尽管 ``polls`` 现在是个非常简单的应用，但是无论它以后成长到多么复杂，要和其他代码进行怎样的交互，我们都能保证进行过测试的那些方法的行为永远是符合预期的。

source: Test a view
el: Τεστ ένα view
it: Testare una vista
ja: ビューをテストする
pl: Przetestuj widok
zh_hans: 测试视图

source: The polls application is fairly undiscriminating: it will publish any question, including ones whose ``pub_date`` field lies in the future. We should improve this. Setting a ``pub_date`` in the future should mean that the Question is published at that moment, but invisible until then.
el: Η εφαρμογή μας, ``polls``, δεν κάνει διακρίσεις! Θα κάνει publish οποιαδήποτε ερώτηση, συμπεριλαμβανομένων και εκείνων που το ``pub_date`` field βρίσκεται στο μέλλον. Θα πρέπει να το διορθώσουμε αυτό. Θέτοντας το ``pub_date`` στο μέλλον θα σημαίνει ότι η ερώτηση θα πρέπει να γίνει publish εκείνη την ημερομηνία αλλά θα είναι αόρατη μέχρι τότε.
it: L'applicazione dei sondaggi agisce in modo abbastanza indiscriminato: pubblicherà ogni domanda, incluse quelle il cui campo ``pub_date`` è futuro. Dovremmo migliorare questa cosa. Impostare una ``pub_date`` nel futuro significa che la domanda deve essere pubblicata in quel momento ma fino ad allora deve essere invisibile.
ja: この投票アプリケーションは、まだ質問をちゃんと見分けることができません。``pub_date`` フィールドが未来の日付になっている質問を含め、どんな質問でも公開してしまいます。この点を改善するべきでしょう。``pub_date`` を未来に設定するということは、その Question がその日付になった時に公開され、それまでは表示されないことを意味するはずです。
pl: Aplikacja ankietowa jest bardzo niedyskryminująca: opublikuje każde pytanie, włącznie z takimi, których pole ``pub_date`` wskazuje na datę w przyszłości. Powinniśmy to poprawić. Ustawienie ``pub_date`` w przyszłości powinno oznaczać, że Question jest publikowane dopiero w tym przyszłym momencie i niewidoczne do tego czasu.
zh_hans: 我们的投票应用对所有问题都一视同仁：它将会发布所有的问题，也包括那些 ``pub_date`` 字段值是未来的问题。我们应该改善这一点。如果 ``pub_date`` 设置为未来某天，这应该被解释为这个问题将在所填写的时间点才被发布，而在之前是不可见的。

source: A test for a view
el: Ένα τεστ για τη view
it: Un test per una vista
ja: ビューに対するテスト
pl: Test dla widoku
zh_hans: 针对视图的测试

source: When we fixed the bug above, we wrote the test first and then the code to fix it. In fact that was a simple example of test-driven development, but it doesn't really matter in which order we do the work.
el: Όταν διορθώσαμε το bug πριν, γράψαμε πρώτα το τεστ και μετά τον κώδικα για να διορθώσουμε το bug. Στην πραγματικότητα αυτό ήταν ένα απλό παράδειγμα του test-driven development, αλλά δεν έχει σημασία η σειρά που ακολουθείται για να γίνει η δουλειά.
ja: 上でバグを修正した時には、初めにテストを書いてからコードを修正しました。実は、テスト駆動開発の簡単な例だったわけです。しかし、テストとコードを書く順番はどちらでも構いません。
pl: Kiedy naprawiliśmy powyżej błąd, napisaliśmy najpierw test i później kod, który naprawił błąd. Faktycznie to był prosty przykład test-driven dewelopmentu, ale to nie ma wielkiego znaczenia, w jakiej kolejności wykonujemy tę pracę.
zh_hans: 为了修复上述 bug ，我们这次先编写测试，然后再去改代码。事实上，这是一个简单的「测试驱动」开发模式的实例，但其实这两者的顺序不太重要。

source: In our first test, we focused closely on the internal behavior of the code. For this test, we want to check its behavior as it would be experienced by a user through a web browser.
el: Στο πρώτο μας τεστ επικεντρωθήκαμε στην εσωτερική συμπεριφορά του κώδικα μας (στη μέθοδο του μοντέλου). Για αυτό το τεστ, θέλουμε να ελέγξουμε την συμπεριφορά του όπως θα τη βίωνε ο χρήστης μέσα από τον browser του.
it: Nel nostro primo test, ci siamo concentrati sul comportamento interno del codice. Per questo test, vogliamo verificarne il comportamento come se fosse fatto da un utente tramite un browser web.
ja: 初めのテストでは、コード内部の細かい動作に焦点を当てましたが、このテストでは、ユーザが Web ブラウザを通して経験する動作をチェックしましょう。
pl: W naszym pierwszym teście skupiliśmy się bardzo na wewnętrznym zachowaniu kodu. W tym teście chcemy sprawdzić jego działanie tak, jak byłoby obserwowane przez użytkownika przez przeglądarkę internetową.
zh_hans: 在我们的第一个测试中，我们关注代码的内部行为。我们通过模拟用户使用浏览器访问被测试的应用来检查代码行为是否符合预期。

source: Before we try to fix anything, let's have a look at the tools at our disposal.
el: Προτού προσπαθήσουμε να φτιάξουμε το οτιδήποτε, ας ρίξουμε μια ματιά στα εργαλεία που έχουμε διαθέσιμα.
it: Prima di provare a riparare qualcosa, diamo un'occhiata agli strumenti a nostra disposizione.
ja: 初めに何かを修正する前に、使用できるツールについて見ておきましょう。
pl: Zanim spróbujemy cokolwiek naprawić, spójrzmy na narzędzia, którymi dysponujemy.
zh_hans: 在我们动手之前，先看看需要用到的工具们。

source: The Django test client
el: Τα τεστ του Django από την πλευρά του client
it: Il client test di Django
ja: Django テストクライアント
pl: Klient testowy Django
zh_hans: Django 测试工具之 Client

source: Django provides a test :class:`~django.test.Client` to simulate a user interacting with the code at the view level. We can use it in ``tests.py`` or even in the :djadmin:`shell`.
el: Το Django παρέχει το τεστ :class:`~django.test.Client` για να εξομοιώνει τον χρήστη που αλληλεπιδρά με τον κώδικα σε επίπεδο view. Μπορούμε να το χρησιμοποιήσουμε στο αρχείο ``tests.py`` ή ακόμη και στο :djadmin:`shell`.
it: Django offre una :class:`~django.test.Client` di test per simulare un utente che interagisce con il codice a livello della view. Possiamo usarla in ``tests.py`` o persino nella :djadmin:`shell`.
ja: Django は、ビューレベルでのユーザとのインタラクションをシミュレートすることができる :class:`~django.test.Client` を用意しています。これを ``tests.py`` の中や :djadmin:`shell` でも使うことができます。
pl: Django dostarcza testowe :class:`~django.test.Client` do symulacji interakcji użytkownika z kodem na poziomie widoku. Możemy go użyć w ``tests.py`` lub nawet w :djadmin:`shellu <shell>`.
zh_hans: Django 提供了一个供测试使用的 :class:`~django.test.Client` 来模拟用户和视图层代码的交互。我们能在 ``tests.py`` 甚至是 :djadmin:`shell` 中使用它。

source: We will start again with the :djadmin:`shell`, where we need to do a couple of things that won't be necessary in ``tests.py``. The first is to set up the test environment in the :djadmin:`shell`::
ja: もう一度 :djadmin:`shell` からはじめましょう。ここでテストクライアントを使う場合には、``tests.py`` では必要がない2つの準備が必要になります。まず最初にしなければならないのは、:djadmin:`shell` の上でテスト環境をセットアップすることです。
pl: Zaczniemy znowu w :djadmin:`shellu <shell>`, gdzie musimy zrobić parę rzeczy, które nie będą koniczne w ``tests.py``. Pierwsze, to uruchomić środowisko testowe w :djadmin:`shellu <shell>`::
zh_hans: 我们依照惯例从 :djadmin:`shell` 开始，首先我们要做一些在 ``tests.py`` 里不是必须的准备工作。第一步是在 :djadmin:`shell` 中配置测试环境::

source: :meth:`~django.test.utils.setup_test_environment` installs a template renderer which will allow us to examine some additional attributes on responses such as ``response.context`` that otherwise wouldn't be available. Note that this method *does not* setup a test database, so the following will be run against the existing database and the output may differ slightly depending on what questions you already created.
ja: :meth:`~django.test.utils.setup_test_environment` を呼び出すと、テンプレントレンダラがインストールされ、``response.context`` のような response の追加属性が評価できるようになります。ここで注意するべきことは、このメソッドを呼び出しても、テスト用のデータベースはセットアップ *されない* ということです。つまり、この後の命令はすでに存在するデータベースに対して実行され、すでに作られた question によっては、出力が少し変化するかもしれない、ということです。

source: Next we need to import the test client class (later in ``tests.py`` we will use the :class:`django.test.TestCase` class, which comes with its own client, so this won't be required)::
el: Επόμενο βήμα είναι να κάνουμε import την τεστ κλάση για τον client (αργότερα στο αρχείο ``tests.py`` θα χρησιμοποιήσουμε την κλάση :class:`django.test.TestCase`, η οποία έρχεται με δικό της client, οπότε αυτό δεν θα είναι απαραίτητο)::
it: Poi abbiamo bisogno di importare la classe client per il test (più tardi in ``tests.py`` useremo la classe :class:`django.test.TestCase`, che arriva con il suo client, così che questo non sarà necessario)::
ja: つぎに、テストクライアントのクラスをインポートする必要があります (後ほどの ``tests.py`` の中では、"class"`django.test.TestCase` クラス自体がクライアントを持っているため、インポートは不要です)。
pl: Następnie musimy zaimportować klasę klienta testowego (poźniej w ``tests.py`` będziemy używać klasy :class:`django.test.TestCase`, która ma swojego własnego klienta, więc ten nie będzie wymagany)::
zh_hans: 然后我们需要导入 :class:`django.test.TestCase` 类（在后续 ``tests.py`` 的实例中我们将会使用 :class:`django.test.TestCase` 类，这个类里包含了自己的 client 实例，所以不需要这一步）::

source: With that ready, we can ask the client to do some work for us::
el: Με αυτό έτοιμο, μπορούμε να βάλουμε τον client να εργαστεί για εμάς::
it: Preparato ciò, possiamo chiedere al client di fare del lavoro per noi:
ja: さて、これでクライアントに仕事を頼む準備ができました。
pl: Z zaimportowaną klasą, możemy zlecić klientowi wykonanie dla nas pracy::
zh_hans: 搞定了之后，我们可以要求 client 为我们工作了::

source: Improving our view
el: Βελτιώνοντας το view
it: Migliorare la nostra vista
ja: ビューを改良する
pl: Udoskonalanie naszego widoku
zh_hans: 改善视图代码

source: The list of polls shows polls that aren't published yet (i.e. those that have a ``pub_date`` in the future). Let's fix that.
el: Η λίστα με τις ψηφοφορίες εμφανίζει ψηφοφορίες οι οποίες δεν έχουν γίνει ακόμη published (δηλαδή αυτές που το ``pub_date`` έχει μελλοντική ημερομηνία). Ας το διορθώσουμε.
it: La lista di questionari mostra i questionari che non sono ancora stati pubblicati (cioè quelli la cui ``pub_date`` è futura). Mettiamo a posto questa cosa.
ja: 現在の投票のリストには、まだ公開されていない (つまり``pub_date`` の日付が未来になっている) 投票が表示される状態になっています。これを直しましょう。
pl: Lista ankiet pokazuje ankiety, które nie są jeszcze opublikowane (te, które mają ``pub_date`` w przyszłości). Naprawmy to.
zh_hans: 现在的投票列表会显示将来的投票（ ``pub_date`` 值是未来的某天)。我们来修复这个问题。

source: In :doc:`Tutorial 4 </intro/tutorial04>` we introduced a class-based view, based on :class:`~django.views.generic.list.ListView`:
el: Στον :doc:`Οδηγό 4 </intro/tutorial04>` εισάγαμε την έννοια του class-based view, βασισμένο στη :class:`~django.views.generic.list.ListView`:
it: Nel :doc:`Tutorial 4 </intro/tutorial04>` abbiamo introdotto una view basate su classe, basata su :class:`~django.views.generic.list.ListView`:
ja: :doc:`Tutorial 4 </intro/tutorial04>` では、以下のような :class:`~django.views.generic.list.ListView`: をベースにしたクラスベースビューを導入しました。
pl: w :doc:`Tutorialu 4 </intro/tutorial04>` wprowadziliśmy class-based view, oparty na :class:`~django.views.generic.list.ListView`:
zh_hans: 在 :doc:`教程的第 4 部分 </intro/tutorial04>` 里，我们介绍了基于 :class:`~django.views.generic.list.ListView` 的视图类：

source: We need to amend the ``get_queryset()`` method and change it so that it also checks the date by comparing it with ``timezone.now()``. First we need to add an import:
el: Θα χρειαστεί να βελτιώσουμε τη μέθοδο ``get_queryset()`` και να την αλλάξουμε ούτως ώστε να ελέγχει και την ημερομηνία συγκρίνοντας τη με το ``timezone.now()``. Πρώτα θα χρειαστεί να προσθέσουμε ένα import:
it: Dobbiamo modificare il metodo ``get_queryset()`` e cambiarlo in modo che controlli anche la data confrontandola con ``timezone.now()``. Per prima cosa dobbiamo aggiungere un import:
ja: ``get_queryset()`` メソッドを修正して、日付を``timezone.now()`` と比較して確認できるようにする必要があります。まず、インポート文を追加します。
pl: Musimy zmienić metodę ``get_queryset()`` tak, aby sprawdzała też datę porównując ją z ``timezone.now()``. Najpierw musimy dodać import:
zh_hans: 我们需要改进 ``get_queryset()`` 方法，让他它能通过将 Question 的 pub_data 属性与 ``timezone.now()`` 相比较来判断是否应该显示此 Question。首先我们需要一行 import 语句：

source: and then we must amend the ``get_queryset`` method like so:
el: και μετά πρέπει να βελτιώσουμε την μέθοδο ``get_queryset`` ως εξής:
it: e poi dobbiamo correggere il metodo ``get_queryset`` in questo modo:
ja: そして、次のように ``get_queryset`` メソッドを修正します。
pl: i później zmienić metodę ``get_queryset`` w ten sposób:
zh_hans: 然后我们把 ``get_queryset`` 方法改写成下面这样：

source: ``Question.objects.filter(pub_date__lte=timezone.now())`` returns a queryset containing ``Question``\s whose ``pub_date`` is less than or equal to - that is, earlier than or equal to - ``timezone.now``.
el: Η μέθοδος ``Question.objects.filter(pub_date__lte=timezone.now())`` επιστρέφει ένα queryset (συμπεριφέρεται ως μια Python λίστα) το οποίο περιέχει ``Question``\s των οποίων το ``pub_date`` είναι μικρότερο ή ίσο (επειδή στην προκειμένη επρόκειτο για ημερομηνίες, ίσως είναι καλύτερα να πούμε νωρίτερο ή ίσο) από το ``timezone.now`` (από το τώρα).
it: ``Question.objects.filter(pub_date__lte=timezone.now())`` restituisce un queryset contenente le ``Question`` la cui ``pub_date`` è minore o uguale a - cioè prima o allo stesso momento di - ``timezone.now``.
ja: ``Question.objects.filter(pub_date__lte=timezone.now())`` は、``pub_date`` が ``timezone.now`` 以前の ``Question`` を含んだクエリセットを返します。
pl: ``Question.objects.filter(pub_date__lte=timezone.now())`` zwraca queryset zawierający ``Question``\s. których ``pub_date`` jest mniejsze lub równe – to znaczy wcześniejsze lub równoczesne – względem ``timezone.now``.
zh_hans: ``Question.objects.filter(pub_date__lte=timezone.now())`` 返回一个由 pub_date 小于或等于（也就是早于或等于） `timezone.now`` 的 ``Question`` 组成的集合。

source: Testing our new view
el: Τεστάροντας το καινούργιο view
it: Testare la nostra nuova vista
ja: 新しいビューをテストする
pl: Testowanie naszego nowego widoku
zh_hans: 测试新视图

source: Now you can satisfy yourself that this behaves as expected by firing up the runserver, loading the site in your browser, creating ``Questions`` with dates in the past and future, and checking that only those that have been published are listed. You don't want to have to do that *every single time you make any change that might affect this* - so let's also create a test, based on our :djadmin:`shell` session above.
ja: それでは、これで期待通りの満足のいく動作をしてくれるかどうか確かめましょう。まず、runserver を実行して、ブラウザでサイトを読み込みます。過去と未来、それぞれの日付を持つ ``Question`` を作成し、すでに公開されている質問だけがリストに表示されるかどうかを確認します。あなたはまさか、*この通りにちゃんと動作しているか、プロジェクトにわずかでも変更を加えるたびに毎回手動で* 確認したいなどとは思わないですよね？ それなら、今回も上の :djadmin:`shell` のセッションに基づいてテストを作りましょう。
pl: Teraz możesz być się usatysfakcjonować, że działa jak przewidziałeś, odpalając runserver, ładując stronę w swojej przeglądarce, tworząc ``Questions`` z datami w przeszłości i przyszłości i sprawdzając, że tylko te, które zostały opublikowane, są na liście. Nie będziesz chciał robić tego *za każdym razem, kiedy wprowadzisz jakąkolwiek zmianę, która może mieć na to wpływ* – więc stwórzmy też test, oparty na naszej sesji :djadmin:`shell` powyżej.
zh_hans: 启动服务器、在浏览器中载入站点、创建一些发布时间在过去和将来的 ``Questions`` ，然后检验只有已经发布的 ``Questions`` 会展示出来，现在你可以对自己感到满意了。*你不想每次修改可能与这相关的代码时都重复这样做* —— 所以让我们基于以上 :djadmin:`shell` 会话中的内容，再编写一个测试。

source: Add the following to ``polls/tests.py``:
el: Προσθέστε τα ακόλουθα στο αρχείο ``polls/tests.py``:
it: Aggiungere quanto segue a ``polls/tests.py``:
ja: まず、``polls/tests.py`` に次の行を追加します。
pl: Dodaj poniższe do ``polls/tests.py``:
zh_hans: 将下面的代码添加到 ``polls/tests.py`` ：

source: and we'll create a shortcut function to create questions as well as a new test class:
el: Θα δημιουργήσουμε μια συνάρτηση συντόμευσης για να φτιάχνουμε ερωτήσεις και θα δημιουργήσουμε μια νέα test class:
it: e creeremo una funzione scorciatoia per creare domande così come una nuiova classe di test:
ja: そして、question を簡単に作れるようにするショートカット関数と、新しいテストクラスを作ります。
pl: i stworzymy funkcję skrótową do tworzenia pytań oraz nową klasę testową:
zh_hans: 然后我们写一个公用的快捷函数用于创建投票问题，再为视图创建一个测试类：

source: Let's look at some of these more closely.
el: Ας κοιτάξουμε μερικά από τα παραπάνω τεστ πιο προσεκτικά.
it: Diamo un occhiata da vicino.
ja: これらのコードを詳しく見ていきましょう。
pl: Przyjmy się dokładniej niektórym z nich.
zh_hans: 让我们更详细地看下以上这些内容。

source: First is a question shortcut function, ``create_question``, to take some repetition out of the process of creating questions.
el: Πρώτα, φτιάξαμε μια συνάρτηση (``create_question``) την οποία τη χρησιμοποιούμε ως συντόμευση για να δημιουργούμε ερωτήσεις.
it: La prima è una funzione scorciatoia, ``create_question``, che astrae alcune ripetizioni nel processo di creazione delle domande.
ja: まず、question のショートカット関数 ``create_question`` です。この関数は、処理の中の question を作成する繰り返しを取り除いてくれています。
pl: PIerwsze to funkcja skrótowa pytań, ``create_question``, wyciąga powtórzenia z procesu tworzenia pytań.
zh_hans: 首先是一个快捷函数 ``create_question``，它封装了创建投票的流程，减少了重复代码。

source: ``test_index_view_with_no_questions`` doesn't create any questions, but checks the message: "No polls are available." and verifies the ``latest_question_list`` is empty. Note that the :class:`django.test.TestCase` class provides some additional assertion methods. In these examples, we use :meth:`~django.test.SimpleTestCase.assertContains()` and :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.
ja: ``test_index_view_with_no_questions`` は question を1つも作りませんが、"No polls are available." というメッセージが表示されていることをチェックし、``latest_question_list`` が空になっているか確認しています。:class:`django.test.TestCase` クラスが追加のアサーション (assertion) メソッドを提供していることに注意してください。このチュートリアルでは、:meth:`~django.test.SimpleTestCase.assertContains()` と :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()` を使用します。
pl: ``test_index_view_with_no_questions`` nie tworzy żadnych pytań, ale sprawdza komunikat „No polls are available.” i weryfikuje, czy ``latest_question_list`` jest puste. Zwróć uwagę, że :class:`django.test.TestCase` dostarcza kilka dodatkowych metod asercji. W tych przypadkach używamy :meth:`~django.test.SimpleTestCase.assertContains()` i :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.

source: In ``test_index_view_with_a_past_question``, we create a question and verify that it appears in the list.
ja: ``test_index_view_with_a_past_question`` では、question を作成し、その question がリストに現れるかどうかを検証しています。
pl: W ``test_index_view_with_a_past_question`` tworzymy pytanie i weryfikujemy, że pojawia się na liście.

source: In ``test_index_view_with_a_future_question``, we create a question with a ``pub_date`` in the future. The database is reset for each test method, so the first question is no longer there, and so again the index shouldn't have any questions in it.
ja: ``test_index_view_with_a_future_question`` では、``pub_date`` が未来の日付の質問を作っています。データベースは各テストメソッドごとにリセットされるので、この時にはデータベースには最初の質問は残っていません。そのため、index ページにはquestion は1つもありません。
pl: W ``test_index_view_with_a_future_question`` tworzymy pytanie z ``pub_date`` w przyszłości. Baza danych jest resetowana dla każdej testowej metody, więc pierwszego pytania już tutaj nie ma i znów indeks nie powinien zawierać żadnego pytania.

source: And so on. In effect, we are using the tests to tell a story of admin input and user experience on the site, and checking that at every state and for every new change in the state of the system, the expected results are published.
el: Και τα τεστ συνεχίζονται. Στην πραγματικότητα χρησιμοποιούμε τα τεστ για να εξομοιώσουμε τη συμπεριφορά του admin interface καθώς και των υπόλοιπων χρηστών που αλληλεπιδρούν με το site μέσω του browser. Κάθε φορά που αλλάζει το state του συστήματος μας (της εφαρμογής μας αν θέλετε) εξετάζουμε την έξοδο του συστήματος και αν αυτή ανταποκρίνεται στα αποτελέσματα που αναμένουμε.
it: E così via. In effetti, stiamo usando i test per raccontare la storia dell'input dell'admin e la user experience sul sito, controllando ad ogni stato e per ogni cambiamento del sito, che i cambiamenti vengano pubblicati.
ja: 以下のテストメソッドも同様です。実際のところ、私たちはテストを用いて、管理者の入力とサイトでのユーザの体験についてのストーリを語り、システムの各状態とそこでの新しい変化のそれぞれに対して、期待通りの結果が公開されているかどうかをチェックしているのです。
pl: I tak dalej. W efekcie używamy testów, aby opowiedzieć historię o danych wprowadzonych przez administratora i doświadczeniu użytkownika na stronie i sprawdzamy na każdym etapie i dla każdej nowej zmiany w stanie systemu, czy publikowane są oczekiwane rezultaty.
zh_hans: 剩下的那些也都差不多。实际上，测试就是假装一些管理员的输入，然后通过用户端的表现是否符合预期来判断新加入的改变是否破坏了原有的系统状态。

source: Testing the ``DetailView``
el: Τεστάροντας το ``DetailView``
it: Testare la ``DetailView``
ja: ```DetailView``のテスト
pl: Testowanie ``DetailView``
zh_hans: 测试 ``DetailView``

source: What we have works well; however, even though future questions don't appear in the *index*, users can still reach them if they know or guess the right URL. So we need to add a similar constraint to ``DetailView``:
el: Ότι έχουμε μέχρι τώρα λειτουργεί όπως θα θέλαμε να λειτουργεί. Ωστόσο, παρόλο που οι μελλοντικές ερωτήσεις δεν φαίνονται στην αρχική σελίδα της εφαρμογής μας (*index*), αν οι χρήστες μπορέσουν να μαντέψουν το σωστό URL που οδηγεί σε μια τέτοια ερώτηση (και δεν είναι κάτι δύσκολο αφού χρησιμοποιούμε IDs), τότε θα μπορέσουν να τη δουν. Άρα θα πρέπει να προσθέσουμε παρόμοιους περιορισμούς στο ``DetailView``:
it: Quel che abbiamo funziona bene; eppure, anche se le domande future non appaiono nell'*indice*, gli utenti possono ancora raggiungere se conoscono o indovinano la URL giusta. Quindi dobbiamo aggiungere una restrizione simile a ``DetailView``:
ja: とても上手くいっていますね。しかし、未来の質問は *index* に表示されないものの、正しいURL を知っていたり推測したりしたユーザは、まだページに到達できてしまいます。そのため、同じような制約を ``DetailView`` にも追加する必要があります。
pl: To co mamy działa dobrze, jednakże mimo to, że przyszłe pytania nie pojawiają się w *indeksie*, użytkownicy wciąż mogą uzyskać do nich dostęp jeśli znają lub zgadną odpowiedni URL. Musimy więc dodać podobny warunek do ``DetailView``:
zh_hans: 我们的工作似乎已经很完美了？不，还有一个问题：就算在发布日期时未来的那些投票不会在目录页 *index* 里出现，但是如果用户知道或者猜到正确的 URL ，还是可以访问到它们。所以我们得在 ``DetailView`` 里增加一些约束：
