Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Writing your first patch for Django
el: Γράφοντας το πρώτο σας patch για το Django
it: Scrivere la tua prima patch per Django
ja: Django への初めてのパッチを書く
pl: Tworzenie pierwszego patcha dla Django
zh_hans: 编写你的第一个 Django 补丁

source: Introduction
el: Εισαγωγή
it: Introduzione
ja: はじめに
pl: Wprowadzenie
zh_hans: 介绍

source: Interested in giving back to the community a little? Maybe you've found a bug in Django that you'd like to see fixed, or maybe there's a small feature you want added.
el: Ενδιαφέρεστε να συνεισφέρετε στην κοινότητα; Ίσως έχετε βρει κάποιο σφάλμα προγράμματος (bug) στο Django και θέλετε να διορθωθεί ή θέλετε να προσθέσετε κάποια επιπλέον λειτουργία ή χαρακτηριστικό.
it: Ti interessa restituire qualcosa alla comunità? Potresti avere trovato un bug in Django che ti piacerebbe vedere corretto, o ci potrebbe essere una piccola funzionalità che vorresti fosse aggiunta.
ja: 少しでもコミュニティへ恩返しをしたいと思われますか? それは Django の簡単なバグフィックスや小さな機能追加かもしれません。
pl: Zainteresowany wsparciem odrobinę społeczności? Być może znalazłeś błąd w Django, który chciałbyś by był rozwiązany lub może jest jakaś mała funkcjonalność, którą chciałbyś by była dodana.
zh_hans: 想为 Django 社区做一点贡献？也许是你发现了一个想修复的 bug，或者想添加一个新的功能。

source: Contributing back to Django itself is the best way to see your own concerns addressed. This may seem daunting at first, but it's really pretty simple. We'll walk you through the entire process, so you can learn by example.
el: Ο καλύτερος τρόπος να δείτε τις δικές σας προτάσεις-ιδέες να γίνονται πραγματικότητα είναι συνεισφέροντας στο Django. Αυτό στην αρχή ίσως σας φανεί περίπλοκο αλλά στην πραγματικότητα είναι αρκετά απλό. Θα σας καθοδηγήσουμε βήμα-βήμα μέσα σε όλη την διαδικασία ώστε να μπορέσετε να μάθετε μέσα από ένα παράδειγμα.
ja: その願いを叶える最適な方法は Django 自体への貢献です。最初は気が重いかもしれませんが、実際はとても簡単です。私達がプロセス全体を詳しく解説するので、その例から学ぶことができるでしょう。
pl: Rozwijanie samego Django jest najlepszym sposobem rozwiązywania twoich własnych spraw. Na początku może to wydawać się zniechęcające, ale naprawdę jest całkiem proste. Przeprowadzimy cię przez cały proces, byś mógł się nauczyć na przykładzie.
zh_hans: 回报 Django 这件事本身就是使你的顾虑得到解决的最好方式。一开始这可能会使你怯步，但这真的很简单。整个过程中我们会一步一步为你解说，所以你可以通过例子学习。

source: Who's this tutorial for?
el: Σε ποιους απευθύνεται αυτό το tutorial
it: Per chi è questo tutorial?
ja: このチュートリアルは誰を対象としていますか?
pl: Dla kogo jest ten tutorial?
zh_hans: 这个教程适合谁？

source: If you are looking for a reference on how to submit patches, see the :doc:`/internals/contributing/writing-code/submitting-patches` documentation.
el: Αν ψάχνετε κάποια αναφορά σχετικά με το πως να υποβάλετε patches, δείτε το έγγραφο :doc:`Καταθέτοντας patches </internals/contributing/writing-code/submitting-patches>`.
ja: パッチの送り方について知りたい方は、 :doc:`/internals/contributing/writing-code/submitting-patches` をご覧ください。
pl: Jeśli szukasz informacji jak zgłaszać poprawki, obejrzyj dokumentację :doc:`/internals/contributing/writing-code/submitting-patches`.
zh_hans: 如果你正在寻找一个关于如何提交补丁的说明文档，请查看 :doc:`/internals/contributing/writing-code/submitting-patches`。

source: For this tutorial, we expect that you have at least a basic understanding of how Django works. This means you should be comfortable going through the existing tutorials on :doc:`writing your first Django app</intro/tutorial01>`. In addition, you should have a good understanding of Python itself. But if you don't, `Dive Into Python`__ is a fantastic (and free) online book for beginning Python programmers.
el: Για αυτόν τον οδηγό (tutorial), θα πρέπει να γνωρίζετε τουλάχιστον τη βασική λειτουργία του Django. Αυτό σημαίνει ότι θα πρέπει να είστε εξοικειωμένοι με τους ήδη υπάρχοντες οδηγούς :doc:`Γράφοντας το πρώτο σας Django app </intro/tutorial01>`. Επίσης, θα πρέπει να γνωρίζετε αρκετά καλά τη γλώσσα προγραμματισμού Python. Αν πάλι όχι, το βιβλίο `Dive Into Python`__ είναι ένα εκπληκτικό (και δωρεάν) online βιβλίο για νέους προγραμματιστές στη γλώσσα Python.
it: Per questo tutorial, ci aspettiamo che tu abbia almeno una comprensione di base di come lavora Django. Questo significa che devi essere a tuo agio nel muoverti tra i tutoria esistenti in :doc:`writing your first Django app</intro/tutorial01>`. Inoltre devi avere una buona conoscenza di Python. Se non ce l'hai, `Dive Into Python`__ è un libro online fantastico (e gratuito) per programmatori Python alle prime armi.
ja: このチュートリアルは、少なくとも Django がどのように動作しているかの基本的な理解があることを想定しています。つまりチュートリアル :doc:`初めての Django アプリ</intro/tutorial01>` を十分に理解していることを想定しています。また、Python 自体をよく理解している必要があります。もしそうでない場合、 `Dive Into Python`__ は Python プログラマーになるための素晴らしい (かつ無料の) オンラインドキュメントです。
pl: Na potrzeby tego tutorialu, oczekujemy posiadanie co najmniej podstawowego rozumienia jak działa Django. To znaczy, że czytelnik powinien być już obeznany z istniejącymi tutorialami na temat :doc:`pisania jego pierwszej aplikacji Django</intro/tutorial01>`. Dodatkowo, powinien dobrze rozumieć samego Pythona. W przypadku jeśli tak nie jest, `Dive Into Python`__ jest fantastyczną (i darmową) książką online dla początkujących programistów Pythona.
zh_hans: 使用教程前，我们希望你至少对于 Django 的运行方式有一定的认识。 这意味着你可以很容易地通读 :doc:`编写第一个 Django 应用 </intro/tutorial01>`。 除此之外，你应该对于 Python 有很好的理解。 如果不太熟悉 Python，我们为您推荐 `Dive Into Python`__，对于初学Python的程序员来说这是一本很棒（而且免费）的在线电子书。

source: Those of you who are unfamiliar with version control systems and Trac will find that this tutorial and its links include just enough information to get started. However, you'll probably want to read some more about these different tools if you plan on contributing to Django regularly.
el: Για όσους από εσάς δεν είστε εξοικειωμένοι με τα εργαλεία συστημάτων ελέγχου εκδόσεων (VCS – version control system) και το Trac, δεν υπάρχει λόγος να ανησυχείτε. Αυτός ο οδηγός (και όποιοι σύνδεσμοι-links του) έχει τις απαραίτητες πληροφορίες για να ξεκινήσετε. Ωστόσο, ίσως να θέλετε να μάθετε περισσότερα σχετικά με αυτά τα εργαλεία, αν σκοπεύετε να συνεισφέρετε στο Django τακτικά.
it: Quelli di voi che non hanno familiarità con i sistemi di controllo di versione e con Trac troveranno che questo tutorial e i suoi link includono le informazioni necessarie per cominciare. Comunque, se prevedete di contribuire a Django regolarmente, probabilmente vorrete leggere di più riguardo questi strumenti.
ja: バージョン管理システムと Trac をよく知らない方でも、このチュートリアルとリンク先から、始めるに十分な情報を得ることができます。しかし、Django に定期的に貢献したい場合は、このツールの詳細について知りたいかもしれません。
pl: Ci z was, którzy nie są zaznajomieni z systemami kontroli wersji i Trac przekonają się, że w tym poradniku i jego odnośnikach znajdą wystarczająco informacji, aby zacząć pracę. Pomimo tego, prawdopodobnie będziesz potrzebować przeczytać nieco więcej o tych różniących się narzędziach jeśli planujesz regularnie współtworzyć Django.
zh_hans: 那些不熟悉版本控制系统及缺陷跟踪的朋友可以查看这个教程，这个链接包含了足够的信息。如果你打算定期地为 Django 做贡献，你可能期望阅读更多关于这些不同工具的资料。

source: For the most part though, this tutorial tries to explain as much as possible, so that it can be of use to the widest audience.
el: Εν τούτοις, αυτός ο οδηγός στο μεγαλύτερο του μέρος, προσπαθεί να εξηγήσει όσα περισσότερα μπορεί, ώστε να μπορεί να φανεί χρήσιμος στο μεγαλύτερο δυνατό ευρύ κοινό.
it: Nelle intenzioni, questo tutorial tenta di spiegare il più possibile, per essere di aiuto alla maggior parte dei lettori.
ja: このチュートリアルでは、できるだけ多くの方が使用できるように可能な限り解説したいと思います。
pl: W lwiej części ten poradnik próbuje wyjaśnić tak wiele jak to tylko możliwe by był użyteczny dla jak największego grona odbiorców.
zh_hans: 当然对于此教程中的大部分内容，Django 会尽可能做出解释以帮助广大的读者。

source: Where to get help:
el: Που να ψάξετε για βοήθεια
it: Dove trovare aiuto:
ja: 困ったときは:
pl: Gdzie można uzyskać pomoc:
zh_hans: 从哪里获得帮助：

source: If you're having trouble going through this tutorial, please post a message to |django-developers| or drop by `#django-dev on irc.freenode.net`__ to chat with other Django users who might be able to help.
el: Αν δυσκολεύεστε με αυτόν τον οδηγό, μπορείτε να στείλετε ένα μήνυμα στους |django-developers| ή να συμμετάσχετε στο κανάλι `#django-dev στο irc.freenode.net`__ για να μιλήσετε με άλλους Django χρήστες οι οποίοι μπορεί να σας βοηθήσουν.
it: Se stai avendo problemi seguendo questo tutorial, invia un messaggio a |django-developers| o passa a `#django-dev on irc.freenode.net`__ per parlare con altri utenti di Django che possono essere d'aiuto.
ja: もしこのチュートリアルを通じて理解できないことがあれば、 |django-developers| にメッセージを送るか `#django-dev on irc.freenode.net`__ で他の Django ユーザーとのチャットが助けになるでしょう。
pl: Jeśli masz problemy z przejściem tego tutoriala, prosimy napisz wiadomość do |django-developers| lub wpadnij na `#django-dev on irc.freenode.net`__ aby czatować z innymi użytkownikami Django, który mogą być w stanie udzielić pomocy.
zh_hans: 如果你在使用本教程时遇到困难, 你可以发信息给 |django-developers| 中的人或登陆 `#django-dev on irc.freenode.net`__ 向其他 Django 使用者寻求帮助。

source: What does this tutorial cover?
el: Τι καλύπτει αυτός ο οδηγός;
it: Di che parla questo tutorial?
ja: このチュートリアルの範囲はなんですか?
pl: Co zawiera ten przewodnik?
zh_hans: 这个指南涵盖哪些内容？

source: We'll be walking you through contributing a patch to Django for the first time. By the end of this tutorial, you should have a basic understanding of both the tools and the processes involved. Specifically, we'll be covering the following:
el: Σε αυτόν τον οδηγό θα φτιάξουμε παρέα ένα patch για το Django και θα το συνεισφέρουμε (contribute) στην κοινότητα για πρώτη φορά. Στο τέλος αυτού του οδηγού, θα έχετε λάβει τις βασικές γνώσεις των εργαλείων (tools) και των διαδικασιών (processes) που εμπλέκονται. Πιο συγκεκριμένα, θα καλύψουμε τα ακόλουθα:
it: Ti istruiremo su come inviare per la prima volta una patch per Django. Alla fine di questo tutorial, sarai in grado di capire sia quali strumenti che quali processi sono utilizzati. In particolare, comprenderemo i seguenti:
ja: 初めて Django にパッチを送る手順を詳しく解説します。このチュートリアルを終えると、関連するツールとプロセス両方についての基本的な理解を得ることができます。具体的な範囲は以下の通りです:
pl: Przeprowadzimy cię przez pierwsze robienie poprawki do Django. Pod koniec tego tutoriala, powinieneś(nnaś) w sposób podstawowy rozumieć zarówno narzędzia jak i procesy składające na nie się składające. W szczególności poruszymy następujące tematy:
zh_hans: 我们将指导你贡献你的第一个 Django 补丁，在本教程完毕时，你将对相关工具及流程有一个基本的认识。特别的，我们将覆盖以下内容：

source: Installing Git.
el: Εγκατάσταση Git.
it: Installazione di Git.
ja: Git のインストール
pl: Instalacja Gita.
zh_hans: 安装 Git。

source: How to download a development copy of Django.
ja: 開発版の Django の複製をダウンロード
pl: Jak pobrać rozwojową wersję Django.
zh_hans: 如何下载 Django 的开发版。

source: Running Django's test suite.
el: Εκτέλεση της σουίτας δοκιμών του Django (test suite).
it: Eseguire la suite di test di Django.
ja: Django のテストスイートの実行
pl: Uruchamianie zestawu testów Django.
zh_hans: 运行 Django 的测试套件。

source: Writing a test for your patch.
el: Γράφοντας τεστ για το patch.
it: Scrivere un test per la tua patch.
ja: パッチへのテストを書く
pl: Pisanie testów dla Twojej poprawki.
zh_hans: 为你的补丁写一个测试。

source: Writing the code for your patch.
el: Γράφοντας κώδικα για το ίδιο το patch.
it: Scrivere il codice per la tua patch.
ja: パッチのコードを書く
pl: Pisanie kodu dla Twojej poprawki.
zh_hans: 为你的补丁编写代码。

source: Testing your patch.
el: Πραγματοποίηση τεστ για το patch.
it: Provare la tua patch.
ja: パッチをテスト
pl: Testowanie patcha.
zh_hans: 测试你的补丁。

source: Generating a patch file for your changes.
ja: 変更のパッチファイルを生成
pl: Generowanie pliku dla Twoich zmian

source: Where to look for more information.
el: Που να κοιτάξετε για περισσότερες πληροφορίες.
it: Dove cercare per ulteriori informazioni.
ja: より多くの情報を得る方法
pl: Gdzie szukać więcej informacji.
zh_hans: 在哪里查找更多的信息。

source: Once you're done with the tutorial, you can look through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains lots of great information and is a must read for anyone who'd like to become a regular contributor to Django. If you've got questions, it's probably got the answers.
el: Αφού ολοκληρώσετε τον οδηγό, μπορείτε να διαβάσετε το :doc:` εγχειρίδιο (documentation) του Django σχετικά με την συνεισφορά </internals/contributing/index>`. Περιέχει πολλές πληροφορίες και αν θέλετε να συνεισφέρετε τακτικά στο Django θα πρέπει να το διαβάσετε. Αν έχετε απορίες, τότε πιθανόν το εγχειρίδιο να έχει την απάντηση.
it: Una volta terminato il tutorial, puoi dare un'occhiata al resto della :doc:`Django's documentation on contributing</internals/contributing/index>`. Contiene moltissime informazioni utili ed è una lettura imperdibile per chiunque voglia contribuire regolarmente a Django. Se hai delle domande, li probabilmente ci sono le risposte.
ja: チュートリアルを終えたら、次は :doc:`Django への貢献</internals/contributing/index>` を参照してください。このドキュメントには、多くの重要な情報が含まれており、Django に定期的に貢献したい方は是非一読してください。あなたの疑問への答えが見つかるはずです。
pl: Kiedy tutorial jest już za tobą, możesz przejrzeć resztę :doc:`Django's documentation on contributing</internals/contributing/index>`. Zawiera ona wiele dobrych informacji i jest lekturą obowiązkową dla każdego, kto chciałby zostać stałym współtwórcą Django. Jeśli masz pytania, tam prawdopodobnie są odpowiedzi.
zh_hans: 一旦你完成了这份教程，你可以浏览 :doc:`Django 贡献文档 </internals/contributing/index>` 的剩余部分。它包含了大量信息。任何想成为 Django 的正式贡献者的人都必须阅读它。如果你有问题，它也许会给你答案。

source: Python 3 required!
el: Python 3!
it: E' necessario Python 3!
ja: 3系の Python が必要です！
pl: Wymagany Python 3!
zh_hans: 必须Python 3！

source: This tutorial assumes you are using Python 3. Get the latest version at `Python's download page <https://www.python.org/download/>`_ or with your operating system's package manager.
ja: このチュートリアルは3系のPythonの使用を想定しています。 `Python's download page <https://www.python.org/download/>`_ またはOSのパッケージ管理システムを用いて、最新のバージョンをインストールしてください。
pl: Ten tutorial zakłada, że używasz Pythona 3. Pobierz najnowszą wersję ze `strony pobierania Pythona <https://www.python.org/download/>`_ lub za pomocą menadżera pakietów twojego systemu operacyjnego.

source: For Windows users
el: Για τους χρήστες Windows
it: Per gli utenti Windows
ja: Windowsを使用している方へ
pl: Dla użytkowników Windows
zh_hans: 对于 Windows 用户

source: When installing Python on Windows, make sure you check the option "Add python.exe to Path", so that it is always available on the command line.
el: Κατά την εγκατάσταση της Python σε περιβάλλον Windows, σιγουρευτείτε ότι η επιλογή "Προσθήκη python.exe στο Path" είναι επιλεγμένη, ούτως ώστε οι εντολές που έχουν σχέση με την Python να είναι διαθέσιμες μέσω της γραμμής εντολών.
ja: WindowsにPythonをインストールする際、 "Add python.exe to Path" のオプションにチェックを入れると、コマンドラインからいつでも利用できるようになります。
pl: Instalując Pythona na Windowsie upewnij się, że zaznaczyłeś opcję „Add python.exe to Path”, aby zawsze był dostępny z linii komend.
zh_hans: 在Windows上安装 Python 时，确保勾选在环境变量path中“添加 python.exe 的路径”，这样才可以让它在命令行下总是可用。

source: Code of Conduct
el: Κώδικας δεοντολογίας
it: Codice di Condotta
ja: ソースコードの管理
pl: Kodeks Postępowania
zh_hans: 代码规范

source: As a contributor, you can help us keep the Django community open and inclusive. Please read and follow our `Code of Conduct <https://www.djangoproject.com/conduct/>`_.
el: Ως συνεισφέρων, μπορείτε να μας βοηθήσετε να διατηρήσουμε την Django κοινότητα ανοιχτή (open) και περιεκτική (inclusive). Παρακαλούμε διαβάστε και ακολουθήστε το δικό μας `Κώδικα Δεοντολογίας <https://www.djangoproject.com/conduct/>`_.
it: Come contributor, puoi aiutarci a tenere la Django community open e inclusa. Per favore leggi e segui i nostri `Code of Conduct <https://www.djangoproject.com/conduct/>`_.
ja: あなたはコントリビューターとして私たちDjangoコミュニティをオープンかつ包摂的なものでありつづけることを援助できます。私たちの `ソースコードの管理 <https://www.djangoproject.com/conduct/>` を参照し、フォローして下さい。
pl: Jako współtwórca możesz pomóc nam utrzymać społeczność Django otwartą i zintegrowaną. Przeczytaj i postępuj zgodnie z naszym `Kodeksem Postępowania <https://www.djangoproject.com/conduct/>`_.
zh_hans: 作为一个贡献者, 你可以帮助我们保持 Django 的社区开放性和包容性。请仔细阅读并遵守我们的 `行为守则 <https://www.djangoproject.com/conduct/>`_。

source: Installing Git
el: Εγκατάσταση Git
it: Installazione di Git
ja: Git のインストール
pl: Instalacja Gita
zh_hans: 安装Git

source: For this tutorial, you'll need Git installed to download the current development version of Django and to generate patch files for the changes you make.
el: Για αυτόν τον οδηγό θα χρειαστεί να έχετε εγκατεστημένο το Git ούτως ώστε να κατεβάσετε την αναπτυξιακή έκδοση (development version) του Django και να δημιουργήσετε patch αρχεία για τις αλλαγές που κάνετε.
it: Per questo tutorial, necessiterai di avere Git installato in modo da poter scaricare l'attuale versione per lo sviluppo di Django, e creare files per le modifiche che effettui.
ja: このチュートリアルでは、最新の Django 開発版のダウンロードとその変更のパッチファイルを生成するために Git をインストールする必要があります。
pl: Do tego poradnika będziesz potrzebował mieć zainstalowanego Gita, aby pobrać aktualną wersję rozwojową Django i wygenerować pliki poprawek dla zmian, które dokonasz.
zh_hans: 在本教程中，你需要安装好 Git，用 Git 下载 Django 的最新开发版本并且为你的修改生成补丁文件。

source: To check whether or not you have Git installed, enter ``git`` into the command line. If you get messages saying that this command could not be found, you'll have to download and install it, see `Git's download page`__.
el: Για να ελέγξετε αν έχετε εγκατεστημένο το Git, γράψτε στη κονσόλα (ή στη γραμμή εντολών αν έχετε Windows) τη λέξη ``git``. Αν βλέπετε μηνύματα που λένε ότι αυτή η εντολή δεν υπάρχει, θα χρειαστεί να κατεβάσετε το Git και να το εγκαταστήσετε. Δείτε πως, στην `επίσημη σελίδα του Git`__.
it: Per verificare se hai installato Git, inserisci "git" nella riga di commando. Se ricevi come risposta che questo commando non può essere trovato, dovrai scaricarlo ed installarlo, vai alla "pagina del download di Git"__.
ja: Git がインストールされているかどうかを確認するために、コマンドラインで ``git`` を入力します。もし入っていない場合は、ダウンロード及びインストールするために、 `Git's download page`__ を参照してください。
pl: Aby sprawdzić, czy posiadasz zainstalowanego Gita, wpisz ``git`` w wiersz poleceń. Jeśli otrzymasz informację, że taka komenda nie została znaleziona, będziesz musiał go pobrać i zainstalować. Zobacz `stronę pobierania Gita`__.
zh_hans: 要检查你是否已经安装 Git，命令行输入 ``git``。如果提示这个命令无法找到，你必须下载并安装它，参考 `Git's download page`__。

source: When installing Git on Windows, it is recommended that you pick the "Git Bash" option so that Git runs in its own shell. This tutorial assumes that's how you have installed it.
ja: WindowsにGitをインストールする際、 "Git Bash" オプションを選択し、シェルからGitが操作できるようにしておくことをおすすめします。このチュートリアルは Git Bash がインストールされていることを想定しています。
pl: Podczas instalacji Gita na Windowsie, zalecane jest, abyś wybrał opcję „Git Bash", dzięki której Git uruchamia się we własnej powłoce. Ten poradnik zakłada, że tak właśnie go zainstalowałeś.
zh_hans: 在 Windows 上安装 Git， 我们推荐勾选 "Git Bash" 选项， 以便 Git 能在它的独立 shell 下正常运行。本教程假定你这就是这样安装的。

source: If you're not that familiar with Git, you can always find out more about its commands (once it's installed) by typing ``git help`` into the command line.
el: Αν δεν είστε εξοικειωμένοι με το Git, μπορείτε να μάθετε περισσότερα σχετικά με τις εντολές του (αφού εγκατασταθεί) πληκτρολογώντας ``git help`` στην κονσόλα (ή στη γραμμή εντολών για χρήστες Windows).
it: Se non hai molta confidenza con Git, puoi sempre trovare informazioni riguardo ai suoi comandi (una volta installato) digitando "git help" nella riga di commando.
ja: もし Git について詳しく知らない場合は、(インストール後に) コマンドラインから ``git help`` と入力するとコマンドの使い方を確認できます。
pl: Jeśli nie jesteś zaznajomiony z Gitem, możesz zawsze znaleźć więcej informacji na temat komend (kiedy Git jest zainstalowany) wpisując ``git help`` w wiersz poleceń.
zh_hans: 如果你还不熟悉 Git, 你可以在命令行下输入 ``git help`` 了解更多关于 Git 命令的使用方法 (确保已安装)

source: Getting a copy of Django's development version
el: Δημιουργία αντίγραφου της αναπτυξιακής έκδοσης του Django
it: Ottenere una copia della versione di sviluppo di Django
ja: Django 開発版の複製を取得
pl: Uzyskiwanie kopii wersji rozwojowej Django
zh_hans: 获得一个 Django 开发版本的副本

source: The first step to contributing to Django is to get a copy of the source code. From the command line, use the ``cd`` command to navigate to the directory where you'll want your local copy of Django to live.
ja: Django への貢献の第一歩はソースコードの複製の取得から始まります。コマンドラインで、 ``cd`` コマンドを使い、Django をローカルに複製するディレクトリに移動します。

source: Download the Django source code repository using the following command:
el: Κατεβάστε το αποθετήριο (εφεξής repository ή repo) του πηγαίου κώδικα του Django χρησιμοποιώντας την ακόλουθη εντολή:
it: Scaricare la repository del codice sorgente Django usando il seguente comando
ja: 以下のコマンドで Django のソースコードリポジトリをダウンロードします:
pl: Pobierz repozytorium kodu źródłowego Django używając poniższego polecenia:
zh_hans: 使用下面的命令来下载 Django 的源码库：

source: Now that you have a local copy of Django, you can install it just like you would install any package using ``pip``. The most convenient way to do so is by using a *virtual environment* (or virtualenv) which is a feature built into Python that allows you to keep a separate directory of installed packages for each of your projects so that they don't interfere with each other.
ja: 今やあなたはDjangoのローカルコピーを手に入れました、"pip"を使ってどんなパッケージでもインストールできるのと同じように、Djangoもインストールできます。Pythonに含まれる機能である *virtual environment* (もしくはvirtualenv)は、プロジェクトごとにインストールされたパッケージが互いに害を及ぼすことないよう、別々のディレクトリで維持することを可能にする、もっとも便利な方法です。
pl: Kiedy już masz lokalną kopię Django, możesz go zainstalować tak jak zainstalowałbyś dowolny pakiet za pomocą ``pip``-a. Najwygodniejszy sposób, aby to zrobić jest użyć *virtual environment* (inaczej virtualenv) które jest funkcjonalnością wbudowaną w Pythona, która pozwala ci trzymać oddzielny katalog zainstalowanych pakietów dla każdego z twoich projektów, aby nie wchodziły ze sobą w konflikt.
zh_hans: 现在，你有了 Django 的本地副本，你可以安装它，就像你用 ``pip`` 安装其它软件包一样。 最方便的方式是通过使用 *虚拟环境* （或 virtualenv）， 这是 Python 的内置功能，可以将每个项目安装的软件包放在不同的目录内，确保它们不会互相干扰。

source: It's a good idea to keep all your virtualenvs in one place, for example in ``.virtualenvs/`` in your home directory. Create it if it doesn't exist yet:
ja: ホームディレクトリの ``.virtualenvs/`` 以下に、すべてのvirtualenvを 1 箇所においておくといいです。もしまだそのフォルダが存在しないなら作成しましょう。
pl: Dobrą praktyką jest przechowywanie wszystkich swoich virtualenv w jednym miejscu, na przykład w ``.virtualenvs/`` w Twoim katalogu domowym. Utwórz ten katalog jeśli jeszcze nie istnieje:
zh_hans: 将你所有的 virtualenvs 保存在同一个地方是个不错的主意，例如你主目录下的 ``.virtualenvs/``。如果这个文件夹不存在的话，创建它：

source: Now create a new virtualenv by running:
ja: それではアプリケーションを実行するために新しいvirtualenvを作りましょう:
pl: Następnie utwórz nowe środowisko wirtualne uruchamiając:
zh_hans: 现在创建新的虚拟运行环境

source: The path is where the new environment will be saved on your computer.
el: Η διαδρομή (path) που εισαγάγατε αποτελεί και το καινούργιο virtualenv το οποίο θα αποθηκευτεί στον υπολογιστή σας.
it: Il percorso è dove il nuovo environment verrà salvato sul tuo computer.
ja: 新しい環境があるパスはコンピュータに保存されました。
pl: Ścieżką jest miejsce gdzie nowe środowisko zostanie zapisane na Twoim komputerze:
zh_hans: 该路径就是保存这个新的虚拟运行环境的地方。

source: Using the built-in ``venv`` module will not work if you are also using the Git Bash shell on Windows, since activation scripts are only created for the system shell (``.bat``) and PowerShell (``.ps1``). Use the ``virtualenv`` package instead:
ja: ビルトインの ``venv`` は、 Windows 用にはシステムシェル(``.bat``) やPowerShell(``.ps1``)のためだけに作られたアクティベーションスクリプトであるため、WindowsのGit Bash shellを使用していても動作しません。その代わりに``virtualenv``パッケージを使用します:
pl: Używanie wbudowanego modułu ``venv`` nie zadziała jeśli używasz shella Git Bash na Windowsie od czasu, gdy skrypty aktywacyjne są stworzone jedynie dla shella systemowego (``.bat``) i PowerShell (``.ps1``). Zamiast tego użyj pakietu ``virtualenv``
zh_hans: 如果你在 Windows 上使用 Git Bash shell，内置的 ``venv`` 模块将不会生效。因为激活脚本仅创建了系统 shell (``.bat``) 和 PowerShell (``.ps1``) 的版本。 转而使用下面安装的 ``virtualenv`` ：

source: For Ubuntu users
ja: Ubuntuを使用している方へ
pl: Dla użytkowników Ubuntu
zh_hans: Ubuntu 用户
