Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Just for good measure, let's also include the ``was_published_recently()`` method from :doc:`Tutorial 2 </intro/tutorial02>`:
el: Για λόγους πληρότητας ας συμπεριλάβουμε την μέθοδο του μοντέλου ``Question`` ``was_published_recently()`` από τον :doc:`Οδηγό 2 </intro/tutorial02>`:
ja: おまけとして、:doc:`チュートリアル その2 </intro/tutorial02>` で定義したカスタムメソッド ``was_published_recently()`` も追加してみましょう。
pl: Na wszelki wypadek dodajmy też metodę ``was_published_recently()`` z :doc:`Tutoriala 2 </intro/tutorial02>`:
zh_hans: 为了更好用，让我们也包含 :doc:`教程第 2 部分 </intro/tutorial02>` 中的 ``was_published_recently()`` 方法：

source: Now the question change list page looks like this:
el: Τώρα η σελίδα change list του Question δείχνει κάπως έτσι:
it: Ora la pagina di elenco delle domande ha questo aspetto:
ja: これで、Question のチェンジリストのページは以下のようになります:
pl: Teraz strona „change list” pytań wygląda w ten sposób:
zh_hans: 现在修改投票的列表页看起来像这样：

source: You can click on the column headers to sort by those values -- except in the case of the ``was_published_recently`` header, because sorting by the output of an arbitrary method is not supported. Also note that the column header for ``was_published_recently`` is, by default, the name of the method (with underscores replaced with spaces), and that each line contains the string representation of the output.
el: Μπορείτε να κλικάρετε στους headers κάθε στήλης για να ταξινομήσετε την αντίστοιχη στήλη κατά τις τιμές της. Μοναδική εξαίρεση στη δυνατότητα της ταξινόμηση μιας στήλης αποτελεί η περίπτωση του header ``was_published_recently``, επειδή η ταξινόμηση με βάση την έξοδο μιας μεθόδου (ενός μοντέλου) δεν υποστηρίζεται. Επίσης, σημειώστε ότι ο header της στήλης ``was_published_recently`` είναι, από προεπιλογή, το όνομα της μεθόδου (με τα κενά να αντικαθιστούν τις κάτω παύλες) και κάθε κελί της στήλης αυτής περιέχει την έξοδο της συγκεκριμένης μεθόδου (True ή False).
it: Puoi fare click sull'intestazione delle colonne per ordinare quei valori -- eccetto nel caso di ``was_published_recently`` perchè l'ordinamento dell'output di un metodo non è supportato. Nota anche che l'intestazione di colonna per ``was_published_recently`` è, di default, il nome del metodo (con gli underscore a rimpiazzare gli spazi), e che ogni linea contiene la rappresentazione in stringa dell'oggetto.
ja: カラムのヘッダをクリックすると、カラムの値に応じてエントリを並べ換えできます。ただし ``was_published_recently`` ヘッダは例外で、これはメソッドの戻り値を 使った並べ換えをサポートしていないからです。 ``was_published_recently`` のカラムヘッダのデフォルト値がメソッドの名前になっている (アンダースコアは空白に置き換わっている)こと、各行が戻り値の文字列となっていることにも注意して下さい。
pl: Możesz klikać w nagłówki kolumn, aby sortować po tych wartościach – z wyjątkiem przypadku nagłówka ``was_published_recently``, ponieważ sortowanie po wyniku arbitralnej metody nie jest wspierane. Zwróć też uwagę, że nagłówek kolumny dla ``was_published_recently`` jest domyślnie nazwą metody (z podkreślnikami zamienionymi na spacje) i każda linia zawiera reprezentację w ciągu znaków wyniku.
zh_hans: 你可以点击列标题来对这些行进行排序——除了 ``was_published_recently`` 这个列，因为没有实现排序方法。顺便看下这个列的标题 ``was_published_recently``，默认就是方法名（用空格替换下划线），该列的每行都以字符串形式展示出处。

source: You can improve that by giving that method (in :file:`polls/models.py`) a few attributes, as follows:
el: Μπορούμε να βελτιώσουμε την όλη αυτή εμφάνιση παρέχοντας μερικά attributes στην μέθοδο αυτή (μέσα στο αρχείο :file:`polls/models.py`) ως ακολούθως:
ja: これを改善するには、このメソッド (:file:`polls/models.py` にある) に次のようにいくつかの属性を追加します。
pl: Możesz to poprawić dając tej metodzie (w :file:`polls/models.py`) kilka atrybutów, w następujący sposób:
zh_hans: 你可以通过给这个方法（在 :file:`polls/models.py` 中）一些属性来达到优化的目的，像这样：

source: For more information on these method properties, see :attr:`~django.contrib.admin.ModelAdmin.list_display`.
el: Για περισσότερες πληροφορίες σχετικά με τα properties των μεθόδων, δείτε στο :attr:`~django.contrib.admin.ModelAdmin.list_display`.
ja: このメソッドのプロパティに関する詳しい情報は、 :attr:`~django.contrib.admin.ModelAdmin.list_display` を参照してください。
pl: Po więcej informacji na temat tych właściwości metod, zobacz :attr:`~django.contrib.admin.ModelAdmin.list_display`.
zh_hans: 更多关于这些方法属性的信息，参见 :attr:`~django.contrib.admin.ModelAdmin.list_display`。

source: Edit your :file:`polls/admin.py` file again and add an improvement to the ``Question`` change list page: filters using the :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Add the following line to ``QuestionAdmin``::
el: Επεξεργαστείτε το αρχείο :file:`polls/admin.py` για ακόμη μια φορά και προσθέστε ένα φίλτρο στη σελίδα change list του μοντέλου ``Question`` χρησιμοποιώντας το :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Προσθέστε την ακόλουθη γραμμή κώδικα στην κλάση ``QuestionAdmin``::
it: Modifica nuovamente il tuo file :file:`polls/admin.py` e aggiungi un miglioramento alla pagina dell'elenco di modifiche ``Domanda``: i filtri usando :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Aggiungi la seguente riga in ``QuestionAdmin``:
ja: :file:`polls/admin.py` ファイルをもう一度編集して、``Question`` のチェンジリストのページに :attr:`~django.contrib.admin.ModelAdmin.list_filter` を追加して、さらに改良しましょう。それには、``QuestionAdmin`` に次に行を追加します。
pl: Zmień znów swój plik :file:`polls/admin.py` i dodaj ulepszenie do strony „change list” ``Questions``: filtry, z użyciem :attr:`~django.contrib.admin.ModelAdmin.list_filter`. Dodaj następującą linię do ``QuestionAdmin``::
zh_hans: 再次编辑文件 :file:`polls/admin.py`，优化 ``Question`` 变更页：过滤器，使用 :attr:`~django.contrib.admin.ModelAdmin.list_filter`。将以下代码添加至 ``QuestionAdmin``：

source: That adds a "Filter" sidebar that lets people filter the change list by the ``pub_date`` field:
el: Αυτό προσθέτει μια πλευρική στήλη (sidebar) "Filter" η οποία επιτρέπει το φιλτράρισμα των αποτελεσμάτων στην σελίδα change list κατά το πεδίο ``pub_date``:
it: Questo aggiunge una sidebar "Filtra" che permette all'utente di filtrare la lista per il campo ``pub_date``:
ja: これで、「フィルタ (Filter)」サイドバーができ、チェンジリストを ``pub_date`` フィールドの値に従ってフィルタできるようになります。
pl: Doda to sidebar „Filter”, który pozwala ludziom filtrować listę obiektów używając pola ``pub_date``:
zh_hans: 这样做添加了一个“过滤器”侧边栏，允许人们以 ``pub_date`` 字段来过滤列表：

source: The type of filter displayed depends on the type of field you're filtering on. Because ``pub_date`` is a :class:`~django.db.models.DateTimeField`, Django knows to give appropriate filter options: "Any date", "Today", "Past 7 days", "This month", "This year".
el: Ο τύπος του φίλτρου που εμφανίζεται εξαρτάται από τον τύπο του πεδίου που προσπαθείτε να φιλτράρετε. Επειδή το πεδίο ``pub_date`` είναι τύπου :class:`~django.db.models.DateTimeField`, το Django ξέρει ότι πρέπει να του δώσει τις ανάλογες επιλογές για φιλτράρισμα, όπως: "Οποιαδήποτε ημερομηνία", "Σήμερα", "Τελευταίες 7 μέρες", "Αυτόν το μήνα", "Αυτόν το χρόνο".
it: Il tipo di filtro visualizzato dipende dal tipo di campo su cui stai filtrando. Poiché ``pub_date`` è un :class:`~django.db.models.DateTimeField`, Django sa fornire le opzioni di filtro appropriate: "Qualsiasi data", "Oggi", "Ultimi 7 giorni", "Questo mese", "Quest'anno".
ja: フィルタの種類は、フィルタ対象のフィールドの種類に応じて変化します。``pub_date`` は :class:`~django.db.models.DateTimeField` なので、Django はこのフィールドにふさわしいフィルタオプションが、「すべての期間 ("Any date")」「今日 ("Today")」「今週 ("Past 7 days")」「今月 ("This month")」であることを知っているのです。
pl: Typ wyświetlanego filtru zależy od typu pola, po którym filtrujesz. Ponieważ ``pub_date`` to :class:`~django.db.models.DateTimeField`, Django wie, aby dać odpowiednie opcje w filtrze: „Any date”, „Today”, „Past 7 days”, „This month”, „This year”.
zh_hans: 展示的过滤器类型取决你你要过滤的字段的类型。因为 ``pub_date`` 是类 :class:`~django.db.models.DateTimeField`，Django 知道要提供哪个过滤器：“任意时间”，“今天”，“过去7天”，“这个月”和“今年”。

source: This is shaping up well. Let's add some search capability::
el: Αρχίζει και παίρνει σχήμα η όλη σελίδα μας. Ας προσθέσουμε τη δυνατότητα του searching::
it: Sta venendo su bene. Aggiungiamo alcune funzionalità di ricerca::
ja: 細工は隆々ですね。今度は検索機能を追加してみましょう。
pl: Dobrze się to zarysowuje. Dodajmy trochę możliwości wyszukiwania::
zh_hans: 这已经弄的很好了。让我们再扩充些功能::

source: That adds a search box at the top of the change list. When somebody enters search terms, Django will search the ``question_text`` field. You can use as many fields as you'd like -- although because it uses a ``LIKE`` query behind the scenes, limiting the number of search fields to a reasonable number will make it easier for your database to do the search.
el: Αυτό προσθέτει ένα search box κοντά στην κορυφή της σελίδας change list. Όταν κάποιος πληκτρολογήσει κάποια λέξη κλειδί για εύρεση, το Django θα ψάξει μέσα στο πεδίο ``question_text``. Μπορείτε να χρησιμοποιήσετε όσα πεδία θέλετε -- όμως επειδή η μέθοδος αυτή κάνει χρήση του ``LIKE`` query στο παρασκήνιο, αν περιορίσετε τον αριθμό των search fields μέσα στο πεδίο ``search_fields``, τότε θα κάνει τη δουλειά της database σας πιο εύκολη στην εύρεση της λέξης κλειδί που δώσατε.
it: Ciò aggiunge una casella di ricerca all'inizio dell'elenco delle modifiche. Quando qualcuno inserisce i termini di ricerca, Django cercherà nel campo ``question_text``. Puoi utilizzare tutti i campi che desideri -- anche se poiché utilizza una query ``LIKE`` dietro le quinte, limitare il numero di campi di ricerca a un numero ragionevole renderà più facile per il tuo database fare la ricerca.
ja: これで変更リストの上部に検索ボックスが表示されます。ユーザが検索語を入力すると、 Django は ``question_text`` フィールドを検索します。フィールドはいくらでも使えますが、舞台裏では ``LIKE`` クエリを使うのでデータベースに過剰な負荷をかけないために常識的な範囲にしましょう。
pl: To dodaje pole wyszukiwania na górze „change listy”. Kiedy ktoś wprowadzi wyrażenie wyszukiwania, Django przeszuka pole ``question_text``. Możesz użyć tyle pól, na ile masz ochotę – choć z powodu, że pod maską użyje to zapytania ``LIKE``, ograniczenie liczby pól wyszukiwania do rozsądnej liczby ułatwi twojej bazie danych wykonać wyszukiwanie.
zh_hans: 在列表的顶部增加一个搜索框。当输入待搜项时，Django 将搜索 ``question_text`` 字段。你可以使用任意多的字段——由于后台使用 ``LIKE`` 来查询数据，将待搜索的字段数限制为一个不会出问题大小，会便于数据库进行查询操作。

source: Now's also a good time to note that change lists give you free pagination. The default is to display 100 items per page. :attr:`Change list pagination <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`search boxes <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`date-hierarchies <django.contrib.admin.ModelAdmin.date_hierarchy>`, and :attr:`column-header-ordering <django.contrib.admin.ModelAdmin.list_display>` all work together like you think they should.
el: Τώρα είναι μια καλή στιγμή να σημειώσουμε ότι η σελίδες change lists σας δίνουν δωρεάν τη δυνατότητα του pagination. Από προεπιλογή, το Djoango εμφανίζει 100 γραμμές ανά σελίδα. Τα attributes :attr:`Change list pagination <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`search boxes <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`date-hierarchies <django.contrib.admin.ModelAdmin.date_hierarchy>` και :attr:`column-header-ordering <django.contrib.admin.ModelAdmin.list_display>` συνεργάζονται μεταξύ τους όπως ακριβώς νομίζετε.
it: Adesso è anche un buon momento per notare che le liste dei cambiamenti ti danno la paginazione gratis. Di default, mostra 100 elementi per pagina. :attr:`Change list pagination <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`search boxes <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filters <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`date-hierarchies <django.contrib.admin.ModelAdmin.date_hierarchy>`, e :attr:`column-header-ordering <django.contrib.admin.ModelAdmin.list_display>` lavorano tutti assieme come pensi che dovrebbero.
ja: さて、変更リストには何もしなくてもページ分割機能がある、ということをここでお知らせしておいた方がよいでしょう。デフォルトではページあたり 100 個の要素を表示します。:attr:`ページ分割 <django.contrib.admin.ModelAdmin.list_per_page>`、:attr:`検索ボックス <django.contrib.admin.ModelAdmin.search_fields>`、:attr:`フィルタ <django.contrib.admin.ModelAdmin.list_filter>`、:attr:`日付による階層化 <django.contrib.admin.ModelAdmin.date_hierarchy>`、:attr:`カラムヘッダを使った並び替え <django.contrib.admin.ModelAdmin.list_display>` チェンジリストの機能は、すべて協調して思いのままに動作します。
pl: Teraz jest dobry moment, by zwrócić uwagę, że „change lista” daje ci wolną paginację. Domyślnie wyświetla ona 100 elementów na stronę. :attr:`Zmień paginację listy <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`pola wyszukiwania <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`filtry <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`hierarchie dat <django.contrib.admin.ModelAdmin.date_hierarchy>` i:attr:`kolejność kolumn nagłówków <django.contrib.admin.ModelAdmin.list_display>` tak, aby wspólnie współgrały tak, jak uważasz, że powinny.
zh_hans: 现在是给你的修改列表页增加分页功能的好时机。默认每页显示 100 项。:attr:`变更页分页 <django.contrib.admin.ModelAdmin.list_per_page>`, :attr:`搜索框 <django.contrib.admin.ModelAdmin.search_fields>`, :attr:`过滤器 <django.contrib.admin.ModelAdmin.list_filter>`, :attr:`日期层次结构 <django.contrib.admin.ModelAdmin.date_hierarchy>`, 和 :attr:`列标题排序 <django.contrib.admin.ModelAdmin.list_display>` 均以你期望的方式合作运行。

source: Customize the admin look and feel
el: Παραμετροποιώντας την εμφάνιση του admin site
it: Personalizza l'aspetto dell'amministrazione
ja: 管理サイトのルック & フィールをカスタマイズする
pl: Dostosuj wygląd i pracę z panelem administracyjnym
zh_hans: 自定义后台界面和风格

source: Clearly, having "Django administration" at the top of each admin page is ridiculous. It's just placeholder text.
el: Βασικά, η λέξη "Διαχείριση Django" στην κορυφή κάθε σελίδας του admin είναι γελοία. Στην πραγματικότητα είναι ένα κείμενο placeholder.
it: Chiaramente, avere "Django administration" nella parte superiore di ogni pagina di amministrazione è ridicolo. È solo testo segnaposto.
ja: 管理サイトの上部には「Django 管理 (Django adminstration)」と表示されていますが、これはいささか滑稽ですね。これは単なるプレースホルダテキストにすぎません。
pl: Oczywiście, wyświetlanie napisu „Django administration” na górze każdej strony panelu administracyjnego jest bez sensu. To tylko tekst zastępczy.
zh_hans: 在每个后台页顶部显示“Django 管理员”显得很滑稽。这只是一串占位文本。

source: That's easy to change, though, using Django's template system. The Django admin is powered by Django itself, and its interfaces use Django's own template system.
el: Αυτό αλλάζει πανεύκολα ούτως ώστε να γράφει κάτι που να ταιριάζει με το δικό σας διαχειριστικό site. Θα χρησιμοποιήσουμε το σύστημα των templates του Django. Το Django admin δεν είναι τίποτε άλλο παρά άλλο ένα application και δεν ακολουθά καμία άλλη template λογική παρά αυτή που θα δούμε παρακάτω (template inheritance κλπ).
ja: 変更するのは簡単で、 Django のテンプレートシステムを使います。 Django の管理サイトは、それ自身 Django で作られているので、インタフェースは Django のテンプレートシステムを使っています。
pl: To proste do zmiany przy użyciu systemu szablonów Django. Panel administracyjny Django jest napędzany przez samo Django i jego interfejsy używają własnego systemu szablonów Django.
zh_hans: 不过，这可以通过 Django 的模板系统很方便的修改。Django 的后台由自己驱动，且它的交互接口采用 Django 自己的模板系统。

source: Customizing your *project's* templates
el: Παραμετροποιώντας τα templates του *project* σας
it: Personalizzare i template del tuo *progetto*
ja: *プロジェクト* テンプレートをカスタムする。
pl: Dostosowywanie szablonów twojego *projektu*
zh_hans: 自定义你的 *工程的* 模板

source: Create a ``templates`` directory in your project directory (the one that contains ``manage.py``). Templates can live anywhere on your filesystem that Django can access. (Django runs as whatever user your server runs.) However, keeping your templates within the project is a good convention to follow.
el: Δημιουργήστε έναν φάκελο ``templates`` μέσα στο root φάκελο του project σας (αυτόν που περιέχει το αρχείο ``manage.py``). Τα templates μπορούν να υπάρχουν οπουδήποτε μέσα στο filesystem σας αρκεί το Django να έχει πρόσβαση σε αυτά. (Το Django τρέχει υπό τον χρήστη που τρέχει και τον server σας.) Ωστόσο, το να κρατάτε τα templates σας μέσα στο project σας είναι μια, γενικά, καλή πρακτική.
it: Crea una directory ``templates`` nella directory del tuo progetto (quella che contiene ``manage.py``). I modelli possono risedere ovunque sul tuo filesystem purché Django vi possa accedere. (Django viene eseguito come qualsiasi utente venga eseguito dal server.) Tuttavia, mantenere i modelli all'interno del progetto è una buona convenzione da seguire.
ja: ``templates`` ディレクトリをプロジェクトディレクトリ (``manage.py`` が置かれているディレクトリ) に作成してください。テンプレートは Django がアクセスできるファイルシステム内のどこに置いても構いません (アプリケーションサーバーを実行したユーザーでアクセスします)。しかし従うべき慣習として、テンプレートはプロジェクト内に置きましょう。
pl: Stwórz katalog ``templates`` w katalogu twojego projektu (tym, który zawiera ``manage.py``). Szablony mogą być składowane w dowolnym miejscu twojego systemu plików, do którego może mieć dostęp Django. (Django jest uruchomione na tym samym użytkowniku co serwer.) Jednakże trzymanie szablonów wewnątrz projektu jest dobrą konwencją.
zh_hans: 在你的工程目录（指包含 ``manage.py`` 的那个文件夹）内创建一个名为 ``templates`` 的目录。模板可放在你系统中任何 Django 能找到的位置。（谁启动了 Django，Django 就以他的用户身份运行。）不过，把你的模板放在工程内会带来很大便利，推荐你这样做。

source: Open your settings file (:file:`mysite/settings.py`, remember) and add a :setting:`DIRS <TEMPLATES-DIRS>` option in the :setting:`TEMPLATES` setting:
el: Ανοίξτε το αρχείο ρυθμίσεων-επιλογών του project σας (settings file, :file:`mysite/settings.py`) και προσθέστε την επιλογή :setting:`DIRS <TEMPLATES-DIRS>` μέσα στην επιλογή :setting:`TEMPLATES`:
it: Apri il tuo file delle impostazioni (:file:`mysite/settings.py`, ricorda) e aggiungi un'opzione :setting:`DIRS <TEMPLATES-DIRS>` nell'impostazione :setting:`TEMPLATES`:
ja: 設定ファイル (:file:`mysite/settings.py`, remember) を開いて、:setting:`TEMPLATES` 設定オプションの中に、次のように :setting:`DIRS <TEMPLATES-DIRS>` オプションを追加します。
pl: Otwórz swój plik ustawiń (:file:`mysite/settings.py`, pamiętaj) i dodaj opcję :setting:`DIRS <TEMPLATES-DIRS>` w ustawieniu :setting:`TEMPLATES`:
zh_hans: 打开你的设置文件（:file:`mysite/settings.py`，牢记），在 :setting:`TEMPLATES` 设置中添加 :setting:`DIRS <TEMPLATES-DIRS>` 选项：

source: :setting:`DIRS <TEMPLATES-DIRS>` is a list of filesystem directories to check when loading Django templates; it's a search path.
el: Η επιλογή :setting:`DIRS <TEMPLATES-DIRS>` είναι μια λίστα με strings. Κάθε string είναι η διαδρομή (path) η οποία καταλήγει σε κάποιο φάκελο που περιέχει τα templates σας. Όταν το Django φορτώνει τα templates θα ψάξει και σε αυτά τα paths για να βρει τα templates σας. Με άλλα λόγια αποτελεί ένα μονοπάτι ευρέσεως των templates.
it: :setting:`DIRS <TEMPLATES-DIRS>` è una lista di directory su disco da controllare quando si caricano i template di Django; è un percorso di ricerca.
ja: :setting:`DIRS <TEMPLATES-DIRS>` は、Django がテンプレートを読み込む時にチェックする、ファイルシステム上のディレクトリのリストです。サーチパスのようなものです。
pl: :setting:`DIRS <TEMPLATES-DIRS>` jest listą katalogów systemu plików, które należy sprawdzić ładując szablony Django; jest ścieżką wyszukiwania.
zh_hans: :setting:`DIRS <TEMPLATES-DIRS>` 是一个包含多个系统目录的文件列表，用于在载入 Django 模板时使用，是一个待搜索路径。

source: Organizing templates
el: Οργανώνοντας τα templates
it: Organizzazione dei template
ja: テンプレートの構成
pl: Organizacja szablonów
zh_hans: 组织模板

source: Just like the static files, we *could* have all our templates together, in one big templates directory, and it would work perfectly well. However, templates that belongs to a particular application, we should put in the application’s template directory (e.g. ``polls/templates``) rather than the project’s (``templates``). We'll discuss in more detail in the :doc:`reusable apps tutorial </intro/reusable-apps>` *why* we do this.
ja: 静的ファイルと同様に、すべてのテンプレートをひとつの大きなテンプレートディレクトリにまとめて入れてしまうことも *できないことではなく* 、実際にちゃんと動作はします。しかし、ある特定のアプリケーションに属するテンプレートは、プロジェクトのテンプレートディレクトリ (``templates``) ではなく、そのアプリケーションのテンプレートディレクトリ (例: ``polls/templates``) に置くべきです。:doc:`再利用可能なアプリケーションのチュートリアル </intro/reusable-apps>` では、 *なぜ* このようなことをするのかについて、もっと詳しく説明しています。

source: Now create a directory called ``admin`` inside ``templates``, and copy the template ``admin/base_site.html`` from within the default Django admin template directory in the source code of Django itself (``django/contrib/admin/templates``) into that directory.
el: Δημιουργήστε, τώρα, ένα φάκελο με όνομα ``admin`` μέσα στο φάκελο ``templates`` και κάντε αντιγραφή-επικόλληση το αρχείο template ``admin/base_site.html`` το οποίο θα βρείτε μέσα στον πηγαίο κώδικα του Django (``django/contrib/admin/templates``).
it: Ora crea una directory chiamata ``admin`` all'interno di ```templates`` e copia il modello ``admin/base_site.html`` dalla directory predefinita dei modelli di amministrazione di Django nel codice sorgente di Django stesso (``django/contrib/admin/templates``) in quella directory.
ja: さて、``templates`` の中に ``admin`` という名前のディレクトリを作りましょう。Django 自体のソースコード内にある、デフォルトの Django admin テンプレートディレクトリ (``django/contrib/admin/templates``) を探して、 ``admin/base_site.html`` というテンプレートを、新しく作ったディレクトリにコピーします。
pl: Teraz stwórz katalog o nazwie ``admin`` wewnątrz ``templates`` i skopiuj szablon ``admin/base_site.html`` z katalogu domyślnych szablonów panelu administracyjnego z kodu źródłowego Django (``django/contrib/admin/templates``) do tego katalogu.
zh_hans: 现在，在 ``templates`` 目录内创建名为 ``admin`` 的目录，随后，将存放 Django 默认模板的目录（``django/contrib/admin/templates``）内的模板文件 ``admin/base_site.html`` 复制到这个目录内。

source: Where are the Django source files?
el: Που είναι ο πηγαίος κώδικας του Django?
it: Dove sono i file sorgenti di Django?
ja: Django のソースファイルの場所はどこ？
pl: Gdzie są pliki źródłowe Django?
zh_hans: Django 的源文件在哪里？

source: If you have difficulty finding where the Django source files are located on your system, run the following command:
el: Αν δυσκολεύεστε να βρείτε τον πηγαίο κώδικα του Django μέσα στο σύστημα σας, τρέξτε την ακόλουθη εντολή:
it: Se hai difficoltà a trovare dove si trovano i file sorgente di Django sul tuo sistema, esegui il seguente comando:
ja: Django のソースファイルがシステム中のどこにあるのか分からない場合は、以下のコマンドを実行してください。
pl: Jeśli masz trudność w odnalezieniu miejsca, gdzie są zlokalizowane pliki źródłowe Django w twoim systemie, uruchom następujące polecenie:
zh_hans: 如果你不知道 Django 源码在你系统的哪个位置，运行以下命令：

source: Then, just edit the file and replace ``{{ site_header|default:_('Django administration') }}`` (including the curly braces) with your own site's name as you see fit. You should end up with a section of code like:
el: Επόμενο βήμα είναι να ανοίξετε το αρχείο που μόλις αντιγράψατε και να αντικαταστήσετε το ``{{ site_header|default:_('Django administration') }}`` (μαζί με τα διπλά άγκιστρα) με το όνομα του site σας ή οτιδήποτε άλλο εσείς θέλετε. Θα καταλήξετε με κάτι σαν αυτό:
ja: あとは、ファイルを編集して、``{{ site_header|default:_('Django administration') }}`` (カーリーブラケットも含みます) を適当な自分自身のサイト名に書き換えるだけです。コードは最終的に次のようになります。
pl: Następnie po prostu zmień plik i zamień ``{{ site_header|default:_('Django administration') }}`` (wliczając nawiasy klamrowe) na nazwę swojej strony, która będzie pasować. Powinieneś skończyć z sekcją kodu typu:
zh_hans: 接着，用你站点的名字替换文件内的 ``{{ site_header|default:_('Django administration') }}``（包含大括号）。完成后，你应该看到如下代码：
