Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Django has a template search path, which allows you to minimize redundancy among templates. In your Django settings, you specify a list of directories to check for templates with :setting:`DIRS <TEMPLATES-DIRS>`. If a template doesn't exist in the first directory, it checks the second, and so on.
el: Το Django έχει ειδική μηχανή αναζήτησης template, η οποία επιτρέπει στην ελαχιστοποίηση της επαναληπτικότητας (redundancy) ανάμεσα στα templates. Στις ρυθμίσεις (settings) του Django, καθορίζετε μία λίστα από φακέλους (directories) στους οποίους θα κοιτάξει το Django να βρει το αντίστοιχο template αρχείο. Η ρύθμιση αυτή γίνεται μέσω του :setting:`DIRS <TEMPLATES-DIRS>`. Αν ένα template δεν βρεθεί στον πρώτο φάκελο τότε εξερευνάται ο δεύτερος κοκ.
it: Django ha un percorso di ricerca dei template, il quale ti permette di ridurre la ridondanza nei vari template. Nella tua configurazione di Django, specifica una lista di cartelle da controllare tramite la configurazione :setting:`DIRS per la ricerca dei template. Se un template non esiste nella prima cartella, controlla la seconda e così via.
ja: Django はテンプレートの重複を最小限にする為に、テンプレートの検索パスを持っています。Djangoの設定ファイルの中で、テンプレートをチェックする :setting:`DIRS <TEMPLATES-DIRS>` にディレクトリのリストを指定します。最初のディレクトリにテンプレートが存在しかった場合、2番目をチェックし、以降も同様にチェックが続きます。
pl: Django ma ścieżkę wyszukiwania szablonów, która pozwala ci minimalizować redundancję pomiędzy szablonami. W swoich ustawieniach Django podajesz listę katalogów do szukania w nich szablonów z :setting:`DIRS <TEMPLATES-DIRS>`. Jeśli szablon nie istnieje w pierwszym katalogu, sprawdzany jest drugi i tak dalej.
zh_hans: Django 允许设置搜索模板路径，这样可以最小化模板之间的冗余。在 Django 设置中，你可以通过 :setting:`DIRS <TEMPLATES-DIRS>` 参数指定一个路径列表用于检索模板。如果第一个路径中不包含任何模板，就继续检查第二个，以此类推。

source: Let's say the ``news/year_archive.html`` template was found. Here's what that might look like:
el: Ας υποθέσουμε ότι το template ``news/year_archive.html`` βρέθηκε. Αυτό θα μοιάζει κάπως έτσι:
it: Diciamo che ``news/year_archive.html`` sia stato trovato. Ecco come potrebbe essere:
ja: さて、 ``news/year_archive.html`` が見つかったとしましょう。テンプレートは以下のように書かれています:
pl: Powiedzmy, że szablon ``news/year_archive.html`` został odnaleziony. Tak mógłby wyglądać:
zh_hans: 让我们假设 ``news/year_archive.html`` 模板已经找到。它看起来可能是下面这个样子：

source: Variables are surrounded by double-curly braces. ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup. They also can do dictionary-key lookup, index lookup and function calls.
el: Οι μεταβλητές περιβάλλονται από διπλές αγκύλες. Το ``{{ article.headline }}`` σημαίνει "Δώσε μου την τιμή του headline attribute του object article". Αλλά οι τελείες δεν χρησιμοποιούνται μόνο για να ανακαλούμε τα attributes ενός object. Χρησιμεύουν επίσης και για να ψάχνουμε μέσα σε Python dictionaries, μέσα σε Python λίστες (lists) καθώς και για να καλούμε μεθόδους ενός object.
it: Le variabili sono delimitate da doppie parentesi graffe. ``{{ article.headline }}`` significa "Mostra il valore dell'attributo headline dell'articolo." Ma i punti non sono usati sono per accedere a un attributo. Possono essere usati anche per accedere a una chiave di un dizionario, un indice o una chiamata a una funzione.
ja: 変数は二重の波括弧で囲まれています。 ``{{ article.headline }}`` は、「article の headline という属性の出力」を表しています。とはいえ、ドット表記は属性の検索に使われるだけではありません。辞書の検索や、インデクス指定、関数呼び出しも行えます。
pl: Zmienne są otoczone podwójnymi nawiasami klamrowymi. ``{{ article.headline }}`` znaczy „wypisz wartość atrybutu »headline« artykułu”. Ale kropki nie są używane tylko do odwoływania się do atrybutów. Mogą one być odwołaniami do klucza w słowniku, do indeksu tablicy i wywołaniami funkcji.
zh_hans: 我们看到变量都被双大括号括起来了。 ``{{ article.headline }}`` 的意思是“输出 article 的 headline 属性值”。这个“点”还有更多的用途，比如查找字典键值、查找索引和函数调用。

source: Note ``{{ article.pub_date|date:"F j, Y" }}`` uses a Unix-style "pipe" (the "|" character). This is called a template filter, and it's a way to filter the value of a variable. In this case, the date filter formats a Python datetime object in the given format (as found in PHP's date function).
el: Σημειώστε ότι το ``{{ article.pub_date|date:"F j, Y" }}`` χρησιμοποιεί ένα στυλ του Unix που λέγεται "pipe" (ο χαρακτήρας "|"). Αυτό ονομάζεται template filter και είναι ένας τρόπος να φιλτράρουμε την τιμή ή την μεταβλητή. Στην συγκεκριμένη περίπτωση, το φίλτρο με το όνομα “date” φιλτράρει το Python datetime object ούτως ώστε να παρουσιαστεί σε μία συγκεκριμένη μορφή (σύμφωνα με την συνάρτηση date της γλώσσας PHP).
it: Nota che ``{{ article.pub_date|date:"F j, Y" }}`` usa una "pipe" (il carattere "|") in stile Unix . Questo è un filtro del template ed è un modo per filtrare il valore di una variabile. In questo caso, il filtro data formatta un oggetto Python di tipo datetime nel formato dato (come si trova nella funzione data di PHP).
ja: ``{{ article.pub_date|date:"F j, Y" }}`` で、 Unix スタイルの「パイプ」 (文字 “|”) を使っていることに注意して下さい。これはテンプレートフィルターと呼ばれ、変数の値にフィルターをかけるためのものです。この例では、フィルタによって Python の datetime オブジェクトを指定の形式にフォーマットしています (PHP の date 関数に似ていますね) 。
pl: Zwróć uwagę, że ``{{ article.pub_date|date:"F j, Y" }}`` używa uniksowego „pipe” (znak „|”). Jest on nazywany filtrem szablonu i jest sposobem na przefiltrowanie wartości zmiennej. W tym przypadku filtr „date” formatuje pythonowy obiekt datetime do żądanego formatu (tak jak w funkcji „date” w PHP).
zh_hans: 我们注意到 ``{{ article.pub_date|date:"F j, Y" }}`` 使用了 Unix 风格的“管道符”（“|”字符）。这是一个模板过滤器，用于过滤变量值。在这里过滤器将一个 Python datetime 对象转化为指定的格式（就像 PHP 中的日期函数那样）。

source: You can chain together as many filters as you'd like. You can write :ref:`custom template filters <howto-writing-custom-template-filters>`. You can write :doc:`custom template tags </howto/custom-template-tags>`, which run custom Python code behind the scenes.
el: Μπορείτε να συνδέσετε (chain) περισσότερα από ένα φίλτρα, ανάλογα τις απαιτήσεις σας. Μπορείτε να γράψετε :ref:`δικά σας template filters <howto-writing-custom-template-filters>`. Μπορείτε να γράψετε :doc:`δικά σας template tags </howto/custom-template-tags>`, τα οποία θα τρέχουν το δικό σας Python κώδικα στο παρασκήνιο.
it: Puoi concatenare tutti i filtri che desideri. Puoi scrivere :ref:`filtri di template personalizzati <howto-writing-custom-template-filters>`. Puoi scrivere :doc:`tag di template personalizzati </howto/custom-template-tags>`, che eseguono codice Python personalizzato dietro le quinte.
ja: フィルターはいくつでも好きなだけ繋げることが出来ます。また、独自の Python コードを実行する :ref:`カスタムテンプレートフィルタ <howto-writing-custom-template-filters>` や :doc:`カスタムテンプレートタグ</howto/custom-template-tags>` を書くことも出来ます。
pl: Możesz układać w łańcuchy tyle filtrów, na ile masz ochotę. Możesz napisać :ref:`własne filtry szablonów <howto-writing-custom-template-filters>`, które uruchamiają pod spodem własny kod Pythona.
zh_hans: 你可以将多个过滤器连在一起使用。你还可以使用你 :ref:`自定义的模板过滤器 <howto-writing-custom-template-filters>` 。你甚至可以自己编写 :doc:`自定义的模板标签 </howto/custom-template-tags>` ，相关的 Python 代码会在使用标签时在后台运行。

source: Finally, Django uses the concept of "template inheritance". That's what the ``{% extends "base.html" %}`` does. It means "First load the template called 'base', which has defined a bunch of blocks, and fill the blocks with the following blocks." In short, that lets you dramatically cut down on redundancy in templates: each template has to define only what's unique to that template.
el: Εν κατακλείδι, το Django χρησιμοποιεί την έννοια του "template inheritance". Αν προσέξατε, στην αρχή του template υπάρχει το ``{% extends "base.html" %}``. Αυτό σημαίνει "πρώτα φόρτωσε το template με το όνομα 'base.html', το οποίο 'base' έχει ορίσει κάποια τμήματα blocks (όπως είναι το title και το content) και αντικατέστησε τα κομμάτια αυτά του 'base.html' με αυτά του year_archive.html". Με άλλα λόγια, το Django template system ελαχιστοποιεί στο έπακρο την επαναληπτικότητα ανάμεσα στα template σας: κάθε template θα πρέπει να ορίζει μόνο ότι είναι μοναδικό στο δικό του template.
it: Infine, Django usa il concetto di "template inheritance". Questo è ciò che fa ``{% extends "base.html" %}``. Significa "Prima carica il template chiamato 'base', nel quale sono definiti un mucchio di blocchi, e riempi i blocchi con quelli seguenti." In breve, questo permette di ridurre drasticamente la ridondanza nei template: ogni template deve definire solo ciò che è unico per quel template.
ja: 最後に、 Django にはテンプレートの継承という概念があります。 継承を宣言しているのは ``{% extends "base.html" %}`` の部分です。このタグは「まず ‘base’ というテンプレートをロードせよ。このテンプレートにはいくつかのブロックが定義されているが、それらのブロックの中身を以下のブロック定義で埋めよ」という命令です。要するに、テンプレートを継承すると、各テンプレートごとに固有の定義だけを記述すればよくなり、テンプレート間の冗長性が劇的に減るのです。
pl: I na koniec, Django wykorzystuje koncept „dziedziczenia szablonów”. To to co robi ``{% extends "base.html" %}``. To znaczy „najpierw załaduj szablon nazwany »base«, który definiuje zestaw bloków i wypełnij te bloki poniższymi blokami”. W skrócie, pozwoli to drastycznie wyciąć powtórzenia w szablonach: każdy szablon musi definiować tylko to, co jest dla niego unikalne.
zh_hans: Django 使用了 ''模板继承'' 的概念。这就是 ``{% extends "base.html" %}`` 的作用。它的含义是''先加载名为 base 的模板，并且用下面的标记块对模板中定义的标记块进行填充''。简而言之，模板继承可以使模板间的冗余内容最小化：每个模板只需包含与其它文档有区别的内容。

source: Here's what the "base.html" template, including the use of :doc:`static files </howto/static-files/index>`, might look like:
el: Δείτε και το "base.html" template, συμπεριλαμβανομένου και του :doc:`static files </howto/static-files/index>` template tag:
it: Ecco come dovrebbe essere il template "base.html", compreso l'uso di: :doc:`static files`:
ja: ここでよくある“base.html” テンプレートで、 :doc:`静的ファイルの配信 </howto/static-files/index>` を含む例をあげます:
pl: Tak może wyglądać szablon „base.html”, wliczając użycie :doc:`plików statycznych </howto/static-files/index>`:
zh_hans: 下面是 base.html 可能的样子，它使用了 :doc:`静态文件 </howto/static-files/index>` ：

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This makes a site redesign as easy as changing a single file -- the base template.
el: Το παραπάνω template, σε γενικές γραμμές και πολύ απλοϊκά, ορίζει το πως θα φαίνεται η σελίδα (μαζί με το logo του site) και υποδηλώνει τις "τρύπες" (``block title`` και ``block content``) τις οποίες θα "γεμίσουν" τα child templates. Αυτό κάνει τον τυχόν ανασχεδιασμό του site τόσο εύκολο όσο το να αλλάξετε μόνο ένα αρχείο -- το base template.
ja: このテンプレートはサイトのルック & フィール (とサイトのロゴ) を定義するだけ にまで、極度に単純化されています。また、子テンプレートで埋めるための「穴」 を提供しています。これによって、ベーステンプレート一つを変更するだけでサイ ト全体のデザインを簡単に変更できます。
pl: Prostszymi słowami, definiuje on look-and-feel strony (z logiem strony) i zawiera „dziury” do wypełnienia przez szablony-dzieci. To powoduje, że redesign strony sprowadza się do zmiany w jednym pliku – szablonie bazowym.
zh_hans: 简而言之，它定义了这个网站的外观（利用网站的 logo），并且给子模板们挖好了可以填的”坑“。这也让网站的改版变得简单无比——你只需更改这个根模板文件即可。

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different mobile versions of sites -- simply by creating a new base template.
el: Σας επιτρέπει, επίσης, να δημιουργήσετε διαφορετικές εκδόσεις του site σας, με διαφορετικά base templates, ενώ παράλληλα εσείς επαναχρησιμοποιείτε τα ίδια child templates. Οι δημιουργοί του Django's χρησιμοποιούν αυτή την τεχνική για να δημιουργήσουν εκπληκτικές διαφορετικές mobile εκδόσεις των sites -- απλά και μόνο δημιουργώντας καινούργιο base template.
ja: また、子テンプレートを変えずにベーステンプレートだけを変えた複数バージョン のサイトも作成できます。 Django の作者たちはこのテクニックを使い、新しいテンプレートを作成するだけでモバイル向けのまったく見栄えの違うサイトを作成してきました。
pl: Pozwala ci także stworzyć wiele wersji strony, z różnymi szablonami bazowymi, w czasie gdy wykorzystujesz te same szablony-dzieci. Twórcy Django użyli tej techniki, by stworzyć kompletnie inne mobilne wersje stron – po prostu przez stworzenie nowych szablonów bazowych.
zh_hans: 它还可以让你利用不同的基础模板并重用子模板创建一个网站的多个版本。Django 的创建者已经利用这一技术来创造了明显不同的手机版本的网站——只需创建一个新的基础模板。

source: Note that you don't have to use Django's template system if you prefer another system. While Django's template system is particularly well-integrated with Django's model layer, nothing forces you to use it. For that matter, you don't have to use Django's database API, either. You can use another database abstraction layer, you can read XML files, you can read files off disk, or anything you want. Each piece of Django -- models, views, templates -- is decoupled from the next.
el: Σημειώστε επίσης ότι δεν χρειάζεται να χρησιμοποιήσετε το template system του Django αν δεν σας ταιριάζει. Ενώ δουλεύει και επικοινωνεί εξαιρετικά με το model layer του Django, μπορείτε να χρησιμοποιήσετε κάποιο άλλο template system. Με την ίδια λογική μπορείτε να αλλάξετε και το API για την επικοινωνία με την βάση δεδομένων. Μπορείτε να δουλέψετε με άλλο abstraction layer βάσης δεδομένων, να διαβάζετε XML αρχεία, να διαβάζετε αρχεία εκτός δίσκου ή οτιδήποτε θέλετε. Κάθε κομμάτι του Django -- models, views, templates -- είναι αποσυνδεδεμένο με το επόμενο.
it: Non sei costretto ad utilizzare il linguaggio di template di Django se ne preferisci un altro. Anche se il linguaggio di template di Django è particolarmente ben integrato con i modelli di Django, nessuno ti obbliga ad utilizzarlo. A questo proposito, non sei obbligato ad utilizzare nemmeno il Django database API. Puoi utilizzare qualsiasi livello di astrazione per i database, puoi leggere file XML, puoi leggere file sul disco, o qualsiasi cosa tu voglia. Qualsiasi pezzo di Django (models, views, templates) lavorano indipendentemente dagli altri pezzi.
ja: 他のシステムを使いたければ、必ずしも Django のテンプレートシステムを使う必 要はないということに注意してください。 Django のテンプレートシステムは Django のモデルレイヤと部分的にしっかり組み合わさっていますが、絶対に使わねばならないということではありません。さらに言えば、 Django のデータベース API を使う必然性もありません。別のデータベース抽象化レイヤを使っても構いま せんし、 XML ファイルやディスク上のファイルを読み込んでも構いません。何でもやりたいことをできるのです。Django の構成要素 – モデル、ビュー、テンプレー ト – は、互いに切り離して利用できるのです。
pl: Zwróć uwgę, że nie musisz używać systemu szablonów Django jeśli wolisz inny system. Pomimo że system szablonów Django jest szczególnie dobrze zintegrowany z warstwą modelu Django, nic nie zmusza cię do jego używania. Tak naprawdę nie musisz używać też bazodanowego API Django. Możesz użyć inną warstwę abstrakcji bazy danych, możesz czytać pliki XML, możesz czytać pliki z dysku lub cokolwiek co chcesz. Każdy kawałek Django – modele, widoki, szablony – jest rozdzielony od następnego.
zh_hans: 注意，你并不是非得使用 Django 的模板系统，你可以使用其它你喜欢的模板系统。尽管 Django 的模板系统与其模型层能够集成得很好，但这不意味着你必须使用它。同样，你可以不使用 Django 的数据库 API。你可以用其他的数据库抽象层，像是直接读取 XML 文件，亦或直接读取磁盘文件，你可以使用任何方式。Django 的任何组成——模型、视图和模板——都是独立的。

source: This is just the surface
el: Και αυτό είναι μόνο η επιφάνεια
it: Questa è solo la superficie
ja: これらはほんの一部にすぎません
pl: To tylko powierzchnia
zh_hans: 这仅是基本入门知识

source: This has been only a quick overview of Django's functionality. Some more useful features:
el: Αυτό το άρθρο ήταν μόνο μια γρήγορη προεπισκόπηση των δυνατοτήτων και λειτουργιών του Django. Μερικά πιο χρήσιμα χαρακτηριστικά είναι:
it: Questa è stata solo una breve panoramica sulle funzionalità di Django. Maggiori funzionalità :
ja: 以上、 Django の機能についてざっと紹介してきました。 Django は他にもまだま だ便利な機能を備えています:
pl: To był tylko szybki przegląd funkcjonalności Django. Niektóre bardziej przydatne funkcje:
zh_hans: 以上只是 Django 的功能性概述。Django 还有更多实用的特性：

source: A :doc:`caching framework </topics/cache>` that integrates with memcached or other backends.
el: Το :doc:`caching framework </topics/cache>` το οποίο ενσωματώνεται με το memcached ή άλλα backends.
it: Un :doc:`framework per la cache </topics/cache>` che si integra con memcached o altri backend.
ja: memcached などのバックエンドを組み込んだ :doc:`キャッシュフレームワーク </topics/cache>` 。
pl: :doc:`Framework cache'owania </topics/cache>`, który integruje się z Memcached lub innymi back-endami.
zh_hans: :doc:`缓存框架 </topics/cache>` 可以与 memcached 或其它后端集成。

source: A :doc:`syndication framework </ref/contrib/syndication>` that makes creating RSS and Atom feeds as easy as writing a small Python class.
el: Το :doc:`syndication framework </ref/contrib/syndication>` που βοηθάει στη δημιουργία RSS και Atom feeds τόσο εύκολα όσο να γράψετε μια μικρή Python class.
ja: 小さな Python クラスを書くだけで簡単に RSS や Atom フィードを生成できる :doc:`配信フィードフレームワーク </ref/contrib/syndication>` 。
pl: :doc:`Framework syndykacyjny </ref/contrib/syndication>`, który sprowadza tworzenie feedów RSS i Atom do napisania małej klasy w Pythonie.
zh_hans: :doc:`聚合器框架 </ref/contrib/syndication>` 可以通过简单编写一个 Python 类来推送 RRS 和 Atom。

source: More sexy automatically-generated admin features -- this overview barely scratched the surface.
ja: 自動生成される admin のセクシーな機能の数々。ここで紹介したのはほんの表層の一部でしかありません。
pl: Bardziej seksowne automatycznie wygenerowane funkcje panelu administracyjnego – ten przegląd ledwo musnął powierzchnię.
zh_hans: 更多令人心动的自动化管理功能：概述里面仅仅浅尝辄止。

source: The next obvious steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
el: Τα επόμενα βήματα για σας, στην παρούσα φάση, είναι να `κατεβάσετε το Django`_, να διαβάσετε :doc:`τους οδηγούς (tutorials) </intro/tutorial01>` και να συμμετάσχετε `στην κοινότητα`_. Ευχαριστούμε για το ενδιαφέρον!
ja: 次は、あなたが `Django をダウンロード`_ して、 :doc:`チュートリアル </intro/tutorial01>` を読み、 `コミュニティ`_ に参加する番です。ご精読ありがとうございました!
pl: Następne kroki w sposób oczywisty to `pobranie Django`_, przeczytanie :doc:`tutoriala </intro/tutorial01>` i dołączenie do `społeczności`_. Dziękujemy za zainteresowanie!
zh_hans: 接下来您可以 `下载 Django`_ ，阅读 :doc:`实例教程</intro/tutorial01>` ，然后加入我们的 `社区`_ ！感谢您的关注！

source: Advanced tutorial: How to write reusable apps
el: Οδηγός για προχωρημένους: Πως να γράψετε επαναχρησιμοποιήσιμα apps
it: Tutorial avanzato: Come scrivere applicazioni riutilizzabili
ja: 高度なチュートリアル: 再利用可能アプリの書き方
pl: Zaawansowany tutorial: Jak pisać aplikacje wielokrotnego użytku
zh_hans: 进阶指南：如何编写可重用程序

source: This advanced tutorial begins where :doc:`Tutorial 6 </intro/tutorial06>` left off. We'll be turning our Web-poll into a standalone Python package you can reuse in new projects and share with other people.
ja: このチュートリアルは :doc:`チュートリアル 6 </intro/tutorial06>`のあとに続いています。 Web 投票アプリケーションを独立した Python パッケージにすることで、新規のプロジェクトで再利用したり、他の人に共有したりできます。

source: If you haven't recently completed Tutorials 1–6, we encourage you to review these so that your example project matches the one described below.
ja: 直近のチュートリアル 1 - 6 が終わっていないなら、一目通すことをおすすめします。例で作ったプロジェクトが以下の説明でも使われるからです。

source: Reusability matters
el: Η επαναχρησιμοποίηση έχει σημασία
it: La riusabilità è importante
ja: 再利用性の問題
pl: Możliwość ponownego użycia ma znaczenie
zh_hans: 可重用性很重要

source: It's a lot of work to design, build, test and maintain a web application. Many Python and Django projects share common problems. Wouldn't it be great if we could save some of this repeated work?
el: Απαιτεί πολύ δουλειά για να σχεδιάσετε, χτίσετε, τεστάρετε και διατηρήσετε μια web εφαρμογή (application). Πολλά Python και Django projects μοιράζονται κοινά προβλήματα. Δεν θα ήταν εξαιρετικά αν μπορούσαμε να γλυτώσουμε κάποιο μέρος από αυτή τη ρουτίνα;
it: Ci vuole molto lavoro per progettare, costruire, testare e manutenere una applicazione web. Alcuni progetti in Python e Django condividono problemi comuni. Non sarebbe fantastico se potessimo risparmiare parte di questo lavoro ripetuto?
ja: Web アプリケーションの設計、開発、テスト、そしてメンテナンスには多大な労力が必要です。そして多くの Python 、 Django プロジェクト は共通の問題を抱えています。この繰り返し作業を一部保存して保存しておければ良いと思いませんか？
pl: Zaprojektować, zbudować, przetestować i utrzymywać aplikację webową to bardzo dużo pracy. Wiele projektów w Pythonie i Django napotyka wspólne problemy. Czy nie byłoby super, jeśli moglibyśmy oszczędzić części tej powtarzanej pracy?
zh_hans: 设计，构建，测试以及维护一个 web 应用要做很多的工作。很多 Python 以及 Django 项目都有一些常见问题。如果我们能保存并利用这些重复的工作岂不是更好？

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://www.djangopackages.com>`_ for existing reusable apps you could incorporate in your project. Django itself is also just a Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
ja: 再利用は、 Python ではごく当たり前のことです。 `Python Package Index(PyPI) <https://pypi.python.org/pypi> `_ には様々なパッケージが登録されており、それらはすべてあなたの Python プログラム上で使えます。 `Django Packages <https://www.djangopackages.com>`_ にもプロジェクトに組み込める組み込める再利用可能なアプリケーションがあるので見てみてください。 Django 自体も単なる Python パッケージです。つまり既存の Python パッケージまたは Django アプリケーションを使って、自分の Web プロジェクトを構成できるということです。必要なのはそのプロジェクト独自の部品を書くことだけです。
pl: Ponowne wykorzystanie to sposób na życie w Pythonie. `Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ zawiera obszerny zakres pakietów, które możesz wykorzystać w swoich własnych pythonowych programach. Sprawdź w `Django Packages <https://www.djangopackages.com>`_ istniejące aplikacje gotowe do wykorzystania, które mógłbyś wcielić w swój projekt. Samo Django także jest tylko pythonowym pakietem. To znaczy, że możesz wziąć istniejące pakiety Pythona lub aplikacje Django i złożyć z nich swój własny projekt webowy. Musisz jedynie napisać części, które uczynią twój projekt unikalnym.

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 3 </intro/tutorial03>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
ja: 投票アプリケーションが必要なプロジェクトを開始したとしましょう。ちょうど今まで作ってきたものと似たようなものです。どうやってその アプリケーションを再利用可能にしますか？運のいいことに、その方法はすでに会得済みです。 :doc:`チュートリアル3 </intro/tutorial03>` では、プロジェクトレベルの URLconf から ``include`` を使って、投票アプリを分離する方法をみました。このチュートリアルではアプリケーションを新規のプロジェクトで使いやすいようにし、いつでも別の場所でインストール/利用できるようにしました。
pl: Powiedzmy, że zaczynałeś nowy projekt, który potrzebował aplikacji z ankietą, takiej jak ta, nad którą pracowaliśmy. Jak uczynić tą aplikację gotową do wykorzystania przez innych? Na szczęście, jesteśmy już na dobrej drodze. W :doc:`Tutorialu 3 </intro/tutorial03>` widzieliśmy jak możemy wydzielić ankiety z URLconfa na poziomie projektu przez użycie ``include``. W tym tutorialu poczynimy dalsze kroki, aby uczynić aplikację łatwą do użycia w nowych projektach i gotową do publikacji, aby inni mogli ją zainstalować i używać.
zh_hans: 假设你现在创建了一个新的项目，并且需要一个类似我们之前做的投票应用。你该如何复用这个应用呢？庆幸的是，其实你已经知道了一些。在 :doc:`教程 3 </intro/tutorial03>`，我们使用过 ``include`` 从项目级别的 URLconf 分割出 polls。在本教程中，我们将进一步使这个应用易用于新的项目中，并发布给其他人安装使用。

source: Package? App?
ja: パッケージ？アプリ？
pl: Pakiet? Aplikacja?
zh_hans: 包？应用？

source: A Python `package <https://docs.python.org/tutorial/modules.html#packages>`_ provides a way of grouping related Python code for easy reuse. A package contains one or more files of Python code (also known as "modules").
ja: Python の `パッケージ <https://docs.python.org/tutorial/modules.html#packages>`_ は再利用しやすいように、関連する Python コードをまとめる方法を提供しています。パッケージは Python コードのファイル (通称 "モジュール") を 1 つ以上含んでいます。
