Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Try building your package with ``python setup.py sdist`` (run from inside ``django-polls``). This creates a directory called ``dist`` and builds your new package, ``django-polls-0.1.tar.gz``.
el: Προσπαθήστε να χτίσετε το πακέτο σας (build package) με την εντολή ``python setup.py sdist`` (τρέξτε την μέσα από τον φάκελο ``django-polls``). Αυτή η εντολή δημιουργεί έναν φάκελο με το όνομα ``dist`` και χτίζει το νέο σας πακέτο με το όνομα ``django-polls-0.1.tar.gz``.
it: Prova a fare una build del tuo package con `python setup.py sdist`` (lancialo in ``django-polls``). Questo crea una directory chiamata ``dist`` e costruisce il tuo nuovo package, ``django-polls-0.1.tar.gz``.
ja: ``python setup.py sdist`` でパッケージをビルドしてみましょう (``django-polls`` 内で実行してください) 。これによって ``dist`` というディレクトリと、新しいパッケージである ``django-polls-0.1.tar.gz`` が作られます。
pl: Spróbuj zbudować swój pakiet używając ``python setup.py sdist`` (uruchom z wnętrza ``django-polls``). Stworzy to katalog o nazwie ``dist`` i zbuduje twój nowy pakiet, ``django-polls-0.1.tar.gz``.
zh_hans: 试着构建你自己的应用包通过 ``ptyhon setup.py sdist`` （在 ``django-polls``目录内）。这将创建一个名为 ``dist`` 的目录并构建你自己的应用包， ``django-polls-0.1.tar.gz``。

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_.
ja: パッケージングに関するより豊富な情報は `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_. にあります。
pl: Aby dowiedzieć się więcej na temat pakowania, zobacz `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/en/latest/distributing.html>`_ Pythona.

source: Using your own package
el: Χρησιμοποιώντας το δικό σας package
it: Utilizzare il tuo pacchetto
ja: 自分のパッケージを使ってみる
pl: Używanie twojego własnego pakietu
zh_hans: 使用你自己的包名

source: Since we moved the ``polls`` directory out of the project, it's no longer working. We'll now fix this by installing our new ``django-polls`` package.
el: Από τη στιγμή που μετακινήσαμε τον φάκελο ``polls`` έξω από το project, η εφαρμογή μας δεν δουλεύει πλέον, κάτι το οποίο είναι λογικό. Σε αυτή την παράγραφο θα εγκαταστήσουμε την εφαρμογή μας,``django-polls``, σαν ένα (τρίτο) πακέτο.
it: Dato che abbiamo spostato la cartella ``polls`` fuori dal nostro progetto, non funziona più. Possiamo sistemare questo problema, installando il nuovo nostro package ``django-polls``.
ja: ``polls`` ディレクトリはプロジェクト外に移動したので、これはもう必要ありません。代わりにできたての ``django-polls`` パッケージを使ってみましょう。
pl: Odkąd przenieśliśmy katalog ``polls`` poza projekt, nie działa. Naprawimy to teraz instalując nasz nowy pakiet ``django-polls``.
zh_hans: 由于我们把 ``polls`` 目录移出了项目，所以它无法工作了。我们现在要通过安装我们的新 ``django-polls`` 应用来修复这个问题。

source: Installing as a user library
el: Εγκατάσταση ως βιβλιοθήκη χρήστη (user library)
it: Installando una libreria utente
ja: ユーザーライブラリとしてインストールする
pl: Instalowanie jako bibliotekę użytkownika
zh_hans: 作为用户库安装

source: The following steps install ``django-polls`` as a user library. Per-user installs have a lot of advantages over installing the package system-wide, such as being usable on systems where you don't have administrator access as well as preventing the package from affecting system services and other users of the machine.
el: Τα ακόλουθα βήματα εγκαθιστούν το πακέτο ``django-polls`` ως μια βιβλιοθήκη χρήστη. Αυτό σημαίνει ότι το πακέτο θα εγκατασταθεί στον υπολογιστή για τον συγκεκριμένο χρήστη και όχι γενικά (global) για όλους τους χρήστες του συστήματος. Αυτή η εγκατάσταση έχει πολλά πλεονεκτήματα έναντι της γενικής (global) διότι μπορεί η εφαρμογή να χρησιμοποιηθεί σε συστήματα όπου δεν υπάρχουν δικαιώματα διαχειριστή ή να αποτρέψει την πρόσβαση στην εφαρμογή από άλλους χρήστες ή άλλες υπηρεσίες του συστήματος.
it: I seguenti step installano ``django-polls`` come libreria utente. Le installazioni "per utente" hanno molti vantaggi rispetto a quelle di sistema, come per esempio il fatto di poter essere utilizzate su sistemi dove non si ha accesso di amministrazione così come il fatto che l'utilizzo del package non ha effetto sui servizi del sistema o sugli altri utenti della macchina.
ja: 以下のステップは ``django-polls`` をユーザーライブラリとしてインストールするものです。ユーザー単位でのインストールはシステム全体でのインストールよりも多くの利点があります。管理者アクセス権を持っていないシステム上で使用可能というだけでなく、パッケージがシステムサービスやマシン上の他ユーザーに影響を与えるのを防げます。
pl: Poniższe kroki zainstalują ``django-polls`` jako bibliotekę użytkownika. Instalacja bibliotek per użytkownik posiada sporo zalet w porównaniu do instalacji paczek per system jak np. możliwość instalacji bibliotek w systemie, w którym nie posiadasz uprawnień administracyjnych oraz zapobieganie wpływu biblioteki na system i innych jego użytkowników.
zh_hans: 以下步骤将 ``django-polls`` 以用户库的形式安装。与安装整个系统的软件包相比，用户安装具有许多优点，例如可在没有管理员访问权的系统上使用，以及防止应用包影响系统服务和其他用户。

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so ``virtualenv`` is a more robust solution (see below).
el: Σημειώστε ότι παρόλα τα πλεονεκτήματα των εγκαταστάσεων ανά χρήστη (per-user installations) η συμπεριφορά των εργαλείων του συστήματος μπορεί να επηρεαστεί για τον συγκεκριμένο χρήστη. Για την επίλυση τέτοιων καταστάσεων η χρήση ενός ``virtualenv`` είναι όχι μόνο απαραίτητη αλλά και σταθερή (δείτε παρακάτω).
ja: ユーザー単位でのインストールは依然、そのユーザーのシステムツールの振る舞いに影響をあたえます。なので ``virtualenv`` はより確実な解決になります (下記を参照してください) 。
pl: Pamiętaj, że instalacja per użytkownik nadal może wpłynąć na narzędzia systemowe uruchamiane przez tego samego użytkownika, więc ``virtualenv`` jest bardziej niezawodnym rozwiązaniem (patrz niżej).
zh_hans: 注意，用户安装仍然会影响以这个用户身份运行的系统工具，所以 ``virtualenv`` 是一个更强大的解决方案（如下所示）。

source: To install the package, use pip (you already :ref:`installed it <installing-reusable-apps-prerequisites>`, right?)::
el: Για να εγκαταστήσετε το πακέτο σας, χρησιμοποιήστε το pip (το έχετε :ref:` ήδη εγκατεστημένο <installing-reusable-apps-prerequisites>`, σωστά?)::
it: Per installare il package, usa pip (lo ha già :ref:`installato <installing-reusable-apps-prerequisites>`, giusto?)::
ja: パッケージをインストールするためには、pip を利用してください (すでに ref:`インストール <installing-reusable-apps-prerequisites>` していますよね?):: To install the package, use pip (you already :ref:`installed it <installing-reusable-apps-prerequisites>`, right?)::
pl: Aby zainstalować pakiet, użyj pipa (już :ref:`go zainstalowałeś <installing-reusable-apps-prerequisites>`, prawda?)::
zh_hans: 为了安装这个包，使用 pip (你早已 :ref:`安装 pip <installing-reusable-apps-prerequisites>`, 对吗？)::

source: With luck, your Django project should now work correctly again. Run the server again to confirm this.
el: Με λίγη τύχη, το Django project σας θα λειτουργεί και πάλι όπως πριν. Τρέξτε τον server, ξανά, για να το επιβεβαιώσετε.
it: Con un pizzico di fortuna, il tuo progetto Django ora dovrebbe nuovamente funzionare correttamente. Esegui il server di nuovo per confermare.
ja: 運が良ければ Django プロジェクトは再度、正常に動作します。確認するために再びサーバーを起動します。
pl: Z odrobiną szczęścia, twój projekt Django powinien teraz działać znów poprawnie. Uruchom serwer ponownie, aby to potwierdzić.
zh_hans: 幸运的话，你的 Django 项目应该再一次正确运行。启动服务器确认这一点。

source: To uninstall the package, use pip::
el: Για να απεγκαταστήσετε το πακέτο σας, χρησιμοποιήστε, πάλι το pip::
it: Per disinstallare il package, usare pip::
ja: パッケージをアンインストールするには pip を使います::
pl: Aby odinstalować pakiet, użyj pipa::
zh_hans: 通过 pip 卸载包::

source: Publishing your app
el: Δημοσιεύοντας το app σας
it: Pubblicare la tua applicazione
ja: アプリを公開する
pl: Publikowanie twojej aplikacji
zh_hans: 发布你的应用

source: Now that we've packaged and tested ``django-polls``, it's ready to share with the world! If this wasn't just an example, you could now:
el: Τώρα που έχουμε μετατρέψει σε package και τεστάρει την εφαρμογή ``django-polls``, είναι έτοιμη να διαμοιραστεί στον υπόλοιπο κόσμο! Αν αυτό δεν ήταν κάποιο παράδειγμα, θα μπορούσατε να:
it: Ora che abbiamo creato e testato il package ``django-polls``, è pronto per essere condiviso con il mondo! Se questo non era solo un esempio, potresti fare ora:
ja: ``django-polls`` のパッケージを作り、テストしました。世界に共有するときです！これが単なる例でなければこうします::
pl: Teraz, kiedy już spakowaliśmy i przetestowaliśmy ``django-polls``, są gotowe do podzielenia się ze światem! Gdyby to nie był tylko przykład, mógłbyś teraz:
zh_hans: 现在，你已经对 ``django-polls`` 完成了打包和测试，准备好向世界分享它！如果这不是一个例子应用，你现在就可以这样做。

source: Email the package to a friend.
el: Στείλετε με email το package σε κάποιον φίλο.
it: Manda via mail il package ad un amico.
ja: パッケージを友人にメールで送る
pl: Wyślij e-mail z pakietem do znajomego.
zh_hans: 通过邮件将你的包发送给朋友。

source: Upload the package on your website.
el: Να ανεβάσετε το package στην ιστοσελίδα σας.
it: Uploada il pacchetto sul tuo sito web
ja: 自身の Web サイトにアップロードする
pl: Załaduj pakiet na swoją stronę.
zh_hans: 将这个包上传至你的网站。

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ for doing this.
ja: 公開されているリポジトリに投稿する。例えば `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ には `よくできたチュートリアル <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ があります。
pl: Opublikuj pakiet w publicznym repozytorium, takim jak `Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ ma `dobry tutorial <https://packaging.python.org/en/latest/distributing.html#uploading-your-project-to-pypi>`_ na ten temat.

source: Installing Python packages with virtualenv
el: Εγκατάσταση Python packages με το virtualenv
ja: virtualenv に Python パッケージをインストールする
pl: Instalowanie pakietów Pythona z virtualenvem
zh_hans: 通过 virtualenv 安装 Python 包

source: Earlier, we installed the polls app as a user library. This has some disadvantages:
el: Νωρίτερα, εγκαταστήσαμε την εφαρμογή ψηφοφορίας ως μια βιβλιοθήκη χρήστη (user library). Αυτό κρύβει μερικά μειονεκτήματα:
it: Prima, abbiamo installato la app polls come una libreria utente. Questo però ha dei svantaggi:
ja: これまでは投票アプリをユーザーライブラリにインストールしてきました。これにはいくつか欠点があります:
pl: Wcześniej zainstalowaliśmy aplikację ankietową jako bibliotekę użytkownika. Ma to pewne wady:
zh_hans: 早些时候，我们以用户库的形式安装了投票应用。这样做有一些缺点。

source: Modifying the user libraries can affect other Python software on your system.
el: Η αλλαγή των βιβλιοθηκών χρηστών μπορεί να επηρεάσει άλλο Python software μέσα στο σύστημα σας.
it: Modificare le librerie delle utenze può danneggiare altri software Python installati nel tuo sistema.
ja: ユーザーライブラリの変更はシステム上の他の Python ソフトウェアに影響を与えるおそれがあります
pl: Modyfikowanie bibliotek użytkownika może wpłynąć na inne oprogramowanie Python w twoim systemie.
zh_hans: 修改用户库会影响你系统上的其他 Python 软件。

source: You won't be able to run multiple versions of this package (or others with the same name).
el: Δεν θα είστε σε θέση να τρέξετε πολλαπλές εκδόσεις το ίδιου πακέτου (ή άλλων με το ίδιο όνομα).
it: Non sarai in grado di eseguire multiple versioni di questo pacchetto ( o altri con lo stesso nome ).
ja: このパッケージの複数バージョン (もしくは同じ名前の別のもの) を実行できません
pl: Nie będziesz w stanie uruchamiać wielu wersji tego pakietu (lub innych o takiej samej nazwie).
zh_hans: 你将不能运行此包的多个版本（或者其它用有相同包名的包）。

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use `virtualenv <http://www.virtualenv.org/>`_. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
ja: 一般的に、複数の Django プロジェクトをメンテナンスしてる場合に生じる問題です。そうであるなら、一番良い解決策は `virtualenv <http://www.virtualenv.org/>`_ を使用することです。このツールを使えば複数の独立した Python 環境をメンテナンスできます。それぞれでライブラリのコピーと、パッケージの名前空間を独自に管理出来ます。
pl: Zazwyczaj takie sytuacje zdarzają się tylko kiedy utrzymujesz kilka projektów Django. W takiej sytuacji najlepszym rozwiązaniem jest `virtualenv <http://www.virtualenv.org/>`_. To narzędzie pozwala utrzymywać wiele izolowanych środowisk Pythona, każdy ze swoimi własnymi kopiami bibliotek i przestrzeniami nazw dla pakietów.

source: Writing your first Django app, part 1
el: Γράφοντας το πρώτο σας Django app, μέρος 1
it: Scrivere la tua prima applicazione in Django, parte 1
ja: はじめての Django アプリ作成、その 1
pl: Pisanie pierwszej aplikacji Django, część 1.
zh_hans: 编写你的第一个 Django 应用，第 1 部分

source: Let's learn by example.
el: Ο μόνος τρόπος να μάθετε να γράφετε Django apps (εφαρμογές) και γενικά να δουλεύετε με το Django είναι μέσα από παραδείγματα.
it: Impariamo attraverso un esempio.
ja: さあ、例を交えながら学んでゆきましょう。
pl: Nauczmy się na przykładzie.
zh_hans: 让我们通过示例来学习。

source: Throughout this tutorial, we'll walk you through the creation of a basic poll application.
el: Μέσα από αυτόν τον οδηγό, θα φτιάξουμε παρέα μία απλή εφαρμογή (application) ψηφοφορίας (poll app). Κάθε ερώτηση θα απαρτίζεται από ένα σετ απαντήσεων, από τις οποίες ο χρήστης θα μπορεί να επιλέξει μία κάθε φορά.
it: Durante questa guida, ti accompagneremo attraverso la creazione di una semplice applicazione per sondaggi.
ja: このチュートリアルでは、簡単な投票 (poll) アプリケーションの作成に取り組ん でもらいます。
pl: Z pomocą tego tutoriala przeprowadzimy cię przez stworzenie prostej aplikacji ankietowej.
zh_hans: 通过这个教程，我们将带着你创建一个基本的投票应用程序。

source: It'll consist of two parts:
el: Η εφαρμογή θα αποτελείται από δύο μέρη:
it: Consisterà di due parti:
ja: Poll アプリケーションは 2 つの部分からなります:
pl: Będzie ona się składało z dwóch części:
zh_hans: 它将由两部分组成：

source: A public site that lets people view polls and vote in them.
el: Ένα κοινό-δημόσιο site που θα επιτρέπει στους χρήστες να βλέπουν τις διαθέσιμες ψηφοφορίες (γκάλοπ, αν προτιμάτε) και να ψηφίζουν.
it: Un sito pubblico, che permette agli utenti di visualizzare sondaggi e votarli.
ja: ユーザが投票したり結果を表示したりできる公開用サイト
pl: Publicznej strony, która pozwoli ludziom obejrzeć ankiety i głosować w nich.
zh_hans: 一个让人们查看和投票的公共站点。

source: An admin site that lets you add, change, and delete polls.
el: Ένα διαχειριστικό (admin) site το οποίο θα επιτρέπει σε εσάς (που θα είστε ο διαχειριστής) να προσθέτετε νέες, να αλλάζετε ήδη υπάρχουσες αλλά και να διαγράφετε ψηφοφορίες.
it: Un sito amministrativo che ti permette l'aggiunta, modifica ed eliminazione di sondaggi.
ja: 投票項目の追加、変更、削除を行うための管理 (admin) サイト
pl: Panelu administracyjnego, który pozwoli ci dodawać, zmieniać i usuwać ankiety.
zh_hans: 一个让你能添加、修改和删除投票的管理站点。

source: We'll assume you have :doc:`Django installed </intro/install>` already. You can tell Django is installed and which version by running the following command:
ja: :doc:`Django は既にインストール済み </intro/install>` として、説明を進めます。 Django がインストールされている、どのバージョンか調べるには、以下のコマンドを実行します:
pl: Zakładamy, że masz już :doc:`zainstalowane Django </intro/install>`. Możesz sprawdzić, czy jest zainstalowane i w której wersji, uruchamiając następującą komendę:

source: If Django is installed, you should see the version of your installation. If it isn't, you'll get an error telling "No module named django".
el: Αν το Django είναι εγκατεστημένο, θα δείτε την έκδοση του. Αν δεν είναι, θα δείτε ένα σφάλμα λέγοντας σας ότι “δεν υπάρχει κάποιο module με το όνομα django” (no module named django).
it: Se Django è installato, dovresti vedere la versione della tua installazione. Se non lo è, riceverai un errore che dice "No module named django".
ja: Django がインストールされていれば、インストールされている Django のバージョンがわかります。もしなければ "No module named django" とエラーが表示されます。
pl: Jeśli Django jest zainstalowane, powinieneś zobaczyć wersję swojej instalacji. Jeśli nie jest, dostaniesz błąd „No module named django”.
zh_hans: 如果这行命令输出了一个版本号，证明你已经安装了此版本的 Django；如果你得到的是一个“No module named django”的错误提示，则表明你还未安装。

source: This tutorial is written for Django |version| and Python 3.4 or later. If the Django version doesn't match, you can refer to the tutorial for your version of Django by using the version switcher at the bottom right corner of this page, or update Django to the newest version. If you are still using Python 2.7, you will need to adjust the code samples slightly, as described in comments.
ja: このチュートリアルは Django |version| と Python 3.4 以降を対象に書かれています。 Django のバージョンが合わなければ、このページの右下のバージョンスイッチャーを使用して、インストールされている Django のバージョンのチュートリアルを参照するか、最新の Django にアップデートしてください。 Python 2.7 を使用している場合は、コメントで説明されているように、サンプルコードを調整する必要があります。
pl: Ten tutorial jest napisany dla Django |version| i Pythona 3.4 lub późniejszych. Jeśli wersja Django się nie zgadza, możesz przełączyć się na swoją wersję Django używając przełącznika wersji w prawym dolnym rogu tej strony, lub możesz zaktualizować Django do najnowszej wersji. Jeśli wciąż używasz Pythona 2.7, będziesz musiał dostosować nieco próbki kodu, według opisu w komentarzach.

source: See :doc:`How to install Django </topics/install>` for advice on how to remove older versions of Django and install a newer one.
el: Δείτε See :doc:`πως να εγκαταστήσετε το Django </topics/install>` για συμβουλές απεγκατάστασης τυχόν παλιών εκδόσεων και εγκατάστασης της καινούργιας.
it: Vedi :doc:`Come installare Django </topics/install>` per consigli su come rimuovere vecchie versioni di Django ed installarne una più nuova.
ja: :doc:`Django のインストール方法 </topics/install>` を見て、 Django の旧バージョンを削除してより新しいものをインストールしてください。
pl: Zobacz :doc:`Jak zainstalować Django </topics/install>`, by znaleźć wskazówki jak usunąć stare wersje Django i zainstalować nową.
zh_hans: 你可以查看文档 :doc:`如何安装 Django </topics/install>` 来获得关于移除旧版本，安装新版本的流程和建议。

source: If you're having trouble going through this tutorial, please post a message to |django-users| or drop by `#django on irc.freenode.net <irc://irc.freenode.net/django>`_ to chat with other Django users who might be able to help.
el: Αν δυσκολεύεστε να ακολουθήσετε αυτόν τον οδηγό παρακαλούμε στείλτε ένα μήνυμα στους |django-users| ή μπορείτε να συμμετέχετε στο κανάλι `#django του irc.freenode.net <irc://irc.freenode.net/django>`_ για να μιλήσετε με άλλους Django προγραμματιστές οι οποίοι, ενδεχομένως, να θέλουν να σας βοηθήσουν.
ja: このチュートリアルを進めてゆく上で困ったことがあったら、 |django-users| もしくは `irc.freenode.net の #django チャンネル <irc://irc.freenode.net/django>`_ で誰か助けてくれそうな Django ユーザと話してみてください。
pl: Jeśli masz problemy z przejściem tego tutoriala, prosimy napisz wiadomość do |django-users| lub wpadnij na `#django na irc.freenode.net <irc://irc.freenode.net/django>`_, aby czatować z innymi użytkownikami Django, który mogą być w stanie udzielić pomocy.
zh_hans: 如果你在阅读或实践本教程中遇到困难, 请发消息给 |django-users| 或加入 `#django on irc.freenode.net <irc://irc.freenode.net/django>`_ 来和其他的 Django 用户交流，他们也许能帮到你。

source: Creating a project
el: Δημιουργία project
it: Creare un progetto
ja: プロジェクトを作成する
pl: Tworzenie projektu
zh_hans: 创建项目

source: If this is your first time using Django, you'll have to take care of some initial setup. Namely, you'll need to auto-generate some code that establishes a Django :term:`project` -- a collection of settings for an instance of Django, including database configuration, Django-specific options and application-specific settings.
el: Αν αυτή είναι η πρώτη φορά που χρησιμοποιείτε το Django, θα χρειαστεί να ρυθμίσετε κάποια πράγματα στην αρχή. Θυμηθείτε ότι οι σωστές βάσεις δημιουργούν σταθερά σπίτια. Πιο συγκεκριμένα, θα χρειαστεί να τρέξετε μια Django εντολή η οποία θα δημιουργήσει αυτόματα ένα Django :term:`project` -- το οποίο δεν είναι τίποτε άλλο παρά ένας φάκελος (μια συλλογή από ρυθμίσεις, αν θέλετε) που περιέχει διάφορα αρχεία, όπως ρυθμίσεις της βάσης δεδομένων, διάφορες επιλογές του Django και ρυθμίσεις που αφορούν το application σας. Αν μπερδευτήκατε, μην ανησυχείτε, θα διαλευκανθούν όλα καθώς προχωράμε στον οδηγό.
it: Se questa è la prima volta volta che usi Django, dovrai prenderti cura di qualche configurazione iniziale. Specificatamente, dovrai auto-generare del codice che costituisce un :term:`progetto` Django -- una collezione di settaggi per un'instanza di Django, che include configurazione del database, opzioni specifiche per Django e settaggi specifici per l'applicazione.
ja: 初めて Django を使うのなら、最初のセットアップを行う必要があります。通常は、 Django の :term:`プロジェクト` (:term:`project`) を構成するコードを自動生成します。プロジェクトとは、データベースの設定や Django 固有のオプション、アプリケーション固有の設定などといった、個々の Django インスタンスの設定を集めたものです。
pl: Jeśli po raz pierwszy korzystasz z Django, będziesz musiał zająć się wstępną konfiguracją. Konkretnie, będziesz potrzebował wygenerować trochę kodu, który stworzy :term:`projekt` Django – zbiór ustawień dla instacji Django, wliczając konfigurację bazy danych, ustawienia specyficzne dla Django i specyficzne dla aplikacji.
zh_hans: 如果这是你第一次使用 Django 的话，你需要一些初始化设置。也就是说，你需要用一些自动生成的代码配置一个 Django :term:`project` —— 即一个 Django 项目实例需要的设置项集合，包括数据库配置、Django 配置和应用程序配置。

source: From the command line, ``cd`` into a directory where you'd like to store your code, then run the following command:
el: Από κονσόλα τρέξτε την εντολή, ``cd`` και τον φάκελο που θα θέλατε να αποθηκευτεί το Django project σας. Μετά τρέξτε την ακόλουθη εντολή:
it: Dalla linea di comando, ``cd`` dentro la directory dove vorresti tenere il tuo codice, poi chiama il seguente comando:
ja: コマンドラインから、コードを置きたい場所に ``cd`` して、以下のコマンドを 実行してください。
pl: Z linii komend, wejdź ``cd`` do katalogu, gdzie chciałbyś przechowywać swój kod, następnie uruchom następującą komendę:
zh_hans: 打开命令行，``cd`` 到一个你想放置你代码的目录，然后运行以下命令：

source: This will create a ``mysite`` directory in your current directory. If it didn't work, see :ref:`troubleshooting-django-admin`.
el: Συγχαρητήρια! Μόλις δημιουργήσατε το πρώτο σας Django project. Αυτή η εντολή θα δημιουργήσει αυτόματα (μέσα στον φάκελο που κάνατε ``cd``) ένα φάκελο με το όνομα ``mysite``. Αν δεν δούλεψε, δείτε στα :ref:`προβλήματα τρέχοντας το django-admin <troubleshooting-django-admin>`.
it: Questo creerà una directory ``mysite`` nella directrory presente. Se non funziona, consulta :ref:`troubleshooting-django-admin`.
ja: 現在のディレクトリに ``mysite`` ディレクトリが作成されます。動作しなければ :ref:`troubleshooting-django-admin` を参照してください。
pl: Stworzy ona katalog ``mysite`` w twoim bieżącym katalogu. Jeśli nie zadziałała, zobacz :ref:`troubleshooting-django-admin`.
zh_hans: 这行代码将会在当前目录下创建一个 ``mysite`` 目录。如果命令失败了，查看 :ref:`troubleshooting-django-admin`，可能能给你提供帮助。

source: You'll need to avoid naming projects after built-in Python or Django components. In particular, this means you should avoid using names like ``django`` (which will conflict with Django itself) or ``test`` (which conflicts with a built-in Python package).
el: Θα πρέπει να δώσετε ιδιαίτερη προσοχή στην ονομασία του project σας, προσέχοντας να μην το ονομάσετε με δεσμευμένες λέξεις που χρησιμοποιεί η Python ή το Django. Πιο συγκεκριμένα, θα πρέπει να αποφεύγετε ονομασίες όπως ``django`` (κάτι το οποίο θα έρθει σε σύγκρουση με το ίδιο το Django) ή ``test`` (το οποίο θα έρθει σε σύγκρουση με το προεγκατεστημένο πακέτο της Python).
it: Vorrai evitare di chiamare progetti con lo stesso nome di componenti predefiniti in Python o Django. In particolare, questo significa evitare nomi quali ``django`` (che confligge con Django stesso) o ``test`` (che confligge con il pacchetto Python di serie).
ja: プロジェクトの名前を付けるとき、組み込みの Python モジュールや Django のコンポーネントの名前を使わないようにしてください。とりわけ、 ``django`` (Django 自体と名前が衝突します) や ``test`` (組み込みの Python パッケージ名と名前が衝突します) を使わないようにしましょう。
pl: Musisz unikać nazywania projektów tak samo jak wbudowane w Pythona albo Django komponenty. W szczególności znaczy to, że powinieneś unikać używania nazw jak ``django`` (co wejdzie w konflikt z samym Django) lub ``test`` (wejdzie w konflikt z wbudowanym pakietem Pythona).
zh_hans: 你得避免使用 Python 或 Django 的内部保留字来命名你的项目。具体地说，你得避免使用像 ``django`` (会和 Django 自己产生冲突)或 ``test`` (会和 Python 的内置组件产生冲突)这样的名字。

source: Where should this code live?
el: Που να αποθηκεύσω το project μου;
it: Dove dovrebbe vivere questo codice?
ja: コードはどこに置くの？
pl: Gdzie powinien żyć ten kod?
zh_hans: 我的代码该放在哪？
