Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: By registering the ``Question`` model with ``admin.site.register(Question)``, Django was able to construct a default form representation. Often, you'll want to customize how the admin form looks and works. You'll do this by telling Django the options you want when you register the object.
el: Κάνοντας register το ``Question`` model με το Django admin (``admin.site.register(Question)``), το Django ήταν σε θέση να κατασκευάσει μια προεπιλεγμένη εμφάνιση της φόρμας του μοντέλου για επεξεργασία. Με άλλα λόγια σας δίνει τη δυνατότητα να δημιουργείτε, επεξεργάζεστε, ανανεώνετε και διαγράφετε entries στη βάση δεδομένων σας (υπενθυμίζουμε ότι κάθε instance του μοντέλου σας αναπαριστά και μια γραμμή -entry, row- στον αντίστοιχο πίνακα της database) χωρίς τη χρήση της κονσόλας (γραμμής εντολών). Πολύ συχνά θα θέλετε να επεξεργαστείτε την εμφάνιση της φόρμας αυτής καθώς και τον τρόπο που λειτουργεί. Για να το πετύχετε αυτό δεν έχετε παρά να πείτε στο Django τις επιλογές-ρυθμίσεις που θέλετε, για αυτό το μοντέλο, την ώρα που κάνετε register το μοντέλο σας με το Django admin.
it: Registrando il modello ``Question`` con ``admin.site.register(Question)``, Django è stato in grado di costruire un form di default. Spesso, vorrai personalizzare il modo in cui il form di amministrazione appare e funziona. Lo farai dicendo a Django quali opzioni vuoi quando registrerai l'oggetto.
ja: ``admin.site.register(Question)`` の呼び出しによって ``Question`` モデルを登録したことで、Django はデフォルトの形式でオブジェクトを表示できました。ふつうは、admin フォームの表示方法や操作の仕方をデフォルトから少し変更したくなりますが、これには、オブジェクトを登録する時にオプションを指定します。
pl: Rejestrując model ``Question`` przez ``admin.site.register(Question)``, umożliwiłeś Django skonstruować domyślną reprezentację formularza. Często będziesz chciał zmienić jak formularz panelu administracyjnego wygląda i działa. Będziesz to robił mówiąc Django, jakie wybierasz opcje, rejestrując obiekt.
zh_hans: 通过 ``admin.site.register(Question)`` 注册 ``Question`` 模型，Django 能够构建一个默认的表单用于展示。通常来说，你期望能自定义表单的外观和工作方式。你可以在注册模型时将这些设置告诉 Django。

source: Let's see how this works by reordering the fields on the edit form. Replace the ``admin.site.register(Question)`` line with:
el: Ας δούμε πως δουλεύει αναδιοργανόνοντας τα πεδία (fields) στην φόρμα επεξεργασίας (edit form). Μέσα στο αρχείο ``polls/admin.py``, αντικαταστήστε την γραμμή ``admin.site.register(Question)`` με αυτό το κομμάτι κώδικα:
it: Vediamo come funziona riordinando i campi nel modulo di modifica. Sostituisci la riga ``admin.site.register(Question)`` con:
ja: ためしに、編集フォームでのフィールドの並び順を並べ替えてみましょう。 ``admin.site.register(Question)`` の行を以下のように置き換えてみてください。
pl: Zobaczmy jak to działa zmieniając kolejność pól w formularzu edycji. Zamień linię ``admin.site.register(Question)`` na:
zh_hans: 让我们通过重排列表单上的字段来看看它是怎么工作的。用以下内容替换 ``admin.site.register(Question)``：

source: You'll follow this pattern -- create a model admin class, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for an model.
ja: このように、モデルの admin のオプションを変更したいときには、モデルごとに admin クラスを作成して、 ``admin.site.register()`` の 2 番目の引数に渡すと いうパターンに従ってください。

source: This particular change above makes the "Publication date" come before the "Question" field:
el: Αν θυμάστε, πριν την αλλαγή αυτή, στη φόρμα επεξεργασίας εμφανιζόταν πρώτα το πεδίο της ερώτησης και μετά το πεδίο της ημερομηνίας επειδή τα είχαμε δηλώσει με αυτή τη σειρά στο μοντέλο ``Question``. Τώρα, παρακάμπτουμε αυτή τη σειρά και πλέον εμφανίζεται πρώτα το πεδίο της ημερομηνίας ("Publication date") και κατόπιν το πεδίο της ερώτησης ("Question"):
it: Questa particolare modifica qui sopra fa sì che la "Data di pubblicazione" venga prima del campo "Domanda":
ja: 上の例では、「Publication date」フィールドの表示位置を「Question」フィールドよりも前に変更しています:
pl: Konkretnie ta zmiana powyżej powoduje, że „Publication date” jest przed polem „Question”:
zh_hans: 以上修改使得 "Publication date" 字段显示在 "Question" 字段之前：

source: This isn't impressive with only two fields, but for admin forms with dozens of fields, choosing an intuitive order is an important usability detail.
el: Αυτό δεν είναι και τόσο εντυπωσιακό με μόλις δύο πεδία, αλλά για φόρμες admin (admin forms) με δεκάδες πεδία, η επιλογή της σειράς εμφάνισης αποτελεί σημαντική λεπτομέρεια.
it: Questo non è impressionante con solo due campi, ma per i moduli di amministrazione con dozzine di campi, la scelta di un ordine intuitivo è un dettaglio importante per l'usabilità.
ja: 二つしかフィールドがないので、あまりぱっとした変化ではありませんね。しかし admin フォームで何ダースものフィールドを操作するような場合には、直感的なフィー ルドの並び順というものはユーザビリティ上重要な要素です。
pl: Nie robi to wrażenia z tylko dwoma polami, ale dla formularzy admina z tuzinami pól, wybranie intuicyjnego porządku jest ważnym szczegółem użyteczności.
zh_hans: 这在只有两个字段时显得没啥卵用，但对于拥有数十个字段的表单来说，为表单选择一个直观的排序方法就显得你的针很细了。

source: And speaking of forms with dozens of fields, you might want to split the form up into fieldsets:
el: Και μιλώντας για φόρμες με δεκάδες πεδία, ίσως να θέλετε να διαχωρίσετε τη φόρμα σε πεδία φορμών (fieldsets):
it: E parlando di moduli con dozzine di campi, potresti voler dividere il modulo in gruppi di campi:
ja: 同じく何ダースもフィールドがある場合、フォームを複数のフィールドセットに分割したいこともあるでしょう。
pl: A mówiąc o formularzach z tuzinami pól, możesz chcieć podzielić formularz na fieldsety:
zh_hans: 说到拥有数十个字段的表单，你可能更期望将表单分为几个字段集：

source: The first element of each tuple in :attr:`~django.contrib.admin.ModelAdmin.fieldsets` is the title of the fieldset. Here's what our form looks like now:
el: Το πρώτο element από κάθε tuple μέσα στη λίστα :attr:`~django.contrib.admin.ModelAdmin.fieldsets` είναι ο τίτλος του fieldset. Δείτε πως θα εμφανίζεται τώρα η φόρμα:
it: Il primo elemento di ogni tupla in :attr:`~django.contrib.admin.ModelAdmin.fieldsets` è il titolo del fieldset. Ecco come il nostro form appare adesso:
ja: :attr:`~django.contrib.admin.ModelAdmin.fieldsets` の各タプルの先頭の要素はフィールドセットのタイトルです。 フォームは以下のように表示されます。
pl: Pierwszym elementem każdej krotki w :attr:`~django.contrib.admin.ModelAdmin.fieldsets` jest tytuł fieldsetu. Tak wygląda teraz nasz formularz:
zh_hans: :attr:`~django.contrib.admin.ModelAdmin.fieldsets` 元组中的第一个元素是字段集的标题。以下是我们的表单现在的样子：

source: Adding related objects
el: Προσθήκη συσχετισμένων objects
it: Aggiunta di oggetti correlati
ja: リレーションを張ったオブジェクトの追加
pl: Dodawanie powiązanych obiektów
zh_hans: 添加关联的对象

source: OK, we have our Question admin page, but a ``Question`` has multiple ``Choice``\s, and the admin page doesn't display choices.
el: Ωραία, έχουμε την σελίδα διαχείρισης του Question model, αλλά ένα ``Question`` έχει πολλαπλά ``Choice``\s και η φόρμα δεν εμφανίζει αυτές τις επιλογές.
it: OK, abbiamo la nostra pagina di amministrazione del modello Question, ma una ``Question`` ha più ``Choice``, e il pannello di amministrazione non mostra le scelte.
ja: OK、 Question の管理ページはできました。しかし ``Question`` は複数の ``Choice``\s を持つのに、管理ページには表示されていませんね。
pl: Ok, mamy stronę admina dla pytań, ale ``Question`` ma wiele wyborów i strona admina tych wyborów nie wyświetla.
zh_hans: 好了，现在我们有了投票的后台页。不过，一个 ``Question`` 有多个 ``Choice``，但后台页却没有显示多个选项。

source: Yet.
el: Ακόμα.
it: Ancora.
ja: 今はまだ。
pl: Jeszcze nie wyświetla.
zh_hans: 好了。

source: There are two ways to solve this problem. The first is to register ``Choice`` with the admin just as we did with ``Question``. That's easy:
el: Υπάρχουν δύο τρόποι να λυθεί αυτό το πρόβλημα. Ο πρώτος τρόπος είναι να κάνετε register το μοντέλο ``Choice`` με το admin, όπως ακριβώς κάναμε με το μοντέλο ``Question``. Αυτό είναι πανεύκολο:
ja: この問題の解決法は二つあります。一つ目は、 ``Question`` と同様、以下のようにして ``Choice`` モデルを管理サイトに登録するというものです。これは簡単です。
pl: Są dwa sposoby rozwiązania tego problemu. Pierwszy to zarejestrować ``Choice`` z adminem tak jak zrobiliśmy przed chwilą z ``Question``. To proste:
zh_hans: 有两个方法可以解决这个问题。第一个就是仿照我们向后台注册 ``Question`` 一样注册 ``Choice`` 。这很简单：

source: Now "Choices" is an available option in the Django admin. The "Add choice" form looks like this:
el: Μετά από αυτό, το μοντέλο ``Choice`` απέκτησε τη δική του διαχειριστική φόρμα (admin form). Επομένως, τα πεδία της φόρμας θα εμφανιστούν με τη σειρά που δηλώθηκαν στο ίδιο το μοντέλο (εφόσον δεν κάναμε καμία αλλαγή μέσα στο ``admin.py`` όπως κάναμε για το ``Question``). Η φόρμα θα δείχνει κάπως έτσι:
it: Ora "Scelte" è un'opzione disponibile nell'amministrazione di Django. Il modulo "Aggiungi scelta" ha questo aspetto:
ja: これで、 Django の管理サイト上で「Choice」 を選べます。「Choice の追加」フォーム は以下のようになります。
pl: Teraz „Choices” są dostępną opcją w adminie Django. Formularz „Add choice” wygląda tak:
zh_hans: 现在 "Choices" 在 Django 后台页中是一个可用的选项了。“添加选项”的表单看起来像这样：

source: In that form, the "Question" field is a select box containing every question in the database. Django knows that a :class:`~django.db.models.ForeignKey` should be represented in the admin as a ``<select>`` box. In our case, only one question exists at this point.
el: Σε αυτή τη φόρμα, το πεδίο "Question" αναπαριστάται από ένα HTML select box το οποίο περιέχει κάθε ερώτηση μέσα στη βάση δεδομένων. Το Django γνωρίζει ότι η κλάση :class:`~django.db.models.ForeignKey` θα πρέπει να αναπαρασταθεί ως ένα ``<select>`` box μέσα στην admin form. Στη δικιά μας περίπτωση, μόνο μια ερώτηση θα εμφανιστεί σε αυτό το σημείο (εκτός κι αν έχετε δημιουργήσει και άλλες).
it: In quel form, il campo "Question" è un menu a tendina contenente tutte le domande nel database. Django sa che una :class:`~django.db.models.ForeignKey` dovrebbe essere rappresentata nell'admin come una ``<select>``. Nel nostro caso, esiste solo una domanda a questo punto.
ja: このフォームでは「Question」フィールドは選択ボックスで、データベース上の全ての質問を選択できます。Django は :class:`~django.db.models.ForeignKey` を表示する時には ``<select>`` ボックスを使わねばならないということを知っているのです。今の時点では、 Question はデータベース上に一つしかないはずですね。
pl: W tym formularzu pole „Question” jest polem wyboru zawierającym wszystkie pytania z bazy danych. Django wie, że :class:`~django.db.models.ForeignKey` powinno być reprezentowane w adminie jako ``<select>``. W naszym przypadku istnieje tylko jedno pytanie w tym momencie.
zh_hans: 在这个表单中，"Question" 字段是一个包含数据库中所有投票的选择框。Django 知道要将 :class:`~django.db.models.ForeignKey` 在后台中以选择框 ``<select>`` 的形式展示。此时，我们只有一个投票。

source: Also note the "Add Another" link next to "Question." Every object with a ``ForeignKey`` relationship to another gets this for free. When you click "Add Another", you'll get a popup window with the "Add question" form. If you add a question in that window and click "Save", Django will save the question to the database and dynamically add it as the selected choice on the "Add choice" form you're looking at.
el: Επίσης προσέξτε το link "Προσθήκη Καινούγιου <όνομα_μοντέλου>" (με το σύμβολο της πρόσθεσης) δίπλα από το πεδίο "Question." Κάθε object με ένα πεδίο ``ForeignKey`` λαμβάνει αυτή την ευκολία από προεπιλογή. Όταν κλικάρετε πάνω σε αυτό το link, θα δείτε ένα popup παράθυρο με τη φόρμα επεξεργασίας του ``Question`` μοντέλου (αυτή που είδαμε πριν). Αν προσθέσετε μια ερώτηση σε αυτό το πράθυρο και κλικάρετε "Αποθήκευση", το Django θα αποθηκεύσει την ερώτηση στη βάση δεδομένων και έπειτα θα εμφανίσει αυτή την ερώτηση ως επιλεγμένη (selected) στο ``<select>`` box.
it: Nota anche il link "Aggiungi un'altra" vicino a "Domanda". Ogni oggetto con una relazione ``ForeignKey`` verso un altro oggetto lo ottiene gratis. Quando fai click su "Aggiungi un'altra", otterrai una finestra popup con lo stesso form "Aggiungi Domanda". Se aggiungi una domanda in quel form e fai click su "Salva", Django salverà la domanda sul database e la aggiungerà dinamicamente come scelta selezionata sul form "Aggiungi scelta" che stai guardando.
ja: Question フィールドの隣に「もう一つ追加 (Add Another)」リンクがあるのに注意してください。 ``ForeignKey`` の関係にあるオブジェクトなら、何もしなくてもこのリンクが表示されます。「もう一つ追加」をクリックすると、「Poll を追加 (Add poll)」というポップアップウィンドウを表示します。このウィンドウで Poll を追加して「保存」を押すと、 Django は Poll をデータベースに保存して、もとの 「Choice の追加」フォームに選択済みの項目として動的に追加します。
pl: Zwróć też uwagę na link „Add Another” przy „Question”. Każdy obiekt z relacją ``ForeignKey`` do innego zyskuje go automatycznie. Kiedy klikniesz „Add Another”, dostaniesz okno popup z formularzem „Add question”. Jeśli dodasz pytanie w tym oknie i klikniesz „Save”, Django zapisze pytanie do bazy danych i dynamicznie doda je jako wybrane pytanie w formularzu „Add choice”, na który patrzysz.
zh_hans: 同时也注意下 "Question" 旁边的“添加”按钮。每个使用 ``ForeignKey`` 关联到另一个对象的对象会自动获得这个功能。当你点击“添加”按钮时，你会见到一个包含“添加投票”的表单。如果你在这个弹出框中添加了一个投票，并点击了“保存”，Django 会将其保存至数据库，并动态地在你正在查看的“添加选项”表单中选中它。

source: But, really, this is an inefficient way of adding ``Choice`` objects to the system. It'd be better if you could add a bunch of Choices directly when you create the ``Question`` object. Let's make that happen.
el: Όμως αυτός ο τρόπος προσθήκης επιλογών (``Choice`` objects) δεν είναι και ο πιο αποτελεσματικός που υπάρχει. Δε θα ήταν πιο βολικό αν δημιουργούσατε τα ``Choice``s κατά τη διάρκεια δημιουργίας των ερωτήσεων; Ας το υλοποιήσουμε.
it: Ma, onestamente, questo è un modo inefficiente di aggiungere oggetti ``Choice`` al sistema. Sarebbe meglio se potessi aggiungere un gruppo di Choices direttamente quando crei l'oggetto ``Question``. Facciamolo.
ja: しかし、この方法は ``Choice`` オブジェクトをシステムに追加するには効率的ではありません。 ``Question`` オブジェクトを追加する時に Choice をひと揃い追加できた方が便利ですよね。そうしてみましょう。
pl: Ale tak naprawdę to niewydajny sposób na dodawanie obiektów ``Choice`` do systemu. Byłoby lepiej, jeśli mógłbyś dodać zestaw wyborów bezpośrednio, gdy tworzysz obiekt ``Question``. Zróbmy tak.
zh_hans: 不过，这是一种很低效地添加“选项”的方法。更好的办法是在你创建“投票”对象时直接添加好几个选项。让我们实现它。

source: Remove the ``register()`` call for the ``Choice`` model. Then, edit the ``Question`` registration code to read:
el: Αφαιρέστε την κλήση της ``register()`` με το μοντέλο ``Choice``. Έπειτα, επεξεργαστείτε τον registration κώδικα του ``Question`` για να γίνει έτσι:
it: Rimuovere la chiamata ``register()`` per il modello ``Scelta``. Quindi, modifica il codice di registrazione ``Domanda`` per leggere:
ja: ``Choice`` モデルに対する ``register()`` を削除して、 ``Question`` の登録する部分を以下のように書き換えてください。
pl: Usuń wywołanie ``register()`` dla modelu ``Choice``. Następnie zmodyfikuj kod rejestracji ``Question``, by wyglądał tak:
zh_hans: 移除调用 ``register()`` 注册 ``Choice`` 模型的代码。随后，像这样修改 ``Question`` 的注册代码：

source: This tells Django: "``Choice`` objects are edited on the ``Question`` admin page. By default, provide enough fields for 3 choices."
el: Αυτό λέει στο Django: "Όλα τα ``Choice`` objects θα επεξεργάζονται στην διαχειριστική σελίδα του μοντέλου ``Question``. Από προεπιλογή, να παρέχεις 3 choices".
it: Questo dice a Django: gli oggetti "``Choice`` sono modificati nella pagina di amministrazione del modello ``Question``. Di default, fornisce abbastanza campi per 3 scelte.
ja: この行は Django に対して、「``Choice`` オブジェクトは ``Question`` の管理ページから編集する。デフォルトでは、 3 つの ``Choice`` を表示するのに十分なフィールドを用意すること」と指示しています。
pl: Mówi to Django: „Obiekty ``Choice są edytowane na stronie admina ``Question``. Domyślnie wyświetl pól wystraczająco na 3 wybory”.
zh_hans: 这会告诉 Django：“``Choice`` 对象要在 ``Question`` 后台页面编辑。默认提供 3 个足够的选项字段。”

source: Load the "Add question" page to see how that looks:
el: Επισκεφτείτε, πάλι, τη σελίδα "Add question" για να δείτε πως φαίνεται:
it: Carica la pagina "Aggiungi domanda" per vedere come appare:
ja: 「questionを追加 (Add question)」ページを読み込んで、どのように見えるか確かめてみましょう。
pl: Załaduj stronę „Add question”, by zobaczyć jak to wygląda:
zh_hans: 加载“添加投票”页面来看看它长啥样：

source: It works like this: There are three slots for related Choices -- as specified by ``extra`` -- and each time you come back to the "Change" page for an already-created object, you get another three extra slots.
el: Δουλεύει κάπως έτσι: Υπάρχουν τρία slots για τα συσχετισμένα Choices -- όπως δηλώθηκε μέσω του attribute ``extra`` -- και κάθε φορά που επισκέπτεστε τη σελίδα ενός ήδη υπάρχοντος object, παίρνετε άλλα τρία επιπλέον slots. Όταν όμως επισκέπτεστε για πρώτη φορά τη σελίδα (δημιουργία νέου object) θα λαμβάνετε τα πρώτα τρία slots.
it: Funziona in questo modo: Ci sono tre slot per le relative Choices -- come specificato dall' ``extra`` -- e ogni volta torni alla pagina "Change" per un oggetto che è stato già creato, tu vedi altri ricevi slot.
ja: 変わった点をみてみましょう。リレーション相手である ``Choice`` を表示するために 3 つのスロットがあります (``extra`` に指定した数ですね)。また、作成済みのオブジェクトを「編集する」ページに行けば、いつでも 3 つ余分のスロットが表示されるはずです。
pl: Działa to tak: Są trzy miejsca na powiązane wybory – tak jak jest wskazane przez ``extra`` – i za każdym razem, kiedy powrócisz na stronę „Change dla już stworzonego obiektu, dostaniesz kolejne trzy dodatkowe miejsca.
zh_hans: 它看起来像这样：有三个关联的选项插槽——由 ``extra`` 定义，且每次你返回任意已创建的对象的“修改”页面时，你会见到三个新的插槽。

source: At the end of the three current slots you will find an "Add another Choice" link. If you click on it, a new slot will be added. If you want to remove the added slot, you can click on the X to the top right of the added slot. Note that you can't remove the original three slots. This image shows an added slot:
el: Στο τέλος των τριών slots θα βρείτε την επιλογή "Προσθήκη καινούργιου Choice". Αν κλικάρετε πάνω σε αυτό, ένα νέο slot θα δημιουργηθεί. Αν θέλετε να το αφαιρέσετε κλικάρετε πάνω στο X που βρίσκεται πάνω δεξιά στο slot. Υπόψιν ότι δεν μπορείτε να αφαιρέσετε τα αρχικά τρία slots. Η παρακάτω εικόνα δείχνει ένα πρόσθετο slot (κάτω-κάτω):
ja: 現状ある3つのスロットの末尾に、「他の Choice を追加する (Add another Choice)」リンクがあります。クリックすると、新しいプロットが追加されます。追加されたスロットを削除したい場合は、追加されたスロット右上の 'X' をクリックしてください。最初からある 3 つのスロットを削除できないことに注意してください。この画像は追加されたスロットのみで有効です。
pl: Na końcu trzech bieżących miejsc znajdziesz link „Add another Choice”. Jeśli w niego klikniesz, zostanie dodane nowe miejsce. Jeśli chcesz usunąć dodane miejsce, możesz kliknąć X w prawym górnym rogu dodanego miejsca. Zwróć uwagę, że nie możesz usunąć oryginalnych trzech miejsc. Ta grafika pokazuje dodane miejsce:
zh_hans: 在三个插槽的末端，你会看到一个“添加新选项”的按钮。如果你单击它，一个新的插槽会被添加。如果你想移除已有的插槽，可以点击插槽右上角的X。注意，你不能移除原始的 3 个插槽。以下图片展示了一个已添加的插槽：

source: One small problem, though. It takes a lot of screen space to display all the fields for entering related ``Choice`` objects. For that reason, Django offers a tabular way of displaying inline related objects; you just need to change the ``ChoiceInline`` declaration to read:
el: Υπάρχει όμως ένα μικρό πρόβλημα. Καταλαμβάνει πολύ χώρο στην οθόνη η εμφάνιση των slots. Για αυτό το λόγο το Django προσφέρει έναν πιο περιεκτικό τρόπο εμφάνισης (tabular) για την εμφάνιση των inline συσχετισμένων objects. Το μόνο που έχετε να κάνετε είναι αλλάξετε τον ορισμό του ``ChoiceInline`` σε:
ja: さて、このコードにはちょっと問題があります。というのも、 ``Choice`` オブジェク トを入力するためのフィールドを全部表示しようとすると、相当な広さのスクリーンが必要だからです。そこで、 Django にはテーブルを使ってインラインでリレーション相手のオブジェクトを表示するもう一つの方法があります。以下のように、 ``ChoiceInline`` の宣言を変更してください。
pl: Jest jednak jeden mały problem. Wyświetlenie wszystkich pól do wypełnienia powiązanych obiektów ``Choice`` zajmuje ogromną ilość miejsca na ekranie. Z tego powodu Django oferuje sposób tabelaryczny na wyświetlenie inline powiązanych obiektów; potrzebujesz tylko zmienić deklarację ``ChoiceInline``, aby brzmiała:
zh_hans: 不过，仍然有点小问题。它占据了大量的屏幕区域来显示所有关联的 ``Choice`` 对象的字段。对于这个问题，Django 提供了一种表格式的单行显示关联对象的方法。你只需按如下形式修改 ``ChoiceInline`` 申明：

source: With that ``TabularInline`` (instead of ``StackedInline``), the related objects are displayed in a more compact, table-based format:
el: Με αυτό, ``TabularInline`` (αντί του ``StackedInline``), τα συσχετισμένα objects εμφανίζονται πιο συμπυκνωμένα, σαν να βρίσκονται μέσα σε ένα πίνακα:
it: Con questa ``TabularInline`` (invece di ``StackedInline``), gli oggetti relativi vengono mostrati in un modo più compatto, in un formato tabellare:
ja: ``StackedInline`` に変わって ``TabularInline`` を使うと、 リレーション相手のオブジェクトはよりコンパクトなテーブル形式で表示されます:
pl: Z ``TabularInline`` (zamiast ``StackedInline``), powiązane obiekty są wyświetlane w bardziej zwartym, opartym na tabelce formacie:
zh_hans: 通过 ``TabularInline``（替代 ``StackedInline`` ），关联对象以一种表格式的方式展示，显得更加紧凑：

source: Note that there is an extra "Delete?" column that allows removing rows added using the "Add Another Choice" button and rows that have already been saved.
el: Σε αυτή τη μορφή υπάρχει και μια επιπλέον στήλη ("Θέλετε να πραγματοποιηθεί διαγραφή?") η οποία σας επιτρέπει να διαγράψετε γραμμές που προστέθηκαν με την επιλογή "Προσθήκη καινούργιου Choice". Σημειώστε ότι πάντα θα έχετε το ελάχιστο τρεις επιλογές (ρύθμιση ``extra`` μέσα στο ``ChoiceInline``).
it: Nota che c'è un ulteriore colonna "Elimina?" che permette di rimuovere le righe aggiunte usando il bottone "Aggiungi un'altra Choice" e le righe che sono state già salvate.
ja: 追加の "Delete?" カラムがあることに注意してください。 "Added Another Choice" ボタンで追加された行とすでに保存された行を削除するためにあります。
pl: Zwróć uwagę, że jest tam dodatkowa kolumna „Delete?”, która pozwala na usuwanie wierszy dodanych przy użyciu przycisku „Add Another Choice” oraz wierszy, które zostały wcześniej zapisane.
zh_hans: 注意这里有一个额外的“删除？”列，这允许移除通过“添加新选项”按钮添加的，或是已被保存的行。

source: Customize the admin change list
el: Παραμετροποιώντας την admin change list
it: Personalizzazione della lista per la modifica dell'interfaccia di amministrazione
ja: 管理サイトのチェンジリストページをカスタマイズする
pl: Dostosuj widok listy panelu administracyjnego
zh_hans: 自定义后台更改列表

source: Now that the Question admin page is looking good, let's make some tweaks to the "change list" page -- the one that displays all the questions in the system.
el: Τώρα που η διαχειριστική σελίδα του μοντέλου Question δείχνει όμορφη, ας κάνουμε μερικές αλλαγές στην σελίδα "change list" -- αυτή που εμφανίζει όλες τις ερωτήσεις μέσα στο σύστημα (σαν μια λίστα).
it: Ora che la pagina di amministrazione del modello Question sembra buona, facciamo qualche modifica alla pagina di "change list" -- quella che mostra tutte le domande nel sistema.
ja: さあ、これで Question の管理ページはだいぶよくなってきました。今度は「チェンジリスト」ページをすこしいじりましょう。チェンジリスト (change list) は、システム上の全ての Question を表示するページです。
pl: Teraz, kiedy strona admina dla pytania wygląda dobrze, poprawmy nieco stronę „change list” – tę, która wyświetla wszystkie pytania w systemie.
zh_hans: 现在投票的后台页看起来很不错，让我们对“更改列表”页面进行一些调整——改成一个能展示系统中所有投票的页面。

source: Here's what it looks like at this point:
el: Δείτε πως φαίνεται σε αυτό το σημείο:
it: Ecco come appare a questo punto:
ja: ここでは以下のようになります。
pl: Tak ona wygląda w tym momencie:
zh_hans: 以下是它此时的外观：

source: By default, Django displays the ``str()`` of each object. But sometimes it'd be more helpful if we could display individual fields. To do that, use the :attr:`~django.contrib.admin.ModelAdmin.list_display` admin option, which is a tuple of field names to display, as columns, on the change list page for the object:
el: Από προεπιλογή, το Django εμφανίζει τη μέθοδο ``str()`` για κάθε object. Αλλά μερικές φορές θα ήταν πιο βολικό να εμφανίζουμε μεμονομένα πεδία. Για να το κάνουμε αυτό θα χρησιμοποιήσουμε την επιλογή-ρύθμιση :attr:`~django.contrib.admin.ModelAdmin.list_display`, η οποία είναι ένα tuple από ονόματα πεδίων (του μοντέλου σας), τα οποία θα εμφανιστούν ως στήλες σε αυτή τη σελίδα:
it: Di default, Django mostra la ``str()`` di ogni oggetto. Qualche volta però può essere più utile se potessimo mostrare campi individuali. Per fare questo, usa l'opzione di amministrazione :attr:`~django.contrib.admin.ModelAdmin.list_display`, che è una tupla di nomi di campi da mostrare, come colonne, sulla pagina della lista dei cambiamenti per l'oggetto:
ja: デフォルトでは、 Django はオブジェクトの ``str()`` を表示しますが、各フィールドの値も表示されていると便利でしょう。表示させるには :attr:`~django.contrib.admin.ModelAdmin.list_display` オプションを使います。このオプションには、カラム表示したいフィールドの名前をタプルにして指定します。
pl: Domyślnie Django wyświetla ``str()`` każdego obiektu. Ale czasem bardziej pomocne byłoby wyświetlanie poszczególnych pól. Aby to zrobić, użyj :attr:`~django.contrib.admin.ModelAdmin.list_display`
zh_hans: 默认情况下，Django 显示每个对象的 ``str()`` 返回的值。但有时如果我们能够显示单个字段，它会更有帮助。为此，使用 :attr:`~django.contrib.admin.ModelAdmin.list_display` 后台选项，它是一个包含要显示的字段名的元组，在更改列表页中以列的形式展示这个对象：
