Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: A shortcut: :func:`~django.shortcuts.get_object_or_404`
el: Η συντόμευση: :func:`~django.shortcuts.get_object_or_404`
it: Una scorciatoia: :func:`~django.shortcuts.get_object_or_404`
ja: ショートカット: :func:`~django.shortcuts.get_object_or_404`
pl: Skrót: :func:`~django.shortcuts.get_object_or_404`
zh_hans: 一个快捷函数： :func:`~django.shortcuts.get_object_or_404`

source: It's a very common idiom to use :meth:`~django.db.models.query.QuerySet.get` and raise :exc:`~django.http.Http404` if the object doesn't exist. Django provides a shortcut. Here's the ``detail()`` view, rewritten:
el: Είναι συνηθισμένο να χρησιμοποιείται η μέθοδος :meth:`~django.db.models.query.QuerySet.get` η οποία να κάνει raise το exception :exc:`~django.http.Http404` αν το object δεν υπάρχει. Το Django σας παρέχει μια συντόμευση και γι’ αυτό. Παρακάτω φαίνεται το ``detail()`` view, γραμμένο από την αρχή (πάλι):
it: E' un idioma molto comune usare :meth:`~django.db.models.query.QuerySet.get` e sollevare :exc:`~django.http.Http404` se l'oggetto non esiste. Django offre una scorciatoia. Ecco la view ``detail()``, riscritta:
ja: :meth:`~django.db.models.query.QuerySet.get` を実行し、オブジェクトが存在しない場合には :exc:`~django.http.Http404` を送出することは非常によく使われるイディオムです。 Django はこのためのショートカットを提供しています。ショートカットを使って、 ``detail()`` ビューを書き換えてみましょう:
pl: To popularny idiom do używania :meth:`~django.db.models.query.QuerySet.get` i zgłaszania :exc:`~django.http.Http404` jeśli obiekt nie istnieje. Django daje skrót. Tutaj jest widok ``detail()`` przepisany:
zh_hans: 尝试用 :meth:`~django.db.models.query.QuerySet.get` 函数获取一个对象，如果不存在就抛出 :exc:`~django.http.Http404` 错误也是一个普遍的流程。Django 也提供了一个快捷函数，下面是修改后的详情 ``detail()`` 视图代码：

source: The :func:`~django.shortcuts.get_object_or_404` function takes a Django model as its first argument and an arbitrary number of keyword arguments, which it passes to the :meth:`~django.db.models.query.QuerySet.get` function of the model's manager. It raises :exc:`~django.http.Http404` if the object doesn't exist.
el: Η συνάρτηση :func:`~django.shortcuts.get_object_or_404` παίρνει ως πρώτο όρισμα ένα Django model και ένα αυθαίρετο αριθμό από arguments, τα οποία τα δίνει στην μέθοδο :meth:`~django.db.models.query.QuerySet.get` του manager του μοντέλου (model manager) που περάστηκε ως πρώτο όρισμα. Η συνάρτηση αυτή κάνει raise το exception :exc:`~django.http.Http404` αν το object δεν υπάρχει.
it: La funzione :func:`~django.shortcuts.get_object_or_404` prende un modello Django come primo argomento e un numero arbitrario di argomenti keyword, che passa alla funzione :meth:`~django.db.models.query.QuerySet.get` del manager del modello. Solleva :exc:`~django.http.Http404` se l'oggetto non esiste.
ja: :func:`~django.shortcuts.get_object_or_404` 関数は、第一引数に Django のモデル、任意の個数のキーワード引数をとります。キーワード引数はそのまま、モデルのマネージャの :meth:`~django.db.models.query.QuerySet.get` に渡します。オブジェクトが存在しなければ、 :exc:`~django.http.Http404` を送出します。
pl: Funkcja :func:`~django.shortcuts.get_object_or_404` bierze model Django jako swój pierwszy argument i wyznaczoną wcześniej liczbę arguementów nazwanych, które przekazuje do funkcji :meth:`~django.db.models.query.QuerySet.get` menadżera modelu. Zgłasza :exc:`~django.http.Http404` jeśli obiekt nie istnieje.
zh_hans: :func:`~django.shortcuts.get_object_or_404` 函数的第一个参数是一个 Django 模型。在此之后可以有任意数量的关键字参数，他们会被直接传递给模型的 :meth:`~django.db.models.query.QuerySet.get` 函数。如果符合要求的对象不存在，此快捷函数将会抛出一个 :exc:`~django.http.Http404` 异常。

source: Why do we use a helper function :func:`~django.shortcuts.get_object_or_404` instead of automatically catching the :exc:`~django.core.exceptions.ObjectDoesNotExist` exceptions at a higher level, or having the model API raise :exc:`~django.http.Http404` instead of :exc:`~django.core.exceptions.ObjectDoesNotExist`?
el: Γιατί όμως χρησιμοποιούμε την βοηθητική συνάρτηση (helper function) :func:`~django.shortcuts.get_object_or_404` αντί να κάνουμε αυτόματα το catch του exception :exc:`~django.core.exceptions.ObjectDoesNotExist` σε ένα υψηλότερο επίπεδο; Επίσης, γιατί να βάλουμε το model API να κάνει raise το exception :exc:`~django.http.Http404` αντί του exception :exc:`~django.core.exceptions.ObjectDoesNotExist`;
it: Perchè usiamo una funzione helper :func:`~django.shortcuts.get_object_or_404` invece di catturare automaticamente l'eccezione :exc:`~django.core.exceptions.ObjectDoesNotExist` ad un livello più alto o di avere l'API del modello che solleva :exc:`~django.http.Http404` invece di :exc:`~django.core.exceptions.ObjectDoesNotExist`?
ja: なぜ :exc:`~django.core.exceptions.ObjectDoesNotExist` 例外を高水準で自動的にキャッチせず、ヘルパー関数 :func:`~django.shortcuts.get_object_or_404` を使うのでしょうか、また、なぜモデル API に :exc:`~django.core.exceptions.ObjectDoesNotExist` ではなく、 :exc:`~django.http.Http404` を送出させるのでしょうか?
pl: Dlaczego używamy funkcji pomocniczej :func:`~django.shortcuts.get_object_or_404` zamiast automatycznie wyłapywać wyjątki :exc:`~django.core.exceptions.ObjectDoesNotExist` na wyższym poziomie lub powodując, że API modelu będzie zgłaszać :exc:`~django.http.Http404` zamiast :exc:`~django.core.exceptions.ObjectDoesNotExist`?
zh_hans: 为什么我们使用辅助函数 :func:`~django.shortcuts.get_object_or_404` 而不是自己捕获 :exc:`~django.core.exceptions.ObjectDoesNotExist` 异常呢？还有，为什么模型 API 不直接抛出 :exc:`~django.core.exceptions.ObjectDoesNotExist` 而是抛出 :exc:`~django.http.Http404` 呢？

source: Because that would couple the model layer to the view layer. One of the foremost design goals of Django is to maintain loose coupling. Some controlled coupling is introduced in the :mod:`django.shortcuts` module.
el: Η απάντηση είναι ίδια και στις δύο ερωτήσεις. Επειδή αυτό θα δεσμεύσει το επίπεδο του model με το επίπεδο του view. Ένας από τους πρωταρχικούς στόχους του Django είναι να διατηρηθεί η ανεξαρτητοποίηση και η μη σύνδεση μεταξύ οντοτήτων (το λεγόμενο loose coupling). Μερικά ελεγχόμενα couplings παρουσιάζονται στο module :mod:`django.shortcuts`.
it: Perchè quello accoppierebbe il layer del modello alla layer della view. Uno dei primi obiettivi di design di Django è di mantenere un accoppiamento blando. Un po' di accoppiamento controllato è introdotto nel modulo :mod:`django.shortcuts` .
ja: 答えは、モデルレイヤとビューレイヤをカップリングしてしまうからです。 Django の最も大きな目標の一つは、ルーズカップリングの維持にあります。いくつかの制御カップリングは、 :mod:`django.shortcuts` モジュールの中にあります。
pl: Ponieważ to związałoby warstwę modelu z warstwą widoku. Jednym z najważniejszych celów projektowych Django było utrzymywania luźnych więzów. Trochę kontrolowanego wiązania jest wprowadzone w module :mod:`django.shortcuts`.
zh_hans: 因为这样做会增加模型层和视图层的耦合性。指导 Django 设计的最重要的思想之一就是要保证松散耦合。一些受控的耦合将会被包含在 :mod:`django.shortcuts` 模块中。

source: There's also a :func:`~django.shortcuts.get_list_or_404` function, which works just as :func:`~django.shortcuts.get_object_or_404` -- except using :meth:`~django.db.models.query.QuerySet.filter` instead of :meth:`~django.db.models.query.QuerySet.get`. It raises :exc:`~django.http.Http404` if the list is empty.
el: Υπάρχει επίσης η συνάρτηση :func:`~django.shortcuts.get_list_or_404`, η οποία λειτουργεί πανομοιότυπα με την :func:`~django.shortcuts.get_object_or_404` -- με τη μόνη διαφορά ότι χρησιμοποιεί την μέθοδο :meth:`~django.db.models.query.QuerySet.filter` αντί της :meth:`~django.db.models.query.QuerySet.get`. Η :func:`~django.shortcuts.get_list_or_404` κάνει raise την exception :exc:`~django.http.Http404` αν η λίστα είναι κενή (άδεια).
it: Esiste anche un funzione :func:`~django.shortcuts.get_list_or_404` , che funziona esattamente come :func:`~django.shortcuts.get_object_or_404` -- ad eccezione di usare :meth:`~django.db.models.query.QuerySet.filter` invece di :meth:`~django.db.models.query.QuerySet.get`. Solleva :exc:`~django.http.Http404` se la lista è vuota.
ja: :func:`~django.shortcuts.get_list_or_404` という関数もあります。この関数は :func:`~django.shortcuts.get_object_or_404` と同じように動きますが、 :meth:`~django.db.models.query.QuerySet.get` ではなく、 :meth:`~django.db.models.query.QuerySet.filter` を使います。リストが空の場合は :exc:`~django.http.Http404` を送出します。
pl: Jest też funkcja :func:`~django.shortcuts.get_list_or_404`, która działa tak samo jak :func:`~django.shortcuts.get_object_or_404` – z wyjątkiem używania :meth:`~django.db.models.query.QuerySet.filter` zamiast :meth:`~django.db.models.query.QuerySet.get`. Zgłasza wyjątek :exc:`~django.http.Http404` gdy lista jest pusta.
zh_hans: 也有 :func:`~django.shortcuts.get_list_or_404` 函数，工作原理和 :func:`~django.shortcuts.get_object_or_404` 一样，除了 :meth:`~django.db.models.query.QuerySet.get` 函数被换成了 :meth:`~django.db.models.query.QuerySet.filter` 函数。如果列表为空的话会抛出 :exc:`~django.http.Http404` 异常。

source: Use the template system
el: Χρησιμοποιώντας ένα template system
it: Utilizzare il sistema di template
ja: テンプレートシステムを使う
pl: Użyj systemu szablonów
zh_hans: 使用模板系统

source: Back to the ``detail()`` view for our poll application. Given the context variable ``question``, here's what the ``polls/detail.html`` template might look like:
el: Πίσω στο ``detail()`` view της εφαρμογής μας. Έχοντας το context variable με το όνομα ``question``, το template ``polls/detail.html`` θα δείχνει κάπως έτσι:
it: Torniamo alla view ``detail()`` della nostra applicazione dei sondaggi. Data la variabile di contesto `question``, ecco come potrebbe apparire il template ``polls/detail.html``:
ja: 投票アプリの ``detail()`` ビューに戻りましょう。コンテキスト変数 ``question`` とすると、 ``polls/detail.html`` テンプレートは次のようなります:
pl: Wracamy do widoku ``detail()`` naszej aplikacji ankietowej. Mając zmienną kontekstową ``question``, tak mógłby wyglądać nasz szablon ``polls/detail.html``:
zh_hans: 回过头去看看我们的 ``detail()`` 视图。它向模板传递了上下文变量 ``question`` 。下面是 ``polls/detail.html`` 模板里正式的代码：

source: The template system uses dot-lookup syntax to access variable attributes. In the example of ``{{ question.question_text }}``, first Django does a dictionary lookup on the object ``question``. Failing that, it tries an attribute lookup -- which works, in this case. If attribute lookup had failed, it would've tried a list-index lookup.
el: Το template system χρησιμοποιεί την σύνταξη της τελείας για να ψάχνει μέσα στα variable attributes. Στο παράδειγμα του ``{{ question.question_text }}``, το Django θα ψάξει πρώτα μέσα στο dictionary του object ``question``. Αν δεν βρει τίποτα (δεν υπάρχει, δηλαδή, το key ``question_text``στο υποτιθέμενο dictionary), προσπαθεί να βρει το ``question_text`` σαν attribute του object – το οποίο στη συγκεκριμένη περίπτωση ισχύει. Αν όμως δεν υπήρχε, τότε θα έψαχνε σε μια λίστα να το βρει.
it: Il sistema di template usa una sintassi "a ricerca con il punto" per accedere alle variabili attributo. Nell'esempio di ``{{ question.question_text }}``, prima Django effettua una ricerca a dizionario sull'oggetto ``question``. Fallendo quella, prova una ricerca dell'attributo -- che funziona, in questo caso. Se la ricerca dell'attributo avesse fallito, avrebbe provato con una ricerca sugli indici della lista.
ja: テンプレートシステムは、変数の属性にアクセスするためにドット使った表記法を使用します。 ``{{ question.question_text }}`` を例にすると、はじめに Django は `` question`` オブジェクトを辞書検索を行います。これには失敗するので、今度は属性として検索を行い、この場合は成功します。仮に、属性の検索に失敗すると、リストインデックスでの検索を行います。
pl: System szablonów używa składni kropkowego lookupu, aby dostać się do atrybutów zmiennej. W przykładzie ``{{ question.question_text }}``, najpierw Django robi słownikowy lookup na obiekcie ``question``. Gdy to się nie uda, próbuje atrybutowego lookupu – który w tym przypadku działa. Gdyby atrybutowy lookup się nie powiódł, spróbowałoby lookupu przez indeks listy.
zh_hans: 模板系统统一使用点符号来访问变量的属性。在示例 ``{{ question.question_text }}`` 中，首先 Django 尝试对 ``question`` 对象使用字典查找（也就是使用 obj.get(str) 操作），如果失败了就尝试属性查找（也就是 obj.str 操作），结果是成功了。如果这一操作也失败的话，将会尝试列表查找（也就是 obj[int] 操作）。

source: Method-calling happens in the :ttag:`{% for %}<for>` loop: ``question.choice_set.all`` is interpreted as the Python code ``question.choice_set.all()``, which returns an iterable of ``Choice`` objects and is suitable for use in the :ttag:`{% for %}<for>` tag.
el: Ο τρόπος για να καλείτε μεθόδους φαίνεται στο βρόγχο επανάληψης :ttag:`{% for %}<for>`: το ``question.choice_set.all`` μεταφράζεται ως Python κώδικας ``question.choice_set.all()``, το οποίο επιστρέφει ένα iterable από ``Choice`` objects και είναι βολικό προς χρήση (στην παρούσα) με τον βρόγχο επανάληψης :ttag:`{% for %}<for>` (το οποίο αναφέρεται και ως ``template tag``).
it: La chiamata a metodo avviene nel :ttag:`{% for %}<for>` loop: ``question.choice_set.all`` viene interpretato come il codice Python ``question.choice_set.all()``, che restituisce un iterable di oggetti ``Choice`` ed è adatto ad essere usato nel tag :ttag:`{% for %}<for>`.
ja: メソッドの呼び出しは :ttag:`{% for %}<for>` ループの中で行われています。 ``question.choice_set.all`` は、 Python コードの ``question.choice_set.all()`` と解釈されます。その結果、``Choice`` オブジェクトからなるイテレーション可能オブジェ クトを返し、 :ttag:`{% for %}<for>` タグで使えるようになります。
pl: Wywoływanie metod dzieje się w pętli :ttag:`{% for %}<for>`: ``question.choice_set.all`` jest interpretowane jako kod Pythona ``question.choice_set.all()``, który zwraca iterator obiektów ``Choice`` i jest odpowiedni do użycia w tagu :ttag:`{% for %}<for>`.
zh_hans: 在 :ttag:`{% for %}<for>` 循环中发生的函数调用：``question.choice_set.all`` 被解释为 Python 代码 ``question.choice_set.all()`` ，将会返回一个可迭代的 ``Choice`` 对象，这一对象可以在 :ttag:`{% for %}<for>` 标签内部使用。

source: See the :doc:`template guide </topics/templates>` for more about templates.
el: Δείτε το άρθρο :doc:`templates </topics/templates>` για περισσότερα σχετικά με τα templates.
it: Vedi la :doc:`template guide </topics/templates>` per maggiori informazioni sui templates.
ja: テンプレートの詳しい動作は :doc:`テンプレートガイド </topics/templates>` を参照してください。
pl: Zobacz :doc:`przewodnik po szablonach </topics/templates>` po więcej informacji na temat szablonów.
zh_hans: 查看 :doc:`模板指南 </topics/templates>` 可以了解关于模板的更多信息。

source: Removing hardcoded URLs in templates
el: Αφαίρεση των hardcoded URLs στα templates
it: Rimuovere le URL codificate nei template
ja: テンプレート内のハードコードされたURLを削除
pl: Usuwanie wstawionych na szytwno URL-i z szablonów
zh_hans: 去除模板中的硬编码 URL

source: Remember, when we wrote the link to a question in the ``polls/index.html`` template, the link was partially hardcoded like this:
el: Θυμηθείτε ότι πριν, δηλώσαμε στην HTML το link για την ερώτηση στο template ``polls/index.html`` ως:
it: Ricorda, quando abbiamo scritto il link ad una domanda nel template ``polls/index.html``, il link era parzialmente hardcodato come:
ja: ``polls/index.html`` テンプレートで質問へのリンクを書いたとき、リンクの一部は次のようにハードコードされていました:
pl: Pamiętasz, kiedy wpisaliśmy link do pytania w szablonie ``polls/index.html``, link był częściowo wpisany na sztywno, w ten sposób:
zh_hans: 还记得吗，我们在 ``polls/index.html`` 里编写投票链接时，链接是硬编码的：

source: The problem with this hardcoded, tightly-coupled approach is that it becomes challenging to change URLs on projects with a lot of templates. However, since you defined the name argument in the :func:`~django.conf.urls.url` functions in the ``polls.urls`` module, you can remove a reliance on specific URL paths defined in your url configurations by using the ``{% url %}`` template tag:
ja: このハードコードされた、密結合のアプローチの問題は、多くのテンプレートでプロジェクトのURLを変更することを困難にします。しかし、 ``polls.urls`` モジュールの :func:`~django.conf.urls.url` 関数の name 引数を定義したときから、テンプレートタグの ``{% url %}`` を用いて URL の構成で定義された特定の URL パスへの依存を削除することができます:
pl: Problem z tym podejściem z hardkodowaniem jest taki, że staje się niezwykle trudna zmiana URL-i w projektach z dużą liczbą szablonów. Jednakże, odkąd zdefiniowałeś nazwany argument w funkcjach :func:`~django.conf.urls.url` w module ``polls.urls``, możesz usunąć poleganie na poszczególnych ścieżkach URL zdefiniowanych w twoich konfiguracjach URL-i używając szablonowego taga ``{% url %}``:

source: The way this works is by looking up the URL definition as specified in the ``polls.urls`` module. You can see exactly where the URL name of 'detail' is defined below::
el: Ο τρόπος με τον οποίο λειτουργεί αυτό το template tag είναι κοιτώντας τα URLs που έχετε ορίσει στο module ``polls.urls``. Μπορείτε να δείτε ακριβώς σε ποιο URL έχει οριστεί το όνομα 'detail' παρακάτω::
it: Il modo in cui funziona è ricercando la definizione della URL così come è definita nel modulo ``polls.urls``. Puoi vedere esattamente dove il nome della URL di 'detail' è definita qui sotto::
ja: これが機能する方法は、 ``polls.urls`` モジュールに指定されたURLの定義を調べることです。'detail' のURL名は次に定義されている場所を正確に見ることができます::
pl: Działa to przez sprawdzenie definicji URL-a według specyfikacji w module ``polls.urls``. Możesz zobaczyć poniżej, gdzie dokładnie nazwa 'detail' jest zdefiniowana w URL-u::
zh_hans: 这个标签的工作方式是在 ``polls.urls`` 模块的 URL 定义中寻具有指定名字的条目。你可以回忆一下，具有名字 'detail' 的 URL 是在如下语句中定义的：

source: If you want to change the URL of the polls detail view to something else, perhaps to something like ``polls/specifics/12/`` instead of doing it in the template (or templates) you would change it in ``polls/urls.py``::
el: Αν θέλετε να αλλάξετε το URL αυτού του view σε κάτι άλλο (ίσως στο ``polls/specifics/12/``), τότε αντί να ψάχνετε όλα τα templates που είχατε δηλώσει το παλιό URL προκειμένου να το αντικαταστήσετε με το καινούργιο, πολύ απλά πειράζετε ένα αρχείο (``polls/urls.py``) και όλα τα υπόλοιπα ανανεώνονται αυτόματα, χάρη στο template tag ``{% url %}``::
it: Se vuoi cambiare la URL della vista di dettaglio del sondaggio a qualcos'altro, magari a qualcosa come ``polls/specifics/12/`` invece di farlo nel template (o nei template) lo cambieresti in ``polls/urls.py``::
ja: 投票の詳細ビューの URL を何か他のものに変更する場合、 ``polls/specifics/12/`` のようにするとき、特定のテンプレート(または、複数のテンプレート)を変更する代わりに、 ``polls/urls.py`` を変更するでしょう::
pl: Jeśli chcesz zmienić URL widoku szczegółów ankiety na jakiś inny, na przykład na coś w stylu ``polls/specifics/12/``, zamiast robić to w szablonie (lub szablonach), zmieniłbyś to w ``polls/urls.py``::
zh_hans: 如果你想改变投票详情视图的 URL，比如想改成 ``polls/specifics/12/`` ，你不用在模板里修改任何东西（包括其它模板），只要在 ``polls/urls.py`` 里稍微修改一下就行：

source: Namespacing URL names
el: Χρησιμοποιώντας namespacing στα ονόματα των URL
it: Assegnazione dello spazio dei nomi alle URL
ja: URL 名の名前空間
pl: Przestrzenie nazw dla nazw URL-i
zh_hans: 为 URL 名称添加命名空间

source: The tutorial project has just one app, ``polls``. In real Django projects, there might be five, ten, twenty apps or more. How does Django differentiate the URL names between them? For example, the ``polls`` app has a ``detail`` view, and so might an app on the same project that is for a blog. How does one make it so that Django knows which app view to create for a url when using the ``{% url %}`` template tag?
el: Το project του οδηγού αυτού έχει μόνο μια εφαρμογή, την ``polls``. Σε πραγματικά Django projects, ίσως να έχετε πέντε, δέκα, είκοσι ή περισσότερα apps. Πως μπορεί να ξέρει και να διαφοροποιεί το Django τα ονόματα των URLs ανάμεσα σε τόσα apps; Για παράδειγμα, η εφαρμογή ``polls`` έχει ένα ``detail`` view και ίσως ένα άλλο app (στο ίδιο project) να έχει το ίδιο όνομα για ένα δικό του view. Όταν το Django συναντήσει το template tag ``{% url 'detail' %}`` πως θα ξέρει σε ποιο view να αναφερθεί;
it: Il progetto del tutorial ha solo una app, ``polls``. Nei veri progetti Django, ci possono essere cinque, dieci, venti app o anche più. Come fa Django a differenziare i nomi delle URL tra di esse? Per esempio, l'app ``polls`` ha una view ``detail``, e così potrebbe averla una app sullo stesso progetto che serve per un blog. Come si a fare in modo che Django sappia quale view di quale app creare da un url quando si usa il tag di template ``{% url %}``?
ja: チュートリアルプロジェクトは「polls」というただ一つのアプリを含みます。本物のDjangoプロジェクトでは、これらは5, 10 , 20かより多くのアプリになるでしょう。Djangoはどうやってこれらの間のURL 名を区別するのでしょうか?例えば、「polls」アプリは詳細ビューを含みます、同じプロジェクトにブログのためのアプリがあるかもしれません。どうすれば、Djangoは``{% url %}``テンプレートタグを使ってurlに対してどのアプリのビューを作成すればいいと知ることができるのでしょう？
pl: Projekt tutorialowy ma tylko jedną aplikację, ``polls``. W prawdziwych projektach Django może być pięć, dziesięć, dwadzieścia lub więcej aplikacji. Jak Django odróżnia nazwy URL pomiędzy nimi? Na przykład aplikacja ``polls`` ma widok ``detail`` i tak samo mogłaby mieć aplikacja blogowa w tym samym projekcie. Jak zrobić, aby Django wiedziało, której aplikacji widok stworzyć dla urla w przypadku użycia taga ``{% url %}``?
zh_hans: 教程项目只有一个应用，``polls`` 。在一个真实的 Django 项目中，可能会有五个，十个，二十个，甚至更多应用。Django 如何分辨重名的 URL 呢？举个例子，``polls`` 应用有 ``detail`` 视图，可能另一个博客应用也有同名的视图。Django 如何知道 ``{% url %}`` 标签到底对应哪一个应用的 URL 呢？

source: The answer is to add namespaces to your URLconf. In the ``polls/urls.py`` file, go ahead and add an ``app_name`` to set the application namespace:
el: Η απάντηση έρχεται με την προσθήκη namespaces στο URLconf. Στο αρχείο ``polls/urls.py``, προσθέστε μια μεταβλητή ``app_name`` ούτως ώστε να θέσετε το namespace για αυτό το app:
it: La risposta è di aggiungere namespaces al tuo URLconf. Nel file ``polls/urls.py``, procedi ed inserisci un ``app_name`` per impostare il namespace della applicazione.
ja: URLconfに名前空間を追加すること、が答えです。``polls/urls.py``ファイル内の、アプリケーションの名前空間を設定するため``app_name``の箇所に向かい追加します。
pl: Odpowiedzią jest dodanie przestrzeni nazw do twojego URLconfa. W pliku ``polls/urls.py`` dodaj ``app_name``, aby ustawić przestrzeń nazw aplikacji:
zh_hans: 答案是：在根 URLconf 中添加命名空间。在 ``polls/urls.py`` 文件中稍作修改，加上 ``app_name`` 设置命名空间：

source: Now change your ``polls/index.html`` template from:
el: Τώρα, πηγαίνετε και αλλάξτε το αρχείο ``polls/index.html``από:
it: Adesso cambia il tuo template ``polls/index.html`` da:
ja: それでは ``polls/index.html`` テンプレートを変更します:
pl: Teraz zmień swój szablon ``polls/index.html`` z:
zh_hans: 现在，编辑 ``polls/index.html`` 文件，从：

source: to point at the namespaced detail view:
el: στο:
it: per puntare al namespace detail della vista:
ja: 詳細ビューの名前空間を指します:
pl: aby wskazywał na widok szczegółów w przestrzeni nazw:
zh_hans: 修改为指向具有命名空间的详细视图：

source: When you're comfortable with writing views, read :doc:`part 4 of this tutorial </intro/tutorial04>` to learn about simple form processing and generic views.
el: Όταν αισθανθείτε άνετα με τη συγγραφή των views, διαβάστε το :doc:`τέταρτο μέρος αυτού του οδηγού </intro/tutorial04>` για να μάθετε το πώς να διαχειρίζεστε απλές φόρμες και τα Django generic views.
ja: ビューを書けるようになったら、 :doc:`チュートリアルその4 </intro/tutorial04>` に進んで、簡単なフォームの処理と汎用ビューについて学びましょう。
pl: Jeśli czujesz się dobrze z pisaniem widoków, przeczytaj :doc:`część czwartą tego tutoriala </intro/tutorial04>`, aby dowiedzieć się na temat przetwarzania prostych formularzy i widokach generycznych.
zh_hans: 当你对你写的视图感到满意后，请阅读 :doc:`教程的第 4 部分 </intro/tutorial04>` 了解简单的表单处理和通用视图。

source: Writing your first Django app, part 4
el: Γράφοντας το πρώτο σας Django app, μέρος 4
it: Scrivere la tua prima applicazione in Django, parte 4
ja: はじめての Django アプリ作成、その 4
pl: Pisanie pierwszej aplikacji Django, część 4.
zh_hans: 编写你的第一个 Django 应用，第 4 部分

source: This tutorial begins where :doc:`Tutorial 3 </intro/tutorial03>` left off. We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
el: Ο οδηγός αυτός ξεκινά εκεί που τελειώνει :doc:`ο οδηγός 3 </intro/tutorial03>`. Συνεχίζουμε να χτίζουμε την εφαρμογή μας (ψηφοφορία) και σε αυτό τον οδηγό θα ασχοληθούμε με την επεξεργασία των φορμών (form) και με την βελτιστοποίηση των views.
ja: このチュートリアルは :doc:`チュートリアルその 3 </intro/tutorial03>` の続きです。ここでは、引続き Web 投票アプリケーションの開発を例にして、簡単なフォー ム処理とコードの縮小化を中心に解説します。
pl: Ten tutorial zaczyna się, gdzie skończył się `Tutorial 3 </intro/tutorial03>`. Kontynuujemy prace nad aplikacją web-ankiet i skupimy się na przetwarzaniu prostego formularza i przycinaniu naszego kodu.
zh_hans: 这一篇从 :doc:`教程第 3 部分 </intro/tutorial03>` 结尾的地方继续讲起。我们将继续编写投票应用，专注于简单的表单处理并且精简我们的代码。

source: Write a simple form
el: Γράφοντα μια απλή φόρμα
ja: 簡単なフォームを書く
pl: Napisz prosty formularz
zh_hans: 编写一个简单的表单
