Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes. This tells Django what type of data each field holds.
el: Κάθε πεδίο αναπαρίσταται από ένα instance της :class:`~django.db.models.Field` class – π.χ, η κλάση :class:`~django.db.models.CharField` δηλώνει πεδίο χαρακτήρων ενώ η κλάση :class:`~django.db.models.DateTimeField` δηλώνει πεδίο για ημερομηνίες. Αυτό λέει στο Django τον τύπο των δεδομένων που θα διατηρεί κάθε πεδίο. Με αυτό τον τρόπο, δηλαδή, χτίζουμε το schema της database μας. Τα δύο αυτά μοντέλα είναι στην ουσία δύο πίνακες στην βάση δεδομένων, τα attributes τους είναι οι στήλες στον εκάστοτε πίνακα και ο τύπος των δεδομένων που θα κρατάει κάθε στήλη δηλώνεται με τα instances της κλάσης :class:`~django.db.models.Field`. Βεβαίως κάθε instance της κλάσης :class:`~django.db.models.Field` δέχεται κάποια ορίσματα (όπως, πχ, το μέγιστο αριθμό χαρακτήρων που θα μπορεί να κρατάει κάθε ερώτηση κλπ) τα οποία θέτουν κάποια επιπλέον χαρακτηριστικά (άλλα είναι απαραίτητα, άλλα προαιρετικά).
it: Ogni campo è rappresentato da un'istanza della classe :class:`~django.db.models.Field` -- e.g., :class:`~django.db.models.CharField` per i campi carattere e :class:`~django.db.models.DateTimeField` per le date. Questo dice a Django che tipo di dati contiene ogni campo.
ja: 各フィールドは :class:`~django.db.models.Field` クラスのインスタンスとして表現されています。例えば、 :class:`~django.db.models.CharField` は文字のフィールドで、 :class:`~django.db.models.DateTimeField` は日時フィー ルドです。こうしたクラスは、各フィールドにどのようなデータ型を記憶させるか を Django に教えます。
pl: Każde pole jest reprezentowane przez instancję klasy :class:`~django.db.models.Field` – na przykład :class:`~django.db.models.CharField` dla pól znakowych i :class:`~django.db.models.DateTimeField` dla dat i czasu. Mówi to Django, jakie dane przechowuje każde pole.
zh_hans: 每个字段都是 :class:`~django.db.models.Field` 类的实例 - 比如，字符字段被表示为 :class:`~django.db.models.CharField` ，日期时间字段被表示为 :class:`~django.db.models.DateTimeField` 。这将告诉 Django 每个字段要处理的数据类型。

source: The name of each :class:`~django.db.models.Field` instance (e.g. ``question_text`` or ``pub_date``) is the field's name, in machine-friendly format. You'll use this value in your Python code, and your database will use it as the column name.
el: Το όνομα κάθε :class:`~django.db.models.Field` instance (π.χ``question_text`` ή ``pub_date``) αποτελεί και το όνομα του field , σε μια φιλική προς τη μηχανή μορφή. Θα τη χρησιμοποιήσετε αυτή την τιμή όποτε αναφέρεστε σε αυτή τη στήλη στον Python κώδικα σας ενώ το ίδιο όνομα θα χρησιμοποιηθεί ως όνομα στήλης στην βάση δεδομένων.
it: Il nome di ogni istanza :class:`~django.db.models.Field` (e.g. ``question_text`` o ``pub_date``) è il nome del campo in formato machine-friendly. Userai questo valore nel tuo codice Python e il tuo database lo userà come nome della colonna.
ja: :class:`~django.db.models.Field` インスタンスそれぞれの名前(例: ``question_text`` や ``pub_date``)は、機械可読なフィールド名です。このフィールド名はPythonコードで使うとともに、データベースも列の名前として使うことになります。
pl: Nazwa każdej instancji :class:`~django.db.models.Field` (np. ``question_text`` lub ``pub_date``) jest nazwą pola, w formacie przyjaznym maszynom. Użyjesz tej wartości w kodzie Pythona i twoja baza danych użyje jej jako nazwy kolumny.
zh_hans: 每个 :class:`~django.db.models.Field` 类实例变量的名字（例如 ``question_text`` 或 ``pub_date`` ）也是字段名，所以最好使用对机器友好的格式。你将会在 Python 代码里使用它们，而数据库会将它们作为列名。

source: You can use an optional first positional argument to a :class:`~django.db.models.Field` to designate a human-readable name. That's used in a couple of introspective parts of Django, and it doubles as documentation. If this field isn't provided, Django will use the machine-readable name. In this example, we've only defined a human-readable name for ``Question.pub_date``. For all other fields in this model, the field's machine-readable name will suffice as its human-readable name.
el: Μπορείτε να χρησιμοποιήσετε ένα προαιρετικό πρώτο positional argument στη κλάση :class:`~django.db.models.Field` για να καθορίσετε το όνομα του για τον χρήστη (όχι για τη μηχανή, όπως πριν). Αυτό χρησιμοποιείται σε μερικά εσωτερικά μέρη του Django και βοηθάει στο να αναγνωρίζει κανείς το πεδίο αυτό. Αν αυτό το πεδίο δεν οριστεί τότε το Django θα χρησιμοποιήσει τη μορφή για τη μηχανή. Σε αυτό το παράδειγμα, έχουμε ορίσει το φιλικό-προς-τον-χρήστη όνομα μόνο για το πεδίο ``Question.pub_date``. Για όλα τα υπόλοιπα πεδία αυτού του μοντέλου (``Question.question_text``) θα χρησιμοποιηθεί το φιλικό-προς-τη-μηχανή όνομα.
it: Puoi passare un primo argomento posizionale opzionale alla classe :class:`~django.db.models.Field` per indicare un nome human-readable. Questo è usato in un paio di parti introspettive di Django e torna utile come documentazione. Se questo argomento non è fornito, Django userà il nome machine-readable. In questo esempio, abbiamo definite un nome human-readable solo per ``Question.pub_date``. Per tutti gli altri campi in questo modello, il nome machine-readable di ogni campo sarà sufficiente come nome human-readable.
ja: :class:`~django.db.models.Field` の第一固定引数には、オプションとして人間可読なフィールド名も指定できます。このフィールド名は Django の二つの内省機能で使う他、ドキュメントとしての役割も果たします。人間可読なフィールド名を指定しない場合、 Django は機械可読な名前を使います。上の例では、 ``Question.pub_date`` にだけ人間可読なフィールド名を指定しました。モデルの他のフィールドでは、フィールドの機械可読な名前は人間可読な名前としても十分なので定義していません。
pl: Można użyć opcjonalnego pierwszego argumentu pozycyjnego w :class:`~django.db.models.Field`, aby wyznaczyć nazwę w postaci czytelnej dla człowieka. Jest ona używana w kilku introspekcyjnych częściach Django i może służyć jako dokumentacja. Jeśli nie podamy tego argumentu, Django będzie używać nazwy maszynowej. W tym przykładzie mamy zdefiniowaną nazwę w postaci czytelnej dla człowieka tylko dla ``Question.pub_date``. Dla wszystkich innych pól w tym modelu, nazwy maszynowe będą wystarczające jako nazwy pól w formie czytelnej dla człowieka.
zh_hans: 你可以使用可选的选项来为 :class:`~django.db.models.Field` 定义一个人类可读的名字。这个功能在很多 Django 内部组成部分中都被使用了，而且作为文档的一部分。如果某个字段没有提供此名称，Django 将会使用对机器友好的名称，也就是变量名。在上面的例子中，我们只为 ``Question.pub_date`` 定义了对人类友好的名字。对于模型内的其它字段，它们的机器友好名也会被作为人类友好名使用。

source: Some :class:`~django.db.models.Field` classes have required arguments. :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`. That's used not only in the database schema, but in validation, as we'll soon see.
el: Όπως είπαμε παραπάνω, μερικά :class:`~django.db.models.Field` classes απαιτούν να έχουν κάποια arguments συμπληρωμένα. Για παράδειγμα το :class:`~django.db.models.CharField`, απαιτεί να το δώσετε ένα :attr:`~django.db.models.CharField.max_length`. Αυτό δεν χρησιμοποιείται μόνο για το schema της βάσης δεδομένων αλλά και για το validation, όπως θα δούμε σύντομα.
it: Alcune classi :class:`~django.db.models.Field` hanno argomenti obbligatori. :class:`~django.db.models.CharField`, per esempio, richiede che tu gli dia una :attr:`~django.db.models.CharField.max_length`. Ciò non viene usato solo nello schema del database ma nella validazione, come vedremo presto.
ja: :class:`~django.db.models.Field` クラスの中には必須の引数を持つものがありま す。例えば `~django.db.models.CharField` には :attr:`~django.db.models.CharField.max_length` を指定する必要があります。この引数はデータベーススキーマで使われる他、後で述べるバリデーションでも使われま す。
pl: Niektóre klasy :class:`~django.db.models.Field` mają wymagane argumenty. Na przykład :class:`~django.db.models.CharField` wymaga podania atrybutu :attr:`~django.db.models.CharField.max_length`. Jest on używany nie tylko w schemacie bazy danych, ale również w walidacji, jak wkrótce zobaczymy.
zh_hans: 定义某些 :class:`~django.db.models.Field` 类实例需要参数。例如 :class:`~django.db.models.CharField` 需要一个 :attr:`~django.db.models.CharField.max_length` 参数。这个参数的用处不止于用来定义数据库结构，也用于验证数据，我们稍后将会看到这方面的内容。

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
el: Ένα :class:`~django.db.models.Field` μπορεί να έχει διάφορα προαιρετικά arguments. Σε αυτό το παράδειγμα έχουμε θέσει στο ``votes`` πεδίο την τιμή 0 (μηδέν) μέσω του argument :attr:`~django.db.models.Field.default`.
it: Un :class:`~django.db.models.Field` può avere anche diversi argomenti opzionali; in questo caso, abbiamo impostato il valore :attr:`~django.db.models.Field.default` a 0.
ja: :class:`~django.db.models.Field` はいつくかオプションの引数も取れます。今回の場合、 ```votes`` の :attr:`~django.db.models.Field.default` 値を 0 に設定しました。
pl: :class:`~django.db.models.Field` może mieć też kilka opcjonalnych argumentów; w tym przypadku ustawiliśmy wartość atrybutu :attr:`~django.db.models.Field.default` pola ``votes`` na 0.
zh_hans: :class:`~django.db.models.Field` 也能够接收多个可选参数；在上面的例子中：我们将 ``votes`` 的 :attr:`~django.db.models.Field.default` 也就是默认值，设为0。

source: Finally, note a relationship is defined, using :class:`~django.db.models.ForeignKey`. That tells Django each ``Choice`` is related to a single ``Question``. Django supports all the common database relationships: many-to-one, many-to-many, and one-to-one.
el: Τέλος, σημειώστε ότι η συσχέτιση (μεταξύ των δύο μοντέλων) επιτυγχάνεται χρησιμοποιώντας την κλάση :class:`~django.db.models.ForeignKey`. Αυτό λέει στο Django ότι κάθε ``Choice`` σχετίζεται με μια ``Question`` ενώ αντίστροφα κάθε ``Question`` μπορεί να συσχετίζεται με πολλά ``Choice``s. Αυτό, βέβαια, γίνεται διότι η στήλη ``question`` του πίνακα ``Choice`` κρατάει το ID της στήλης ``ID`` του πίνακα ``Question``. Έτσι, κάθε ``choice`` δεν μπορεί να αντιστοιχίσει σε παραπάνω από μια ερώτηση καθώς αυτό θα θεωρηθεί διπλή καταχώρηση (duplicate entry). Το Django υποστηρίζει όλου του είδους των κοινών συσχετίσεων μεταξύ βάσεων δεδομένων: many-to-one, many-to-many και one-to-one.
it: Infine, nota che è stata definita una relazione usando :class:`~django.db.models.ForeignKey`. Quello dice a Django che ciascuna ``Choice`` è collegata ad una singola ``Question``. Django supporta tutte le relazioni comuni dei database: many-to-one, many-to-many, and one-to-one.
ja: ついに、 :class:`~django.db.models.ForeignKey` を使用したリレーションシップの記述が定義されました。これは、それぞれの``Choice`` が一つの``Question``に関連付けられていることをDjangoに伝えます。Djangoは 多対一、多対多、そして一対一のような一般的なデータベースリレーションシップすべてをサポートします。
pl: I wreszcie, zwróć uwagę na zdefiniowaną relację przy użyciu :class:`~django.db.models.ForeignKey`. Mówi to Django, że każdy ``Choice`` jest związany z pojedynczym ``Question``. Django wspiera wszystkie powszechne relacje w bazach danych: wiele-do-jednego, wiele-do-wielu i jeden-do-jednego.
zh_hans: 注意在最后，我们使用 :class:`~django.db.models.ForeignKey` 定义了一个关系。这将告诉 Django，每个 ``Choice`` 对象都关联到一个 ``Question`` 对象。Django 支持所有常用的数据库关系：多对一、多对多和一对一。

source: Activating models
el: Ενεργοποιώντας τα μοντέλα
it: Attivazione dei modelli
ja: モデルを有効にする
pl: Włączanie modeli
zh_hans: 激活模型

source: That small bit of model code gives Django a lot of information. With it, Django is able to:
el: Αυτό το μικρό κομμάτι κώδικα δίνει στο Django πολλές πληροφορίες. Με αυτό, το Django μπορεί να:
it: Questo piccolo codice del modello fornisce a Django molte informazioni. Con esso, Django è in grado di:
ja: 前述のようなほんのわずかなコードをモデルに書くだけで、 Django はたくさんの情報を知れます。このコードを使って、 Django は:
pl: Taki mały kawałek kodu modelu daje Django wiele informacji. Na ich podstawie, Django jest w stanie:
zh_hans: 上面的一小段用于创建模型的代码给了 Django 很多信息，通过这些信息，Django 可以：

source: Create a database schema (``CREATE TABLE`` statements) for this app.
el: Δημιουργήσει το database schema (``CREATE TABLE`` statements) για αυτό το app.
it: Creare uno schema di database (istruzione ``CREATE TABLE``) per questa app.
ja: アプリケーションのデータベーススキーマを作成 (``CREATE TABLE`` 文を実行) できます。
pl: Stworzyć schemat bazy danych (polecenia ``CREATE TABLE``) dla tej aplikacji.
zh_hans: 为这个应用创建数据库 schema（生成 ``CREATE TABLE`` 语句）。

source: Create a Python database-access API for accessing ``Question`` and ``Choice`` objects.
el: Δημιουργήσει ένα Python database-access API για να έχετε πρόσβαση στα objects ``Question`` και ``Choice``.
it: Creare un'API Python di accesso al database per accedere agli oggetti ``Domanda`` e ``Scelta``.
ja: ``Question`` や ``Choice`` オブジェクトに Python からアクセスするためのデータベー ス API を作成できます。
pl: Stworzyć pythonowe API dostępu do bazy danych do dostępu do obiektów ``Question`` i ``Choice``.
zh_hans: 创建可以与 ``Question`` 和 ``Choice`` 对象进行交互的 Python 数据库 API。

source: But first we need to tell our project that the ``polls`` app is installed.
el: Αλλά πρώτα θα πρέπει να πούμε στο project μας ότι η εφαρμογή ``polls`` έχει εγκατασταθεί.
it: Ma prima dobbiamo dire al nostro progetto che l'app `` polls'' è installata.
ja: でもその前に ``polls`` アプリケーションをインストールしたことをプロジェクトに教えてやる必要があります。
pl: Ale najpierw musimy powiedziesz naszemu projektowi, że aplikacja ``polls`` jest zainstalowana.
zh_hans: 但是首先得把 ``polls`` 应用安装到我们的项目里。

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
el: Τα apps στο Django είναι "επαναχρησιμοποιήσιμα": Μπορείτε να χρησιμοποιήσετε το ίδιο app σε πολλά projects και επίσης μπορείτε να διανέμετε τα apps σας (να τα χρησιμοποιήσουν άλλοι προγραμματιστές), επειδή δεν είναι απαραίτητο να είναι συνδεδεμένα με κάποια συγκεκριμένη Django εγκατάσταση (περιβάλλον).
it: Le app Django sono "collegabili": puoi usare una app in più progetti e puoi distribuire le app perchè non sono legate ad una specifica installazione di Django.
ja: Django アプリケーションは「プラガブル (pluggable)」です。アプリケーショ ンは特定の Django インストールに結び付いていないので、アプリケーションを複数のプロジェクトで使ったり、単体で配布したりできます。
pl: Aplikacje Django są „wtyczkowe”: możesz używać aplikacji w wielu projektach i możesz udostępniać aplikacje, ponieważ nie muszą one być związane z daną instalacją Django.
zh_hans: Django 应用是“可插拔”的。你可以在多个项目中使用同一个应用。除此之外，你还可以发布自己的应用，因为它们并不会被绑定到当前安装的 Django 上。

source: Edit the :file:`mysite/settings.py` file again, and change the :setting:`INSTALLED_APPS` setting to include the string ``'polls.apps.PollsConfig'``. It'll look like this:
ja: :file:`mysite/settings.py` ファイルをもう一度編集して、 :setting:`INSTALLED_APPS` の設定に文字列``'polls.apps.PollsConfig'``が含まれるよう変更します。そうするとこのようになります:

source: Now Django knows to include the ``polls`` app. Let's run another command:
el: Τώρα το Django ξέρει ότι θα πρέπει να συμπεριλάβει, μεταξύ άλλων και την εφαρμογή με το όνομα ``polls``. Ας τρέξουμε μια άλλη εντολή:
it: Adesso Django sa che che deve includere l'app ``polls`` . Lanciamo un altro comando:
ja: これで Django は ``polls`` アプリケーションが含まれていると知りました。もうひとつコマンドを実行しましょう:
pl: Teraz Django wie, że ma zawierać aplikację ``polls``. Uruchommy następne polecenie:
zh_hans: 现在你的 Django 项目会包含 ``polls`` 应用。接着运行下面的命令：

source: You should see something similar to the following:
el: Θα δείτε κάτι παρόμοιο με αυτό:
it: Dovresti vedere qualcosa di simile a:
ja: 次のようなものが表示されるはずです:
pl: Powinieneś zobaczyć coś podobnego do tego:
zh_hans: 你将会看到类似于下面这样的输出：

source: By running ``makemigrations``, you're telling Django that you've made some changes to your models (in this case, you've made new ones) and that you'd like the changes to be stored as a *migration*.
el: Τρέχοντας την εντολή ``makemigrations``, λέτε στο Django ότι έχετε κάνει κάποιες αλλαγές στο μοντέλο σας (σε αυτή την περίπτωση, έχετε δημιουργήσει καινούργια μοντέλα) και ότι θα θέλατε αυτές οι αλλαγές να αποθηκευτούν ως *migration*.
it: Eseguendo ``makemigrations``, stai dicendo a Django che hai apportato alcune modifiche ai tuoi modelli (in questo caso, ne hai aggiunto uno nuovo) e che desideri che le modifiche vengano memorizzate come *migrazione*.
ja: ``makemigrations``を実行することで、Djangoにモデルに変更があったこと(この場合、新しいものを作成しました)を伝え、そして変更を*マイグレーション*の形で保存することができました。
pl: Uruchamiając ``makemigrations``, mówisz Django, że dokonałeś jakichś zmian w swoich modelach (w tym przypadku stworzyłeś nowe) i chcesz, aby te zmiany były przechowane jako *migracja*.
zh_hans: 通过运行 ``makemigrations`` 命令，Django 会检测你对模型文件的修改（在这种情况下，你已经取得了新的），并且把修改的部分储存为一次 *迁移*。

source: Migrations are how Django stores changes to your models (and thus your database schema) - they're just files on disk. You can read the migration for your new model if you like; it's the file ``polls/migrations/0001_initial.py``. Don't worry, you're not expected to read them every time Django makes one, but they're designed to be human-editable in case you want to manually tweak how Django changes things.
el: Τα migrations αναπαριστούν στο Django, τις αλλαγές στα μοντέλα σας (και συνεπώς στο schema της βάσης δεδομένων σας) - δεν είναι τίποτε άλλο παρά αρχεία (Python κώδικας) στον υπολογιστή σας. Μπορείτε, αν θέλετε, να διαβάσετε το migration για τα καινούργια μοντέλα που δημιουργήσαμε. Βρίσκεται στο αρχείο ``polls/migrations/0001_initial.py``. Αλλά μην ανησυχείτε, δεν θα χρειαστεί να διαβάζετε αυτά τα αρχεία κάθε φορά που το Django τα δημιουργεί. Ωστόσο, είναι γραμμένα με φιλική-προς-τον-χρήστη μορφή ούτως ώστε να μπορείτε να τα επεξεργαστείτε στο μέλλον αν χρειαστεί.
ja: マイグレーションはDjangoがモデル(そしてデータベーススキーマでもあります)の変更をディスク上のファイルに保存する方法です。望むならば、新しいモデルをマイグレーションのファイル ``polls/migrations/0001_initial.py`` から読むことも出来ます。安心して下さい、Djangoが作成する度にマイグレーションのファイルを読む必要はありません、しかし、Djangoが行った変更を手動で微調整したいというときのために人間可読なファイルとして設計されています。
pl: Migracje, to sposób w jaki Django przechowuje zmiany twoich modeli (i przez to zmiany schematu bazy danych) – są po prostu plikami na dysku. Możesz przeczytać migrację dla twojego nowego modelu, jeśli masz ochotę; to plik ``polls/migrations/0001_initial.py``. Nie przejmuj się, nie musisz ich czytać za każdym razem, kiedy Django je tworzy, ale zostały one zaprojektowane, aby były modyfikowalne przez dewelopera, na wypadek, gdybyś chciał ręcznie poprawić to, jak Django zmienia rzeczy.
zh_hans: 迁移是 Django 对于模型定义（也就是你的数据库结构）的变化的储存形式 - 没那么玄乎，它们其实也只是一些你磁盘上的文件。如果你想的话，你可以阅读一下你模型的迁移数据，它被储存在 ``polls/migrations/0001_initial.py`` 里。别担心，你不需要每次都阅读迁移文件，但是它们被设计成人类可读的形式，这是为了便于你手动修改它们。

source: There's a command that will run the migrations for you and manage your database schema automatically - that's called :djadmin:`migrate`, and we'll come to it in a moment - but first, let's see what SQL that migration would run. The :djadmin:`sqlmigrate` command takes migration names and returns their SQL:
el: Μέχρι τώρα, δηλαδή, έχουμε ορίσει τα μοντέλα μας, έχουμε δημιουργήσει τα migrations αλλά δεν έχει γραφτεί τίποτα στη βάση δεδομένων. Όπως καταλάβατε, για να δημιουργήσουμε τους πίνακες στη βάση (δημιουργία schema) δεν έχουμε παρά να τρέξουμε μια εντολή που θα τα τακτοποιήσει όλα αυτά για εμάς. Η εντολή αυτή λέγεται :djadmin:`migrate` και θα έρθουμε σε αυτή σε λίγο – αλλά πρώτα, ας ρίξουμε μια ματιά στην εντολή SQL που θα τρέξει στην ουσία. Η database δεν καταλαβαίνει Python κώδικα παρά μόνο SQL εντολές. Επομένως, για να δούμε την SQL εντολή που θα δοθεί (από το Django) στην βάση δεδομένων για τη δημιουργία των πινάκων (στην ουσία γίνεται μια μετάφραση του αρχείου ``polls/migrations/0001_initial.py`` σε SQL) δεν έχουμε παρά να τρέξουμε την Django εντολή :djadmin:`sqlmigrate` η οποία παίρνει ως όρισμα ονόματα migrations και επιστρέφει την μετάφραση τους σε SQL:
it: C'è un comando che eseguirà le migrazioni per te e gestirà automaticamente lo schema del tuo database - che si chiama :djadmin:`migrate`, e ci arriveremo tra un attimo - ma prima, vediamo quale SQL eseguirà la migrazione. Il comando :djadmin:`sqlmigrate` accetta i nomi delle migrazioni e restituisce il loro SQL:
ja: これは自動でデータベーススキーマを管理するためのマイグレーション実行するとのコマンドです。:djadmin:`migrate` と呼ばれる、あっという間に完了します、しかし最初は、マイグレーションがどんなSQLを実行するのか見てみましょう。:djadmin:`sqlmigrate` コマンドはマイグレーションの名前を引数にとってSQLを返します:
pl: Jest komenda, która uruchomi dla ciebie migracje i będzie zarządzać automatycznie schematem bazy danych – nazywa się :djadmin:`migrate` i zaraz do niej dojdziemy – ale najpierw zobaczmy, jaki kod SQL ta migracja uruchomiła. Komenda :djadmin:`sqlmigrate` bierze jako argument nazwy migracji i zwraca ich SQL:
zh_hans: Django 有一个自动执行数据库迁移并同步管理你的数据库结构的命令 - 这个命令是 :djadmin:`migrate`，我们马上就会接触它 - 但是首先，让我们看看迁移命令会执行哪些 SQL 语句。:djadmin:`sqlmigrate` 命令接收一个迁移的名称，然后返回对应的 SQL：

source: You should see something similar to the following (we've reformatted it for readability):
el: Θα δείτε κάτι παρόμοιο με το ακόλουθο (έχουμε αλλοιώσει λίγο την έξοδο για λόγους αναγνωσιμότητας):
it: Dovresti vedere qualcosa di simile al seguente (è stato riformattato per leggibilità):
ja: あなたは次のようなもの (読みやすさのためにそれを再フォーマットした) が表示されるはずです:
pl: Powinieneś zobaczyć coś podobnego do tego (sformatowaliśmy dla czytelności):
zh_hans: 你将会看到类似下面这样的输出（我把输出重组成了人类可读的格式）：

source: Note the following:
el: Σημειώστε τα ακόλουθα:
it: Nota bene:
ja: 以下に注意してください:
pl: Zwróć uwagę na następującą rzecz:
zh_hans: 请注意以下几点：

source: The exact output will vary depending on the database you are using. The example above is generated for PostgreSQL.
el: Η ακριβής έξοδος της εντολής :djadmin:`sqlmigrate` θα διαφέρει αναλόγως την βάση δεδομένων που χρησιμοποιείτε. Το ανωτέρω παράδειγμα χρησιμοποίησε την PostgreSQL.
it: L'output esatto varierà a seconda del database in uso. L'esempio sopra è generato per PostgreSQL.
ja: 正確な出力は、使用しているデータベースによって異なります。上記の例では、 PostgreSQL のために生成されます。
pl: Dokładny output będzie różnił się w zależności od bazy danych, której używasz. Przykład powyżej jest wygenerowany dla PostgreSQLa.
zh_hans: 输出的内容和你使用的数据库有关，上面的输出示例使用的是 PostgreSQL。

source: Table names are automatically generated by combining the name of the app (``polls``) and the lowercase name of the model -- ``question`` and ``choice``. (You can override this behavior.)
el: Τα ονόματα των πινάκων δημιουργήθηκαν αυτόματα ενώνοντας το όνομα του app (``polls``) με το όνομα του μοντέλου (όλα πεζά γράμματα) -- ``question`` και ``choice``. Μπορείτε, φυσικά, να παρακάμψετε (override) αυτή τη συμπεριφορά, αν θέλετε.
it: I nomi delle tabelle vengono generati automaticamente combinando il nome dell'app (``polls``) e il nome minuscolo del modello -- ``question`` and ``choice``. (Puoi cambiare questo comportamento.)
ja: テーブル名はアプリケーションの名前 (``polls``) とモデルの小文字表記 の ``question`` と ``choice`` を組み合わせて自動的に生成されます。 (この挙動はオーバライドできます)
pl: Nazwy tabel są wygenerowanie automatycznie przez połączenie nazwy aplikacji (``polls``) i nazwy modelu małymi literami – ``question`` i ``choice``. (Możesz nadpisać to zachowanie.)
zh_hans: 数据库的表名是由应用名(``polls``)和模型名的小写形式( ``question`` 和 ``choice``)连接而来。（如果需要，你可以自定义此行为。）

source: Primary keys (IDs) are added automatically. (You can override this, too.)
el: Τα primary keys (IDs) προστέθηκαν αυτόματα (μπορείτε να το παρακάμψετε και αυτό!).
it: Le chiavi primarie (ID) vengono aggiunte automaticamente. (Puoi modificare questo comportamento.)
ja: 主キー (primary key, ID) は自動的に追加されます (この挙動もオーバライド可能です)。
pl: Klucze główne (ID) są dodane automatycznie. (Możesz to też nadpisać.)
zh_hans: 主键(IDs)会被自动创建。(当然，你也可以自定义。)

source: By convention, Django appends ``"_id"`` to the foreign key field name. (Yes, you can override this, as well.)
el: Από προεπιλογή, το Django προσθέτει τη λέξη ``"_id"`` σε κάθε πεδίο foreign key (ω ναι, μπορείτε να το παρακάμψετε και αυτό!)
it: Per convenzione, Django aggiunge ``"_id"`` al nome del campo della chiave esterna. (Sì, puoi modificare anche questo.)
ja: 便宜上、 Django は外部キーのフィールド名に ``"_id"`` を追加します。もちろんこの挙動もオーバライド可能です。
pl: W konwencji, Django dodaje ``„_id”`` do nazwy pola klucza obcego. (Tak, także to możesz nadpisać.)
zh_hans: 默认的，Django 会在外键字段名后追加字符串 ``"_id"`` 。（同样，这也可以自定义。）
