Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Django's main documentation is broken up into "chunks" designed to fill different needs:
el: Το βασικό documentation του Django είναι χωρισμένο σε "chunks" (κομμάτια) τα οποία έχουν σχεδιαστεί να εξυπηρετούν διαφορετικούς σκοπούς:
it: La documentazione principale di Django è suddivisa in "blocchi" progettati per soddisfare diverse esigenze:
ja: Django のドキュメントは、用途に応じていくつかのセクションに分かれています。
pl: Główna dokumentacja Django jest rozbita na kawałki zaprojektowane, by spełniać różne potrzeby:
zh_hans: Django的主要文档以“块”的形式划分，用于满足不同的需求：

source: The :doc:`introductory material </intro/index>` is designed for people new to Django -- or to Web development in general. It doesn't cover anything in depth, but instead gives a high-level overview of how developing in Django "feels".
el: Το άρθρο :doc:`Ξεκινώντας </intro/index>` είναι σχεδιασμένο για αυτούς που δεν είναι μυημένοι στο Django -- ή στο Web development γενικότερα. Δεν καλύπτει κάτι εις βάθος, αλλά δίνει μια εικόνα του developing χρησιμοποιώντας το Django.
it: Il :doc:`materiale introduttivo </intro/index>` è progettato per le persone che non conoscono Django - o per lo sviluppo Web in generale. Non tratta nulla in profondità, ma fornisce invece una panoramica di alto livello di com'è lo sviluppo in Django.
ja: :doc:`入門編 </intro/index>` は、Django やウェブ開発全般の初心者を対象に作られています。あまり詳細な解説はありませんが、Django の開発が「どのようなものか」を高い視点から見られます。
pl: :doc:`Materiał wprowadzający </intro/index>` jest zaprojektowany dla ludzi nowych w Django – lub ogólnie w web-dewelopmencie. Nie omawia nic szczegółowo, lecz daje przegląd na wysokim poziomie abstrakcji „jak to jest” dewelopować w Django.
zh_hans: The :doc:`介绍文档 </intro/index>` 是专为 Django 初学者或 Web 初学者设计的。它不会做任何的深入，只是以高度概括的方式介绍了如果以 Django “风格”开发应用的方式。

source: The :doc:`topic guides </topics/index>`, on the other hand, dive deep into individual parts of Django. There are complete guides to Django's :doc:`model system </topics/db/index>`, :doc:`template engine </topics/templates>`, :doc:`forms framework </topics/forms/index>`, and much more.
el: Από την άλλη, το άρθρο :doc:`Χρησιμοποιώντας το Django </topics/index>`, βουτάει βαθιά στις επιμέρους οντότητες του Django. Υπάρχουν πλήρης οδηγοί (guides) στα :doc:`σύστημα μοντέλων </topics/db/index>`, :doc:`template engine </topics/templates>`, :doc:`framework για φόρμες </topics/forms/index>` και πολλά άλλα.
it: Le :doc:`topic guides </topics/index>`, d'altra parte, approfondiscono le singole parti di Django. Ci sono guide complete a Django :doc:`model system </topics/db/index>`, :doc:`template engine </topics/templates>`, :doc:`forms framework </topics/forms/index>` e molto altro.
ja: 一方、:doc:`トピック別ガイド </topics/index>` では、Django の個々の構成要素について詳しく解説しています。このセクションでは、Django's :doc:`モデルシステム </topics/db/index>`、:doc:`テンプレートエンジン </topics/templates>`、:doc:`フォームフレームワーク </topics/forms/index>`などといったトピックを解説しています。
pl: :doc:`Przewodniki tematyczne </topics/index>` z drugiej strony zanurzają się głęboko w poszczególne części Django. Są tu pełne przewodniki po :doc:`systemie modeli </topics/db/index>`, :doc:`silniku szablonów </topics/templates>`, :doc:`frameworku formularzy </topics/forms/index>` Django i wiele więcej.
zh_hans: 另一方面，The :doc:`主题指南 </topics/index>` 则深入介绍 Django 的各个部分。那里有更多完整的关于 Django的 :doc:`模板系统 </topics/db/index>`, :doc:`模板引擎 </topics/templates>`, :doc:`表单框架 </topics/forms/index>` 和其它东西的信息。

source: This is probably where you'll want to spend most of your time; if you work your way through these guides you should come out knowing pretty much everything there is to know about Django.
el: Τον περισσότερο χρόνο σας θα τον περάσετε διαβάζοντας και ξαναδιαβάζοντας τους παραπάνω οδηγούς. Όταν τους κατανοήσετε τότε θα ξέρετε (σχεδόν τα πάντα για) το πως λειτουργεί το Django.
it: Probabilmente è qui che vorrai trascorrere la maggior parte del tuo tempo; se ti fai strada attraverso queste guide dovresti uscire sapendo praticamente tutto quello che c'è da sapere su Django.
ja: おそらく、読者の皆さんは、このセクションを読み進むのに、大部分の時間を使うでしょう。このガイドを全て読破すれば、Django を扱う上で必要なことのほとんどを知ることができるはずです。
pl: To prawdopodobnie miejsce, gdzie będziesz chciał spędzić większość swojego czasu; jeśli przepracujesz na swój sposób te przewodniki, powinieneś wyjść wiedząc praktycznie wszystko, co można wiedzieć o Django.
zh_hans: 这可能是你会花费你大部分时间的地方。如果你详细阅读了这些指南，你就能了解几乎所有关于 Django 的知识。

source: Web development is often broad, not deep -- problems span many domains. We've written a set of :doc:`how-to guides </howto/index>` that answer common "How do I ...?" questions. Here you'll find information about :doc:`generating PDFs with Django </howto/outputting-pdf>`, :doc:`writing custom template tags </howto/custom-template-tags>`, and more.
el: Το Web development είναι συχνά αχανές και όχι βαθύ -- τα προβλήματα που προκύπτουν αφορούν διάφορους τομείς. Έχουμε γράψει ένα σετ από :doc:`οδηγούς how-to </howto/index>` οι οποίοι απαντούν κοινές ερωτήσεις του τύπου "Πως να ...?". Εδώ θα βρείτε πληροφορίες σχετικά με :doc:`τη δημιουργία PDFs με το Django </howto/outputting-pdf>`, :doc:`σύνταξη δικών σας template tags </howto/custom-template-tags>` και πολλά άλλα.
it: Lo sviluppo Web è spesso ampio, non profondo: i problemi riguardano molti ambiti. Abbiamo scritto una serie di :doc:`guide pratiche </howto/index>` che rispondono alle comuni domande "Come faccio a ...?". Qui troverai informazioni sulla :doc:`generazione di PDF con Django </howto/outputting-pdf>`, :doc:`scrittura di template tag personalizzati </howto/custom-template-tags>`, e altro.
ja: ウェブ開発に必要な知識は、いくつもの領域にまたがって広く浅く分布しているものです。このセクションには、「〜をするにはどうしたらよいか？」というような質問に答えてくれる :doc:`How-to </howto/index>` が集まっています。たとえば、:doc:`Django で PDF を生成する方法 </howto/outputting-pdf>` や、:doc:`テンプレートタグを自作する方法 </howto/custom-template-tags>` などの How-to があります。
pl: Web dewelopment jest często szeroki, nie głęboki – problemy rozciągają się na wiele domen. Napisaliśmy zestaw :doc:`przewodników how-to </howto/index>`, które odpowiadają na częste pytania „Jak to zrobić?”. Znajdziesz tu informacje o :doc:`generowaniu PDF-ów z Django </howto/outputting-pdf>`, :doc:`pisaniu własnych tagów szablonów </howto/custom-template-tags>` i więcej.
zh_hans: Web 开发通常是广而不深的——问题通常跨越多个领域。我们已经写了一系列的文档 :doc:`how-to 指引 </howto/index>` 用于回答常见的“为什么我会……？”系列问题。在这里，你可以找到关于 :doc:`通过 Django 生成 PDF </howto/outputting-pdf>`，:doc:`定义自定义模板标签 </howto/custom-template-tags>` 的文档，当然，还有其它的文档。

source: Answers to really common questions can also be found in the :doc:`FAQ </faq/index>`.
el: Απαντήσεις σε πραγματικά συχνές ερωτήσεις μπορείτε να βρείτε (που αλλού) στις :doc:`Συχνές ερωτήσεις (FAQ) </faq/index>`.
it: Le risposte a domande molto comuni possono essere trovate anche nelle :doc:`FAQ </faq/index>`.
ja: よくある質問は、これとは別に :doc:`FAQ </faq/index>` で扱っています。
pl: Odpowiedzi na naprawdę powszechne pytania znajdują się też w :doc:`FAQ </faq/index>`.
zh_hans: 关于常见问题的回答可参见 :doc:`FAQ </faq/index>`。

source: The guides and how-to's don't cover every single class, function, and method available in Django -- that would be overwhelming when you're trying to learn. Instead, details about individual classes, functions, methods, and modules are kept in the :doc:`reference </ref/index>`. This is where you'll turn to find the details of a particular function or whatever you need.
el: Οι οδηγοί και τα how-to δεν καλύπτουν κάθε κλάση, συνάρτηση και μέθοδο διαθέσιμη στο Django -- αυτό μπορεί να γίνει εκνευριστικό όταν προσπαθείτε να μάθετε κάτι καινούργιο. Αντιθέτως, οι λεπτομέρειες σχετικά με κλάσεις, συναρτήσεις, μεθόδους και modules κρατούνται στο άρθρο :doc:`αναφορά </ref/index>`. Εκεί θα βρείτε το οτιδήποτε αφορά μια συγκεκριμένη συνάρτηση ή οτιδήποτε άλλο σχετικό.
it: Le guide e le istruzioni non coprono ogni singola classe, funzione e metodo disponibile in Django -- sarebbe eccessivo quando stai cercando di imparare. Invece, i dettagli su singole classi, funzioni, metodi e moduli sono conservati in :doc:`reference </ref/index>`. Qui è dove ti dirigerai per trovare i dettagli di una particolare funzione o qualsiasi cosa tu abbia bisogno.
ja: ガイドや How-to ドキュメントでは、Django のクラスや関数、メソッドのすべてを解説しているわけではありません。初めて Django を学ぼうとする人に一度に全てを教えようとしても、教えたことが記憶からあふれてしまうからです。その代わりに、一つひとつのクラスや関数、メソッド、モジュールの詳しい解説は、 :doc:`リファレンス </ref/index>` に書いてあります。特定の関数の仕様や、使える機能を調べたい場合には、このセクションを参照してください。
pl: Przewodniki i przewodniki how-to nie omawiają każdej klasy, funkcji i metody dostępnej w Django – byłoby to przytłaczające podczas prób nauki. Zamiast tego szczegóły na temat poszczególnych klas, funkcji, metod i modułów są trzymane w :doc:`dokumentacji </ref/index>`. To tu będziesz się zwracał, aby znaleźć szczegóły wybranej funkcji lub czegokolwiek będziesz potrzebował.
zh_hans: 这个引导和怎么做的文档不会覆盖 Django 中每个可用的类，函数和方法——在你想学的时候，你会发现实在是太多了。作为替代，每个类，函数，方法和模块的细节在 :doc:`参考 </ref/index>` 中介绍。那是你未来查找某个函数的细节或其它你需要的东西的地方。

source: If you are interested in deploying a project for public use, our docs have :doc:`several guides</howto/deployment/index>` for various deployment setups as well as a :doc:`deployment checklist</howto/deployment/checklist>` for some things you'll need to think about.
el: Αν ενδιαφέρεστε να κάνετε deploy ένα project για δημόσια χρήση (με άλλα λόγια να ανεβάσετε το project σας σε κάποιον πραγματικό server), παρέχουμε :doc:`αρκετούς οδηγούς </howto/deployment/index>` για διάφορα deployment περιβάλλοντα, όπως επίσης και μια :doc:`deployment checklist </howto/deployment/checklist>` για μερικά πράγματα που πρέπει να λάβετε υπόψιν σας προτού “ανεβάσετε” το project σας.
it: Se sei interessato a distribuire un progetto pubblicamente, la nostra documentazione contiene :doc:`diverse guide</howto/deployment/index>` per vari tipi di distribuzione, nonché una :doc:`lista di controllo</howto/deployment/checklist>` con alcune cose a cui dovrai pensare per la distribuzione.
ja: 公開用にプロジェクトをデプロイする方法について知りたければ、さまざまなデプロイ環境に対応した :doc:`いくつかのガイド</howto/deployment/index>` を用意しています。デプロイ時に考えなくてはいけないことをリストアップした :doc:`デプロイ時チェックリストdeployment checklist</howto/deployment/checklist>` と合わせて読んでみてください。
pl: Jeśli jesteś zainteresowany deplojowaniem projektu do publicznego użytku, nasze docs mają `parę przewodników</howto/depolyment/index>` dla różnych konfiguracji deploymentowych jak i :doc:`checklistę deploymentu </howto/deployment/checklist>` z kilkoma rzeczami, o których będziesz musiał pomyśleć.
zh_hans: 如果你对部署一个公用的工程感兴趣，我们有介绍各种部署设置的文档 :doc:`几个指引 </howto/deployment/index>` 和介绍你几个你需要了解的东西的文档 :doc:`部署清单 </howto/deployment/checklist>`。

source: Finally, there's some "specialized" documentation not usually relevant to most developers. This includes the :doc:`release notes </releases/index>` and :doc:`internals documentation </internals/index>` for those who want to add code to Django itself, and a :doc:`few other things that simply don't fit elsewhere </misc/index>`.
el: Τέλος, υπάρχει ένα "ειδικό" τμήμα του εγχειριδίου το οποίο δεν είναι και πολύ σχετικό με τους περισσότερους developers. Αυτό περιλαμβάνει τα άρθρα :doc:`σημειώσεις έκδοσης (release notes) </releases/index>` και :doc:`internals documentation </internals/index>` για αυτούς που θέλουν να προσθέσουν κώδικα στο Django και κάποια άλλα άρθρα σχετικά με :doc:`πράγματα που δεν μπορούσαν να μπουν πουθενά αλλού </misc/index>`.
ja: 最後に、ほとんどの開発者にとってはあまり関係のない「特殊な」ドキュメントとして、 :doc:`リリースノート </releases/index>`、Django 自体にコードを追加したい人のための :doc:`内部使用のドキュメント </internals/index>`、そして、:doc:`分類が難しいその他のドキュメント </misc/index>` があります。
pl: Ostatecznie, jest trochę „wyspecjalizowanej” dokumentacji zazwyczaj nieistotnej dla większości deweloperów. Zawierają się w niej :doc:`informacje o wydaniach </releases/index>` i :doc:`dokumentacja wewnętrzna </internals/index>` dla tych, którzy chcą dodać kod do samego Django i :doc:`kilka innych rzeczy, które po prostu nie pasują nigdzie indziej </misc/index>`.
zh_hans: 最后，这里有一些与大部分开发者无关的“专业”文档。包含 :doc:`发布说明 </releases/index>` 和 :doc:`内部文档 </internals/index>` ，用于向那些想向 Django 提交代码的专业人士。还有一份文档 :doc:`不适合放到其它地方的一点内容 </misc/index>` 。

source: How documentation is updated
el: Πως ανανεώνετε το documentation
it: Com'è aggiornata la documentazione
ja: ドキュメントの更新の方針
pl: Jak dokumentacja jest aktualizowana
zh_hans: 这个文档是如何更新的

source: Just as the Django code base is developed and improved on a daily basis, our documentation is consistently improving. We improve documentation for several reasons:
el: Όπως ακριβώς ο πηγαίος κώδικας του Django αναπτύσσεται και βελτιώνεται καθημερινώς, έτσι και το documentation μας συνεχώς βελτιώνεται. Βελτιώνουμε το documentation για πολλούς λόγους:
it: Proprio come la code base di Django viene sviluppata e migliorata quotidianamente, la nostra documentazione migliora costantemente. Miglioriamo la documentazione per diversi motivi:
ja: Django のコードベースが毎日のように開発と改良を重ねているように、ドキュメン トも常に改良を重ねています。ドキュメントの改良は以下のような理由に基づいて 行われます。
pl: Tak jak baza kodu Django jest rozwijana i ulepszana na co dzień, nasza dokumentacja jest stale ulepszana. Ulepszamy dokumentację z kilku powodów:
zh_hans: 就像 Django 的源码每天都被更新和提升一样，我们的文档也会持续优化。我们因为以下几个原因优化文档：

source: To make content fixes, such as grammar/typo corrections.
el: Διορθώνουμε το περιεχόμενο, όπως γραμματικά/τυπογραφικά λάθη.
it: Per sistemare il contenuto, come la grammatica o errori di battitura.
ja: 文法やタイプミスなどの誤りを修正する場合。
pl: Aby robić poprawki treści, takie jak gramatyczno-literówkowe korekty.
zh_hans: 更正内容，如更正语法/拼写错误。

source: To add information and/or examples to existing sections that need to be expanded.
el: Προσθέτουμε πληροφορίες και/ή παραδείγματα σε κάποια κομμάτια τα οποία χρειάζονται επέκταση.
it: Aggiungere informazioni e/o esempi alle sezioni già esistenti che hanno bisogni di essere estese.
ja: 既存の内容に対して、新たに情報や例題を追加する場合。
pl: Aby dodawać informacje i/lub przykłady do istniejących sekcji, które powinny być rozszerzone.
zh_hans: 向已有的需要被扩展的某个章节添加介绍信息或例子。

source: To document Django features that aren't yet documented. (The list of such features is shrinking but exists nonetheless.)
el: Συμπεριλαμβάνουμε στο εγχειρίδιο τα Django features τα οποία λείπουν. (Η λίστα αυτών των features μειώνεται αλλά δεν παύει να υπάρχει.)
it: Documentare le features di Django che non sono ancora state documentate. ( La lista di tale features si restringe, ma è comunque presente.)
ja: まだ解説されていない Django の機能をドキュメント化する場合 (未ドキュメントの機能は減りつつありますが、まだいくつか残っています)。
pl: Aby dokumentować funkcje Django, które jeszcze nie są udokumentowane. (Lista takich funkcji kurczy się, niemniej jednak istnieje.)
zh_hans: 记录尚未记录的 Django 功能。 （这些功能的列表正在缩小，但仍然存在。）

source: To add documentation for new features as new features get added, or as Django APIs or behaviors change.
el: Εμπλουτίζουμε το εγχειρίδιο για να συμπεριληφθούν τα νέα features που προστίθενται ή όταν αλλάζουν τα Django APIs ή κάποιες συμπεριφορές.
it: Per aggiungere la documentazione per nuove funzionalità man mano che vengono aggiunte, o quando cambiano le API o alcuni comportamenti di Django.
ja: 新たな機能が追加され、ドキュメントも追加する場合。あるいは、Django の API や挙動が変更された場合。
pl: Aby dodawać dokumentację nowych funkcjonalności gdy są dodawane albo kiedy API lub zachowanie Django się zmieniają.
zh_hans: 在新特性被添加时，或 Django 的 API 或行为有变化时，会添加新文档。

source: Django's documentation is kept in the same source control system as its code. It lives in the `docs`_ directory of our Git repository. Each document online is a separate text file in the repository.
ja: Django のドキュメントはコードと同じソースコード管理システム下にあり、 Git リポジトリの `docs`_ ディレクトリ以下に置かれています。オンラインで表示される各ドキュメントは、レポジトリ上でそれぞれ別々のテキストファイルに分かれています。
pl: Dokumentacja Django jest trzymana w tym samym systemie kontroli źródeł co jego kod. Jest umieszczona w katalogu `docs`_ naszego repozytorium Git. Każdy dokument online jest oddzielnym plikiem tekstowym w repozytorium.
zh_hans: Django 的文档以和它的代码一样，以代码版本管理系统方式进行管理。它被保存在 git 仓库的 `docs`_ 目录内。每份在线文档都是仓库内的一份独立文本文件。

source: Where to get it
el: Που να το βρείτε
it: Dove trovarla
ja: ドキュメントの入手
pl: Gdzie ją zdobyć
zh_hans: 从哪里获取这个

source: You can read Django documentation in several ways. They are, in order of preference:
el: Μπορείτε να διαβάσετε το Django documentation με αρκετούς τρόπους. Με σειρά προτίμησης, είναι οι εξής:
it: Puoi leggere la documentazione Django in diversi modi. Questi, in ordine di preferenza:
ja: Django のドキュメントを入手するにはいくつか方法があります。おすすめの順に以 下に示します。
pl: Możesz czytać dokumentację Django na parę sposobów. Są to, w kolejności priorytetów:
zh_hans: 你可以以好几种形式阅读 Django 的文档。他们按照优先顺序排列：

source: On the Web
el: Στο Web
it: Sul Web
ja: Web 版
pl: W Internecie
zh_hans: 在网络上

source: The most recent version of the Django documentation lives at https://docs.djangoproject.com/en/dev/. These HTML pages are generated automatically from the text files in source control. That means they reflect the "latest and greatest" in Django -- they include the very latest corrections and additions, and they discuss the latest Django features, which may only be available to users of the Django development version. (See "Differences between versions" below.)
ja: Django ドキュメントの最新版は https://docs.djangoproject.com/en/dev/ にあります。ここにある HTML ページは、ソースコード管理システム上のテキストファイルから自動生成されているものです。したがって、これらのファイルは「最新最良の」 Django に対応しています。つまり、最近の修正や追加事項を反映していて、 まだ開発版でしか使えないような最新の機能についても部分的に解説しているわけです。(後述の「バージョン間の相違点」を参照してください。)
pl: Najnowsza wersja dokumentacji Django jest umieszczona w https://docs.djangoproject.com/en/dev/. Te strony HTML są generowane automatycznie z plików tekstowych w repozytorium. To znaczy, że odzwieciedlają one to, co „najnowsze i najlepsze” w Django – zawierają najbardziej świeże korekty i dodatki i omawiają najnowsze funkcjonalności Django, które mogą być tylko dostępne dla użytkowników developerskiej wersji Django. (Porównaj „Różnice między wersjami” poniżej.)
zh_hans: Django 最新的在线版文档位于 https://docs.djangoproject.com/en/dev/。这些网页由 Django 的源码控制系统中的纯文本文件自动生成。这意味着它们展示了 Django “最新最好” 的修改——它们包含最新的更正和补充，并讨论了最新的Django功能，这些功能只可供Django开发版的用户使用。（参见以下关于“不同版本之间的差异”的介绍。）

source: We encourage you to help improve the docs by submitting changes, corrections and suggestions in the `ticket system`_. The Django developers actively monitor the ticket system and use your feedback to improve the documentation for everybody.
el: Παρακαλούμε αν έχετε τυχόν αλλαγές, διορθώσεις ή προτάσεις που αφορούν το documentation να τις καταθέσετε στο `ticket system`_ προκειμένου να συμβάλλετε στην βελτίωση του. Οι Django developers παρακολουθούν το ticket system και χρησιμοποιούν το δικό σας feedback για να βελτιώσουν το documentation προς όφελος όλων.
it: Ti incoraggiamo ad aiutare a migliorare i documenti inviando modifiche, correzioni e suggerimenti nel `ticket system`_. Gli sviluppatori di Django monitorano attivamente il ticket system e usano il tuo feedback per migliorare la documentazione per tutti.
ja: ドキュメント改良のお手伝いは大歓迎です。変更すべき点、修正すべき点、改良す べき点などを `チケットシステム`_ に提出してください。Django の開発陣はチケットシステムを監視して、あなたのフィードバックが皆に恩恵をもたらすようにドキュメントを改良しています。
pl: Zachęcamy cię do pomocy w ulepszaniu dokumentacji przez wysyłanie zmian, korekt i sugestii przez `ticket system`_. Deweloperzy Django aktywnie monitorują system zgłoszeń i skorzystają z twojego feedbacku, aby ulepszyć dokumentację dla wszystkich.
zh_hans: 为提高文档质量，你可以选择在 `工单系统`_ 中提交变更，修正以及建议，为此我们将十分欣喜。 Django 的开发者们会积极的监控工单系统，并使用你的反馈为大家改善文档。

source: Note, however, that tickets should explicitly relate to the documentation, rather than asking broad tech-support questions. If you need help with your particular Django setup, try the |django-users| mailing list or the `#django IRC channel`_ instead.
el: Ωστόσο, σημειώστε, ότι τα tickets θα πρέπει να συσχετίζονται με το documentation και όχι με κάποια τεχνική υποστήριξη. Αν χρειάζεστε βοήθεια με τη δική σας Django εγκατάσταση, δοκιμάστε τη mailing list των |django-users| ή το κανάλι `#django IRC channel`_.
it: Nota, tuttavia, che i ticket dovrebbero riferirsi esplicitamente alla documentazione, piuttosto che porre domande generali di supporto tecnico. Se hai bisogno di aiuto con la tua particolare configurazione Django, prova | django-users | mailing list oppure il canale `#django su IRC`.
ja: ただし、チケットは一般的なテクニカルサポートに関わる質問ではなく、ドキュメ ント自体に関する内容にしてください。 Django のセットアップに関する個別の問 題はドキュメントのコメント欄にではなく、 django-users メーリングリストや IRC の `#django チャネル`_ にお願いします。
pl: Jednakże zwróć uwagę, że zgłoszenia powinny odnosić się bezpośrednio do dokumentacji, zamiast zadawać szerokie pytania technicznego wsparcia. Jeśli potrzebujesz pomocy ze swoją konkretną konfiguracją Django, spróbuj na liście mailingowej |django-users| lub `#django IRC channel`_.
zh_hans: 值得一提的是，工单(ticket)应该明确地关联到文档，而不是询问笼统的技术支持问题。 如果你需要针对你的 Django 配置寻求帮助，尝试联系 |django-users| 邮件组 或者 `#django IRC channel`_ 。

source: In plain text
el: Σε απλό κείμενο
it: In testo semplice
ja: プレーンテキスト版
pl: Czystym tekstem
zh_hans: 纯文本形式

source: For offline reading, or just for convenience, you can read the Django documentation in plain text.
el: Για ανάγνωση χωρίς να είστε συνδεδεμένοι στο internet ή απλά για δική σας διευκόλυνση, μπορείτε να διαβάσετε το documentation του Django σε απλό κείμενο.
it: Per lettura offline, o anche solo per convenienza, puoi leggere la documentazione di Django in testo semplice.
ja: オフラインで読みたい人や手早く読みたい人のために、Django ドキュメントはプレーンテキスト形式でも読めます。
pl: Do czytania offline lub po prostu dla wygody, możesz czytać dokumentację Django „czystym tekstem”.
zh_hans: 离线阅读，或仅仅是为了方便，你可以阅读 Djano 文档的纯文本形式。

source: If you're using an official release of Django, note that the zipped package (tarball) of the code includes a ``docs/`` directory, which contains all the documentation for that release.
ja: Django の公式リリース版を使っているなら、ソースコードのアーカイブパッケージ (tarball) に docs/ ディレクトリが入っています。このディレクトリには各リリースの全てのドキュメントが入っています。
pl: Jeśli używasz oficjalnego wydania Django, zwróć uwagę, że zzipowany pakiet (tarball) kodu zawiera katalog ``docs/``, który zawiera z kolei całą dokumentację dla tego wydania.
zh_hans: 如果你正在使用的是 Django 的某个正式发布版，注意有一个代码压缩包，包含了 ``docs/`` 目录，内含这个版本的完整文档。

source: If you're using the development version of Django (aka "trunk"), note that the ``docs/`` directory contains all of the documentation. You can update your Git checkout to get the latest changes.
ja: Django の開発版 (別名 “trunk”) を使っている場合、``docs/`` ディレクトリに全てのドキュメントが入っています。最新版を取得したければ、Git checkout を実行してください。
pl: Jeśli używasz wersji deweloperskiej Django (vel „trunka”), zwróć uwagę, że katalog ``docs/`` zawiera całą dokumentację. Możesz zaktualizować swój gitowy checkout, aby pobrać ostatnie zmiany.
zh_hans: 如果你正在使用开发版的 Django （又名“trunk”），注意目录 ``docs/`` 包含所有的文档。你可以通过 git 获取最新的修改。

source: One low-tech way of taking advantage of the text documentation is by using the Unix ``grep`` utility to search for a phrase in all of the documentation. For example, this will show you each mention of the phrase "max_length" in any Django document:
el: Ένας low-level τρόπος να επωφεληθείτε από το documentation σε μορφή κειμένου είναι χρησιμοποιώντας την εντολή του Unix ``grep``. Η εντολή αυτή σας επιτρέπει να ψάξετε κάποια φράση σε ολόκληρο το documentation. Για παράδειγμα, η παρακάτω εντολή θα ψάξει σε κάθε άρθρο του documentation και θα σας δείξει όλες τις αναφορές σχετικά με τη λέξη "max_length":
it: Un modo a bassa tecnologia per trarre vantaggio dalla documentazione di testo è usare l'utility ``grep`` di Unix per cercare una frase in tutta la documentazione. Ad esempio, questo ti mostrerà ogni menzione della frase "max_length" in qualsiasi documento Django:
ja: テキストドキュメントの便利でローテクな使い方の一つに Unix の grep ユーティリティを使った全ドキュメント検索があります。例えば、以下のようにすれば、 “max_length” について触れている部分を表示できます:
pl: Jednym nisko-poziomowym sposobem na wykorzystanie testowej dokumentacji jest użycie uniksowego narzędzia ``grep`` do wyszukania frazy w całej dokumentacji. Na przykład to pokaże ci każdą wzmiankę frazy „max_length” w każdym dokumencie Django:
zh_hans: 一种没啥技术含量的利用纯文本文档的方式是使用 Unix 的 ``grep`` 工具在文档中全局中搜索一个短语。举个例子，接下来会向你展示 Django 文档中所有提到这个特定短语 "max_length" 的地方：

source: As HTML, locally
el: Στην HTML, τοπικά
it: Come HTML, in locale
ja: ローカルで HTML で読む
pl: Jako HTML, lokalnie
zh_hans: 以本地网页形式阅读
