Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: Many other things might go wrong with our application in the future, but we can be sure that we won't inadvertently reintroduce this bug, because running the test will warn us immediately. We can consider this little portion of the application pinned down safely forever.
it: Molte altre cose potrebbero andare storte con la nostra applicazione in futuro, ma possiamo essere sicuri che non reintrodurremo inavvertitamente questo specifico bug perché l'esecuzione del test ci avviserà immediatamente. Possiamo considerare questa piccola parte dell'applicazione bloccata in modo sicuro per sempre.

source: Again, ``polls`` is a minimal application, but however complex it grows in the future and whatever other code it interacts with, we now have some guarantee that the method we have written tests for will behave in expected ways.
it: Di nuovo, ``polls`` è una applicazione minimale ma a prescindere da quanto cresca in complessità o con quale codice interagisca, adesso abbiamo qualche garanzia che i metodi per cui abbiamo scritto test si comporteranno come ci aspettiamo.

source: When we fixed the bug above, we wrote the test first and then the code to fix it. In fact that was an example of test-driven development, but it doesn't really matter in which order we do the work.
it: Quando abbiamo corretto il bug sopra, abbiamo scritto prima il test e poi il codice per risolverlo. In effetti è stato un esempio di sviluppo basato sui test (TDD), ma non importa in quale ordine svolgiamo il lavoro.

source: We will start again with the :djadmin:`shell`, where we need to do a couple of things that won't be necessary in ``tests.py``. The first is to set up the test environment in the :djadmin:`shell`:
it: Cominciamo di nuovo con la :djadmin:`shell`, dove dobbiamo fare un paio di cose che non saranno necessarie in ``tests.py``. La prima è approntare l'ambiente di test nella :djadmin:`shell`:

source: Now you can satisfy yourself that this behaves as expected by firing up ``runserver``, loading the site in your browser, creating ``Questions`` with dates in the past and future, and checking that only those that have been published are listed. You don't want to have to do that *every single time you make any change that might affect this* - so let's also create a test, based on our :djadmin:`shell` session above.
it: Adesso puoi renderti orgoglioso del fatto che questo si comporti come ci si aspetta lanciando ``runserver``, caricando il sito nel browser, creando ``Questions`` le cui date sono passate e future e controllando che solo quelle pubblicate appaiano nella lista. Non lo vuoi fare *tutte le volte che cambi qualcosa che potrebbe aver ripercussioni su questo* - quindi creiamo anche un test, basato sulla nostra sessione :djadmin:`shell` di prima.

source: ``test_no_questions`` doesn't create any questions, but checks the message: "No polls are available." and verifies the ``latest_question_list`` is empty. Note that the :class:`django.test.TestCase` class provides some additional assertion methods. In these examples, we use :meth:`~django.test.SimpleTestCase.assertContains()` and :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.
it: ``test_no_questions`` non crea domande, ma controlla il messaggio: "Non ci sono sondaggi disponibili." e verifica che ``latest_question_list`` sia vuota. Nota che la classe :class:`django.test.TestCase` offre alcuni metodi di asserzioni aggiuntivi. In questi esempi, usiamo :meth:`~django.test.SimpleTestCase.assertContains()` e :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()`.
zh_hans: ``test_no_questions`` 方法里没有创建任何投票，它检查返回的网页上有没有 "No polls are available." 这段消息和 ``latest_question_list`` 是否为空。注意到 :class:`django.test.TestCase` 类提供了一些额外的 assertion 方法，在这个例子中，我们使用了 :meth:`~django.test.SimpleTestCase.assertContains()` 和 :meth:`~django.test.TransactionTestCase.assertQuerysetEqual()` 。

source: In ``test_past_question``, we create a question and verify that it appears in the list.
it: In ``test_past_question``, creiamo una domanda e verifichiamo che appaia nell'elenco.
zh_hans: 在 ``test_past_question`` 方法中，我们创建了一个投票并检查它是否出现在列表中。

source: In ``test_future_question``, we create a question with a ``pub_date`` in the future. The database is reset for each test method, so the first question is no longer there, and so again the index shouldn't have any questions in it.
it: In ``test_future_question``, creiamo una domanda con una ``pub_date`` nel futuro. Il database viene reimpostato per ogni metodo di test, quindi la prima domanda non c'è più e così, di nuovo, l'indice non dovrebbe mostrare nessuna domanda.
zh_hans: 在 ``test_future_question`` 中，我们创建 ``pub_date`` 在未来某天的投票。数据库会在每次调用测试方法前被重置，所以第一个投票已经没了，所以主页中应该没有任何投票。

source: We should then add some tests, to check that a ``Question`` whose ``pub_date`` is in the past can be displayed, and that one with a ``pub_date`` in the future is not:
it: Dovremmo quindi aggiungere alcuni test, per verificare che una ``Question`` la cui ``pub_date`` sia nel passato, possa essere visualizzata e quella con ``pub_date`` nel futuro non lo sia:

source: For small projects, this isn't a big deal, because you can keep the static files somewhere your web server can find it. However, in bigger projects -- especially those comprised of multiple apps -- dealing with the multiple sets of static files provided by each application starts to get tricky.
it: Per piccoli progetti, questo non è un grosso problema, perchè puoi tenere i file statici ovunque il tuo web server possa trovarli. Comunque, in progetti più grandi -- soprattutto in quelli co posti da molte app -- gestire più gruppi di file statici generati da ogni applicazione inizia a diventare complesso.

source: Within the ``static`` directory you have just created, create another directory called ``polls`` and within that create a file called ``style.css``. In other words, your stylesheet should be at ``polls/static/polls/style.css``. Because of how the ``AppDirectoriesFinder`` staticfile finder works, you can refer to this static file in Django as ``polls/style.css``, similar to how you reference the path for templates.
it: Dentro la directory ``static`` che hai appena creato, crea un'altra directory chiamata ``polls``, e dentro quest'ultima crea un file chiamato ``style.css``. In altre parole, il tuo foglio di stile dovrebbe essere in ``polls/static/polls/style.css``. Per come funziona ``AppDirectoriesFinder``, potrai riferirti a questo file statico in Django semplicemente come ``polls/style.css``, in modo analogo a come ti riferisci ai percorsi per i template.

source: Just like templates, we *might* be able to get away with putting our static files directly in ``polls/static`` (rather than creating another ``polls`` subdirectory), but it would actually be a bad idea. Django will choose the first static file it finds whose name matches, and if you had a static file with the same name in a *different* application, Django would be unable to distinguish between them. We need to be able to point Django at the right one, and the best way to ensure this is by *namespacing* them. That is, by putting those static files inside *another* directory named for the application itself.
it: Come per i template, *potremmo* semplicemente inserire i nostri file statici direttamente in ``polls/static`` (anziché creare un'altra sottodirectory ``polls``), ma sarebbe certamente una cattiva idea. Django sceglierà il primo file statico che troverà con un nome che corrisponde, e se tu avessi un file statico con lo stesso nome in una app *diversa*, Django non saprebbe come distinguere fra i due. Dobbiamo essere in grado di puntare Django sul file corretto, ed il modo migliore per farlo è quello di inserirlo in un *namespace*. Cioè, inserendo questi file statici dentro *un'altra* directory che abbia come nome il nome della app stessa.

source: That's all you need to do for development.
it: Questo è tutto quello che devi fare per lo sviluppare.

source: Start the server (or restart it if it's already running):
it: Avvia il server (o riavvialo se è già in esecuzione):

source: Reload ``http://localhost:8000/polls/`` and you should see that the question links are green (Django style!) which means that your stylesheet was properly loaded.
it: Ricarica ``http://localhost:8000/polls/`` e dovresti vedere che i link delle domande sono verdi ( stile Django! ) il che significa che il tuo foglio di stile è stato caricato correttamente.

source: Reload ``http://localhost:8000/polls/`` and you should see the background loaded in the top left of the screen.
it: Ricarica ``http://localhost:8000/polls/`` e dovresti vedere lo sfondo caricato in alto a sinistra dello schermo.
zh_hans: 浏览器重载 ``http://localhost:8000/polls/``，你将在屏幕的左上角见到这张背景图。

source: The ``{% static %}`` template tag is not available for use in static files which aren't generated by Django, like your stylesheet. You should always use **relative paths** to link your static files between each other, because then you can change :setting:`STATIC_URL` (used by the :ttag:`static` template tag to generate its URLs) without having to modify a bunch of paths in your static files as well.
it: Il template tag ``{% static %}`` non è disponibile per usarlo con file statici che non sono generati da Django, come i tuoi fogli di stile. Tu dovresti sempre usare i **percorsi relativi** per collegare i tuoi file statici tra loro, perchè poi puoi cambiare il :setting:`STATIC_URL` (usata da :ttag:`static` template tag per generare le sue URLs) senza dover modificare una serie di percorsi anche nei tuoi file statici

source: There are two ways to solve this problem. The first is to register ``Choice`` with the admin just as we did with ``Question``:
it: Esistono due modi per risolvere questo problema. Il primo è registrare ``Scelta`` nell'amministrazione proprio come abbiamo fatto con ``Domanda``:

source: At the end of the three current slots you will find an "Add another Choice" link. If you click on it, a new slot will be added. If you want to remove the added slot, you can click on the X to the top right of the added slot. This image shows an added slot:
it: Alla fine dei tre slot, troverai un link "Aggiungi un'altra Choice". Se ci clicchi, un nuovo slot viene aggiunto. Se vuoi rimuovere uno slot aggiunto, puoi cliccare sulla X in alto a destra dello slot aggiunto. Questa immagine mostra lo slot aggiunto:

source: One small problem, though. It takes a lot of screen space to display all the fields for entering related ``Choice`` objects. For that reason, Django offers a tabular way of displaying inline related objects. To use it, change the ``ChoiceInline`` declaration to read:
it: Un piccolo problema. Occupa molto spazio dello schermo mostrare tutti i campi per inserire i relativi oggetti ``Choice``. Per questo motivo, Django offre un modo tabellare per mostrare i relativi oggetti inline. Per usarlo, cambia la dichiarazione ``ChoiceInline`` per leggere:

source: For good measure, let's also include the ``was_published_recently()`` method from :doc:`Tutorial 2 </intro/tutorial02>`:
it: Di buona norma, aggiungiamo il metodo ``was_published_recently()`` da :doc:`Tutorial 2 </intro/tutorial02>`:

source: You can improve that by using the :func:`~django.contrib.admin.display` decorator on that method (in :file:`polls/models.py`), as follows:
it: Puoi migliorarlo usando il decoratore :func:`~django.contrib.admin.display` su quel metodo (in :file:`polls/models.py`), come segue:

source: For more information on the properties configurable via the decorator, see :attr:`~django.contrib.admin.ModelAdmin.list_display`.
it: Per più informazioni sulle proprietà configurabili attraverso il decoratore, vedi :attr:`~django.contrib.admin.ModelAdmin.list_display`.

source: You can change it, though, using Django's template system. The Django admin is powered by Django itself, and its interfaces use Django's own template system.
it: Puoi comunque cambiarlo, usando il sistema di template di Django. L'admin di Django è costruita su Django stesso, e dunque le sue interfacce usano il sistema di template di Django.

source: Just like the static files, we *could* have all our templates together, in one big templates directory, and it would work perfectly well. However, templates that belong to a particular application should be placed in that application's template directory (e.g. ``polls/templates``) rather than the project's (``templates``). We'll discuss in more detail in the :doc:`reusable apps tutorial </intro/reusable-apps>` *why* we do this.
it: Proprio come i file statici, *potremmo* avere tutti i nostri modelli insieme, in una grande directory di modelli, e funzionerebbe perfettamente. Tuttavia, i modelli che appartengono a una particolare applicazione dovrebbero essere collocati nella directory dei modelli dell'applicazione(es. ``polls/templates``) piuttosto che in quelli del progetto (``templates``). Discuteremo più in dettaglio nel :doc:`reusable apps tutorial </intro/reusable-apps>` *perché* lo facciamo.
zh_hans: 就像静态文件一样，我们 *可以* 把所有的模板文件放在一个大模板目录内，这样它也能工作的很好。但是，属于特定应用的模板文件最好放在应用所属的模板目录（例如 ``polls/templates``），而不是工程的模板目录（``templates``）。我们会在 :doc:`创建可复用的应用教程 </intro/reusable-apps>` 中讨论 *为什么* 我们要这样做。

source: Then, edit the file and replace ``{{ site_header|default:_('Django administration') }}`` (including the curly braces) with your own site's name as you see fit. You should end up with a section of code like:
it: Quindi, modifica il file e sostituisci ``{{ site_header|default:_('Django administration') }}`` (comprese le parentesi graffe) con il nome del tuo sito come meglio credi. Dovresti finire con una sezione di codice tipo:

source: Note that any of Django's default admin templates can be overridden. To override a template, do the same thing you did with ``base_site.html`` -- copy it from the default directory into your custom directory, and make changes.
it: Nota che qualsiasi template predefinito del pannello di amministrazione di Django può essere sovrascritto. Per sovrascrivere un template, fai la stessa cosa che hai fatto con ``base_site.html`` -- copialo dalla directory predefinita nella tua directory personalizzata e apporta le modifiche.

source: We've put a lot of effort into making Django's documentation useful, clear and as complete as possible. The rest of this document explains more about how the documentation works so that you can get the most out of it.
it: Ci siamo impegnati molto per rendere la documentazione di Django utile, chiara ed il più completa possibile. Il resto di questo documento spiega di più su come funziona la documentazione in modo che tu possa ottenere il massimo da essa.

source: Django's got a *lot* of documentation -- almost 450,000 words and counting -- so finding what you need can sometimes be tricky. A good place to start is the :ref:`genindex`. We also recommend using the builtin search feature.
it: Django ha *molta* documentazione - quasi 450.000 parole e il conteggio - quindi trovare ciò di cui hai bisogno a volte può essere complicato. Un buon punto di partenza è: :ref:`genindex`. Si consiglia inoltre di utilizzare la funzione di ricerca incorporata.

source: Finally, there's some "specialized" documentation not usually relevant to most developers. This includes the :doc:`release notes </releases/index>` and :doc:`internals documentation </internals/index>` for those who want to add code to Django itself, and a :doc:`few other things that don't fit elsewhere </misc/index>`.
it: Infine, c'è una documentazione "specialized" di solito non rilevante per la maggior parte degli sviluppatori. Ciò include :doc:`release notes </releases/index>` e :doc:`internals documentation </internals/index>` per coloro che vogliono aggiungere codice a Django stesso, e un :doc:` altre cose che non potevano andare altrove </misc/index>`.

source: Django's documentation is kept in the same source control system as its code. It lives in the :source:`docs` directory of our Git repository. Each document online is a separate text file in the repository.
it: La documentazione di Django è conservata nello stesso sistema di controllo del codice sorgente del suo codice. Si trova nella directory :source:`docs` del nostro repository Git. Ogni documento online è un file di testo separato nel repository.

source: The most recent version of the Django documentation lives at https://docs.djangoproject.com/en/dev/. These HTML pages are generated automatically from the text files in source control. That means they reflect the "latest and greatest" in Django -- they include the very latest corrections and additions, and they discuss the latest Django features, which may only be available to users of the Django development version. (See :ref:`differences-between-doc-versions` below.)
it: La versione più recente della documentazione di Django è disponibile su https://docs.djangoproject.com/en/dev/. Queste pagine HTML vengono generate automaticamente dai file di testo del codice sorgente. Ciò significa che riflettono le "ultime e migliori" di Django - includono le ultime correzioni e aggiunte, e discutono le ultime funzionalità di Django, che potrebbero essere disponibili solo per gli utenti della versione di sviluppo di Django. (Vedi: ref:`differences-between-doc-versions` di seguito.)

source: If you're using an official release of Django, the zipped package (tarball) of the code includes a ``docs/`` directory, which contains all the documentation for that release.
it: Se stai usando una versione ufficiale di Django, il pacchetto zippato (tarball) del codice include una directory ``docs/``, che contiene tutta la documentazione per quella versione.

source: If you're using the development version of Django (aka the main branch), the ``docs/`` directory contains all of the documentation. You can update your Git checkout to get the latest changes.
it: Se stai utilizzando la versione di sviluppo di Django (ovvero il ramo principale), la directory ``docs/`` contiene tutta la documentazione. Puoi aggiornare Git per ottenere le ultime modifiche.

source: You can get a local copy of the HTML documentation following a few steps:
it: È possibile ottenere una copia locale della documentazione HTML seguendo semplici passaggi:

source: Then, use the included ``Makefile`` to turn the documentation into HTML:
it: Quindi, usa il ``Makefile`` incluso per trasformare la documentazione in HTML:

source: The text documentation in the main branch of the Git repository contains the "latest and greatest" changes and additions. These changes include documentation of new features targeted for Django's next :term:`feature release <Feature release>`. For that reason, it's worth pointing out our policy to highlight recent changes and additions to Django.
it: La documentazione nel ramo ufficiale del repository Git contiene le migliori più recenti modifiche e aggiunte. Questi cambiamenti includono la documentazione di nuove caratteristiche che mirano alla :term`prossima versione di Django. <Feature release>` Per questa ragione, vale la pena sottolineare la nostra politica per evidenziare le modifiche e le aggiunte recenti a Django.

source: The development documentation at https://docs.djangoproject.com/en/dev/ is from the main branch. These docs correspond to the latest feature release, plus whatever features have been added/changed in the framework since then.
it: La documentazione di sviluppo su https://docs.djangoproject.com/en/dev/ proviene dal main branch. Questi documenti corrispondono all'ultima versione di funzionalità, oltre a tutte le funzionalità aggiunte / modificate nel framework da allora.

source: As we add features to Django's development version, we update the documentation in the same Git commit transaction.
it: Man mano che aggiungiamo funzionalità alla versione di sviluppo di Django, aggiorniamo la documentazione nella stessa transazione di commit Git.

source: To distinguish feature changes/additions in the docs, we use the phrase: "New in Django Development version" for the version of Django that hasn't been released yet, or "New in version X.Y" for released versions.
it: Per distinguere le modifiche/aggiunte di funzionalità nei documenti, usiamo la frase: "Nuovo nella versione di sviluppo di Django" per la versione di Django che non è stata ancora rilasciata, o "Nuovo nella versione X.Y" per le versioni rilasciate.

source: Documentation fixes and improvements may be backported to the last release branch, at the discretion of the committer, however, once a version of Django is :ref:`no longer supported<supported-versions-policy>`, that version of the docs won't get any further updates.
it: Correzioni e miglioramenti alla documentazione possono essere riportati nell'ultimo ramo di rilascio, a discrezione del committer, tuttavia, una volta che una versione di Django è :ref:`non più supportata<supported-versions-policy>`, quella versione della documentazione non riceverà ulteriori aggiornamenti.
zh_hans: 文档的修复和提升可能只会提交到最新的一个发布版本，这取决于提交者，然而，一旦一个 Django 的版本处于 :ref:`不在维护列表 <supported-versions-policy>` 中，这个版本对应的文档将不再更新。

source: The `main documentation Web page`_ includes links to documentation for previous versions. Be sure you are using the version of the docs corresponding to the version of Django you are using!
it: La `pagina Web della documentazione principale`_ include collegamenti alla documentazione per le versioni precedenti. Assicurati di utilizzare la versione dei documenti corrispondente alla versione di Django che stai utilizzando!

source: You can choose any name that you want for the branch, "ticket_24788" is an example. All changes made in this branch will be specific to the ticket and won't affect the main copy of the code that we cloned earlier.
zh_hans: 你可以选择任何名称来命名你的分支，"ticket_24788" 是一个例子。所有在这个分支的修改只会对特定的工单生效，不会影响我们之前克隆的主分支。

source: Now it's time to go through all the changes made in our patch. To display the differences between your current copy of Django (with your changes) and the revision that you initially checked out earlier in the tutorial:
zh_hans: 现在让我们检查一下补丁里作出的修改。为列出当前 Django 副本（包含你的修改）和先前教程中签出的初始版本间的差异：

source: After committing the patch, send it to your fork on GitHub (substitute "ticket_24788" with the name of your branch if it's different):
zh_hans: 提交补丁后，将它发送至你在 GitHub 上 fork 的仓库（用你的分支名替换 "ticket_24788"，如果你的分支名不是遵照教程）：

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://djangopackages.org>`_ for existing reusable apps you could incorporate in your project. Django itself is also just a Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
zh_hans: 可重用性是 Python 的生活方式。 `The Python Package Index (PyPI) <https://pypi.python.org/pypi>`_ 有许多允许你在自己的 Python 项目中使用的包。在 `Django Packages <https://djangopackages.org>`_ 中查找已发布的可重用应用，将你可以使用的并入你的项目。Django 本身也是一个 Python 包。 这意味着你可以将已存在的 Python 包或 Django 应用并入你的项目。你只需要确保项目包名的唯一性。

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/distributing/>`_.
zh_hans: 更多关于打包的信息，见 Python 的 `关于打包和发布项目的教程 <https://packaging.python.org/distributing/>`_。
