Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: The code above maps URL paths to Python callback functions ("views"). The path strings use parameter tags to "capture" values from the URLs. When a user requests a page, Django runs through each path, in order, and stops at the first one that matches the requested URL. (If none of them matches, Django calls a special-case 404 view.) This is blazingly fast, because the paths are compiled into regular expressions at load time.
it: Il codice qui sopra mappa i percorsi URL a funzioni Python ("views"). Le stringhe dei percorsi usano dei segnaposto per "catturare" valori dagli URL. Quando un utente visita una pagina, Django scorre tutti i percorsi, nell'ordine in cui sono definiti, e si ferma al primo che corrisponde al percorso richiesto. (Se nessuno di essi corrisponde, Django chiama una view "speciale" con un errore 404.) Questo procedimento è molto veloce, perché i percorsi sono compilati in espressioni regolari al momento del caricamento.
zh_hans: 上述代码将 URL 路径映射到了 Python 回调函数（“视图”）。路径字符串使用参数标签从URL中“捕获”相应值。当用户请求页面时，Django 依次遍历路径，直至初次匹配到了请求的 URL。(如果无匹配项，Django 会调用 404 视图。) 这个过程非常快，因为路径在加载时就编译成了正则表达式。

source: Once one of the URL patterns matches, Django calls the given view, which is a Python function. Each view gets passed a request object -- which contains request metadata -- and the values captured in the pattern.
it: Una volta che c'è corrispondenza con il pattern della URL, Django chiama la view corrispondente, il quale è una funzione Python. A ogni view viene passato un oggetto request - che contiene i metadati della richiesta - e i valori catturati nel pattern URL.
zh_hans: 一旦有 URL 路径匹配成功，Django 会调用相应的视图函数。每个视图函数会接受一个请求对象——包含请求元信息——以及在匹配式中获取的参数值。

source: For example, if a user requested the URL "/articles/2005/05/39323/", Django would call the function ``news.views.article_detail(request, year=2005, month=5, pk=39323)``.
it: Per esempio, se un utente richiedesse la URL "/articles/2005/05/39323/", Django chiamerebbe la funzione ``news.views.article_detail(request, year=2005, month=5, pk=39323)``.
zh_hans: 例如，当用户请求了这样的 URL "/articles/2005/05/39323/"，Django 会调用 ``news.views.article_detail(request, year=2005, month=5, pk=39323)``。

source: Simplistically, it defines the look-and-feel of the site (with the site's logo), and provides "holes" for child templates to fill. This means that a site redesign can be done by changing a single file -- the base template.
it: Semplicemente, definisce la grafica generale del sito (con il logo), e fornisce dei "buchi" da riempire da parte dei template figli. Questo significa che il sito può essere ridisegnato modificando un unico file -- il template di base.

source: It also lets you create multiple versions of a site, with different base templates, while reusing child templates. Django's creators have used this technique to create strikingly different mobile versions of sites by only creating a new base template.
it: Ti permette anche di creare versione multiple del sito, con template di base differenti mentre riutilizzi i template figlio. I creatori di Django hanno utilizzato questa tecnica per creare versioni per dispositivi mobile soprendentemente diversi giusto creando un nuovo base template.

source: A :doc:`syndication framework </ref/contrib/syndication>` that lets you create RSS and Atom feeds by writing a small Python class.
it: Un :doc:`framework per la syndication </ref/contrib/syndication>` che ti permette di creare feed RSS e Atom scrivendo una piccola classe Python.

source: More attractive automatically-generated admin features -- this overview barely scratched the surface.
it: Più attraenti funzionalità di amministrazione generate automaticamente -- questa panoramica ha appena scalfito la superficie.

source: The next steps are for you to `download Django`_, read :doc:`the tutorial </intro/tutorial01>` and join `the community`_. Thanks for your interest!
it: I prossimi passi per te sono `scaricare Django`_, leggere :doc:`the tutorial </intro/tutorial01>` e unirti alla` comunità`_. Grazie per il tuo interesse!

source: Reusability is the way of life in Python. `The Python Package Index (PyPI) <https://pypi.org/>`_ has a vast range of packages you can use in your own Python programs. Check out `Django Packages <https://djangopackages.org>`_ for existing reusable apps you could incorporate in your project. Django itself is also a normal Python package. This means that you can take existing Python packages or Django apps and compose them into your own web project. You only need to write the parts that make your project unique.
it: La riusabilità è uno stile di vita in Python. Il `Python Package Index (PyPI) <https://pypi.org/>` offre una vasta gamma di package che puoi usare nei tuoi programmi Python. Dai un'occhiata agli `Django Packages <https://djangopackages.org>`_ per trovare app riutilizzabili da incorporare nei tuoi progetti. Django stesso è un normale package. Questo significa che puoi prendere package Django esistenti o app Django e comporli nel tuo progetto web. Devi solo scrivere le parti che rendono il tuo progetto unico.

source: Let's say you were starting a new project that needed a polls app like the one we've been working on. How do you make this app reusable? Luckily, you're well on the way already. In :doc:`Tutorial 1 </intro/tutorial01>`, we saw how we could decouple polls from the project-level URLconf using an ``include``. In this tutorial, we'll take further steps to make the app easy to use in new projects and ready to publish for others to install and use.
it: Diciamo che tu stia iniziando un nuovo progetto che necessita di una applicazione di questionari come quella su cui abbiamo lavorato. Come rendi quest'app riutilizzabile? Fortunatamente, sei già un passo avanti. Nel :doc:`Tutorial 1 </intro/tutorial01>`, abbiamo detto come disaccoppiare polls dalla configurazione delle URL a livello di progetto usando ``include``. In questo tutorial, faremo altri passi per rendere l'app facilmente utilizzabile in progetti nuovi e pronta da pubblicare affinchè altri possano installarla ed usarla.

source: A Django *application* is a Python package that is specifically intended for use in a Django project. An application may use common Django conventions, such as having ``models``, ``tests``, ``urls``, and ``views`` submodules.
it: Un "applicazione" Django è un package Python che ha lo specifico scopo di essere usato in un progetto Django. Un' applicazione puo' useare convenzioni comuni di Django, come avere ``models``, ``tests``, ``urls``, e ``views`` sottomoduli.

source: Next we'll create ``setup.cfg`` and ``setup.py`` files which detail how to build and install the app. A full explanation of these files is beyond the scope of this tutorial, but the `setuptools documentation <https://setuptools.readthedocs.io/en/latest/>`_ has a good explanation. Create the files ``django-polls/setup.cfg`` and ``django-polls/setup.py`` with the following contents:
it: Poi creiamo i file ``setup.cfg`` e ``setup.py`` che dettagliano come costruire ed installare l'app. Una spiegazione approfondita di questi file è oltre lo scopo di questo tutorial, ma la `documentazione setuptools <https://setuptools.readthedocs.io/en/latest/>`_ offre una buona spiegazione. Crea i file ``django-polls/setup.cfg`` e ``django-polls/setup.py`` con i seguenti contenuti:

source: For more information on packaging, see Python's `Tutorial on Packaging and Distributing Projects <https://packaging.python.org/tutorials/packaging-projects/>`_.
it: Per ulteriori informazioni sul packaging, vedi il tutorial di Python `Tutorial sul Packaging e la Distribuzione di Progetti <https://packaging.python.org/tutorials/packaging-projects/>`_.

source: Note that per-user installations can still affect the behavior of system tools that run as that user, so using a virtual environment is a more robust solution (see below).
it: Nota che le installazioni "per utente" possono ancora avere effetto sul comportamento di quei tool di sistema che sono lanciati da quell'utente, quindi utilizzare un virtual environment è una soluzione più robusta (vedi sotto).

source: Post the package on a public repository, such as `the Python Package Index (PyPI)`_. `packaging.python.org <https://packaging.python.org>`_ has `a good tutorial <https://packaging.python.org/tutorials/packaging-projects/#uploading-the-distribution-archives>`_ for doing this.
it: Metti il package su un repository pubblico come il `Python Package Index (PyPI)`_. packaging.python.org <https://packaging.python.org>`_ offre un bel tutorial <https://packaging.python.org/tutorials/packaging-projects/#uploading-the-distribution-archives>`_ per farlo.

source: Installing Python packages with a virtual environment
it: Installazione di pacchetti Python con un ambiente virtuale

source: Typically, these situations only arise once you're maintaining several Django projects. When they do, the best solution is to use :doc:`venv <python:tutorial/venv>`. This tool allows you to maintain multiple isolated Python environments, each with its own copy of the libraries and package namespace.
it: Tipicamente, queste situazioni accadono quando manutieni svariati progetti Django. In questo caso, la miglior soluzione è usare :doc:`venv <python:tutorial/venv>`. Questo tool ti permette di mantenere più ambienti Python isolati, ognuno con la propria copia delle librerie ed un namespace proprio.

source: We'll assume you have :doc:`Django installed </intro/install>` already. You can tell Django is installed and which version by running the following command in a shell prompt (indicated by the $ prefix):
el: Υποθέτουμε ότι έχετε ήδη :doc:`εγκαταστήσει το Django </intro/install>` στον υπολογιστή σας. Μπορείτε να δείτε αν το Django έχει εγκατασταθεί (και αν ναι, ποια έκδοση διαθέτετε) πληκτρολογώντας στην κονσόλα (γραμμή εντολών):
it: Supponiamo che tu abbia già :doc:`Django installato </intro/install>`. Puoi dire che Django sia installato e quale versione sia eseguendo il seguente comando in un prompt della shell (indicato dal prefisso $):
zh_hans: 我们假定你已经阅读了 :doc:`安装 Django </intro/install>`。你能知道 Django 已被安装，且安装的是哪个版本，通过在命令提示行输入命令（由 $ 前缀）。

source: This tutorial is written for Django |version|, which supports Python 3.6 and later. If the Django version doesn't match, you can refer to the tutorial for your version of Django by using the version switcher at the bottom right corner of this page, or update Django to the newest version. If you're using an older version of Python, check :ref:`faq-python-version-support` to find a compatible version of Django.
it: Questo tutorial è scritto per Django |version|, che supporta Python 3.6 e successivi. Se la versione di Django non corrisponde, puoi consultare il tutorial per la tua versione di Django usando il selettore di versione nell'angolo in basso a destra della pagina, oppure aggiorna Django alla versione più recente. Se stai usando una versione più vecchia di Python, controlla :ref:`faq-python-version-support` per trovare una versione compatibile di Django.

source: If you're having trouble going through this tutorial, please head over to the :doc:`Getting Help</faq/help>` section of the FAQ.
it: Se hai difficoltà a completare questo tutorial, per favore vai alla sezione :doc:`Getting Help</faq/help>` delle FAQ.

source: The outer :file:`mysite/` root directory is a container for your project. Its name doesn't matter to Django; you can rename it to anything you like.
it: La directory principale :file:`mysite/` è un contenitore per il tuo progetto. Il suo nome non ha importanza per Django; puoi rinominarlo come preferisci.

source: :file:`mysite/asgi.py`: An entry-point for ASGI-compatible web servers to serve your project. See :doc:`/howto/deployment/asgi/index` for more details.
it: :file:`mysite/asgi.py`: Un punto di ingresso per i server web compatibili con ASGI per servire il tuo progetto. Vedi :doc:`/howto/deployment/asgi/index` per maggiori dettagli .

source: Now that the server's running, visit http://127.0.0.1:8000/ with your Web browser. You'll see a "Congratulations!" page, with a rocket taking off. It worked!
it: Ora che il server è attivo apri il tuo browser e vai su http://127.0.0.1:8000/. Troverai una pagina con scritto "Congratulations!" e un razzo che sta decollando. Ha funzionato!
zh_hans: 现在，服务器正在运行，浏览器访问 https://127.0.0.1:8000/。你将会看到一个“祝贺”页面，随着一只火箭发射，服务器已经运行了。

source: If you want to change the server's IP, pass it along with the port. For example, to listen on all available public IPs (which is useful if you are running Vagrant or want to show off your work on other computers on the network), use:
el: Αν θέλετε, επίσης, να αλλάξετε και την IP του server, εισάγετε τη νέα IP μαζί με την πόρτα. Για παράδειγμα, αν θέλετε ο server να ακούει σε όλες τις public IPs (χρήσιμο όταν χρησιμοποιείται το Vagrant ή όταν θέλετε να δείξετε τη δουλειά σας σε άλλους υπολογιστές στο δικό σας δίκτυο), χρησιμοποιήστε την ακόλουθη εντολή:
it: Se vuoi cambiare l'IP del server, passalo insieme alla porta. Ad esempio, per stare in ascolto su tutti gli IP pubblici disponibili (che è utile se stai eseguendo Vagrant o per mostrare il tuo lavoro su altri computer in rete), usa:
zh_hans: 如果你想要修改服务器监听的IP，在端口之前输入新的。比如，为了监听所有服务器的公开IP（这你运行 Vagrant 或想要向网络上的其它电脑展示你的成果时很有用），使用：

source: **0** is a shortcut for **0.0.0.0**. Full docs for the development server can be found in the :djadmin:`runserver` reference.
el: Το **0** είναι μια συντόμευση του **0.0.0.0**. Πλήρης τεκμηρίωση για τον development server μπορεί να βρεθεί στην αναφορά :djadmin:`runserver`.
it: **0** è una scorciatoia per **0.0.0.0**. La documentazione completa per il server di sviluppo può essere trovata in :djadmin:`runserver`.
zh_hans: **0** 是 **0.0.0.0** 的简写。完整的关于开发服务器的文档可以在 :djamdin:`runserver` 参考文档中找到。

source: What's the difference between a project and an app? An app is a Web application that does something -- e.g., a Weblog system, a database of public records or a small poll app. A project is a collection of configuration and apps for a particular website. A project can contain multiple apps. An app can be in multiple projects.
it: Qual è la differenza tra un progetto e un'app? Un'app è un'applicazione Web che fa qualcosa -- es: un sistema di Weblog, un database di record pubblici o una piccola app per sondaggi. Un progetto è una raccolta di configurazioni e app per un determinato sito Web. Un progetto può contenere più app. Un'app può essere in più progetti.

source: Your apps can live anywhere on your :ref:`Python path <tut-searchpath>`. In this tutorial, we'll create our poll app in the same directory as your :file:`manage.py` file so that it can be imported as its own top-level module, rather than a submodule of ``mysite``.
it: Le tue app possono vivere ovunque sul tuo :ref:`Python path <tut-searchpath>`. In questo tutorial, creeremo la nostra app di sondaggio nella stessa directory del file: :file:`manage.py` in modo che possa essere importato come modulo di primo livello, piuttosto che come sottomodulo di ``mysite``.

source: The next step is to point the root URLconf at the ``polls.urls`` module. In ``mysite/urls.py``, add an import for ``django.urls.include`` and insert an :func:`~django.urls.include` in the ``urlpatterns`` list, so you have:
it: Il passo successivo è puntare l'URLconf principale al modulo ``polls.urls``. In ``mysite/urls.py``, aggiungi un'importazione per ``django.urls.include`` e inserisci un :func:`~django.urls.include` nell'elenco ``urlpatterns``, in modo da avere:
zh_hans: 下一步是要在根 URLconf 文件中指定我们创建的 ``polls.urls`` 模块。在 ``mysite/urls.py`` 文件的 ``urlpatterns`` 列表里插入一个 :func:`~django.conf.urls.include`， 如下：

source: The :func:`~django.urls.include` function allows referencing other URLconfs. Whenever Django encounters :func:`~django.urls.include`, it chops off whatever part of the URL matched up to that point and sends the remaining string to the included URLconf for further processing.
it: La funzione :func:`~django.urls.include` permette di fare riferimento ad altre URLconf. Ogni volta che Django incontra :func:`~django.urls.include`, rimuove qualsiasi parte dell'URL combaciata fino a quel punto e invia la stringa rimanente alla URLconf inclusa per un'ulteriore elaborazione.
zh_hans: 函数 :func:`~django.urls.include` 允许引用其它 URLconfs。每当 Django 遇到 :func：`~django.urls.include` 时，它会截断与此项匹配的 URL 的部分，并将剩余的字符串发送到 URLconf 以供进一步处理。

source: The idea behind :func:`~django.urls.include` is to make it easy to plug-and-play URLs. Since polls are in their own URLconf (``polls/urls.py``), they can be placed under "/polls/", or under "/fun_polls/", or under "/content/polls/", or any other path root, and the app will still work.
it: L'idea alla base di :func:`~django.urls.include` è di semplificare il plug-and-play deglle URL. Poiché i sondaggi si trovano nella propria URLconf (``polls/urls.py``), possono essere posizionati dentro "/polls/", o dentro "/fun_polls/", o dentro "/content/polls/", o qualsiasi altro percorso e l'app continuerà a funzionare.
zh_hans: 我们设计 :func:`~django.urls.include` 的理念是使其可以即插即用。因为投票应用有它自己的 URLconf( ``polls/urls.py`` )，他们能够被放在 "/polls/" ， "/fun_polls/" ，"/content/polls/"，或者其他任何路径下，这个应用都能够正常工作。

source: When to use :func:`~django.urls.include()`
it: Quando usare :func:`~django.urls.include()`
zh_hans: 何时使用 :func:`~django.urls.include()`

source: You have now wired an ``index`` view into the URLconf. Verify it's working with the following command:
it: Ora hai collegato una vista ``index`` nella URLconf. Verifica che funzioni con il seguente comando:

source: Page not found?
it: Non hai trovato la pagina?

source: If you get an error page here, check that you're going to http://localhost:8000/polls/ and not http://localhost:8000/.
it: Se ottieni una pagina di errore, controlla di stare andando su http://localhost:8000/polls/ e non http://localhost:8000/.

source: The :func:`~django.urls.path` function is passed four arguments, two required: ``route`` and ``view``, and two optional: ``kwargs``, and ``name``. At this point, it's worth reviewing what these arguments are for.
it: Alla funzione :func:`~django.urls.path` vengono passati quattro argomenti, due obbligatori: ``route`` e ``view`` e due opzionali: `kwargs``, and ``name``. A questo punto, vale la pena rivedere a cosa servono questi argomenti.
zh_hans: 函数 :func:`~django.urls.path` 具有四个参数，两个必须参数：``route`` 和 ``view``，两个可选参数：``kwargs`` 和 ``name``。现在，是时候来研究这些参数的含义了。

source: :func:`~django.urls.path` argument: ``route``
it: Argomento di :func:`~django.urls.path`: ``route``
zh_hans: :func:`~django.urls.path` 参数： ``route``

source: ``route`` is a string that contains a URL pattern. When processing a request, Django starts at the first pattern in ``urlpatterns`` and makes its way down the list, comparing the requested URL against each pattern until it finds one that matches.
it: ``route`` è una stringa che contiene un schema di URL. Durante l'elaborazione di una richiesta, Django inizia dal primo schema in ``urlpatterns`` e si fa strada lungo l'elenco, confrontando la URL richiesta con ogni schema fino a quando non trova quello corrispondente.
zh_hans: ``route`` 是一个匹配 URL 的准则（类似正则表达式）。当 Django 响应一个请求时，它会从 ``urlpatterns`` 的第一项开始，按顺序依次匹配列表中的项，直到找到匹配的项。

source: Patterns don't search GET and POST parameters, or the domain name. For example, in a request to ``https://www.example.com/myapp/``, the URLconf will look for ``myapp/``. In a request to ``https://www.example.com/myapp/?page=3``, the URLconf will also look for ``myapp/``.
it: I pattern non cercano i parametri GET e POST o il nome di dominio. Ad esempio, in una richiesta a ``https://www.example.com/myapp/``, URLconf cercherà ``myapp/``. In una richiesta a `https://www.example.com/myapp/?page=3``, URLconf cercherà anche ``myapp/``.
zh_hans: 这些准则不会匹配 GET 和 POST 参数或域名。例如，URLconf 在处理请求 ``https://www.example.com/myapp/`` 时，它会尝试匹配 ``myapp/`` 。处理请求 ``https://www.example.com/myapp/?page=3`` 时，也只会尝试匹配 ``myapp/``。

source: :func:`~django.urls.path` argument: ``view``
it: Argomento di :func:`~django.urls.path`: ``view``
zh_hans: :func:`~django.urls.path` 参数： ``view``

source: When Django finds a matching pattern, it calls the specified view function with an :class:`~django.http.HttpRequest` object as the first argument and any "captured" values from the route as keyword arguments. We'll give an example of this in a bit.
it: Quando Django trova uno schema di corrispondente, chiama la funzione di visualizzazione specificata con un oggetto di tipo :class:`~django.http.HttpRequest` come primo argomento e qualsiasi valore "catturato" dal percorso come argomenti chiave. Ne faremo un esempio tra poco.
zh_hans: 当 Django 找到了一个匹配的准则，就会调用这个特定的视图函数，并传入一个 :class:`~django.http.HttpRequest` 对象作为第一个参数，被“捕获”的参数以关键字参数的形式传入。稍后，我们会给出一个例子。

source: :func:`~django.urls.path` argument: ``kwargs``
it: Argomento di :func:`~django.urls.path`: ``kwargs``
zh_hans: :func:`~django.urls.path` 参数： ``kwargs``

source: :func:`~django.urls.path` argument: ``name``
it: Argomento di :func:`~django.urls.path`: ``name``
zh_hans: :func:`~django.urls.path` 参数： ``name``

source: :setting:`NAME` -- The name of your database. If you're using SQLite, the database will be a file on your computer; in that case, :setting:`NAME` should be the full absolute path, including filename, of that file. The default value, ``BASE_DIR / 'db.sqlite3'``, will store the file in your project directory.
it: :setting:`NAME` -- Il nome del tuo database. Se stai usando SQLite, il database sarà un file sul tuo computer; in quel caso, :setting:`NAME` dovrebbe essere il percorso assoluto completo, incluso il nome del file, di quel file. Il valore predefinito, ``BASE_DIR / 'db.sqlite3'``, memorizzerà il file nella directory del progetto.

source: The :djadmin:`migrate` command looks at the :setting:`INSTALLED_APPS` setting and creates any necessary database tables according to the database settings in your :file:`mysite/settings.py` file and the database migrations shipped with the app (we'll cover those later). You'll see a message for each migration it applies. If you're interested, run the command-line client for your database and type ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MariaDB, MySQL), ``.schema`` (SQLite), or ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) to display the tables Django created.
it: Il comando :djadmin:`migrate` esamina l'impostazione :setting:`INSTALLED_APPS` e crea tutte le tabelle del database necessarie in base alle impostazioni del database nel file :file:`mysite/settings.py` e le migrazioni del database fornite con l'app (li tratteremo più avanti). Vedrai un messaggio per ogni migrazione applicata. Se sei interessato, esegui il client per il tuo database nella riga di comando e digita ``\dt`` (PostgreSQL), ``SHOW TABLES;`` (MariaDB, MySQL), ``.schema`` (SQLite), or ``SELECT TABLE_NAME FROM USER_TABLES;`` (Oracle) per visualizzare le tabelle create da Django

source: This includes the migrations - unlike in Ruby On Rails, for example, migrations are entirely derived from your models file, and are essentially a history that Django can roll through to update your database schema to match your current models.
it: Ciò include le migrazioni: a differenza di Ruby On Rails, ad esempio, le migrazioni sono interamente derivate dal file dei modelli e sono essenzialmente una cronologia che Django può eseguire per aggiornare lo schema del database in modo che corrisponda ai modelli attuali.
