Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/intro.po
Languages: el, it, ja, pl, zh_hans

source: After those, if you're still hungry for more information about contributing, you can always browse through the rest of :doc:`Django's documentation on contributing</internals/contributing/index>`. It contains a ton of useful information and should be your first source for answering any questions you might have.
el: Κατόπιν των ανωτέρω, αν θέλετε να μάθετε ακόμη περισσότερα σχετικά με την συνεισφορά, μπορείτε πάντα να ανατρέχετε στην ενότητα του εγχειρίδίου :doc:`του Django σχετικά με την συνεισφορά </internals/contributing/index>`. Περιέχει τόνους πληροφορίας και θα πρέπει να είναι η πρώτη πηγή που θα κοιτάξετε για τυχόν ερωτήσεις ή απορίες που μπορεί να προκύψουν.
it: Dopo questi, se sei ancora in cerca di altre informazioni sul contribuire, puoi sempre cercare nel resto della :doc:'documentazione di Django sul contribuire</internals/contributing/index>'. Contiene molte informazioni utili e dovrebbe essere la tua prima fonte di informazione per rispondere alle domande che potresti avere.
ja: 貢献について､より多くの情報を知りたいなら､ :doc:`貢献についての Django のドキュメント </internals/contributing/index>` を参照してください｡そこにはたくさん有用な情報がありまし､質問があれば､このドキュメントが1番役に立ちます｡
pl: Dalej, jeśli wciąż jesteś głodny informacji o współtworzeniu, zawsze możesz przejrzeć resztę :doc:`dokumentacji Django na temat współtorzenia</internals/contributing/index>`. Zawiera tonę przydatnych informacji i powinna być twoim pierwszym źródłem, odpowiadającym na każde pytanie, które możesz mieć.
zh_hans: 接下来，如果你渴望更多关于为 Django 做贡献的信息，可以阅读余下的文档 :doc:`为 Django 文档上作出贡献</internals/contributing/index>`。它包含了大量的有用信息，这里可以解决你可能遇到的所有问题。

source: Finding your first real ticket
el: Εύρεση του πρώτου αληθινού ticket
it: Cercare il tuo primo vero ticket
ja: 実際にチケットを探してみましょう
pl: Znajdowanie twojego pierwszego prawdziwego zgłoszenia
zh_hans: 寻找你的第一个真正意义上的工单

source: Once you've looked through some of that information, you'll be ready to go out and find a ticket of your own to write a patch for. Pay special attention to tickets with the "easy pickings" criterion. These tickets are often much simpler in nature and are great for first time contributors. Once you're familiar with contributing to Django, you can move on to writing patches for more difficult and complicated tickets.
el: Αφού διαβάσατε και κατανοήσατε τη λογική των patches και των συνεισφορών, πιθανόν να είστε έτοιμοι να αναζητήσετε κάποιο ticket προκειμένου να γράψετε το κατάλληλο patch. Δώστε μεγάλη προσοχή στα tickets με το κριτήριο "easy pickings". Αυτού του είδους τα tickets είναι αρκετά απλά στη φύση τους (όπως απλό ήταν και αυτό που γράψαμε σε αυτόν τον οδηγό) και είναι κομμένα και ραμμένα στα μέτρα των νέων προγραμματιστών που θέλουν να συνεισφέρουν. Όταν εξοικειωθείτε με την συνεισφορά στο Django, μπορείτε να συνεχίσετε και να γράφετε patches και για πιο δύσκολα-περίπλοκα tickets. Η λογική είναι να ξεκινήσετε την επίλυση απλών tickets και σιγά σιγά να επιλύετε ακόμη πιο δύσκολα. Αν πάλι θέλετε να παραμείνετε στην επίλυση απλών tickets κανένα πρόβλημα.
it: Dopo che avrai letto la documentazione riportata sopra, sarai pronto per andare a cercare un ticket per cui scrivere una patch. Presta particolare attenzione ai ticket indicati con il flag "easy pickings". Questi ticket di solito sono di semplice risoluzione e sono perfetti per i tuoi primi contributi. Quando avrai acquisito familiarità con le procedure per contribuire a Django, potrai passare a scrivere patch per ticket più complicati.
ja: ドキュメントをたくさん読んだ後は､実際のパッチを書けるのでチケットを探してみましょう｡ "easy picking" タグが付いたチケットを見つけてください｡このチケットは大抵はより簡単なものなので､初めての貢献者には適切でしょう｡ Django への貢献に慣れてきたあとは､難しく､複雑なチケットを書き始めれるでしょう｡
pl: Kiedy już przejrzałeś trochę z tych informacji, będziesz gotowy iść i znaleźć zgłoszenie, do którego napiszesz patcha. Zwróć szczególną uwagę na zgłoszenia z kryterium „easy pickings”. Te zgłoszenia często są z natury dużo prostsze i są świetne dla pierwszorazowych kontrybutorów. Gdy już będziesz zaznajomiony z wnoszeniem wkładu w Django, możesz iść dalej i pisać patche do trudniejszych i bardziej skomplikowanych zgłoszeń.
zh_hans: 一旦你看过了之前那些信息，你便已经具备了走出困境，编写修复自己找到的工单的补丁的能力。对于那些有着“容易获得”标准的工单要尤其注意。这些工单实际上常常很简单而且对于第一次撰写补丁的人很有帮助。一旦你熟悉了给 Django 写补丁，你就可以进一步为更难且更复杂的工单写补丁。

source: If you just want to get started already (and nobody would blame you!), try taking a look at the list of `easy tickets that need patches`__ and the `easy tickets that have patches which need improvement`__. If you're familiar with writing tests, you can also look at the list of `easy tickets that need tests`__. Just remember to follow the guidelines about claiming tickets that were mentioned in the link to Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
el: Αν θέλετε να ξεκινήσετε άμεσα (και κανείς δε πρόκειται να σας κατηγορήσει γι' αυτό!), ρίξτε μια ματιά στη λίστα των `easy tickets που χρειάζονται patches`__ και στα `easy tickets που έχουν patches αλλά χρειάζονται βελτίωση`__. Αν έχετε εξοικειωθεί με την συγγραφή τεστ, μπορείτε επίσης να κοιτάξετε τη λίστα των `easy tickets που χρειάζονται τεστ`__. Θυμηθείτε μόνο τις κατευθηντήριες γραμμές (guidelines) σχετικά με την διεκδίκηση tickets οι οποίες αναφέρθηκαν στον σύνδεσμο του εγχειρίδίου του Django σχετικά με την :doc:` κατάθεση patches και διεκδίκηση tickets </internals/contributing/writing-code/submitting-patches>`.
ja: 今すぐ始めたいなら (責める人はいません！)、 `パッチが必要な簡単なチケット`__ か `パッチに改善が必要な簡単なチケット`__ を見つけましょう。テストを書きなれているなら `テストが必要な簡単なチケット`__ でもよいでしょう。ただ、チケットのクレームに関するガイドラインに従ってください。 Django ドキュメントの :doc:`チケットをクレームしてパッチを送る </internals/contributing/writing-code/submitting-patches>` で記述されています。
pl: Jeśli po prostu już chcesz zacząć (nikt nie będzie cię winił!), spróbuj rzucić okiem na listę `łatwych zgłoszeń, które potrzebują patchy`__ i `łatwych zgłoszeń, które mają patche potrzebujące poprawy`__. Jeśli umiesz pisać testy, możesz też spojrzeć na listę `łatwych zgłoszeń, które potrzebują testów`__. Pamiętaj tylko przestrzegać wskazówek dotyczących przypisywania zgłoszeń, o czym było wspomniane w odnośniku do dokumentacji Django na temat :doc:`przypisywania zgłoszeń i wgrywaniu patchy </internals/contributing/writing-code/submitting-patches>`.
zh_hans: 如果你只是想要简单的了解（没人会因此责备你！），那么你可以试着看看 `easy tickets that need patches`__ 和 `easy tickets that have patches which need improvement`__。如果你比较擅长写测试，那么你也可以看看这个 `easy tickets that need tests`__。一定要记得遵循在 Django 的文档声明标签和递交补丁中提到的关于声明标签的指导规则 :doc:`声明标签和提交补丁 </internals/contributing/writing-code/submitting-patches>`.

source: What's next?
el: Επόμενα βήματα
it: Cos'altro?
ja: 次は何をしましょうか？
pl: Co następnie?
zh_hans: 接下来要做什么？

source: After a ticket has a patch, it needs to be reviewed by a second set of eyes. After uploading a patch or submitting a pull request, be sure to update the ticket metadata by setting the flags on the ticket to say "has patch", "doesn't need tests", etc, so others can find it for review. Contributing doesn't necessarily always mean writing a patch from scratch. Reviewing existing patches is also a very helpful contribution. See :doc:`/internals/contributing/triaging-tickets` for details.
ja: チケットにパッチが追加されたあとは、別の人間の目でレビューされる必要があります。パッチをアップロードしたりプルリクエストを送信したあとは、チケットのメタデータから "has patch" フラグを設定してください。 "doesn't need tests" や、その他のメタデータはレビューのためにあります。貢献する際にはいつもスクラッチからパッチを書くというわけではありません。既存のパッチをレビューすることをまた素晴らしく役に立つ貢献です。詳細は :doc:`/internals/contributing/triaging-tickets` を参照してください。
pl: Po tym, jak zgłoszenie ma patcha, potrzebuje być przejrzane przez drugą parę oczu. Po wgraniu patcha lub wysłaniu pull requesta, koniecznie zaktualizuj dane zgłoszenia ustawiając przy nim flagi mówiące „has patch”, „doesn't need tests”, i tak dalej, aby inni mogli odnaleźć zgłoszenie jako do przejrzenia. Współtworzenie Django niekoniecznie zawsze znaczy pisanie patcha od zera. Przeglądanie istniejących patchy też jest bardzo pomocnym wkładem. Zobacz więcej na :doc:`/internals/contributing/triaging-tickets`.

source: Getting started
el: Ξεκινώντας
it: Come iniziare
ja: さぁ始めましょう。
pl: Pierwsze kroki
zh_hans: 开始

source: New to Django? Or to Web development in general? Well, you came to the right place: read this material to quickly get up and running.
el: Είστε καινούργιοι στο Django ή γενικά στο Web development; Κανένα πρόβλημα. Ήλθατε στο κατάλληλο μέρος: διαβάστε το παρακάτω υλικό για να ξεκινήσετε σωστά και γρήγορα.
it: Nuovo su Django? O con lo sviluppo Web in generale? Bene, sei arrivato nel posto giusto: leggi questo materiale per iniziare subito a lavorare.
ja: Django は初めてですか? もしくは Web 開発全般で? なら、ここに来て正解ですね。ここにあるドキュメントを読んで、行動に移してみましょう。
pl: Nowy w Django? Lub w ogólności w web dewelopmencie? A więc dotarłeś we właściwe miejsce: przeczytaj ten materiał aby szybko zacząć działać.
zh_hans: 初识 Django？或为了 Web 开发？好，那你来对地方了：看看这些资料快速上手。

source: If you're new to Python_, you might want to start by getting an idea of what the language is like. Django is 100% Python, so if you've got minimal comfort with Python you'll probably get a lot more out of Django.
el: Αν είστε νέος/νέα στην γλώσσα προγραμματισμού Python_, ίσως να θέλετε να ξεκινήσετε γνωρίζοντας τη συγκεκριμένη γλώσσα. Το Django είναι γραμμένο σε 100% Python, που σημαίνει ότι αν έχετε τις βασικές γνώσεις πάνω στην Python θα μπορείτε, ενδεχομένως, να επωφεληθείτε τα μέγιστα του Django.
it: Se non conosci Python_, potresti voler cominciare con un'idea di com'è il linguaggio. Django è 100% Python, quindi se ti trovi minimamente bene con Python, probabilmente otterrai molto di più da Django.
ja: Python_ の初心者なら、まず Python がどんなものかを知ることから始めましょう。 Django は 100% Python です。 ほんの最小限 Python を理解するだけで Django をより深く理解できます。
pl: Jeśli Python_ jest dla ciebie nowy, możesz chcieć zacząć od dowiedzenia się co to za język. Django jest pythonowe w 100%, więc jeśli czujesz się minimalnie dobrze z Pythonem, prawdopodobnie wyciągniesz więcej z Django.
zh_hans: 如果你初次了解 Python_，可能想知道它是怎样一门语言。Django 是 100% 由 Python 编写的，所以熟悉 Python 可以加深对 Django 的理解。

source: If you're new to programming entirely, you might want to start with this `list of Python resources for non-programmers`_
el: Από την άλλη, αν είστε νέος/νέα στον προγραμματισμό γενικά, ίσως να θέλετε να ξεκινήσετε με τη `λίστα πηγών σχετικά με την Python για μη προγραμματιστές`_
it: Se sei nuovo riguardo lo sviluppo in generale, tu potresti iniziare con questo `list of Python resources for non-programmers`_
ja: プログラミング全般の初心者なら、 `非プログラマのための Python リソース一覧`_ から始めてみるとよいでしょう。
pl: Jeśli jesteś całkowicie nowy w programowaniu, może zechcesz spróbować rozpocząć z tą `listą pythonowych zasobów dla nie-programistów`_
zh_hans: 如果你毫无编程经验，可能需要从 `适合零编程经验者的 Python 学习资源`_起步

source: If you already know a few other languages and want to get up to speed with Python quickly, we recommend `Dive Into Python`_. If that's not quite your style, there are many other `books about Python`_.
el: Αν γνωρίζετε άλλες γλώσσες προγραμματισμού και θέλετε να μεταβείτε στην Python γρήγορα, προτείνουμε το εξαιρετικό βιβλίο `Dive Into Python`_. Αν αυτό δεν σας καλύπτει, υπάρχει πληθώρα άλλων `βιβλίων σχετικά με την Python`_.
it: Se conosci già altri linguaggi e vuoi iniziare rapidamente con Python, raccomandiamo `Dive Into Python`_. Se non è consono al tuo stile, ci sono molti altri `libri su Python`_.
ja: すでに幾つかの他の言語を知っていて、Python についての情報を素早く取得したい場合は、`Dive Into Python`_ をお勧めします。もしこれがあなたに合っていない場合は、多くの `Python についての本` があります。
pl: Jeśli już znasz parę innych języków i chcesz szybko nabrać prędkości w Pythonie, polecamy `Dive into Python`_. Jeśli nie jest to całkiem twój styl, jest wiele innych `książek o Pythonie`_.
zh_hans: 如果你已经了解过一门其他的编程语言，并且向快速上手Python，我们向你推荐 `Dive Into Python`_。如果不太适合你的话，还有其它很多 `books about Python`_。

source: Quick install guide
el: Οδηγός γρήγορης εγκατάστασης
it: Guida rapida di installazione
ja: クイックインストールガイド
pl: Przewodnik szybkiej instalacji
zh_hans: 快速安装指南

source: Before you can use Django, you'll need to get it installed. We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
el: Πριν χρησιμοποιήσετε το Django, θα χρειαστεί να το κατεβάσετε και να το εγκαταστήσετε. Έχουμε έναν :doc:`πλήρη οδηγό εγκατάστασης </topics/install>` ο οποίος καλύπτει όλες τις δυνατές περιπτώσεις. Θα σας καθοδηγήσει σε μια απλή και τυπική εγκατάσταση πάνω στην οποία θα δουλέψετε για αυτό το tutorial.
ja: Django を使う前に、インストールをする必要があります。 Django にはできることをすべてカバーした :doc:`インストールガイド </topics/install>` があります。これはシンプルでミニマルなインストールガイドで、 Django の導入部分までが説明されています。
pl: Zanim będziesz mógł używać Django, potrzebujesz mieć je zainstalowane. Mamy :doc:`kompletny przewodnik instalacji </topics/install>`, który omawia wszystkie możliwości; ten przewodnik przeprowadzi cię przez prostą, minimalną instalację, która będzie działać podczas przechodzenia przez wprowadzenie.
zh_hans: 开始用 Django 前，需要先进行安装。我们写了 :doc:`complete installation guide </topics/install>` 罗列了各种安装方法；它会指导你完成最小，快速安装。

source: Install Python
el: Εγκατάσταση Python
it: Installa Python
ja: Python をインストールする
pl: Instalacja Pythona
zh_hans: 安装 Python

source: Being a Python Web framework, Django requires Python. See :ref:`faq-python-version-support` for details. Python includes a lightweight database called SQLite_ so you won't need to set up a database just yet.
el: Όντας ένα Python Web framework, το Django απαιτεί να είναι εγκατεστημένη η γλώσσα προγραμματισμού Python. Δείτε στο :ref:`Ποια έκδοση Python να διαλέξω για το Django <faq-python-version-support>` για λεπτομέρειες. Η Python περιέχει μια ελαφριά έκδοση της βάσης δεδομένων SQLite_, που σημαίνει ότι δεν θα χρειαστεί να ρυθμίσετε (σετάρετε) κάποια βάση δεδομένων ακόμα.
it: Essendo un Framework Web Python, Django richiede Python. Vedi :ref:`faq-python-version-support` per i dettagli. Python include un database leggero chiamato SQLite_ e di conseguenza non avrai ancora bisogno di approntare un database.
ja: Python の W​​eb フレームワークなので、DjangoはPythonを必要になります。詳細については、:ref:`faq-python-version-support` を見てください。 Python には SQLite_ という軽量のデータベースが含まれているので、データベースを設定する必要はまだありません。
pl: Będąc pythonowym web-frameworkiem, Django wymaga Pythona. Sprawdź szczegóły w :ref:`faq-python-version-support`. Python zawiera małoważącą bazę danych nazywaną SQLite_, więc nie będziesz teraz potrzebował stawiać bazy danych.
zh_hans: 作为一个 Python Web 框架，Django 需要 Python。更多细节请参见 :ref:`faq-python-version-support`。Python 包含了一个名为 SQLite_ 的轻量级数据库，所以你暂时不必自行设置一个数据库。

source: Get the latest version of Python at https://www.python.org/download/ or with your operating system's package manager.
ja: https://www.python.org/download/ または、OS のパッケージマネージャで Python の最新バージョンを入手してください。
pl: Pobierz najnowszą wersję Pythona z https://www.python.org/download/ lub przez menadżer pakietów twojego systemu operacyjnego.

source: If you use Jython_ (a Python implementation for the Java platform), you'll need to follow a few additional steps. See :doc:`/howto/jython` for details.
ja: もし Jython_ (Python のJava プラットフォーム実装) を使っている場合は、いくつか追加のステップを実行する必要があります。詳細は :doc:`/howto/jython` を見てください。
pl: Jeśli używasz Jythona_ (implementację Pythona dla platformy Java), będziesz musiał wykonać kilka dodatkowych kroków. Szczegóły w :doc:`/howto/jython`.

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
el: Μπορείτε να ελέγξετε αν η Python εγκαταστάθηκε σωστά, πληκτρολογώντας ``python`` μέσα από την κονσόλα (γραμμή εντολών). Θα δείτε κάτι σαν αυτό::
it: Puoi verificare che Python è installato scrivendo "python" nella shell; dovresti vedere qualcosa come::
ja: Python がインストールされてるかを確かめるには ``python`` とシェルでタイプします。このように表示されるはずです::
pl: Możesz zweryfikować czy Python jest zainstalowany wpisując ``python`` w linię komend powłoki; powinieneś zobaczyć coś w tym stylu::
zh_hans: 你可以在你的 shell 中输入 ``python`` 来确定你是否安装过 Python；你看到的可能是像这样子的::

source: Set up a database
el: Ρύθμιση βάσης δεδομένων
it: Crea un database
ja: データベースを設定する
pl: Skonfiguruj połączenie z bazą danych
zh_hans: 设置数据库

source: This step is only necessary if you'd like to work with a "large" database engine like PostgreSQL, MySQL, or Oracle. To install such a database, consult the :ref:`database installation information <database-installation>`.
el: Αυτό το βήμα χρειάζεται μόνο αν επρόκειτο να εργαστείτε πάνω σε “μεγάλη” μηχανή βάσης δεδομένων (database engine) όπως είναι οι PostgreSQL, MySQL, ή Oracle. Για την εγκατάσταση τέτοιου είδους βάσης δεδομένων, συμβουλευτείτε τις :ref:`πληροφορίες εγκατάστασης βάσης δεδομένων <database-installation>`.
ja: このステップはあなたが "大きな" データベースエンジン、 PostgreSQL 、 MySQL や Oracle を使っている場合に必要です。これらのデータベースをインストールするには、 :ref:`データベースのインストール方法 <database-installation>` を参照してください。
pl: Ten krok jest niezbędny tylko jeśli chciałbyś pracować z „dużym” silnikiem bazodanowym jak PostgreSQL, MySQL lub Oracle. Aby zainstalować taką bazę danych, sprawdź :ref:`informacje na temat instalacji bazy danych <database-installation>`.
zh_hans: 此步骤仅在你打算使用诸如 PostgreSQL, MySQL, 或者 Oracle 这些大型数据库引擎时需要。要安装这种数据库, 请参考 :ref:`database installation information <database-installation>`。

source: Remove any old versions of Django
ja: 古いバージョンの Django を削除する
pl: Usuń wszystkie stare wersje Django
zh_hans: 移除任何老版本的 Django

source: If you are upgrading your installation of Django from a previous version, you will need to :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`.
ja: 前バージョンの Django をアップグレードするには、 :ref:`新しい Django をインストールする前に、古いバージョンの Django をアンインストールする <removing-old-versions-of-django>` 必要があります。
pl: Jeśli upgrade'ujesz swoją instalację Django z wcześniejszej wersji, będziesz potrzebował :ref:`odinstalować starą wersję Django przed instalacją nowej wersji <removing-old-versions-of-django>`.
zh_hans: 如果你打算从前一版本的 Django 升级，, 你将需要 :ref:`uninstall the old Django version before installing the new version <removing-old-versions-of-django>`。

source: Install Django
el: Εγκατάσταση Django
it: Installa Django
ja: Django をインストールする
pl: Instaluj Django
zh_hans: 安装 Django

source: You've got three easy options to install Django:
el: Υπάρχουν τρεις εύκολοι τρόποι εγκατάστασης του Django:
ja: Django をインストールするには 3 つの方法があります:
pl: Są trzy proste sposoby na zainstalowanie Django:
zh_hans: 你有三个简单的方法来安装 Django：

source: Install a version of Django :doc:`provided by your operating system distribution </misc/distributions>`. This is the quickest option for those who have operating systems that distribute Django.
ja: :doc:`OSディストリビューションに提供される </misc/distributions>` Django のバージョンをインストールします。 Django を配布している OS を使っている人には最速の方法です。
pl: Zainstaluj wersję Django :doc:`dostarczaną przez dystrybucję twojego systemu operacyjnego </misc/distributions>`. To najszybsza opcja dla tych, którzy mają systemy operacyjne, które dystrybuują Django.

source: :ref:`Install an official release <installing-official-release>`. This is the best approach for most users.
el: :ref:`Εγκαταστήστε μια επίσημη έκδοση <installing-official-release>`. Αυτός είναι ο πιο προσιτός τρόπος για τους περισσότερους.
it: :ref:`Installa una release ufficiale `. Questo è il migliore approccio per la maggior parte degli utenti.
ja: :ref:`オフィシャルリリースをインストールする <installing-official-release>` 。これは多くのユーザで良い方法です。
pl: :ref:`Zainstaluj oficjalne wydanie <installing-official-release>`. To najlepsze podejście dla większości użytkowników.
zh_hans: :ref:`Install an official release <installing-official-release>` 适合大部分用户。

source: :ref:`Install the latest development version <installing-development-version>`. This option is for enthusiasts who want the latest-and-greatest features and aren't afraid of running brand new code. You might encounter new bugs in the development version, but reporting them helps the development of Django. Also, releases of third-party packages are less likely to be compatible with the development version than with the latest stable release.
el: :ref:`Εγκαταστήστε την τελευταία αναπτυξιακή έκδοση (development version) <installing-development-version>`. Αυτός ο τρόπος είναι για αυτούς που θέλουν τα πιο τελευταία και υπέροχα χαρακτηριστικά του Django και δεν φοβούνται να δοκιμάσουν καινούργιο κώδικα. Υπάρχει η περίπτωση, όμως, να αντιμετωπίσετε κάποια σφάλματα (bugs), τα οποία μπορείτε να αναφέρετε για να βοηθήσετε στην περαιτέρω ανάπτυξη και βελτίωση του Django. Επίσης, οι εκδόσεις του Django οι οποίες παρέχονται από τρίτους (third-party packages) είναι περισσότερο πιθανόν να είναι συμβατές με την τελευταία σταθερή έκδοση (latest stable release) παρά με την αναπτυξιακή.
it: :ref:`Installa l'ultima versione di sviluppo <installing-development-version>`. Questa opzione è per gli appassionati che desiderano le funzionalità più recenti e migliori e non hanno paura di eseguire codice nuovo di zecca. Potresti incontrare nuovi bug nella versione di sviluppo, ma segnalarli aiuta lo sviluppo di Django. Inoltre, è meno probabile che le versioni di pacchetti di terze parti siano compatibili con la versione di sviluppo rispetto all'ultima versione stabile.
ja: :ref:`最新の開発版のインストール <installing-development-version>`。この選択肢は、最新の素晴らしい機能を利用し、書き立てのコードを実行することに抵抗のない人のためのものです。開発版で新しいバグに遭遇したとき、それらを報告することで Django の開発に役立つ可能性があります。また、サードパーティ製のパッケージは最新の安定版と比べて開発版と互換性がある可能性は低いです。
pl: :ref:`Zainstaluj najnowszą wersję deweloperską <installing-development-version>`. Ta opcja jest dla entuzjastów, którzy chcą najnowsze i najlepsze funkcjonalności i nie boją się uruchamiać całkowicie nowego kodu. Możesz napotkać nowe bugi w wersji deweloperskiej, ale zgłaszanie ich pomaga w rozwoju Django. Także wydania pakietów od osób trzecich z mniejszym prawdopodobieństwem będą kompatybilne z deweloperską wersją niż z ostatnim stabilnym wydaniem.
zh_hans: :ref:`Install the latest development version <installing-development-version>` 这个选择是针对那些想要体验最新和最好的特性的爱好者们，并不怕运行全新代码。你在开发版中可能会遇到新的 bug，可以报告给社区团队帮助 Django 开发。此外，第三方发行的软件包也可能不与开发版进行兼容。

source: Always refer to the documentation that corresponds to the version of Django you're using!
el: Πάντα να ανατρέχετε στο εγχειρίδιο (documentation) το οποίο αντιστοιχεί στην έκδοση του Django που χρησιμοποιείτε!
it: Fai riferimento sempre alla documentazione che corrisponde alla versione corretta di Django che sta utilizzando.
ja: 常に使用している Django のバージョンに対応するマニュアルを参照してください!
pl: Zawsze sprawdzaj dokumentację, która dotyczy wersji Django, której używasz!
zh_hans: 请始终参考与你所使用的版本对应的 Django 文档！

source: If you do either of the first two steps, keep an eye out for parts of the documentation marked **new in development version**. That phrase flags features that are only available in development versions of Django, and they likely won't work with an official release.
el: Αν ακολουθήσετε έναν από τους δύο πρώτους τρόπους εγκατάστασης, προσέξτε τις παραγράφους, στο εγχειρίδιο, οι οποίες αναγράφουν **νέο στην αναπτυξιακή έκδοση**. Αυτή η φράση υποδεικνύει χαρακτηριστικά του Django τα οποία είναι διαθέσιμα μόνο στην αναπτυξιακή έκδοση και πολύ πιθανόν να μην δουλεύουν με την επίσημη σταθερή.
it: Se fai entrambi i primi due passaggi, tieni d'occhio le parti della documentazione segnate come **nuove nella versione di sviluppo**. Quella frase flagga funzionalità che sono disponibili solo nella versione di sviluppo di Django, e che probabilmente non funzionano in una release ufficiale.
ja: 初め 2 ステップのどちらかをした場合は、ドキュメントの **new in development version** とマークされた部分に気をつけてください。このフレーズは Django の開発版でのみ利用可能な機能であると意味しており、公式リリースではおそらく動作しません。
pl: Jeśli robisz oba pierwsze dwa kroki, miej oko na fragmenty dokumentacji oznaczone **new in development version**. To wyrażenie oznacza funkcje, które są dostępne jedynie w wersjach deweloperskich Django i prawdopodobnie nie będą działać z oficjalnym wydaniem.
zh_hans: 如果采用了前两种方式进行安装，你需要注意在文档中标明 **在开发版中新增**。这个标记表明这个特性仅适用开发版 Django，并且他们可能不会在官方发布的稳定版中出现。

source: Verifying
el: Επαληθεύοντας
it: Verifica
ja: 動作確認
pl: Sprawdzanie
zh_hans: 验证
