Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: el, it, ko, pt_br, zh_hans

source: This is a core Python principle listed in :pep:`20`, and it means Django shouldn't do too much "magic." Magic shouldn't happen unless there's a really good reason for it. Magic is worth using only if it creates a huge convenience unattainable in other ways, and it isn't implemented in a way that confuses developers who are trying to learn how to use the feature.
el: Αυτό είναι η θεμελιώδης αρχή της Python η οποία περιλαμβάνεται στο :pep:`20` και σημαίνει ότι το Django δεν θα πρέπει να κάνει πολλά "μαγικά." Τα μαγικά δεν πρέπει να υπάρχουν εκτός και αν υπάρχει ένας πολύ καλός λόγος. Τα μαγικά αξίζει να γίνουν αν προσφέρουν τεράστια ευκολία η οποία είναι ανέφικτη με άλλους τρόπους και η υλοποίηση τους έχει γίνει με τέτοιο τρόπο που να μην μπερδεύει τους προγραμματιστές οι οποίοι προσπαθούν να καταλάβουν πως να χρησιμοποιήσουν το feature.
it: Questo è un principio primario di Python presente in :pep:`20`, e significa che Django non dovrebbe essere troppo "magico". La magia non dovrebbe esserci a meno che non ci siano delle valide ragioni. La magia merita di essere usata solo se crea grandi vantaggi non raggiungibili in altri modi, e non è implementata in modo da confondere gli sviluppatori che tentano di imparare come usare una feature.
ko: 이것은 :pep:`20`\에 기술된 Python 핵심 원칙이며, Django가 "마법"을 많이 부리지 말아야 한다는 것입니다. 정당한 이유 없이 마법이 일어나서는 안 됩니다. 마법은 매우 큰 편익이 있을 때만 허용되며, 기능의 사용법을 배우고자 하는 개발자에게 혼란을 일으키는 방식으로 구현되어서는 안 됩니다.
pt_br: Esta é um dos princípios mais importantes de Python, listado em :pep:`20`, que significa que o Django não deve utilizar mágica demais. Mágica deve ser utilizada apenas quando houver uma razão realmente boa para tal. Mágica vale a pena ser usada somente se criar uma enorme conveniência, impossível de outra forma, e não deve ser implementada de forma a confundir os desenvolvedores que estejam tentando aprender como utilizar uma funcionalidade.
zh_hans: 这是在 :pep:`20` 列出的核心 Python 原则，这意味着 Django 不应该使用太多的“魔术”。除非有一个很好的理由，否则不应该出现魔术。只有当魔术创造了巨大的便利，并且使用其他方式难以实现时，它才值得使用，而且它的实现方式并不会让试图学习如何使用该功能的开发人员感到困惑。

source: Consistency
el: Συνοχή
it: Consistenza
ko: 일관성
pt_br: Consistência
zh_hans: 一致性

source: The framework should be consistent at all levels. Consistency applies to everything from low-level (the Python coding style used) to high-level (the "experience" of using Django).
el: Το framework θα πρέπει να έχει συνοχή σε όλα τα επίπεδα. Η έννοια της συνοχής εφαρμόζεται στα πάντα, από τα χαμηλού επιπέδου (το στυλ του Python κώδικα που χρησιμοποιείται) μέχρι τα υψηλού επιπέδου (η "εμπειρία" πάνω στο Django).
it: Il framework dovrebbe essere consistente a tutti i livelli. La consistenza si applica a tutto, dal low-level (lo stile di codice Python usato) all' high-level ("l'esperienza" di uso di Django.)
ko: 본 프레임워크는 모든 수준에서 일관적이어야 합니다. 일관성은 저수준(Python 코딩 스타일)에서 고수준(Django 사용 "경험")이 이르기까지 적용됩니다.
pt_br: O framework deve ser consistente em todos os níveis. Consistência se aplica a tudo, do nível mais baixo (estilo de codificação Python utilizado) ao nível mais alto (a "experiência" de se usar Django).
zh_hans: 框架应在所有层级上保持一致。一致性适用于从低级（Python 的编码风格）到高级（使用 Django 的“经验”）的所有内容。

source: Models
el: Μοντέλα
it: Modelli
ko: 모델
pt_br: Modelos
zh_hans: 模型

source: Fields shouldn't assume certain behaviors based solely on the name of the field. This requires too much knowledge of the system and is prone to errors. Instead, behaviors should be based on keyword arguments and, in some cases, on the type of the field.
el: Τα πεδία (fields) δεν θα πρέπει να υποθέτουν κάποιες συμπεριφορές βασιζόμενα μόνο και μόνο στο όνομα του πεδίου. Αυτό απαιτεί πολλή γνώση από το σύστημα και είναι ευάλωτο σε λάθη. Αντιθέτως, οι συμπεριφορές θα πρέπει να βασίζονται στα keyword arguments και, σε μερικές περιπτώσεις, στον τύπο του πεδίου.
it: I campi non dovrebbero dare per scontati certi comportamenti basati solo sul nome del campo. Questo richiederebbe troppa conoscenza del sistema ed è incline ad errori. Invece, i comportamenti dovrebbero essere basati su argomenti chiave e, in alcuni casi, sul tipo del campo.
ko: 어떤 필드가 그 이름에 전적으로 의존하여 특정한 성질을 가질 것으로 가정해서는 안 됩니다. 이는 시스템에 대한 지식을 너무 많이 필요로 하며 오류를 양산합니다. 필드의 성질은 키워드 인자에 근거해야 하며, 경우에 따라서는 필드의 유형에 근거해야 합니다.
pt_br: Campos não devem assumir certos comportamentos baseados apenas no nome do campo. Isto requer muito conhecimento do sistema e é propenso a erros. Ao invés disso, o comportamento deve ser baseado em argumentos nomeados e, em alguns casos, no tipo do campo.
zh_hans: 字段不应该仅仅根据字段的名称来假定某些行为。这需要对系统有太多了解，并且容易出现错误。相反，其行为应该基于关键字参数，并且在某些情况下，应该基于字段的类型。

source: Include all relevant domain logic
el: Περίληψη όλων των σχετικών με το μοντέλο πληροφορίες
it: Includere tutte le logiche di dominio rilevanti
ko: 모든 관련 도메인 로직을 포함하라
pt_br: Inclui toda lógica do domínio relevante
zh_hans: 包括所有相关领域逻辑

source: Models should encapsulate every aspect of an "object," following Martin Fowler's `Active Record`_ design pattern.
el: Τα μοντέλα θα πρέπει να ενσωματώσουν όλες τις έννοιες που αφορούν ένα "object," σύμφωνα με το άρθρο `Active Record`_ του Martin Fowler σχετικά με πρακτικές σχεδιασμού.
it: I modelli dovrebbero incapsulare ogni aspetto di un "oggetto" seguendo il pattern design `Active Record`_ definito da Martin Fowler
ko: 모델은 마틴 파울러의 `활성 레코드(Active Record)` 디자인 패턴을 따라 "객체"의 모든 관점(aspect)을 캡슐화해야 합니다.
pt_br: Modelos devem encapsular cada aspecto de um objeto, seguindo o padrão de projeto `Active Record`_ de Martin Fowler.
zh_hans: 模型应该封装一个“对象”的各个方面，遵循 Martin Fowler 的 `Active Record`_ 设计模式。

source: This is why both the data represented by a model and information about it (its human-readable name, options like default ordering, etc.) are defined in the model class; all the information needed to understand a given model should be stored *in* the model.
el: Να λοιπόν γιατί τα δεδομένα που αναπαριστώνται από το μοντέλο και οι πληροφορίες σχετικά με αυτά (το όνομα όπως θα εμφανίζεται στον χρήστη, επιλογές όπως προεπιλεγμένη ταξινόμηση κλπ) ορίζονται μέσα στην κλάση του μοντέλου. Όλη η πληροφορία που χρειάζεται για να κατανοηθεί ένα μοντέλο θα πρέπει να αποθηκεύεται *μέσα* στο μοντέλο.
it: Per questo motivo, i dati sono rappresentati da un modello e dalle informazioni su di essi (un nome di facile lettura, opzioni come l'ordinamento di default, ecc...) sono definiti nella classe modello; tutte le informazioni necessarie per comprendere un modello dovrebbero trovarsi *nel* modello.
ko: 데이터를 모델로 표현하고 그에 대한 정보(사람이 읽을 수 있는 이름, 기본 순서 같은 선택 사항 등)를 모델 클래스에 정의하는 이유는 그 때문입니다. 모델을 이해하는 데 요구되는 모든 정보가 모델 *내*\에 있어야 합니다.
pt_br: Esse é o porque de ambos os dados representandos por um modelo e a informação sobre eles (seus nomes legíveis, opções como ordenação padrão, etc) são definidos na classe de modelo; toda a informação necessária para entender um dado modelo deveria ser amazenada *no* modelo.
zh_hans: 这就是为什么在模型类中要同时定义一个模型表现的数据以及关于它的信息（包括其人类可读的名称，默认排序等选项）；所有用于理解给定模型所需的信息都应该存储在模型中。

source: Database API
el: Το API της βάσης δεδομένων
ko: 데이터베이스 API
pt_br: API de banco de dados
zh_hans: 数据库API

source: The core goals of the database API are:
el: Οι βασικοί στόχοι του API της βάσης δεδομένων είναι:
it: I principali obiettivi delle API del database sono:
ko: 데이터베이스 API의 핵심 목표는 다음과 같습니다.
pt_br: Os objetivos principais da API de banco de dados são:
zh_hans: 数据库API的主要用处：

source: SQL efficiency
el: Αποδοτικότητα της SQL
it: Efficenza SQL
ko: SQL 효율성
pt_br: Eficiência SQL
zh_hans: SQL效率

source: It should execute SQL statements as few times as possible, and it should optimize statements internally.
el: Το framework θα πρέπει να εκτελεί όσο το δυνατόν λιγότερες φορές τις SQL εντολές και να τις βελτιστοποιεί στο εσωτερικό του.
it: Dovrebbe eseguire dichiarazioni SQL il minor numero di volte possibile, ed ottimizzare le dichiarazioni internamente.
ko: SQL 문을 가능한 한 적은 횟수로 실행해야 하며 내부적으로 최적화해야 합니다.
pt_br: Ele deveria executar comandos SQL o mínimo de vezes possível, e deveria otimizar os comandos internamente.
zh_hans: 应该尽可能少地执行SQL语句，并且应该在内部优化语句。

source: This is why developers need to call ``save()`` explicitly, rather than the framework saving things behind the scenes silently.
el: Να γιατί οι developers χρειάζεται να καλούν την μέθοδο ``save()`` ρητώς, παρά να επαφίενται στο framework να αποθηκεύει σιωπηλά τα objects στο παρασκήνιο.
it: Per questo è necessario che gli sviluppatori chiamino ``save()`` esplicitamente, piuttosto che lasciare al framework il compito di salvarle in background.
ko: 저장을 프레임워크에서 조용히 처리해주는 대신, 개발자가 ``save()``\를 명시적으로 호출하도록 한 이유입니다.
pt_br: É por isso que desenvolvedores devem chamar ``save()`` explicitamente, ao invés do framework salvar coisas por trás das cenas silenciosamente.
zh_hans: 这就是为什么开发者需要显式地调用 ``save()``，而不是由框架静默地在幕后保存东西。

source: This is also why the ``select_related()`` ``QuerySet`` method exists. It's an optional performance booster for the common case of selecting "every related object."
el: Επίσης, αυτός είναι ο λόγος της ύπαρξης της μεθόδου ``select_related()`` του ``QuerySet``. Είναι ένας προαιρετικός αρωγός απόδοσης για συνηθισμένες περιπτώσεις του τύπου "επέλεξε κάθε συσχετισμένο object".
it: Anche per questo motivo esistono i metodi ``select_related()`` di ``QuerySet``. È un booster di performance opzionale per i casi più comuni di selezioni di "ogni oggetto correlato".
ko: ``select_related()`` ``QuerySet`` 메서드가 존재하는 것도 이 때문입니다. 이것은 "관련된 모든 객체"를 선택하는 공통적인 경우에 성능을 향상시키는 선택사항입니다.
pt_br: É também por isso que o método ``select_related()`` ``QuerySet`` existe. É um opcional para melhorar a performance para casos comuns de seleção de "cada objeto relacionado".
zh_hans: 这也是为什么 ``select_related()`` ``QuerySet`` 方法存在的原因。在查询“每个关联的对象”的常见情况下，它是一个可选的性能提升器。

source: Terse, powerful syntax
el: Λακωνική, ισχυρή σύνταξη
it: Sintassi potente e concisa
ko: 간결하고 강력한 구문
pt_br: Concisa, sintaxe poderosa
zh_hans: 简洁, 强大的语法

source: The database API should allow rich, expressive statements in as little syntax as possible. It should not rely on importing other modules or helper objects.
el: Το API της βάσης δεδομένων θα πρέπει να επιτρέπει πλούσια και εκφραστικά statements με όσο το δυνατόν λιγότερη σύνταξη. Δεν θα πρέπει να βασίζεται στην εισαγωγή (import) άλλων modules ή βοηθητικών objects.
it: Le API del database dovrebbero permettere dichiarazioni ricche ed espressive con la minima sintassi possibile. Non dovrebbero fare affidamento sulle importazioni di altri moduli o su oggetti helper.
ko: 데이터베이스 API는 가능한 한 적은 구문을 가지고 풍부하고 표현력이 뛰어난 문장을 생성할 수 있어야 합니다. 다른 모듈이나 도움 객체를 임포트하는 것에 의존해서는 안 됩니다.
pt_br: A API de banco de dados deve permitir uma rica, declarações expressivas na menor syntaxe possível. Não deve se basear na importação de outros módulos e objetos auxiliares.
zh_hans: 数据库 API 应该允许用尽可能少的语法，来表达丰富、达意的语句。它不应该依赖于导入其他模块或辅助对象。

source: Joins should be performed automatically, behind the scenes, when necessary.
el: Οι εντολές “JOIN” της SQL θα πρέπει να γίνονται αυτομάτως, στο παρασκήνιο, όταν είναι απαραίτητο.
it: Le Join dovrebbero essere eseguite automaticamente, in background, quando necessario.
ko: 조인(join)이 요구될 때에는 겉으로 드러나지 않게 자동으로 수행되어야 합니다.
pt_br: "joins" devem ser realizados automaticamente, pode de trás das cenas, quando necessário.
zh_hans: 当必要时, 在幕后插入应该是自动进行的.

source: Every object should be able to access every related object, systemwide. This access should work both ways.
el: Κάθε object θα πρέπει να έχει πρόσβαση σε κάθε συσχετισμένο object, μέσα σε όλο το σύστημα. Αυτού του είδους η πρόσβαση θα πρέπει να δουλεύει και ανάποδα.
it: Ogni oggetto dovrebbe essere capace di accedere ad ogni oggetto relazionato, globalmente. Questo tipo di accesso dovrebbe funzionare in entrambi i sensi.
ko: 모든 객체는 시스템의 모든 관련 객체에 접근할 수 있어야 합니다. 이러한 접근은 양방향이어야 합니다.
pt_br: Cada objeto deve ser capaz de acessar cada objeto relaticionado, em todo o sistema. Este acesso deve funcionar nas duas vias.
zh_hans: 每一个对象都应该能够访问所有相关的对象, 系统范围. 这种访问应该是双向的.

source: Option to drop into raw SQL easily, when needed
el: Επιλογή να μπορεί γράφεται SQL εύκολα, όποτε χρειάζεται
it: Opzioni da usare nelle query SQL grezze, quando necessario.
ko: 필요할 경우 SQL 문을 직접 작성하기 쉬워야 함
pt_br: Opção de usar SQL nativo, quando necessário.
zh_hans: 当有必要时, 可方便地选择使用原始 SQL 语句

source: The database API should realize it's a shortcut but not necessarily an end-all-be-all. The framework should make it easy to write custom SQL -- entire statements, or just custom ``WHERE`` clauses as custom parameters to API calls.
el: Το API της βάσης δεδομένων θα πρέπει να συνειδητοποιήσει ότι είναι μια συντόμευση και όχι απαραίτητα ένα API που τα κάνει όλα. Το framework θα πρέπει να κάνει εύκολη τη γραφή προσαρμοσμένων SQL εντολών -- είτε ολόκληρων είτε προσαρμοσμένων ``WHERE`` εντολών μόνο, ως παραμέτρους στις κλήσεις του API.
it: La API per il database dovrebbe capire che è una scorciatoia ma non necessariamente qualcosa di estremamente importante. Il framework dovrebbe rendere semplice scrivere dell' SQL personalizzato - intere espressioni o semplicemente clausole "WHERE" come parametri custom delle chiamate API.
ko: 데이터베이스 API는 개발의 편의를 위한 것이며, 반드시 사용해야 하는 것은 아닙니다. 프레임워크는 맞춤 SQL(전체 문장 또는 API 호출 시 맞춤 파라미터로서의 맞춤 ``WHERE`` 절)도 쉽게 작성할 수 있어야 합니다.
pt_br: A API do banco de dados deve perceber que é um atalho mas não necessariamente um meio para todos os fins. O framework deve facilitar a escrita de SQL personalizado -- declarações inteiras, ou somente cláusulas ``WHERE`` personlizadas como parâmetros personalizados para chamadas de API.
zh_hans: 应该认识到数据库 API 只是一个便捷的方法，但并不必须是最终的全部手段。框架应该可以很容易地编写自定义的 SQL——完整的语句，或者仅仅是自定义 ``WHERE`` 子句作为 API 调用时的自定义参数。

source: URL design
el: Σχεδιασμός URL
it: Design dell'URL
ko: URL 설계
pt_br: Definindo URL
zh_hans: URL 设计

source: URLs in a Django app should not be coupled to the underlying Python code. Tying URLs to Python function names is a Bad And Ugly Thing.
el: Τα URLs μέσα σε μια Django εφαρμογή (app) δεν θα πρέπει να εμπλέκονται με τον Python κώδικα που είναι γραμμένος. Η σύνδεση των URLs σε ονόματα Python συναρτήσεων είναι Κακό Και Άσχημο Πράγμα.
it: Le URL in una app Django non dovrebbero essere accoppiate al codice Python sottostante. Legare le URL ai nomi di funzioni Python è una cosa brutta e cattiva.
ko: Django 앱의 URL은 하부 Python 코드와 결합되어서는 안 됩니다. Python 함수 이름과 URL을 엮는 것은 좋지 않습니다.
pt_br: As URLs na aplicação Django não devem estar casadas com os componentes Python. Amarrar URLs a nomes de funções Python é uma coisa ruim e feia.
zh_hans: Django 应用中的 URL 不应该与底层 Python 代码耦合。将 URL 与 Python 函数名联系起来是一件很糟糕且丑陋的做法。

source: Along these lines, the Django URL system should allow URLs for the same app to be different in different contexts. For example, one site may put stories at ``/stories/``, while another may use ``/news/``.
el: Σύμφωνα με τα ανωτέρω, το σύστημα URL του Django θα πρέπει να επιτρέπει τα URLs της ίδιας εφαρμογής να είναι διαφορετικά ανάμεσα σε διαφορετικά πλαίσια (contexts). Για παράδειγμα, ένα site μπορεί να φιλοξενήσει την εφαρμογή “stories” στη διεύθυνση ``/stories/`` ενώ ένα άλλο να φιλοξενήσει την ίδια εφαρμογή στη διεύθυνση ``/news/``.
it: In tal senso, il sistema di URL di Django dovrebbe permettere che URL nella stessa app siano differenti per contesti differenti. Per esempio, un sito potrebbe collocare le storie in ``/stories/``, mentre un'altro potrebbe usare ``/news/``.
ko: Django URL 시스템은 같은 앱을 다른 맥락에서 사용할 수 있도록 합니다. 예를 들어, 한 사이트에서는 ``/stories/``\ 에, 또 다른 사이트에서는 ``/news/``\ 에 넣을 수 있습니다.
pt_br: Ao longos destas linhas, o sistema de URL do Django deve permitir URLs ara uma mesma aplicação ser diferentes em diferetes contextos. Por exemplo, um site pode colocar "stories" em ``/stories/``, enquanto outro possa usar ``/news/``.
zh_hans: 按照这些方法，Django URL 系统应该允许同一应用的 URL 在不同的上下文中有所不同。例如，一个网站可以在 ``/stories/`` 中放置故事，而另一个网站则可以使用 ``/news/``。

source: Infinite flexibility
el: Απεριόριστη ευελιξία
it: Flessibilità infinita
ko: 무한한 유연성
pt_br: Flexibilidade Infinita
zh_hans: 无限的灵活性

source: URLs should be as flexible as possible. Any conceivable URL design should be allowed.
el: Τα URLs θα πρέπει να είναι όσο το δυνατόν πιο ευέλικτα. Κάθε νοητή σχεδίαση ενός URL θα πρέπει να επιτρέπεται.
it: Le URL dovrebbero essere il più flessibili possibile. Qualsiasi URL design che possa essere concepito, dovrebbe essere permesso.
ko: URL은 가능한 한 유연해야 합니다. 생각할 수 있는 모든 URL 설계가 가능합니다.
pt_br: As URLs deve ser tão flexíveis quanto possível. Qualquer URL concebível deve ser permitida.
zh_hans: URL 应该尽可能灵活。任何可想到的 URL 设计都应该被允许。

source: Encourage best practices
el: Ενθάρρυνση καλών πρακτικών
it: Incoraggiare le best practices
ko: 모범 사례를 장려
pt_br: Encoraja melhores práticas
zh_hans: 鼓励最佳实践

source: The framework should make it just as easy (or even easier) for a developer to design pretty URLs than ugly ones.
el: Το framework θα πρέπει να κάνει εύκολη (αν όχι ευκολότερη), για τον developer, τη σχεδίαση όμορφων παρά άσχημων URLs.
it: Il framework dovrebbe rendere semplice (o perfino semplicissima), per uno sviluppatore, la creazione di URL belle piuttosto che brutte.
ko: 본 프레임워크는 개발자로 하여금 지저분한 URL보다는 예쁜 URL을 더 쉽게 설계할 수 있도록 해야 합니다.
pt_br: O framework deve tornar fácil (ou mesmo mais fácil) para um desenvolvedor definir URLs bonitas do que feias.
zh_hans: 框架可以做到让开发者简单（或更加简单）地设计出漂亮的，而不是难看的 URL。

source: File extensions in web-page URLs should be avoided.
ko: 웹 페이지 URL에 파일 확장자를 넣는 것은 지양해야 합니다.
pt_br: Extensões de arquivo em URLs de páginas da web devem ser evitadas.

source: Vignette-style commas in URLs deserve severe punishment.
el: Τα κόμματα, τύπου Vignette, στα URLs χρήζουν αυστηρής τιμωρίας.
it: Le virgolette in stile "vignetta" nelle URL meritano di essere punite severamente.
ko: URL에 Vignette 스타일의 콤마는 큰 벌을 받아 마땅합니다.
pt_br: Vírgula no estilo Vignette em URLs merecem uma punição servera.
zh_hans: 在 URL 中使用 Vignette 式的逗号应该受到严厉的惩罚。

source: Definitive URLs
el: Οριστικά URLs
it: URL definitive
ko: 명확한 URL
pt_br: URLs definitivas
zh_hans: 定义URL

source: Technically, ``foo.com/bar`` and ``foo.com/bar/`` are two different URLs, and search-engine robots (and some web traffic-analyzing tools) would treat them as separate pages. Django should make an effort to "normalize" URLs so that search-engine robots don't get confused.
ko: 기술적으로 ``foo.com/bar``와 ``foo.com/bar/``는 서로 다른 두 개의 URL이며 검색 엔진 로봇(또는 일부 웹 트래픽 분석 도구)은 이를 별도의 페이지로 취급합니다. Django는 URL을 ``정규화``하여 검색 엔진 로봇이 혼동하지 않게 해야 합니다.
pt_br: Tecnicamente, ``foo.com/bar`` e ``foo.com/bar/`` são dois URLs diferentes, e os robôs do mecanismo de busca (e algumas ferramentas de análise de tráfego da web) os tratariam como páginas separadas. O Django deve fazer um esforço para "normalizar" as URLs para que os robôs dos mecanismos de busca não fiquem confusos.

source: This is the reasoning behind the :setting:`APPEND_SLASH` setting.
el: Αυτό είναι ο λόγος πίσω από τη ρύθμιση :setting:`APPEND_SLASH`.
it: Questa è il ragionamento che sta alla base dell'impostazione :setting:`APPEND_SLASH`.
ko: 이것이 바로 :setting:`APPEND_SLASH` 설정이 있는 이유입니다.
pt_br: Essa é a razão por de trás da definição :setting:`APPEND_SLASH`.
zh_hans: 详细请参考 :setting:`APPEND_SLASH` 配置。

source: Template system
el: Σύστημα template
it: Sistema dei template
ko: 템플릿 시스템
pt_br: Sistema de "template"
zh_hans: 模板系统

source: Separate logic from presentation
el: Διαχωρισμός μεταξύ λογικής και παρουσίασης
it: Dividere la logica dalla presentazione
ko: 표현과 로직을 분리
pt_br: Separe a lógica da apresentação.
zh_hans: 逻辑分离的解决方案

source: We see a template system as a tool that controls presentation and presentation-related logic -- and that's it. The template system shouldn't support functionality that goes beyond this basic goal.
el: Βλέπουμε το σύστημα του template ως ένα εργαλείο που ελέγχει την παρουσίαση και ότι έχει να κάνει με την λογική πίσω από την παρουσίαση. Μόνο αυτό. Το σύστημα template δεν θα πρέπει να πάει παραπέρα από αυτό τον στόχο.
it: Noi vediamo un sistema di template come un tool che controlla la presentazione e le logiche correlate alla presentazione -- e questo è quanto. Il sistema di template non dovrebbe gestire funzionalità che vanno oltre questo obiettivo di base.
ko: 우리는 템플릿 시스템이 표현을 제어하는 도구이자 표현에 관련된 로직일 뿐이라고 봅니다. 템플릿 시스템은 이러한 기본 목표를 넘어서는 기능을 지원하지 말아야 합니다.
pt_br: Nós vemos o sistema de "template" como uma ferramenta que controla a apresentação e a lógica relacionada a apresentação -- e só isso. O sistema de template não deve dar suporte a funcionalidades que vão além deste objetivo básico.
zh_hans: 我们将模板系统看作一个工具，用于控制表现方式和表示方式相关的逻辑。模板系统不应该支持超出这个基本目标的功能。

source: Discourage redundancy
el: Αποθάρρυνση του πλεονασμού
it: Scoraggiare la ridondanza
ko: 중복을 배제
pt_br: Desencoraja a redundância
zh_hans: 避免冗余

source: The majority of dynamic websites use some sort of common sitewide design -- a common header, footer, navigation bar, etc. The Django template system should make it easy to store those elements in a single place, eliminating duplicate code.
el: Η πλειονότητα των δυναμικών ιστοσελίδων χρησιμοποιεί ένα είδος κοινού σχεδιασμού ολόκληρου του site -- κοινό header, footer, μπάρα πλοήγησης κλπ. Το σύστημα template του Django θα πρέπει να κάνει εύκολη την αποθήκευση αυτών των στοιχείων σε ένα μέρος, εξαλείφοντας τη χρήση επαναλαμβανόμενου κώδικα.
it: La maggior parte dei siti dinamici utilizza uno stile comune a tutto il sito - una intestazione comune, un piè di pagina, una barra di navigazione, ecc. Il sistema di template di Django dovrebbe rendere facile mettere questi elementi in un unico posto, eliminando il codice duplicato.
ko: 대다수의 동적 웹사이트는 공통 헤더, 푸터, 네이게이션 바 같은 사이트 공통 디자인을 갖습니다. Django 템플릿 시스템은 이러한 요소를 한 곳에 저장하기 쉽게 하여 중복 코드를 없애야 합니다.
pt_br: A maioria dos sites web dinâmicos usam algum tipo de design para todo o site -- um cabeçalho comum, um rodapé, barra de navegação etc. O sistema de "template" do Django deve tornar fácil armazenar estes elementos em um único local, eliminando duplicidade de código.
zh_hans: 大多数动态网站会使用一些网站整体通用的设计——一个通用的页眉、页脚、导航栏，等等。Django 模板系统应该可以很容易地将这些元素存储在一个地方，从而减少重复的代码。

source: This is the philosophy behind :ref:`template inheritance <template-inheritance>`.
el: Αυτή είναι η φιλοσοφία πίσω από την :ref:`κληρονομικότητα του template <template-inheritance>`.
it: Questa è la filosofia dietro all' :ref:`ereditarietà dei template<template-inheritance>`.
ko: 이것이 :ref:`템플릿 상속 <template-inheritance>`\의 기초가 되는 철학입니다.
pt_br: Esta é a filosofia por de trás: :ref:`herança de template <template-inheritance>`.
zh_hans: 这是 :ref:`模板继承 <template-inheritance>` 背后的理念。

source: Be decoupled from HTML
el: Μη συσχέτιση με την HTML
it: Essere disaccoppiato dall'HTML
ko: HTML과의 분리
pt_br: Esteja desacomplado do HTML.
zh_hans: 从 HTML 中解耦

source: The template system shouldn't be designed so that it only outputs HTML. It should be equally good at generating other text-based formats, or just plain text.
el: Το σύστημα template δεν θα πρέπει να σχεδιαστεί για να παράγει μόνο HTML. Θα πρέπει να είναι εξίσου καλό στο να παράγει και άλλες μορφές που βασίζονται στο κείμενο ή απλώς σκέτο κείμενο.
it: Il sistema template non dovrebbe essere strutturato in modo tale da ottenere solo HTML. Dovrebbe essere ugualmente valido per generare anche altri formati basati sul testo o anche solo plain text.
ko: 템플릿 시스템은 HTML만을 출력하도록 설계하지 말아야 합니다. 텍스트 기반 포맷 또는 일반 텍스트도 마찬가지로 잘 생성할 수 있어야 합니다.
pt_br: O sistema de "template" não deve ser feito de modo que só entregue HTML. Ele deve ser igualmente bom em gerar outros formatos baseados em texto, ou texto simples apenas.
zh_hans: 模板系统不应该被设计成只能输出 HTML。它应该同样擅长生成其他基于文本的格式，或者仅仅是纯文本。

source: XML should not be used for template languages
el: Η XML δεν θα πρέπει να χρησιμοποιείται σε γλώσσες template
it: XML non dovrebbe essere usato per linguaggi di template
ko: XML을 템플릿 언어로 사용하지 말 것
pt_br: XML não deve ser usado para linguagens de "template".
zh_hans: XML不应被用于模板语言
