Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: el, it, ko, pt_br, zh_hans

source: API stability
el: Σταθερότητα του API
it: Stabilità API
ko: API 안정성
pt_br: Estabilidade da API
zh_hans: API 的稳定性

source: Django is committed to API stability and forwards-compatibility. In a nutshell, this means that code you develop against a version of Django will continue to work with future releases. You may need to make minor changes when upgrading the version of Django your project uses: see the "Backwards incompatible changes" section of the :doc:`release note </releases/index>` for the version or versions to which you are upgrading.
it: Django è votato alla stabilità delle API ed alla compatibilità futura. In poche parole, questo significa che il codice che sviluppi per una versione di Django continuerà a funzionare con le release future. Potresti avere bisogno di applicare alcuni piccoli cambiamenti quando aggiorni la versione di Django del tuo progetto: vedi la sezione "Modifiche non retrocompatibili" in :doc:`release note </releases/index>` relativa alla versione o alle versioni verso le quali stai aggiornando.
ko: Django는 API의 안정성과 다음버젼의 호환성을 보장하고 있습니다. 요컨대, 새로 업데이트되는 Django 버전에서도 기존에 작성한 코드는 문제 없이 돌아갈 것이라는 뜻입니다. 하지만 업데이트후 프로젝트 별 소소한 변경 작업들은 해줘야 할 수 있습니다. 이에 대해서는 "이전 버전과 호환되지 않는 변경사항" 섹션에서 :doc:`릴리스 노트 </releases/index>` 기존 버전 혹은 업그레이드 대상 버전의 문서를 참조하시기 바랍니다.
pt_br: O Django está comprometido com a estabilidade da API e compatibilidade com versões futuras. Resumindo, isso significa que o código que você desenvolve em uma versão do Django continuará a funcionar com versões futuras. Você pode precisar fazer pequenas alterações ao atualizar a versão do Django que seu projeto usa: veja a seção "Alterações incompatíveis com versões anteriores" da :doc:`nota de lançamento </releases/index>` para a versão ou versões para as quais você está atualizando.
zh_hans: Django 致力于 API 的稳定性和向前兼容性。简而言之，这意味着你在一个 Django 版本开发的代码可以继续在未来的版本中使用。在升级你的项目使用的 Django 版本时，你可能需要做一些小的更改: 了解你要升级的一个或多个版本请参阅 :doc:`发行版注解 </releases/index>` 中的“向后不兼容更改”部分。

source: At the same time as making API stability a very high priority, Django is also committed to continual improvement, along with aiming for "one way to do it" (eventually) in the APIs we provide. This means that when we discover clearly superior ways to do things, we will deprecate and eventually remove the old ways. Our aim is to provide a modern, dependable web framework of the highest quality that encourages best practices in all projects that use it. By using incremental improvements, we try to avoid both stagnation and large breaking upgrades.
it: Pur essendo la stabilità delle API una priorità molto alta, Django è anche votato al miglioramento continuo, avendo congiuntamente l'obiettivo di illustrare (con il tempo) "un unico modo di fare le cose" nelle API che fornisce. Questo significa che quando troviamo un modo decisamente migliore di fare le cose, renderemo deprecati e rimuoveremo i vecchi modi di farle. Il nostro scopo è quello di fornire un web framework moderno ed affidabile che incoraggi le best practices in tutti i progetti che lo utilizzano. Con i miglioramenti incrementali, cerchiamo di evitare nello stesso modo la stagnazione ed i grandi breaking-upgrades.
ko: API 안정성을 매우 높은 우선순위로 만드는 동시에 Django는 우리가 제공하는 API에서 (결과적으로) "한 가지 방법"을 목표로 하는 것과 함께 지속적인 개선에도 전념하고 있습니다. 이것은 우리가 일을 하는 데 있어 분명히 더 나은 방법을 발견할 때 이전 방법을 더 이상 사용하지 않고 결국 제거할 것임을 의미합니다. 우리의 목표는 그것을 사용하는 모든 프로젝트에서 모범 사례를 장려하는 최고 품질의 현대적이고 신뢰할 수 있는 웹 프레임워크를 제공하는 것입니다. 점진적 개선을 이용해 정체 및 대규모 중단 업그레이드를 모두 방지하려고 합니다.
pt_br: Ao mesmo tempo em que torna a estabilidade da API uma prioridade muito alta, o Django também está comprometido com a melhoria contínua, juntamente com o objetivo de "uma maneira de fazer isso" (eventualmente) nas APIs que fornecemos. Isso significa que, quando descobrimos maneiras claramente superiores de fazer as coisas, descontinuamos e, eventualmente, removeremos as maneiras antigas. Nosso objetivo é fornecer um framework web moderno e confiável da mais alta qualidade que incentive as melhores práticas em todos os projetos que a utilizam. Usando melhorias incrementais, tentamos evitar a estagnação e grandes atualizações de interrupção.
zh_hans: 在将 API 的稳定性作为一个非常重要的优先级的同时，Django 还致力于持续的改进，并致力于在我们提供的 API 中实现“一种方法”（最终）。这意味着，当我们发现明显更好的实现方式时，我们会弃用旧的方式，并最终将其移除。我们的目标是提供一个现代的、可靠的、高质量的 web 框架，帮助所有使用它的项目的使用最佳实践。通过使用渐进式的改进，我们试图避免停滞和大规模破坏性升级。

source: What "stable" means
el: Τι σημαίνει "σταθερότητα"
it: Cosa significa "stabile"
ko: "안정적인 것"의 의미
pt_br: O que "estável" significa
zh_hans: 什么是“稳定”？

source: In this context, stable means:
el: Μέσα σε αυτό το πλαίσιο, σταθερότητα σημαίνει:
it: In questo contesto, stabile significa:
ko: 이 문맥에서, 안정적인 것은 다음을 의미합니다.
pt_br: Neste contexto, estável significa:
zh_hans: 在此处，稳定意味着：

source: All the public APIs (everything in this documentation) will not be moved or renamed without providing backwards-compatible aliases.
el: Όλα τα δημόσια APIs (το οτιδήποτε μέσα σε αυτό το εγχειρίδιο) δεν θα μετακινηθούν ή μετονομαστούν χωρίς πρώτα να ορίσουν τα κατάλληλα aliases προκειμένου να είναι συμβατά με παλαιότερες εκδόσεις.
it: Tutte le API pubbliche (tutto in questa documentazione) non saranno spostate o rinominate senza fornire alias retro-compatibili.
ko: 공개된 모든 API(이 문서에 있든 모든것)들이 이전 버전과 호환되는 별명을 제공하지 않고 이동되거나 이름이 바뀌지 않을 것 입니다.
pt_br: Todas as APIs públicas (tudo nesta documentação) não serão retiradas ou renomeadas sem fornecer aliases para compatibilidade com as versões anteriores.
zh_hans: 所有发布的 API （在文档中的一切 API ）在不提供向后兼容的别名的情况下，都不会被移除或者重命名。

source: If new features are added to these APIs -- which is quite possible -- they will not break or change the meaning of existing methods. In other words, "stable" does not (necessarily) mean "complete."
el: Όταν προστεθούν νέα features σε αυτά τα δημόσια APIs -- που είναι αρκετά συχνό φαινόμενο -- δε θα σπάσουν ή αλλάξουν την έννοια των ήδη υπαρχουσών μεθόδων. Με άλλα λόγια, "σταθερότητα" δεν σημαίνει (απαραιτήτως) "τελικό", δηλαδή, αν προσθέσουμε μια μέθοδο Χ σε κάποιο API και στο μέλλον την εμπλουτίσουμε να δέχεται περισσότερα ορίσματα αλλά εσείς συνεχίζετε να χρησιμοποιείτε την πρώτη έκδοση της μεθόδου αυτής, τότε η μέθοδος που χρησιμοποιείτε παραμένει "σταθερή" (στη λειτουργία της) αλλά όχι στο "τελικό" της στάδιο (καθώς προστέθηκαν νέα features σε αυτή).
it: Se nuove caratteristiche sono aggiunte a queste API -- che è del tutto possibile -- non romperanno o cambieranno il significato dei metodi già esistenti. In altre parole, "stabile" non (necessariamente) significa "completo".
ko: 이 API들에 새로운 기능이 추가된다면, 이 기능들은 이미 존재하는 메소드들의 의미를 바꾸거나 중단시키지 않을 것 입니다. 다시 말하면 "안정적인 것"의 의미는 (어쩔 수 없이) "완벽한 것"이 아닙니다.
pt_br: Se novas funcionalidades forem adicionadas a estas APIs -- o que é bem possível -- elas não quebrarão ou alterarão o significado de métodos já existentes. En outras palavras, "estável" não significa (necessariamente) "completo".
zh_hans: 如果文档中的 API 添加了新特性（这是极有可能的），新特性不会导致现有方法罢工或者修改方法的含义。也就是说，“稳定性”并不意味着“不变性”。

source: If, for some reason, an API declared stable must be removed or replaced, it will be declared deprecated but will remain in the API for at least two feature releases. Warnings will be issued when the deprecated method is called.
el: Αν, για κάποιο λόγο, ένα API, δηλωμένο ως σταθερό, χρειαστεί να αφαιρεθεί ή να αντικατασταθεί, θα οριστεί ως deprecated και θα παραμείνει στο Django για τις επόμενες δύο διανομές, τουλάχιστον. Αν χρησιμοποιείτε, στον κώδικα σας, αυτό το API τότε θα εμφανίζονται κατάλληλα warnings για να σας ενημερώνουν σχετικά με το deprecation του API αυτού.
it: Se, per qualche motivo, una API dichiarata stabile deve essere rimossa o sostituta, verrà definita come deprecata ma rimarrà tra le API per almeno due rilasci futuri. Si riceveranno degli avvertimenti quando si chiameranno i metodi deprecati.
ko: 만약 어떤 이유로 안정적인 것에 선언된 API가 삭제되야 하거나 대체되야 한다면, 이것은 사용 금지로 선언될 것 입니다 그러나 이것은 앞으로 두번의 릴리스에서 API에 포함될 것 입니다. 사용이 금지된 메소드가 호출될 때 경고들이 발생될 것 입니다.
pt_br: Se, por alguma razão, uma API declarada estável deva ser removida ou substituída, ela será declarada como obsoleta, mas continuará na API ao menos durante duas versões futuras. Mensagens de aviso serão geradas quando métodos marcados como obsoletos são usados.
zh_hans: 假如因为某些原因，一个“稳定的” API 必须被移除或者被代替，它将会被弃用但仍然会被保留直到至少有两个新特性发布。当调用即将被弃用的方法时，会产生警告。

source: See :ref:`official-releases` for more details on how Django's version numbering scheme works, and how features will be deprecated.
el: Δείτε στις :ref:`επίσημες διανομές <official-releases>` για περισσότερες πληροφορίες σχετικά με την αρίθμηση των εκδόσεων του Django και την πολιτική του deprecation του Django.
it: Controlla :ref:`official-releases` per maggiori dettagli su come funziona lo scema di numerazione delle versioni di Django, e come le features saranno deprecate.
ko: :ref:`official-releases`\에 Django 버전 번호를 붙이는 기준과, 어떻게 기능들이 비활성화 되는지에 대한 자세한 설명이 있습니다.
pt_br: Veja :ref:`official-releases` para mais informações sobre como a numeração de versão do Django funciona e como funcionalidades serão marcadas como obsoletas..
zh_hans: 有关 Django 是如何编写版本号以及一些功能是如何被弃用的详细信息，请看： :ref:`official-releases`。

source: We'll only break backwards compatibility of these APIs without a deprecation process if a bug or security hole makes it completely unavoidable.
it: Interromperemo la retrocompatibilità di quelle API senza un processo di deprecazione se un bug oppure un problema di sicurezza lo rende completamente inevitabile.
ko: 저희는 버그나 보안상 문제가 발생하지 않는 이상 이전 버전 호환성을 지킵니다.
pt_br: Só quebraremos a compatibilidade retroativa dessas APIs sem um processo de depreciação se um bug ou falha de segurança o tornar completamente inevitável.
zh_hans: 如果一个 bug 或安全漏洞完全不可避免，我们才会直接打破这些 API 的向后兼容性而不走弃用过程。

source: Stable APIs
el: Σταθερά APIs
it: API stabili
ko: 안정적인 API들
pt_br: APIs Estáveis
zh_hans: 稳定的 API

source: In general, everything covered in the documentation -- with the exception of anything in the :doc:`internals area </internals/index>` is considered stable.
el: Γενικά, οτιδήποτε είναι γραμμένο στο εγχειρίδιο του Django, με εξαίρεση αυτά που είναι γραμμένα στα :doc:`εσωτερικά του Django </internals/index>`, θεωρείται σταθερό.
it: In generale, tutto quello che è coperto nella documentazione -- ad eccezione di qualsiasi cosa si trovi nell'area :doc:`internals area </internals/index>` è da considerarsi stabile.
ko: 일반적으로 모든 것을 문서에서 다루되 :doc:`내부 영역 </internals/index>`\에 있는 것은 안정적이라고 간주합니다.
pt_br: Em geral, tudo coberto na documentação -- com exceção de tudo em :doc:`internals area </internals/index>` é considerado como estável.
zh_hans: 一般来说，文档中的一切都确定是稳定的，除开 :doc:`内部区域 </internals/index>`。

source: Exceptions
el: Εξαιρέσεις
it: Eccezioni
ko: 예외
pt_br: Exceções
zh_hans: 例外

source: There are a few exceptions to this stability and backwards-compatibility promise.
el: Ωστόσο, υπάρχουν μερικές εξαιρέσεις στην ανωτέρω υπόσχεση σχετικά με τη σταθερότητα και την συμβατότητα με παλαιότερες εκδόσεις.
it: Ci sono alcune eccezioni per questa promessa di stabilità e retrocompatibilità.
ko: 이러한 안정성과 하위 호환성 보장에 대한 몇 가지 예외가 있습니다.
pt_br: Existem poucas exceções a esta garantia de estabilidade e compatibilidade com versões anteriores.
zh_hans: 这种稳定性和向后兼容性承诺有一些例外。

source: Security fixes
el: Διορθώσεις σε θέματα ασφάλειας
it: Fix di sicurezza
ko: 보안 픽스
pt_br: Correções de segurança
zh_hans: 安全修复

source: If we become aware of a security problem -- hopefully by someone following our :ref:`security reporting policy <reporting-security-issues>` -- we'll do everything necessary to fix it. This might mean breaking backwards compatibility; security trumps the compatibility guarantee.
el: Αν αντιληφθούμε κάποιο πρόβλημα σχετικά με την ασφάλεια -- από κάποιον που ακολούθησε την :ref:`διαδικασία αναφοράς σφαλμάτων για θέματα ασφάλειας <reporting-security-issues>` -- θα κάνουμε ότι είναι δυνατόν για να το φτιάξουμε. Αν χρειαστεί, για λόγους ασφάλειας, θα "σπάσουμε" τη συμβατότητα με παλαιότερες εκδόσεις. Βλέπετε, η ασφάλεια προέχει της συμβατότητας.
it: Se veniamo a conoscenza di un problema di sicurezza -- magari da parte di chi segue la nostra :ref:` politica di security reporting <reporting-security-issues>` -- faremo il necessario per sistemarlo. Questo potrebbe comportare il fatto di interrompere la retrocompatibilità; la sicurezza trionfa sulla garanzia di compatibilità.
ko: 우리가 :ref:`보안 보고 정책 <reporting-security-issues>`\에 따라 보안 문제를 인지하게 되면, 그것을 해결하기 위해 무엇이든 할 것입니다. 이것은 하위 호환성을 깰 수도 있다는 말입니다. 보안이 호환성 보장보다 우선이기 때문입니다.
pt_br: Se nós tomarmos conhecimento de um problema de segurança -- com sorte feita por alguém que siga nossa :ref:`Política de Comunicação de Segurança <reporting-security-issues>` -- nós faremos todo o necessário para resolvê-lo. Isto pode significar quebrar a compatibilidade com versões anteriores; segurança acima da garantia de compatibilidade.
zh_hans: 如果我们发现了安全问题 --希望报告者遵照我们的 :ref:`安全报告政策 <reporting-security-issues>`--我们会尽一切努力解决它。 这可能意味着打破向后兼容性; 安全性优先于兼容性保证。

source: APIs marked as internal
el: APIs που έχουν οριστεί ως εσωτερικά
it: API marchiate come internal
ko: API들은 내부것으로 표시됩니다.
pt_br: API's marcadas como internas
zh_hans: 标记为内部的 API

source: Certain APIs are explicitly marked as "internal" in a couple of ways:
el: Κάποια συγκεκριμένα APIs έχουν οριστεί ως "εσωτερικά" με δύο τρόπους:
it: Alcune API sono esplicitamente marcate come "internal" in diversi modi :
ko: 어떤 API들은 다양한 방법으로 "internal"로 표시됩니다.
pt_br: Certas APIs são explicitamente marcadas como "internas" de algumas maneiras:
zh_hans: 某些API在几种方式中被明确标记为 "内部" :

source: Some documentation refers to internals and mentions them as such. If the documentation says that something is internal, we reserve the right to change it.
el: Μερικά σημεία στο εγχειρίδιο αναφέρονται στα "εσωτερικά" και τα αποκαλούν κατ’ αυτό τον τρόπο. Αν το εγχειρίδιο αναφέρει ότι κάτι είναι εσωτερικό, διατηρούμε το δικαίωμα να το αλλάξουμε.
it: Alcune documentazioni si riferiscono agli internal e li menzionano come tali. Se nella documentazione qualcosa viene annotato come internal, ci riserviamo il diritto di cambiarlo.
ko: 몇몇 문서에서 internal이라고 언급한 경우. 문서에 어떤 것이 internal이라고 되어 있을 경우, 우리는 그것을 변경할 권한이 있습니다.
pt_br: Alguma documentação refere-se a detalhes de implementação de uso interno e os menciona como tal. Se alguma documentação diz que algo é para uso interno, nós nos damos o direito de alterá-lo.
zh_hans: 一些文档提及了这些 API 并标为“内部”，如果确实如此，我们保留修改它的权利。

source: Functions, methods, and other objects prefixed by a leading underscore (``_``). This is the standard Python way of indicating that something is private; if any method starts with a single ``_``, it's an internal API.
el: Συναρτήσεις, μέθοδοι και άλλα objects με το πρόθεμα της κάτω παύλας (``_``). Αυτός είναι ο συνήθης τρόπος στην Python για να προσδιορίσουμε κάτι ως private. Αν κάποια μέθοδος ξεκινάει με μια ``_``, τότε θεωρείται εσωτερικό API.
it: Funzioni, metodi e altri oggetti con il prefisso underscore (``_``). Questo è il modo standard di Python per indicare che qualcosa è privato; se qualsiasi metodo inizia con un singolo ``_``, allora è una API internal.
ko: 밑줄(``_``)로 시작하는 함수, 메서드, 그외 객체. 이것은 Python에서 어떤 것이 비공개(private)임을 표시하는 표준 방식입니다. ``_``\로 시작하는 메서드는 내부 API입니다.
pt_br: Funções, métodos e outros objetos prefixados por um sublinha (``_``). Esta é a forma padrão em Python para indicar que algo é privado; se algum nome de método começar com um único ``_`` é uma API interna.
zh_hans: 一些函数，方法以及其他对象以下划线“_”开头，这是 Python 声明其为“私有”的标准方式，如果一个方法以单下划线“_”开头，那么这意味着它是 Django 内部的一个 API。

source: Design philosophies
el: Φιλοσοφίες σχεδιασμού
it: Design di filosofie
ko: 설계 철학
pt_br: Filosofias de Projeto
zh_hans: 设计理念

source: This document explains some of the fundamental philosophies Django's developers have used in creating the framework. Its goal is to explain the past and guide the future.
el: Αυτό το άρθρο εξηγεί μερικές από τις θεμελιώδεις φιλοσοφίες των developers του Django οι οποίοι ακολουθώντας τες, έχτισαν το framework. Ο στόχος τους είναι να εξηγήσει το παρελθόν και να οδηγήσει το μέλλον.
it: Questo documento spiega alcuni concetti fondamentali della filosofia Django che gli sviluppatori hanno usato nella creazione del framework. Lo scopo primario è quello di spiegare il passato e guidare verso il futuro.
ko: 이 문서는 Django의 개발자들이 프레임워크를 창조하는 데 사용한 기초 철학을 설명합니다. 이 문서의 목적은 과거를 설명하고 미래를 안내하는 것입니다.
pt_br: Este documento explica algumas filosofias que os desenvolvedores do Django tem usado ao criar o framework. Seu objetivo é de explicar o passado e guiar o futuro.
zh_hans: 本文档解释了 Django 开发人员在开发 Django 时使用的一些基本哲学， 它的目标是解释过去并指导未来

source: Overall
el: Γενικά
it: !!Complessivamente
ko: 일반
pt_br: Em geral
zh_hans: 总体

source: Loose coupling
el: Ανεξαρτητοποίηση μεταξύ οντοτήτων (loose coupling)
it: Accoppiamento lasco
ko: 느슨한 결합
pt_br: Acoplamento fraco
zh_hans: 松耦合

source: A fundamental goal of Django's stack is `loose coupling and tight cohesion`_. The various layers of the framework shouldn't "know" about each other unless absolutely necessary.
el: Ένας θεμελιώδης στόχος των πολλαπλών επιπέδων του Django (models, views, templates κλπ) είναι: `ανεξαρτητοποίηση των οντοτήτων και η σταθερή συνοχή του καθενός <http://c2.com/cgi/wiki?CouplingAndCohesion>`_. Τα διάφορα επίπεδα του framework δεν θα πρέπει να "γνωρίζουν" το ένα το άλλο εκτός και αν κριθεί απολύτως αναγκαίο.
it: Uno degli obiettivi primari dello stack di Django è `loose coupling and tight cohesion`_. I vari layer del framework non dovrebbero "essere a conoscenza" l'uno dell'altro se non strettamente necessario.
ko: Django 스택의 근본적인 목표는 `느슨한 결합, 탄탄한 응집`_\입니다. 프레임워크의 각 계층은 정말로 필요하기 전에는 서로 "알지 못해야" 합니다.
pt_br: Um objetivo fundamental do Django é `acoplamento fraco e coesão forte`_. As várias camadas do framework não devem "saber" uma das outras salvo se absolutamente necessário.
zh_hans: Django 栈的基本目标是 `低耦合高内聚`_。框架里的不同层（Layers）不应该知道对方的代码，除非它们确实需要。

source: For example, the template system knows nothing about web requests, the database layer knows nothing about data display and the view system doesn't care which template system a programmer uses.
ko: 예를 들어, 템플릿 시스템은 웹 요청에 대해 아무 것도 모르고, DB 계층은 데이터 표시에 대해 아무 것도 모르고, View 시스템은 프로그래머가 사용하는 템플릿 시스템을 사용하는지와 무관합니다.
pt_br: Por exemplo, o sistema de modelo não sabe nada sobre solicitações da web, a camada de banco de dados não sabe nada sobre exibição de dados e o sistema de exibição não se importa com qual sistema de modelo um programador usa.

source: Although Django comes with a full stack for convenience, the pieces of the stack are independent of another wherever possible.
el: Παρόλο που, για λόγους ευκολίας, το Django περιέχει όλα τα επίπεδα προεγκατεστημένα, καθένα από αυτά είναι ανεξάρτητο του άλλου, όπου αυτό είναι δυνατόν.
it: Sebbene Django venga fornito come full stack per convenienza, i pezzi dello stack sono indipendenti uno dall'altro quando possibile.
ko: Django는 편의성을 위해 풀 스택으로 제공되지만, 스택의 각 부분은 가능한 한 독립성을 띱니다.
pt_br: Embora o Django venha com uma pilha de soluções completa por conveniência, as peças desta pilha de soluções são independentes uma das outras sempre que possível.
zh_hans: 尽管为了方便 Django 带有一个完整的堆栈，但堆栈的各个部分尽可能独立于另一个堆栈。

source: Less code
el: Λιγότερος κώδικας
it: Meno codice
ko: 적은 코드
pt_br: Menos código
zh_hans: 更少的代码

source: Django apps should use as little code as possible; they should lack boilerplate. Django should take full advantage of Python's dynamic capabilities, such as introspection.
el: Οι Django εφαρμογές (apps) θα πρέπει να χρησιμοποιούν όσο το δυνατόν λιγότερο κώδικα. Με άλλα λόγια θα πρέπει να στερούνται στερεότυπους κώδικες. Το Django θα πρέπει να εκμεταλλευτεί πλήρως τις δυναμικές ικανότητες της Python όπως είναι η ενδοσκόπηση (introspection).
it: Le applicazioni Django dovrebbero usare meno codice possibile; non dovrebbero esserci boilerplate. Django dovrebbe trarre pieno vantaggio delle capacità dinamiche di Python, come l'introspezione.
ko: Django는 가능한 한 최소한의 코드를 사용하며, 틀에 박힌 코드를 배제합니다. Django는 인트로스펙션과 같은 Python의 동적인 기능을 최대한 활용합니다.
pt_br: Aplicações Django devem usar o mínimo possível de código; elas não devem ter código padrão. Django deve aproveitar as características dinâmicas do Python, como introspecção.
zh_hans: Django 应用的代码应该尽可能地精简，Django 应该充分利用 Python 的动态能力，比如自省机制（introspection）。

source: Quick development
el: Γρήγορη ανάπτυξη
it: Sviluppo rapido
ko: 신속한 개발
pt_br: Desenvolvimento Rápido
zh_hans: 快速开发

source: The point of a web framework in the 21st century is to make the tedious aspects of web development fast. Django should allow for incredibly quick web development.
ko: 21세기 웹 프레임워크의 핵심은 웹 개발의 지루한 부분을 빠르게 만드는 것입니다. Django는 놀랄만큼 빠른 웹 개발을 가능하게 합니다.
pt_br: O objetivo de uma estrutura da Web no século 21 é tornar rápidos os aspectos tediosos do desenvolvimento da Web. O Django deve permitir um desenvolvimento web incrivelmente rápido.

source: Don't repeat yourself (DRY)
el: Μην επαναλαμβάνεστε (Don't repeat yourself, DRY)
it: Non ti ripetere! (DRY – Don't repeat yourself)
ko: 반복하지 말 것(DRY)
pt_br: Não repita a si mesmo (DRY)
zh_hans: 不要重复地造轮子 (DRY)

source: Every distinct concept and/or piece of data should live in one, and only one, place. Redundancy is bad. Normalization is good.
el: Κάθε ξεχωριστή έννοια ή/και κάποιο κομμάτι δεδομένων θα πρέπει να βρίσκεται σε ένα και μόνο ένα σημείο. Ο πλεονασμός είναι κακός. Η ομαλοποίηση είναι καλή.
it: Ogni singolo concetto e/o pezzo di dato dovrebbe vivere in uno ed un solo posto solo. La ridondanza è una cattiva abitudine. La normalizzazione è una buona abitudine.
ko: 고유한 개념 및 데이터는 단 한 번, 단 한 곳에 존재하는 것으로 족합니다. 중복성은 나쁜 것이고, 정규화는 좋은 것입니다.
pt_br: Cada conceito distinto e/ou dado deve estar em um, e apenas um, lugar. Redundância é ruim. Normalização é bom.
zh_hans: 每个独特的概念或数据片应该存在且只存在于一个地方。避免冗余，做好标准化。

source: The framework, within reason, should deduce as much as possible from as little as possible.
el: Το framework, μέσα σε λογικά πλαίσια, θα πρέπει να εξάγει όσο το δυνατόν περισσότερα από όσο το δυνατόν λιγότερα.
it: Il framework, entro limiti ragionevoli, dovrebbe dedurre il più possibile dal meno possibile.
ko: 그러한 이유로, 본 프레임워크는 최소한의 것들을 가지고 최대한의 것을 만들어내도록 합니다.
pt_br: O framework deve deduzir, razoavelmente, o máximo possível do mínimo possível.
zh_hans: 合理的框架应该从尽可能少的信息中推断出尽可能多的需求。

source: The `discussion of DRY on the Portland Pattern Repository`__
el: `Συζήτηση για το DRY στο Portland Pattern Repository <http://c2.com/cgi/wiki?DontRepeatYourself>`__
it: La `discussion of DRY on the Portland Pattern Repository`__
ko: `Portland Pattern Repository의 DRY에 관한 논의`__
pt_br: A `discussion of DRY on the Portland Pattern Repository`__
zh_hans: `波特兰模式知识库中关于DRY的讨论`__

source: Explicit is better than implicit
el: Το να λες κάτι ρητά είναι καλύτερο απ’ το να το υπονοείς (Explicit is better than implicit)
it: Esplicito è meglio di implicito
ko: 명시적인 것이 묵시적인 것보다 낫다
pt_br: Explícito é melhor que implícito
zh_hans: 明确优于隐式
