Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: el, it, ko, pt_br, zh_hans

source: We also encourage all distributors to subscribe to the |django-announce| mailing list, which is a (very) low-traffic list for announcing new releases of Django and important bugfixes.
el: Επίσης ενθαρρύνουμε όλους τους διανομής να εγγραφούν στη mailing list |django-announce|, η οποία είναι μια (πολύ) χαμηλής κίνησης λίστα σχετικά με ανακοινώσεις νέων εκδόσεων του Django καθώς και σημαντικών διορθώσεων σφαλμάτων.
it: Incoraggiamo anche tutti i distributori ad iscriversi alla mailing list |django-announce|, che è una mailing list a traffico (molto) basso finalizzata all'annuncio dei nuovi rilasci di Django e di importanti bugfix.
ko: 모든 배포자는 |django-announce| 메일링 리스트를 구독하기 바랍니다. Django 및 중요 버그 픽스의 릴리스가 아주 가끔씩 올라옵니다.
pt_br: Nós também encorajamos todos os distribuidores para se inscrever na lista de emails |django-announce|, a qual é uma lista de (muito) baixo tráfego para anunciar novas versões de Django e importantes correções.
zh_hans: 我们还鼓励所有的发行者订阅 |django-announce| 邮件列表，这是一个（非常）低流量的列表，用于发布 Django 的新版本和重要的bug修复。

source: Meta-documentation and miscellany
el: Εγχειρίδιο Meta και πολλά άλλα
it: Meta-documentazione e miscellanea
ko: 메타 문서 및 기타
pt_br: Meta-documentação e miscelâneas
zh_hans: 元文件和杂记

source: Documentation that we can't find a more organized place for. Like that drawer in your kitchen with the scissors, batteries, duct tape, and other junk.
el: Αυτό αποτελεί ένα εγχειρίδιο για το οποίο δεν βρήκαμε καταλληλότερη θέση παρά αυτή εδώ. Όπως ακριβώς συμβαίνει με ένα συρτάρι της κουζίνας σας μέσα στο οποίο έχετε ψαλίδια, μπαταρίες, σελοτέιπ και άλλα, ασύνδετα με την κουζίνα, μικροπράγματα.
it: Documentazione per la quale non possiamo trovare una collocazione più organizzata. Come quel cassetto nella tua cucina, che contiene forbici, batterie, nastro isolante e cose inutili.
ko: 적당한 분류를 찾을 수 없는 문서들이 여기 있습니다. 잡동사니를 넣어두는 서랍 같은 곳입니다.
pt_br: Documentação que não podemos encontrar um lugar mais organizado. Como aquela gaveta na sua cozinha com tesouras, baterias, fita adesiva e outras porcarias.
zh_hans: 我们无法为这部分文档找到一个更有条理的地方。就像你厨房里的某个抽屉里，有剪刀、电池、胶带和其他垃圾。

source: For example, the template system knows nothing about Web requests, the database layer knows nothing about data display and the view system doesn't care which template system a programmer uses.
el: Για παράδειγμα, το σύστημα των templates δε ξέρει απολύτως τίποτα σχετικά με τα Web requests, το επίπεδο της βάσης δεδομένων δε ξέρει τίποτα για την εμφάνιση των δεδομένων και, τέλος, δεν ενδιαφέρει το σύστημα των views ποιο σύστημα template χρησιμοποιεί ο προγραμματιστής.
it: Per esempio, il sistema di template non sa nulla delle richieste Web, il layer del Database non sa nulla di come vengono mostrati i dati ed il sistema delle view non si cura di quale sistema di template sta usando il programmatore.
zh_hans: 例如，模板系统不需要知道用户的 Web 请求，数据库层不需要了解如果显示数据，而视图并不关心程序员所使用的模板系统。

source: The point of a Web framework in the 21st century is to make the tedious aspects of Web development fast. Django should allow for incredibly quick Web development.
el: Ο στόχος ενός Web framework, στον 21ο αιώνα, είναι να κάνει τις ανιαρές πτυχές του Web development γρήγορες. Το Django κάνει τη διαδικασία του Web development εξαιρετικά γρήγορη.
it: Il punto fondamentale di un Web framework nel 21esimo secolo è di rendere veloci gli aspetti noiosi dello sviluppo Web. Django dovrebbe permettere uno sviluppo Web incredibilmente rapido.
zh_hans: 在 21 世纪，Web 框架的核心一点是让 Web 开发中枯燥的事情处理得更加快速，Django 可以做到快速的 Web 开发。

source: File extensions in Web-page URLs should be avoided.
el: Οι καταλήξεις αρχείων στα URLs ιστοσελίδων πρέπει να αποφεύγονται.
it: Le estensioni di file nelle URL di una pagina Web dovrebbero essere evitate.
zh_hans: 在 URL 中应避免出现文件后缀名。

source: Technically, ``foo.com/bar`` and ``foo.com/bar/`` are two different URLs, and search-engine robots (and some Web traffic-analyzing tools) would treat them as separate pages. Django should make an effort to "normalize" URLs so that search-engine robots don't get confused.
el: Σε τεχνικό επίπεδο, το ``foo.com/bar`` και ``foo.com/bar/`` είναι δύο διαφορετικά URLs και τα ρομπότ των μηχανών αναζήτησης (όπως επίσης και μερικά εργαλεία ανάλυσης της κίνησης στο Web) θα τα μεταχειριστούν ως διαφορετικές σελίδες. Το Django θα πρέπει να καταβάλλει προσπάθεια προκειμένου να "ομαλοποιήσει" τα URLs ούτως ώστε τα ρομπότ των μηχανών αναζήτησης να μην μπερδευτούν.
it: Tecnicamente, ``foo.com/bar`` e ``foo.com/bar/`` sono due URL diverse, e i robot dei motori di ricerca ( ed alcuni tool di analisi de traffico Web ) le tratterebbero come pagine separate. Django dovrebbe impegnarsi a "normalizzare" le URL affinché i robot dei motori di ricerca non si confondano.
zh_hans: 技术上，``foo.com/bar`` 和 ``foo.com/bar/`` 是两条不同的 URL，搜索引擎爬虫（以及某些 Web 流量分析工具）会将其视为独立的页面。Django 会将其转为 "标准" 的 URL，让搜索引擎爬虫正确识别。

source: Django promises API stability and forwards-compatibility since version 1.0. In a nutshell, this means that code you develop against a version of Django will continue to work with future releases. You may need to make minor changes when upgrading the version of Django your project uses: see the "Backwards incompatible changes" section of the :doc:`release note </releases/index>` for the version or versions to which you are upgrading.
el: Το Django δεσμεύεται όχι μόνο για τη σταθερότητα του API αλλά και για τη μελλοντική του, από την έκδοση 1.0, συμβατότητα. Με άλλα λόγια, ο κώδικας που γράφετε, χρησιμοποιώντας μια έκδοση του Django, θα συνεχίσει να λειτουργεί και με μελλοντικές εκδόσεις. Θα χρειαστεί, μόνο, να κάνετε μερικές μικροαλλαγές όταν αναβαθμίζετε την έκδοση του Django για το project σας: δείτε στην ενότητα "Αλλαγές μη συμβατές με παλαιότερες εκδόσεις" του άρθρου :doc:`σημειώσεις διανομής </releases/index>` για την έκδοση (ή τις εκδόσεις) στην οποία αναβαθμίζετε.

source: We'll only break backwards compatibility of these APIs if a bug or security hole makes it completely unavoidable.
el: Ο μοναδικός λόγος που θα μας αναγκάσει να "σπάσουμε" τη συμβατότητα με παλαιότερες εκδόσεις είναι κάποιο σφάλμα στο API ή κάποιο κενό ασφάλειας.
