Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/misc.po
Languages: el, it, ko, pt_br, zh_hans

source: Using an XML engine to parse templates introduces a whole new world of human error in editing templates -- and incurs an unacceptable level of overhead in template processing.
el: Η χρήση μιας XML μηχανής για να αναλύσει τα templates εισάγει έναν εντελώς νέο κόσμο από ανθρώπινα λάθη κατά την επεξεργασία τους. Παράλληλα προσθέτει ένα απαράδεκτο overhead κατά την επεξεργασία του template.
it: L'utilizzo di un motore XML per fare il parse dei template introduce nuovi errori umani nell'editing dei template -- ed introduce un livello inaccettabile di overhead nel processamento dei template.
ko: 템플릿 해석을 위해 XML 엔진을 사용하게 되면 템플릿 편집에 있어서 실수가 발생할 가능성이 매우 커질 뿐 아니라, 템플릿 처리에 너무 큰 과부하가 걸립니다.
pt_br: Usar um mecanismo XML para interpretar templates introduz um mundo inteiro novo de erros humanos na edição de "templates" -- e incorre em um nível de custo inaceitável no processamento de "template".
zh_hans: 使用 XML 引擎去解析模板会在编辑模板的过程中引入很多人为错误，并在模板处理中导致不可接受的开销。

source: Assume designer competence
el: Υποθέτει τη συμμετοχή του designer
it: Ingaggia designer competenti
ko: 디자이너가 코딩 능력이 있는 것으로 가정
pt_br: Assume a competência do designer
zh_hans: 承担设计能力

source: The template system shouldn't be designed so that templates necessarily are displayed nicely in WYSIWYG editors such as Dreamweaver. That is too severe of a limitation and wouldn't allow the syntax to be as nice as it is. Django expects template authors are comfortable editing HTML directly.
el: Το σύστημα template δεν θα πρέπει να σχεδιαστεί με τρόπο που τα templates να εμφανίζονται, απαραιτήτως, ως WYSIWYG επεξεργαστές, όπως το Dreamweaver. Αυτό αποτελεί σημαντικό περιορισμό και δεν επιτρέπει στη σύνταξη να είναι τόσο όμορφη όσο θα έπρεπε να είναι. Το Django υποθέτει ότι οι συντάκτες των templates είναι εξοικειωμένοι με την επεξεργασία της HTML.
it: Il sistema di template non dovrebbe essere progettato in modo da poter mostrare bene i template negli editor WYSIWYG, come ad esempio Dreamweaver. Sarebbe una limitazione troppo grande e non permette alla sintassi di essere bella come è. Django si aspetta che gli autori dei template siano in grado di fare editing direttamente sull'HTML.
ko: 템플릿 시스템은 템플릿이 반드시 드림위버(Dreamweaver) 같은 위지윅(WYSIWYG) 편집기에서 제대로 보이도록 설계하지는 않습니다. 그렇게 하려면 너무 제약이 많아지며 지금과 같이 훌륭한 구문을 유지하기 힘들기 때문입니다. Django는 템플릿 작성자가 HTML을 직접 편집하는 것을 어려워 하지 않을 것을 전제로 합니다.
pt_br: O sistema de "template" não deve ser desenhado para que os "templates" sejam mostrados necessariamente de forma bonita em editores WYSIWYG como o dreamWeaver. Essa é uma limitação muito severa e não poderia permitir que a syntaxe fosse tão boa quanto é. O Django espera que autores de "templates" estejam confortáveis em editar o HTML diretamente.
zh_hans: 模板系统不应该有的设计是，使得模板可以在WYSIWYG（所见即所得）编辑器中也能显示得很好，比如 Dreamweaver。因为这是一个非常严重的限制，会让模板的语法不够好。Django 期望模板编写者有能力直接编辑 HTML 文本。

source: Treat whitespace obviously
el: Διαχείριση των κενών χαρακτήρων με τον προφανή τρόπο
it: Trattare gli spazi bianchi ovviamente
ko: 공백에 특별한 의미를 부여하지 말 것
pt_br: Trate espaços em branco de maneira óbvia.
zh_hans: 更加直接的处理空格

source: The template system shouldn't do magic things with whitespace. If a template includes whitespace, the system should treat the whitespace as it treats text -- just display it. Any whitespace that's not in a template tag should be displayed.
el: Το σύστημα template δεν θα πρέπει να κάνει μαγικά πράγματα με τους κενούς χαρακτήρες (whitespace). Αν ένα template περιέχει κενά, τότε το σύστημα θα τα διαχειριστεί ως κείμενο και θα τα εμφανίσει. Κάθε κενό που δεν βρίσκεται μέσα σε κάποιο template tag θα εμφανίζεται.
it: Il sistema di template non dovrebbe fare magie con gli spazi bianchi. Se un template include spazi bianchi, il sistema dovrebbe trattarli così come tratta il testo -- mostrandoli. Ogni spazio bianco che non si trova in un template tag dovrebbe essere mostrato.
ko: 템플릿 시스템은 공백을 가지고 특수한 동작을 일으켜서는 안 됩니다. 템플릿에 공백이 포함되어 있으면 그것을 그저 텍스트의 공백으로서 표출(display)해야 합니다. 템플릿 태그 내에 있지 않은 모든 공백은 표출해야 합니다.
pt_br: O sistema de "template" não deve fazer coisas mágicas com espaços. Se um template inclui espaços, o sistema deve tratar espaços como trata o texto -- somente mostrá-lo. Qualquer espaço em branco que não estiver dentro de uma tag de template deve ser mostrado.
zh_hans: 模板系统不应该用空白符来做神奇的事情。如果模板包含空白符，系统应该在处理文本时处理空格——只是显示它。任何不在模板标签中的空白符都应该显示出来。

source: Don't invent a programming language
el: Όχι στην εφεύρεση μια γλώσσας προγραμματισμού
it: Non inventare un linguaggio di programmazione
ko: 프로그래밍 언어를 발명하지 말 것
pt_br: Não inventa uma linguagem de programação
zh_hans: 不要发明一种编程语言

source: The goal is not to invent a programming language. The goal is to offer just enough programming-esque functionality, such as branching and looping, that is essential for making presentation-related decisions. The :ref:`Django Template Language (DTL) <template-language-intro>` aims to avoid advanced logic.
el: Ο στόχος δεν είναι να εφεύρουμε μια γλώσσα προγραμματισμού. Ο στόχος είναι να προσφέρουμε ένα είδος προγραμματιστικής λειτουργίας στο template όπως ο βρόγχος επανάληψης και οι δομές ελέγχου, κάτι το οποίο είναι ζωτικής σημασίας όταν σχεδιάζουμε ένα template. H :ref:`Γλώσσα Template του Django (DTL) <template-language-intro>` αποφεύγει τις προχωρημένες λογικές.
it: La finalità non è quella di inventare un linguaggio di programmazione. Il fine è quello di offrire un buon numero di funzionalità "da programmazione", come il branching ed il looping, essenziali per le decisioni a livello di presentazione. Il :ref:`Linguaggio dei Template di Django (DTL)<template-language-intro> mira ad evitare la logica avanzata.
ko: 프로그래밍 언어의 발명을 목적으로 하는 것이 아닙니다. 분기와 반복 같이 표현 계층에 꼭 필요한 프로그래밍 기능을 제공하는 것이 목표입니다. :ref:`Django 템플릿 언어(DTL) <template-language-intro>`\는 고급 로직을 제공하지 않습니다.
pt_br: O objetivo não é inventar uma linguagem de programação. O objetivo é oferecer somente o suficiente de funcionalidade programática, tal como ramificações e loops, que é essencial para tomar decisões relacionadas a apresentação. O :ref:`Linguagem de Template do Django (sigla DTL em inglês) <template-language-intro>` tenta evitar lógica avançada.
zh_hans: 模板系统的目标不是发明一种编程语言。它的目标是提供足够的具有编程风格的功能，比如分支和循环，这对于做出表现相关的决策是至关重要的。:ref:`Django 模板语言（DTL）<template-language-intro>` 旨在避免高级逻辑。

source: The Django template system recognizes that templates are most often written by *designers*, not *programmers*, and therefore should not assume Python knowledge.
el: Το σύστημα template του Django αναγνωρίζει ότι τα templates γράφονται συχνά από *designers*, όχι από *προγραμματιστές* και, επομένως, δεν θα πρέπει να απαιτεί από τον συντάκτη να έχει γνώσεις Python.
it: Il sistema di template di Django riconosce che i template sono spesso scritti da *designers*, non da *programmatori* e quindi non dovrebbero dare per scontata la conoscenza di Python.
ko: Django 템플릿 시스템은 템플릿이 *프로그래머*\가 아닌 *디자이너*\에 의해 작성되는 것을 전제로 하므로, 그들이 Python 지식을 갖고 있을 것으로 간주해서는 안 됩니다.
zh_hans: Django 模板系统认为模板通常是由 *设计师* 编写的，而不是 *程序员*，因此不应该假设他了解 Python。

source: Safety and security
el: Ασφάλεια και προστασία
it: Sicurezza e security
ko: 안전과 보안
pt_br: Segurança
zh_hans: 安全与保障

source: The template system, out of the box, should forbid the inclusion of malicious code -- such as commands that delete database records.
el: Το σύστημα template, εξ ορισμού, θα πρέπει να μην επιτρέπει την εισαγωγή κακόβουλου κώδικα -- όπως εντολές οι οποίες διαγράφουν δεδομένα από την βάση δεδομένων.
it: Il sistema di template, out of the box, dovrebbe vietare l'iniezione di codice malevolo -- come per esempio un comando che cancella record del database.
ko: 템플릿 시스템은 데이터베이스의 레코드를 삭제하는 명령과 같은 악의적 코드를 포함할 수 없게 되어 있어야 합니다.
pt_br: O sistema de template, tal como foi feito, deve coibir a inclusão de código malicioso -- tal como comandos que deletam registros de banco de dados.
zh_hans: 开箱即用的模板系统禁止包含恶意代码，例如删除数据库记录的代码。

source: This is another reason the template system doesn't allow arbitrary Python code.
el: Αυτός είναι ένας άλλος λόγος που το σύστημα template δεν επιτρέπει την εισαγωγή Python κώδικα.
it: Questo è un altro motivo per il quale il sistema di template non permette l'utilizzo di codice Python arbitrario.
ko: 이것은 템플릿 시스템이 임의의 Python 코드를 실행할 수 없는 또 다른 이유이기도 합니다.
pt_br: Este é outro motivo pelo qual o sistema de template não permite código Python arbitrário.
zh_hans: 这就是模板系统不允许有任意Python代码的另一个原因。

source: Extensibility
el: Επεκτασιμότητα
it: Estensibilità
ko: 확장성
pt_br: Extensibilidade
zh_hans: 可扩展性

source: The template system should recognize that advanced template authors may want to extend its technology.
el: Το σύστημα template θα πρέπει να παρέχει στους προχωρημένους συντάκτες template τη δυνατότητα επέκτασης και περαιτέρω παραμετροποίησης του.
it: Il sistema di template dovrebbe riconoscere che autori di template avanzati potrebbero voler estendere la sua tecnologia.
ko: 높은 수준의 기술을 가진 템플릿 작성자는 템플릿 시스템을 확장할 수 있습니다.
pt_br: O sistema de "template" deve reconhecer que autores de "template" avançados talvez queiram extender sua tecnologia.
zh_hans: 模板系统应该认识到, 高阶的模板作者可能想扩展它.

source: This is the philosophy behind custom template tags and filters.
el: Αυτή είναι η φιλοσοφία πίσω από τα παραμετροποιήσιμα φίλτρα και template tags.
it: Questa è la filosofia che sta dietro ai filtri ed ai template tag personalizzati.
ko: 맞춤 템플릿 태그와 필터는 이러한 철학을 바탕으로 합니다.
pt_br: Esta é a filosofia por trás das "tags" e filtros personalizadas.
zh_hans: 这是自定义的模板标签和过滤器背后的理念.

source: Views
it: View
ko: 뷰
zh_hans: 视图

source: Simplicity
el: Απλότητα
it: Semplicità
ko: 단순성
pt_br: Simplicidade
zh_hans: 简洁

source: Writing a view should be as simple as writing a Python function. Developers shouldn't have to instantiate a class when a function will do.
el: Η σύνταξη ενός view θα πρέπει να είναι τόσο απλή όσο μιας Python συνάρτησης. Οι developers δεν θα πρέπει να αρχικοποιούν (instantiate) μια κλάση όταν μπορούν να χρησιμοποιήσουν, απλώς, μια συνάρτηση.
it: Scrivere una vista/view dovrebbe essere semplice come scrivere una funzione Python. Gli sviluppatori non dovrebbero preoccuparsi di istanziare una classe quando potrebbe andare bene una funzione.
ko: 뷰를 작성하는 것은 Python 함수를 작성하는 것만큼 단순해야 합니다. 개발자는 함수로 처리할 수 있는 일을 하기 위해 클래스의 인스턴스를 굳이 생성하지 않아도 됩니다.
pt_br: Escrever uma "view" deve ser tão simples quanto escrever uma função Python. Desenvolvedores não devem ter que instânciar uma classe enquanto uma função resolve.
zh_hans: 编写视图应该和编写 Python 函数一样简单。开发人员不应该在函数执行时实例化一个类。

source: Use request objects
el: Χρήση των request objects
it: Usare oggetti per le richieste
ko: 요청 객체의 사용
pt_br: Use objetos de requisição
zh_hans: 使用请求对象

source: Views should have access to a request object -- an object that stores metadata about the current request. The object should be passed directly to a view function, rather than the view function having to access the request data from a global variable. This makes it light, clean and easy to test views by passing in "fake" request objects.
el: Τα views θα πρέπει να έχουν πρόσβαση σε ένα request object -- ένα object, δηλαδή, που αποθηκεύει metadata σχετικά με το τρέχον request (αυτό που έκανε ο χρήστης). Το object θα πρέπει να περαστεί απ’ ευθείας στη συνάρτηση view, παρά η συνάρτηση view να έχει πρόσβαση στα request data μέσω μιας global μεταβλητής. Αυτό το καθιστά ελαφρύ, καθαρό και εύκολο να ελεγχθούν τα views περνώντας ως όρισμα "ψεύτικα" request objects.
it: Le viste/views dovrebbero avere accesso ad un oggetto 'request' -- un oggetto che fornisce metadati sulla richiesta attuale. L'oggetto dovrebbe essere passato direttamente ad una funzione view, piuttosto che lasciare che la funzione view abbia accesso ad una variabile globale con i dati richiesti. Questo rende semplice, pulito e facile, testare la view passando un oggetto request fittizio.
ko: 뷰는 요청 객체(현재 요청에 대한 메타데이터를 갖는 객체)에 접근할 수 있어야 합니다. 뷰 함수가 글로벌 변수의 요청 데이터에 접근하도록 하지 말고, 요청 객체를 뷰 함수에 직접 전달합니다. "가짜" 요청 객체를 전달함으로써 가볍고 깔끔하며 쉬운 테스트 뷰를 만들 수 있습니다.
pt_br: "Views" devem ter acesso a um objeto de requisição -- um objeto que armazena metadados sobre a requisição corrente. O objeto deve ser passado diretamente a uma função "view", ao invés da função "view" ter que acessar os dados de uma requisição vindos de uma variável global. Isso faz com que seja leve, limpo e fácil de testar "views" passando um objeto de requisição "de mentira".
zh_hans: 视图应该能够访问一个请求对象——一个储存关于当前请求的元数据的对象。对象应该直接传递给视图函数，而不是必须从全局变量访问请求数据的视图函数。这使得通过传入“假”请求对象来测试视图变得轻松、干净和容易。

source: A view shouldn't care about which template system the developer uses -- or even whether a template system is used at all.
el: Ένα view δεν θα πρέπει να ενδιαφέρεται για το σύστημα template που χρησιμοποιεί ο developer -- ή ακόμη και για το αν χρησιμοποιείται κάποιο.
it: Una view non si dovrebbe curare di quale sistema di template utilizza lo sviluppatore - e nemmeno del fatto che si utilizzi o meno un sistema di template.
ko: 뷰는 개발자가 어느 템플릿 시스템을 사용하는지, 혹은 템플릿 시스템을 사용하는지에 무관해야 합니다.
pt_br: Uma "view" não deve se preocupar sobre qual sistema de template o desenvolvedor usa -- ou mesmo se um sistema de templates está sendo usado.
zh_hans: 视图不应该关心开发人员使用哪种模板——甚至根本不用模板系统。

source: Differentiate between GET and POST
el: Διαφοροποίηση μεταξύ GET και POST
it: Distinguere tra GET e POST
ko: GET과 POST를 구분
pt_br: Diferencie entre GET e POST.
zh_hans: GET 方法和 POST 方法的区别

source: GET and POST are distinct; developers should explicitly use one or the other. The framework should make it easy to distinguish between GET and POST data.
el: Το GET και το POST είναι ξεχωριστά. Οι developers θα πρέπει να δηλώνουν ρητώς ποια μέθοδο θα χρησιμοποιούν. Το framework θα πρέπει να κάνει εύκολο το διαχωρισμό μεταξύ των GET και POST δεδομένων.
it: GET e POST sono distinti; gli sviluppatori dovrebbero espressamente usare l'uno o l'altro. Il framework dovrebbe rendere facile la distinzione di dati GET e POST.
ko: GET과 POST는 고유한 것이므로, 개발자는 명시적으로 둘 중 하나를 사용해야 합니다. 본 프레임워크는 GET과 POST 데이터를 쉽게 구분할 수 있도록 해야 합니다.
pt_br: GET e POST são distintintos; desenvolvedores devem usar explcitamente um ou outro. O framework tornar fácil a distinção entre dados de GET e POST.
zh_hans: GET 和 POST 是不同的；开发人员应该明确地使用其中一个或另一个。框架应该使得 GET 和 POST 数据很容易区分。

source: Cache Framework
ko: 캐시 프레임워크
pt_br: Framework de Cache
zh_hans: 缓存框架

source: The core goals of Django's :doc:`cache framework </topics/cache>` are:
el: Οι βασικοί στόχοι του :doc:`cache framework </topics/cache>` του Django είναι:
it: Gli obbiettivi primari di Django :doc:`cache framework </topics/cache>` sono :
ko: Django :doc:`캐시 프레임워크 </topics/cache>`\의 핵심 목표는 다음과 같습니다.
pt_br: O principais objetivos do Django :doc:`framework de cache </topics/cache>` são:
zh_hans: :doc:`缓存框架 </topics/cache>` 的核心目的是：

source: A cache should be as fast as possible. Hence, all framework code surrounding the cache backend should be kept to the absolute minimum, especially for ``get()`` operations.
el: Μια cache θα πρέπει να είναι όσο γίνεται πιο γρήγορη. Επομένως, όλος ο κώδικας του framework που περιβάλλει την cache backend θα πρέπει να διατηρείται σε χαμηλά επίπεδα, ειδικά για περιπτώσεις που ζητάμε κάτι από την cache (``get()``).
it: Una cache dovrebbe essere il più veloce possibile. Quindi, tutto il codice del framework che sta attorno al backend della cache dovrebbe essere assolutamente minimale, specialmente per quanto riguarda le operazioni ``get()``.
ko: 캐시는 가능한 한 빨라야 합니다. 캐시 백엔드와 관련된 모든 프레임워크 코드, 특히 ``get()`` 연산은 군더더기 없이 최소한을 남겨야 합니다.
pt_br: O "cache" deve ser tão rápido quanto possível. Consequentemente, todo o código do framework em torno do "backend de cache" deve ser mantido no mínimo absoluto, especialmente para operações ``get()``.
zh_hans: 缓存应该尽可能快。因此，围绕缓存后端的所有框架代码都应该保持在绝对的最小值，特别是对于 ``get()`` 操作。

source: The cache API should provide a consistent interface across the different cache backends.
el: Το API της cache θα πρέπει να παρέχει ένα interface με συνοχή ανάμεσα σε διαφορετικά cache backends.
it: La API della cache dovrebbe offrire una interfaccia consistente per tutti i differenti backend di cache.
ko: 캐시 API는 여러 캐시 백엔드에 대해 일관적 인터페이스를 제공해야 합니다.
pt_br: A API de "cache" deve fornecer uma interface consistente através de "backends de cache" diferentes.
zh_hans: 缓存 API 应该为不同的缓存后端提供一致的接口。

source: The cache API should be extensible at the application level based on the developer's needs (for example, see :ref:`cache_key_transformation`).
el: Το API της cache θα πρέπει να είναι επεκτάσιμο σε επίπεδο εφαρμογής ανάλογα με τις απαιτήσεις του developer (για παράδειγμα, δείτε στην :ref:`αλλαγή κλειδιών της cache <cache_key_transformation>`).
it: La API della cache dovrebbe essere estendibile al livello di applicazione a seconda delle esigenze dello sviluppatore (per esempio, vedi :ref:`cache_key_transformation`)
ko: 캐시 API는 개발자의 요구에 따라 애플리케이션 수준에서 확장 가능해야 합니다(:ref:`cache_key_transformation` 참조).
pt_br: A API de "cache" deve ser extensível no nível da aplicação baseado nas necessidades dos desenvolvedores (por exemplo, veja :ref:`cache_key_transformation`).
zh_hans: 缓存 API 应该基于开发者的需求，在应用程序级别上是可扩展的（例如，参见 :ref:`cache_key_transformation`）。

source: Third-party distributions of Django
el: Διανομές του Django από τρίτους
it: Distribuzioni di terze parti di Django
ko: Django의 서드 파티 분배
pt_br: Distribuição do Django feita por terceiros
zh_hans: Django 的第三方发布包

source: Many third-party distributors are now providing versions of Django integrated with their package-management systems. These can make installation and upgrading much easier for users of Django since the integration includes the ability to automatically install dependencies (like database adapters) that Django requires.
el: Πολλοί διανομείς παρέχουν εκδόσεις του Django οι οποίες είναι ενσωματωμένες με τον διαχειριστή πακέτων του συστήματος. Αυτό μπορεί να κάνει την εγκατάσταση ή/και την αναβάθμιση του Django παιχνιδάκι για τους χρήστες, αφού ο διαχειριστής πακέτων αναλαμβάνει και την εγκατάσταση των dependencies (όπως adapters για τη βάση δεδομένων, πχ για την PostgreSQL θα χρειαστεί το psycopg2) που απαιτεί το Django, αυτόματα. Η μόνη προσοχή που πρέπει να δώσετε είναι η έκδοση του Django που έρχεται με τον διαχειριστή πακέτων καθώς ενδέχεται να μην είναι η τρέχουσα σταθερή αλλά κάποια προηγούμενη.
it: Molti distributori di terze parti stanno offrendo versioni di Django integrate con il loro sistemi di package-management. Questi ultimi possono rendere l'installazione e l'aggiornamento molto più facile per gli utenti Django, poichè l'integrazione include l'abilità di installare automaticamente le dipendenze (come i database adapters) che Django richiede.
ko: 많은 서드 파티 배포자가 Django를 각자의 패키지 관리 시스템에서 제공하고 있습니다. 이는 Django가 의존하는 패키지(예: 데이터베이스 어댑터)를 자동으로 설치해줌으로써 사용자가 Django를 쉽게 설치 및 업그레이드할 수 있게 해줄 수 있습니다.
pt_br: Muitos distribuidores terceiros estão agora fornecendo versões de Django integradas com seus sistema de gerenciamento de pacotes. Isso pode tornar a inatalação e atualização muito mais fácil para usuário de Django uma vez que a integração inclue a abilidade de instalar dependências automaticamente (como adaptadores de bancos de dados) que o Django requer.
zh_hans: 许多第三方分销商现在正在提供与他们的软件包管理系统集成的 Django 版本。这些可以使 Django 的用户更容易安装和升级，因为集成包括了自动安装 Django 需要的依赖关系（如数据库适配器）的功能。

source: Typically, these packages are based on the latest stable release of Django, so if you want to use the development version of Django you'll need to follow the instructions for :ref:`installing the development version <installing-development-version>` from our Git repository.
el: Αν θέλετε να χρησιμοποιήσετε την αναπτυξιακή έκδοση (development version) του Django θα πρέπει να ακολουθήσετε τις οδηγίες :ref:`εγκατάστασης της αναπτυξιακής έκδοσης <installing-development-version>`. Η αναπτυξιακή έκδοση του Django υπάρχει στο Git repository.
it: Tipicamente, questi package sono basati sull'ultima versione stabile di Django, quindi se vuoi usare la versione di sviluppo di Django dovrai seguire le istruzioni per :ref:`installare la versione di sviluppo<installing-development-version> ` dal nostro repository Git.
ko: 이러한 패키지는 Django의 최종 릴리스에 기초를 두는 것이 일반적이므로, 만약 Django의 개발 버전을 사용하고 싶으면 우리의 Git 저장소에 있는 :ref:`개발 버전 설치 <installing-development-version>` 지침을 따라야 합니다.
pt_br: Tipicamente, estes pacotes são baseados na última versão estável do Django, então se você quiser usar a versão em desenvolvimento do Django você precisa seguir as instruções para :ref:`instalar a versão de desenvolvimento <installing-development-version>` do nosso repositório Git.
zh_hans: 通常，这些包基于 Django 的最新稳定版本，因此如果您想使用 Django 的开发版本，则需要从我们的 Git 库中安装 :ref:`安装开发版本 <installing-development-version>`。

source: If you're using Linux or a Unix installation, such as OpenSolaris, check with your distributor to see if they already package Django. If you're using a Linux distro and don't know how to find out if a package is available, then now is a good time to learn. The Django Wiki contains a list of `Third Party Distributions`_ to help you out.
el: Αν χρησιμοποιείτε Linux ή κάποια Unix εγκατάσταση, όπως η OpenSolaris, δείτε μέσω του διανομέα σας αν έχουν διαθέσιμο ως πακέτο το Django. Αν χρησιμοποιείτε μια διανομή Linux και δεν ξέρετε πως να βρείτε αν ένα πακέτο είναι διαθέσιμο, τότε τώρα είναι μια καλή ευκαιρία για να μάθετε. Το Django Wiki περιέχει μια λίστα με `Διανομείς τρίτων πακέτων <https://code.djangoproject.com/wiki/Distributions>`_ για να σας βοηθήσει.
it: Se stai utilizzando una installazione di Linux o Unix, come Open Solaris, controlla con il distributore se include già Django. Se stai usando una distribuzione Linux e non sai come controllare se un package è disponibile, è il momento giusto per imparare. Lo Django Wiki contiene una lista di `Distribuzioni di terze parti`_ per aiutarti.
ko: Linux 또는 Unix(예: OpenSolaris) 사용자는 Django 패키지가 이미 있는지 확인하세요. Linux 배포판을 사용하지만 패키지를 찾는 방법을 모른다면, 지금이 배울 기회입니다. Django 위키의 `Third Party Distributions`_\가 도움이 될 것입니다.
pt_br: Se você está usando Linux ou uma instalação Unix, tal como OpenSolaris, verifique com seu distribuidor para verificar se eles já empacotam o Django. Se você está usando uma distro Linux e não sabe como descobrir se um pacote está disponível, então agora é uma boa hora pra aprender. A wiki do Django contém uma lista de `Third Party Distributions`_ para lhe ajudar.
zh_hans: 如果您正在使用 Linux 或 Unix 的安装版，比如 OpenSolaris，请与您的经销商联系，看看他们是否已经打包了 Django。如果您使用的是Linux发行版，并且不知道如何弄清一个包是否可用，那么现在是学习的好时机。Django Wiki 包含一个“第三方发行版”列表，以帮助您解决问题。

source: For distributors
el: Για τους διανομείς
it: Per distributori
ko: 배포자에게
pt_br: Para distribuidores
zh_hans: 对于发布者

source: If you'd like to package Django for distribution, we'd be happy to help out! Please join the |django-developers| mailing list and introduce yourself.
el: Αν θέλετε να πακετάρετε το Django για διανομή, θα χαρούμε να σας βοηθήσουμε! Παρακαλούμε κάντε join στη mailing list |django-developers| και συστηθείτε.
it: Se ti piacerebbe fare un package per la distribuzione di Django, saremmo felici di aiutarti! Unisciti alla mailing list |django-developers| e presentati.
ko: Django를 패키징하여 배포하고자 한다면 저희가 기꺼이 돕겠습니다! |django-developers| 메일링 리스트에 가입해서 자기 소개를 해주세요.
pt_br: Se você gostaria de empacotar o Django para distribuição, nós estaremos felizes em ajudar! Por favor se junte a lista de email |django-developers| e se apresente.
zh_hans: 如果你希望将 Django 应用打包发布，我们非常乐意提供帮助。请订阅 |django-developers| 的邮件列表并且介绍你自己。
