Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Submitting these forms would not allow direct edits to the parent model, but would trigger the parent model's ``save()`` method, and cause pre and post-save signal handlers to be invoked. This is a privilege escalation as a user who lacks permission to edit a model should not be able to trigger its save-related signals.
zh_hans: 提交这些表单将不允许直接编辑父模型，但会触发父模型的 ``save()`` 方法，并导致调用预保存和后保存信号处理程序。这是一种特权升级，因为缺少编辑模型权限的用户不应该能够触发与其保存相关的信号。

source: To resolve this issue, the permission handling code of the Django admin interface has been changed. Now, if a user has only the "view" permission for a parent model, the entire displayed form will not be editable, even if the user has permission to edit models included in inlines.
zh_hans: 为解决这个问题，Django 管理界面的权限处理代码已经进行了更改。现在，如果用户只对父模型具有"查看"权限，即使用户对内联模型具有编辑权限，整个显示的表单也将不可编辑。

source: This is a backwards-incompatible change, and the Django security team is aware that some users of Django were depending on the ability to allow editing of inlines in the admin form of an otherwise view-only parent model.
zh_hans: 这是一个不兼容的变更，Django 安全团队意识到一些 Django 用户依赖于在管理界面中允许编辑内联模型，即使父模型本身只有查看权限。

source: Given the complexity of the Django admin, and in-particular the permissions related checks, it is the view of the Django security team that this change was necessary: that it is not currently feasible to maintain the existing behavior while escaping the potential privilege escalation in a way that would avoid a recurrence of similar issues in the future, and that would be compatible with Django's *safe by default* philosophy.
zh_hans: 鉴于 Django 管理员的复杂性，尤其是与权限相关的检查，Django 安全团队认为这个改变是必要的：目前不可能在维护现有行为的同时避免潜在的特权升级，这种方式可以避免将来发生类似问题的重复发生，并且与 Django 的“默认安全”的哲学兼容。

source: For the time being, developers whose applications are affected by this change should replace the use of inlines in read-only parents with custom forms and views that explicitly implement the desired functionality. In the longer term, adding a documented, supported, and properly-tested mechanism for partially-editable multi-model forms to the admin interface may occur in Django itself.
zh_hans: 暂时来说，受到此变更影响的开发者应该将只读父模型中的内联模型替换为自定义的表单和视图，明确实现所需的功能。从长远来看，Django 可能会在管理界面中添加一个经过文档化、支持和经过适当测试的机制，用于部分可编辑的多模型表单。

source: Fixed a data loss possibility in the :meth:`~django.db.models.query.QuerySet.select_for_update()`. When using ``'self'`` in the ``of`` argument with :ref:`multi-table inheritance <multi-table-inheritance>`, a parent model was locked instead of the queryset's model (:ticket:`30953`).
zh_hans: 修复了在 :meth:`~django.db.models.query.QuerySet.select_for_update()` 中的数据丢失可能性。当在 :ref:`多表继承 <multi-table-inheritance>` 中的 ``of`` 参数中使用 ``'self'`` 时，父模型被锁定，而不是查询集的模型 (:ticket:`30953`)。

source: Django 2.1.2 release notes
zh_hans: Django 2.1.2 版本发行说明

source: Django 2.1.2 fixes a security issue and several bugs in 2.1.1. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 2.1.2 修复了 2.1.1 版本中的一个安全问题和几个错误。同时，还包含了来自 Transifex 的最新字符串翻译。

source: CVE-2018-16984: Password hash disclosure to "view only" admin users
zh_hans: CVE-2018-16984 : 密码哈希泄露给“只能查看”管理员用户

source: If an admin user has the change permission to the user model, only part of the password hash is displayed in the change form. Admin users with the view (but not change) permission to the user model were displayed the entire hash. While it's typically infeasible to reverse a strong password hash, if your site uses weaker password hashing algorithms such as MD5 or SHA1, it could be a problem.
zh_hans: 如果管理员用户具有对用户模型的更改权限，只会显示密码哈希的部分内容在更改表单中。对于具有对用户模型的查看（但不具有更改）权限的管理员用户，会显示完整的哈希。虽然通常无法反向破解强密码哈希，但如果您的网站使用较弱的密码哈希算法，如 MD5 或 SHA1，可能会存在问题。

source: Fixed a regression where nonexistent joins in ``F()`` no longer raised ``FieldError`` (:ticket:`29727`).
zh_hans: 修复了一个回归问题，即在 ``F()`` 中不存在的连接不再引发 ``FieldError`` (:ticket:`29727`)。

source: Fixed a regression where files starting with a tilde or underscore weren't ignored by the migrations loader (:ticket:`29749`).
zh_hans: 修复了一个回归问题，即以波浪符或下划线开头的文件不再被迁移加载程序忽略 (:ticket:`29749`)。

source: Made migrations detect changes to ``Meta.default_related_name`` (:ticket:`29755`).
zh_hans: 使迁移能够检测到对 ``Meta.default_related_name`` 的更改 (:ticket:`29755`)。

source: Added compatibility for ``cx_Oracle`` 7 (:ticket:`29759`).
zh_hans: 为 ``cx_Oracle`` 7 添加了兼容性 (:ticket:`29759`)。

source: Fixed a regression in Django 2.0 where unique index names weren't quoted (:ticket:`29778`).
zh_hans: 修复了 Django 2.0 中的一个回归问题，即唯一索引名称没有被引用 (:ticket:`29778`)。

source: Fixed a regression where sliced queries with multiple columns with the same name crashed on Oracle 12.1 (:ticket:`29630`).
zh_hans: 修复了一个回归问题，在 Oracle 12.1 上，带有相同名称的多列的切片查询会崩溃 (:ticket:`29630`)。

source: Fixed a crash when a user with the view (but not change) permission made a POST request to an admin user change form (:ticket:`29809`).
zh_hans: 修复了一个问题，当一个具有查看权限但没有更改权限的用户向管理员用户更改表单发出 POST 请求时会崩溃 (:ticket:`29809`)。

source: Django 2.1.3 release notes
zh_hans: Django 2.1.3 版本发行说明

source: *November 1, 2018*
zh_hans: *2018 年 11 月 1 日*

source: Django 2.1.3 fixes several bugs in 2.1.2.
zh_hans: Django 2.1.3 修复了 2.1.2 版本中的一些错误。

source: Fixed a regression in Django 2.0 where combining ``Q`` objects with ``__in`` lookups and lists crashed (:ticket:`29838`).
zh_hans: 修复了 Django 2.0 中的一个回归问题，即将 ``Q`` 对象与 ``__in`` 查找和列表组合时会崩溃 (:ticket:`29838`)。

source: Fixed a regression in Django 1.11 where ``django-admin shell`` may hang on startup (:ticket:`29774`).
zh_hans: 修复了 Django 1.11 中的一个回归问题，即 ``django-admin shell`` 在启动时可能会挂起 (:ticket:`29774`)。

source: Fixed a regression in Django 2.0 where test databases aren't reused with ``manage.py test --keepdb`` on MySQL (:ticket:`29827`).
zh_hans: 修复了 Django 2.0 中的一个回归问题，在 MySQL 上使用 ``manage.py test --keepdb`` 时不再重用测试数据库 (:ticket:`29827`)。

source: Fixed a regression where cached foreign keys that use ``to_field`` were incorrectly cleared in ``Model.save()`` (:ticket:`29896`).
zh_hans: 修复了一个回归问题，其中在 ``Model.save()`` 中错误地清除了使用 ``to_field`` 的缓存外键 (:ticket:`29896`)。

source: Fixed a regression in Django 2.0 where ``FileSystemStorage`` crashes with ``FileExistsError`` if concurrent saves try to create the same directory (:ticket:`29890`).
zh_hans: 修复了 Django 2.0 中的一个回归问题，即如果并发保存尝试创建相同的目录，``FileSystemStorage`` 会导致 ``FileExistsError`` 错误 (:ticket:`29890`)。

source: Django 2.1.4 release notes
zh_hans: Django 2.1.4 版本发行说明

source: Django 2.1.4 fixes several bugs in 2.1.3.
zh_hans: Django 2.1.4 修复了 2.1.3 版本中的一些错误。

source: Corrected the default password list that ``CommonPasswordValidator`` uses by lowercasing all passwords to match the format expected by the validator (:ticket:`29952`).
zh_hans: 通过将所有密码转换为小写以与验证器期望的格式匹配，修正了 ``CommonPasswordValidator`` 使用的默认密码列表 (:ticket:`29952`)。

source: Prevented repetitive calls to ``geos_version_tuple()`` in the ``WKBWriter`` class in an attempt to fix a random crash involving ``LooseVersion`` (:ticket:`29959`).
zh_hans: 防止在尝试修复涉及 ``LooseVersion`` 的随机崩溃时，在 ``WKBWriter`` 类中多次调用 ``geos_version_tuple()`` (:ticket:`29959`)。

source: Fixed keep-alive support in ``runserver`` after it was disabled to fix another issue in Django 2.0 (:ticket:`29849`).
zh_hans: 在修复 Django 2.0 中的另一个问题时，修复了 ``runserver`` 中被禁用的 keep-alive 支持 (:ticket:`29849`)。

source: Fixed admin view-only change form crash when using ``ModelAdmin.prepopulated_fields`` (:ticket:`29929`).
zh_hans: 修复了在使用 ``ModelAdmin.prepopulated_fields`` 时，管理员视图仅更改表单崩溃的问题 (:ticket:`29929`)。

source: Fixed "Please correct the errors below" error message when editing an object in the admin if the user only has the "view" permission on inlines (:ticket:`29930`).
zh_hans: 修复了在管理员中编辑对象时出现 "请更正下面的错误" 错误消息的问题，如果用户只对内联对象具有 "查看" 权限 (:ticket:`29930`)。

source: Django 2.1.5 release notes
zh_hans: Django 2.1.5 版本发行说明

source: Django 2.1.5 fixes a security issue and several bugs in 2.1.4.
zh_hans: Django 2.1.5 修复了 2.1.4 版本中的一个安全问题和一些错误。

source: Fixed compatibility with mysqlclient 1.3.14 (:ticket:`30013`).
zh_hans: 修复了与 mysqlclient 1.3.14 的兼容性问题 (:ticket:`30013`)。

source: Fixed a regression in Django 2.1.4 (which enabled keep-alive connections) where request body data isn't properly consumed for such connections (:ticket:`30015`).
zh_hans: 修复了 Django 2.1.4 中的一个回归问题（启用了 keep-alive 连接），在这种连接中未正确消耗请求体数据的问题 (:ticket:`30015`)。

source: Fixed a regression in Django 2.1.4 where ``InlineModelAdmin.has_change_permission()`` is incorrectly called with a non-``None`` ``obj`` argument during an object add (:ticket:`30050`).
zh_hans: 修复了 Django 2.1.4 中的一个回归问题，在对象添加过程中，错误地使用非 None 的 ``obj`` 参数调用了 ``InlineModelAdmin.has_change_permission()`` (:ticket:`30050`)。

source: Django 2.1.6 release notes
zh_hans: Django 2.1.6 版本发行说明

source: Django 2.1.6 fixes a security issue and a bug in 2.1.5.
zh_hans: Django 2.1.6 修复了 2.1.5 版本中的一个安全问题和一个错误。

source: Made the ``obj`` argument of ``InlineModelAdmin.has_add_permission()`` optional to restore backwards compatibility with third-party code that doesn't provide it (:ticket:`30097`).
zh_hans: 使 ``InlineModelAdmin.has_add_permission()`` 的 ``obj`` 参数变为可选，以恢复与不提供该参数的第三方代码的向后兼容性 (:ticket:`30097`)。

source: Django 2.1.7 release notes
zh_hans: Django 2.1.7 版本发行说明

source: Django 2.1.7 fixes a packaging error in 2.1.6.
zh_hans: Django 2.1.7 修复了 2.1.6 版本中的一个打包错误。

source: Corrected packaging error from 2.1.6 (:ticket:`30175`).
zh_hans: 修正了来自 2.1.6 的打包错误 (:ticket:`30175`)。

source: Django 2.1.8 release notes
zh_hans: Django 2.1.8 版本发行说明

source: *April 1, 2019*
zh_hans: *2019 年 4 月 1 日*

source: Django 2.1.8 fixes a bug in 2.1.7.
zh_hans: Django 2.1.8 修复了 2.1.7 版本中的一个错误。

source: Prevented admin inlines for a ``ManyToManyField``\'s implicit through model from being editable if the user only has the view permission (:ticket:`30289`).
zh_hans: 如果用户只具有查看权限，则阻止对 ``ManyToManyField`` 的隐式 through 模型的管理员内联进行编辑 (:ticket:`30289`)。

source: Django 2.1.9 release notes
zh_hans: Django 2.1.9 版本发行说明

source: Django 2.1.9 fixes security issues in 2.1.8.
zh_hans: Django 2.1.9 修复了 2.1.8 版本中的安全问题。

source: Patched bundled jQuery for CVE-2019-11358: Prototype pollution
zh_hans: 修复了捆绑的 jQuery 库中的 CVE-2019-11358 问题：原型污染

source: jQuery before 3.4.0, mishandles ``jQuery.extend(true, {}, ...)`` because of ``Object.prototype`` pollution. If an unsanitized source object contained an enumerable ``__proto__`` property, it could extend the native ``Object.prototype``.
zh_hans: jQuery 在 3.4.0 之前处理 ``jQuery.extend(true, {}, ...)`` 时存在问题，因为它可能因为 ``Object.prototype`` 污染而出错。如果一个未经过清理的源对象包含一个可枚举的 ``__proto__`` 属性，它可能会扩展原生的 ``Object.prototype``。

source: The bundled version of jQuery used by the Django admin has been patched to allow for the ``select2`` library's use of ``jQuery.extend()``.
zh_hans: Django 管理员使用的捆绑版本的 jQuery 已经修补，以允许 ``select2`` 库使用 ``jQuery.extend()``。

source: Django 2.2 release notes
zh_hans: Django 2.2 版本发行说明

source: Welcome to Django 2.2!
zh_hans: 欢迎使用 Django 2.2 ！

source: These release notes cover the :ref:`new features <whats-new-2.2>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-2.2>` you'll want to be aware of when upgrading from Django 2.1 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-2.2>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-2.2>`，以及在从 Django 2.1 或更早版本升级时需要注意的一些 :ref:`向后不兼容的更改 <backwards-incompatible-2.2>`。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-2.2>`。

source: Django 2.2 is designated as a :term:`long-term support release <Long-term support release>`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 1.11, will end in April 2020.
zh_hans: Django 2.2 被指定为 :term:`长期支持版本 <Long-term support release>`。它将在发布后至少三年内接收安全更新。对于之前的 LTS 版本 Django 1.11，支持将在 2020 年 4 月结束。

source: Django 2.2 supports Python 3.5, 3.6, 3.7, 3.8 (as of 2.2.8), and 3.9 (as of 2.2.17). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 2.2 支持 Python 3.5、3.6、3.7、3.8（从 2.2.8 版开始），以及 3.9（从 2.2.17 版开始）。我们 **强烈建议** 并只官方支持每个系列的最新版本。

source: What's new in Django 2.2
zh_hans: Django 2.2 的新功能有哪些呢？

source: Constraints
zh_hans: 约束

source: The new :class:`~django.db.models.CheckConstraint` and :class:`~django.db.models.UniqueConstraint` classes enable adding custom database constraints. Constraints are added to models using the :attr:`Meta.constraints <django.db.models.Options.constraints>` option.
zh_hans: 新的 :class:`~django.db.models.CheckConstraint` 和 :class:`~django.db.models.UniqueConstraint` 类允许添加自定义数据库约束。约束可以使用 :attr:`Meta.constraints <django.db.models.Options.constraints>` 选项添加到模型中。

source: Added a CSS class to the column headers of :class:`~django.contrib.admin.TabularInline`.
zh_hans: 为 :class:`~django.contrib.admin.TabularInline` 的列标题添加了一个 CSS 类。

source: The ``HttpRequest`` is now passed as the first positional argument to :meth:`.RemoteUserBackend.configure_user`, if it accepts it.
zh_hans: 如果接受，现在将 ``HttpRequest`` 作为 :meth:`.RemoteUserBackend.configure_user` 的第一个位置参数传递。

source: Added Oracle support for the :class:`~django.contrib.gis.db.models.functions.Envelope` function.
zh_hans: 为 :class:`~django.contrib.gis.db.models.functions.Envelope` 函数添加了对 Oracle 数据库的支持。

source: Added SpatiaLite support for the :lookup:`coveredby` and :lookup:`covers` lookups.
zh_hans: 为 :lookup:`coveredby` 和 :lookup:`covers` 查询添加了对 SpatiaLite 的支持。

source: The new ``ordering`` argument for :class:`~django.contrib.postgres.aggregates.ArrayAgg` and :class:`~django.contrib.postgres.aggregates.StringAgg` determines the ordering of the aggregated elements.
zh_hans: 对于 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg`，新的 ``ordering`` 参数确定了聚合元素的排序方式。

source: The new :class:`~django.contrib.postgres.indexes.BTreeIndex`, :class:`~django.contrib.postgres.indexes.HashIndex` and :class:`~django.contrib.postgres.indexes.SpGistIndex` classes allow creating ``B-Tree``, ``hash``, and ``SP-GiST`` indexes in the database.
zh_hans: 新的 :class:`~django.contrib.postgres.indexes.BTreeIndex`、:class:`~django.contrib.postgres.indexes.HashIndex` 和 :class:`~django.contrib.postgres.indexes.SpGistIndex` 类允许在数据库中创建 ``B-Tree``、``hash`` 和 ``SP-GiST`` 索引。

source: :class:`~django.contrib.postgres.indexes.BrinIndex` now has the ``autosummarize`` parameter.
zh_hans: :class:`~django.contrib.postgres.indexes.BrinIndex` 现在具有 ``autosummarize`` 参数。

source: The new ``search_type`` parameter of :class:`~django.contrib.postgres.search.SearchQuery` allows searching for a phrase or raw expression.
zh_hans: :class:`~django.contrib.postgres.search.SearchQuery` 的新参数 ``search_type`` 允许搜索短语或原始表达式。

source: Added path matching to the :option:`collectstatic --ignore` option so that patterns like ``/vendor/*.js`` can be used.
zh_hans: 在 :option:`collectstatic --ignore` 选项中添加了路径匹配功能，以便可以使用像 ``/vendor/*.js`` 这样的模式。

source: Added result streaming for :meth:`.QuerySet.iterator` on SQLite.
zh_hans: 在 SQLite 上为 :meth:`.QuerySet.iterator` 添加了结果流式传输功能。

source: The new :meth:`View.setup <django.views.generic.base.View.setup>` hook initializes view attributes before calling :meth:`~django.views.generic.base.View.dispatch`. It allows mixins to set up instance attributes for reuse in child classes.
zh_hans: 新的 :meth:`View.setup <django.views.generic.base.View.setup>` 钩子在调用 :meth:`~django.views.generic.base.View.dispatch` 之前初始化视图属性。它允许 mixins 设置实例属性，以便在子类中重用。

source: Added support and translations for the Armenian language.
zh_hans: 增加了对亚美尼亚语的支持和翻译。

source: The new :option:`--force-color` option forces colorization of the command output.
zh_hans: 新的 :option:`--force-color` 选项强制对命令输出进行着色。

source: :djadmin:`inspectdb` now creates models for foreign tables on PostgreSQL.
zh_hans: :djadmin:`inspectdb` 现在会为 PostgreSQL 上的外部表创建模型。

source: :option:`inspectdb --include-views` now creates models for materialized views on Oracle and PostgreSQL.
zh_hans: :option:`inspectdb --include-views` 现在会为 Oracle 和 PostgreSQL 上的物化视图创建模型。

source: The new :option:`inspectdb --include-partitions` option allows creating models for partition tables on PostgreSQL. In older versions, models are created child tables instead the parent.
zh_hans: 新的 :option:`inspectdb --include-partitions` 选项允许在 PostgreSQL 上为分区表创建模型。在旧版本中，模型是在子表而不是父表中创建的。

source: :djadmin:`inspectdb` now introspects :class:`~django.db.models.DurationField` for Oracle and PostgreSQL, and :class:`~django.db.models.AutoField` for SQLite.
zh_hans: :djadmin:`inspectdb` 现在可以为 Oracle 和 PostgreSQL 自动检测 :class:`~django.db.models.DurationField`，以及为 SQLite 检测 :class:`~django.db.models.AutoField`。

source: On Oracle, :djadmin:`dbshell` is wrapped with ``rlwrap``, if available. ``rlwrap`` provides a command history and editing of keyboard input.
zh_hans: 在 Oracle 上，如果可用，:djadmin:`dbshell` 会使用 ``rlwrap`` 包装。``rlwrap`` 提供了命令历史记录和键盘输入的编辑功能。

source: The new :option:`makemigrations --no-header` option avoids writing header comments in generated migration file(s). This option is also available for :djadmin:`squashmigrations`.
zh_hans: 新的 :option:`makemigrations --no-header` 选项可以避免在生成的迁移文件中写入头部注释。这个选项也适用于 :djadmin:`squashmigrations`。

source: :djadmin:`runserver` can now use `Watchman <https://facebook.github.io/watchman/>`_ to improve the performance of watching a large number of files for changes.
zh_hans: :djadmin:`runserver` 现在可以使用 `Watchman <https://facebook.github.io/watchman/>`_ 来提高监视大量文件变化的性能。

source: The new :option:`migrate --plan` option prints the list of migration operations that will be performed.
zh_hans: 新的 :option:`migrate --plan` 选项会打印将执行的迁移操作列表。

source: ``NoneType`` can now be serialized in migrations.
zh_hans: ``NoneType`` 现在可以在迁移中序列化。

source: You can now :ref:`register custom serializers <custom-migration-serializers>` for migrations.
zh_hans: 现在可以为迁移 :ref:`注册自定义序列化程序 <custom-migration-serializers>`。

source: Added support for PostgreSQL operator classes (:attr:`.Index.opclasses`).
zh_hans: 添加了对 PostgreSQL 运算符类 (:attr:`.Index.opclasses`) 的支持。

source: Added support for partial indexes (:attr:`.Index.condition`).
zh_hans: 添加了对部分索引 (:attr:`.Index.condition`) 的支持。

source: Added the :class:`~django.db.models.functions.NullIf` and :class:`~django.db.models.functions.Reverse` database functions, as well as many :ref:`math database functions <math-functions>`.
zh_hans: 添加了 :class:`~django.db.models.functions.NullIf` 和 :class:`~django.db.models.functions.Reverse` 数据库函数，以及许多 :ref:`数学数据库函数 <math-functions>`。

source: Setting the new ``ignore_conflicts`` parameter of :meth:`.QuerySet.bulk_create` to ``True`` tells the database to ignore failure to insert rows that fail uniqueness constraints or other checks.
zh_hans: 将 :meth:`.QuerySet.bulk_create` 的新参数 ``ignore_conflicts`` 设置为 ``True`` 会告诉数据库忽略插入失败的行，即违反唯一性约束或其他检查的行。

source: The new :class:`~django.db.models.functions.ExtractIsoYear` function extracts ISO-8601 week-numbering years from :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField`, and the new :lookup:`iso_year` lookup allows querying by an ISO-8601 week-numbering year.
zh_hans: 新的 :class:`~django.db.models.functions.ExtractIsoYear` 函数从 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 中提取 ISO-8601 周编号年，新的 :lookup:`iso_year` 查询允许按 ISO-8601 周编号年进行查询。

source: The new :meth:`.QuerySet.bulk_update` method allows efficiently updating specific fields on multiple model instances.
zh_hans: 新的 :meth:`.QuerySet.bulk_update` 方法允许高效地更新多个模型实例上的特定字段。

source: Django no longer always starts a transaction when a single query is being performed, such as ``Model.save()``, ``QuerySet.update()``, and ``Model.delete()``. This improves the performance of autocommit by reducing the number of database round trips.
zh_hans: Django 不再总是在执行单个查询时启动事务，例如 ``Model.save()``, ``QuerySet.update()`` 和 ``Model.delete()``。这通过减少数据库往返次数来提高自动提交的性能。

source: Added SQLite support for the :class:`~django.db.models.StdDev` and :class:`~django.db.models.Variance` functions.
zh_hans: 为 :class:`~django.db.models.StdDev` 和 :class:`~django.db.models.Variance` 函数添加了 SQLite 支持。

source: The handling of ``DISTINCT`` aggregation is added to the :class:`~django.db.models.Aggregate` class. Adding :attr:`allow_distinct = True <django.db.models.Aggregate.allow_distinct>` as a class attribute on ``Aggregate`` subclasses allows a ``distinct`` keyword argument to be specified on initialization to ensure that the aggregate function is only called for each distinct value of ``expressions``.
zh_hans: 对于 :class:`~django.db.models.Aggregate` 类，增加了 ``DISTINCT`` 聚合的处理。在 ``Aggregate`` 子类上添加 :attr:`allow_distinct = True <django.db.models.Aggregate.allow_distinct>` 作为类属性，允许在初始化时指定一个 ``distinct`` 关键字参数，以确保聚合函数仅对 ``expressions`` 的每个不同值调用一次。

source: The :meth:`.RelatedManager.add`, :meth:`~.RelatedManager.create`, :meth:`~.RelatedManager.remove`, :meth:`~.RelatedManager.set`, ``get_or_create()``, and ``update_or_create()`` methods are now allowed on many-to-many relationships with intermediate models. The new ``through_defaults`` argument is used to specify values for new intermediate model instance(s).
zh_hans: 现在允许在具有中间模型的多对多关系上使用 :meth:`.RelatedManager.add`、:meth:`~.RelatedManager.create`、:meth:`~.RelatedManager.remove`、:meth:`~.RelatedManager.set`、``get_or_create()`` 和 ``update_or_create()`` 方法。新的 ``through_defaults`` 参数用于指定新中间模型实例的值。

source: Added :attr:`.HttpRequest.headers` to allow simple access to a request's headers.
zh_hans: 添加了 :attr:`.HttpRequest.headers`，以便简单访问请求的头部信息。

source: You can now deserialize data using natural keys containing :ref:`forward references <natural-keys-and-forward-references>` by passing ``handle_forward_references=True`` to ``serializers.deserialize()``. Additionally, :djadmin:`loaddata` handles forward references automatically.
zh_hans: 现在可以通过将 ``handle_forward_references=True`` 传递给 ``serializers.deserialize()`` 来使用包含 :ref:`前向引用 <natural-keys-and-forward-references>` 的自然键反序列化数据。此外，:djadmin:`loaddata` 现在会自动处理前向引用。

source: The new :meth:`.SimpleTestCase.assertURLEqual` assertion checks for a given URL, ignoring the ordering of the query string. :meth:`~.SimpleTestCase.assertRedirects` uses the new assertion.
zh_hans: 新的 :meth:`.SimpleTestCase.assertURLEqual` 断言检查给定的 URL，忽略查询字符串的顺序。:meth:`~.SimpleTestCase.assertRedirects` 使用了这个新的断言。

source: The test :class:`~.django.test.Client` now supports automatic JSON serialization of list and tuple ``data`` when ``content_type='application/json'``.
zh_hans: 现在，测试 :class:`~.django.test.Client` 在 ``content_type='application/json'`` 时支持自动对列表和元组 ``data`` 进行 JSON 序列化。

source: The new :setting:`ORACLE_MANAGED_FILES <TEST_ORACLE_MANAGED_FILES>` test database setting allows using Oracle Managed Files (OMF) tablespaces.
zh_hans: 新的 :setting:`ORACLE_MANAGED_FILES <TEST_ORACLE_MANAGED_FILES>` 测试数据库设置允许使用 Oracle 管理文件 (OMF) 表空间。

source: Deferrable database constraints are now checked at the end of each :class:`~django.test.TestCase` test on SQLite 3.20+, just like on other backends that support deferrable constraints. These checks aren't implemented for older versions of SQLite because they would require expensive table introspection there.
zh_hans: 可延迟的数据库约束现在在 SQLite 3.20+ 上的每个 :class:`~django.test.TestCase` 测试结束时进行检查，就像其他支持可延迟约束的后端一样。对于较旧版本的 SQLite，这些检查没有实现，因为在那里需要昂贵的表内省。

source: :class:`~django.test.runner.DiscoverRunner` now skips the setup of databases not :ref:`referenced by tests<testing-multi-db>`.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 现在会跳过未被 :ref:`测试引用 <testing-multi-db>` 的数据库的设置。

source: The new :attr:`.ResolverMatch.route` attribute stores the route of the matching URL pattern.
zh_hans: 新的 :attr:`.ResolverMatch.route` 属性存储匹配的 URL 模式的路由。
