Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: See the :doc:`reference documentation of the app </ref/contrib/staticfiles>` for more details or learn how to :doc:`manage static files </howto/static-files/index>`.
id: Lihat :doc:`reference documentation of the app </ref/contrib/staticfiles>` untuk lebih rinci atau pelajari bagaimana untuk :doc:`manage static files </howto/static-files/index>`.
zh_hans: 有关更多详细信息，请参阅该应用程序的 :doc:`参考文档 </ref/contrib/staticfiles>` 或学习如何 :doc:`管理静态文件 </howto/static-files/index>`。

source: ``unittest2`` support
id: Dukungan ``unittest2``
zh_hans: ``unittest2`` 支持

source: Python 2.7 introduced some major changes to the ``unittest`` library, adding some extremely useful features. To ensure that every Django project can benefit from these new features, Django ships with a copy of :pypi:`unittest2`, a copy of the Python 2.7 ``unittest`` library, backported for Python 2.4 compatibility.
zh_hans: Python 2.7 引入了对 ``unittest`` 库的一些重大更改，添加了一些非常有用的功能。为了确保每个 Django 项目都能受益于这些新功能，Django 随附了 :pypi:`unittest2` 的副本，这是 Python 2.7 ``unittest`` 库的一个副本，专为 Python 2.4 兼容性而进行了回退。

source: To access this library, Django provides the ``django.utils.unittest`` module alias. If you are using Python 2.7, or you have installed ``unittest2`` locally, Django will map the alias to the installed version of the ``unittest`` library. Otherwise, Django will use its own bundled version of ``unittest2``.
zh_hans: 要访问这个库，Django 提供了 ``django.utils.unittest`` 模块别名。如果您使用的是 Python 2.7，或者已经在本地安装了 ``unittest2``，Django 会将别名映射到已安装的 ``unittest`` 库的版本。否则，Django 将使用其自带的 ``unittest2`` 版本。

source: To take advantage of this alias, simply use::
id: Untuk mengambil keuntungan dari nama lain ini, cukup gunakan::
zh_hans: 要利用这个别名，只需使用：

source: wherever you would have historically used::
id: dimanapun anda akan secara riwayat pakai:
zh_hans: 在你过去曾经使用过的地方：

source: If you want to continue to use the base ``unittest`` library, you can -- you just won't get any of the nice new ``unittest2`` features.
zh_hans: 如果您想继续使用基本的 ``unittest`` 库，您可以这样做，只是您将不会获得任何新的 ``unittest2`` 功能。

source: Transaction context managers
id: Pengelola konteks transaksi
zh_hans: 事务上下文管理器

source: Users of Python 2.5 and above may now use transaction management functions as context managers. For example::
id: Pengguna dari Python 2.5 dan diatas dapat sekarang menggunakan fungsi pengelolaan transaksi sebagai pengelola konteks. Sebagai contoh::
zh_hans: Python 2.5 及以上版本的用户现在可以将事务管理函数用作上下文管理器。例如：

source: Configurable delete-cascade
id: Dapat dikonfigurasi hapus-menurun
zh_hans: 可配置的级联删除

source: :class:`~django.db.models.ForeignKey` and :class:`~django.db.models.OneToOneField` now accept an :attr:`~django.db.models.ForeignKey.on_delete` argument to customize behavior when the referenced object is deleted. Previously, deletes were always cascaded; available alternatives now include set null, set default, set to any value, protect, or do nothing.
id: :class:`~django.db.models.ForeignKey` dan :class:`~django.db.models.OneToOneField` sekarang menerima sebuah argumen :attr:`~django.db.models.ForeignKey.on_delete` untuk menyesuaikan perilaku ketika obyek diacu dihapus. Sebelumnya, penghapusan selalu menurun; cara lain tersedia sekarang menyertakan setelan null, setel awalan, setel ke tiap tiap nilai, lindungi, atau tidak lakukan apa-apa.
zh_hans: :class:`~django.db.models.ForeignKey` 和 :class:`~django.db.models.OneToOneField` 现在接受一个 :attr:`~django.db.models.ForeignKey.on_delete` 参数，用于在引用的对象被删除时自定义行为。以前，删除操作总是级联的；现在可用的替代方案包括设置为 null、设置为默认值、设置为任何值、保护或不采取任何行动。

source: For more information, see the :attr:`~django.db.models.ForeignKey.on_delete` documentation.
id: Untuk informasi lebih, lihat dokumentasi :attr:`~django.db.models.ForeignKey.on_delete`.
zh_hans: 有关更多信息，请参阅 :attr:`~django.db.models.ForeignKey.on_delete` 的文档。

source: Contextual markers and comments for translatable strings
id: Penanda kontekstual dan komentar untuk deretan karakter dapat diterjemahkan
zh_hans: 可翻译字符串的上下文标记和注释

source: For translation strings with ambiguous meaning, you can now use the ``pgettext`` function to specify the context of the string.
id: Untuk terjemahan dertan karakter dengan arti yang menyangsingkan, anda sekarang dapat menggunakan fungsi ``pgettext`` untuk menentukan konteks dari deretan karakter.
zh_hans: 对于具有模糊含义的翻译字符串，现在可以使用 ``pgettext`` 函数来指定字符串的上下文。

source: And if you just want to add some information for translators, you can also add special translator comments in the source.
id: Dan jika anda hanya ingin menambahkan beberapa informasi untuk penterjemah, anda dapat juga menambahkan komentar penterjemah khusus di sumber.
zh_hans: 如果你只想为翻译者添加一些信息，你还可以在源代码中添加特殊的翻译者注释。

source: For more information, see :ref:`contextual-markers` and :ref:`translator-comments`.
id: Untuk informasi lebih, lihat :ref:`contextual-markers` dan :ref:`translator-comments`.
zh_hans: 有关更多信息，请参阅 :ref:`上下文标记` 和 :ref:`翻译者注释`。

source: Improvements to built-in template tags
id: Perbaikan pada etiket cetakan siap-pakai
zh_hans: 内置模板标签的改进

source: A number of improvements have been made to Django's built-in template tags:
id: Sejumlah perbaikan telah dibuat pada etiket cetakan Django siap-pakai:
zh_hans: 对 Django 内置模板标签进行了一些改进：

source: The :ttag:`include` tag now accepts a ``with`` option, allowing you to specify context variables to the included template
id: Etiket :ttag:`include` sekarang menerima sebuah pilihan ``with``, mengizinkan anda menentukan konteks variabel ke cetakan yang disertakan
zh_hans: :ttag:`include` 标签现在接受一个 ``with`` 选项，允许您指定要传递给包含的模板的上下文变量。

source: The :ttag:`include` tag now accepts an ``only`` option, allowing you to exclude the current context from the included context
id: Etiket :ttag:`include` sekarang menerima sebuah pilihan ``only``, mengizinkan anda tidak menyertakan konteks saat ini dari konteks yang disertakan.
zh_hans: :ttag:`include` 标签现在接受一个 ``only`` 选项，允许您将当前上下文从包含的上下文中排除在外。

source: The :ttag:`with` tag now allows you to define multiple context variables in a single :ttag:`with` block.
id: Etiket :ttag:`with` sekarang mengizinkan anda menentukan banyak konteks variabel dalam blok :ttag:`with` tunggal.
zh_hans: :ttag:`with` 标签现在允许您在单个 :ttag:`with` 块中定义多个上下文变量。

source: The :ttag:`load` tag now accepts a ``from`` argument, allowing you to load a single tag or filter from a library.
id: Etiket :ttag:`load` sekarang menerima sebuah argumen ``from``, mengizinkan anda memuat etiket tunggal atau penyaring dari sebuah pustaka.
zh_hans: :ttag:`load` 标签现在接受一个 ``from`` 参数，允许您从一个库中加载单个标签或过滤器。

source: TemplateResponse
zh_hans: 模板响应

source: It can sometimes be beneficial to allow decorators or middleware to modify a response *after* it has been constructed by the view. For example, you may want to change the template that is used, or put additional data into the context.
id: Itu dapat terkadang bermanfaat untuk mengizinkan penghias atau middleware untuk merubah sebuah tanggapan *setelah* itu telah dirancang oleh tampilan. Sebagai contoh, anda ingin merubah cetakan yang digunakan, atau menaruh data tambahan kedalam konteks.
zh_hans: 有时允许装饰器或中间件在视图构建响应之后修改响应可能是有益的。例如，您可能希望更改所使用的模板，或将额外的数据放入上下文中。

source: However, you can't (easily) modify the content of a basic :class:`~django.http.HttpResponse` after it has been constructed. To overcome this limitation, Django 1.3 adds a new :class:`~django.template.response.TemplateResponse` class. Unlike basic :class:`~django.http.HttpResponse` objects, :class:`~django.template.response.TemplateResponse` objects retain the details of the template and context that was provided by the view to compute the response. The final output of the response is not computed until it is needed, later in the response process.
id: Bagaimanapun, anda tidak dapat (dengan mudah) merubah isi dari dasar :class:`~django.http.HttpResponse` setelah itu telah dibangun. Untuk menangani batasan ini, Django 1.3 menambahkan sebuah kelas :class:`~django.template.response.TemplateResponse` baru. Tidak seperti obyek :class:`~django.http.HttpResponse`, obyek :class:`~django.template.response.TemplateResponse` menyimpan cetakan dan konteks yang telah disediakan oleh tampilan untuk menghitung tanggapan. Keluaran akhir dari tanggapan tidak dihitung sampai itu dibutuhkan, kemudian di pengolahan tanggapan.
zh_hans: 然而，您不能（轻松地）在构建后修改基本的 :class:`~django.http.HttpResponse` 内容。为了克服这个限制，Django 1.3 添加了一个新的 :class:`~django.template.response.TemplateResponse` 类。与基本的 :class:`~django.http.HttpResponse` 对象不同，:class:`~django.template.response.TemplateResponse` 对象保留了视图提供的模板和上下文的详细信息，以计算响应。响应的最终输出直到后面的响应过程中才会计算。

source: For more details, see the :doc:`documentation </ref/template-response>` on the :class:`~django.template.response.TemplateResponse` class.
id: Untul lebih rinci, lihat :doc:`documentation </ref/template-response>` pada kelas :class:`~django.template.response.TemplateResponse`.
zh_hans: 有关更多详细信息，请参阅 :class:`~django.template.response.TemplateResponse` 类的 :doc:`文档 </ref/template-response>`。

source: Caching changes
id: Perubahan menemblok
zh_hans: 缓存更改

source: Django 1.3 sees the introduction of several improvements to the Django's caching infrastructure.
id: Django 1.3 melihat perkenalan dari beberapa perbaikan pada infrastruktur penyembunyian Django.
zh_hans: Django 1.3 引入了对 Django 缓存基础设施的若干改进。

source: Firstly, Django now supports multiple named caches. In the same way that Django 1.2 introduced support for multiple database connections, Django 1.3 allows you to use the new :setting:`CACHES` setting to define multiple named cache connections.
id: Pertama, Django sekarang mendukung banyak penyimpanan bernama. Di cara yang sama bahwa Django 1.2 diperkenalkan mendukung untuk hubungan abnyak basisdata, Django 1.3 mengizinkan anda menggunakan pengaturan :setting:`CACHES` untuk menentukan banyak hubungan penyimpananbernama.
zh_hans: 首先，Django 现在支持多个命名缓存。与 Django 1.2 引入多个数据库连接支持的方式类似，Django 1.3 允许您使用新的 :setting:`CACHES` 设置来定义多个命名的缓存连接。

source: Secondly, :ref:`versioning <cache_versioning>`, :ref:`site-wide prefixing <cache_key_prefixing>` and :ref:`transformation <cache_key_transformation>` have been added to the cache API.
id: Yang kedua, :ref:`versioning <cache_versioning>`, :ref:`site-wide prefixing <cache_key_prefixing>` dan :ref:`transformation <cache_key_transformation>` telah ditambahkan ke API tembolok.
zh_hans: 其次，缓存 API 中添加了 :ref:`版本化 <cache_versioning>`、:ref:`站点范围的前缀 <cache_key_prefixing>` 和 :ref:`转换 <cache_key_transformation>` 功能。

source: Thirdly, :ref:`cache key creation <using-vary-headers>` has been updated to take the request query string into account on ``GET`` requests.
id: Ketiga, :ref:`cache key creation <using-vary-headers>` telah diperbaharui untuk mengambil deretan karakter permintaan kedalam akun pada permintaan ``GET``.
zh_hans: 第三，已更新 :ref:`缓存键创建 <using-vary-headers>`，以考虑 ``GET`` 请求中的请求查询字符串。

source: Finally, support for pylibmc_ has been added to the memcached cache backend.
id: Akhirnya, sukungan untuk pylibmc_ telah ditambahkan ke backend tembolok memcached.
zh_hans: 最后，已经将对 pylibmc_ 的支持添加到了 memcached 缓存后端。

source: For more details, see the :doc:`documentation on caching in Django</topics/cache>`.
id: Untuk rincian lebih, lihat :doc:`documentation on caching in Django</topics/cache>`.
zh_hans: 有关更多详细信息，请参阅 :doc:`Django 中的缓存文档 </topics/cache>`。

source: Permissions for inactive users
id: Perizinan untuk pengguna tidak aktif
zh_hans: 对非活跃用户的权限

source: If you provide a custom auth backend with ``supports_inactive_user`` set to ``True``, an inactive ``User`` instance will check the backend for permissions. This is useful for further centralizing the permission handling. See the :doc:`authentication docs </topics/auth/index>` for more details.
id: Jika anda menyediakan backend otentifikasi penyesuaian dengan ``supports_inactive_user`` disetel menjadi ``True``, sebuah instance ``User`` tidak aktif akan memeriksa backend untuk perizinan. Ini sangat berguna untuk pemusatan penangan perizinan selanjutnya. Lihat :doc:`authentication docs </topics/auth/index>` untuk lebih rinci.
zh_hans: 如果您提供一个自定义的身份验证后端，并将 ``supports_inactive_user`` 设置为 ``True``，则不活动的 ``User`` 实例将检查后端以获取权限。这对于进一步集中权限处理非常有用。有关更多详细信息，请参阅 :doc:`身份验证文档 </topics/auth/index>`。

source: The GeoDjango test suite is now included when :ref:`running the Django test suite <running-unit-tests>` with ``runtests.py`` when using :ref:`spatial database backends <spatial-backends>`.
id: Deretan percobaan GeoDjango sekarang disertakan ketika :ref:`running the Django test suite <running-unit-tests>` dengan ``runtests.py`` ketika menggunakan :ref:`spatial database backends <spatial-backends>`.
zh_hans: 使用 :ref:`空间数据库后端 <spatial-backends>` 来 :ref:`运行 Django 测试套件 <running-unit-tests>` 时，GeoDjango 测试套件现在已包含在 ``runtests.py`` 中。

source: :setting:`MEDIA_URL` and :setting:`STATIC_URL` must end in a slash
id: :setting:`MEDIA_URL` dan :setting:`STATIC_URL` harus berakhir di garis miring
zh_hans: :setting:`MEDIA_URL` 和 :setting:`STATIC_URL` 必须以斜杠结尾。

source: Previously, the :setting:`MEDIA_URL` setting only required a trailing slash if it contained a suffix beyond the domain name.
id: Sebelumnya, pengaturan :setting:`MEDIA_URL` hanya membutuhkan buntutan garis miring jika itu mengandung sebuah akhiran diluar nama ranah.
zh_hans: 之前，:setting:`MEDIA_URL` 设置只有在包含域名之后的后缀时才需要一个尾随斜杠。

source: A trailing slash is now *required* for :setting:`MEDIA_URL` and the new :setting:`STATIC_URL` setting as long as it is not blank. This ensures there is a consistent way to combine paths in templates.
id: Buntutan garis miring sekarang *wajib* untuk :setting:`MEDIA_URL` dan pengaturan :setting:`STATIC_URL` selama itu tidak kosong. Ini memastikan ada cara tetap untuk menggabungkan jalur di cetakan.
zh_hans: 现在，只要不是空白的情况下，:setting:`MEDIA_URL` 和新的 :setting:`STATIC_URL` 设置都需要一个尾随斜杠。这确保了在模板中组合路径的一致方式。

source: Project settings which provide either of both settings without a trailing slash will now raise a ``PendingDeprecationWarning``.
id: Pengaturan proyek yang menyediakan salah satu dari kedu apengaturan tanpa buntutan garis miring akan sekarang memunculkan sebuah ``PendingDeprecationWarning``.
zh_hans: 提供了没有尾随斜杠的任何一个或两个设置的项目设置现在会引发一个 ``PendingDeprecationWarning``。

source: In Django 1.4 this same condition will raise ``DeprecationWarning``, and in Django 1.5 will raise an ``ImproperlyConfigured`` exception.
id: Di Django 1.4 kondisi yang sama ini akan memunculkan ``DeprecationWarning``, dan di Django 1.5 akan memunculkan sebuah pengecualian ``ImproperlyConfigured``.
zh_hans: 在 Django 1.4 中，相同的条件将引发 ``DeprecationWarning``，而在 Django 1.5 中将引发 ``ImproperlyConfigured`` 异常。

source: Everything else
id: Yang lainnya
zh_hans: 其他所有内容

source: Django :doc:`1.1 <1.1>` and :doc:`1.2 <1.2>` added lots of big ticket items to Django, like multiple-database support, model validation, and a session-based messages framework. However, this focus on big features came at the cost of lots of smaller features.
id: Django :doc:`1.1 <1.1>` dan :doc:`1.2 <1.2>` ditambahkan banyak tiket barang besar pada Django, seperti dukungan banyak-basisdata, pengecekan model, dan kerangka kerja pesan berdasarkan-sesi. Bagaimanapun, fokus ini pada fitur-fitur besar datang pada biaya banyak dari fitur-fitur terkecil.
zh_hans: Django :doc:`1.1 <1.1>` 和 :doc:`1.2 <1.2>` 在 Django 中引入了许多重要的功能，如多数据库支持、模型验证和基于会话的消息框架。然而，这种对重要功能的关注也导致了许多较小功能的牺牲。

source: To compensate for this, the focus of the Django 1.3 development process has been on adding lots of smaller, long standing feature requests. These include:
id: Untuk mengimbangi ini, fokus dari pengeolahan pengembangan Django 1.3 telah menambahkan banyak dari terkecil, permintaan fitur yang sudah lama berjalan. Ini termasuk:
zh_hans: 为了弥补这一点，Django 1.3 开发过程的重点是添加许多较小的、长期存在的功能需求。这些包括：

source: Improved tools for accessing and manipulating the current :class:`~django.contrib.sites.models.Site` object in :doc:`the sites framework </ref/contrib/sites>`.
id: Peningkatan alat-alat untuk mengakses dan merubah obyek :class:`~django.contrib.sites.models.Site` saat ini di :doc:`the sites framework </ref/contrib/sites>`.
zh_hans: 在 :doc:`站点框架 </ref/contrib/sites>` 中，改进了访问和操作当前 :class:`~django.contrib.sites.models.Site` 对象的工具。

source: A :class:`~django.test.RequestFactory` for mocking requests in tests.
id: :class:`~django.test.RequestFactory` untuk permintaan ejekan di percobaan.
zh_hans: 在测试中用于模拟请求的 :class:`~django.test.RequestFactory`。

source: A new test assertion -- :meth:`~django.test.TransactionTestCase.assertNumQueries` -- making it easier to test the database activity associated with a view.
id: Pernyataan percobaan baru -- :meth:`~django.test.TransactionTestCase.assertNumQueries` -- membuatnya lebih mudah untuk mencoba aktivitas basisdata terkait dengan tampilan.
zh_hans: 一个新的测试断言 -- :meth:`~django.test.TransactionTestCase.assertNumQueries` -- 使得更容易测试与视图相关的数据库活动。

source: Support for lookups spanning relations in admin's :attr:`~django.contrib.admin.ModelAdmin.list_filter`.
id: Mendukung untuk pencarian mencangkup hubungan di :attr:`~django.contrib.admin.ModelAdmin.list_filter` admin.
zh_hans: 在管理员的 :attr:`~django.contrib.admin.ModelAdmin.list_filter` 中支持跨关系的查询。

source: Support for HttpOnly_ cookies.
zh_hans: 支持 HttpOnly_ cookies。

source: :meth:`~django.core.mail.mail_admins()` and :meth:`~django.core.mail.mail_managers()` now support easily attaching HTML content to messages.
id: :meth:`~django.core.mail.mail_admins()` dan :meth:`~django.core.mail.mail_managers()` sekarang mendukung dengan mudah melampirkan isi HTML pada pesan.
zh_hans: 现在，:meth:`~django.core.mail.mail_admins()` 和 :meth:`~django.core.mail.mail_managers()` 支持轻松附加 HTML 内容到消息中。

source: :class:`~django.core.mail.EmailMessage` now supports CC's.
id: :class:`~django.core.mail.EmailMessage` sekarang mendukung CC.
zh_hans: :class:`~django.core.mail.EmailMessage` 现在支持抄送 (CC)。

source: Error emails now include more of the detail and formatting of the debug server error page.
id: Surel kesalahan sekarang menyertakan lebih rinci dan berbentuk dari halaman kesalahan peladen pencari kesalahan.
zh_hans: 错误邮件现在包含了更多关于调试服务器错误页面的详细信息和格式。

source: :meth:`~django.template.Library.simple_tag` now accepts a ``takes_context`` argument, making it easier to write simple template tags that require access to template context.
id: :meth:`~django.template.Library.simple_tag` sekarang menerima sebuah argumen ``takes_context``, membuatnya lebih mudah untuk menulis etiket cetakan sederhana yang membutuhkan akses ke konteks cetakan.
zh_hans: :meth:`~django.template.Library.simple_tag` 现在接受一个 ``takes_context`` 参数，这使得编写需要访问模板上下文的简单模板标签变得更加容易。

source: A new :meth:`~django.shortcuts.render()` shortcut -- an alternative to ``django.shortcuts.render_to_response()`` providing a :class:`~django.template.RequestContext` by default.
id: Jalan pintas :meth:`~django.shortcuts.render()` baru -- sebuah jalan lain ke ``django.shortcuts.render_to_response()`` menyediakan sebuah :class:`~django.template.RequestContext` secara awal.
zh_hans: 一个新的 :meth:`~django.shortcuts.render()` 快捷方式 -- 作为 ``django.shortcuts.render_to_response()`` 的替代，默认提供一个 :class:`~django.template.RequestContext`。

source: Support for combining :class:`F expressions <django.db.models.F>` with ``timedelta`` values when retrieving or updating database values.
zh_hans: 支持在检索或更新数据库值时将 :class:`F 表达式 <django.db.models.F>` 与 ``timedelta`` 值组合使用。

source: Backwards-incompatible changes in 1.3
id: Perubahan bertentangan kebelakang di 1.3
zh_hans: 1.3 中的向后不兼容更改

source: CSRF validation now applies to AJAX requests
id: Pengesahan CSRF sekarang berlaku pada permintaan AJAX
zh_hans: CSRF 验证现在适用于 AJAX 请求

source: Prior to Django 1.2.5, Django's CSRF-prevention system exempted AJAX requests from CSRF verification; due to `security issues`_ reported to us, however, *all* requests are now subjected to CSRF verification. Consult :doc:`the Django CSRF documentation </ref/csrf>` for details on how to handle CSRF verification in AJAX requests.
id: Sebelum Django 1.2.5, sistem pencegahan CSRF Django membebaskan permintaan AJAX dari pengecekan CSRF, karena `security issues`_ dilaporkan ke kami, bagaimanapun, *semua* permintaan sekarang ditujukan ke pengecekan CSRF. Obrolkan :doc:`the Django CSRF documentation </ref/csrf>` untuk rincian pada bagimana menangani pengecekan CSRF di permintaan AJAX.
zh_hans: 在 Django 1.2.5 之前，Django 的 CSRF 预防系统豁免了 AJAX 请求的 CSRF 验证；然而，由于我们收到的有关 `安全问题`_ 的报告，现在 *所有* 请求都需要进行 CSRF 验证。请参考 :doc:`Django CSRF 文档 </ref/csrf>` 以获取有关如何处理 AJAX 请求中的 CSRF 验证的详细信息。

source: Prior to Django 1.2.5, the Django administrative interface allowed filtering on any model field or relation -- not just those specified in ``list_filter`` -- via query string manipulation. Due to security issues reported to us, however, query string lookup arguments in the admin must be for fields or relations specified in ``list_filter`` or ``date_hierarchy``.
id: Sebelum Django 1.2.5, antarmuka administratif Django mengizinkan menyaring pada bidang model apapun atau hubungan -- tidak hanya itu ditentukan di ``list_filter`` -- melalui permintaan pengubahan deretan karakter. Karena masalah keamanan dilaporkan ke kami, bagaimanapun, permintaan argumen pencarian deretan karakter di admin harus untuk bidang atau hubungan ditentukan di ``list_filter`` atau ``date_hierarchy``.
zh_hans: 在 Django 1.2.5 之前，Django 管理界面允许通过查询字符串操作对任何模型字段或关系进行过滤，而不仅仅是那些在 ``list_filter`` 中指定的字段。然而，由于我们收到的有关安全问题的报告，现在在管理界面中的查询字符串查找参数必须是在 ``list_filter`` 或 ``date_hierarchy`` 中指定的字段或关系。

source: Deleting a model doesn't delete associated files
id: Menghapus model tidak menghapus berkas terhubung
zh_hans: 删除模型不会删除关联的文件

source: In earlier Django versions, when a model instance containing a :class:`~django.db.models.FileField` was deleted, :class:`~django.db.models.FileField` took it upon itself to also delete the file from the backend storage. This opened the door to several data-loss scenarios, including rolled-back transactions and fields on different models referencing the same file. In Django 1.3, when a model is deleted the :class:`~django.db.models.FileField`’s ``delete()`` method won't be called. If you need cleanup of orphaned files, you'll need to handle it yourself (for instance, with a custom management command that can be run manually or scheduled to run periodically via e.g. cron).
zh_hans: 在早期的 Django 版本中，当删除包含 :class:`~django.db.models.FileField` 的模型实例时，:class:`~django.db.models.FileField` 会自行从后端存储中删除文件。这打开了许多数据丢失的可能性，包括已回滚的事务以及不同模型上的字段引用相同的文件。在 Django 1.3 中，当删除模型时，不会调用 :class:`~django.db.models.FileField` 的 ``delete()`` 方法。如果需要清理孤立的文件，您需要自行处理它（例如，使用自定义管理命令，可以手动运行或通过 cron 等定期运行）。

source: PasswordInput default rendering behavior
id: Perilaku membangun awalan PasswordInput
zh_hans: PasswordInput 默认渲染行为
