Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The jQuery library embedded in the admin has been upgraded from version 1.11.2 to 2.1.4. jQuery 2.x has the same API as jQuery 1.x, but does not support Internet Explorer 6, 7, or 8, allowing for better performance and a smaller file size. If you need to support IE8 and must also use the latest version of Django, you can override the admin's copy of jQuery with your own by creating a Django application with this structure::
id: Pustaka jQuery ditanam di admin telah ditingkatkan dari versi 1.11.2 ke 2.1.4. jQuery 2.x mempunyai API sama seperti jQuery 1.x, tetapi tidak mendukung Internet Explorer 6, 7, or 8, mengizinkan untuk penampilan lebih baik dan ukuran berkas lebih kecil. Jika anda butuh mendukung IE8 dan harus juga menggunakan versi terakhir dari Django, anda dapat menimpa salinan admin dari jQuery dengan milik anda dengan membuat aplikasi Django dengan struktur ini::

source: ``SyntaxError`` when installing Django setuptools 5.5.x
id: ``SyntaxError`` ketika memasang alat penyetelan Django 5.5.x

source: When installing Django 1.9 or 1.9.1 with setuptools 5.5.x, you'll see::
id: Ketika memasang Django 1.9 atau 1.9.1 dengan alat penyetelan 5.5.x, anda akan melihat::

source: It's safe to ignore these errors (Django will still install just fine), but you can avoid them by upgrading setuptools to a more recent version. If you're using pip, you can upgrade pip using ``pip install -U pip`` which will also upgrade setuptools. This is resolved in later versions of Django as described in the :doc:`/releases/1.9.2`.
id: Itu aman mengabaikan kesalahan-kesalahan ini (Django akan masih memasang baik-naik saja), tetapi anda dapat menghindari mereka dengan meningkatkan alat penyetelan ke versi paling saat ini. Jika anda sedang menggunakan pip, anda dapat meningkatkan menggunakan ``pip install -U pip`` yang akan juga meningkatkan alat penyetelan. Ini akan diselesaikan di versi nanti dari Django seperti digambarkan di :doc:`/releases/1.9.2`.

source: ``django.http.responses.REASON_PHRASES`` and ``django.core.handlers.wsgi.STATUS_CODE_TEXT`` have been removed. Use Python's stdlib instead: :data:`http.client.responses` for Python 3 and `httplib.responses`_ for Python 2.
id: ``django.http.responses.REASON_PHRASES`` dan ``django.core.handlers.wsgi.STATUS_CODE_TEXT`` telah dipindahkan. Gunakan stdlib Python sebagai gantinya: :data:`http.client.responses` untuk Python 3 dan `httplib.responses`_ untuk Python 2.

source: In order to enforce test isolation, database queries are not allowed by default in :class:`~django.test.SimpleTestCase` tests anymore. You can disable this behavior by setting the :attr:`~django.test.SimpleTestCase.allow_database_queries` class attribute to ``True`` on your test class.
id: Untuk memaksa pengasingan percobaan, permintaan basisdata tidak diizinkan secara awalan di percobaan :class:`~django.test.SimpleTestCase` lagi. Anda dapat meniadakan perilaku ini dengan mengatur atribut kelas :attr:`~django.test.SimpleTestCase.allow_database_queries` menjadi ``True`` pada kelas percobaan anda.

source: Template text that is translated and uses two or more consecutive percent signs, e.g. ``"%%"``, may have a new `msgid` after ``makemessages`` is run (most likely the translation will be marked fuzzy). The new ``msgid`` will be marked ``"#, python-format"``.
id: Teks cetakan yang diterjemahkan dan menggunakan dua atau lebih tanda persen berurutan, sebagai contoh ``"%%"``, mungkin mempunyai `msgid` baru setelah ``makemessages`` dijalankan (yang paling disukai terjemahan akan ditandai tidak jelas). ``msgid`` baru akan ditandai ``"#, python-format"``.

source: This change also means that the old way of including an ``AdminSite`` instance is deprecated. Instead, pass ``admin.site.urls`` directly to :func:`~django.conf.urls.url()`:
id: Perubahan ini juga berarti bahwa cara lama dari menyertakan sebuah instance ``AdminSite`` adalah diusangkan. Sebagai gantinya, lewatkan ``admin.site.urls`` secara langsung ke :func:`~django.conf.urls.url()`:

source: All views in ``django.contrib.auth.views`` have the following structure::
id: Semua tampilan di ``django.contrib.auth.views`` mempunyai struktur berikut::

source: The `cache_choices` option to :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField` is removed.
id: `cache_choices` option to :class:`~django.forms.ModelChoiceField` dan :class:`~django.forms.ModelMultipleChoiceField` dipindahkan.

source: Restored ``contrib.auth`` hashers compatibility with py-bcrypt (:ticket:`26016`).
id: Disimpan kembali kesesuaian pencampur ``contrib.auth`` dengan py-bcrypt (:ticket:`26016`).

source: Security issue: User with "change" but not "add" permission can create objects for ``ModelAdmin``s with ``save_as=True``
id: Masalah keamanan: Pengguna dengan "change" tetapi tidak "add" perizinan dapat membuat obyek untuk ``ModelAdmin`` dengan ``save_as=True``

source: The new :option:`makemessages --add-location` option controls the comment format in PO files.
id: Pilihan baru :option:`makemessages --add-location` mengendalikan bentuk komentar dalam berkas-berkas PO.

source: On Oracle, ``AutoField`` and ``BigAutoField`` are now created as `identity columns`_.
id: Pada Oracle, ``AutoField`` dan ``BigAutoField``sekarang dibuat sebagai `identity columns`_.

source: The :djadmin:`runserver` Web server supports HTTP 1.1.
id: Peladen jaringan :djadmin:`runserver` mendukung HTTP 1.1.

source: When :setting:`USE_L10N` is off, :class:`~django.forms.FloatField` and :class:`~django.forms.DecimalField` now respect :setting:`DECIMAL_SEPARATOR` and :setting:`THOUSAND_SEPARATOR` during validation. For example, with the settings::
id: ketika :setting:`USE_L10N` adalah mati, :class:`~django.forms.FloatField` dan :class:`~django.forms.DecimalField` sekarang menghormati :setting:`DECIMAL_SEPARATOR` dan :setting:`THOUSAND_SEPARATOR` selama pengesahan. Sebagai contoh, dengan pengaturan::

source: Django 0.95 `(patch) <https://github.com/django/django/commit/a132d411c6>`__ (released January 21 2007)
id: Django 0.95 `(patch) <https://github.com/django/django/commit/a132d411c6>`__ (diterbitkan Januari 21 2007)

source: All other security issues have been handled under versions of Django's security process. These are listed below.
id: Semua masalah keamanan lain telah ditangani dibawah versi dari pengeolahan keamanan Django. Ini adalah terdaftar dibawah.

source: October 9, 2009 - :cve:`2009-3965`
id: 9 Oktober 2009 - :cve:`2009-3965`

source: Django 1.4 `(patch <https://github.com/django/django/commit/3f3d887a6844ec2db743fee64c9e53e04d39a368>`__ and `Python compatibility fix) <https://github.com/django/django/commit/6903d1690a92aa040adfb0c8eb37cf62e4206714>`__
id: Django 1.4 `(patch <https://github.com/django/django/commit/3f3d887a6844ec2db743fee64c9e53e04d39a368>`__ dan `Memperbaiki kesesuaian Python) <https://github.com/django/django/commit/6903d1690a92aa040adfb0c8eb37cf62e4206714>`__

source: User with "change" but not "add" permission can create objects for ``ModelAdmin``s with ``save_as=True``. `Full description <https://www.djangoproject.com/weblog/2016/feb/01/releases-192-and-189/>`__
id: Pengguna dengan "change" tetapi tidak "add" perizinan dapat membuat obyek untuk ``ModelAdmin`` dengan ``save_as=True``. `Full description <https://www.djangoproject.com/weblog/2016/feb/01/releases-192-and-189/>`__
