Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :djadmin:`dumpdata` now can compress data in the ``bz2``, ``gz``, ``lzma``, or ``xz`` formats.
zh_hans: :djadmin:`dumpdata` 现在可以压缩 ``bz2``、``gz``、``lzma`` 或 ``xz`` 格式的数据。

source: :djadmin:`makemigrations` can now be called without an active database connection. In that case, check for a consistent migration history is skipped.
zh_hans: :djadmin:`makemigrations` 现在可以在没有数据库连接的情况下调用。在这种情况下，会跳过检查是否有一致的迁移历史。

source: :attr:`.BaseCommand.requires_system_checks` now supports specifying a list of tags. System checks registered in the chosen tags will be checked for errors prior to executing the command. In previous versions, either all or none of the system checks were performed.
zh_hans: :attr:`.BaseCommand.required_system_checks` 现在支持指定一个标签列表。在所选标签中注册的系统检查将在执行命令前被检查出错误。在之前的版本中，所有的系统检查或者都不执行，或者都会被执行。

source: Support for colored terminal output on Windows is updated. Various modern terminal environments are automatically detected, and the options for enabling support in other cases are improved. See :ref:`syntax-coloring` for more details.
zh_hans: 更新了对 Windows 上彩色终端输出的支持。各种现代终端环境被自动检测到，在其他情况下启用支持的选项也被改进。更多细节见 :ref:`syntax-coloring`。

source: The new ``Operation.migration_name_fragment`` property allows providing a filename fragment that will be used to name a migration containing only that operation.
zh_hans: 新的 ``Operation.migration_name_fragment`` 属性允许提供一个文件名片段，该片段将被用来命名只包含该操作的迁移。

source: Migrations now support serialization of pure and concrete path objects from :mod:`pathlib`, and :class:`os.PathLike` instances.
zh_hans: 迁移现在支持从 :mod:`pathlib` 和 :class:`os.PathLike` 实例中序列化纯路径和具体路径对象。

source: The new ``no_key`` parameter for :meth:`.QuerySet.select_for_update()`, supported on PostgreSQL, allows acquiring weaker locks that don't block the creation of rows that reference locked rows through a foreign key.
zh_hans: 在 PostgreSQL 上支持 :meth:`.QuerySet.select_for_update()` 的新的 ``no_key`` 参数，允许获得较弱的锁，不会阻止创建通过外键引用被锁定行的新行。

source: :class:`When() <django.db.models.expressions.When>` expression now allows using the ``condition`` argument with ``lookups``.
zh_hans: :class:`When() <django.db.models.expressions.When>` 表达式现在允许使用 ``condition`` 参数与 ``lookups``。

source: The new :attr:`.Index.include` and :attr:`.UniqueConstraint.include` attributes allow creating covering indexes and covering unique constraints on PostgreSQL 11+.
zh_hans: 新的 :attr:`.Index.include` 和 :attr:`.UniqueConstraint.include` 属性允许在 PostgreSQL 11+ 上创建覆盖索引和覆盖唯一约束。

source: The new :attr:`.UniqueConstraint.opclasses` attribute allows setting PostgreSQL operator classes.
zh_hans: 新的 :attr:`.UniqueConstraint.opclasses` 属性允许设置 PostgreSQL 操作符类。

source: The :meth:`.QuerySet.update` method now respects the ``order_by()`` clause on MySQL and MariaDB.
zh_hans: :meth:`.QuerySet.update` 方法现在尊重 MySQL 和 MariaDB 的 ``order_by()`` 子句。

source: :class:`FilteredRelation() <django.db.models.FilteredRelation>` now supports nested relations.
zh_hans: :class:`FilteredRelation() <django.db.models.FilteredRelation>` 现在支持嵌套关系。

source: The ``of`` argument of :meth:`.QuerySet.select_for_update()` is now allowed on MySQL 8.0.1+.
zh_hans: :meth:`.QuerySet.select_for_update()` 的 ``of`` 参数现在于 MySQL 8.0.1+ 版本中被允许。

source: :class:`Value() <django.db.models.Value>` expression now automatically resolves its ``output_field`` to the appropriate :class:`Field <django.db.models.Field>` subclass based on the type of its provided ``value`` for :py:class:`bool`, :py:class:`bytes`, :py:class:`float`, :py:class:`int`, :py:class:`str`, :py:class:`datetime.date`, :py:class:`datetime.datetime`, :py:class:`datetime.time`, :py:class:`datetime.timedelta`, :py:class:`decimal.Decimal`, and :py:class:`uuid.UUID` instances. As a consequence, resolving an ``output_field`` for database functions and combined expressions may now crash with mixed types when using ``Value()``. You will need to explicitly set the ``output_field`` in such cases.
zh_hans: :class:`Value() <django.db.models.Value>` 表达式现在会根据其提供的 ``value`` 的类型自动将其 ``output_field`` 解析为适当的 :class:`Field <django.db.models.Field>` 子类，适用于 :py:class:`bool`、:py:class:`bytes`、:py:class:`float`、:py:class:`int`、:py:class:`str`、:py:class:`datetime.date`、:py:class:`datetime.datetime`、:py:class:`datetime.time`、:py:class:`datetime.timedelta`、:py:class:`decimal.Decimal` 和 :py:class:`uuid.UUID` 实例。因此，在使用 ``Value()`` 时，解析数据库函数和组合表达式的 ``output_field`` 现在可能会因混合类型而崩溃。在这种情况下，你将需要明确地设置 ``output_field``。

source: The new :meth:`.QuerySet.alias` method allows creating reusable aliases for expressions that don't need to be selected but are used for filtering, ordering, or as a part of complex expressions.
zh_hans: 新的 :meth:`.QuerySet.alias` 方法允许为表达式创建可重复使用的别名，这些表达式不需要被选择，但可用于过滤、排序，或作为复杂表达式的一部分。

source: The new :class:`~django.db.models.functions.Collate` function allows filtering and ordering by specified database collations.
zh_hans: 新的 :class:`~django.db.models.function.Collate` 函数允许通过指定的数据库排列方式进行过滤和排序。

source: The ``field_name`` argument of :meth:`.QuerySet.in_bulk()` now accepts distinct fields if there's only one field specified in :meth:`.QuerySet.distinct`.
zh_hans: 如果在 :meth:`.QuerySet.distinct` 中只指定了一个字段，:meth:`.QuerySet.in_bulk()` 的 ``field_name`` 参数现在可以接受不同的字段。

source: The new ``tzinfo`` parameter of the :class:`~django.db.models.functions.TruncDate` and :class:`~django.db.models.functions.TruncTime` database functions allows truncating datetimes in a specific timezone.
zh_hans: :class:`~django.db.models.function.TruncDate` 和 :class:`~django.db.models.function.TruncTime` 数据库函数的新 ``tzinfo`` 参数允许截断特定时区的数据时间。

source: The new ``db_collation`` argument for :attr:`CharField <django.db.models.CharField.db_collation>` and :attr:`TextField <django.db.models.TextField.db_collation>` allows setting a database collation for the field.
zh_hans: 为 :attr:`CharField <django.db.models.CharField.db_collation>` 和 :attr:`TextField <django.db.models.TextField.db_collation>` 新增的 ``db_collation`` 参数允许为字段设置一个数据库排序。

source: Added the :class:`~django.db.models.functions.Random` database function.
zh_hans: 添加了 :class:`~django.db.models.function.Random` 数据库函数。

source: :ref:`aggregation-functions`, :class:`F() <django.db.models.F>`, :class:`OuterRef() <django.db.models.OuterRef>`, and other expressions now allow using transforms. See :ref:`using-transforms-in-expressions` for details.
zh_hans: :ref:`aggregation-functions`、:class:`F() <django.db.models.F>`、:class:`OuterRef() <django.db.models.OuterRef>` 以及其他表达式现在允许使用变换。详情参见 :ref:`using-transforms-in-expressions`。

source: The new ``durable`` argument for :func:`~django.db.transaction.atomic` guarantees that changes made in the atomic block will be committed if the block exits without errors. A nested atomic block marked as durable will raise a ``RuntimeError``.
zh_hans: :func:`~django.db.transaction.atomic` 的新参数 ``durable`` 保证在原子块中所做的更改将被提交，如果该块退出时没有错误。嵌套的原子块被标记为耐用，将引发一个 ``RuntimeError``。

source: Added the :class:`~django.db.models.functions.JSONObject` database function.
zh_hans: 添加了 :class:`~django.db.models.function.JSONObject` 数据库函数。

source: The new :meth:`django.core.paginator.Paginator.get_elided_page_range` method allows generating a page range with some of the values elided. If there are a large number of pages, this can be helpful for generating a reasonable number of page links in a template.
zh_hans: 新的 :meth:`django.core.paginator.Paginator.get_elided_page_range` 方法允许生成一个页面范围，其中的一些值被删除。如果有大量的页面，这对在模板中生成合理数量的页面链接很有帮助。

source: Response headers are now stored in :attr:`.HttpResponse.headers`. This can be used instead of the original dict-like interface of ``HttpResponse`` objects. Both interfaces will continue to be supported. See :ref:`setting-header-fields` for details.
zh_hans: 响应头信息现在被存储在 :attr:`.HttpResponse.headers` 中。这可以代替原来的 ``HttpResponse`` 对象的类似字典的接口。这两个接口将继续被支持。详情见 :ref:`setting-header-fields`。

source: The new ``headers`` parameter of :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, and :class:`~django.template.response.TemplateResponse` allows setting response :attr:`~django.http.HttpResponse.headers` on instantiation.
zh_hans: :class:`~django.http.HttpResponse`、:class:`~django.template.response.SimpleTemplateResponse` 以及 :class:`~django.template.response.TemplateResponse` 的新 ``headers`` 参数允许在实例化时设置响应的 :attr:`~django.http.HttpResponse.headers`。

source: The :setting:`SECRET_KEY` setting is now checked for a valid value upon first access, rather than when settings are first loaded. This enables running management commands that do not rely on the ``SECRET_KEY`` without needing to provide a value. As a consequence of this, calling :func:`~django.conf.settings.configure` without providing a valid ``SECRET_KEY``, and then going on to access ``settings.SECRET_KEY`` will now raise an :exc:`~django.core.exceptions.ImproperlyConfigured` exception.
zh_hans: :setting:`SECRET_KEY` 配置现在是在第一次访问时检查有效值，而不是在第一次加载设置时。这使得运行不依赖 ``SECRET_KEY`` 的管理命令不需要提供一个值。因此，在没有提供有效的 ``SECRET_KEY`` 的情况下调用 :func:`~django.conf.settings.configure`，然后继续访问 ``settings.SECRET_KEY`` 现在会引发一个 :exc:`~django.core.exceptions.ImproperlyConfigured` 异常。

source: The new ``Signer.sign_object()`` and ``Signer.unsign_object()`` methods allow signing complex data structures. See :ref:`signing-complex-data` for more details.
zh_hans: 新的 ``Signer.sign_object()`` 和 ``Signer.unsign_object()`` 方法允许签署复杂数据结构。更多细节见 :ref:`signing-complex-data`。

source: Also, :func:`signing.dumps() <django.core.signing.dumps>` and :func:`~django.core.signing.loads` become shortcuts for :meth:`.TimestampSigner.sign_object` and :meth:`~.TimestampSigner.unsign_object`.
zh_hans: 另外， :func:`signing.dumps() <django.core.signing.dumps>` 和 :func:`~django.core.signing.load` 成为 :meth:`.TimestampSigner.sign_object` 和 :meth:`~.TimestampSigner.unsign_object` 的快捷方式。

source: The new :ref:`JSONL <serialization-formats-jsonl>` serializer allows using the JSON Lines format with :djadmin:`dumpdata` and :djadmin:`loaddata`. This can be useful for populating large databases because data is loaded line by line into memory, rather than being loaded all at once.
zh_hans: 新的 :ref:`JSONL <serialization-formats-jsonl>` 序列化器允许使用 JSON Lines 格式与 :djadmin:`dumpdata` 和 :djadmin:`loaddata`。这对填充大型数据库很有用，因为数据是逐行加载到内存中的，而不是一次性加载。

source: :meth:`Signal.send_robust() <django.dispatch.Signal.send_robust>` now logs exceptions.
zh_hans: :meth:`Signal.send_robust() <django.dispatch.Signal.send_robust>` 现在会记录异常。

source: :tfilter:`floatformat` template filter now allows using the ``g`` suffix to force grouping by the :setting:`THOUSAND_SEPARATOR` for the active locale.
zh_hans: :tfilter:`floatformat` 模板过滤器现在允许使用 ``g`` 后缀来强制按 :setting:`THOUSAND_SEPARATOR` 对活动 locale 进行分组

source: Templates cached with :ref:`Cached template loaders<template-loaders>` are now correctly reloaded in development.
zh_hans: 用 :ref:`缓存的模板加载器<template-loaders>` 缓存的模板现在可以在开发模式中正确地重新加载。

source: Objects assigned to class attributes in :meth:`.TestCase.setUpTestData` are now isolated for each test method. Such objects are now required to support creating deep copies with :py:func:`copy.deepcopy`. Assigning objects which don't support ``deepcopy()`` is deprecated and will be removed in Django 4.1.
zh_hans: 在 :meth:`.TestCase.setUpTestData` 中分配给类属性的对象现在对每个测试方法都是孤立的。这些对象现在需要支持用 :py:func:`copy.deepcopy` 创建深度拷贝。指定不支持 ``deepcopy()`` 的对象已被废弃，并将在 Django 4.1 中被移除。

source: :class:`~django.test.runner.DiscoverRunner` now enables :py:mod:`faulthandler` by default. This can be disabled by using the :option:`test --no-faulthandler` option.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 现在默认启用 :py:mod:`faulthandler`。这可以通过使用 :option:`test --no-faulthandler` 选项来禁用。

source: :class:`~django.test.runner.DiscoverRunner` and the :djadmin:`test` management command can now track timings, including database setup and total run time. This can be enabled by using the :option:`test --timing` option.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 和 :djadmin:`test` 管理命令现在可以跟踪计时，包括数据库设置和总运行时间。这可以通过使用 :option:`test --timing` 选项来启用。

source: :class:`~django.test.Client` now preserves the request query string when following 307 and 308 redirects.
zh_hans: :class:`~django.test.Client` 现在在跟随 307 和 308 重定向时保留了请求的查询字符串。

source: The new :meth:`.TestCase.captureOnCommitCallbacks` method captures callback functions passed to :func:`transaction.on_commit() <django.db.transaction.on_commit>` in a list. This allows you to test such callbacks without using the slower :class:`.TransactionTestCase`.
zh_hans: 新的 :meth:`.TestCase.captureOnCommitCallbacks` 方法在一个列表中捕获传递给 :func:`transaction.on_commit() <django.db.transaction.on_commit>` 的回调函数。这允许你在不使用较慢的 :class:`.TransactionTestCase` 的情况下测试此类回调。

source: :meth:`TransactionTestCase.assertQuerysetEqual() <django.test.TransactionTestCase.assertQuerySetEqual>` now supports direct comparison against another queryset rather than being restricted to comparison against a list of string representations of objects when using the default value for the ``transform`` argument.
zh_hans: :meth:`TransactionTestCase.assertQuerysetEqual() <django.test.TransactionTestCase.assertQuerySetEqual>` 现在支持直接与另一个查询集进行比较，而不仅仅是在使用默认值的情况下与对象的字符串表示列表进行比较时。

source: The new ``depth`` parameter of ``django.utils.timesince.timesince()`` and ``django.utils.timesince.timeuntil()`` functions allows specifying the number of adjacent time units to return.
zh_hans: ``django.utils.timesince.timesince()`` 和 ``django.utils.timesince.timeuntil()`` 函数的新 ``depth`` 参数允许指定要返回的相邻时间单位的数量。

source: Built-in validators now include the provided value in the ``params`` argument of a raised :exc:`~django.core.exceptions.ValidationError`. This allows custom error messages to use the ``%(value)s`` placeholder.
zh_hans: 内置的验证器现在包括提供的值在提出的 :exc:`~django.core.exceptions.ValidationError` 的 ``params`` 参数。这允许自定义错误信息使用 ``%(value)s`` 占位符。

source: The :class:`.ValidationError` equality operator now ignores ``messages`` and ``params`` ordering.
zh_hans: :class:`.ValidationError` 相等运算符现在忽略了 ``messages`` 和 ``params`` 的排序。

source: Backwards incompatible changes in 3.2
zh_hans: 3.2 中向后不兼容的更改

source: The new ``DatabaseFeatures.introspected_field_types`` property replaces these features:
zh_hans: 新的 ``DatabaseFeatures.introspected_field_types`` 属性取代了这些特性：

source: To enable support for covering indexes (:attr:`.Index.include`) and covering unique constraints (:attr:`.UniqueConstraint.include`), set ``DatabaseFeatures.supports_covering_indexes`` to ``True``.
zh_hans: 要启用对覆盖索引（:attr:`.Index.include`）和覆盖唯一约束（:attr:`.UniqueConstraint.include`）的支持，设置 ``DatabaseFeatures.supports_covering_indexes`` 为 ``True``。

source: Third-party database backends must implement support for column database collations on ``CharField``\s and ``TextField``\s or set ``DatabaseFeatures.supports_collation_on_charfield`` and ``DatabaseFeatures.supports_collation_on_textfield`` to ``False``. If non-deterministic collations are not supported, set ``supports_non_deterministic_collations`` to ``False``.
zh_hans: 第三方数据库后端必须实现对 ``CharField`` 和 ``TextField`` 的列数据库校对的支持，或者将 ``DatabaseFeatures.supports_collation_on_charfield`` 和 ``DatabaseFeatures.supports_collation_on_textfield`` 设为 ``False``。如果不支持非确定的排序，请将 ``supports_non_deterministic_collations`` 设为 ``False``。

source: ``DatabaseOperations.random_function_sql()`` is removed in favor of the new :class:`~django.db.models.functions.Random` database function.
zh_hans: ``DatabaseOperations.random_function_sql()`` 已被删除，改用新的 :class:`~django.db.models.function.Random` 数据库函数。

source: ``DatabaseOperations.date_trunc_sql()`` and ``DatabaseOperations.time_trunc_sql()`` now take the optional ``tzname`` argument in order to truncate in a specific timezone.
zh_hans: ``DatabaseOperations.date_trunc_sql()`` 和 ``DatabaseOperations.time_trunc_sql()`` 现在接受可选的 ``tzname`` 参数，以便在特定的时区进行截断。

source: ``DatabaseClient.runshell()`` now gets arguments and an optional dictionary with environment variables to the underlying command-line client from ``DatabaseClient.settings_to_cmd_args_env()`` method. Third-party database backends must implement ``DatabaseClient.settings_to_cmd_args_env()`` or override ``DatabaseClient.runshell()``.
zh_hans: ``DatabaseClient.runshell()`` 现在可以从 ``DatabaseClient.settings_to_cmd_args_env()`` 方法中获得参数和带有环境变量的可选字典给底层命令行客户端。第三方数据库后端必须实现 ``DatabaseClient.settings_to_cmd_args_env()`` 或覆盖 ``DatabaseClient.runshell()``。

source: Third-party database backends must implement support for functional indexes (:attr:`.Index.expressions`) or set ``DatabaseFeatures.supports_expression_indexes`` to ``False``. If ``COLLATE`` is not a part of the ``CREATE INDEX`` statement, set ``DatabaseFeatures.collate_as_index_expression`` to ``True``.
zh_hans: 第三方数据库后端必须实现对函数索引的支持（:attr:`.Index.expressions`）或者将 ``DatabaseFeatures.supports_expression_indexes`` 设为 ``False``。如果 ``COLLATE`` 不是 ``CREATE INDEX`` 语句的一部分，请将 ``DatabaseFeatures.collate_as_index_expression`` 设为 ``True``。

source: Pagination links in the admin are now 1-indexed instead of 0-indexed, i.e. the query string for the first page is ``?p=1`` instead of ``?p=0``.
zh_hans: 管理中的分页链接现在是 1 开头索引，而不是 0 开头索引，即第一页的查询字符串是 ``?p=1``，而不是 ``?p=0``。

source: The new admin catch-all view will break URL patterns routed after the admin URLs and matching the admin URL prefix. You can either adjust your URL ordering or, if necessary, set :attr:`AdminSite.final_catch_all_view <django.contrib.admin.AdminSite.final_catch_all_view>` to ``False``, disabling the catch-all view. See :ref:`whats-new-3.2` for more details.
zh_hans: 新的管理全局回退视图将打破在管理 URL 之后路由并匹配管理 URL 前缀的 URL 模式。你可以调整你的 URL 排序，或者，如果有必要，将 :attr:`AdminSite.final_catch_all_view <django.contrib.admin.AdminSite.final_catch_all_view>` 设置为 ``False``，禁用全局回退视图。更多细节见 :ref:`whats-new-3.2`。

source: Minified JavaScript files are no longer included with the admin. If you require these files to be minified, consider using a third party app or external build tool. The minified vendored JavaScript files packaged with the admin (e.g. :ref:`jquery.min.js <contrib-admin-jquery>`) are still included.
zh_hans: 最小化的 JavaScript 文件不再包括在管理中。如果你需要这些文件被最小化，请考虑使用第三方应用程序或外部构建工具。与管理一起打包的已被最小化的 JavaScript 文件（例如 :ref:`jquery.min.js <contrib-admin-jquery>`）仍然包括在内。

source: :attr:`.ModelAdmin.prepopulated_fields` no longer strips English stop words, such as ``'a'`` or ``'an'``.
zh_hans: :attr:`.ModelAdmin.prepopulated_fields` 不再剥离英文停顿词，例如 ``'a'`` 或 ``'an'``。

source: Support for PostGIS 2.2 is removed.
zh_hans: 移除对 PostGIS 2.2 的支持。

source: The Oracle backend now clones polygons (and geometry collections containing polygons) before reorienting them and saving them to the database. They are no longer mutated in place. You might notice this if you use the polygons after a model is saved.
zh_hans: Oracle 后端现在在调整多边形（和包含多边形的几何体集合）的方向并将其保存到数据库之前克隆它们。它们不再是可原地变更的。如果你在模型被保存后使用多边形，你可能会注意到这一点。

source: Dropped support for PostgreSQL 9.5
zh_hans: 丢弃了对 PostgreSQL 9.5 的支持

source: Upstream support for PostgreSQL 9.5 ends in February 2021. Django 3.2 supports PostgreSQL 9.6 and higher.
zh_hans: 对 PostgreSQL 9.5 的上游支持在 2021 年 2 月结束。Django 3.2 支持 PostgreSQL 9.6 及以上版本。

source: Dropped support for MySQL 5.6
zh_hans: 丢弃了对 MySQL 5.6 的支持

source: The end of upstream support for MySQL 5.6 is April 2021. Django 3.2 supports MySQL 5.7 and higher.
zh_hans: 对 MySQL 5.6 的上游支持在 2021 年 4 月结束。Django 3.2 支持 MySQL 5.7 及以上版本。

source: Django now supports non-``pytz`` time zones, such as Python 3.9+'s :mod:`zoneinfo` module and its backport.
zh_hans: Django 现在支持非 ``pytz`` 时区，例如 Python 3.9+ 的 :mod:`zoneinfo` 模块及其向后移植版本。

source: The undocumented ``SpatiaLiteOperations.proj4_version()`` method is renamed to ``proj_version()``.
zh_hans: 未记录的 ``SpatiaLiteOperations.proj4_version()`` 方法改名为 ``proj_version()``。

source: :func:`~django.utils.text.slugify` now removes leading and trailing dashes and underscores.
zh_hans: :func:`~django.utils.text.slugify` 现在可以删除前面和后面的破折号以及下划线。

source: The :tfilter:`intcomma` and :tfilter:`intword` template filters no longer depend on the ``USE_L10N`` setting.
zh_hans: :tfilter:`intcomma` 和 :tfilter:`intword` 模板过滤器不再依赖于 ``USE_L10N`` 设置。

source: Support for ``argon2-cffi`` < 19.1.0 is removed.
zh_hans: 移除对 ``argon2-cffi`` < 19.1.0 的支持。

source: The cache keys no longer includes the language when internationalization is disabled (``USE_I18N = False``) and localization is enabled (``USE_L10N = True``). After upgrading to Django 3.2 in such configurations, the first request to any previously cached value will be a cache miss.
zh_hans: 当国际化被禁用（``USE_I18N = False``）和本地化被启用（``USE_L10N = True``）时，缓存键不再包括语言。在这样的配置下，升级到 Django 3.2 后，对任何以前的缓存值的第一次请求将是一次缓存丢失。

source: ``ForeignKey.validate()`` now uses :attr:`~django.db.models.Model._base_manager` rather than :attr:`~django.db.models.Model._default_manager` to check that related instances exist.
zh_hans: ``ForeignKey.validate()`` 现在使用 :attr:`~django.db.models.Model._base_manager` 而不是 :attr:`~django.db.models.Model._default_manager` 来检查相关实例是否存在。

source: When an application defines an :class:`~django.apps.AppConfig` subclass in an ``apps.py`` submodule, Django now uses this configuration automatically, even if it isn't enabled with ``default_app_config``. Set ``default = False`` in the :class:`~django.apps.AppConfig` subclass if you need to prevent this behavior. See :ref:`whats-new-3.2` for more details.
zh_hans: 当一个应用程序在 ``apps.py`` 子模块中定义了一个 :class:`~django.apps.AppConfig` 子类，Django 现在会自动使用这个配置，即使它没有用 ``default_app_config`` 启用。如果你需要防止这种行为，请在 :class:`~django.apps.AppConfig` 子类中设置 ``default = False``。更多细节见 :ref:`whats-new-3.2`。

source: Instantiating an abstract model now raises ``TypeError``.
zh_hans: 实例化一个抽象模型现在会引发 ``TypeError``。

source: Keyword arguments to :func:`~django.test.utils.setup_databases` are now keyword-only.
zh_hans: 对 :func:`~django.test.utils.setup_databases` 的关键字参数现在是只能用关键字。

source: The undocumented ``django.utils.http.limited_parse_qsl()`` function is removed. Please use :func:`urllib.parse.parse_qsl` instead.
zh_hans: 删除了无文档的 ``django.utils.http.limited_parse_qsl()`` 函数。请使用 :func:`urllib.parse.parse_qsl` 代替。

source: ``django.test.utils.TestContextDecorator`` now uses :py:meth:`~unittest.TestCase.addCleanup` so that cleanups registered in the :py:meth:`~unittest.TestCase.setUp` method are called before ``TestContextDecorator.disable()``.
zh_hans: ``django.test.utils.TestContextDecorator`` 现在使用 :py:meth:`~unittest.TestCase.addCleanup` 所以在 :py:meth:`~unittest.TestCase.setUp` 方法中注册的清理会在 ``TestContextDecorator.disable()`` 前被调用。

source: ``SessionMiddleware`` now raises a :exc:`~django.contrib.sessions.exceptions.SessionInterrupted` exception instead of :exc:`~django.core.exceptions.SuspiciousOperation` when a session is destroyed in a concurrent request.
zh_hans: 当一个会话在并发请求中被销毁时，``SessionMiddleware`` 现在会引发 :exc:`~django.contrib.session.exceptions.SessionInterrupted` 异常，而不是 :exc:`~django.core.exceptions.SuspiciousOperation`。

source: The :class:`django.db.models.Field` equality operator now correctly distinguishes inherited field instances across models. Additionally, the ordering of such fields is now defined.
zh_hans: :class:`django.db.models.Field` 相等运算符现在可以正确区分跨模型的继承字段实例。此外，此类字段的排序现在也被定义了。

source: The undocumented ``django.core.files.locks.lock()`` function now returns ``False`` if the file cannot be locked, instead of raising :exc:`BlockingIOError`.
zh_hans: 未记录的 ``django.core.files.locks.lock()`` 函数现在在文件不能被锁定时返回 ``False``，而不是引发 :exc:`BlockingIOError`。

source: The password reset mechanism now invalidates tokens when the user email is changed.
zh_hans: 密码重置机制现在在用户电子邮件改变时使令牌无效。

source: :djadmin:`makemessages` command no longer processes invalid locales specified using :option:`makemessages --locale` option, when they contain hyphens (``'-'``).
zh_hans: :djadmin:`makemessages` 命令不再处理使用 :option:`makemessages --locale` 选项指定的无效 locale，如果它们包含连字符（``'-'``）。
