Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``query_string`` argument of :class:`~django.http.QueryDict` is now optional, defaulting to ``None``, so a blank ``QueryDict`` can now be instantiated with ``QueryDict()`` instead of ``QueryDict(None)`` or ``QueryDict('')``.
id: Argumen ``query_string`` dari :class:`~django.http.QueryDict` sekarang pilihan, awalan ke ``None``, jadi ``QueryDict`` kosong sekarang dapat di instansiasikan dengan ``QueryDict()`` sebagai gantinya ``QueryDict(None)`` atau ``QueryDict('')``.
zh_hans: :class:`~django.http.QueryDict` 的 ``query_string`` 参数现在是可选的，默认值为 ``None``，因此可以使用 ``QueryDict()`` 来实例化一个空的 ``QueryDict``，而不是 ``QueryDict(None)`` 或 ``QueryDict('')``。

source: The ``GET`` and ``POST`` attributes of an :class:`~django.http.HttpRequest` object are now :class:`~django.http.QueryDict`\s rather than dictionaries, and the ``FILES`` attribute is now a ``MultiValueDict``. This brings this class into line with the documentation and with ``WSGIRequest``.
id: Atribut ``GET`` dan ``POST`` dari sebuah obyek :class:`~django.http.HttpRequest` sekarang :class:`~django.http.QueryDict` daripada kamus, dan atribut ``FILES`` sekarang sebuah ``MultiValueDict``. Ini membawa kelas ini kedalam baris dengan dokumentasi dan dengan ``WSGIRequest``.
zh_hans: :class:`~django.http.HttpRequest` 对象的 ``GET`` 和 ``POST`` 属性现在是 :class:`~django.http.QueryDict`，而不再是字典，而 ``FILES`` 属性现在是一个 ``MultiValueDict``。这使得该类与文档和 ``WSGIRequest`` 保持一致。

source: The :attr:`HttpResponse.charset <django.http.HttpResponse.charset>` attribute was added.
id: Atribut :attr:`HttpResponse.charset <django.http.HttpResponse.charset>` telah ditambahkan
zh_hans: 添加了 :attr:`HttpResponse.charset <django.http.HttpResponse.charset>` 属性。

source: ``WSGIRequestHandler`` now follows RFC in converting URI to IRI, using ``uri_to_iri()``.
id: ``WSGIRequestHandler`` sekarang mengikuti RFC dalam merubah URI menjadi IRI, menggunakan ``uri_to_iri()``.
zh_hans: ``WSGIRequestHandler`` 现在按照 RFC 将 URI 转换为 IRI，使用 ``uri_to_iri()``。

source: The :meth:`HttpRequest.get_full_path() <django.http.HttpRequest.get_full_path>` method now escapes unsafe characters from the path portion of a Uniform Resource Identifier (URI) properly.
id: Metode :meth:`HttpRequest.get_full_path() <django.http.HttpRequest.get_full_path>` sekarang meloloskan karakter tidak aman dari bagian jalur dari sebuah Uniform Resource Identifier (URI) dengan benar.
zh_hans: :meth:`HttpRequest.get_full_path() <django.http.HttpRequest.get_full_path>` 方法现在正确地对 Uniform Resource Identifier (URI) 的路径部分进行了字符转义，以防止不安全字符的问题。

source: :class:`~django.http.HttpResponse` now implements a few additional methods like :meth:`~django.http.HttpResponse.getvalue` so that instances can be used as stream objects.
id: :class:`~django.http.HttpResponse` sekarang menerapkan sedikit tambahan motode seperti :meth:`~django.http.HttpResponse.getvalue` sehingga instance dapat digunakan sebagai obyek aliran.
zh_hans: :class:`~django.http.HttpResponse` 类现在实现了一些额外的方法，如 :meth:`~django.http.HttpResponse.getvalue`，使得实例可以作为流对象使用。

source: The new :meth:`HttpResponse.setdefault() <django.http.HttpResponse.setdefault>` method allows setting a header unless it has already been set.
id: Metode :meth:`HttpResponse.setdefault() <django.http.HttpResponse.setdefault>` baru mengizinkan mengatur sebuah kepala meskipun itu sudah disetel.
zh_hans: 新的 :meth:`HttpResponse.setdefault() <django.http.HttpResponse.setdefault>` 方法允许在尚未设置时设置标头。

source: You can use the new :class:`~django.http.FileResponse` to stream files.
id: Anda dapat menggunakan :class:`~django.http.FileResponse` baru pada berkas aliran.
zh_hans: 你可以使用新的 :class:`~django.http.FileResponse` 来流式传输文件。

source: The :func:`~django.views.decorators.http.condition` decorator for conditional view processing now supports the ``If-unmodified-since`` header.
id: Penghias :func:`~django.views.decorators.http.condition` untuk pengolahan tampilan bersyarat sekarang mendukung kepala ``If-unmodified-since``.
zh_hans: 用于条件视图处理的 :func:`~django.views.decorators.http.condition` 装饰器现在支持 ``If-unmodified-since`` 标头。

source: The :class:`RequestFactory.trace() <django.test.RequestFactory>` and :class:`Client.trace() <django.test.Client.trace>` methods were implemented, allowing you to create ``TRACE`` requests in your tests.
id: Metode :class:`RequestFactory.trace() <django.test.RequestFactory>` dan :class:`Client.trace() <django.test.Client.trace>` diterapkan, mengizinkan anda membuat permintaan ``TRACE`` di percobaan anda.
zh_hans: :class:`RequestFactory.trace() <django.test.RequestFactory>` 和 :class:`Client.trace() <django.test.Client.trace>` 方法已经实现，允许你在测试中创建 ``TRACE`` 请求。

source: The ``count`` argument was added to :meth:`~django.test.SimpleTestCase.assertTemplateUsed`. This allows you to assert that a template was rendered a specific number of times.
id: Argumen ``count`` telah ditambahkan ke :meth:`~django.test.SimpleTestCase.assertTemplateUsed`. Ini mengizinkan anda untuk menegaskan bahwa sebuah cetakan telah membangun sejumlah kali tertentu.
zh_hans: :meth:`~django.test.SimpleTestCase.assertTemplateUsed` 添加了 ``count`` 参数。这允许你断言模板被渲染了特定次数。

source: The new :meth:`~django.test.SimpleTestCase.assertJSONNotEqual` assertion allows you to test that two JSON fragments are not equal.
id: Penegasan :meth:`~django.test.SimpleTestCase.assertJSONNotEqual` baru mengizinkan anda mencoba yang dua fragmen JSON tidak setara.
zh_hans: 新的 :meth:`~django.test.SimpleTestCase.assertJSONNotEqual` 断言允许你测试两个 JSON 片段不相等。

source: Added options to the :djadmin:`test` command to preserve the test database (:option:`--keepdb <test --keepdb>`), to run the test cases in reverse order (:option:`--reverse <test --reverse>`), and to enable SQL logging for failing tests (:option:`--debug-sql <test --debug-sql>`).
id: Ditambahkan pilihan pada perintah :djadmin:`test` untuk mempertahankan basisdata percobaan (:option:`--keepdb <test --keepdb>`), untuk menjalankan percobaan-percobaan kasus dalam urutan terbalik (:option:`--reverse <test --reverse>`), dan untuk mengadakan pencatatan SQL untuk kegagalan percobaan (:option:`--debug-sql <test --debug-sql>`).
zh_hans: 为 :djadmin:`test` 命令添加了选项，以保留测试数据库 (:option:`--keepdb <test --keepdb>`)，以倒序运行测试用例 (:option:`--reverse <test --reverse>`)，并为失败的测试启用 SQL 日志记录 (:option:`--debug-sql <test --debug-sql>`)。

source: Added the :attr:`~django.test.Response.resolver_match` attribute to test client responses.
id: Ditambahkan atribut :attr:`~django.test.Response.resolver_match` pada mencoba tanggapan klien
zh_hans: 为测试客户端响应添加了 :attr:`~django.test.Response.resolver_match` 属性。

source: Added several settings that allow customization of test tablespace parameters for Oracle: :setting:`DATAFILE`, :setting:`DATAFILE_TMP`, :setting:`DATAFILE_MAXSIZE` and :setting:`DATAFILE_TMP_MAXSIZE`.
id: Ditambahkan beberapa pengaturan yang mengizinkan penyesuaian dari parameter tablespace percobaan untuk Oracle: :setting:`DATAFILE`, :setting:`DATAFILE_TMP`, :setting:`DATAFILE_MAXSIZE` dan :setting:`DATAFILE_TMP_MAXSIZE`.
zh_hans: 添加了一些设置，允许自定义 Oracle 测试表空间参数： :setting:`DATAFILE`、:setting:`DATAFILE_TMP`、:setting:`DATAFILE_MAXSIZE` 和 :setting:`DATAFILE_TMP_MAXSIZE`。

source: The :func:`~django.test.override_settings` decorator can now affect the master router in :setting:`DATABASE_ROUTERS`.
id: Penghias :func:`~django.test.override_settings` sekarang dapat mempengaruhi rute master dalam :setting:`DATABASE_ROUTERS`.
zh_hans: :func:`~django.test.override_settings` 装饰器现在可以影响 :setting:`DATABASE_ROUTERS` 中的主路由器。

source: Added test client support for file uploads with file-like objects.
id: Ditambahkan dukungan klien percobaan untuk unggahberkas dengan obyek seperti-berkas.
zh_hans: 添加了对使用类文件对象进行文件上传的测试客户端支持。

source: A shared cache is now used when testing with an SQLite in-memory database when using Python 3.4+ and SQLite 3.7.13+. This allows sharing the database between threads.
id: Sebuah cache berbagi sekarang digunakan ketika dicoba dengan sebuah basisdata di-memori SQLite ketika menggunakan Python 3.4+ dan SQLite 3.7.13+. Ini mengizinkan berbagi basisdata diantara thread.
zh_hans: 在使用 Python 3.4+ 和 SQLite 3.7.13+ 进行测试时，现在使用共享缓存来测试 SQLite 内存数据库。这允许在线程之间共享数据库。

source: :class:`~django.core.validators.URLValidator` now supports IPv6 addresses, Unicode domains, and URLs containing authentication data.
zh_hans: :class:`~django.core.validators.URLValidator` 现在支持 IPv6 地址、Unicode 域名和包含身份验证数据的 URL。

source: Backwards incompatible changes in 1.8
id: Perubahan bertentangan kebelakang di 1.8
zh_hans: 1.8 版本中的向后不兼容的更改

source: In addition to the changes outlined in this section, be sure to review the :ref:`deprecation plan <deprecation-removed-in-1.8>` for any features that have been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada perubahan diuraikan dalam bagian ini, pastikan meninjau kembali :ref:`deprecation plan <deprecation-removed-in-1.8>` untuk setiap fitur-fitur yang telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur yang diberikan, perpindahannya mungkin muncul sebagai sebuah perubahan tidak sesuai kebelakang.
zh_hans: 除了本节中概述的更改之外，请确保查看 :ref:`弃用计划 <deprecation-removed-in-1.8>`，以了解已移除的任何功能。如果您在给定功能的弃用时间内未更新您的代码，其移除可能会被视为不兼容的变更。

source: Related object operations are run in a transaction
id: Tindakan obyek terkait berjalan di sebuah transaksi.
zh_hans: 相关对象操作在事务中执行

source: Some operations on related objects such as :meth:`~django.db.models.fields.related.RelatedManager.add()` or direct assignment ran multiple data modifying queries without wrapping them in transactions. To reduce the risk of data corruption, all data modifying methods that affect multiple related objects (i.e. ``add()``, ``remove()``, ``clear()``, and direct assignment) now perform their data modifying queries from within a transaction, provided your database supports transactions.
id: Beberapa tindakan pada obyek terkait seperti :meth:`~django.db.models.fields.related.RelatedManager.add()` atau penugasan langsung menjalankan banyak data merubah permintaan tanpa membungkus mereka di transaksi. Untuk mengurangi resiko dari kerusakan data, semua data merubah metode yang mempengaruhi banyak obyek terkait (yaitu ``add()``, ``remove()``, ``clear()``, dan penugasan langsung) sekarang melakukan data mereka merubah permintaan dari dalam sebuah transaksi, disediakan transaksi dukungan basisdata anda.
zh_hans: 某些操作涉及到相关对象，例如 :meth:`~django.db.models.fields.related.RelatedManager.add()` 或直接赋值，在没有包装在事务中的情况下运行多个数据修改查询。为了减少数据损坏的风险，现在所有涉及多个相关对象的数据修改方法（即 ``add()``, ``remove()``, ``clear()`` 和直接赋值）都会在事务内执行其数据修改查询，前提是您的数据库支持事务。

source: This has one backwards incompatible side effect, signal handlers triggered from these methods are now executed within the method's transaction and any exception in a signal handler will prevent the whole operation.
id: Ini mempunyai satu efek samping ketidaksesuaian kebelakang, penangan sinyal dipicu dari metode ini sekarang dijalankan dalam transaksi metode dan apapun pengecualian di sebuah penangan sinyal akan mencegah seluruh operasi.
zh_hans: 这个改变带来了一个向后不兼容的副作用，从这些方法触发的信号处理程序现在在方法的事务中执行，而且信号处理程序中的任何异常都会阻止整个操作。

source: Assigning unsaved objects to relations raises an error
id: Menugaskan obyek tidak tersimpan pada hubungan memunculkan sebuah kesalahan
zh_hans: 将未保存的对象分配给关系会引发错误。

source: To more easily allow in-memory usage of models, this change was reverted in Django 1.8.4 and replaced with a check during ``model.save()``. For example:
zh_hans: 为了更容易允许在内存中使用模型，这个更改在 Django 1.8.4 中已被撤销，并在 ``model.save()`` 期间替换为检查。例如：

source: A similar check on assignment to reverse one-to-one relations was removed in Django 1.8.5.
id: Pemeriksaan mirip pada penugasan untuk membalikkan hubungan one-to-one telah dipindahkan di Django 1.8.5.
zh_hans: 在 Django 1.8.5 中，取消了对反向一对一关系分配的类似检查。

source: Assigning unsaved objects to a :class:`~django.db.models.ForeignKey`, :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, and :class:`~django.db.models.OneToOneField` now raises a :exc:`ValueError`.
id: Menugaskan obyek tidak tersimpan pada sebuah :class:`~django.db.models.ForeignKey`, :class:`~django.contrib.contenttypes.fields.GenericForeignKey`, dan :class:`~django.db.models.OneToOneField` sekarang memunculkan :exc:`ValueError`.
zh_hans: 将未保存的对象分配给 :class:`~django.db.models.ForeignKey`、:class:`~django.contrib.contenttypes.fields.GenericForeignKey` 和 :class:`~django.db.models.OneToOneField` 现在会引发 :exc:`ValueError`。

source: Previously, the assignment of an unsaved object would be silently ignored. For example:
zh_hans: 以前，对未保存的对象的分配会被静默忽略。例如：

source: Now, an error will be raised to prevent data loss:
zh_hans: 现在，将引发一个错误以防止数据丢失：

source: If you require allowing the assignment of unsaved instances (the old behavior) and aren't concerned about the data loss possibility (e.g. you never save the objects to the database), you can disable this check by using the ``ForeignKey.allow_unsaved_instance_assignment`` attribute. (This attribute was removed in 1.8.4 as it's no longer relevant.)
id: Jika anda membutuhkan mengizinkan penugasan dari instance tidak disimpan (perilaku lama) dan tidak khawatir tentang kemungkinan kehilangan data (sebagai contoh anda tidak pernah menyimpan obyek-obyek ke basisdata), anda dapat meniadakan pemeriksaan ini dengan menggunakan atribut ``ForeignKey.allow_unsaved_instance_assignment``. (Atribut ini telah dipindahkan di 1.8.4 ketika itu tidak lagi bersangkut paut.)
zh_hans: 如果你需要允许分配未保存的实例（旧行为）并且不担心可能的数据丢失（例如，你从不将对象保存到数据库），你可以通过使用 ``ForeignKey.allow_unsaved_instance_assignment`` 属性来禁用此检查（此属性在 1.8.4 中已被移除，因为不再相关）。

source: Management commands that only accept positional arguments
id: Perintah pengelolaan yang hanya menerima argumen penempatan
zh_hans: 仅接受位置参数的管理命令

source: If you have written a custom management command that only accepts positional arguments and you didn't specify the ``args`` command variable, you might get an error like ``Error: unrecognized arguments: ...``, as variable parsing is now based on :py:mod:`argparse` which doesn't implicitly accept positional arguments. You can make your command backwards compatible by simply setting the ``args`` class variable. However, if you don't have to keep compatibility with older Django versions, it's better to implement the new :meth:`~django.core.management.BaseCommand.add_arguments` method as described in :doc:`/howto/custom-management-commands`.
id: Jika anda telah menulis sebuah penyesuaian perintah pengelolaan yang hanya menerima argumen penempatan dan anda tidak menentukan variabel perintah ``args``, anda mungkin mendapatkan sebuah kesalahan seperti ``Error: unrecognized arguments: ...``, ketika penguraian variabel sekarang berdasarkan pada :py:mod:`argparse` yang tidak secara langsung menerima argumen penempatan. Anda dapat membuat perintah kesesuaian kebelakang anda dengan cukup mengatur variabel kelas ``args``. Bagaimanapun, jika anda tidak harus menhaga kesesuaian dengan versi Django terlama, itu adalah lebih baik menerapkan metode :meth:`~django.core.management.BaseCommand.add_arguments` baru seperti digambarkan di :doc:`/howto/custom-management-commands`.
zh_hans: 如果你编写了一个只接受位置参数的自定义管理命令，并且没有指定 ``args`` 命令变量，你可能会遇到类似 ``Error: unrecognized arguments: ...`` 的错误，因为变量解析现在基于 :py:mod:`argparse`，它不会隐式接受位置参数。你可以通过简单地设置 ``args`` 类变量来使你的命令向后兼容。然而，如果你不需要与旧版本的 Django 保持兼容性，最好按照 :doc:`/howto/custom-management-commands` 中描述的方法实现新的 :meth:`~django.core.management.BaseCommand.add_arguments` 方法。

source: Custom test management command arguments through test runner
id: Penyesuaian argumen perintah pengelolaan percobaan melalui pejalan percobaan
zh_hans: 通过测试运行器对自定义测试管理命令的参数进行设置

source: The method to add custom arguments to the ``test`` management command through the test runner has changed. Previously, you could provide an ``option_list`` class variable on the test runner to add more arguments (à la :py:mod:`optparse`). Now to implement the same behavior, you have to create an ``add_arguments(cls, parser)`` class method on the test runner and call ``parser.add_argument`` to add any custom arguments, as parser is now an :py:class:`argparse.ArgumentParser` instance.
zh_hans: 通过测试运行器向 ``test`` 管理命令添加自定义参数的方法已经发生了变化。以前，你可以在测试运行器上提供一个 ``option_list`` 类变量来添加更多参数（类似于 :py:mod:`optparse`）。现在，为了实现相同的行为，你必须在测试运行器上创建一个 ``add_arguments(cls, parser)`` 类方法，并调用 ``parser.add_argument`` 来添加任何自定义参数，因为现在的 parser 是一个 :py:class:`argparse.ArgumentParser` 实例。

source: Model check ensures auto-generated column names are within limits specified by database
id: Pemeriksaan model memastikan nama-nama kolom dibangkitkan-otomatis dalam batasan ditentukan oleh basisdata.
zh_hans: 模型检查确保自动生成的列名在数据库指定的限制范围内

source: A field name that's longer than the column name length supported by a database can create problems. For example, with MySQL you'll get an exception trying to create the column, and with PostgreSQL the column name is truncated by the database (you may see a warning in the PostgreSQL logs).
id: Nama bidang yang tidak lebih panjang dari panjang nama kolom didukung oleh sebuah basisdata dapat membuat masalah. Sebagai contoh, dengan MySQL anda akan mendapatkan sebuah pengecualian mencoba membuat kolom, dan dengan PostgreSQL nama kolom dipotong oleh basisdata (anda mungkin melihat sebuah peringatan di catatan PostgreSQL).
zh_hans: 字段名长度超过数据库支持的列名长度可能会引发问题。例如，在 MySQL 中，尝试创建该列时会引发异常；在 PostgreSQL 中，数据库会截断列名（你可能会在 PostgreSQL 日志中看到警告）。

source: A model check has been introduced to better alert users to this scenario before the actual creation of database tables.
id: Sebuah pemeriksaan model telah diperkenalkan untuk memperingati lebih baik pengguna pada skenario ini sebelum pembuatan sebenarnya dari tabel-tabel basisdata.
zh_hans: 引入了模型检查，以在实际创建数据库表之前更好地提醒用户注意这种情况。

source: If you have an existing model where this check seems to be a false positive, for example on PostgreSQL where the name was already being truncated, simply use :attr:`~django.db.models.Field.db_column` to specify the name that's being used.
id: Jika anda mempunyai sebuah model yang ada dimana pemeriksaan ini kelihatan positif salah, sebagai contoh di PostgreSQL dimana nama sudah sedang dipotong, cukup menggunakan :attr:`~django.db.models.Field.db_column` untuk menentukan nama yang sedang digunakan.
zh_hans: 如果你有一个现有的模型，在其中这个检查似乎是一个错误的正检，例如在 PostgreSQL 上，其中名称已经被截断，只需使用 :attr:`~django.db.models.Field.db_column` 来指定正在使用的名称。

source: The check also applies to the columns generated in an implicit ``ManyToManyField.through`` model. If you run into an issue there, use :attr:`~django.db.models.ManyToManyField.through` to create an explicit model and then specify :attr:`~django.db.models.Field.db_column` on its column(s) as needed.
id: Pemeriksaan juga berlaku pada kolom dibangkitkan dalam sebuah model ``ManyToManyField.through`` yang tersirat. Jika anda berjalan kedalam sebuah masalah disana, gunakan :attr:`~django.db.models.ManyToManyField.through` untuk membuat sebuah model yang jelas dan kemudian tentukan :attr:`~django.db.models.Field.db_column` di kolomnya sesuai kebutuhan.
zh_hans: 这个检查也适用于隐式生成的 ``ManyToManyField.through`` 模型中的列。如果在那里遇到问题，可以使用 :attr:`~django.db.models.ManyToManyField.through` 创建一个显式模型，然后根据需要指定其列的 :attr:`~django.db.models.Field.db_column`。

source: Query relation lookups now check object types
id: Pencarian hubungan permintaan sekarang memeriksa jenis-jenis obyek
zh_hans: 现在查询关系查找会检查对象类型

source: Querying for model lookups now checks if the object passed is of correct type and raises a :exc:`ValueError` if not. Previously, Django didn't care if the object was of correct type; it just used the object's related field attribute (e.g. ``id``) for the lookup. Now, an error is raised to prevent incorrect lookups:
zh_hans: 现在，查询模型查找会检查传递的对象是否是正确的类型，如果不是，则引发 :exc:`ValueError`。以前，Django 不关心对象是否是正确的类型；它只是使用对象的相关字段属性（例如 ``id``）进行查找。现在，会引发错误以防止不正确的查找：

source: ``select_related()`` now checks given fields
id: ``select_related()`` sekarang memeriksa bidang yang diberikan
zh_hans: ``select_related()`` 现在会检查给定的字段。

source: ``select_related()`` now validates that the given fields actually exist. Previously, nonexistent fields were silently ignored. Now, an error is raised:
zh_hans: ``select_related()`` 现在会验证给定的字段是否实际存在。以前，不存在的字段会被默默忽略。现在会引发错误：

source: The validation also makes sure that the given field is relational:
zh_hans: 验证还确保给定字段是关系型的：

source: Default ``EmailField.max_length`` increased to 254
id: ``EmailField.max_length`` awal ditingkatkan menjadi 254
zh_hans: 默认的 ``EmailField.max_length`` 增加到了 254。

source: The old default 75 character ``max_length`` was not capable of storing all possible RFC3696/5321-compliant email addresses. In order to store all possible valid email addresses, the ``max_length`` has been increased to 254 characters. You will need to generate and apply database migrations for your affected models (or add ``max_length=75`` if you wish to keep the length on your current fields). A migration for :attr:`django.contrib.auth.models.User.email` is included.
id: Karakter 75 awalan lama ``max_length`` tidak dapat menyimpan semua kemungkinan alamat surel RFC3696/5321-compliant. Untuk menyimpan semua kemungkinan alamat surel sah, ``max_length`` telah ditingkatkan menjadi 254 karakter. Anda akan butuh membangkitkan dan memberlakukan perpindahan basisdata untuk model yang anda terpengaruh (atau tambah ``max_length=75`` jika anda berharap menjaga panjang di bidang-bidang anda saat ini). Sebuah perpindahan untuk :attr:`django.contrib.auth.models.User.email` disertakan.
zh_hans: 旧的默认值为 75 个字符的 ``max_length`` 无法存储所有可能符合 RFC3696/5321 标准的电子邮件地址。为了存储所有可能的有效电子邮件地址，``max_length`` 已增加到 254 个字符。您需要为受影响的模型生成并应用数据库迁移（或者如果希望保留当前字段的长度，则添加 ``max_length=75``）。一个用于 :attr:`django.contrib.auth.models.User.email` 的迁移已包含在内。

source: Support for PostgreSQL versions older than 9.0
id: Mendukung untuk PostgreSQL versi lebih lama dari 9.0
zh_hans: 对于早于 9.0 版本的 PostgreSQL 的支持

source: The end of upstream support periods was reached in July 2014 for PostgreSQL 8.4. As a consequence, Django 1.8 sets 9.0 as the minimum PostgreSQL version it officially supports.
id: Akhir dari masa dukungan hulu telah sampai di Juli 2014 untuk PostgreSQL 8.4. Sebagai konsekuensinya, Django 1.8 menyetel 9.0 sebagai versi PostgreSQL minimal dia secara resmi dukung.
zh_hans: PostgreSQL 8.4 的上游支持期限在 2014 年 7 月结束。因此，Django 1.8 将 9.0 版本设置为其正式支持的最低 PostgreSQL 版本。

source: This also includes dropping support for PostGIS 1.3 and 1.4 as these versions are not supported on versions of PostgreSQL later than 8.4.
id: Ini juga menyertakan penjatuhan dukungan untuk PostGIS 1.3 and 1.4 ketika versi ini tidak didukung pada versi PostgreSQL terakhir daripada 8.4.
zh_hans: 这还包括不再支持 PostGIS 1.3 和 1.4，因为这些版本在 8.4 之后的 PostgreSQL 版本上不受支持。

source: Django also now requires the use of Psycopg2 version 2.4.5 or higher (or 2.5+ if you want to use :mod:`django.contrib.postgres`).
id: Django juga sekarang membutuhkan menggunakan Psycopg2 versi 2.4.5 atau lebih tinggi (atau 2.5+ jika anda ingin menggunakan :mod:`django.contrib.postgres`).
zh_hans: Django 现在要求使用 Psycopg2 版本 2.4.5 或更高版本（如果要使用 :mod:`django.contrib.postgres`，则需要 2.5+）。

source: Support for MySQL versions older than 5.5
id: Mendukung untuk MySQL versi lebih lama dari 5.5
zh_hans: 对于早于 5.5 版本的 MySQL 的支持
