Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 1.3.4 release notes
id: Catatan terbitan Django 1.3.4
zh_hans: Django 1.3.4 版本发行说明

source: *October 17, 2012*
id: *Oktober 17, 2012*
zh_hans: *2012 年 10 月 17 日*

source: This is the fourth release in the Django 1.3 series.
id: Ini adalah terbitan ke empat di rangkaian Django 1.3.
zh_hans: 这是 Django 1.3 系列的第四个版本。

source: Host header poisoning
id: Peracunan kepala Host
zh_hans: Host 头部中毒

source: Some parts of Django -- independent of end-user-written applications -- make use of full URLs, including domain name, which are generated from the HTTP Host header. Some attacks against this are beyond Django's ability to control, and require the web server to be properly configured; Django's documentation has for some time contained notes advising users on such configuration.
id: Beberapa bagian dari Django -- berdiri sendiri dari aplikasi ditulis-pengguna-akhir -- menggunakan URL penuh, termasuk nama ranah, yang dibangkitkan dari kepala HTTP Host. Beberapa serangan terhadap ini adalah diluar kemampuan Django untuk mengendalikan, dan membutuhkan peladen jaringan untuk secara benar dikonfigurasikan; Dokumentasi Django mempunyai untuk terkadang mengandung catatan menganjurkan pengguna pada konfigurasi tersebut.
zh_hans: Django 的某些部分（与最终用户编写的应用程序无关）使用完整的 URL，包括从 HTTP Host 头生成的域名。针对此类问题的一些攻击超出了 Django 的控制能力，需要正确配置 Web 服务器； Django 的文档已经包含了一段时间的说明，建议用户进行此类配置。

source: Django's own built-in parsing of the Host header is, however, still vulnerable, as was reported to us recently. The Host header parsing in Django 1.3.3 and Django 1.4.1 -- specifically, ``django.http.HttpRequest.get_host()`` -- was incorrectly handling username/password information in the header. Thus, for example, the following Host header would be accepted by Django when running on ``validsite.com``:
zh_hans: 然而，Django 自身内置的 Host 标头解析仍然存在漏洞，最近有人向我们报告了这个问题。Django 1.3.3 和 Django 1.4.1 中的 Host 标头解析 -- 具体来说是 ``django.http.HttpRequest.get_host()`` -- 在处理标头中的用户名/密码信息时出现了错误。因此，例如，在运行在 ``validsite.com`` 上时，Django 会接受以下 Host 标头：

source: Using this, an attacker can cause parts of Django -- particularly the password-reset mechanism -- to generate and display arbitrary URLs to users.
id: Menggunakan ini, seorang penyerang dapat menyebabkan bagian dari Django -- terutama mekanisme setel kembali sandi -- untuk membangkitkan dan menampilkan URL berubah-ubah kepada pengguna.
zh_hans: 利用这一点，攻击者可以使 Django 的部分功能（尤其是密码重置机制）为用户生成并显示任意 URL 。

source: To remedy this, the parsing in ``HttpRequest.get_host()`` is being modified; Host headers which contain potentially dangerous content (such as username/password pairs) now raise the exception :exc:`django.core.exceptions.SuspiciousOperation`.
id: Untuk memperbaiki ini, mengurai di ``HttpRequest.get_host()`` sedang dirubah; kepala Host yang mengandung isi kemungkinan berbahaya (seperti pasangan nama pengguna/sandi) sekarang memunculkan pengecualian :exc:`django.core.exceptions.SuspiciousOperation`.
zh_hans: 为了解决这个问题，``HttpRequest.get_host()`` 中的解析正在被修改；包含潜在危险内容（如用户名/密码对）的 Host 标头现在会引发异常 :exc:`django.core.exceptions.SuspiciousOperation`。

source: Details of this issue were initially posted online as a `security advisory`_.
id: Rincian dari masalah secara inisial ditempatkan daring seperti `security advisory`_.
zh_hans: 关于这个问题的详细信息最初被发布在网上作为一份 `安全公告`_。

source: Django 1.3.5 release notes
id: Catatan terbitan Django 1.3.5
zh_hans: Django 1.3.5 版本发行说明

source: *December 10, 2012*
id: *Desember 10, 2012*
zh_hans: *2012 年 12 月 10 日*

source: Django 1.3.5 addresses two security issues present in previous Django releases in the 1.3 series.
id: Django 1.3.5 mengalamatkan dua masalah keamanan yang hadir di terbitan Django sebelumnya di rangkaian 1.3.
zh_hans: Django 1.3.5 解决了 1.3 系列中之前 Django 版本存在的两个安全问题。

source: Please be aware that this security release is slightly different from previous ones. Both issues addressed here have been dealt with in prior security updates to Django. In one case, we have received ongoing reports of problems, and in the other we've chosen to take further steps to tighten up Django's code in response to independent discovery of potential problems from multiple sources.
id: Harap disadari bahwa terbitan keamanan ini sedikit berbeda dari satu sebelumnya. Kedua masalah dialamatkan disini telah ditangani dengan sebelum perbaharuan keamanan pada Django. Di satu kasus, kami telah menerima laporan berjalan dari masalah-masalah, dan di lainnya kami telah memilih untuk mengambil langkah-langkah selanjutnya untuk mengencangkan kode Django dalam menjawab pada penemuan berdiri sendiri dari masalah potensial dari banyak sumber.
zh_hans: 请注意，这个安全发布与之前的发布略有不同。这里解决的两个问题都已在之前的 Django 安全更新中得到处理。在一个案例中，我们收到了持续的问题报告，另一个案例中，我们选择采取进一步措施来加强 Django 的代码，以应对来自多个来源的潜在问题的独立发现。

source: Several earlier Django security releases focused on the issue of poisoning the HTTP Host header, causing Django to generate URLs pointing to arbitrary, potentially-malicious domains.
id: Beberapa terbitan keamanan Django paling awal fokus pada masaalah peracunan kepala Host HTTP, menyebabkan Django membangkitkan URL menunjuk ke berubah-ubah, ranah berpotensi-jahat.
zh_hans: 早期的几个 Django 安全发布主要关注 HTTP Host 头部被污染的问题，这会导致 Django 生成指向任意、可能恶意的域名的 URL 。

source: In response to further input received and reports of continuing issues following the previous release, we're taking additional steps to tighten Host header validation. Rather than attempt to accommodate all features HTTP supports here, Django's Host header validation attempts to support a smaller, but far more common, subset:
id: Dalam tanggapan pada masukan lebih lanjut yang diterima dan melaporkan dari kelanjutan masalah-masalah mengikuti terbitan sebelumnya, kami mengambil langkah-langkah tambahan untuk memperketat pengecekan kepala Host. Daripada mencoba menampung semua fitur dukungan HTTP disini, pengecekan kepala Host Django berusaha mendukung terkecil, tetapi jauh lebih umum, bagian:
zh_hans: 为了回应收到的进一步意见以及在之前发布后持续出现的问题，我们正在采取额外措施来加强 Host 头部验证。与其试图适应 HTTP 支持的所有功能，Django 的 Host 头部验证试图支持一个更小但更常见的子集：

source: Hostnames must consist of characters ``[A-Za-z0-9]`` plus hyphen ('-') or dot ('.').
id: Nama rumah harus terdiri dari karakter ``[A-Za-z0-9]`` ditambah strip ('-') atau dot ('.').
zh_hans: 主机名必须由字符 ``[A-Za-z0-9]`` 加上连字符（'-'）或点号（'.'）组成。

source: IP addresses -- both IPv4 and IPv6 -- are permitted.
id: Alamat IP -- kedua IPv4 dan IPv6 -- diperbolehkan.
zh_hans: 允许使用 IP 地址 - 包括 IPv4 和 IPv6 。

source: Port, if specified, is numeric.
id: Pangkalan, jika ditentukan, adalah numerik.
zh_hans: 如果指定了端口，必须为数字。

source: Any deviation from this will now be rejected, raising the exception :exc:`django.core.exceptions.SuspiciousOperation`.
id: Penyimpangan apapun dari ini akan ditolak, memunculkan pengecualian :exc:`django.core.exceptions.SuspiciousOperation`.
zh_hans: 现在，任何与此不符的都将被拒绝，并引发异常 :exc:`django.core.exceptions.SuspiciousOperation`。

source: Redirect poisoning
id: Mengalihkan peracunan
zh_hans: 重定向投毒

source: Also following up on a previous issue: in July of this year, we made changes to Django's HTTP redirect classes, performing additional validation of the scheme of the URL to redirect to (since, both within Django's own supplied applications and many third-party applications, accepting a user-supplied redirect target is a common pattern).
id: Juga mengikuti pada masalah sebelumnya: di Juli tahun ini, kami membuat perubahan pada kelas-kelas pengalihan HTTP Django, melakukan tambahan pengesahan dari skema dari URL untuk mengalihkan ke (sejak, kedua dalam milik Django menyokong aplikasi dan banyak aplikasi pihak-ketiga, menerima sasaran pengalihan pasokan-pengguna adalah pola umum).
zh_hans: 同样是跟进之前的问题：今年 7 月，我们对 Django 的 HTTP 重定向类进行了修改，对要重定向到的 URL 的方案进行了额外验证（因为在 Django 自带的应用程序和许多第三方应用程序中，接受用户提供的重定向目标是一种常见的模式）。

source: Since then, two independent audits of the code turned up further potential problems. So, similar to the Host-header issue, we are taking steps to provide tighter validation in response to reported problems (primarily with third-party applications, but to a certain extent also within Django itself). This comes in two parts:
id: Sejak itu, dua pemeriksaan berdiri sendiri dari kode memunculkan masalah potensial lebih jauh. Jadi, mirip dengan masalah kepala_Rumah, kami mengambil langkah untuk menyediakan pengecekan ketat dalam tanggapan ke masalah (utamanya dengan aplikasi pihak-ketiga, tetapi pada tingkat tertentu juga dalam Django itu sendiri). Ini datang di dua bagian:
zh_hans: 从那时起，对代码进行的两次独立审计发现了更多潜在问题。因此，与 Host-header 问题类似，我们正在采取措施提供更严格的验证，以应对报告的问题（主要是与第三方应用程序相关，但在一定程度上也涉及 Django 本身）。这分为两部分：

source: 1. A new utility function, ``django.utils.http.is_safe_url``, is added; this function takes a URL and a hostname, and checks that the URL is either relative, or if absolute matches the supplied hostname. This function is intended for use whenever user-supplied redirect targets are accepted, to ensure that such redirects cannot lead to arbitrary third-party sites.
id: 1. fungsi kegunaan baru, ``django.utils.http.is_safe_url``, ditambahkan; fungsi ini mengambil URL dan nama simpan, dan memeriksa bahwa URL antara relatif, atau jika mutlak cocok dengan nama simpan disediakan. Fungsi ini dimaksudkan untuk digunakan ketika disediakan-pengguna mengalihkan sasaran diterima, untuk memastikan bahwa pengalihan itu tidak membawa ke situs pihak ketiga yang berubah-ubah.
zh_hans: 1. 新增了一个实用函数 ``django.utils.http.is_safe_url``；该函数接受一个 URL 和一个主机名，并检查该 URL 是否是相对路径，或者如果是绝对路径，是否与提供的主机名匹配。这个函数用于在接受用户提供的重定向目标时，以确保这样的重定向不能导致任意的第三方站点。

source: 2. All of Django's own built-in views -- primarily in the authentication system -- which allow user-supplied redirect targets now use ``is_safe_url`` to validate the supplied URL.
id: 2. Semua tampilan siap-pakai Django -- utamanya di sistem otentifikasi -- yang mengizinkan disediakan-pengguna mengalihkan sasaran sekarang menggunakan ``is_safe_url`` untuk mengecek URL disediakan.
zh_hans: 2. Django 的所有内置视图 -- 主要是在身份验证系统中 -- 允许用户提供重定向目标的视图现在都使用 ``is_safe_url`` 来验证提供的 URL。

source: Django 1.3.6 release notes
id: Catatan terbitan Django 1.3.6
zh_hans: Django 1.3.6 版本发行说明

source: *February 19, 2013*
zh_hans: *2013 年 2 月 19 日*

source: Django 1.3.6 fixes four security issues present in previous Django releases in the 1.3 series.
id: Django 1.3.6 memperbaiki empat masalah keamanan hadir di terbitan Django sebelumnya di rangkaian 1.3.
zh_hans: Django 1.3.6 修复了 1.3 系列中之前 Django 版本存在的四个安全问题。

source: This is the sixth bugfix/security release in the Django 1.3 series.
id: Ini adalah terbitan keamanan/perbaikan kesalahan keenam di rangkaian Django 1.3.
zh_hans: 这是 Django 1.3 系列中的第六个修复错误/安全性发布。

source: Some parts of Django -- independent of end-user-written applications -- make use of full URLs, including domain name, which are generated from the HTTP Host header. Django's documentation has for some time contained notes advising users on how to configure web servers to ensure that only valid Host headers can reach the Django application. However, it has been reported to us that even with the recommended web server configurations there are still techniques available for tricking many common web servers into supplying the application with an incorrect and possibly malicious Host header.
zh_hans: Django 的某些部分（与最终用户编写的应用程序无关）使用包含域名的完整 URL，这些 URL 是根据 HTTP Host 头生成的。 Django 的文档已经包含了一些关于如何配置 Web 服务器以确保只有有效的 Host 头才能到达 Django 应用程序的建议。然而，有人向我们报告称，即使采用了建议的 Web 服务器配置，仍然有一些方法可以欺骗许多常见的 Web 服务器，使它们向应用程序提供错误且可能恶意的 Host 头。

source: For this reason, Django 1.3.6 adds a new setting, ``ALLOWED_HOSTS``, which should contain an explicit list of valid host/domain names for this site. A request with a Host header not matching an entry in this list will raise ``SuspiciousOperation`` if ``request.get_host()`` is called. For full details see the documentation for the :setting:`ALLOWED_HOSTS` setting.
id: Untuk alasan ini, Django 1.3.6 menambahkan pengaturan baru, ``ALLOWED_HOSTS``,yang harus mengandung sebuah daftar eksplisit dari nama ranah/host sah untuk situs ini. Sebuah permintaan dengan kepala Host tidak mencocokkan sebuah masukan di daftar ini akan memunculkan ``SuspiciousOperation`` jika ``request.get_host()`` dipanggil. Untuk rincian penuh lihat dokumentasi untuk pengaturan :setting:`ALLOWED_HOSTS`.
zh_hans: 因此，Django 1.3.6 添加了一个新的设置，``ALLOWED_HOSTS``，它应包含站点的有效主机/域名的显式列表。如果调用 ``request.get_host()`` 的请求的 Host 标头与此列表中的条目不匹配，将引发 ``SuspiciousOperation``。有关 :setting:`ALLOWED_HOSTS` 设置的详细信息，请参阅文档。

source: The default value for this setting in Django 1.3.6 is ``['*']`` (matching any host), for backwards-compatibility, but we strongly encourage all sites to set a more restrictive value.
id: Nilai awalan untuk pengaturan ini di Django 1.3.6 adalah ``['*']`` (mencocokkan tiap host), untuk kesesuaian-kebelakang, tetapi kami sangat menganjurkan semua situs untuk mensetel nilai lebih terbatas.
zh_hans: 在 Django 1.3.6 中，这个设置的默认值是 ``['*']`` （匹配任何主机），出于向后兼容性考虑，但我们强烈建议所有站点设置一个更加限制的值。

source: This host validation is disabled when ``DEBUG`` is ``True`` or when running tests.
id: Pengesahan host ditiadakan ketika ``DEBUG`` adalah ``True`` atau ketika menjalankan percobaan.
zh_hans: 当 ``DEBUG`` 为 ``True`` 时或在运行测试时，主机验证会被禁用。

source: XML deserialization
id: Deserialisasi XML
zh_hans: XML 反序列化

source: The XML parser in the Python standard library is vulnerable to a number of attacks via external entities and entity expansion. Django uses this parser for deserializing XML-formatted database fixtures. The fixture deserializer is not intended for use with untrusted data, but in order to err on the side of safety in Django 1.3.6 the XML deserializer refuses to parse an XML document with a DTD (DOCTYPE definition), which closes off these attack avenues.
id: Pengurai XML di pustaka standar Python rentan pada sejumlah serangan melalui entitas luar dan perpanjangan entitas. Django menggunakan pengurai ini untuk deserialisasi perlengkapan basisdata berbentuk-XML. Perlengkapan pendeserialisasi ini tidak dimaksudkan untuk digunakan dengan data tidak dipercaya, tetapi untuk kesalahan pada sisi dari keamanan di Django 1.3.6 pendeserialisasi XML menolak untuk mengurai sebuah dokumen XML dengan DTD (pengertian DOCTYPE), yang menutup jalan serangan ini.
zh_hans: Python 标准库中的 XML 解析器容易受到外部实体和实体扩展攻击。 Django 使用此解析器对 XML 格式的数据库固件进行反序列化。固件反序列化器并非用于处理不受信任的数据，但为了在 Django 1.3.6 中确保安全，XML 反序列化器拒绝解析带有 DTD（DOCTYPE 定义）的 XML 文档，从而关闭了这些攻击途径。

source: These issues in the Python standard library are CVE-2013-1664 and CVE-2013-1665. More information available `from the Python security team`_.
id: Masalah-masalah ini di pustaka standar Python adalah CVE-2013-1664 and CVE-2013-1665. Informasi lebih tersedia `from the Python security team`_.
zh_hans: Python 标准库中的这些问题是 CVE-2013-1664 和 CVE-2013-1665。可以从 `Python 安全团队`_ 获取更多信息。

source: Django's XML serializer does not create documents with a DTD, so this should not cause any issues with the typical round-trip from ``dumpdata`` to ``loaddata``, but if you feed your own XML documents to the ``loaddata`` management command, you will need to ensure they do not contain a DTD.
id: Penserial XML Django tidak membuat dokumen dengan DTD, jadi ini tidak menyebabkan masalah apapun dengan berjenis pulang-pergi dari ``dumpdata`` ke ``loaddata``, tetapi jika anda mengumpan dokumen anda sendiri ke perintah pengelolaan ``loaddata``, anda akan butuh memastikan mereka tidak mengandung sebuah DTD.
zh_hans: Django 的 XML 序列化器不会创建带有 DTD 的文档，因此这不应该导致从 ``dumpdata`` 到 ``loaddata`` 的典型往返出现任何问题。但是，如果您向 ``loaddata`` 管理命令提供自己的 XML 文档，您需要确保它们不包含 DTD。

source: Formset memory exhaustion
id: Kelelahan memori formset
zh_hans: 表单集内存耗尽

source: Previous versions of Django did not validate or limit the form-count data provided by the client in a formset's management form, making it possible to exhaust a server's available memory by forcing it to create very large numbers of forms.
id: Versi sebelumnya dari Django tidak mensahkan atau membatasi data jumlah-formulir disediakan oleh klien di formulir pengelolaan formset, membuatnya memungkinkan untuk menguras memory tersedia peladen dengan memaksanya membuat sejumlah sangat besar dari formulir.
zh_hans: 以前的 Django 版本没有验证或限制表单集管理表单中由客户端提供的表单计数数据，这使得通过强制创建大量表单来耗尽服务器可用内存成为可能。

source: In Django 1.3.6, all formsets have a strictly-enforced maximum number of forms (1000 by default, though it can be set higher via the ``max_num`` formset factory argument).
id: Di Django 1.3.6, semua formset mempunyai angka maksimal dipaksakan-ketat dari formulir (1000 oleh awalan, meskipun itu dapat disetel lebih tinggi melalui argumen pabrik formset ``max_num``).
zh_hans: 在 Django 1.3.6 中，所有的表单集都有一个严格执行的最大表单数量限制（默认为 1000，但可以通过表单集工厂参数 ``max_num`` 设置得更高）。

source: Admin history view information leakage
id: Riwayat admin menampilkan kebocoran informasi
zh_hans: 管理员历史视图信息泄露

source: In previous versions of Django, an admin user without change permission on a model could still view the Unicode representation of instances via their admin history log. Django 1.3.6 now limits the admin history log view for an object to users with change permission for that model.
zh_hans: 在以前的 Django 版本中，一个没有模型更改权限的管理员用户仍然可以通过其管理员历史日志查看实例的 Unicode 表示。 Django 1.3.6 现在将对象的管理员历史日志视图限制为具有该模型更改权限的用户。

source: Django 1.3.7 release notes
id: Catatan terbitan Django 1.3.7
zh_hans: Django 1.3.7 版本发行说明

source: *February 20, 2013*
id: *Februari 20, 2013*
zh_hans: *2013 年 2 月 20 日*

source: Django 1.3.7 corrects a packaging problem with yesterday's :doc:`1.3.6 release </releases/1.3.6>`.
id: Django 1.3.7 memperbaiki masalah pemaketan dengan :doc:`1.3.6 release </releases/1.3.6>` kemarin.
zh_hans: Django 1.3.7 修复了昨天发布的 :doc:`1.3.6 版本 </releases/1.3.6>` 中的打包问题。

source: The release contained stray ``.pyc`` files that caused "bad magic number" errors when running with some versions of Python. This releases corrects this, and also fixes a bad documentation link in the project template ``settings.py`` file generated by ``manage.py startproject``.
id: Terbitan mengandung berkas ``.pyc`` menyimpang yang disebabkan kesalahan "angka ajaib buruk" ketika berjalan dengan beberapa versi dari Python. Terbitan ini memperbaiki ini, dan juga memperbaiki tautan dokumentasi buruk di cetakan proyek berkas ``settings.py`` dibangkitkan oleh ``manage.py startproject``.
zh_hans: 该版本包含了零散的 ``.pyc`` 文件，在某些版本的 Python 中运行时会导致 "bad magic number" 错误。这个版本修复了这个问题，并且还修复了由 ``manage.py startproject`` 生成的项目模板 ``settings.py`` 文件中的错误文档链接。

source: Django 1.4 release notes
id: Catatan terbitan Django 1.4
zh_hans: Django 1.4 版本发行说明

source: *March 23, 2012*
id: *23 Maret 2012*
zh_hans: *2012 年 3 月 23 日*

source: Welcome to Django 1.4!
id: Selamat datang di Django 1.4!
zh_hans: 欢迎来到 Django 1.4 版本！

source: These release notes cover the :ref:`new features <whats-new-1.4>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.4>` you'll want to be aware of when upgrading from Django 1.3 or older versions. We've also dropped some features, which are detailed in :ref:`our deprecation plan <deprecation-removed-in-1.4>`, and we've :ref:`begun the deprecation process for some features <deprecated-features-1.4>`.
id: Catatan terbitan ini mencangkup :ref:`new features <whats-new-1.4>`, dan juga beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.4>` anda akan ingin disadari ketika meningkatkan dari Django 1.3 atau versi terlama. Kami telah juga membuang beberapa fitur, yang rinciannya di :ref:`our deprecation plan <deprecation-removed-in-1.4>`, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.4>`.
zh_hans: 这些发布说明涵盖了 :ref:`新特性 <whats-new-1.4>`，以及从 Django 1.3 或更早版本升级时需要注意的一些 :ref:`不向后兼容的变更 <backwards-incompatible-1.4>`。我们还放弃了一些功能，详细信息在 :ref:`我们的弃用计划 <deprecation-removed-in-1.4>` 中说明，并且我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-1.4>`。

source: The biggest new feature in Django 1.4 is `support for time zones`_ when handling date/times. When enabled, this Django will store date/times in UTC, use timezone-aware objects internally, and translate them to users' local timezones for display.
id: Fitur baru terbesar di Django 1.4 adalah `support for time zones`_ ketika menangani tanggal/waktu. Ketika mengadakan, Django ini akan menyimpan tanggal/waktu dalam UTC, gunakan obyek sadar-zona waktu secara internal, dan rubah mereka menjadi zona waktu lokal pengguna untuk ditampilkan.
zh_hans: Django 1.4 中最重要的新特性是在处理日期/时间时提供了对时区的支持。当启用时，Django 将在 UTC 中存储日期/时间，内部使用时区感知的对象，并将它们翻译为用户的本地时区以供显示。

source: If you're upgrading an existing project to Django 1.4, switching to the timezone aware mode may take some care: the new mode disallows some rather sloppy behavior that used to be accepted. We encourage anyone who's upgrading to check out the :ref:`timezone migration guide <time-zones-migration-guide>` and the :ref:`timezone FAQ <time-zones-faq>` for useful pointers.
id: Jika anda sedang meningkatkan sebuah proyek pada Django 1.4, mengganti ke suasana sadar zona waktu mungkin mengambil beberapa perawatan: suasana baru tidak mengizinkan beberapa daripada perilaku ceroboh yang biasanya diterima. Kami mendorong siapapun yang meningkatkan untuk memeriksa :ref:`timezone migration guide <time-zones-migration-guide>` dan :ref:`timezone FAQ <time-zones-faq>` untuk petunjuk berguna.
zh_hans: 如果您正在将现有项目升级到 Django 1.4，切换到时区感知模式可能需要一些注意：新模式不允许以前被接受的一些相当松散的行为。我们鼓励任何升级的用户查看 :ref:`时区迁移指南 <time-zones-migration-guide>` 和 :ref:`时区常见问题解答 <time-zones-faq>`，以获取有用的提示。

source: Other notable new features in Django 1.4 include:
id: Fitur baru penting lainnya di Django 1.4 termasuk:
zh_hans: Django 1.4 中其他值得关注的新功能包括：

source: A number of ORM improvements, including `SELECT FOR UPDATE support`_, the ability to `bulk insert <#model-objects-bulk-create-in-the-orm>`_ large datasets for improved performance, and `QuerySet.prefetch_related`_, a method to batch-load related objects in areas where :meth:`~django.db.models.query.QuerySet.select_related` doesn't work.
id: Sejumlah perbaikan ORM, termasuk `SELECT FOR UPDATE support`_, kemampuan untuk `bulk insert <#model-objects-bulk-create-in-the-orm>`_ dataset besar untuk memperbaiki penampilan, dan `QuerySet.prefetch_related`_, sebuah metode untuk memuat-kumpulan terkait obyek di kawasan dimana :meth:`~django.db.models.query.QuerySet.select_related` tidak bekerja.
zh_hans: ORM 改进方面有很多改进，包括 `SELECT FOR UPDATE 支持`_，能够以 `bulk insert`_ 的方式插入大型数据集以提高性能，以及 `QuerySet.prefetch_related`_，这是一种在 :meth:`~django.db.models.query.QuerySet.select_related` 不适用的情况下批量加载相关对象的方法。

source: Some nice security additions, including `improved password hashing`_ (featuring PBKDF2_ and bcrypt_ support), new `tools for cryptographic signing`_, several `CSRF improvements`_, and `simple clickjacking protection`_.
id: Beberapa tambahan keamanan baik, termasuk `improved password hashing`_ (dukungan sifat PBKDF2_ dan bcrypt_), 'tools for cryptographic signing`_ baru, beberapa `CSRF improvements`_, dan `simple clickjacking protection`_.
zh_hans: 一些不错的安全性增强功能，包括 `改进的密码哈希算法`_ （支持 PBKDF2_ 和 bcrypt_），新的 `加密签名工具`_，几个 `CSRF 改进`_，以及 `简单的点击劫持保护`_。

source: An `updated default project layout and manage.py`_ that removes the "magic" from prior versions. And for those who don't like the new layout, you can use `custom project and app templates`_ instead!
id: Sebuah `updated default project layout and manage.py`_ yang memindahkan "magic" dari versi sebelumnya. Dan untuk siapa yang tidak suka tata letak baru, anda dapat menggunakan `custom project and app templates`_ sebagai gantinya!
zh_hans: `更新的默认项目布局和 manage.py`_ ，去除了以前版本中的"魔法"。对于那些不喜欢新布局的人，可以使用 `自定义项目和应用模板`_。

source: `Support for in-browser testing frameworks`_ (like Selenium_).
id: `Support for in-browser testing frameworks`_ (seperti Selenium_).
zh_hans: `对于浏览器内测试框架的支持`_ （如 Selenium_）。
