Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ... and a whole lot more; `see below <#what-s-new-in-django-1-4>`_!
id: ... dan banyak lagi; `see below <#what-s-new-in-django-1-4>`_!
zh_hans: ... 还有很多内容；`查看下文 <#what-s-new-in-django-1-4>`_！

source: Wherever possible we try to introduce new features in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>` policy. However, as with previous releases, Django 1.4 ships with some minor :ref:`backwards incompatible changes <backwards-incompatible-1.4>`; people upgrading from previous versions of Django should read that list carefully.
id: Dimanapun memungkinkan kami mencoba memperkenalkan fitur baru di sikap bertentangan kebelakang per kebijakan :doc:`our API stability policy </misc/api-stability>`. Bagaimanapun, seperti dengan terbitan sebelumnya, Django 1.4 dibekali dengan beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.4>` kecil; orang meningkatkan dari versi sebelumnya dari Django harus membaca daftar itu hati-hati.
zh_hans: 在尽可能的情况下，我们尝试以符合 :doc:`我们的 API 稳定性政策 </misc/api-stability>` 的方式引入新功能。然而，与以前的版本一样，Django 1.4 也带有一些轻微的 :ref:`不兼容变更 <backwards-incompatible-1.4>`；从以前版本的 Django 升级的用户应该仔细阅读该列表。

source: Django 1.4 has dropped support for Python 2.4. Python 2.5 is now the minimum required Python version. Django is tested and supported on Python 2.5, 2.6 and 2.7.
id: Django 1.4 telah membuang dukungan untuk Python 2.4. Python 2.5 sekarang vesi Python minimal yang diwajibkan. Django dicobakan dan didukung pada Python 2.5, 2.6 and 2.7.
zh_hans: Django 1.4 已放弃对 Python 2.4 的支持。现在要求的最低 Python 版本为 2.5 。 Django 在 Python 2.5 、 2.6 和 2.7 上经过测试并得到支持。

source: This change should affect only a small number of Django users, as most operating-system vendors today are shipping Python 2.5 or newer as their default version. If you're still using Python 2.4, however, you'll need to stick to Django 1.3 until you can upgrade. Per :doc:`our support policy </internals/release-process>`, Django 1.3 will continue to receive security support until the release of Django 1.5.
id: Perubahan ini seharusnya berakibat hanya angka kecil dari pengguna Django, seperti kebanyakan penjaja sistem operasi hari ini yang membekali Phyton 2.5 atau memperbaharui versi awal mereka. Jika anda masih menggunakan Python 2.4, bagaimanapun, anda akan butuh melekat ke Django 1.3 sampai anda dapat meningkatkan; per :doc:`kebijakan dukungan kami </internals/release-process>`, Django 1.3 akan lanjut menerima dukungan keamanan sampai terbitan dari Django 1.5.
zh_hans: 这个变更应该只会影响到少数 Django 用户，因为大多数操作系统厂商今天都默认安装 Python 2.5 或更新版本。然而，如果你仍然在使用 Python 2.4，你将需要继续使用 Django 1.3，直到你可以升级。根据 :doc:`我们的支持政策 </internals/release-process>`，Django 1.3 将在 Django 1.5 发布之前继续获得安全支持。

source: Django does not support Python 3.x at this time. At some point before the release of Django 1.4, we plan to publish a document outlining our full timeline for deprecating Python 2.x and moving to Python 3.x.
id: Django tidak mendukung Python 3.x pada saat ini. Pada beberapa titik sebelum terbitan Django 1.4, kami berencana menerbitkan sebuah uraian dokumen linimasa penuh kami untuk pengusangan Python 2.x dan pindah ke Python 3.x.
zh_hans: 目前 Django 不支持 Python 3.x 。在 Django 1.4 发布之前的某个时刻，我们计划发布一份文件，概述我们废弃 Python 2.x 并转向 Python 3.x 的完整时间表。

source: What's new in Django 1.4
id: Apa yang baru di Django 1.4
zh_hans: Django 1.4 新特性

source: Support for time zones
id: Mendukung untuk zona waktu
zh_hans: 时区支持

source: In previous versions, Django used "naive" date/times (that is, date/times without an associated time zone), leaving it up to each developer to interpret what a given date/time "really means". This can cause all sorts of subtle timezone-related bugs.
id: Di versi sebelumnya, Django menggunakan tanggal/waktu "tidak dibuat-buat" (yaitu, tanggal/waktu tanpa zona waktu terkait), meninggalkannya ke setiap pengembang untuk mengartikan apa tanggal/waktu yang diberikan "benar-benar berarti". Ini dapat menyebabkan semua urutan halus dari kesalahan terkait-zona waktu.
zh_hans: 在以前的版本中，Django 使用了“天真”的日期/时间（也就是没有关联时区的日期/时间），让每个开发者来解释给定的日期/时间“真正的含义”。这可能导致各种微妙的时区相关错误。

source: In Django 1.4, you can now switch Django into a more correct, time-zone aware mode. In this mode, Django stores date and time information in UTC in the database, uses time-zone-aware datetime objects internally and translates them to the end user's time zone in templates and forms. Reasons for using this feature include:
id: Di Django 1.4, anda sekarang dapat mengganti Django menjadi lebih tepat, suasana sadar zona-waktu. Di suasana ini, Django menyimpan informasi tanggal dan waktu di UTC di basisdata, menggunakan obyek datetime waspada-zona-waktu secara internal dan menterjemahkan mereka ke zona waktu pengguna akhir di cetakan dan formulir. Alasan untuk menggunakan fitur ini termasuk:
zh_hans: 在 Django 1.4 中，您现在可以将 Django 切换到更正确的、具有时区感知的模式。在此模式下，Django 将日期和时间信息以 UTC 格式存储在数据库中，内部使用具有时区感知的 datetime 对象，并在模板和表单中将它们转换为最终用户的时区。使用此功能的原因包括：

source: Customizing date and time display for users around the world.
id: Menyesuaikan tampilan tanggal dan waktu untuk pengguna disekeliling dunia.
zh_hans: 为世界各地的用户自定义日期和时间显示。

source: Storing datetimes in UTC for database portability and interoperability. (This argument doesn't apply to PostgreSQL, because it already stores timestamps with time zone information in Django 1.3.)
id: Menyimpan datetime di UTC untuk basisdata mudah dibawa dan dapat dioperasikan. (Argumen ini tidak berlaku pada PostgreSQL, karena itu sudah menyimpan timestamp dengan informasi zona waktu di Django 1.3.)
zh_hans: 以 UTC 格式存储日期时间以实现数据库的可移植性和互操作性。（这个论点不适用于 PostgreSQL，因为在 Django 1.3 中，它已经存储了带有时区信息的时间戳。）

source: Avoiding data corruption problems around DST transitions.
id: Menghindari masalah kerusakan data sekitar perpindahan DST.
zh_hans: 避免在夏令时转换期间出现数据损坏问题。

source: Time zone support is enabled by default in new projects created with :djadmin:`startproject`. If you want to use this feature in an existing project, read the :ref:`migration guide <time-zones-migration-guide>`. If you encounter problems, there's a helpful :ref:`FAQ <time-zones-faq>`.
id: Dukungan zona waktu diadakan secara awalan di proyek baru dibuat dengan :djadmin:`startproject`. Jika anda ingin menggunakan fitur ini di proyek yang sudah ada, baca :ref:`migration guide <time-zones-migration-guide>`. Jika anda mengalami masalah, ada bantuan :ref:`FAQ <time-zones-faq>`.
zh_hans: 在使用 :djadmin:`startproject` 创建的新项目中，默认启用了时区支持。如果你想在现有项目中使用这个功能，请阅读 :ref:`迁移指南 <time-zones-migration-guide>`。如果遇到问题，可以参考有用的 :ref:`常见问题解答 <time-zones-faq>`。

source: Support for in-browser testing frameworks
id: Mendukung untuk kerangka percobaan di-peramban
zh_hans: 支持基于浏览器的测试框架

source: Django 1.4 supports integration with in-browser testing frameworks like Selenium_. The new :class:`django.test.LiveServerTestCase` base class lets you test the interactions between your site's front and back ends more comprehensively. See the :class:`documentation<django.test.LiveServerTestCase>` for more details and concrete examples.
id: Django 1.4 mendukung perpaduan dengan kerangka percobaan di-peramban seperti Selenium_. Kelas dasar :class:`django.test.LiveServerTestCase` baru membiarkan anda mencoba interaksi diantara depan dan belakang situs anda lebih komprehensif. Lihat :class:`documentation<django.test.LiveServerTestCase>` untuk lebih contoh rinci dan nyata.
zh_hans: Django 1.4 支持与浏览器测试框架（如 Selenium_）的集成。新的 :class:`django.test.LiveServerTestCase` 基类允许你更全面地测试你的网站前端和后端之间的交互。有关更多详细信息和具体示例，请参阅 :class:`文档 <django.test.LiveServerTestCase>`。

source: Updated default project layout and ``manage.py``
id: Perbaharui tata letak proyek awal dan ``manage.py``
zh_hans: 更新了默认项目布局和 ``manage.py``。

source: Django 1.4 ships with an updated default project layout and ``manage.py`` file for the :djadmin:`startproject` management command. These fix some issues with the previous ``manage.py`` handling of Python import paths that caused double imports, trouble moving from development to deployment, and other difficult-to-debug path issues.
id: Django 1.4 dibekali dengan tata letak proyek awalan terperbaharui dan berkas ``manage.py`` untuk perintah pengelolaan :djadmin:`startproject`. Ini memperbaiki beberapa masalah dengan ``manage.py`` sebelumnya menangani dari jalur Python impor yang menyebabkan impor ganda, masalah memindahkan dari pengembangan ke penyebaran, dan masalah jalur sulit-dicari-kesalahan lainnya.
zh_hans: Django 1.4 附带了一个更新后的默认项目布局和 :djadmin:`startproject` 管理命令的 ``manage.py`` 文件。这些修复了之前的 ``manage.py`` 处理 Python 导入路径的一些问题，导致了重复导入、从开发环境切换到部署环境的困难以及其他难以调试的路径问题。

source: The previous ``manage.py`` called functions that are now deprecated, and thus projects upgrading to Django 1.4 should update their ``manage.py``. (The old-style ``manage.py`` will continue to work as before until Django 1.6. In 1.5 it will raise ``DeprecationWarning``).
id: ``manage.py`` sebelumnya memanggil fungsi yang sekarang diusangkan, dan dengan demikian peningkatan proyek ke Django 1.4 harus memperbaharui ``manage.py`` mereka. (Gaya lama ``manage.py`` akan berlanjut kerja sebagai sebelum sampai Django 1.6. Di 1.5 itu akan memunculkan ``DeprecationWarning``).
zh_hans: 之前的 ``manage.py`` 调用了现在已弃用的函数，因此升级到 Django 1.4 的项目应该更新他们的 ``manage.py``。（旧式的 ``manage.py`` 将在 Django 1.6 之前继续像以前一样工作。在 1.5 中，它将引发 ``DeprecationWarning``）。

source: The new recommended ``manage.py`` file should look like this::
id: Berkas ``manage.py`` yang baru dianjurkan harus seperti ini::
zh_hans: 推荐使用的新 ``manage.py`` 文件应该如下所示：

source: ``{{ project_name }}`` should be replaced with the Python package name of the actual project.
id: ``{{ project_name }}`` harus diganti dengan nama paket Python dari proyek sebenarnya.
zh_hans: ``{{ project_name }}`` 应该替换为实际项目的 Python 包名称。

source: If settings, URLconfs and apps within the project are imported or referenced using the project name prefix (e.g. ``myproject.settings``, ``ROOT_URLCONF = "myproject.urls"``, etc.), the new ``manage.py`` will need to be moved one directory up, so it is outside the project package rather than adjacent to ``settings.py`` and ``urls.py``.
id: Jika pengaturan, URLconfs dan aplikasi dalam proyek diimpor atau diacukan menggunakan awalan nama proyek (sebagai contoh ``myproject.settings``, ``ROOT_URLCONF = "myproject.urls"``, dll.), ``manage.py`` baru akan butuh dipindahkan satu direktori keatas, jadi itu diluar paket proyek daripada berdekatan pada ``settings.py`` dan ``urls.py``.
zh_hans: 如果项目中导入或引用了设置、URL 配置和应用程序时使用项目名称前缀（例如 ``myproject.settings``，``ROOT_URLCONF = "myproject.urls"`` 等），新的 ``manage.py`` 需要移动到上一级目录，以便它位于项目包之外，而不是与 ``settings.py`` 和 ``urls.py`` 并列。

source: For instance, with the following layout:
zh_hans: 例如，以下布局：

source: You could import ``mysite.settings``, ``mysite.urls``, and ``mysite.myapp``, but not ``settings``, ``urls``, or ``myapp`` as top-level modules.
id: Anda dapat mengimpor ``mysite.settings``, ``mysite.urls``, dan ``mysite.myapp``, tetapi tidak ``settings``, ``urls``, atau ``myapp`` sebagai modul tingkat-atas.
zh_hans: 你可以导入 ``mysite.settings``、``mysite.urls`` 和 ``mysite.myapp``，但不能导入 ``settings``、``urls`` 或 ``myapp`` 作为顶级模块。

source: Anything imported as a top-level module can be placed adjacent to the new ``manage.py``. For instance, to decouple ``myapp`` from the project module and import it as just ``myapp``, place it outside the ``mysite/`` directory:
zh_hans: 作为顶级模块导入的任何内容都可以放在新的 ``manage.py`` 旁边。例如，要将 ``myapp`` 与项目模块解耦并将其导入为 ``myapp``，请将其放在 ``mysite/`` 目录之外：

source: If the same code is imported inconsistently (some places with the project prefix, some places without it), the imports will need to be cleaned up when switching to the new ``manage.py``.
id: Jika kode sama diimpor tidak tetap (beberapa tempat dengan awalan proyek, beberapa tempat tanpanya). impor akan butuh dibersihkan ketika mengganti ke ``manage.py`` baru.
zh_hans: 如果相同的代码在不一致的地方导入（有些地方使用项目前缀，有些地方不使用），在切换到新的 ``manage.py`` 时需要清理导入语句。

source: Custom project and app templates
id: Proyek penyesuaian dan cetakan aplikasi
zh_hans: 自定义项目和应用模板

source: The :djadmin:`startapp` and :djadmin:`startproject` management commands now have a ``--template`` option for specifying a path or URL to a custom app or project template.
id: Perintah pengelolaan :djadmin:`startapp` dan :djadmin:`startproject` sekarang mempunyai sebuah pilihan ``--template`` untuk menentukan sebuah jalur atau URL ke aplikasi penyesuaian atau cetakan proyek.
zh_hans: 现在，:djadmin:`startapp` 和 :djadmin:`startproject` 管理命令都有一个 ``--template`` 选项，用于指定自定义应用程序或项目模板的路径或 URL。

source: For example, Django will use the ``/path/to/my_project_template`` directory when you run the following command:
zh_hans: 例如，当你运行以下命令时，Django 将使用 ``/path/to/my_project_template`` 目录：

source: You can also now provide a destination directory as the second argument to both :djadmin:`startapp` and :djadmin:`startproject`:
zh_hans: 现在，你也可以将目标目录作为 :djadmin:`startapp` 和 :djadmin:`startproject` 的第二个参数提供：

source: For more information, see the :djadmin:`startapp` and :djadmin:`startproject` documentation.
id: Untuk informasi lebih, lihat dokumentasi :djadmin:`startapp` dan :djadmin:`startproject`.
zh_hans: 有关更多信息，请参阅 :djadmin:`startapp` 和 :djadmin:`startproject` 的文档。

source: Improved WSGI support
id: Ditingkatkan dukungan WSGI
zh_hans: 改进的 WSGI 支持

source: The :djadmin:`startproject` management command now adds a :file:`wsgi.py` module to the initial project layout, containing a simple WSGI application that can be used for :doc:`deploying with WSGI app servers</howto/deployment/wsgi/index>`.
id: Perintah pengelolaan :djadmin:`startproject` sekarang menambahkan sebuah modul :file:`wsgi.py` pada inisial tata letak proyek, mengandung aplikasi WSGI sederhana yang dapat digunakan untuk :doc:`deploying with WSGI app servers</howto/deployment/wsgi/index>`.
zh_hans: :djadmin:`startproject` 管理命令现在会在初始项目布局中添加一个 :file:`wsgi.py` 模块，其中包含一个简单的 WSGI 应用程序，可以用于 :doc:`使用 WSGI 应用服务器部署 </howto/deployment/wsgi/index>`。

source: The :djadmin:`built-in development server<runserver>` now supports using an externally-defined WSGI callable, which makes it possible to run ``runserver`` with the same WSGI configuration that is used for deployment. The new :setting:`WSGI_APPLICATION` setting lets you configure which WSGI callable :djadmin:`runserver` uses.
zh_hans: 内置的开发服务器 :djadmin:`runserver` 现在支持使用外部定义的 WSGI 可调用函数，这使得可以使用与部署相同的 WSGI 配置来运行 ``runserver``。新的 :setting:`WSGI_APPLICATION` 设置允许你配置 :djadmin:`runserver` 使用哪个 WSGI 可调用函数。

source: (The ``runfcgi`` management command also internally wraps the WSGI callable configured via :setting:`WSGI_APPLICATION`.)
id: (Perintah pengelolaan ``runfcgi`` juga secara internal membungkus dapat dipanggil WSGI dikonfigurasikan melalui :setting:`WSGI_APPLICATION`.)
zh_hans: （``runfcgi`` 管理命令也会在内部包装通过 :setting:`WSGI_APPLICATION` 配置的 WSGI 可调用函数。）

source: ``SELECT FOR UPDATE`` support
id: Mendukung ``SELECT FOR UPDATE``
zh_hans: ``SELECT FOR UPDATE`` 支持

source: Django 1.4 includes a :meth:`QuerySet.select_for_update() <django.db.models.query.QuerySet.select_for_update>` method, which generates a ``SELECT ... FOR UPDATE`` SQL query. This will lock rows until the end of the transaction, meaning other transactions cannot modify or delete rows matched by a ``FOR UPDATE`` query.
id: Django 1.4 menyertakan metode :meth:`QuerySet.select_for_update() <django.db.models.query.QuerySet.select_for_update>`, yang membangkitkan sebuah permintaan SQL ``SELECT ... FOR UPDATE``. Ini akan mengunci baris sampai akhir dari transaksi, yang berarti transaksi lain tidak dapat merubah atau menghapus baris yang cocok oleh sebuah permintaan ``FOR UPDATE``.
zh_hans: Django 1.4 包含了一个 :meth:`QuerySet.select_for_update() <django.db.models.query.QuerySet.select_for_update>` 方法，它生成一个 ``SELECT ... FOR UPDATE`` SQL 查询。这将锁定行，直到事务结束，这意味着其他事务无法修改或删除与 ``FOR UPDATE`` 查询匹配的行。

source: For more details, see the documentation for :meth:`~django.db.models.query.QuerySet.select_for_update`.
id: Untuk lebih rinci, lihat dokumentasi untuk :meth:`~django.db.models.query.QuerySet.select_for_update`.
zh_hans: 有关更多详细信息，请参阅 :meth:`~django.db.models.query.QuerySet.select_for_update` 的文档。

source: ``Model.objects.bulk_create`` in the ORM
id: ``Model.objects.bulk_create`` di ORM
zh_hans: ORM 中的 ``Model.objects.bulk_create``

source: This method lets you create multiple objects more efficiently. It can result in significant performance increases if you have many objects.
id: Metode ini membiarkan anda membuat banyak obyek lebih efisien. Itu dapat menghasilkan penampilan yang signifikan meningkat jika anda mempunyai banyak obyek.
zh_hans: 这种方法让您能够更高效地创建多个对象。如果您有很多对象，这可能会带来显著的性能提升。

source: Django makes use of this internally, meaning some operations (such as database setup for test suites) have seen a performance benefit as a result.
id: Django membuat penggunaan dari internal ini, berarti beberapa tindakan (seperti pengaturan basisdata untuk deretan percobaan) telah melihat keuntungan penampilan sebagai sebuah hasil.
zh_hans: Django 在内部使用了这种方法，这意味着某些操作（如测试套件的数据库设置）因此也获得了性能提升。

source: See the :meth:`~django.db.models.query.QuerySet.bulk_create` docs for more information.
id: Lihat dokumentasi :meth:`~django.db.models.query.QuerySet.bulk_create` untuk informasi lebih.
zh_hans: 请查看 :meth:`~django.db.models.query.QuerySet.bulk_create` 文档以获取更多信息。

source: Similar to :meth:`~django.db.models.query.QuerySet.select_related` but with a different strategy and broader scope, :meth:`~django.db.models.query.QuerySet.prefetch_related` has been added to :class:`~django.db.models.query.QuerySet`. This method returns a new ``QuerySet`` that will prefetch each of the specified related lookups in a single batch as soon as the query begins to be evaluated. Unlike ``select_related``, it does the joins in Python, not in the database, and supports many-to-many relationships, ``GenericForeignKey`` and more. This allows you to fix a very common performance problem in which your code ends up doing O(n) database queries (or worse) if objects on your primary ``QuerySet`` each have many related objects that you also need to fetch.
id: Serupa pada :meth:`~django.db.models.query.QuerySet.select_related` tetapi dengan strategi yang berbeda dan cakupan lebih luas, :meth:`~django.db.models.query.QuerySet.prefetch_related` telah ditambahkan ke :class:`~django.db.models.query.QuerySet`. Metode ini mengembalikan sebuah ``QuerySet`` baru yang akan mengambil setiap dari pencarian terkait yang ditentukan di kumpulan tunggal sefera ketika permintaan mulai dinilai. Tidak seperti ``select_related``, itu melakukan penggabungan di Python, bukan di basisdata, dan mendukung hubungan many-to-many, ``GenericForeignKey`` dan lainnya. Ini mengizinkan anda memperbaiki masalah penampilan yang paling umum dimana kode anda berakhir melakukan O(n) permintaan basisdata (atau lebih buruk) jika obyek pada ``QuerySet`` utama setiap mempunyai banyak obyek terkait yang anda juga butuh ambil.
zh_hans: 类似于 :meth:`~django.db.models.query.QuerySet.select_related`，但具有不同策略和更广泛的范围，:meth:`~django.db.models.query.QuerySet.prefetch_related` 已经添加到 :class:`~django.db.models.query.QuerySet` 中。这个方法返回一个新的 ``QuerySet``，将在查询开始被评估时以单个批次的方式预取每个指定的相关查找。与 ``select_related`` 不同，它在 Python 中执行连接操作，而不是在数据库中执行，并支持多对多关系、``GenericForeignKey`` 等。这允许您解决一个非常常见的性能问题，即如果主要 ``QuerySet`` 上的对象每个都有许多相关对象需要获取，那么您的代码最终会执行 O(n) 数据库查询（或更糟）。

source: Improved password hashing
id: Diperbaiki mengacak sandi
zh_hans: 改进的密码散列处理

source: Django's auth system (``django.contrib.auth``) stores passwords using a one-way algorithm. Django 1.3 uses the SHA1_ algorithm, but increasing processor speeds and theoretical attacks have revealed that SHA1 isn't as secure as we'd like. Thus, Django 1.4 introduces a new password storage system: by default Django now uses the PBKDF2_ algorithm (as recommended by NIST_). You can also easily choose a different algorithm (including the popular bcrypt_ algorithm). For more details, see :ref:`auth_password_storage`.
id: Sistem otentifikasi Django (``django.contrib.auth``) menyimpan sandi menggunakan algoritma satu-jalan. Django 1.3 menggunakan algoritma SHA1_, tetapi meningkarkan kecepatan pengolah dan serangan teoritis telah terungkap bahwa SHA1 tidak seman kita kira. Demikian, Django 1.4 memperkenalkan sebuah sistem penyimpanan sandi baru: secara awalan Django sekarang menggunakan algoritma PBKDF2_ (seperti yang dianjurkan oleh NIST_). Anda dapat juga dengan mudah memilih algoritma berbeda (termasuk algoritma bcrypt_ terkenal). Untuk rincian lebih, lihat :ref:`auth_password_storage`.
zh_hans: Django 的认证系统（``django.contrib.auth``）使用单向算法存储密码。Django 1.3 使用 SHA1_ 算法，但随着处理器速度的增加和理论攻击的出现，SHA1 的安全性不如我们希望的那么高。因此，Django 1.4 引入了一个新的密码存储系统：默认情况下，Django 现在使用 PBKDF2_ 算法（由 NIST_ 推荐）。您还可以轻松选择不同的算法（包括流行的 bcrypt_ 算法）。有关更多详细信息，请参阅 :ref:`auth_password_storage`。

source: HTML5 doctype
id: Jenis dokumen HTML5
zh_hans: HTML5 文档类型定义（doctype）

source: We've switched the admin and other bundled templates to use the HTML5 doctype. While Django will be careful to maintain compatibility with older browsers, this change means that you can use any HTML5 features you need in admin pages without having to lose HTML validity or override the provided templates to change the doctype.
id: Kami telah mengganti cetakan admin dan gabungan lainnya untuk menggunakan doctype HTML5. Selagi Django akan lebih hati-hati merawat kesesuaian dengan peramban lama, perubahan ini berarti bahwa anda dapat menggunakan fitur HTML5 anda butuhkan di halaman admin tanpa harus kehilangan keabsahan HTML atau menimpa cetakan disediakan untuk merubah doctype.
zh_hans: 我们已经将管理员和其他捆绑模板切换为使用 HTML5 文档类型定义。尽管 Django 会小心地保持与旧浏览器的兼容性，但这一变化意味着您可以在管理员页面中使用所需的任何 HTML5 功能，而无需失去 HTML 有效性或覆盖提供的模板以更改文档类型定义。

source: List filters in admin interface
id: Daftar penyaring di antarmuka admin
zh_hans: 管理员界面的列表过滤器

source: Prior to Django 1.4, the :mod:`~django.contrib.admin` app let you specify change list filters by specifying a field lookup, but it didn't allow you to create custom filters. This has been rectified with a simple API (previously used internally and known as "FilterSpec"). For more details, see the documentation for :attr:`~django.contrib.admin.ModelAdmin.list_filter`.
id: Sebelum Django 1.4, aplikasi :mod:`~django.contrib.admin` membiarkan anda menentukan daftar perubahan penyaring dengan menentukan bidang pencarian, tetapi itu tidak mengizinkan anda membuat penyesuaian penyaring. Ini telah diperbaiki dengan API sederhana (sebelumnya digunakan secara internal dan dikenal sebagai "FilterSpec"). Untuk rincian lebih, lihat dokumentasi untuk :attr:`~django.contrib.admin.ModelAdmin.list_filter`.
zh_hans: 在 Django 1.4 之前，:mod:`~django.contrib.admin` 应用程序允许您通过指定字段查找来指定更改列表过滤器，但不允许您创建自定义过滤器。这已经得到了纠正，并引入了一个简单的 API（以前在内部使用，被称为 "FilterSpec"）。有关更多详细信息，请参阅 :attr:`~django.contrib.admin.ModelAdmin.list_filter` 的文档。

source: Multiple sort in admin interface
id: Urutan banyak di antarmuka admin
zh_hans: 管理员界面的多重排序功能
