Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Internal changes were made to the :class:`~django.forms.ClearableFileInput` widget to allow more customization. The undocumented ``url_markup_template`` attribute was removed in favor of ``template_with_initial``.
id: Perubahan internal dibuat pada widget :class:`~django.forms.ClearableFileInput` untuk mengizinkan penyesuaian lebih. Atribut ``url_markup_template`` tidak terdokumentasi telah dipindahkan dalam mendukung ``template_with_initial``.
zh_hans: :class:`~django.forms.ClearableFileInput` 小部件进行了内部更改，以允许更多自定义。未记录的 ``url_markup_template`` 属性已被删除，而改用 ``template_with_initial``。

source: For consistency with other major vendors, the ``en_GB`` locale now has Monday as the first day of the week.
id: Untuk ketetapan dengan penjaja utama lain, lokal ``en_GB`` sekarang mempunyai Sennin sebagai hari pertama dari minggu.
zh_hans: 为了与其他主要供应商保持一致，``en_GB`` 区域现在将星期一作为一周的第一天。

source: Seconds have been removed from any locales that had them in ``TIME_FORMAT``, ``DATETIME_FORMAT``, or ``SHORT_DATETIME_FORMAT``.
id: Kedua telah dipindahkan dari lokal apapun yang memiliki mereka di ``TIME_FORMAT``, ``DATETIME_FORMAT``, atau ``SHORT_DATETIME_FORMAT``.
zh_hans: 在 ``TIME_FORMAT``、``DATETIME_FORMAT`` 或 ``SHORT_DATETIME_FORMAT`` 中，已从任何具有秒钟的区域中删除了秒钟。

source: The default max size of the Oracle test tablespace has increased from 300M (or 200M, before 1.7.2) to 500M.
id: Ukuran maksimal awalan dari tablespace percobaan Oracle telah ditingkatkan dari 300 M (atau 200M, sebelum 1.7.2) menjadi 500M.
zh_hans: Oracle 测试表空间的默认最大大小从 300M（或在 1.7.2 之前的 200M）增加到 500M 。

source: ``reverse()`` and ``reverse_lazy()`` now return Unicode strings instead of bytestrings.
zh_hans: ``reverse()`` 和 ``reverse_lazy()`` 现在返回 Unicode 字符串而不是字节字符串。

source: The ``CacheClass`` shim has been removed from all cache backends. These aliases were provided for backwards compatibility with Django 1.3. If you are still using them, please update your project to use the real class name found in the :setting:`BACKEND <CACHES-BACKEND>` key of the :setting:`CACHES` setting.
id: Shim ``CacheClass`` telah dipindahkan dari semua backend cache. Nama lain ini disediakan untuk kesesuaian kebelakang dengan Django 1.3. Jika anda masih menggunakan mereka, harap perbaharui proyek anda untuk menggunakan nama kelas sebenarnya ditemukan di kunci :setting:`BACKEND <CACHES-BACKEND>` dari pengaturan :setting:`CACHES`.
zh_hans: 所有缓存后端都已删除 ``CacheClass`` 部分。这些别名是为了向后兼容 Django 1.3 提供的。如果您仍在使用它们，请更新您的项目以使用在 :setting:`CACHES` 设置的 :setting:`BACKEND <CACHES-BACKEND>` 键中找到的真实类名。

source: By default, :func:`~django.core.management.call_command` now always skips the check framework (unless you pass it ``skip_checks=False``).
id: Secara awalan, :func:`~django.core.management.call_command` sekarang selalu melewati pemeriksaan kerangka kerja (meskipun anda melewatkan itu ``skip_checks=False``).
zh_hans: 默认情况下，:func:`~django.core.management.call_command` 现在总是跳过检查框架（除非您传递 ``skip_checks=False``）。

source: When iterating over lines, :class:`~django.core.files.File` now uses :pep:`universal newlines <278>`. The following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``.
zh_hans: 在迭代行时，:class:`~django.core.files.File` 现在使用 :pep:`universal newlines <278>`。以下内容被识别为结束行：Unix 换行约定 ``'\n'``，Windows 换行约定 ``'\r\n'`` 和旧的 Macintosh 换行约定 ``'\r'``。

source: The Memcached cache backends ``MemcachedCache`` and ``PyLibMCCache`` will delete a key if ``set()`` fails. This is necessary to ensure the ``cache_db`` session store always fetches the most current session data.
id: Backend cache memcache ``MemcachedCache`` dan ``PyLibMCCache`` akan menghapus sebuah kunci jika ``set()`` gagal. Ini diperlukan untuk memastikan penyimpanan sesi ``cache_db`` selalu mengambil data sesi paling saat ini.
zh_hans: 如果 ``set()`` 失败，Memcached 缓存后端 ``MemcachedCache`` 和 ``PyLibMCCache`` 将删除一个键。这是为了确保 ``cache_db`` 会话存储始终获取最新的会话数据。

source: Private APIs ``override_template_loaders`` and ``override_with_test_loader`` in ``django.test.utils`` were removed. Override ``TEMPLATES`` with ``override_settings`` instead.
id: API pribadi ``override_template_loaders`` dan ``override_with_test_loader`` di ``django.test.utils`` telah dipindahkan. Menimpa ``TEMPLATES`` dengan ``override_settings`` sebagai gantinya.
zh_hans: 在 ``django.test.utils`` 中删除了私有 API ``override_template_loaders`` 和 ``override_with_test_loader``。请改用 ``override_settings`` 来覆盖 ``TEMPLATES``。

source: Warnings from the MySQL database backend are no longer converted to exceptions when :setting:`DEBUG` is ``True``.
id: Peringatan dari backend basisdata MySQL tidak lagi dirubah ke pengecualian ketika :setting:`DEBUG` adalah ``True``.
zh_hans: 当 :setting:`DEBUG` 设置为 ``True`` 时，MySQL 数据库后端不再将警告转换为异常。

source: :class:`~django.http.HttpRequest` now has a simplified ``repr`` (e.g. ``<WSGIRequest: GET '/somepath/'>``). This won't change the behavior of the :class:`~django.views.debug.SafeExceptionReporterFilter` class.
id: :class:`~django.http.HttpRequest` sekarang telah disederhanakan ``repr`` (sebagai contoh ``<WSGIRequest: GET '/somepath/'>``). Ini tidak akan merubah perilaku dari kelas :class:`~django.views.debug.SafeExceptionReporterFilter`.
zh_hans: :class:`~django.http.HttpRequest` 现在具有简化的 ``repr`` （例如 ``<WSGIRequest: GET '/somepath/'>``）。这不会改变 :class:`~django.views.debug.SafeExceptionReporterFilter` 类的行为。

source: Class-based views that use :class:`~django.views.generic.edit.ModelFormMixin` will raise an :exc:`~django.core.exceptions.ImproperlyConfigured` exception when both the ``fields`` and ``form_class`` attributes are specified. Previously, ``fields`` was silently ignored.
id: Tampilan berdasarkan-kelas yang menggunakan :class:`~django.views.generic.edit.ModelFormMixin` akan memunculkan sebuah pengecualian :exc:`~django.core.exceptions.ImproperlyConfigured` ketika kedua atribut ``fields`` dan ``form_class`` ditentukan. Sebelumnya, ``fields`` secara diam diabaikan.
zh_hans: 使用 :class:`~django.views.generic.edit.ModelFormMixin` 的类视图在同时指定 ``fields`` 和 ``form_class`` 属性时将引发 :exc:`~django.core.exceptions.ImproperlyConfigured` 异常。以前，``fields`` 会被静默忽略。

source: When following redirects, the test client now raises :exc:`~django.test.client.RedirectCycleError` if it detects a loop or hits a maximum redirect limit (rather than passing silently).
id: Ketika mengikuti pengalihan, klien percobaan sekarang memunculkan :exc:`~django.test.client.RedirectCycleError` jika itu mengetahui perulangan atau menegai batasan pengalihan maksimal (daripada kemudian melewatkan secara diam).
zh_hans: 在跟随重定向时，测试客户端现在会引发 :exc:`~django.test.client.RedirectCycleError`，如果检测到循环或达到了最大重定向限制（而不是静默传递）。

source: Translatable strings set as the ``default`` parameter of the field are cast to concrete strings later, so the return type of ``Field.get_default()`` is different in some cases. There is no change to default values which are the result of a callable.
id: Deretan karakter dapat diartikan sebagai parameter ``default`` dari bidang adalah dimasukkan ke deretan karakter berwujud terakhir, jadi jenis kembalian dari ``Field.get_default()`` berbeda di beberapa kasus. Tidak ada perubahan pada nilai awalan yang merupakan hasil dari callable.
zh_hans: 作为字段的 ``default`` 参数设置的可翻译字符串稍后会转换为具体的字符串，因此在某些情况下，``Field.get_default()`` 的返回类型会有所不同。对于可调用返回的默认值没有变化。

source: ``GenericIPAddressField.empty_strings_allowed`` is now ``False``. Database backends that interpret empty strings as null (only Oracle among the backends that Django includes) will no longer convert null values back to an empty string. This is consistent with other backends.
id: ``GenericIPAddressField.empty_strings_allowed`` sekarang ``False``. Backend basisdata yang mengartikan string kosong sebagai null (hanya Oracle diantara backend yang Django sertakan) akan tidak lagi merubah nilai null kembali ke string kosong. Ini adalah ketetapan dengan backend lain.
zh_hans: ``GenericIPAddressField.empty_strings_allowed`` 现在是 ``False``。将空字符串解释为 null 值的数据库后端（Django 包括的后端中只有 Oracle）将不再将 null 值转换回空字符串。这与其他后端保持一致。

source: When the ``BaseCommand.leave_locale_alone`` attribute is ``False``, translations are now deactivated instead of forcing the "en-us" locale. In the case your models contained non-English strings and you counted on English translations to be activated in management commands, this will not happen any longer. It might be that new database migrations are generated (once) after migrating to 1.8.
zh_hans: 当 ``BaseCommand.leave_locale_alone`` 属性为 ``False`` 时，现在会停用翻译，而不是强制使用 "en-us" 区域设置。如果您的模型包含非英语字符串，并且您依赖于在管理命令中激活英语翻译，那么这将不再发生。可能会在迁移到 1.8 后生成新的数据库迁移（一次）。

source: :func:`django.utils.translation.get_language()` now returns ``None`` instead of :setting:`LANGUAGE_CODE` when translations are temporarily deactivated.
id: :func:`django.utils.translation.get_language()` sekarang mengembalikan ``None`` daripada :setting:`LANGUAGE_CODE` ketika terjemahan secara sementara dinonaktifkan.
zh_hans: 当翻译被临时停用时，:func:`django.utils.translation.get_language()` 现在返回 ``None`` 而不是 :setting:`LANGUAGE_CODE`。

source: When a translation doesn't exist for a specific literal, the fallback is now taken from the :setting:`LANGUAGE_CODE` language (instead of from the untranslated ``msgid`` message).
id: Ketika sebuah terjemahan tidak ada untuk harfiah tertentu, fallback sekarang diambil dari bahasa :setting:`LANGUAGE_CODE` (daripada dari pesan ``msid`` tidak diterjemahkan).
zh_hans: 当不存在特定文字的翻译时，现在会从 :setting:`LANGUAGE_CODE` 语言中获取回退翻译（而不是从未翻译的 ``msgid`` 消息中获取）。

source: The ``name`` field of :class:`django.contrib.contenttypes.models.ContentType` has been removed by a migration and replaced by a property. That means it's not possible to query or filter a ``ContentType`` by this field any longer.
id: Bidang ``name`` dari :class:`django.contrib.contenttypes.models.ContentType` telah dipindahkan dengan perpindahan dan diganti oleh sebuah sifat. Itu berarti itu tidak memungkinkan untuk meminta atau menyaring sebuah ``ContentType`` dengan bidang ini lagi.
zh_hans: :class:`django.contrib.contenttypes.models.ContentType` 的 ``name`` 字段已经在迁移中删除，并被一个属性替代。这意味着不再可以使用这个字段来查询或过滤 ``ContentType`` 了。

source: Be careful if you upgrade to Django 1.8 and skip Django 1.7. If you run ``manage.py migrate --fake``, this migration will be skipped and you'll see a ``RuntimeError: Error creating new content types.`` exception because the ``name`` column won't be dropped from the database. Use ``manage.py migrate --fake-initial`` to fake only the initial migration instead.
id: Hati-hati jika anda meningkatkan ke Django 1.8 dan melewati Django 1.7. Jika anda menjalankan ``manage.py migrate --fake``, perpindahan ini akan dilewatkan dan anda akan melihat sebuah pengecualian ``RuntimeError: Error creating new content types.`` karena kolom ``name`` tidak akan dibuang dari basisdata. Gunakan ``manage.py migrate --fake-initial`` untuk meniru hanya perpindahan awalan sebagai gantinya.
zh_hans: 如果你升级到 Django 1.8 并跳过了 Django 1.7，请注意。如果你运行 ``manage.py migrate --fake``，这个迁移将被跳过，并且你会看到一个 ``RuntimeError: Error creating new content types.`` 异常，因为 ``name`` 列不会从数据库中删除。使用 ``manage.py migrate --fake-initial`` 仅虚拟执行初始迁移。

source: The new :option:`migrate --fake-initial` option allows faking initial migrations. In 1.7, initial migrations were always automatically faked if all tables created in an initial migration already existed.
id: Pilihan :option:`migrate --fake-initial` baru mengizinkan perpindahan inisial tiruan, Di 1.7, inisial perpindahan selalu secara otomatis tiruan jika semua tabel dibuat di inisial perpindahan sudah ada.
zh_hans: 新的 :option:`migrate --fake-initial` 选项允许虚拟执行初始迁移。在 1.7 版中，如果初始迁移中创建的所有表格已经存在，初始迁移将始终自动虚拟执行。

source: An app *without* migrations with a ``ForeignKey`` to an app *with* migrations may now result in a foreign key constraint error when migrating the database or running tests. In Django 1.7, this could fail silently and result in a missing constraint. To resolve the error, add migrations to the app without them.
id: Sebuah aplikasi *tanpa* perpindahan dengan ``ForeignKey`` pada sebuah aplikasi *dengan* perpindahan mungkin sekarang hasil di kesalahanbatasan foreign key ketika memindahkan basisdata atau menjalankan percobaan. Di Django 1.7, ini dapat gagal secara diam dan kembali di batasan hilang. Untuk mengatasi kesalahan, tambah perpindahan pada aplikasi tanpa mereka.
zh_hans: 一个没有迁移的应用程序，其内含一个对有迁移的应用程序的 ``ForeignKey``，在迁移数据库或运行测试时可能会导致外键约束错误。在 Django 1.7 中，这可能会导致默默失败并导致约束丢失。要解决这个错误，请为没有迁移的应用程序添加迁移。

source: Features deprecated in 1.8
id: Fitur diusangkan di 1.8
zh_hans: 在 1.8 中被废弃的功能

source: Selected methods in ``django.db.models.options.Options``
id: Metode terpilih di ``django.db.models.options.Options``
zh_hans: ``django.db.models.options.Options`` 中的选定方法

source: As part of the formalization of the ``Model._meta`` API (from the :class:`django.db.models.options.Options` class), a number of methods have been deprecated and will be removed in Django 1.10:
id: Sebagai bagian dari perumusan dari API ``Model._meta`` (dari kelas :class:`django.db.models.options.Options`), sejumlah metode telah diusangkan dan akan dipindahkan di Django 1.10:
zh_hans: 作为正式化 ``Model._meta`` API（来自 :class:`django.db.models.options.Options` 类）的一部分，一些方法已被弃用，并将在 Django 1.10 中移除：

source: Loading ``cycle`` and ``firstof`` template tags from ``future`` library
id: Memuat etiket cetakan ``cycle`` dan ``firstof`` dari pustaka ``future``
zh_hans: 加载 ``cycle`` 和 ``firstof`` 模板标签来自 ``future`` 库

source: Django 1.6 introduced ``{% load cycle from future %}`` and ``{% load firstof from future %}`` syntax for forward compatibility of the :ttag:`cycle` and :ttag:`firstof` template tags. This syntax is now deprecated and will be removed in Django 1.10. You can simply remove the ``{% load ... from future %}`` tags.
id: Django 1.6 memperkenalkan sintaksis ``{% load cycle from future %}`` dan ``{% load firstof from future %}`` untuk kesesuaian kedepan dari etiket cetakan :ttag:`cycle` dan :ttag:`firstof`. Sintaksis ini sekarang diusangkan dan akan dipindahkan di Django 1.10. Anda dapat cukup memindahkan etiket ``{% load ... from future %}``.
zh_hans: Django 1.6 引入了 ``{% load cycle from future %}`` 和 ``{% load firstof from future %}`` 语法，用于前向兼容 :ttag:`cycle` 和 :ttag:`firstof` 模板标签。此语法现已被弃用，并将在 Django 1.10 中移除。您可以简单地删除 ``{% load ... from future %}`` 标签。

source: In the olden days of Django, it was encouraged to reference views as strings in ``urlpatterns``::
id: Di haru dahulu dari Django, itu didorong untuk mengacukan tampilan sebagai string di ``urlpatterns``::
zh_hans: 在早期的 Django 中，鼓励在 ``urlpatterns`` 中将视图引用为字符串：

source: and Django would magically import ``myapp.views.myview`` internally and turn the string into a real function reference. In order to reduce repetition when referencing many views from the same module, the ``patterns()`` function takes a required initial ``prefix`` argument which is prepended to all views-as-strings in that set of ``urlpatterns``::
id: dan Django secara ajaib akan mengimpor ``myapp.views.myview`` secara internal dan merubah string kedalam acuan fungsi sebenarnya. Untuk mengurangi perulangan ketika mengacu banyak tampilan dari modul yang sama, fungsi ``patterns()`` mengambil argumen ``prefix`` awal yang diwajibkan yang ditambahkan ke semua tampilan-sebagai-string di kumpulan dari ``urlpatterns`` itu::
zh_hans: Django 会在内部神奇地导入 ``myapp.views.myview`` 并将字符串转换为真实的函数引用。为了减少在引用同一模块中的多个视图时的重复性，``patterns()`` 函数接受一个必需的初始 ``prefix`` 参数，该参数会添加到该组 ``urlpatterns`` 中所有作为字符串的视图前面：

source: In the modern era, we have updated the tutorial to instead recommend importing your views module and referencing your view functions (or classes) directly. This has a number of advantages, all deriving from the fact that we are using normal Python in place of "Django String Magic": the errors when you mistype a view name are less obscure, IDEs can help with autocompletion of view names, etc.
id: Di era modern, kami telah memperbaharui tutorial daripada menganjurkan modul tampilan anda dan mengacu fungsi tampilan anda (atau kelas-kelas) secara langsung. Ini mempunyai sejumlah keuntungan, semua berasal dari kenyataan bahwa kami sedang menggunakan Python biasa dalam menempatkan "Django String Magic": kesalahan-kesalahan ketika anda salah ketik sebuah nama tampilan adalah sedikit mengaburkan, IDE dapat membantu dengan pelengkapan otomatis dari nama-nama tampilan, dll.
zh_hans: 在现代时代，我们已经更新了教程，建议导入您的视图模块并直接引用您的视图函数（或类）。这样做有很多优点，所有优点都源自于我们使用普通的 Python 代替“Django 字符串魔法”：当您拼写错误视图名称时的错误更不隐晦，集成开发环境可以帮助自动完成视图名称等等。

source: So these days, the above use of the ``prefix`` arg is much more likely to be written (and is better written) as::
id: Jadi hari ini, yang diatas menggunakan argumen ``prefix`` jauh lebih mungkin untuk ditulis (dan lebih baik ditulis) sebagai::
zh_hans: 因此，现在更有可能以以下方式编写（也更好地编写）上述使用 ``prefix`` 参数的代码：

source: Thus ``patterns()`` serves little purpose and is a burden when teaching new users (answering the newbie's question "why do I need this empty string as the first argument to ``patterns()``?"). For these reasons, we are deprecating it. Updating your code is as simple as ensuring that ``urlpatterns`` is a list of ``django.conf.urls.url()`` instances. For example::
zh_hans: 因此，``patterns()`` 函数的作用很小，并且在教新用户时会造成困扰（回答新手的问题 "为什么我需要将空字符串作为 ``patterns()`` 的第一个参数？"）。出于这些原因，我们正在弃用它。更新您的代码非常简单，只需确保 ``urlpatterns`` 是 ``django.conf.urls.url()`` 实例的列表。例如：

source: Passing a string as ``view`` to ``django.conf.urls.url()``
zh_hans: 将字符串作为 ``view`` 传递给 ``django.conf.urls.url()``

source: Related to the previous item, referencing views as strings in the ``url()`` function is deprecated. Pass the callable view as described in the previous section instead.
id: Terkait pada barang sebelumnya, mengacu tampilan sebagai sting di fungsi ``url()`` adalah diusangkan. Lewatkan tampilan dapat dipanggil seperti digambarkan di bagian sebelumnya sebagai gantinya.
zh_hans: 与前面的项目相关，将视图作为字符串引用在 ``url()`` 函数中已被弃用。请按照前面的部分所描述的方式传递可调用的视图函数。

source: Template-related settings
id: Pengaturan terkait-cetakan
zh_hans: 模板相关的设置

source: As a consequence of the multiple template engines refactor, several settings are deprecated in favor of :setting:`TEMPLATES`:
id: Sebagai sebuah konsekuensi dari banyak refaktor mesin cetakan, beberapa pengaturan diusangkan dalam mendukung :setting:`TEMPLATES`:
zh_hans: 由于多个模板引擎的重构，一些设置已被弃用，建议使用 :setting:`TEMPLATES` 代替：

source: Built-in template context processors have been moved to ``django.template.context_processors``.
id: Pengolah konteks cetakan siap-pakai telah dipindahkan ke ``django.template.context_processors``.
zh_hans: 内置模板上下文处理器已经移动到 ``django.template.context_processors``。

source: The attribute ``SimpleTestCase.urls`` for specifying URLconf configuration in tests has been deprecated and will be removed in Django 1.10. Use :func:`@override_settings(ROOT_URLCONF=...) <django.test.override_settings>` instead.
id: Atribut ``SimpleTestCase.urls`` untuk menentukan konfigurasi URLConf dalam percobaan telah diusangkan dan akan dipindahkan di Django 1.10. Gunakan :func:`@override_settings(ROOT_URLCONF=...) <django.test.override_settings>` sebagai gantinya.
zh_hans: 用于在测试中指定 URLconf 配置的属性 ``SimpleTestCase.urls`` 已被弃用，并将在 Django 1.10 中移除。请改用 :func:`@override_settings(ROOT_URLCONF=...) <django.test.override_settings>`。

source: ``prefix`` argument to :func:`~django.conf.urls.i18n.i18n_patterns`
id: Argumen ``prefix`` pada :func:`~django.conf.urls.i18n.i18n_patterns`
zh_hans: ``prefix`` 参数用于 :func:`~django.conf.urls.i18n.i18n_patterns` 函数。

source: Related to the previous item, the ``prefix`` argument to :func:`django.conf.urls.i18n.i18n_patterns` has been deprecated. Simply pass a list of ``django.conf.urls.url()`` instances instead.
zh_hans: 与前面的项目相关，已弃用了 :func:`django.conf.urls.i18n.i18n_patterns` 函数的 ``prefix`` 参数。只需传递一个 ``django.conf.urls.url()`` 实例的列表即可。

source: Using an incorrect count of unpacked values in the :ttag:`for` template tag
id: Menggunakan hitungan tidak benar dari nilai dibongkar di etiket cetakan :ttag:`for`
zh_hans: 在 :ttag:`for` 模板标签中使用错误的解包值数量

source: Using an incorrect count of unpacked values in :ttag:`for` tag will raise an exception rather than fail silently in Django 1.10.
id: Menggunakan sebuah hitungan tidak benar dari nilai dibongkar dalam etiket :ttag:`for` akan memunculkan sebuah pengecualian daripada gagal secara diam di Django 1.10.
zh_hans: 在 Django 1.10 中，在 :ttag:`for` 标签中使用错误的解包值数量将引发异常，而不是静默失败。

source: Passing a dotted path to ``reverse()`` and :ttag:`url`
id: Melewatkan jalur bertitik ke ``reverse()`` dan :ttag:`url`
zh_hans: 传递点路径给 ``reverse()`` 和 :ttag:`url`

source: Reversing URLs by Python path is an expensive operation as it causes the path being reversed to be imported. This behavior has also resulted in a `security issue`_. Use :ref:`named URL patterns <naming-url-patterns>` for reversing instead.
id: Membalikkan URL dengan jalur Python adalah sebuah tindakan yang mahal karena itu menyebabkan jalur menjadi berbalik untuk diimpor. Perilaku ini juga dihasilkan di `security issue`_. Gunakan :ref:`named URL patterns <naming-url-patterns>` untuk membalikkan sebagai gantinya.
zh_hans: 通过 Python 路径反向解析 URL 是一项昂贵的操作，因为它导致被反向解析的路径被导入。这种行为还导致了一个 `security issue`_。请改用 :ref:`命名的 URL 模式 <naming-url-patterns>` 来进行反向解析。

source: If you are using :mod:`django.contrib.sitemaps`, add the ``name`` argument to the ``url`` that references :func:`django.contrib.sitemaps.views.sitemap`::
id: Jika anda sedang menggunakan :mod:`django.contrib.sitemaps`, tambah argumen ``name`` ke ``url`` yang mengacu :func:`django.contrib.sitemaps.views.sitemap`::
zh_hans: 如果您正在使用 :mod:`django.contrib.sitemaps`，请在引用 :func:`django.contrib.sitemaps.views.sitemap` 的 ``url`` 中添加 ``name`` 参数：

source: to ensure compatibility when reversing by Python path is removed in Django 1.10.
id: untuk memastikan kesesuaian ketika membalikkan oleh jalur Python dipindahkan di Django 1.10.
zh_hans: 为了确保在 Django 1.10 中移除通过 Python 路径进行反向解析时的兼容性。

source: Similarly for GIS sitemaps, add ``name='django.contrib.gis.sitemaps.views.kml'`` or ``name='django.contrib.gis.sitemaps.views.kmz'``.
id: Serupa untuk peta situs GIS, tambah ``name='django.contrib.gis.sitemaps.views.kml'`` atau ``name='django.contrib.gis.sitemaps.views.kmz'``.
zh_hans: 同样对于 GIS 网站地图，添加 ``name='django.contrib.gis.sitemaps.views.kml'`` 或 ``name='django.contrib.gis.sitemaps.views.kmz'``。

source: If you are using a Python path for the :setting:`LOGIN_URL` or :setting:`LOGIN_REDIRECT_URL` setting, use the name of the ``url()`` instead.
id: Jika anda sedang menggunakan jalur Python untuk pengaturan :setting:`LOGIN_URL` atau :setting:`LOGIN_REDIRECT_URL`, gunakan nama dari ``url()`` sebagai gantinya.
zh_hans: 如果您正在为 :setting:`LOGIN_URL` 或 :setting:`LOGIN_REDIRECT_URL` 设置使用 Python 路径，请改为使用 ``url()`` 的名称。

source: Aggregate methods and modules
id: Metode dan modul pengumpulan
zh_hans: 聚合方法和模块

source: The ``django.db.models.sql.aggregates`` and ``django.contrib.gis.db.models.sql.aggregates`` modules (both private API), have been deprecated as ``django.db.models.aggregates`` and ``django.contrib.gis.db.models.aggregates`` are now also responsible for SQL generation. The old modules will be removed in Django 1.10.
id: Modul ``django.db.models.sql.aggregates`` dan ``django.contrib.gis.db.models.sql.aggregates`` (kedua API pribadi), telah diusangkan sebagai ``django.db.models.aggregates`` dan ``django.contrib.gis.db.models.aggregates`` sekarang juga bertanggungjawab untuk pembangkitan SQL. Modul lama akan dipindahkan di Django 1.10.
zh_hans: ``django.db.models.sql.aggregates`` 和 ``django.contrib.gis.db.models.sql.aggregates`` 模块（都是私有 API）已被弃用，因为 ``django.db.models.aggregates`` 和 ``django.contrib.gis.db.models.aggregates`` 现在也负责 SQL 生成。旧模块将在 Django 1.10 中移除。
