Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``check`` management command added for verifying compatibility
id: Perintah pengelolaan ``check`` ditambahkan untuk mengecek kesesuaian
zh_hans: 新增了 ``check`` 管理命令，用于验证兼容性。

source: A :djadmin:`check` management command was added, enabling you to verify if your current configuration (currently oriented at settings) is compatible with the current version of Django.
id: Sebuah perintah pengelolaan :djadmin:`check` telah ditambahkan, mengadakan anda untuk memeriksa jika konfigurasi anda saat ini (saat ini bertujuan pada pengaturan) adalah cocok dengan versi saat ini dari Django.
zh_hans: 新增了 :djadmin:`check` 管理命令，可以用来验证您当前的配置（目前是基于设置）是否与当前版本的 Django 兼容。

source: :meth:`Model.save() <django.db.models.Model.save()>` algorithm changed
id: Algoritma :meth:`Model.save() <django.db.models.Model.save()>` berubah
zh_hans: :meth:`Model.save() <django.db.models.Model.save()>` 算法已更改

source: The :meth:`Model.save() <django.db.models.Model.save()>` method now tries to directly ``UPDATE`` the database if the instance has a primary key value. Previously ``SELECT`` was performed to determine if ``UPDATE`` or ``INSERT`` were needed. The new algorithm needs only one query for updating an existing row while the old algorithm needed two. See :meth:`Model.save() <django.db.models.Model.save()>` for more details.
id: Metode :meth:`Model.save() <django.db.models.Model.save()>` sekarang mencoba secara langsung ``UPDATE`` basisdata jika instance mempunyai sebuah nilai primary key. Sebelumnya ``SELECT`` telah dilakukan untuk menentukan jika ``UPDATE`` atau ``INSERT`` dibutuhkan. Algoritma baru dibutuhkan jika hanya satu permintaan untuk memperbaharui baris yang ada selagi algoritma lama membutuhkan dua. Lihat :meth:`Model.save() <django.db.models.Model.save()>` untuk lebih rinci.
zh_hans: :meth:`Model.save() <django.db.models.Model.save()>` 方法现在会尝试直接执行数据库 ``UPDATE`` 操作，如果实例具有主键值。以前会执行 ``SELECT`` 来确定是否需要执行 ``UPDATE`` 或 ``INSERT``。新算法只需要一次查询来更新现有行，而旧算法需要两次。有关更多详细信息，请参阅 :meth:`Model.save() <django.db.models.Model.save()>`。

source: In some rare cases the database doesn't report that a matching row was found when doing an ``UPDATE``. An example is the PostgreSQL ``ON UPDATE`` trigger which returns ``NULL``. In such cases it is possible to set :attr:`django.db.models.Options.select_on_save` flag to force saving to use the old algorithm.
id: Di beberapa kasus yang jarang basisdata tidak melaporkan bahwa sebuah baris yang cocok telah ditemukan ketika melakukan sebuah ``UPDATE``. Sebuah contoh adalah pemicu ``ON UPDATE`` PostgreSQL yang mengembalikan ``NULL``. Dalam kasus tersebut itu memungkinkan menyetel bendera :attr:`django.db.models.Options.select_on_save` untuk memaksa menyimpan menggunakan algoritma lama.
zh_hans: 在一些罕见的情况下，数据库在执行 ``UPDATE`` 时可能不会报告找到匹配的行。一个例子是 PostgreSQL 中的 ``ON UPDATE`` 触发器，它返回 ``NULL``。在这种情况下，可以设置 :attr:`django.db.models.Options.select_on_save` 标志来强制使用旧算法进行保存。

source: Authentication backends can raise ``PermissionDenied`` to immediately fail the authentication chain.
id: Backend otentifikasi dapat memunculkan ``PermissionDenied`` untuk segera menggagalkan rantai otentifikasi.
zh_hans: 身份验证后端可以引发 ``PermissionDenied`` 来立即终止身份验证链。

source: The ``HttpOnly`` flag can be set on the CSRF cookie with :setting:`CSRF_COOKIE_HTTPONLY`.
id: Bendera ``HttpOnly`` dapat disetel di kue CSRF dengan :setting:`CSRF_COOKIE_HTTPONLY`.
zh_hans: 可以使用 :setting:`CSRF_COOKIE_HTTPONLY` 来在 CSRF Cookie 上设置 ``HttpOnly`` 标志。

source: The ``assertQuerysetEqual()`` now checks for undefined order and raises :exc:`ValueError` if undefined order is spotted. The order is seen as undefined if the given ``QuerySet`` isn't ordered and there is more than one ordered value to compare against.
zh_hans: ``assertQuerysetEqual()`` 现在检查未定义的排序，并在发现未定义的排序时引发 :exc:`ValueError`。如果给定的 ``QuerySet`` 没有排序，并且有多个排序值要进行比较，那么排序被视为未定义。

source: Added :meth:`~django.db.models.query.QuerySet.earliest` for symmetry with :meth:`~django.db.models.query.QuerySet.latest`.
id: Ditambahkan :meth:`~django.db.models.query.QuerySet.earliest` untuk simetri dengan :meth:`~django.db.models.query.QuerySet.latest`.
zh_hans: 新增了 :meth:`~django.db.models.query.QuerySet.earliest`，以与 :meth:`~django.db.models.query.QuerySet.latest` 对称。

source: In addition to :lookup:`year`, :lookup:`month` and :lookup:`day`, the ORM now supports :lookup:`hour`, :lookup:`minute` and :lookup:`second` lookups.
id: Sebagai tambahan pada :lookup:`year`, :lookup:`month` dan :lookup:`day`, ORM sekarang mendukung pencarian :lookup:`hour`, :lookup:`minute` dan :lookup:`second`.
zh_hans: 除了 :lookup:`year`、:lookup:`month` 和 :lookup:`day`，ORM 现在还支持 :lookup:`hour`、:lookup:`minute` 和 :lookup:`second` 查找。

source: Django now wraps all :pep:`249` exceptions.
zh_hans: Django 现在包装了所有 :pep:`249` 异常。

source: The default widgets for :class:`~django.forms.EmailField`, :class:`~django.forms.URLField`, :class:`~django.forms.IntegerField`, :class:`~django.forms.FloatField` and :class:`~django.forms.DecimalField` use the new type attributes available in HTML5 (``type='email'``, ``type='url'``, ``type='number'``). Note that due to erratic support of the ``number`` input type with localized numbers in current browsers, Django only uses it when numeric fields are not localized.
id: Widget awalan untuk :class:`~django.forms.EmailField`, :class:`~django.forms.URLField`, :class:`~django.forms.IntegerField`, :class:`~django.forms.FloatField` dan :class:`~django.forms.DecimalField` menggunakan atribut jenis baru tersedia di HTML5 (``type='email'``, ``type='url'``, ``type='number'``). Catat bagwa karena dukungan tak menentu dari jenis masukan ``number`` dengan angka lokal di peramban saat ini, Django hanya menggunakannya ketika bidang numerik tidak di lokalkan.
zh_hans: :class:`~django.forms.EmailField`、:class:`~django.forms.URLField`、:class:`~django.forms.IntegerField`、:class:`~django.forms.FloatField` 和 :class:`~django.forms.DecimalField` 的默认小部件现在使用 HTML5 中可用的新类型属性（``type='email'``、``type='url'``、``type='number'``）。请注意，由于当前浏览器中对本地化数字支持不稳定，因此 Django 只在数值字段未本地化时使用 ``number`` 输入类型。

source: The ``number`` argument for :ref:`lazy plural translations <lazy-plural-translations>` can be provided at translation time rather than at definition time.
id: Argumen ``number`` untuk :ref:`lazy plural translations <lazy-plural-translations>` dapat disediakan pada waktu terjemahan daripada saat waktu penentuan.
zh_hans: 对于 :ref:`延迟复数翻译 <lazy-plural-translations>`，可以在翻译时提供 ``number`` 参数，而不是在定义时提供。

source: For custom management commands: Verification of the presence of valid settings in commands that ask for it by using the ``BaseCommand.can_import_settings`` internal option is now performed independently from handling of the locale that should be active during the execution of the command. The latter can now be influenced by the new ``BaseCommand.leave_locale_alone`` internal option. See :ref:`management-commands-and-locales` for more details.
zh_hans: 对于自定义管理命令：在要求使用 ``BaseCommand.can_import_settings`` 内部选项的命令中，现在独立于处理执行命令期间应处于活动状态的区域设置的验证。后者现在可以受到新的 ``BaseCommand.leave_locale_alone`` 内部选项的影响。有关更多详细信息，请参阅 :ref:`管理命令和区域设置`。

source: The :attr:`~django.views.generic.edit.DeletionMixin.success_url` of :class:`~django.views.generic.edit.DeletionMixin` is now interpolated with its ``object``’s ``__dict__``.
zh_hans: :class:`~django.views.generic.edit.DeletionMixin` 的 :attr:`~django.views.generic.edit.DeletionMixin.success_url` 现在使用其 ``object`` 的 ``__dict__`` 进行插值。

source: :class:`~django.http.HttpResponseRedirect` and :class:`~django.http.HttpResponsePermanentRedirect` now provide an ``url`` attribute (equivalent to the URL the response will redirect to).
id: :class:`~django.http.HttpResponseRedirect` dan :class:`~django.http.HttpResponsePermanentRedirect` sekarang menyediakan sebuah atribut ``url`` (setara dengan tanggapan URL akan dialihkan).
zh_hans: :class:`~django.http.HttpResponseRedirect` 和 :class:`~django.http.HttpResponsePermanentRedirect` 现在提供了一个 ``url`` 属性（等同于响应将重定向到的 URL）。

source: The ``MemcachedCache`` cache backend now uses the latest :mod:`pickle` protocol available.
id: Backend penyimpanan sementara ``MemcachedCache`` sekarang menggunakan protokol :mod:`pickle` yang terakhir tersedia.
zh_hans: ``MemcachedCache`` 缓存后端现在使用了最新可用的 :mod:`pickle` 协议。

source: Added :class:`~django.contrib.messages.views.SuccessMessageMixin` which provides a ``success_message`` attribute for :class:`~django.views.generic.edit.FormView` based classes.
id: Ditambahkan :class:`~django.contrib.messages.views.SuccessMessageMixin` yang menyediakan sebuah atribut ``success_message`` untuk :class:`~django.views.generic.edit.FormView` berdasarkan kelas-kelas.
zh_hans: 新增了 :class:`~django.contrib.messages.views.SuccessMessageMixin`，它为基于 :class:`~django.views.generic.edit.FormView` 的类提供了一个 ``success_message`` 属性。

source: Added the :attr:`django.db.models.ForeignKey.db_constraint` and :attr:`django.db.models.ManyToManyField.db_constraint` options.
id: Ditambahkan pilihan :attr:`django.db.models.ForeignKey.db_constraint` dan :attr:`django.db.models.ManyToManyField.db_constraint`.
zh_hans: 新增了 :attr:`django.db.models.ForeignKey.db_constraint` 和 :attr:`django.db.models.ManyToManyField.db_constraint` 选项。

source: The jQuery library embedded in the admin has been upgraded to version 1.9.1.
id: Pustaka jQuery ditanam di admin telah ditingkatkan ke versi 1.9.1.
zh_hans: jQuery 库嵌入在管理系统中已升级至 1.9.1 版本。

source: Syndication feeds (:mod:`django.contrib.syndication`) can now pass extra context through to feed templates using a new :meth:`Feed.get_context_data() <django.contrib.syndication.Feed.get_context_data>` callback.
id: Umpan kongsi (:mod:`django.contrib.syndication`) sekarang dapat melewatkan konteks tambahan melalui cetakan umpan menggunakan callback :meth:`Feed.get_context_data() <django.contrib.syndication.Feed.get_context_data>` baru.
zh_hans: 现在，通过新的 :meth:`Feed.get_context_data() <django.contrib.syndication.Feed.get_context_data>` 回调，订阅源（:mod:`django.contrib.syndication`）可以将额外的上下文传递给订阅源模板。

source: The admin list columns have a ``column-<field_name>`` class in the HTML so the columns header can be styled with CSS, e.g. to set a column width.
id: Kolom daftar admin mempunyai sebuah kelas ``column-<field_name>`` di HTML jadi kepalakolom dapat digaya dengan CSS, sebagai contoh untuk menyetel lebar kolom.
zh_hans: 在 HTML 中，管理员列表列具有 ``column-<field_name>`` 类，因此可以使用 CSS 对列标题进行样式设置，例如设置列宽。

source: The :ref:`isolation level<database-isolation-level>` can be customized under PostgreSQL.
id: :ref:`isolation level<database-isolation-level>` dapat disesuaikan dibawah PostgreSQL.
zh_hans: 在 PostgreSQL 下，可以自定义 :ref:`隔离级别 <database-isolation-level>`。

source: The :ttag:`blocktrans` template tag now respects ``TEMPLATE_STRING_IF_INVALID`` for variables not present in the context, just like other template constructs.
id: Etiket cetakan :ttag:`blocktrans` sekarang mematuhi ``TEMPLATE_STRING_IF_INVALID`` untuk variabel tidak hadir di konteks, sama seprti penyusunan cetakan lain.
zh_hans: :ttag:`blocktrans` 模板标签现在像其他模板结构一样，尊重对于上下文中不存在的变量的 ``TEMPLATE_STRING_IF_INVALID``。

source: ``SimpleLazyObject``\s will now present more helpful representations in shell debugging situations.
id: ``SimpleLazyObject`` sekarang akan menghadirkan gambaran lebih membantu dalam keadaan mencari kesalahan shell.
zh_hans: 在 shell 调试情况下，``SimpleLazyObject`` 现在会提供更有帮助的表示。

source: Generic :class:`~django.contrib.gis.db.models.GeometryField` is now editable with the OpenLayers widget in the admin.
id: :class:`~django.contrib.gis.db.models.GeometryField` umum sekarang dapat disunting dengan widget OpenLayer di admin.
zh_hans: 通用的 :class:`~django.contrib.gis.db.models.GeometryField` 现在可以在管理员中使用 OpenLayers 小部件进行编辑。

source: The documentation contains a :doc:`deployment checklist </howto/deployment/checklist>`.
id: Dokumentasi mengandung :doc:`deployment checklist </howto/deployment/checklist>`.
zh_hans: 文档中包含一个 :doc:`部署清单 </howto/deployment/checklist>`。

source: The :djadmin:`diffsettings` command gained a ``--all`` option.
id: Perintah :djadmin:`diffsettings` mendapatkan pilihan ``--all``.
zh_hans: :djadmin:`diffsettings` 命令增加了 ``--all`` 选项。

source: ``django.forms.fields.Field.__init__`` now calls ``super()``, allowing field mixins to implement ``__init__()`` methods that will reliably be called.
id: ``django.forms.fields.Field.__init__`` sekarang memanggil ``super()``, mengizinkan campuran bidang untuk menerapkan metode ``__init__()`` yang akan dapat dihandalkan dipanggil.
zh_hans: ``django.forms.fields.Field.__init__`` 现在调用了 ``super()``，允许字段混合类实现 ``__init__()`` 方法，并可靠地被调用。

source: The ``validate_max`` parameter was added to ``BaseFormSet`` and :func:`~django.forms.formsets.formset_factory`, and ``ModelForm`` and inline versions of the same. The behavior of validation for formsets with ``max_num`` was clarified. The previously undocumented behavior that hardened formsets against memory exhaustion attacks was documented, and the undocumented limit of the higher of 1000 or ``max_num`` forms was changed so it is always 1000 more than ``max_num``.
id: Parameter ``validate_max`` telah ditambahkan ke ``BaseFormSet`` dan :func:`~django.forms.formsets.formset_factory`, dan ``ModelForm`` dan versi berderet dari yang sama. Perilaku dari pengesahan untuk formset dengan ``max_num`` telah dijelaskan. Sebelumnya perilaku tidak terdokumentasi yang mengeraskan formset terhadap serangan kelelahan ingatan telah didokumentasikan, dan tidak terdokumentasi terbatas dari lebih tinggi 1000 atau ``max_num`` formulir telah dirubah jadi itu selalu 1000 lebih daripada ``max_num``.
zh_hans: 在 ``BaseFormSet`` 和 :func:`~django.forms.formsets.formset_factory` 以及 ``ModelForm`` 和相应的内联版本中添加了 ``validate_max`` 参数。对于带有 ``max_num`` 的表单集的验证行为进行了澄清。之前未记录的行为，以防止内存耗尽攻击的表单集被记录下来，同时未记录的高于 1000 或 ``max_num`` 的上限已更改，现在它总是比 ``max_num`` 多 1000。

source: Added ``BCryptSHA256PasswordHasher`` to resolve the password truncation issue with bcrypt.
id: Ditambahkan ``BCryptSHA256PasswordHasher`` untuk menyelesaikan masalah pemotongan sandi dengan bcrypt.
zh_hans: 添加了 ``BCryptSHA256PasswordHasher`` 来解决 bcrypt 密码截断问题。

source: :pypi:`Pillow` is now the preferred image manipulation library to use with Django. :pypi:`PIL` is pending deprecation (support to be removed in Django 1.8). To upgrade, you should **first** uninstall PIL, **then** install Pillow.
zh_hans: :pypi:`Pillow` 现在是与 Django 一起使用的首选图像处理库。 :pypi:`PIL` 已经进入弃用过程（在 Django 1.8 中将删除支持）。要升级，您应该 **首先** 卸载 PIL，**然后** 安装 Pillow。

source: :class:`~django.forms.ModelForm` accepts several new ``Meta`` options.
id: :class:`~django.forms.ModelForm` menerima beberapa pilihan ``Meta`` baru.
zh_hans: :class:`~django.forms.ModelForm` 接受了一些新的 ``Meta`` 选项。

source: Fields included in the ``localized_fields`` list will be localized (by setting ``localize`` on the form field).
id: Bidang-bidang disertakan dalam daftar ``localized_fields`` akan dilokalkan (dengan menyetel ``localize`` pada bidang formulir).
zh_hans: 包含在 ``localized_fields`` 列表中的字段将会本地化（通过在表单字段上设置 ``localize``）。

source: The ``labels``, ``help_texts`` and ``error_messages`` options may be used to customize the default fields, see :ref:`modelforms-overriding-default-fields` for details.
id: Pilihan ``labels``, ``help_texts`` dan ``error_messages`` mungkin digunakan untuk menyesuaikan bidang awalan, lihat :ref:`modelforms-overriding-default-fields` untuk rincian.
zh_hans: ``labels``、``help_texts`` 和 ``error_messages`` 选项可以用来自定义默认字段，请参阅 :ref:`modelforms-overriding-default-fields` 获取详细信息。

source: The ``choices`` argument to model fields now accepts an iterable of iterables instead of requiring an iterable of lists or tuples.
id: Argumen ``choices`` pada bidang model sekarang menerima sebuah perulangan dari perulangan sebagai gantinya membutuhkan sebuah perulangan dari daftar atau tuple.
zh_hans: 模型字段的 ``choices`` 参数现在接受一个可迭代的可迭代对象，而不是需要一个列表或元组的可迭代对象。

source: The reason phrase can be customized in HTTP responses using :attr:`~django.http.HttpResponse.reason_phrase`.
id: Alasan frase dapat disesuaikan di tanggapan HTTP menggunakan :attr:`~django.http.HttpResponse.reason_phrase`.
zh_hans: 可以使用 :attr:`~django.http.HttpResponse.reason_phrase` 来自定义 HTTP 响应的原因短语。

source: When giving the URL of the next page for ``django.contrib.auth.views.logout()``, ``django.contrib.auth.views.password_reset()``, ``django.contrib.auth.views.password_reset_confirm()``, and ``django.contrib.auth.views.password_change()``, you can now pass URL names and they will be resolved.
zh_hans: 在为 ``django.contrib.auth.views.logout()``、``django.contrib.auth.views.password_reset()``、``django.contrib.auth.views.password_reset_confirm()`` 和 ``django.contrib.auth.views.password_change()`` 提供下一页的 URL 时，现在可以传递 URL 名称，并将其解析。

source: The new :option:`dumpdata --pks` option specifies the primary keys of objects to dump. This option can only be used with one model.
id: Pilihan :option:`dumpdata --pks` baru menentukan primary key dari obyek untuk membuang. Pilihan ini dapat hanya digunakan dengan satu model.
zh_hans: 新的 :option:`dumpdata --pks` 选项指定要转储的对象的主键。此选项只能与一个模型一起使用。

source: Added ``QuerySet`` methods :meth:`~django.db.models.query.QuerySet.first` and :meth:`~django.db.models.query.QuerySet.last` which are convenience methods returning the first or last object matching the filters. Returns ``None`` if there are no objects matching.
id: Ditambahkan metode ``QuerySet`` :meth:`~django.db.models.query.QuerySet.first` dan :meth:`~django.db.models.query.QuerySet.last` yang metode kenyamanan mengembalikan obyek pertama atau terakhir mencocokkan saringan. Mengembalikan ``None`` jika tidak ada pencocokan obyek.
zh_hans: 新增了 ``QuerySet`` 方法 :meth:`~django.db.models.query.QuerySet.first` 和 :meth:`~django.db.models.query.QuerySet.last`，这些是返回与过滤条件匹配的第一个或最后一个对象的便利方法。如果没有匹配的对象，则返回 ``None``。

source: :class:`~django.views.generic.base.View` and :class:`~django.views.generic.base.RedirectView` now support HTTP ``PATCH`` method.
id: :class:`~django.views.generic.base.View` dan :class:`~django.views.generic.base.RedirectView` sekarang mendukung metode HTTP ``PATCH``.
zh_hans: :class:`~django.views.generic.base.View` 和 :class:`~django.views.generic.base.RedirectView` 现在支持 HTTP ``PATCH`` 方法。

source: ``GenericForeignKey`` now takes an optional ``for_concrete_model`` argument, which when set to ``False`` allows the field to reference proxy models. The default is ``True`` to retain the old behavior.
id: ``GenericForeignKey`` sekarang mengambil sebuah pilihan argumen ``for_concrete_model``, yang ketika disetel ke ``False`` mengizinkan bidang untuk mengacu model proxy. Awalan adalah ``True`` untuk memelihara perilaku lama.
zh_hans: ``GenericForeignKey`` 现在接受一个可选的 ``for_concrete_model`` 参数，当设置为 ``False`` 时，允许字段引用代理模型。默认值为 ``True``，以保留旧的行为。

source: The :class:`~django.middleware.locale.LocaleMiddleware` now stores the active language in session if it is not present there. This prevents loss of language settings after session flush, e.g. logout.
id: :class:`~django.middleware.locale.LocaleMiddleware` sekarang menyimpan bahasa aktif di sesi jika itu tidak hadir disana. Ini mencegah kehilangan dari pengaturan bahasa setelah menyiram sesi, sebagai contoh keluar.
zh_hans: :class:`~django.middleware.locale.LocaleMiddleware` 现在如果活动语言不在会话中，则会将其存储在会话中。这可以防止在会话刷新后（例如注销）丢失语言设置。

source: :exc:`~django.core.exceptions.SuspiciousOperation` has been differentiated into a number of subclasses, and each will log to a matching named logger under the ``django.security`` logging hierarchy. Along with this change, a ``handler400`` mechanism and default view are used whenever a ``SuspiciousOperation`` reaches the WSGI handler to return an ``HttpResponseBadRequest``.
id: :exc:`~django.core.exceptions.SuspiciousOperation` telah dibedakan menjadi sejumlah subkelas, dan setiap akan masuk untuk mencocokan pencatat bernama dibawah hirarki pencatatan ``django.security``. Bersama dengan perubahan ini, sebuah mekanisme ``handler400`` dan tampilan awal digunakan ketika kapanpun ``SuspiciousOperation`` mencapai penangan WSGI untuk mengembalikan sebuah ``HttpResponseBadRequest``.
zh_hans: :exc:`~django.core.exceptions.SuspiciousOperation` 被细分为多个子类，并且每个子类都会记录到与 ``django.security`` 日志层次结构下的匹配命名的记录器中。随着这个变化，每当一个 ``SuspiciousOperation`` 到达 WSGI 处理程序以返回一个 ``HttpResponseBadRequest`` 时，将使用 ``handler400`` 机制和默认视图。

source: The :exc:`~django.db.models.Model.DoesNotExist` exception now includes a message indicating the name of the attribute used for the lookup.
id: Pengecualian :exc:`~django.db.models.Model.DoesNotExist` sekarang menyertakan sebuah pesan yang menunjukkan nama dari atribut digunakan untuk pencarian.
zh_hans: :exc:`~django.db.models.Model.DoesNotExist` 异常现在包含一个消息，指示用于查找的属性的名称。

source: The :meth:`~django.db.models.query.QuerySet.get_or_create` method no longer requires at least one keyword argument.
id: Metode :meth:`~django.db.models.query.QuerySet.get_or_create` tidak lagi membutuhkan setidaknya satu argumen katakunci.
zh_hans: :meth:`~django.db.models.query.QuerySet.get_or_create` 方法不再需要至少一个关键字参数。

source: The :class:`~django.test.SimpleTestCase` class includes a new assertion helper for testing formset errors: ``django.test.SimpleTestCase.assertFormsetError()``.
zh_hans: :class:`~django.test.SimpleTestCase` 类包括一个用于测试表单集错误的新断言助手：``django.test.SimpleTestCase.assertFormsetError()``。

source: The list of related fields added to a :class:`~django.db.models.query.QuerySet` by :meth:`~django.db.models.query.QuerySet.select_related` can be cleared using ``select_related(None)``.
id: Daftar dari bidang-bidang terkait ditambahkan pada :class:`~django.db.models.query.QuerySet` oleh :meth:`~django.db.models.query.QuerySet.select_related` dapat dibersihkan menggunakan ``select_related(None)``.
zh_hans: 通过 :meth:`~django.db.models.query.QuerySet.select_related` 添加到 :class:`~django.db.models.query.QuerySet` 的相关字段列表可以使用 ``select_related(None)`` 清除。

source: The :meth:`~django.contrib.admin.InlineModelAdmin.get_extra` and :meth:`~django.contrib.admin.InlineModelAdmin.get_max_num` methods on :class:`~django.contrib.admin.InlineModelAdmin` may be overridden to customize the extra and maximum number of inline forms.
id: Metode :meth:`~django.contrib.admin.InlineModelAdmin.get_extra` dan :meth:`~django.contrib.admin.InlineModelAdmin.get_max_num` pada :class:`~django.contrib.admin.InlineModelAdmin` mungkin dikesampingkan untuk menyesuaikan jumlah tambahan dan maksimal dari formulir berderet.
zh_hans: :class:`~django.contrib.admin.InlineModelAdmin` 上的 :meth:`~django.contrib.admin.InlineModelAdmin.get_extra` 和 :meth:`~django.contrib.admin.InlineModelAdmin.get_max_num` 方法可以被覆盖，以自定义内联表单的额外和最大数量。

source: Formsets now have a :meth:`~django.forms.formsets.BaseFormSet.total_error_count` method.
id: Formset sekarang mempunyai sebuah metode :meth:`~django.forms.formsets.BaseFormSet.total_error_count`.
zh_hans: 现在，表单集具有一个 :meth:`~django.forms.formsets.BaseFormSet.total_error_count` 方法。

source: :class:`~django.forms.ModelForm` fields can now override error messages defined in model fields by using the :attr:`~django.forms.Field.error_messages` argument of a ``Field``’s constructor. To take advantage of this new feature with your custom fields, :ref:`see the updated recommendation <raising-validation-error>` for raising a ``ValidationError``.
zh_hans: :class:`~django.forms.ModelForm` 字段现在可以使用 ``Field`` 构造函数的 :attr:`~django.forms.Field.error_messages` 参数覆盖模型字段中定义的错误消息。要利用这个新特性来自定义字段，请参阅 :ref:`更新的建议 <raising-validation-error>` 来引发 ``ValidationError``。
