Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The new test :class:`~django.test.Client` argument ``raise_request_exception`` allows controlling whether or not exceptions raised during the request should also be raised in the test. The value defaults to ``True`` for backwards compatibility. If it is ``False`` and an exception occurs, the test client will return a 500 response with the attribute :attr:`~django.test.Response.exc_info`, a tuple providing information of the exception that occurred.
zh_hans: 新的测试 :class:`~django.test.Client` 参数 ``raise_request_exception`` 允许控制请求期间引发的异常是否也应该在测试中引发。默认情况下，该值为 ``True``，以保持向后兼容性。如果它为 ``False`` 并且发生异常，测试客户端将返回一个带有属性 :attr:`~django.test.Response.exc_info` 的 500 响应，该属性是一个元组，提供了发生的异常信息。

source: Tests and test cases to run can be selected by test name pattern using the new :option:`test -k` option.
zh_hans: 可以使用新的 :option:`test -k` 选项通过测试名称模式选择要运行的测试和测试用例。

source: HTML comparison, as used by :meth:`~django.test.SimpleTestCase.assertHTMLEqual`, now treats text, character references, and entity references that refer to the same character as equivalent.
zh_hans: HTML 比较，如 :meth:`~django.test.SimpleTestCase.assertHTMLEqual` 所使用的，现在将相同字符引用的文本、字符引用和实体引用视为等效。

source: Backwards incompatible changes in 3.0
zh_hans: 3.0 版本中的不向后兼容的更改。

source: ``Model.save()`` when providing a default for the primary key
zh_hans: 在提供主键默认值时，使用 ``Model.save()``

source: :meth:`.Model.save` no longer attempts to find a row when saving a new ``Model`` instance and a default value for the primary key is provided, and always performs a single ``INSERT`` query. In older Django versions, ``Model.save()`` performed either an ``INSERT`` or an ``UPDATE`` based on whether or not the row exists.
zh_hans: :meth:`.Model.save` 在保存新的 ``Model`` 实例并提供主键的默认值时不再尝试查找行，而总是执行单个 ``INSERT`` 查询。在较早的 Django 版本中，``Model.save()`` 根据行是否存在执行了 ``INSERT`` 或 ``UPDATE``。

source: This makes calling ``Model.save()`` while providing a default primary key value equivalent to passing :ref:`force_insert=True <ref-models-force-insert>` to model's ``save()``. Attempts to use a new ``Model`` instance to update an existing row will result in an ``IntegrityError``.
zh_hans: 这使得在提供默认主键值的情况下调用 ``Model.save()`` 等效于将 :ref:`force_insert=True <ref-models-force-insert>` 传递给模型的 ``save()``。尝试使用新的 ``Model`` 实例更新现有行将导致 ``IntegrityError``。

source: In order to update an existing model for a specific primary key value, use the :meth:`~django.db.models.query.QuerySet.update_or_create` method or ``QuerySet.filter(pk=…).update(…)`` instead. For example:
zh_hans: 要更新特定主键值的现有模型，请使用 :meth:`~django.db.models.query.QuerySet.update_or_create` 方法或 ``QuerySet.filter(pk=…).update(…)``。例如：

source: The second argument of ``DatabaseIntrospection.get_geometry_type()`` is now the row description instead of the column name.
zh_hans: ``DatabaseIntrospection.get_geometry_type()`` 的第二个参数现在是行描述而不是列名。

source: ``DatabaseIntrospection.get_field_type()`` may no longer return tuples.
zh_hans: ``DatabaseIntrospection.get_field_type()`` 可能不再返回元组。

source: If the database can create foreign keys in the same SQL statement that adds a field, add ``SchemaEditor.sql_create_column_inline_fk`` with the appropriate SQL; otherwise, set ``DatabaseFeatures.can_create_inline_fk = False``.
zh_hans: 如果数据库可以在添加字段的同一 SQL 语句中创建外键，请添加适当的 SQL 到 ``SchemaEditor.sql_create_column_inline_fk``；否则，请设置 ``DatabaseFeatures.can_create_inline_fk = False``。

source: ``DatabaseFeatures.can_return_id_from_insert`` and ``can_return_ids_from_bulk_insert`` are renamed to ``can_return_columns_from_insert`` and ``can_return_rows_from_bulk_insert``.
zh_hans: ``DatabaseFeatures.can_return_id_from_insert`` 和 ``can_return_ids_from_bulk_insert`` 已更名为 ``can_return_columns_from_insert`` 和 ``can_return_rows_from_bulk_insert``。

source: Database functions now handle :class:`datetime.timezone` formats when created using :class:`datetime.timedelta` instances (e.g. ``timezone(timedelta(hours=5))``, which would output ``'UTC+05:00'``). Third-party backends should handle this format when preparing :class:`~django.db.models.DateTimeField` in ``datetime_cast_date_sql()``, ``datetime_extract_sql()``, etc.
zh_hans: 数据库函数现在在使用 :class:`datetime.timedelta` 实例创建时处理 :class:`datetime.timezone` 格式（例如 ``timezone(timedelta(hours=5))``，这将输出 ``'UTC+05:00'``）。第三方后端应在准备 :class:`~django.db.models.DateTimeField` 的 ``datetime_cast_date_sql()``、``datetime_extract_sql()`` 等时处理这种格式。

source: Entries for ``AutoField``, ``BigAutoField``, and ``SmallAutoField`` are added to ``DatabaseOperations.integer_field_ranges`` to support the integer range validators on these field types. Third-party backends may need to customize the default entries.
zh_hans: 为了支持这些字段类型上的整数范围验证器，已经将 ``AutoField``、``BigAutoField`` 和 ``SmallAutoField`` 的条目添加到 ``DatabaseOperations.integer_field_ranges`` 中。第三方后端可能需要自定义默认条目。

source: ``DatabaseOperations.fetch_returned_insert_id()`` is replaced by ``fetch_returned_insert_columns()`` which returns a list of values returned by the ``INSERT … RETURNING`` statement, instead of a single value.
zh_hans: ``DatabaseOperations.fetch_returned_insert_id()`` 已被替换为 ``fetch_returned_insert_columns()``，它返回由 ``INSERT … RETURNING`` 语句返回的值列表，而不是单个值。

source: ``DatabaseOperations.return_insert_id()`` is replaced by ``return_insert_columns()`` that accepts a ``fields`` argument, which is an iterable of fields to be returned after insert. Usually this is only the auto-generated primary key.
zh_hans: ``DatabaseOperations.return_insert_id()`` 已被替换为 ``return_insert_columns()``，它接受一个 ``fields`` 参数，该参数是要在插入后返回的字段的可迭代对象。通常这只是自动生成的主键。

source: Admin's model history change messages now prefers more readable field labels instead of field names.
zh_hans: 管理者模型历史更改消息现在更偏向于使用可读性更高的字段标签，而不是字段名称。

source: Support for PostGIS 2.1 is removed.
zh_hans: 不再支持 PostGIS 2.1 。

source: Support for SpatiaLite 4.1 and 4.2 is removed.
zh_hans: 不再支持 SpatiaLite 4.1 和 4.2 。

source: Support for GDAL 1.11 and GEOS 3.4 is removed.
zh_hans: 不再支持 GDAL 1.11 和 GEOS 3.4 。

source: Dropped support for PostgreSQL 9.4
zh_hans: 不再支持 PostgreSQL 9.4 。

source: Upstream support for PostgreSQL 9.4 ends in December 2019. Django 3.0 supports PostgreSQL 9.5 and higher.
zh_hans: 上游对于 PostgreSQL 9.4 的支持在 2019 年 12 月结束。 Django 3.0 支持 PostgreSQL 9.5 及更高版本。

source: Dropped support for Oracle 12.1
zh_hans: 不再支持 Oracle 12.1 。

source: Upstream support for Oracle 12.1 ends in July 2021. Django 2.2 will be supported until April 2022. Django 3.0 officially supports Oracle 12.2 and 18c.
zh_hans: Oracle 12.1 的上游支持将于 2021 年 7 月结束。 Django 2.2 将支持至 2022 年 4 月。 Django 3.0 正式支持 Oracle 12.2 和 18c 版本。

source: Removed private Python 2 compatibility APIs
zh_hans: 移除了私有的 Python 2 兼容 API 。

source: While Python 2 support was removed in Django 2.0, some private APIs weren't removed from Django so that third party apps could continue using them until the Python 2 end-of-life.
zh_hans: 尽管在 Django 2.0 中移除了对 Python 2 的支持，但某些私有 API 未被移除，以便第三方应用程序在 Python 2 生命周期结束之前仍可继续使用它们。

source: Since we expect apps to drop Python 2 compatibility when adding support for Django 3.0, we're removing these APIs at this time.
zh_hans: 由于我们预计在添加对 Django 3.0 的支持时，应用程序将放弃对 Python 2 的兼容性，因此我们此时正在移除这些 API 。

source: ``django.test.utils.str_prefix()`` - Strings don't have 'u' prefixes in Python 3.
zh_hans: ``django.test.utils.str_prefix()`` - 在 Python 3 中，字符串不再具有 'u' 前缀。

source: ``django.test.utils.patch_logger()`` - Use :meth:`unittest.TestCase.assertLogs` instead.
zh_hans: ``django.test.utils.patch_logger()`` - 请改用 :meth:`unittest.TestCase.assertLogs`。

source: ``django.utils.lru_cache.lru_cache()`` - Alias of :func:`functools.lru_cache`.
zh_hans: ``django.utils.lru_cache.lru_cache()`` - 是 :func:`functools.lru_cache` 的别名。

source: ``django.utils.decorators.available_attrs()`` - This function returns ``functools.WRAPPER_ASSIGNMENTS``.
zh_hans: ``django.utils.decorators.available_attrs()`` - 此函数返回 ``functools.WRAPPER_ASSIGNMENTS``。

source: ``django.utils.decorators.ContextDecorator`` - Alias of :class:`contextlib.ContextDecorator`.
zh_hans: ``django.utils.decorators.ContextDecorator`` - 是 :class:`contextlib.ContextDecorator` 的别名。

source: ``django.utils._os.abspathu()`` - Alias of :func:`os.path.abspath`.
zh_hans: ``django.utils._os.abspathu()`` - 是 :func:`os.path.abspath` 的别名。

source: ``django.utils._os.upath()`` and ``npath()`` - These functions do nothing on Python 3.
zh_hans: ``django.utils._os.upath()`` 和 ``npath()`` - 在 Python 3 上不执行任何操作。

source: ``django.utils.six`` - Remove usage of this vendored library or switch to :pypi:`six`.
zh_hans: ``django.utils.six`` - 移除对此库的使用或切换到 :pypi:`six`。

source: ``django.utils.encoding.python_2_unicode_compatible()`` - Alias of ``six.python_2_unicode_compatible()``.
zh_hans: ``django.utils.encoding.python_2_unicode_compatible()`` - 是 ``six.python_2_unicode_compatible()`` 的别名。

source: ``django.utils.functional.curry()`` - Use :func:`functools.partial` or :class:`functools.partialmethod`. See :commit:`5b1c389603a353625ae1603ba345147356336afb`.
zh_hans: ``django.utils.functional.curry()`` - 请使用 :func:`functools.partial` 或 :class:`functools.partialmethod`。请参阅 :commit:`5b1c389603a353625ae1603ba345147356336afb`。

source: ``django.utils.safestring.SafeBytes`` - Unused since Django 2.0.
zh_hans: ``django.utils.safestring.SafeBytes`` - 自 Django 2.0 起未使用。

source: New default value for the ``FILE_UPLOAD_PERMISSIONS`` setting
zh_hans: ``FILE_UPLOAD_PERMISSIONS`` 设置的新默认值。

source: In older versions, the :setting:`FILE_UPLOAD_PERMISSIONS` setting defaults to ``None``. With the default :setting:`FILE_UPLOAD_HANDLERS`, this results in uploaded files having different permissions depending on their size and which upload handler is used.
zh_hans: 在较早的版本中，:setting:`FILE_UPLOAD_PERMISSIONS` 设置的默认值为 ``None``。在默认的:setting:`FILE_UPLOAD_HANDLERS` 的情况下，这导致上传的文件根据其大小和使用的上传处理程序而具有不同的权限。

source: ``FILE_UPLOAD_PERMISSIONS`` now defaults to ``0o644`` to avoid this inconsistency.
zh_hans: 现在，默认情况下，``FILE_UPLOAD_PERMISSIONS`` 默认为 ``0o644``，以避免这种不一致性。

source: New default values for security settings
zh_hans: 安全设置的新默认值。

source: To make Django projects more secure by default, some security settings now have more secure default values:
zh_hans: 为了使 Django 项目在默认情况下更加安全，一些安全设置现在具有更安全的默认值：

source: :setting:`X_FRAME_OPTIONS` now defaults to ``'DENY'``.
zh_hans: :setting:`X_FRAME_OPTIONS` 现在默认为 ``'DENY'``。

source: :setting:`SECURE_CONTENT_TYPE_NOSNIFF` now defaults to ``True``.
zh_hans: :setting:`SECURE_CONTENT_TYPE_NOSNIFF` 现在默认为 ``True``。

source: See the *What's New* :ref:`Security section <whats-new-security-3.0>` above for more details on these changes.
zh_hans: 有关这些更改的更多详细信息，请参阅上面的 *What's New* :ref:`Security section <whats-new-security-3.0>`。

source: ``ContentType.__str__()`` now includes the model's ``app_label`` to disambiguate models with the same name in different apps.
zh_hans: ``ContentType.__str__()`` 现在包括模型的 ``app_label`` 以消除在不同应用程序中具有相同名称的模型的歧义。

source: Because accessing the language in the session rather than in the cookie is deprecated, ``LocaleMiddleware`` no longer looks for the user's language in the session and :func:`django.contrib.auth.logout` no longer preserves the session's language after logout.
zh_hans: 由于已弃用在 cookie 中而不是会话中访问语言，因此 ``LocaleMiddleware`` 不再在会话中查找用户的语言，而 :func:`django.contrib.auth.logout` 在注销后不再保留会话的语言。

source: :func:`django.utils.html.escape` now uses :func:`html.escape` to escape HTML. This converts ``'`` to ``&#x27;`` instead of the previous equivalent decimal code ``&#39;``.
zh_hans: :func:`django.utils.html.escape` 现在使用 :func:`html.escape` 来转义 HTML。这会将 ``'`` 转换为 ``&#x27;``，而不是以前的等效十进制代码 ``&#39;``。

source: The ``django-admin test -k`` option now works as the :option:`unittest -k<unittest.-k>` option rather than as a shortcut for ``--keepdb``.
zh_hans: ``django-admin test -k`` 选项现在与 :option:`unittest -k<unittest.-k>` 选项一样工作，而不再作为 ``--keepdb`` 的快捷方式。

source: Support for ``pywatchman`` < 1.2.0 is removed.
zh_hans: 对于 ``pywatchman`` 版本低于 1.2.0 的支持已被移除。

source: :func:`~django.utils.http.urlencode` now encodes iterable values as they are when ``doseq=False``, rather than iterating them, bringing it into line with the standard library :func:`urllib.parse.urlencode` function.
zh_hans: 在 ``doseq=False`` 时，:func:`~django.utils.http.urlencode` 现在会像标准库的 :func:`urllib.parse.urlencode` 函数一样，将可迭代的值按原样编码，而不是迭代它们。

source: ``intword`` template filter now translates ``1.0`` as a singular phrase and all other numeric values as plural. This may be incorrect for some languages.
zh_hans: ``intword`` 模板过滤器现在将 ``1.0`` 翻译为单数短语，将所有其他数值视为复数。这对某些语言可能不正确。

source: Assigning a value to a model's :class:`~django.db.models.ForeignKey` or :class:`~django.db.models.OneToOneField` ``'_id'`` attribute now unsets the corresponding field. Accessing the field afterward will result in a query.
zh_hans: 给模型的 :class:`~django.db.models.ForeignKey` 或 :class:`~django.db.models.OneToOneField` 的 ``'_id'`` 属性分配一个值现在会取消对应字段的设置。之后访问该字段将导致查询。

source: :func:`~django.utils.cache.patch_vary_headers` now handles an asterisk ``'*'`` according to :rfc:`7231#section-7.1.4`, i.e. if a list of header field names contains an asterisk, then the ``Vary`` header will consist of a single asterisk ``'*'``.
zh_hans: :func:`~django.utils.cache.patch_vary_headers` 现在按照 :rfc:`7231#section-7.1.4` 处理星号 ``'*'``，即如果标头字段名称列表包含星号，则 ``Vary`` 标头将包含单个星号 ``'*'``。

source: On MySQL 8.0.16+, ``PositiveIntegerField`` and ``PositiveSmallIntegerField`` now include a check constraint to prevent negative values in the database.
zh_hans: 在 MySQL 8.0.16+ 上，``PositiveIntegerField`` 和 ``PositiveSmallIntegerField`` 现在包括一个检查约束，以防止数据库中出现负值。

source: ``alias=None`` is added to the signature of :meth:`.Expression.get_group_by_cols`.
zh_hans: ``alias=None`` 已添加到 :meth:`.Expression.get_group_by_cols` 的签名中。

source: ``RegexPattern``, used by :func:`~django.urls.re_path`, no longer returns keyword arguments with ``None`` values to be passed to the view for the optional named groups that are missing.
zh_hans: ``RegexPattern``，由 :func:`~django.urls.re_path` 使用，不再返回带有 ``None`` 值的关键字参数，以便传递给视图，用于缺少的可选命名组。

source: Features deprecated in 3.0
zh_hans: 在 3.0 中被废弃的功能

source: ``django.utils.encoding.force_text()`` and ``smart_text()``
zh_hans: ``django.utils.encoding.force_text()`` 和 ``smart_text()``

source: The ``smart_text()`` and ``force_text()`` aliases (since Django 2.0) of ``smart_str()`` and ``force_str()`` are deprecated. Ignore this deprecation if your code supports Python 2 as the behavior of ``smart_str()`` and ``force_str()`` is different there.
zh_hans: ``smart_text()`` 和 ``force_text()`` 别名（自 Django 2.0 起）的 ``smart_str()`` 和 ``force_str()`` 已被弃用。如果您的代码支持 Python 2，请忽略此弃用，因为在 Python 2 中，``smart_str()`` 和 ``force_str()`` 的行为是不同的。

source: ``django.utils.http.urlquote()``, ``urlquote_plus()``, ``urlunquote()``, and ``urlunquote_plus()`` are deprecated in favor of the functions that they're aliases for: :func:`urllib.parse.quote`, :func:`~urllib.parse.quote_plus`, :func:`~urllib.parse.unquote`, and :func:`~urllib.parse.unquote_plus`.
zh_hans: ``django.utils.http.urlquote()``, ``urlquote_plus()``, ``urlunquote()``, 和 ``urlunquote_plus()`` 已被弃用，建议使用它们的别名函数：:func:`urllib.parse.quote`, :func:`~urllib.parse.quote_plus`, :func:`~urllib.parse.unquote`, 和 :func:`~urllib.parse.unquote_plus`。

source: ``django.utils.translation.ugettext()``, ``ugettext_lazy()``, ``ugettext_noop()``, ``ungettext()``, and ``ungettext_lazy()`` are deprecated in favor of the functions that they're aliases for: :func:`django.utils.translation.gettext`, :func:`~django.utils.translation.gettext_lazy`, :func:`~django.utils.translation.gettext_noop`, :func:`~django.utils.translation.ngettext`, and :func:`~django.utils.translation.ngettext_lazy`.
zh_hans: ``django.utils.translation.ugettext()``, ``ugettext_lazy()``, ``ugettext_noop()``, ``ungettext()``, 和 ``ungettext_lazy()`` 已被弃用，建议使用它们的别名函数：:func:`django.utils.translation.gettext`, :func:`~django.utils.translation.gettext_lazy`, :func:`~django.utils.translation.gettext_noop`, :func:`~django.utils.translation.ngettext`, 和 :func:`~django.utils.translation.ngettext_lazy`。

source: To limit creation of sessions and hence favor some caching strategies, :func:`django.views.i18n.set_language` will stop setting the user's language in the session in Django 4.0. Since Django 2.1, the language is always stored in the :setting:`LANGUAGE_COOKIE_NAME` cookie.
zh_hans: 为了限制会话的创建，从而支持某些缓存策略，在 Django 4.0 中，:func:`django.views.i18n.set_language` 将停止在会话中设置用户的语言。自 Django 2.1 起，语言始终存储在 :setting:`LANGUAGE_COOKIE_NAME` cookie 中。

source: ``django.utils.text.unescape_entities()`` is deprecated in favor of :func:`html.unescape`. Note that unlike ``unescape_entities()``, ``html.unescape()`` evaluates lazy strings immediately.
zh_hans: ``django.utils.text.unescape_entities()`` 已被弃用，建议使用 :func:`html.unescape`。请注意，与 ``unescape_entities()`` 不同，``html.unescape()`` 立即评估延迟字符串。

source: To avoid possible confusion as to effective scope, the private internal utility ``is_safe_url()`` is renamed to ``url_has_allowed_host_and_scheme()``. That a URL has an allowed host and scheme doesn't in general imply that it's "safe". It may still be quoted incorrectly, for example. Ensure to also use :func:`~django.utils.encoding.iri_to_uri` on the path component of untrusted URLs.
zh_hans: 为了避免对有效范围的可能混淆，私有的内部实用程序 ``is_safe_url()`` 被重命名为 ``url_has_allowed_host_and_scheme()``。通常情况下，一个 URL 具有允许的主机和方案并不意味着它是"安全的"。例如，它可能仍然被引用不正确。请确保在不受信任的 URL 的路径组件上也使用 :func:`~django.utils.encoding.iri_to_uri`。

source: Features removed in 3.0
zh_hans: 在 3.0 版本中删除的功能。

source: These features have reached the end of their deprecation cycle and are removed in Django 3.0.
zh_hans: 这些功能已经完成了其弃用周期，并在 Django 3.0 中被移除。

source: See :ref:`deprecated-features-2.0` for details on these changes, including how to remove usage of these features.
zh_hans: 有关这些更改的详细信息，包括如何移除对这些功能的使用，请参阅 :ref:`deprecated-features-2.0`。

source: The ``django.db.backends.postgresql_psycopg2`` module is removed.
zh_hans: ``django.db.backends.postgresql_psycopg2`` 模块已被移除。

source: ``django.shortcuts.render_to_response()`` is removed.
zh_hans: ``django.shortcuts.render_to_response()`` 已被移除。

source: The ``DEFAULT_CONTENT_TYPE`` setting is removed.
zh_hans: ``DEFAULT_CONTENT_TYPE`` 设置已被移除。

source: ``HttpRequest.xreadlines()`` is removed.
zh_hans: ``HttpRequest.xreadlines()`` 已被移除。

source: Support for the ``context`` argument of ``Field.from_db_value()`` and ``Expression.convert_value()`` is removed.
zh_hans: ``Field.from_db_value()`` 和 ``Expression.convert_value()`` 的 ``context`` 参数支持已被移除。

source: The ``field_name`` keyword argument of ``QuerySet.earliest()`` and ``latest()`` is removed.
zh_hans: ``QuerySet.earliest()`` 和 ``latest()`` 的 ``field_name`` 关键参数已被移除。

source: See :ref:`deprecated-features-2.1` for details on these changes, including how to remove usage of these features.
zh_hans: 请参阅 :ref:`deprecated-features-2.1` 以获取有关这些更改的详细信息，包括如何移除对这些功能的使用。

source: The ``ForceRHR`` GIS function is removed.
zh_hans: ``ForceRHR`` GIS 函数已被移除。

source: ``django.utils.http.cookie_date()`` is removed.
zh_hans: ``django.utils.http.cookie_date()`` 已被移除。

source: The ``staticfiles`` and ``admin_static`` template tag libraries are removed.
zh_hans: ``staticfiles`` 和 ``admin_static`` 模板标签库已被移除。

source: ``django.contrib.staticfiles.templatetags.staticfiles.static()`` is removed.
zh_hans: ``django.contrib.staticfiles.templatetags.staticfiles.static()`` 已被移除。

source: Django 3.0.1 release notes
zh_hans: Django 3.0.1 版本发行说明

source: Django 3.0.1 fixes a security issue and several bugs in 3.0.
zh_hans: Django 3.0.1 修复了 3.0 版本中的一个安全问题和几个错误。

source: Fixed a regression in Django 3.0 by restoring the ability to use Django inside Jupyter and other environments that force an async context, by adding an option to disable :ref:`async-safety` mechanism with :envvar:`DJANGO_ALLOW_ASYNC_UNSAFE` environment variable (:ticket:`31056`).
zh_hans: 通过在环境变量 :envvar:`DJANGO_ALLOW_ASYNC_UNSAFE` 中添加选项，恢复了在 Django 3.0 中修复的一个回归问题，该问题允许在 Jupyter 和其他强制启用异步上下文的环境中使用 Django，以禁用 :ref:`async-safety` 机制。 (:ticket:`31056`)。

source: Fixed a regression in Django 3.0 where ``RegexPattern``, used by :func:`~django.urls.re_path`, returned positional arguments to be passed to the view when all optional named groups were missing (:ticket:`31061`).
zh_hans: 在 Django 3.0 中修复了一个回归问题，其中 ``RegexPattern``，被 :func:`~django.urls.re_path` 使用，返回了要传递给视图的位置参数，当所有可选的命名分组都缺失时 (:ticket:`31061`)。

source: Reallowed, following a regression in Django 3.0, :class:`~django.db.models.expressions.Window` expressions to be used in conditions outside of queryset filters, e.g. in :class:`~django.db.models.expressions.When` conditions (:ticket:`31060`).
zh_hans: 在 Django 3.0 中修复了一个回归问题，现在可以重新允许在查询集过滤器之外的条件中使用 :class:`~django.db.models.expressions.Window` 表达式，例如在 :class:`~django.db.models.expressions.When` 条件中 (:ticket:`31060`)。

source: Django 3.0.10 release notes
zh_hans: Django 3.0.10 版本发行说明

source: Django 3.0.10 fixes two security issues and two data loss bugs in 3.0.9.
zh_hans: Django 3.0.10 修复了 3.0.9 版本中的两个安全问题和两个数据丢失错误。

source: Django 3.0.11 release notes
zh_hans: Django 3.0.11 版本发行说明

source: Django 3.0.11 fixes a regression in 3.0.7 and adds compatibility with Python 3.9.
zh_hans: Django 3.0.11 修复了 3.0.7 版本中的回归问题，并添加了与 Python 3.9 的兼容性。

source: Fixed a regression in Django 3.0.7 that didn't use ``Subquery()`` aliases in the ``GROUP BY`` clause (:ticket:`32152`).
zh_hans: 修正了 Django 3.0.7 中一个在 ``GROUP BY`` 子句中没有使用 ``Subquery()`` 别名的缺陷（:ticket:`32152`）。

source: Django 3.0.12 release notes
zh_hans: Django 3.0.12 版本发行说明

source: Django 3.0.12 fixes a security issue with severity "low" in 3.0.11.
zh_hans: Django 3.0.12 修复了 3.0.11 版本中一个严重程度为"低"的安全问题。

source: Django 3.0.13 release notes
zh_hans: Django 3.0.13 版本发行说明

source: Django 3.0.13 fixes a security issue in 3.0.12.
zh_hans: Django 3.0.13 修复了 3.0.12 版本中的一个安全问题。

source: Django 3.0.14 release notes
zh_hans: Django 3.0.14 版本发行说明

source: Django 3.0.14 fixes a security issue with severity "low" in 3.0.13.
zh_hans: Django 3.0.14 修复了 3.0.13 中一个严重性为 “低” 的安全问题。

source: Django 3.0.2 release notes
zh_hans: Django 3.0.2 版本发行说明

source: *January 2, 2020*
zh_hans: *2020 年 1 月 2 日*

source: Django 3.0.2 fixes several bugs in 3.0.1.
zh_hans: Django 3.0.2 修复了 3.0.1 版本中的多个错误。

source: Fixed a regression in Django 3.0 that didn't include columns referenced by a ``Subquery()`` in the ``GROUP BY`` clause (:ticket:`31094`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题没有在 ``GROUP BY`` 子句中包括由 ``Subquery()`` 引用的列 (:ticket:`31094`)。

source: Fixed a regression in Django 3.0 where ``QuerySet.exists()`` crashed if a queryset contained an aggregation over a ``Subquery()`` (:ticket:`31109`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致如果查询集中包含了对 ``Subquery()`` 进行聚合操作，那么 ``QuerySet.exists()`` 会崩溃 (:ticket:`31109`)。

source: Fixed a regression in Django 3.0 that caused a migration crash on PostgreSQL 10+ when adding a foreign key and changing data in the same migration (:ticket:`31106`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在同一迁移中添加外键并更改数据时，在 PostgreSQL 10+ 上发生迁移崩溃 (:ticket:`31106`)。

source: Fixed a regression in Django 3.0 where loading fixtures crashed for models defining a :attr:`~django.db.models.Field.default` for the primary key (:ticket:`31071`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致为定义主键的模型加载数据时崩溃，这些模型为主键定义了 :attr:`~django.db.models.Field.default` (:ticket:`31071`)。

source: Django 3.0.3 release notes
zh_hans: Django 3.0.3 版本发行说明

source: Django 3.0.3 fixes a security issue and several bugs in 3.0.2.
zh_hans: Django 3.0.3 修复了 3.0.2 版本中的一个安全问题和多个错误。

source: Fixed a regression in Django 3.0 that caused a crash when subtracting ``DateField``, ``DateTimeField``, or ``TimeField`` from a ``Subquery()`` annotation (:ticket:`31133`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在从 ``Subquery()`` 注释中减去 ``DateField``、``DateTimeField`` 或 ``TimeField`` 时崩溃 (:ticket:`31133`)。
