Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``django.contrib.postgres.fields.CIEmailField`` is deprecated in favor of ``EmailField(db_collation="…")`` with a case-insensitive non-deterministic collation.
zh_hans: ``django.contrib.postgres.fields.CIEmailField`` 已被弃用，推荐使用 ``EmailField(db_collation="…")``，并指定一个不区分大小写的非确定性排序规则(collation)。

source: ``django.contrib.postgres.fields.CITextField`` is deprecated in favor of ``TextField(db_collation="…")`` with a case-insensitive non-deterministic collation.
zh_hans: ``django.contrib.postgres.fields.CITextField`` 已被弃用，推荐使用 ``TextField(db_collation="…")``，并指定一个不区分大小写的非确定性排序规则(collation)。

source: ``django.contrib.postgres.fields.CIText`` mixin is deprecated.
zh_hans: ``django.contrib.postgres.fields.CIText`` mixin 已被弃用。

source: The ``map_height`` and ``map_width`` attributes of ``BaseGeometryWidget`` are deprecated, use CSS to size map widgets instead.
zh_hans: ``BaseGeometryWidget`` 的 ``map_height`` 和 ``map_width`` 属性已被弃用，请改用 CSS 来设置地图小部件的大小。

source: ``SimpleTestCase.assertFormsetError()`` is deprecated in favor of ``assertFormSetError()``.
zh_hans: ``SimpleTestCase.assertFormsetError()`` 已被弃用，推荐使用 ``assertFormSetError()``。

source: ``TransactionTestCase.assertQuerysetEqual()`` is deprecated in favor of ``assertQuerySetEqual()``.
zh_hans: ``TransactionTestCase.assertQuerysetEqual()`` 已被弃用，推荐使用 ``assertQuerySetEqual()``。

source: Passing positional arguments to ``Signer`` and ``TimestampSigner`` is deprecated in favor of keyword-only arguments.
zh_hans: 将位置参数传递给 ``Signer`` 和 ``TimestampSigner`` 已被弃用，推荐使用仅限关键字的参数。

source: The ``DEFAULT_FILE_STORAGE`` setting is deprecated in favor of ``STORAGES["default"]``.
zh_hans: ``DEFAULT_FILE_STORAGE`` 设置已被弃用，推荐使用 ``STORAGES["default"]``。

source: The ``STATICFILES_STORAGE`` setting is deprecated in favor of ``STORAGES["staticfiles"]``.
zh_hans: ``STATICFILES_STORAGE`` 设置已被弃用，推荐使用 ``STORAGES["staticfiles"]``。

source: The ``django.core.files.storage.get_storage_class()`` function is deprecated.
zh_hans: ``django.core.files.storage.get_storage_class()`` 函数已被弃用。

source: Django 4.2.1 release notes
zh_hans: Django 4.2.1 版本发行说明

source: Django 4.2.1 fixes a security issue with severity "low" and several bugs in 4.2.
zh_hans: Django 4.2.1 修复了一个安全问题，安全级别为 "low"，以及若干在 4.2 版本中的错误。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.defer()`` when deferring fields by attribute names (:ticket:`34458`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在使用属性名称来延迟字段时，``QuerySet.defer()`` 发生崩溃 (:ticket:`34458`)。

source: Fixed a regression in Django 4.2 that caused a crash of :class:`~django.contrib.postgres.search.SearchVector` function with ``%`` characters (:ticket:`34459`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在使用带有 ``%`` 字符的 :class:`~django.contrib.postgres.search.SearchVector` 函数时发生崩溃 (:ticket:`34459`)。

source: Fixed a regression in Django 4.2 that caused aggregation over query that uses explicit grouping to group against the wrong columns (:ticket:`34464`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在使用显式分组的查询进行聚合时，聚合作用于错误的列 (:ticket:`34464`)。

source: Reallowed, following a regression in Django 4.2, setting the ``"cursor_factory"`` option in :setting:`OPTIONS` on PostgreSQL (:ticket:`34466`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，现在可以重新设置 PostgreSQL 上的 :setting:`OPTIONS` 中的 ``"cursor_factory"`` 选项 (:ticket:`34466`)。

source: Enforced UTF-8 client encoding on PostgreSQL, following a regression in Django 4.2 (:ticket:`34470`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，现在在 PostgreSQL 上强制使用 UTF-8 客户端编码 (:ticket:`34470`)。

source: Fixed a regression in Django 4.2 where ``i18n_patterns()`` didn't respect the ``prefix_default_language`` argument when a fallback language of the default language was used (:ticket:`34455`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，``i18n_patterns()`` 在使用默认语言的回退语言时不再忽略 ``prefix_default_language`` 参数 (:ticket:`34455`)。

source: Fixed a regression in Django 4.2 where translated URLs of the default language from ``i18n_patterns()`` with ``prefix_default_language`` set to ``False`` raised 404 errors for a request with a different language (:ticket:`34515`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，当从 ``i18n_patterns()`` 使用 ``prefix_default_language`` 设置为 ``False`` 时，默认语言的翻译 URL 不再为不同语言的请求引发 404 错误 (:ticket:`34515`)。

source: Fixed a regression in Django 4.2 where creating copies and deep copies of ``HttpRequest``, ``HttpResponse``, and their subclasses didn't always work correctly (:ticket:`34482`, :ticket:`34484`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，创建 ``HttpRequest``、``HttpResponse`` 及其子类的拷贝和深拷贝并不总是正确工作的问题 (:ticket:`34482`, :ticket:`34484`)。

source: Fixed a regression in Django 4.2 where ``timesince`` and ``timeuntil`` template filters returned incorrect results for a datetime with a non-UTC timezone when a time difference is less than 1 day (:ticket:`34483`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，当时间差小于 1 天且日期时间带有非 UTC 时区时，``timesince`` 和 ``timeuntil`` 模板过滤器返回不正确的结果 (:ticket:`34483`)。

source: Fixed a regression in Django 4.2 that caused a crash of :class:`~django.contrib.postgres.search.SearchHeadline` function with ``psycopg`` 3 (:ticket:`34486`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致使用 ``psycopg`` 3 时 :class:`~django.contrib.postgres.search.SearchHeadline` 函数崩溃 (:ticket:`34486`)。

source: Fixed a regression in Django 4.2 that caused incorrect ``ClearableFileInput`` margins in the admin (:ticket:`34506`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致管理员界面中的 ``ClearableFileInput`` 边距不正确 (:ticket:`34506`)。

source: Fixed a regression in Django 4.2 where breadcrumbs didn't appear on admin site app index views (:ticket:`34512`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致管理员站点应用程序索引视图上不显示面包屑导航 (:ticket:`34512`)。

source: Made squashing migrations reduce ``AddIndex``, ``RemoveIndex``, ``RenameIndex``, and ``CreateModel`` operations which allows removing a deprecated ``Meta.index_together`` option from historical migrations and use ``Meta.indexes`` instead (:ticket:`34525`).
zh_hans: 在 Django 中进行合并迁移操作时，现在会减少 ``AddIndex``、``RemoveIndex``、``RenameIndex`` 和 ``CreateModel`` 操作，这允许从历史迁移中移除已弃用的 ``Meta.index_together`` 选项，而改为使用 ``Meta.indexes`` (:ticket:`34525`)。

source: Django 4.2.10 release notes
zh_hans: Django 4.2.10 版本发行说明

source: Django 4.2.10 fixes a security issue with severity "moderate" in 4.2.9.
zh_hans: Django 4.2.10 修复了 4.2.9 版本中一个"中等"严重性的安全问题。

source: Django 4.2.11 release notes
zh_hans: Django 4.2.11 版本发行说明

source: Django 4.2.11 fixes a security issue with severity "moderate" and a regression in 4.2.10.
zh_hans: Django 4.2.11 修复了一些"中等"严重性的安全问题，以及 4.2.10 版本中的一个错误。

source: Fixed a regression in Django 4.2.10 where ``intcomma`` template filter could return a leading comma for string representation of floats (:ticket:`35172`).
zh_hans: 修复了 Django 4.2.10 中的一个回归问题，即 ``intcomma`` 模板过滤器可能在浮点数的字符串表示中返回一个前导逗号（:ticket:`35172`）。

source: Django 4.2.12 release notes
zh_hans: Django 4.2.12 版本发行说明

source: *May 6, 2024*
zh_hans: *2024 年 5 月 6 日*

source: Django 4.2.12 fixes a compatibility issue with Python 3.11.9+ and 3.12.3+.
zh_hans: Django 4.2.12修复了在Python 3.11.9+ 和3.12.3+上使用的可用性问题

source: Fixed a crash in Django 4.2 when validating email max line lengths with content decoded using the ``surrogateescape`` error handling scheme (:ticket:`35361`).
zh_hans: 修复了 Django 4.2 中使用“surrogateescape”错误处理方案（:ticket:`35361`）解码的内容验证电子邮件最大行长度时发生的崩溃。

source: Django 4.2.13 release notes
zh_hans: Django 4.2.13 版本发行说明

source: *May 7, 2024*
zh_hans: *2024 年 5 月 7 日*

source: Django 4.2.13 fixes a packaging error in 4.2.12.
zh_hans: Django 4.2.13 修复了 4.2.12 版本中的一个打包错误。

source: Django 4.2.2 release notes
zh_hans: Django 4.2.2 版本发行说明

source: *June 5, 2023*
zh_hans: *2023 年 6 月 5 日*

source: Django 4.2.2 fixes several bugs in 4.2.1.
zh_hans: Django 4.2.2 修复了 4.2.1 版本中的一些错误。

source: Fixed a regression in Django 4.2 that caused an unnecessary ``DBMS_LOB.SUBSTR()`` wrapping in the ``__isnull`` and ``__exact=None`` lookups for ``TextField()``/``BinaryField()`` on Oracle (:ticket:`34544`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在 Oracle 上的 ``TextField()``/``BinaryField()`` 上使用 ``__isnull`` 和 ``__exact=None`` 查找时出现不必要的 ``DBMS_LOB.SUBSTR()`` 包装 (:ticket:`34544`)。

source: Restored, following a regression in Django 4.2, ``get_prep_value()`` call in ``JSONField`` subclasses (:ticket:`34539`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，恢复了 ``JSONField`` 子类中的 ``get_prep_value()`` 调用 (:ticket:`34539`)。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.defer()`` when passing a ``ManyToManyField`` or ``GenericForeignKey`` reference. While doing so is a no-op, it was allowed in older version (:ticket:`34570`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在传递 ``ManyToManyField`` 或 ``GenericForeignKey`` 引用时，``QuerySet.defer()`` 发生崩溃。虽然这是一个无操作，但在较旧的版本中允许这样做 (:ticket:`34570`)。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.only()`` when passing a reverse ``OneToOneField`` reference (:ticket:`34612`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在传递反向 ``OneToOneField`` 引用时，``QuerySet.only()`` 发生崩溃 (:ticket:`34612`)。

source: Fixed a bug in Django 4.2 where :option:`makemigrations --update` didn't respect the ``--name`` option (:ticket:`34568`).
zh_hans: 在 Django 4.2 中修复了一个 bug，该 bug 导致 :option:`makemigrations --update` 不会考虑 ``--name`` 选项 (:ticket:`34568`)。

source: Fixed a performance regression in Django 4.2 when compiling queries without ordering (:ticket:`34580`).
zh_hans: 在 Django 4.2 中修复了一个性能回归问题，当编译没有排序的查询时会有性能问题 (:ticket:`34580`)。

source: Fixed a regression in Django 4.2 where nonexistent stylesheet was linked on a “Congratulations!” page (:ticket:`34588`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在“恭喜！”页面上链接了不存在的样式表 (:ticket:`34588`)。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.aggregate()`` with expressions referencing other aggregates (:ticket:`34551`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在引用其他聚合的表达式中使用 ``QuerySet.aggregate()`` 时发生崩溃 (:ticket:`34551`)。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.aggregate()`` with aggregates referencing subqueries (:ticket:`34551`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在引用子查询的聚合中使用 ``QuerySet.aggregate()`` 时发生崩溃 (:ticket:`34551`)。

source: Fixed a regression in Django 4.2 that caused a crash of querysets on SQLite when filtering on ``DecimalField`` against values outside of the defined range (:ticket:`34590`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在 SQLite 上对 ``DecimalField`` 进行过滤时，当值超出定义范围时，查询集发生崩溃 (:ticket:`34590`)。

source: Fixed a regression in Django 4.2 that caused a serialization crash on a ``ManyToManyField`` without a natural key when its ``Manager``’s base ``QuerySet`` used ``select_related()`` (:ticket:`34620`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在没有自然键的情况下，当其 ``Manager`` 的基本 ``QuerySet`` 使用了 ``select_related()`` 时，``ManyToManyField`` 的序列化会崩溃 (:ticket:`34620`)。

source: Django 4.2.3 release notes
zh_hans: Django 4.2.3 版本发行说明

source: Django 4.2.3 fixes a security issue with severity "moderate" and several bugs in 4.2.2.
zh_hans: Django 4.2.3 修复了一些"中等"严重性的安全问题，以及 4.2.2 版本中的几个错误。

source: Fixed a regression in Django 4.2 that caused incorrect alignment of timezone warnings for ``DateField`` and ``TimeField`` in the admin (:ticket:`34645`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在管理员界面中对于 ``DateField`` 和 ``TimeField`` 的时区警告的对齐不正确 (:ticket:`34645`)。

source: Fixed a regression in Django 4.2 that caused incorrect highlighting of rows in the admin changelist view when ``ModelAdmin.list_editable`` contained a ``BooleanField`` (:ticket:`34638`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在管理员 changelist 视图中，当 ``ModelAdmin.list_editable`` 包含一个 ``BooleanField`` 时，行的高亮显示不正确 (:ticket:`34638`)。

source: Django 4.2.4 release notes
zh_hans: Django 4.2.4 版本发行说明

source: *August 1, 2023*
zh_hans: *2023 年 8 月 1 日*

source: Django 4.2.4 fixes several bugs in 4.2.3.
zh_hans: Django 4.2.4 修复了 4.2.3 版本中的一些错误。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.aggregate()`` with aggregates referencing window functions (:ticket:`34717`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在引用窗口函数的聚合中使用 ``QuerySet.aggregate()`` 时发生崩溃 (:ticket:`34717`)。

source: Fixed a regression in Django 4.2 that caused a crash when grouping by a reference in a subquery (:ticket:`34748`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在子查询中按引用进行分组时发生崩溃 (:ticket:`34748`)。

source: Fixed a regression in Django 4.2 that caused aggregation over query that uses explicit grouping by multi-valued annotations to group against the wrong columns (:ticket:`34750`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在使用多值注释进行显式分组的查询上进行聚合时，聚合作用于错误的列 (:ticket:`34750`)。

source: Django 4.2.5 release notes
zh_hans: Django 4.2.5 版本发行说明

source: Django 4.2.5 fixes a security issue with severity "moderate" and several bugs in 4.2.4.
zh_hans: Django 4.2.5 修复了一个"中等"严重性的安全问题，以及 4.2.4 版本中的几个错误。

source: Fixed a regression in Django 4.2 that caused an incorrect validation of ``CheckConstraints`` on ``__isnull`` lookups against ``JSONField`` (:ticket:`34754`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在针对 ``JSONField`` 进行 ``__isnull`` 查找时，``CheckConstraints`` 的验证不正确 (:ticket:`34754`)。

source: Fixed a bug in Django 4.2 where the deprecated ``DEFAULT_FILE_STORAGE`` and ``STATICFILES_STORAGE`` settings were not synced with ``STORAGES`` (:ticket:`34773`).
zh_hans: 在 Django 4.2 中修复了一个 bug，该 bug 导致已弃用的 ``DEFAULT_FILE_STORAGE`` 和 ``STATICFILES_STORAGE`` 设置未与 ``STORAGES`` 同步 (:ticket:`34773`)。

source: Fixed a regression in Django 4.2.2 that caused an unnecessary selection of a non-nullable ``ManyToManyField`` without a natural key during serialization (:ticket:`34779`).
zh_hans: 在 Django 4.2.2 中修复了一个回归问题，该问题导致在序列化过程中不必要地选择了一个没有自然键的非空 ``ManyToManyField`` (:ticket:`34779`)。

source: Fixed a regression in Django 4.2 that caused a crash of a queryset when filtering against deeply nested ``OuterRef()`` annotations (:ticket:`34803`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在针对深度嵌套的 ``OuterRef()`` 注释进行过滤时，查询集发生崩溃 (:ticket:`34803`)。

source: Django 4.2.6 release notes
zh_hans: Django 4.2.6 版本发行说明

source: Django 4.2.6 fixes a security issue with severity "moderate" and several bugs in 4.2.5.
zh_hans: Django 4.2.6 修复了一个"中等"严重性的安全问题，以及 4.2.5 版本中的几个错误。

source: Fixed a regression in Django 4.2.5 where overriding the deprecated ``DEFAULT_FILE_STORAGE`` and ``STATICFILES_STORAGE`` settings in tests caused the main ``STORAGES`` to mutate (:ticket:`34821`).
zh_hans: 在 Django 4.2.5 中修复了一个回归问题，该问题导致在测试中覆盖已弃用的 ``DEFAULT_FILE_STORAGE`` 和 ``STATICFILES_STORAGE`` 设置会导致主要的 ``STORAGES`` 发生变化 (:ticket:`34821`)。

source: Fixed a regression in Django 4.2 that caused unnecessary casting of string based fields (``CharField``, ``EmailField``, ``TextField``, ``CICharField``, ``CIEmailField``, and ``CITextField``) used with the ``__isnull`` lookup on PostgreSQL. As a consequence, indexes using an ``__isnull`` expression or condition created before Django 4.2 wouldn't be used by the query planner, leading to a performance regression (:ticket:`34840`).
zh_hans: 在 Django 4.2 中修复了一个回归问题，该问题导致在 PostgreSQL 上使用 ``__isnull`` 查找时，对于基于字符串的字段（``CharField``、``EmailField``、``TextField``、``CICharField``、``CIEmailField`` 和 ``CITextField``）进行不必要的强制转换。因此，Django 4.2 之前创建的使用 ``__isnull`` 表达式或条件的索引不会被查询规划器使用，导致性能下降 (:ticket:`34840`)。

source: You may need to recreate such indexes created in your database with Django 4.2 to 4.2.5, as they contain unnecessary ``::text`` casting. Find candidate indexes with this query:
zh_hans: 你可能需要重新创建在 Django 4.2 到 4.2.5 中创建的这种索引，因为它们包含不必要的 ``::text`` 转换。可以使用以下查询来找到候选的索引：

source: Django 4.2.7 release notes
zh_hans: Django 4.2.7 版本发行说明

source: Django 4.2.7 fixes a security issue with severity "moderate" and several bugs in 4.2.6.
zh_hans: Django 4.2.7 修复了一个"中等"严重性的安全问题，以及 4.2.6 版本中的几个错误。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.aggregate()`` with aggregates referencing expressions containing subqueries (:ticket:`34798`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，导致 ``QuerySet.aggregate()`` 在引用包含子查询的表达式的聚合时崩溃（:ticket:`34798`）。

source: Restored, following a regression in Django 4.2, creating ``varchar/text_pattern_ops`` indexes on ``CharField`` and ``TextField`` with deterministic collations on PostgreSQL (:ticket:`34932`).
zh_hans: 恢复了在 Django 4.2 中发生的一个回归问题，可以在 PostgreSQL 上的 ``CharField`` 和 ``TextField`` 上创建具有确定性排序规则的 ``varchar/text_pattern_ops`` 索引（:ticket:`34932`）。

source: Django 4.2.8 release notes
zh_hans: Django 4.2.8 版本发行说明

source: *December 4, 2023*
zh_hans: *2023 年 12 月 4 日*

source: Django 4.2.8 fixes several bugs in 4.2.7 and adds compatibility with Python 3.12.
zh_hans: Django 4.2.8 修复了 4.2.7 中的一些错误，并与 Python 3.12 兼容。

source: Fixed a regression in Django 4.2 that caused :option:`makemigrations --check` to stop displaying pending migrations (:ticket:`34457`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，导致 :option:`makemigrations --check` 停止显示待处理的迁移（:ticket:`34457`）。

source: Fixed a regression in Django 4.2 that caused a crash of ``QuerySet.aggregate()`` with aggregates referencing other aggregates or window functions through conditional expressions (:ticket:`34975`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，导致 ``QuerySet.aggregate()`` 在聚合引用其他聚合或窗口函数通过条件表达式时崩溃（:ticket:`34975`）。

source: Fixed a regression in Django 4.2 that caused a crash when annotating a ``QuerySet`` with a ``Window`` expressions composed of a ``partition_by`` clause mixing field types and aggregation expressions (:ticket:`34987`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，该问题导致在用 ``partition_by`` 子句混合字段类型和聚合表达式组成的 ``Window`` 表达式注解 ``QuerySet`` 时发生崩溃（:ticket:`34987`）。

source: Fixed a regression in Django 4.2 where the admin's change list page had misaligned pagination links and inputs when using ``list_editable`` (:ticket:`34991`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，当使用 ``list_editable`` 时，管理的更改列表页面的分页链接和输入框对齐不当（:ticket:`34991`）。

source: Fixed a regression in Django 4.2 where checkboxes in the admin would be centered on narrower screen widths (:ticket:`34994`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，该问题导致在较窄的屏幕宽度下，管理界面中的复选框会居中显示（:ticket:`34994`）。

source: Fixed a regression in Django 4.2 that caused a crash of querysets with aggregations on MariaDB when the ``ONLY_FULL_GROUP_BY`` SQL mode was enabled (:ticket:`34992`).
zh_hans: 在启用 ``ONLY_FULL_GROUP_BY`` SQL 模式时，修复了 Django 4.2 中在 MariaDB 上出现的聚合查询集导致崩溃的回退问题（:ticket:`34992`）。

source: Fixed a regression in Django 4.2 where the admin's read-only password widget and some help texts were incorrectly aligned at tablet widths (:ticket:`34982`).
zh_hans: 在 Django 4.2 中修复了一个回退问题，其中管理的只读密码小部件和一些帮助文本在平板宽度下对齐不正确（:ticket:`34982`）。

source: Fixed a regression in Django 4.2 that caused a migration crash on SQLite when altering unsupported ``Meta.db_table_comment`` (:ticket:`35006`).
zh_hans: 修复了 Django 4.2 中的一个回归问题，该问题在 SQLite 上修改不支持的 ``Meta.db_table_comment`` 时导致迁移崩溃（:ticket:`35006`）。

source: Django 4.2.9 release notes
zh_hans: Django 4.2.9 版本发行说明

source: *January 2, 2024*
zh_hans: *2024 年 1 月 2 日*

source: Django 4.2.9 fixes a bug in 4.2.8.
zh_hans: Django 4.2.9 修复了 4.2.8 版本中的一个错误。

source: Fixed a regression in Django 4.2.8 where admin fields on the same line could overflow the page and become non-interactive (:ticket:`35012`).
zh_hans: 修复了 Django 4.2.8 中的一个回归问题，即同一行的管理字段可能会溢出页面并变得不可交互（:ticket:`35012`）。

source: Django 5.0 release notes
zh_hans: Django 5.0 版本发行说明

source: Welcome to Django 5.0!
zh_hans: 欢迎使用 Django 5.0 ！

source: These release notes cover the :ref:`new features <whats-new-5.0>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-5.0>` you'll want to be aware of when upgrading from Django 4.2 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-5.0>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-5.0>`，以及一些在从 Django 4.2 或更早版本升级时需要注意的 :ref:`不兼容变更 <backwards-incompatible-5.0>`。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-5.0>`。

source: Django 5.0 supports Python 3.10, 3.11, and 3.12. We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 5.0 支持 Python 3.10、3.11 和 3.12。我们 **强烈推荐** 并且只官方支持每个系列的最新发布版本。

source: The Django 4.2.x series is the last to support Python 3.8 and 3.9.
zh_hans: Django 4.2.x 系列是最后一个支持 Python 3.8 和 3.9 的版本。

source: Following the release of Django 5.0, we suggest that third-party app authors drop support for all versions of Django prior to 4.2. At that time, you should be able to run your package's tests using ``python -Wd`` so that deprecation warnings appear. After making the deprecation warning fixes, your app should be compatible with Django 5.0.
zh_hans: 在 Django 5.0 发布之后，我们建议第三方应用程序的作者停止对 4.2 之前的所有 Django 版本的支持。在那时，你应该能够使用 ``python -Wd`` 运行你包的测试，以便出现弃用警告。在进行弃用警告修复后，你的应用程序应该与 Django 5.0 兼容。

source: What's new in Django 5.0
zh_hans: Django 5.0 新特性

source: Facet filters in the admin
zh_hans: 管理界面中的分面过滤器

source: Facet counts are now shown for applied filters in the admin changelist when toggled on via the UI. This behavior can be changed via the new :attr:`.ModelAdmin.show_facets` attribute. For more information see :ref:`facet-filters`.
zh_hans: 在管理界面的 changelist 中，当通过 UI 切换开启时，现在会显示已应用过滤器的分面计数。此行为可以通过新的 :attr:`.ModelAdmin.show_facets` 属性进行更改。更多信息请参阅 :ref:`facet-filters`。

source: Simplified templates for form field rendering
zh_hans: 简化的表单字段渲染模板

source: Django 5.0 introduces the concept of a field group, and field group templates. This simplifies rendering of the related elements of a Django form field such as its label, widget, help text, and errors.
zh_hans: Django 5.0 引入了字段组（field group）的概念，以及字段组模板。这简化了渲染 Django 表单字段的相关元素，如标签、小部件、帮助文本和错误。

source: For example, the template below:
zh_hans: 例如，下面的模板：

source: Can now be simplified to:
zh_hans: 现在可以简化为：

source: :meth:`~django.forms.BoundField.as_field_group` renders fields with the ``"django/forms/field.html"`` template by default and can be customized on a per-project, per-field, or per-request basis. See :ref:`reusable-field-group-templates`.
zh_hans: :meth:`~django.forms.BoundField.as_field_group` 默认使用 ``"django/forms/field.html"`` 模板来渲染字段，并可以在每个项目、每个字段或每个请求的基础上进行自定义。请参阅 :ref:`reusable-field-group-templates`。

source: Database-computed default values
zh_hans: 数据库计算的默认值

source: The new :attr:`Field.db_default <django.db.models.Field.db_default>` parameter sets a database-computed default value. For example::
zh_hans: 新的 :attr:`Field.db_default <django.db.models.Field.db_default>` 参数设置了一个数据库计算的默认值。例如：

source: Database generated model field
zh_hans: 数据库生成的模型字段

source: The new :class:`~django.db.models.GeneratedField` allows creation of database generated columns. This field can be used on all supported database backends to create a field that is always computed from other fields. For example::
zh_hans: 新的 :class:`~django.db.models.GeneratedField` 允许创建数据库生成的列。此字段可用于所有支持的数据库后端，以创建一个始终从其他字段计算得到的字段。例如：

source: More options for declaring field choices
zh_hans: 声明字段选择项的更多选项

source: :attr:`.Field.choices` *(for model fields)* and :attr:`.ChoiceField.choices` *(for form fields)* allow for more flexibility when declaring their values. In previous versions of Django, ``choices`` should either be a list of 2-tuples, or an :ref:`field-choices-enum-types` subclass, but the latter required accessing the ``.choices`` attribute to provide the values in the expected form::
zh_hans: :attr:`.Field.choices` （用于模型字段）和 :attr:`.ChoiceField.choices` （用于表单字段）在声明它们的值时提供了更多的灵活性。在以前的 Django 版本中，``choices`` 应该是一个包含 2 元组的列表，或者是一个 :ref:`field-choices-enum-types` 的子类，但后者需要访问 ``.choices`` 属性以提供预期形式的值：

source: Django 5.0 adds support for accepting a mapping or a callable instead of an iterable, and also no longer requires ``.choices`` to be used directly to expand :ref:`enumeration types <field-choices-enum-types>`::
zh_hans: Django 5.0 添加了对接受映射或可调用对象的支持，而不是可迭代对象，并且不再需要直接使用 ``.choices`` 来扩展 :ref:`枚举类型 <field-choices-enum-types>`：
