Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: If you're relying on this feature, you should add ``'django.middleware.common.BrokenLinkEmailsMiddleware'`` to your ``MIDDLEWARE_CLASSES`` setting and remove ``SEND_BROKEN_LINK_EMAILS`` from your settings.
id: Jika anda bergantung pada fitur ini, anda harus menambahkan ``'django.middleware.common.BrokenLinkEmailsMiddleware'`` ke pengaturan ``MIDDLEWARE_CLASSES`` anda dan memindahkan ``SEND_BROKEN_LINK_EMAILS`` dari pengaturan anda.
zh_hans: 如果您依赖于这个功能，应该将 ``'django.middleware.common.BrokenLinkEmailsMiddleware'`` 添加到您的 ``MIDDLEWARE_CLASSES`` 设置中，并从您的设置中删除 ``SEND_BROKEN_LINK_EMAILS``。

source: ``_has_changed`` method on widgets
id: `Metode `_has_changed`` di widgets
zh_hans: 对于小部件上的 ``_has_changed`` 方法

source: If you defined your own form widgets and defined the ``_has_changed`` method on a widget, you should now define this method on the form field itself.
id: Jika anda menentukan widget formulir anda sendiri dan menentukan metode ``_has_changed`` pada sebuah widget anda harus sekarang menentukan metode ini di bidang formulir itu sendiri.
zh_hans: 如果您定义了自己的表单小部件并在小部件上定义了 ``_has_changed`` 方法，现在应该在表单字段本身上定义这个方法。

source: ``module_name`` model _meta attribute
id: Model ``module_name`` atribut _meta
zh_hans: ``module_name`` 模型 _meta 属性

source: ``Model._meta.module_name`` was renamed to ``model_name``. Despite being a private API, it will go through a regular deprecation path.
id: ``Model._meta.module_name`` telah dinamai kembali ke ``model_name``. Meskipun menjadi sebuah API pribadi, itu akan melalui jalur pengusangan biasa.
zh_hans: ``Model._meta.module_name`` 已更名为 ``model_name``。尽管它是一个私有 API，但它将经历常规的弃用过程。

source: ``get_(add|change|delete)_permission`` model _meta methods
id: Model ``get_(add|change|delete)_permission`` _meta methods
zh_hans: ``get_(add|change|delete)_permission`` 模型 _meta 方法

source: ``Model._meta.get_(add|change|delete)_permission`` methods were deprecated. Even if they were not part of the public API they'll also go through a regular deprecation path. You can replace them with ``django.contrib.auth.get_permission_codename('action', Model._meta)`` where ``'action'`` is ``'add'``, ``'change'``, or ``'delete'``.
id: Metode ``Model._meta.get_(add|change|delete)_permission`` telah diusangkan. Bahkan jika mereka adalah bukan bagian dari API umum mereka akan juga pergi melalui jalur pengusangan biasa. Anda dapat mengganti mereka dengan ``django.contrib.auth.get_permission_codename('action', Model._meta)`` dimana ``'action'`` adalah ``'add'``, ``'change'``, atau ``'delete'``.
zh_hans: ``Model._meta.get_(add|change|delete)_permission`` 方法已被弃用。即使它们不是公共 API 的一部分，它们也将经历常规的弃用过程。您可以将它们替换为 ``django.contrib.auth.get_permission_codename('action', Model._meta)``，其中 ``'action'`` 是 ``'add'``、``'change'`` 或 ``'delete'``。

source: ``get_query_set`` and similar methods renamed to ``get_queryset``
id: ``get_query_set`` dan metode mirip dinamai kembali menjadi ``get_queryset``
zh_hans: ``get_query_set`` 和类似的方法已重命名为 ``get_queryset``。

source: Methods that return a ``QuerySet`` such as ``Manager.get_query_set`` or ``ModelAdmin.queryset`` have been renamed to ``get_queryset``.
id: Metode yang mengembalikan sebuah ``QuerySet`` seperti ``Manager.get_query_set`` atau ``ModelAdmin.queryset`` telah dinamai menjadi ``get_queryset``.
zh_hans: 返回一个 ``QuerySet`` 的方法，如 ``Manager.get_query_set`` 或 ``ModelAdmin.queryset``，已被重命名为 ``get_queryset``。

source: If you are writing a library that implements, for example, a ``Manager.get_query_set`` method, and you need to support old Django versions, you should rename the method and conditionally add an alias with the old name::
id: Jika anda sedang menulis pustaka yang menerapkan, sebagai contoh, sebuah metode ``Manager.get_query_set``, dan anda butuh mendukung versi Django lama, anda harus menamai kembali cara dan kondisional tambah sebuah nama lain dengan nama lama::
zh_hans: 如果您正在编写一个库，其中实现了一个例如 ``Manager.get_query_set`` 方法，并且需要支持旧版本的 Django，您应该重命名该方法并有条件地添加一个具有旧名称的别名：

source: If you are writing a library that needs to call the ``get_queryset`` method and must support old Django versions, you should write::
id: Jika anda sedang menulis pustaka yang butuh memanggil metode ``get_queryset`` dan harus mendukung versi Django lama, anda harus menulis::
zh_hans: 如果您正在编写一个需要调用 ``get_queryset`` 方法并且必须支持旧版 Django 的库，您应该编写：

source: In the general case of a custom manager that both implements its own ``get_queryset`` method and calls that method, and needs to work with older Django versions, and libraries that have not been updated yet, it is useful to define a ``get_queryset_compat`` method as below and use it internally to your manager::
id: Di kasus umum dari penyesuaian pengelola yang kedua menerapkan metode ``get_queryset`` milik nya dan memanggil metode itu, dan butuh bekerja dengan versi Django terlama, dan pustaka yang belum diperbaharui, itu adalah berguna untuk menentukan sebuah metode ``get_queryset_compat`` seperti dibawah dan menggunakannya secara internal ke pengelola anda::
zh_hans: 对于一般情况下的自定义管理器，既实现了自己的 ``get_queryset`` 方法又调用该方法，并且需要与较旧版本的 Django 以及尚未更新的库一起使用，定义一个如下的 ``get_queryset_compat`` 方法并在管理器内部使用它是有用的：

source: This helps to minimize the changes that are needed, but also works correctly in the case of subclasses (such as ``RelatedManagers`` from Django 1.5) which might override either ``get_query_set`` or ``get_queryset``.
id: Ini membantu mengecilkan perubahan yang dibutuhkan, tetapi juga bekerja dengan benar di kasus dari subkelas (seperti ``RelatedManagers`` dari Django 1.5) yang mungkin menimpa salah satu ``get_query_set`` atau ``get_queryset``.
zh_hans: 这有助于最小化所需的更改，同时在子类（例如 Django 1.5 中的 ``RelatedManagers``）可能覆盖 ``get_query_set`` 或 ``get_queryset`` 的情况下也能正常工作。

source: ``shortcut`` view and URLconf
id: tampilan ``jalan pintas`` dan URLconf
zh_hans: ``shortcut`` 视图和 URL 配置

source: The ``shortcut`` view was moved from ``django.views.defaults`` to ``django.contrib.contenttypes.views`` shortly after the 1.0 release, but the old location was never deprecated. This oversight was corrected in Django 1.6 and you should now use the new location.
id: Tampilan ``jalan pintas`` dipindahkan dari ``django.views.defaults`` ke ``django.contrib.contenttypes.views`` segera setelah terbitan 1.0, tetapi tempat lama tidak pernah diusangkan. Kekeliruan ini diperbaiki di Django 1.6 dan anda seharusnya sekarang gunakan tempat baru.
zh_hans: ``shortcut`` 视图在 1.0 版本发布后不久从 ``django.views.defaults`` 移动到了 ``django.contrib.contenttypes.views``，但旧位置从未弃用。这个疏忽在 Django 1.6 中得到了纠正，现在应该使用新的位置。

source: The URLconf ``django.conf.urls.shortcut`` was also deprecated. If you're including it in an URLconf, simply replace::
id: URLconf ``django.conf.urls.shortcut`` juga telah diusangkan. Jika anda sedang menyertakan itu di sebuah URLconf, cukup ganti::
zh_hans: URL 配置中的 ``django.conf.urls.shortcut`` 也已被弃用。如果您在 URL 配置中包含它，只需替换为：

source: with::
id: dengan::
zh_hans: 使用：

source: ``ModelForm`` without ``fields`` or ``exclude``
id: ``ModelForm`` tanpa ``fields`` atau ``exclude``
zh_hans: 没有指定 ``fields`` 或 ``exclude`` 的 ``ModelForm``

source: Previously, if you wanted a :class:`~django.forms.ModelForm` to use all fields on the model, you could simply omit the ``Meta.fields`` attribute, and all fields would be used.
id: Sebelumnya, jika anda ingin sebuah :class:`~django.forms.ModelForm` untuk memakai semua bidang pada model, anda dapat cukup menghilangkan atribut ``Meta.fields``, dan semua bidang akan digunakan.
zh_hans: 以前，如果您想要一个 :class:`~django.forms.ModelForm` 使用模型上的所有字段，您可以简单地省略 ``Meta.fields`` 属性，所有字段都会被使用。

source: This can lead to security problems where fields are added to the model and, unintentionally, automatically become editable by end users. In some cases, particular with boolean fields, it is possible for this problem to be completely invisible. This is a form of `Mass assignment vulnerability <https://en.wikipedia.org/wiki/Mass_assignment_vulnerability>`_.
id: Ini dapat membawa pada masalah keamanan dimana bidang ditambahkan ke model dan, tidak sengaja, secara otomatis menjadi dapat disunting oleh pengguna akhir. Di beberapa kasus, khususnya dengan bidang boolean, itu memungkinkan untuk masalah ini secara lengkap nampak. Ini adalah sebuah formulir `Mass assignment vulnerability <https://en.wikipedia.org/wiki/Mass_assignment_vulnerability>`_.
zh_hans: 这可能会导致安全问题，其中字段被添加到模型，并且无意中自动变为可由最终用户编辑。在某些情况下，特别是布尔字段的情况下，这个问题可能是完全不可见的。这是一种 `批量赋值漏洞 <https://en.wikipedia.org/wiki/Mass_assignment_vulnerability>`_。

source: For this reason, this behavior is deprecated, and using the ``Meta.exclude`` option is strongly discouraged. Instead, all fields that are intended for inclusion in the form should be listed explicitly in the ``fields`` attribute.
id: Untuk alasan ini, perilaku ini diusangkan, dan menggunakan pilihan ``Meta.exclude`` sangat kecil. Meskipun semua bidang yang dimaksud untuk penyertaan di formulir harus didaftarkan secara eksplisit di atribut ``field``.
zh_hans: 因此，这种行为已被弃用，并强烈不建议使用 ``Meta.exclude`` 选项。相反，应该将所有打算包含在表单中的字段都明确列在 ``fields`` 属性中。

source: If this security concern really does not apply in your case, there is a shortcut to explicitly indicate that all fields should be used - use the special value ``"__all__"`` for the fields attribute::
id: Jika perhatian keamanan sangat tidak berlaku di kasus anda, ada sebuah jalan pintas untuk secara eksplisit mengindikasikan bahwa semua bidang harus digunakan - gunakan nilai khusus ``"__all__"` untuk atribut bidang::
zh_hans: 如果在您的情况下确实不适用这个安全问题，那么有一种快捷方式可以明确指示使用所有字段 - 使用字段属性的特殊值 ``"__all__"``：

source: If you have custom ``ModelForms`` that only need to be used in the admin, there is another option. The admin has its own methods for defining fields (``fieldsets`` etc.), and so adding a list of fields to the ``ModelForm`` is redundant. Instead, simply omit the ``Meta`` inner class of the ``ModelForm``, or omit the ``Meta.model`` attribute. Since the ``ModelAdmin`` subclass knows which model it is for, it can add the necessary attributes to derive a functioning ``ModelForm``. This behavior also works for earlier Django versions.
id: Jika anda mempunyai penyesuaian ``ModelForms`` yang hanya butuh digunakan di admin, ada pilihan lain. Admin mempunyai metode sendiri untuk menentukan bidang (``fieldsets`` dll), dan juga menambahkan daftar dari bidang ke ``ModelForm`` adalah berlebihan. Sebagai gantinya, cukup hilangkan kelas sebelah dalam ``Meta`` dari ``ModelForm``, atau hilangkan atribut ``Meta.model``. Sejak subkelas ``ModelAdmin`` mengetahui model mana ini untuk, itu dapat menambahkan atribut yang dibutuhkan untuk memperoleh fungsi ``ModelForm``. Perilaku ini juga bekerja untuk versi Django lebih awal.
zh_hans: 如果您有自定义的 ``ModelForm``，只需要在管理界面中使用，还有另一种选择。管理界面有自己定义字段的方法（``fieldsets`` 等），因此在 ``ModelForm`` 中添加字段列表是多余的。相反，只需省略 ``ModelForm`` 的 ``Meta`` 内部类，或省略 ``Meta.model`` 属性。由于 ``ModelAdmin`` 子类知道它是哪个模型，它可以添加必要的属性来派生一个可用的 ``ModelForm``。这种行为也适用于较早的 Django 版本。

source: ``UpdateView`` and ``CreateView`` without explicit fields
id: ``UpdateView`` dan ``CreateView`` tanpa bidang eksplisit
zh_hans: 没有显式字段的 ``UpdateView`` 和 ``CreateView``

source: The generic views :class:`~django.views.generic.edit.CreateView` and :class:`~django.views.generic.edit.UpdateView`, and anything else derived from :class:`~django.views.generic.edit.ModelFormMixin`, are vulnerable to the security problem described in the section above, because they can automatically create a ``ModelForm`` that uses all fields for a model.
id: Tampilan umum :class:`~django.views.generic.edit.CreateView` dan :class:`~django.views.generic.edit.UpdateView`, dan apapun diperoleh dari :class:`~django.views.generic.edit.ModelFormMixin`, adalah rentan pada masalah keamanan digambarkan di bagian diatas, karena mereka dapat secara otomatis membuat sebuah ``ModelForm`` yang menggunakan semua bidang untuk sebuah model.
zh_hans: 通用视图 :class:`~django.views.generic.edit.CreateView` 和 :class:`~django.views.generic.edit.UpdateView`，以及从 :class:`~django.views.generic.edit.ModelFormMixin` 派生的任何其他视图，都容易受到上面描述的安全问题的影响，因为它们可以自动创建一个使用模型的所有字段的 ``ModelForm``。

source: For this reason, if you use these views for editing models, you must also supply the ``fields`` attribute (new in Django 1.6), which is a list of model fields and works in the same way as the :class:`~django.forms.ModelForm` ``Meta.fields`` attribute. Alternatively, you can set the ``form_class`` attribute to a ``ModelForm`` that explicitly defines the fields to be used. Defining an ``UpdateView`` or ``CreateView`` subclass to be used with a model but without an explicit list of fields is deprecated.
id: Untuk alasan ini, jika anda menggunakan tampilan ini untuk menyunting model, adna harus juga memasok atribut ``field`` (baru di Django 1.6), yaitu sebuah daftar bidang model dan bekerja di cara sama seperti atribut :class:`~django.forms.ModelForm` ``Meta.fields``. Cara lain, anda dapat menyetel atribut ``form_class`` ke ``ModelForm`` yang secara jelas menentukan bidang-bidang akan digunakan. Menentukan sebuah subkelas ``UpdateView`` or ``CreateView`` untuk digunakan dengan sebuah model tetapi tanpa sebuah daftar jelas dari bidang-bidang adalah diusangkan.
zh_hans: 因此，如果您使用这些视图来编辑模型，您必须提供 ``fields`` 属性（在 Django 1.6 中新增），它是一个模型字段的列表，工作方式与 :class:`~django.forms.ModelForm` 的 ``Meta.fields`` 属性相同。或者，您可以将 ``form_class`` 属性设置为明确定义要使用的字段的 ``ModelForm``。已经弃用了定义用于与模型一起使用但没有显式字段列表的 ``UpdateView`` 或 ``CreateView`` 子类。

source: Munging of help text of model form fields for ``ManyToManyField`` fields
id: Mung dari teks bantuan dari bidang formulir model untuk bidang-bidang ``ManyToManyField``
zh_hans: 对于 ``ManyToManyField`` 字段的模型表单字段的帮助文本的调整

source: All special handling of the ``help_text`` attribute of ``ManyToManyField`` model fields performed by standard model or model form fields as described in :ref:`m2m-help_text` above is deprecated and will be removed in Django 1.8.
id: Semua penanganan khusus dari atribut ``help_text`` dari bidang model ``ManyToManyField`` dilakukan oleh model standar atau bidang formulir model seperti digambarkan di :ref:`m2m-help_text` diatas adalah diusangkan dan akan dipindahkan di Django 1.8.
zh_hans: 所有标准模型字段或模型表单字段对 ``ManyToManyField`` 模型字段的 ``help_text`` 属性执行的特殊处理，如上述 :ref:`m2m-help_text` 中描述的，已经弃用，并将在 Django 1.8 中移除。

source: Help text of these fields will need to be handled either by applications, custom form fields or widgets, just like happens with the rest of the model field types.
id: Teks bantuan dari bidang-bidang ini akan butuh ditangani antara oleh aplikasi, penyesuaian bidang formulir atau widget, cukup seperti terjadi dengan sisa dari jenis bidang model.
zh_hans: 这些字段的帮助文本需要由应用程序、自定义表单字段或小部件处理，就像其他模型字段类型一样。

source: Django 1.6.1 release notes
id: Catatan terbitan Django 1.6.1
zh_hans: Django 1.6.1 版本发行说明

source: *December 12, 2013*
id: *Desember 12, 2013*
zh_hans: *2013 年 12 月 12 日*

source: This is Django 1.6.1, a bugfix release for Django 1.6. In addition to the bug fixes listed below, translations submitted since the 1.6 release are also included.
id: Ini adalah Django 1.6.1, sebuah terbitan perbaikan kesalahan untuk Django 1.6. Sebagai tambahan pada perbaikan kesalahan terlampir dibawah, terjemahan diajukan sejak terbitan 1.6 juga disertakan.
zh_hans: 这是 Django 1.6.1，Django 1.6 的修复版本。除了下面列出的错误修复外，还包括自 1.6 版本发布以来提交的翻译。

source: Bug fixes
id: Perbaikan kesalahan
zh_hans: 错误修复

source: Fixed ``BCryptSHA256PasswordHasher`` with ``py-bcrypt`` and Python 3 (#21398).
zh_hans: 修复了与 ``py-bcrypt`` 和 Python 3 一起使用的 ``BCryptSHA256PasswordHasher`` （#21398）。

source: Fixed a regression that prevented a ``ForeignKey`` with a hidden reverse manager (``related_name`` ending with '+') from being used as a lookup for ``prefetch_related`` (#21410).
id: Diperbaiki sebuah pemulihan yang mencegah sebuah ``ForeignKey`` dengan pengelola pembalikan tersembunyi (``related_name`` berakhiran dengan '+') dari menjadi digunakan sebagai pencarian untuk ``prefetch_related`` (#21410).
zh_hans: 修复了一个回归问题，该问题阻止了具有隐藏的反向管理器（``related_name`` 以 '+' 结尾）的 ``ForeignKey`` 被用作 ``prefetch_related`` 的查找条件（#21410）。

source: Fixed :meth:`Queryset.datetimes<django.db.models.query.QuerySet.datetimes>` raising ``AttributeError`` in some situations (#21432).
id: Diperbaiki :meth:`Queryset.datetimes<django.db.models.query.QuerySet.datetimes>` memunculkan ``AttributeError`` di beberapa keadaan (#21432).
zh_hans: 修复了在某些情况下导致 :meth:`Queryset.datetimes<django.db.models.query.QuerySet.datetimes>` 抛出 ``AttributeError`` 的问题（#21432）。

source: Fixed a regression that prevented editable ``GenericRelation`` subclasses from working in ``ModelForms`` (#21428).
id: Diperbaiki sebuah pemulihan yang mencegah dapat disunting ``GenericRelation`` subkelas dari bekerja di ``ModelForms`` (#21428).
zh_hans: 修复了一个回归问题，该问题阻止了可编辑的 ``GenericRelation`` 子类在 ``ModelForms`` 中正常工作（#21428）。

source: Added missing ``to_python`` method for ``ModelMultipleChoiceField`` which is required in Django 1.6 to properly detect changes from initial values (#21568).
id: Ditambahkan metode ``to_python`` hilang untuk ``ModelMultipleChoiceField`` yang dibutuhkan di Django 1.6 untuk dengan benar mengetahui perubahan dari nilai inisial (#21568).
zh_hans: 在 Django 1.6 中添加了缺失的 ``to_python`` 方法，该方法对于正确检测与初始值的更改是必需的，用于 ``ModelMultipleChoiceField`` （#21568）。

source: Fixed ``django.contrib.humanize`` translations where the Unicode sequence for the non-breaking space was returned verbatim (#21415).
zh_hans: 修复了 ``django.contrib.humanize`` 的翻译，其中非断开空格的 Unicode 序列被原样返回的问题（#21415）。

source: Fixed :djadmin:`loaddata` error when fixture file name contained any dots not related to file extensions (#21457) or when fixture path was relative but located in a subdirectory (#21551).
id: Diperbaiki kesalahan :djadmin:`loaddata` ketika nama berkas bantu mengandung titik apapun tidak terkait pada perpanjangan berkas (#21457) atau ketika jalur alat bantu adalah relatif tetapi bertempat dalam subdirektori (#21551).
zh_hans: 修复了在 fixture 文件名中包含与文件扩展名无关的任何点（#21457）或 fixture 路径是相对路径但位于子目录中时（#21551），导致 :djadmin:`loaddata` 出现错误的问题。

source: Fixed display of inline instances in formsets when parent has 0 for primary key (#21472).
id: Diperbaiki tampilan dari instance berderet dalam formset ketika induk mempunyai 0 untuk primary key (#21472).
zh_hans: 修复了父对象主键为 0 时，在表单集中显示内联实例的问题（ #21472 ）。

source: Fixed a regression where custom querysets for foreign keys were overwritten if ``ModelAdmin`` had ordering set (#21405).
id: Diperbaiki sebuah pemulihan dimana penyesuaian queryset untuk foreign key sedang ditulis kembali jika ``ModelAdmin`` mempunyai kumpulan pengurutan (#21405).
zh_hans: 修复了一个回归问题，如果 ``ModelAdmin`` 设置了排序，会覆盖外键的自定义查询集的问题（#21405）。

source: Removed mention of a feature in the ``--locale``/``-l`` option of the ``makemessages`` and ``compilemessages`` commands that never worked as promised: Support of multiple locale names separated by commas. It's still possible to specify multiple locales in one run by using the option multiple times (#21488, #17181).
id: Dipindahkan sebutan dari sebuah fitur di pilihan ``--locale``/``-l`` dari perintah ``makemessages`` dan ``compilemessages`` yang tidak pernah bekerja seperti dijanjikan: Dukungan dari nama lokal banyak dipisahkan oleh koma. itu adalah masih memungkinkan untuk menentukan banyak lokal di satu jalan dengan menggunakan pilihan banyak kali (#21488, #17181).
zh_hans: 移除了 ``makemessages`` 和 ``compilemessages`` 命令的 ``--locale``/``-l`` 选项中有关一个从未按承诺工作的功能的提及：支持用逗号分隔的多个语言环境名称。仍然可以通过多次使用该选项来在一次运行中指定多个语言环境（#21488，#17181）。

source: Fixed a regression that unnecessarily triggered settings configuration when importing ``get_wsgi_application`` (#21486).
id: DIperbaiki sebuah pemulihan yang tidak perlu memicu konfigurasi pengaturan ketika mengimpor ``get_wsgi_application`` (#21486).
zh_hans: 修复了一个回归问题，导入 ``get_wsgi_application`` 时不必要地触发了设置配置（#21486）。

source: Fixed test client ``logout()`` method when using the cookie-based session backend (#21448).
id: Diperbaiki klien percobaan metode ``logout()`` ketika menggunakan backend sesi berdasarkan-kue (#21448).
zh_hans: 修复了在使用基于 Cookie 的会话后端时，测试客户端的 ``logout()`` 方法的问题（#21448）。

source: Fixed a crash when a ``GeometryField`` uses a non-geometric widget (#21496).
id: Diperbaiki sebuah kegagalan ketika ``GeometryField`` menggunakan widget bukan-geometri (#21496).
zh_hans: 修复了当 ``GeometryField`` 使用非几何小部件时的崩溃问题（#21496）。

source: Fixed password hash upgrade when changing the iteration count (#21535).
id: Diperbaiki peningkatan acakan sandi ketika merubah perhitungan putaran (#21535).
zh_hans: 修复了更改迭代次数时密码哈希升级的问题（ #21535 ）。

source: Fixed a bug in the debug view when the URLconf only contains one element (#21530).
id: Diperbaiki sebuah kesalahan dalam tampilan mencari kesalahan ketika URLconf hanya mengandung satu unsur (#21530).
zh_hans: 修复了调试视图中的一个错误，当 URL 配置仅包含一个元素时（ #21530 ）。

source: Re-added missing search result count and reset link in changelist admin view (#21510).
id: Ditambahkan kembali perhitungan hasil pencarian dan setel kembali tautan di tampilan admin daftar rubah (#21510).
zh_hans: 在 changelist 管理员视图中重新添加了丢失的搜索结果计数和重置链接（ #21510 ）。

source: The current language is no longer saved to the session by ``LocaleMiddleware`` on every response, but rather only after a logout (#21473).
id: Bahasa saat ini tidaklagi menyimpan ke sesi berdasarkan ``LocaleMiddleware`` di setiap tanggapan, tetapi bukan hanya setelah keluar (#21473).
zh_hans: ``LocaleMiddleware`` 不再在每个响应中保存当前语言到会话中，而是仅在注销后保存（#21473）。

source: Fixed a crash when executing ``runserver`` on non-English systems and when the formatted date in its output contained non-ASCII characters (#21358).
id: Diperbaiki sebuah kegagalan ketika menjalankan ``runserver`` pada sistem bukan-Inggris dan ketika tanggal dibentuk di keluarannya mengandung karakter bukan-ASCII (#21358).
zh_hans: 修复了在非英语系统上执行 ``runserver`` 时，以及其输出中的格式化日期包含非ASCII字符时的崩溃问题（#21358）。

source: Fixed a crash in the debug view after an exception occurred on Python ≥ 3.3 (#21443).
zh_hans: 修复了在 Python ≥ 3.3 上发生异常后调试视图崩溃的问题（ #21443 ）。

source: Fixed a crash in :class:`~django.db.models.ImageField` on some platforms (Homebrew and RHEL6 reported) (#21355).
id: Diperbaiki sebuah kegagalan :class:`~django.db.models.ImageField` pada beberapa serambi (Homebrew dan RHEL6 melaporkan) (#21355).
zh_hans: 在一些平台上修复了 :class:`~django.db.models.ImageField` 的崩溃问题（报告了 Homebrew 和 RHEL6）（#21355）。

source: Fixed a regression when using generic relations in ``ModelAdmin.list_filter`` (#21431).
id: Diperbaiki sebuah pemulihan ketika menggunakan hubungan umum di ``ModelAdmin.list_filter`` (#21431).
zh_hans: 修复了在 ``ModelAdmin.list_filter`` 中使用通用关系时的回归问题（#21431）。

source: Django 1.6.10 release notes
id: Catatan terbitan Django 1.6.10
zh_hans: Django 1.6.10 版本发行说明

source: Django 1.6.10 fixes several security issues in 1.6.9.
id: Django 1.6.10 memperbaiki beberapa masalah keamanan di 1.6.9.
zh_hans: Django 1.6.10 修复了 1.6.9 版本中的多个安全问题。

source: Database denial-of-service with ``ModelMultipleChoiceField``
id: Denial-of-service basisdata dengan ``ModelMultipleChoiceField``
zh_hans: 使用 ``ModelMultipleChoiceField`` 存在数据库拒绝服务漏洞
