Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :setting:`SECURE_REFERRER_POLICY` now defaults to ``'same-origin'``. See the *What's New* :ref:`Security section <whats-new-security-3.1>` above for more details.
zh_hans: :setting:`SECURE_REFERRER_POLICY` 现在默认为 ``'same-origin'``。更多细节请参见 *新变化* :ref:`安全章节 <whats-new-security-3.1>`。

source: :djadmin:`check` management command now runs the ``database`` system checks only for database aliases specified using :option:`check --database` option.
zh_hans: :djadmin:`check` 管理命令现在只对使用 :option:`check --database` 选项指定的数据库别名运行 ``database`` 系统检查。

source: :djadmin:`migrate` management command now runs the ``database`` system checks only for a database to migrate.
zh_hans: :djadmin:`migrate` 管理命令现在只运行 ``database`` 系统检查要迁移的数据库。

source: The admin CSS classes ``row1`` and ``row2`` are removed in favor of ``:nth-child(odd)`` and ``:nth-child(even)`` pseudo-classes.
zh_hans: 管理 CSS 类 ``row1`` 和 ``row2`` 被删除，取而代之的是 ``:nth-child(odd)`` 和 ``:nth-child(even)`` 伪类。

source: The :func:`~django.contrib.auth.hashers.make_password` function now requires its argument to be a string or bytes. Other types should be explicitly cast to one of these.
zh_hans: :func:`~django.contrib.auth.hashers.make_password` 函数现在要求其参数为字符串或字节。其他类型的参数应该显式地转换为其中之一。

source: The undocumented ``version`` parameter to the :class:`~django.contrib.gis.db.models.functions.AsKML` function is removed.
zh_hans: 删除了 :class:`~django.contrib.gis.db.models.function.AsKML` 函数中未记录的 ``version`` 参数。

source: :ref:`JSON and YAML serializers <serialization-formats>`, used by :djadmin:`dumpdata`, now dump all data with Unicode by default. If you need the previous behavior, pass ``ensure_ascii=True`` to JSON serializer, or ``allow_unicode=False`` to YAML serializer.
zh_hans: :ref:`JSON 和 YAML 序列化器 <serialization-formats>`，由 :djadmin:`dumpdata` 使用，现在默认使用 Unicode 转储所有数据。如果你需要以前的行为，传递 ``ensure_ascii=True`` 给 JSON 序列化器，或者 ``allow_unicode=False`` 给 YAML 序列化器。

source: The auto-reloader no longer monitors changes in built-in Django translation files.
zh_hans: 自动重新加载器不再监控内置 Django 翻译文件的变化。

source: The minimum supported version of ``mysqlclient`` is increased from 1.3.13 to 1.4.0.
zh_hans: ``mysqlclient`` 的最低支持版本从 1.3.13 增加到 1.4.0。

source: The undocumented ``django.contrib.postgres.forms.InvalidJSONInput`` and ``django.contrib.postgres.forms.JSONString`` are moved to ``django.forms.fields``.
zh_hans: 未记录的 ``django.contrib.postgres.forms.InvalidJSONInput`` 和 ``django.contrib.postgres.forms.JSONString`` 被移至 ``django.forms.field``。

source: The undocumented ``django.contrib.postgres.fields.jsonb.JsonAdapter`` class is removed.
zh_hans: 删除了未记录的 ``django.contrib.postgres.field.jsonb.JsonAdapter`` 类。

source: The :ttag:`{% localize off %} <localize>` tag and :tfilter:`unlocalize` filter no longer respect :setting:`DECIMAL_SEPARATOR` setting.
zh_hans: :ttag:`{% localize off %} <localize>` 标签和 :tfilter:`unlocalize` 过滤器不再遵守 :setting:`DECIMAL_SEPARATOR` 配置。

source: The minimum supported version of ``asgiref`` is increased from 3.2 to 3.2.10.
zh_hans: ``asgiref`` 的最低支持版本从 3.2 增加到 3.2.10。

source: The :doc:`Media </topics/forms/media>` class now renders ``<script>`` tags without the ``type`` attribute to follow `WHATWG recommendations <https://html.spec.whatwg.org/multipage/scripting.html#the-script-element>`_.
zh_hans: :doc:`Media </topics/forms/media>` 类现在不使用 ``type`` 属性来渲染 ``<script>`` 标签，以遵循 `WHATWG 建议 <https://html.spec.whatwg.org/multipage/scripting.html#the-script-element>`_ 。

source: :class:`~django.forms.ModelChoiceIterator`, used by :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField`, now yields 2-tuple choices containing :class:`~django.forms.ModelChoiceIteratorValue` instances as the first ``value`` element in each choice. In most cases this proxies transparently, but if you need the ``field`` value itself, use the :attr:`.ModelChoiceIteratorValue.value` attribute instead.
zh_hans: :class:`~django.forms.ModelChoiceIterator`，由 :class:`~django.forms.ModelChoiceField` 和 :class:`~django.forms.ModelMultipleChoiceField` 使用，现在产生 2 个包含 :class:`~django.forms.ModelChoiceIteratorValue` 实例的选择，作为每个选择的第一个 ``value`` 元素。在大多数情况下，这个代理是透明的，但如果你需要 ``field`` 值本身，请使用 :attr:`.ModelChoiceIteratorValue.value` 属性代替。

source: Features deprecated in 3.1
zh_hans: 在 3.1 中被废弃的功能

source: PostgreSQL ``JSONField``
zh_hans: PostgreSQL 的 ``JSONField``

source: ``django.contrib.postgres.fields.JSONField`` and ``django.contrib.postgres.forms.JSONField`` are deprecated in favor of :class:`.models.JSONField` and :class:`forms.JSONField <django.forms.JSONField>`.
zh_hans: ``django.contrib.postgres.field.JSONField`` 和 ``django.contrib.postgres.forms.JSONField`` 被废弃，改用 :class:`.models.JSONField` 和 :class:`forms.JSONField <django.forms.JSONField>`。

source: The undocumented ``django.contrib.postgres.fields.jsonb.KeyTransform`` and ``django.contrib.postgres.fields.jsonb.KeyTextTransform`` are also deprecated in favor of the transforms in ``django.db.models.fields.json``.
zh_hans: 未记录的 ``django.contrib.postgres.fields.jsonb.KeyTransform`` 和 ``django.contrib.postgres.fields.jsonb.KeyTextTransform`` 也被弃用，改用 ``django.db.models.fields.json`` 中的变换。

source: The new ``JSONField``\s, ``KeyTransform``, and ``KeyTextTransform`` can be used on all supported database backends.
zh_hans: 新的 ``JSONField``、``KeyTransform`` 和 ``KeyTextTransform`` 可用于所有支持的数据库后端。

source: ``PASSWORD_RESET_TIMEOUT_DAYS`` setting is deprecated in favor of :setting:`PASSWORD_RESET_TIMEOUT`.
zh_hans: ``PASSWORD_RESET_TIMEOUT_DAYS`` 配置已被取消，改为 :setting:`PASSWORD_RESET_TIMEOUT`。

source: The undocumented usage of the :lookup:`isnull` lookup with non-boolean values as the right-hand side is deprecated, use ``True`` or ``False`` instead.
zh_hans: 未记录的 :lookup:`isnull` 查找使用非布尔值作为右侧的用法已被废弃，请使用 ``True`` 或 ``False`` 代替。

source: The barely documented ``django.db.models.query_utils.InvalidQuery`` exception class is deprecated in favor of :class:`~django.core.exceptions.FieldDoesNotExist` and :class:`~django.core.exceptions.FieldError`.
zh_hans: 勉强记录的 ``django.db.models.query_utils.InvalidQuery`` 异常类被废弃，取而代之的是 :class:`~django.core.exceptions.FieldDoesNotExist` 和 :class:`~django.core.exceptions.FieldError`。

source: The ``django-admin.py`` entry point is deprecated in favor of ``django-admin``.
zh_hans: ``django-admin.py`` 的入口点已被废弃，改为 ``django-admin``。

source: The ``HttpRequest.is_ajax()`` method is deprecated as it relied on a jQuery-specific way of signifying AJAX calls, while current usage tends to use the JavaScript `Fetch API <https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API>`_. Depending on your use case, you can either write your own AJAX detection method, or use the new :meth:`.HttpRequest.accepts` method if your code depends on the client ``Accept`` HTTP header.
zh_hans: ``HttpRequest.is_ajax()`` 方法已被废弃，因为它依赖于 jQuery 特定的方式来表示 AJAX 调用，而当前的用法倾向于使用 JavaScript `Fetch API <https://developer.mozilla.org/en-US/docs/Web/API/Fetch_API>`_ 。根据你的用例，你可以写你自己的 AJAX 检测方法，或者使用新的 :meth:`.HttpRequest.accepts` 方法，如果你的代码依赖于客户端 ``Accept`` HTTP 头。

source: If you are writing your own AJAX detection method, ``request.is_ajax()`` can be reproduced exactly as ``request.headers.get('x-requested-with') == 'XMLHttpRequest'``.
zh_hans: 如果你正在编写自己的 AJAX 检测方法，``request.is_ajax()`` 可以完全复制为 ``request.headers.get('x-requested-with') == 'XMLHttpRequest'``。

source: Passing ``None`` as the first argument to ``django.utils.deprecation.MiddlewareMixin.__init__()`` is deprecated.
zh_hans: 传递 ``None`` 作为 ``django.utils.deprecation.MiddlewareMixin.__init__()`` 的第一个参数是过时的。

source: The encoding format of cookies values used by :class:`~django.contrib.messages.storage.cookie.CookieStorage` is different from the format generated by older versions of Django. Support for the old format remains until Django 4.0.
zh_hans: :class:`~django.contrib.messages.storage.cookie.CookieStorage` 使用的 cookie 值的编码格式与旧版本 Django 生成的格式不同。在 Django 4.0 之前，仍然支持旧的格式。

source: The encoding format of sessions is different from the format generated by older versions of Django. Support for the old format remains until Django 4.0.
zh_hans: 会话的编码格式与旧版 Django 生成的格式不同。在 Django 4.0 之前，仍然支持旧的格式。

source: The purely documentational ``providing_args`` argument for :class:`~django.dispatch.Signal` is deprecated. If you rely on this argument as documentation, you can move the text to a code comment or docstring.
zh_hans: :class:`~django.dispatch.Signal` 的纯文档化 ``providing_args`` 参数已被废弃。如果你依赖这个参数作为文档，你可以将文本移到代码注释或 docstring 中。

source: Calling ``django.utils.crypto.get_random_string()`` without a ``length`` argument is deprecated.
zh_hans: 没有 ``length`` 参数的情况下调用 ``django.utils.crypto.get_random_string()`` 已被废弃。

source: The ``list`` message for :class:`~django.forms.ModelMultipleChoiceField` is deprecated in favor of ``invalid_list``.
zh_hans: :class:`~django.forms.ModelMultipleChoiceField` 的 ``list`` 信息已被弃用，改为 ``invalid_list``。

source: Passing raw column aliases to :meth:`.QuerySet.order_by` is deprecated. The same result can be achieved by passing aliases in a :class:`~django.db.models.expressions.RawSQL` instead beforehand.
zh_hans: 向 :meth:`.QuerySet.order_by` 传递原始列别名已经被废弃。通过事先在 :class:`~django.db.models.expressions.RawSQL` 中传递别名，可以达到同样的效果。

source: The ``NullBooleanField`` model field is deprecated in favor of ``BooleanField(null=True, blank=True)``.
zh_hans: ``NullBooleanField`` 模型字段已弃用，建议使用 ``BooleanField(null=True, blank=True)``。

source: ``django.conf.urls.url()`` alias of :func:`django.urls.re_path` is deprecated.
zh_hans: ``django.conf.urls.url()`` 的 :func:`django.urls.re_path` 别名已被废弃。

source: The ``{% ifequal %}`` and ``{% ifnotequal %}`` template tags are deprecated in favor of :ttag:`{% if %}<if>`. ``{% if %}`` covers all use cases, but if you need to continue using these tags, they can be extracted from Django to a module and included as a built-in tag in the :class:`'builtins' <django.template.backends.django.DjangoTemplates>` option in :setting:`OPTIONS <TEMPLATES-OPTIONS>`.
zh_hans: ``{% ifequal %}`` 和 ``{% ifnotequal %}`` 模板标签已被废弃，改为 :ttag:`{% if %} <if>`。``{% if %}`` 涵盖了所有的用例，但如果你需要继续使用这些标签，可以将它们从 Django 中提取到一个模块中，并作为一个内置标签包含在 :class:`'buildins' <django.template.backends.django.DjangoTemplates>` 选项中的 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 中。

source: ``DEFAULT_HASHING_ALGORITHM`` transitional setting is deprecated.
zh_hans: ``DEFAULT_HASHING_ALGORITHM`` 过渡性配置已废弃。

source: Features removed in 3.1
zh_hans: 3.1 中删除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 3.1.
zh_hans: 这些功能已经到了废弃周期，在 Django 3.1 中被删除。

source: See :ref:`deprecated-features-2.2` for details on these changes, including how to remove usage of these features.
zh_hans: 参见 :ref:`deprecated-features-2.2`，了解这些变化的细节，包括如何删除这些功能的使用。

source: ``django.utils.timezone.FixedOffset`` is removed.
zh_hans: ``django.utils.timezone.FixedOffset`` 被删除。

source: ``django.core.paginator.QuerySetPaginator`` is removed.
zh_hans: ``django.core.paginator.QuerySetPaginator`` 被删除。

source: A model's ``Meta.ordering`` doesn't affect ``GROUP BY`` queries.
zh_hans: 一个模型的 ``Meta.ordering`` 不影响 ``GROUP BY`` 的查询。

source: ``django.contrib.postgres.fields.FloatRangeField`` and ``django.contrib.postgres.forms.FloatRangeField`` are removed.
zh_hans: ``django.contrib.postgres.fields.FloatRangeField`` 和 ``django.contrib.postgres.forms.FloatRangeField`` 被删除。

source: The ``FILE_CHARSET`` setting is removed.
zh_hans: ``FILE_CHARSET`` 配置被删除。

source: ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` is removed.
zh_hans: ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` 被删除。

source: The ``RemoteUserBackend.configure_user()`` method requires ``request`` as the first positional argument.
zh_hans: ``RemoteUserBackend.configure_user()`` 方法需要 ``request`` 作为第一个位置参数。

source: Support for ``SimpleTestCase.allow_database_queries`` and ``TransactionTestCase.multi_db`` is removed.
zh_hans: 取消对 ``SimpleTestCase.allow_database_queries`` 和 ``TransactionTestCase.multi_db`` 的支持。

source: Django 3.1.1 release notes
zh_hans: Django 3.1.1 版本发行说明

source: Django 3.1.1 fixes two security issues and several bugs in 3.1.
zh_hans: Django 3.1.1 修复了 3.1 中的两个安全问题和几个漏洞。

source: Fixed wrapping of translated action labels in the admin's navigation sidebar for East Asian languages (:ticket:`31853`).
zh_hans: 修正了东亚语系管理的导航侧边栏中翻译动作标签的包装问题（:ticket:`31853`）。

source: Fixed wrapping of long model names in the admin's navigation sidebar (:ticket:`31854`).
zh_hans: 修正了管理的导航侧边栏中长模型名称的包装（:ticket:`31854`）。

source: Fixed encoding session data while upgrading multiple instances of the same project to Django 3.1 (:ticket:`31864`).
zh_hans: 修正了同一项目的多个实例升级到 Django 3.1 时的会话数据编码问题（:ticket:`31864`）。

source: Adjusted admin's navigation sidebar template to reduce debug logging when rendering (:ticket:`31865`).
zh_hans: 调整了管理的导航侧栏模板，减少渲染时的调试日志（:ticket:`31865`）。

source: Fixed a regression in Django 3.1 that caused a crash when decoding an invalid session data (:ticket:`31895`).
zh_hans: 修正了 Django 3.1 中一个在解码无效会话数据时导致崩溃的缺陷（:ticket:`31895`）。

source: Reverted a deprecation in Django 3.1 that caused a crash when passing deprecated keyword arguments to a queryset in ``TemplateView.get_context_data()`` (:ticket:`31877`).
zh_hans: 纠正了 Django 3.1 中的一个弃用问题，该问题在 ``TemplateView.get_context_data()`` 中传递废弃的关键字参数到查询集时导致崩溃（:ticket:`31877`）。

source: Enforced thread sensitivity of the :class:`MiddlewareMixin.process_request() <django.utils.deprecation.MiddlewareMixin>` and ``process_response()`` hooks when in an async context (:ticket:`31905`).
zh_hans: 在异步上下文中（:ticket:`31905`），强制执行 :class:`MiddlewareMixin.process_request() <django.utils.deprecation.MiddlewareMixin>` 和 ``process_response()`` 钩子的线程敏感性。

source: Fixed ``__in`` lookup on key transforms for :class:`~django.db.models.JSONField` with MariaDB, MySQL, Oracle, and SQLite (:ticket:`31936`).
zh_hans: 修正了 :class:`~django.db.models.JSONField` 与 MariaDB、MySQL、Oracle 和 SQLite 的键转换时的 ``__in`` 查找（:ticket:`31936`）。

source: Fixed a regression in Django 3.1 that caused permission errors in ``CommonPasswordValidator`` and ``settings.py`` generated by the :djadmin:`startproject` command, when user didn't have permissions to all intermediate directories in a Django installation path (:ticket:`31912`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当用户对 Django 安装路径中的所有中间目录没有权限时， :djadmin:`startproject` 命令生成的 ``CommonPasswordValidator`` 和 ``settings.py`` 会导致权限错误（:ticket:`31912`）。

source: Fixed detecting an async ``get_response`` callable in various builtin middlewares (:ticket:`31928`).
zh_hans: 修正了在各种内置中间件中检测到异步 ``get_response`` 可调用对象的问题（:ticket:`31928`）。

source: Fixed a ``QuerySet.order_by()`` crash on PostgreSQL when ordering and grouping by :class:`~django.db.models.JSONField` with a custom :attr:`~django.db.models.JSONField.decoder` (:ticket:`31956`). As a consequence, fetching a ``JSONField`` with raw SQL now returns a string instead of preloaded data. You will need to explicitly call ``json.loads()`` in such cases.
zh_hans: 修复了在 PostgreSQL 上对具有自定义 :attr:`~django.db.models.JSONField.decoder` 的 :class:`~django.db.models.JSONField` 进行排序和分组时导致的 ``QuerySet.order_by()`` 崩溃问题 (:ticket:`31956`)。因此，在使用原始 SQL 获取 ``JSONField`` 时，现在返回一个字符串而不是预加载的数据。在这种情况下，您需要明确调用 ``json.loads()``。

source: Fixed a ``QuerySet.delete()`` crash on MySQL, following a performance regression in Django 3.1 on MariaDB 10.3.2+, when filtering against an aggregate function (:ticket:`31965`).
zh_hans: 修正了 MySQL 上的 ``QuerySet.delete()`` 崩溃问题，这是在 MariaDB 10.3.2+ 上的 Django 3.1 中出现的性能倒退，当对一个聚合函数（:ticket:`31965`）进行过滤时。

source: Fixed a ``django.contrib.admin.EmptyFieldListFilter`` crash when using on reverse relations (:ticket:`31952`).
zh_hans: 修正了 ``django.contrib.admin.EmptyFieldListFilter`` 在反向关系上使用时崩溃的问题（:ticket:`31952`）。

source: Prevented content overflowing in the admin changelist view when the navigation sidebar is enabled (:ticket:`31901`).
zh_hans: 防止在启用导航侧栏时，内容溢出到管理的变更列表视图中（:ticket:`31901`）。

source: Django 3.1.10 release notes
zh_hans: Django 3.1.10 版本发行说明

source: Django 3.1.10 fixes a security issue in 3.1.9.
zh_hans: Django 3.1.10 修复了 3.1.9 中的一个安全问题。

source: Django 3.1.11 release notes
zh_hans: Django 3.1.11 版本发行说明

source: Django 3.1.11 fixes a regression in 3.1.9.
zh_hans: Django 3.1.11 修复了 3.1.9 中的一个缺陷。

source: Fixed a regression in Django 3.1.9 where saving ``FileField`` would raise a ``SuspiciousFileOperation`` even when a custom :attr:`~django.db.models.FileField.upload_to` returns a valid file path (:ticket:`32718`).
zh_hans: 修正了 Django 3.1.9 中的一个缺陷，即保存 ``FileField`` 会引发 ``SuspiciousFileOperation``，即使自定义 :attr:`~django.db.models.FileField.upload_to` 返回了有效的文件路径（:ticket:`32718`）。

source: Django 3.1.12 release notes
zh_hans: Django 3.1.12 版本发行说明

source: Django 3.1.12 fixes two security issues in 3.1.11.
zh_hans: Django 3.1.12 修复了 3.1.11 中的两个安全问题。

source: Django 3.1.13 release notes
zh_hans: Django 3.1.13 版本发行说明

source: *July 1, 2021*
zh_hans: *2021 年 7 月 1 日*

source: Django 3.1.13 fixes a security issue with severity "high" in 3.1.12.
zh_hans: Django 3.1.13 修复了 3.1.12 中严重程度为 “高” 的安全问题。

source: CVE-2021-35042: Potential SQL injection via unsanitized ``QuerySet.order_by()`` input
zh_hans: CVE-2021-35042：通过未检验的 ``QuerySet.order_by()`` 输入进行潜在的 SQL 注入

source: Unsanitized user input passed to ``QuerySet.order_by()`` could bypass intended column reference validation in path marked for deprecation resulting in a potential SQL injection even if a deprecation warning is emitted.
zh_hans: 传递给 ``QuerySet.order_by()`` 的未经检验的用户输入可能会绕过标记为废弃的路径中的预期列引用验证，导致潜在的 SQL 注入，即使已发出废弃警告。

source: As a mitigation the strict column reference validation was restored for the duration of the deprecation period. This regression appeared in 3.1 as a side effect of fixing :ticket:`31426`.
zh_hans: 作为一种缓解措施，严格的列引用验证在废弃期间被恢复了。这个缺陷出现在 3.1 中，是修复 :ticket:`31426` 的副作用。

source: The issue is not present in the main branch as the deprecated path has been removed.
zh_hans: 这个问题不存在于主分支中，因为废弃的路径已经被删除。

source: Django 3.1.14 release notes
zh_hans: Django 3.1.14 版本发行说明

source: Django 3.1.14 fixes a security issue with severity "low" in 3.1.13.
zh_hans: Django 3.1.14 修复了 3.1.13 版本中一个严重程度为"低"的安全问题。

source: Django 3.1.2 release notes
zh_hans: Django 3.1.2 版本发行说明

source: *October 1, 2020*
zh_hans: *2020 年 10 月 1 日*

source: Django 3.1.2 fixes several bugs in 3.1.1.
zh_hans: Django 3.1.2 修复了 3.1.1 中的几个漏洞。

source: Fixed a bug in Django 3.1 where ``FileField`` instances with a callable storage were not correctly deconstructed (:ticket:`31941`).
zh_hans: 修正了 Django 3.1 中的一个漏洞，即在 Django 3.1 中，带有可调用对象存储的 ``FileField`` 实例不能正确解构（:ticket:`31941`）。

source: Fixed a regression in Django 3.1 where the :attr:`.QuerySet.ordered` attribute returned incorrectly ``True`` for ``GROUP BY`` queries (e.g. ``.annotate().values()``) on models with ``Meta.ordering``. A model's ``Meta.ordering`` doesn't affect such queries (:ticket:`31990`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，在 Django 3.1 中，对于有 ``Meta.ordering`` 的模型上的 ``GROUP BY`` 查询（例如 ``.annotate().values()``）， :attr:`.QuerySet.ordered` 属性会错误地返回 ``True``。模型的 ``Meta.ordering`` 不影响此类查询（:ticket:`31990`）。

source: Fixed a regression in Django 3.1 where a queryset would crash if it contained an aggregation and a ``Q`` object annotation (:ticket:`32007`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，即如果一个查询集包含一个聚合和一个 ``Q`` 对象注解（:ticket:`32007`），它就会崩溃。

source: Fixed a bug in Django 3.1 where a test database was not synced during creation when using the :setting:`MIGRATE <TEST_MIGRATE>` test database setting (:ticket:`32012`).
zh_hans: 修正了 Django 3.1 中的一个漏洞，当使用 :setting:`MIGRATE <TEST_MIGRATE>` 测试数据库配置（:ticket:`32012`）时，测试数据库在创建过程中没有同步。

source: Fixed a ``django.contrib.admin.EmptyFieldListFilter`` crash when using on a ``GenericRelation`` (:ticket:`32038`).
zh_hans: 修正了 ``django.contrib.admin.EmptyFieldListFilter`` 在 ``GenericRelation`` 上使用时崩溃的问题（:ticket:`32038`）。

source: Fixed a regression in Django 3.1.1 where the admin changelist filter sidebar would not scroll for a long list of available filters (:ticket:`31986`).
zh_hans: 修正了 Django 3.1.1 中的一个缺陷，即对于一个长的可用过滤器列表（:ticket:`31986`），管理的变更列表过滤侧边栏不会滚动。

source: Django 3.1.3 release notes
zh_hans: Django 3.1.3 版本发行说明

source: Django 3.1.3 fixes several bugs in 3.1.2 and adds compatibility with Python 3.9.
zh_hans: Django 3.1.3 修复了 3.1.2 中的几个漏洞，并增加了对 Python 3.9 的兼容性。

source: Fixed a regression in Django 3.1.2 that caused the incorrect height of the admin changelist search bar (:ticket:`32072`).
zh_hans: 修正了 Django 3.1.2 中的一个缺陷，该问题导致管理员变更列表搜索栏的高度不正确（:ticket:`32072`）。

source: Fixed a regression in Django 3.1.2 that caused the incorrect width of the admin changelist search bar on a filtered page (:ticket:`32091`).
zh_hans: 修正了 Django 3.1.2 中的一个缺陷，该问题导致在过滤页面上的管理的变更列表搜索栏宽度不正确（:ticket:`32091`）。

source: Fixed displaying Unicode characters in :class:`forms.JSONField <django.forms.JSONField>` and read-only :class:`models.JSONField <django.db.models.JSONField>` values in the admin (:ticket:`32080`).
zh_hans: 修正了在管理（:ticket:`32080`）的 :class:`forms.JSONField <django.forms.JSONField>` 和只读 :class:`models.JSONField <django.db.models.JSONField>` 值中显示 Unicode 字符的问题。

source: Fixed a regression in Django 3.1 that caused a crash of :class:`~django.contrib.postgres.aggregates.ArrayAgg` and :class:`~django.contrib.postgres.aggregates.StringAgg` with ``ordering`` on key transforms for :class:`~django.db.models.JSONField` (:ticket:`32096`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，该问题导致 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg` 在 :class:`~django.db.models.JSONField` 的键出现 ``ordering`` 时进行变换会导致崩溃（:ticket:`32096`）。

source: Fixed a regression in Django 3.1 that caused a crash of ``__in`` lookup when using key transforms for :class:`~django.db.models.JSONField` in the lookup value (:ticket:`32096`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当在查询值（:ticket:`32096`）中使用 :class:`~django.db.models.JSONField` 的键变换时，导致 ``__in`` 查询崩溃。

source: Fixed a regression in Django 3.1 that caused a crash of :class:`~django.db.models.ExpressionWrapper` with key transforms for :class:`~django.db.models.JSONField` (:ticket:`32096`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，该问题导致 :class:`~django.db.models.ExpressionWrapper` 与 :class:`~django.db.models.JSONField` （:ticket:`32096`）的键变换崩溃。

source: Fixed a regression in Django 3.1 that caused a migrations crash on PostgreSQL when adding an :class:`~django.contrib.postgres.constraints.ExclusionConstraint` with key transforms for :class:`~django.db.models.JSONField` in ``expressions`` (:ticket:`32096`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当在 ``expressions`` 中为 :class:`~django.contrib.postgres.constraints.ExclusionConstraint` 添加一个 :class:`~django.db.models.JSONField` 的键变换时，会导致 PostgreSQL 的迁移崩溃（:ticket:`32096`）。

source: Fixed a regression in Django 3.1 where :exc:`ProtectedError.protected_objects <django.db.models.ProtectedError>` and :exc:`RestrictedError.restricted_objects <django.db.models.RestrictedError>` attributes returned iterators instead of :py:class:`set` of objects (:ticket:`32107`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，即 :exc:`ProtectedError.protected_objects <django.db.models.ProtectedError>` 和 :exc:`RestrictedError.restricted_objects <django.db.models.RestrictedError>` 属性返回的是迭代器，而不是 :py:class:`set` 对象（:ticket:`32107`）。

source: Fixed a regression in Django 3.1.2 that caused incorrect form input layout on small screens in the admin change form view (:ticket:`32069`).
zh_hans: 修正了 Django 3.1.2 中的一个缺陷，该问题导致管理员更改表单视图中小屏幕的表单输入布局不正确（:ticket:`32069`）。

source: Fixed a regression in Django 3.1 that invalidated pre-Django 3.1 password reset tokens (:ticket:`32130`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，它使 Django 3.1 之前的密码重置令牌无效（:ticket:`32130`）。

source: Added support for ``asgiref`` 3.3 (:ticket:`32128`).
zh_hans: 增加了对 ``asgiref`` 3.3 的支持（:ticket:`32128`）。
