Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Support for query lookups using the model name when ``Meta.default_related_name`` is set is removed.
id: Mendukung permintaan pencarian menggunakan nama model ketika ``Meta.default_related_name``disetel dipindahkan.
zh_hans: 当设置了 ``Meta.default_related_name`` 时，不再支持使用模型名称进行查询查找。

source: The MySQL ``__search`` lookup is removed.
id: Pencarian ``__search`` MySQL dipindahkan.
zh_hans: MySQL 中的 ``__search`` 查找已被移除。

source: The shim for supporting custom related manager classes without a ``_apply_rel_filters()`` method is removed.
zh_hans: 移除了支持自定义相关管理器类但没有 ``_apply_rel_filters()`` 方法的 shim。

source: Using ``User.is_authenticated()`` and ``User.is_anonymous()`` as methods rather than properties is no longer supported.
zh_hans: 不再支持将 ``User.is_authenticated()`` 和 ``User.is_anonymous()`` 作为方法使用，而不是属性。

source: The ``Model._meta.virtual_fields`` attribute is removed.
id: Atribut ``Model._meta.virtual_fields`` dipindahkan.
zh_hans: ``Model._meta.virtual_fields`` 属性已被移除。

source: The keyword arguments ``virtual_only`` in ``Field.contribute_to_class()`` and ``virtual`` in ``Model._meta.add_field()`` are removed.
zh_hans: ``Field.contribute_to_class()`` 中的关键字参数 ``virtual_only`` 和 ``Model._meta.add_field()`` 中的 ``virtual`` 已被移除。

source: The ``javascript_catalog()`` and ``json_catalog()`` views are removed.
id: Tampilan ``javascript_catalog()`` dan ``json_catalog()`` dipindahkan.
zh_hans: ``javascript_catalog()`` 和 ``json_catalog()`` 视图已被移除。

source: ``django.contrib.gis.utils.precision_wkt()`` is removed.
id: ``django.contrib.gis.utils.precision_wkt()`` dipindahkan.
zh_hans: ``django.contrib.gis.utils.precision_wkt()`` 已被移除。

source: In multi-table inheritance, implicit promotion of a ``OneToOneField`` to a ``parent_link`` is removed.
zh_hans: 在多表继承中，不再隐式将 ``OneToOneField`` 提升为 ``parent_link``。

source: Support for ``Widget._format_value()`` is removed.
id: Dukungan untuk ``Widget._format_value()`` dipindahkan.
zh_hans: 不再支持 ``Widget._format_value()``。

source: ``FileField`` methods ``get_directory_name()`` and ``get_filename()`` are removed.
id: Metode-metode ``FileField`` `get_directory_name()`` dan ``get_filename()`` dipindahkan.
zh_hans: ``FileField`` 的方法 ``get_directory_name()`` 和 ``get_filename()`` 已被移除。

source: The ``mark_for_escaping()`` function and the classes it uses: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, and ``EscapeUnicode`` are removed.
id: Fungsi ``mark_for_escaping()`` dan kelas-kelas yang digunakan: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, dan ``EscapeUnicode`` dipindahkan.
zh_hans: ``mark_for_escaping()`` 函数以及它使用的类：``EscapeData``、``EscapeBytes``、``EscapeText``、``EscapeString`` 和 ``EscapeUnicode`` 都已被移除。

source: The ``escape`` filter now uses ``django.utils.html.conditional_escape()``.
id: Penyaring ``escape`` sekarang menggunakan ``django.utils.html.conditional_escape()``.
zh_hans: ``escape`` 过滤器现在使用 ``django.utils.html.conditional_escape()``。

source: ``Manager.use_for_related_fields`` is removed.
id: ``Manager.use_for_related_fields`` dipindahkan.
zh_hans: ``Manager.use_for_related_fields`` 已被移除。

source: Model ``Manager`` inheritance follows MRO inheritance rules. The requirement to use ``Meta.manager_inheritance_from_future`` to opt-in to the behavior is removed.
zh_hans: 模型的 ``Manager`` 继承遵循 MRO 继承规则。不再需要使用 ``Meta.manager_inheritance_from_future`` 来选择使用这种行为。

source: Support for old-style middleware using ``settings.MIDDLEWARE_CLASSES`` is removed.
zh_hans: 不再支持使用 ``settings.MIDDLEWARE_CLASSES`` 的老式中间件。

source: Django 2.0.1 release notes
id: Catatan terbitan Django 2.0.1
zh_hans: Django 2.0.1 版本发行说明

source: Django 2.0.1 fixes several bugs in 2.0.
id: Django 2.0.1 memperbaiki beberapa kesalahan dalam 2.0.
zh_hans: Django 2.0.1 修复了 2.0 版本中的一些错误。

source: Reallowed filtering a queryset with ``GeometryField=None`` (:ticket:`28896`).
id: Mengijinkan kembali queryset dengan ``GeometryField=None`` (:ticket:`28896`).
zh_hans: 重新允许使用 ``GeometryField=None`` 对查询集进行筛选（:ticket:`28896`）。

source: Corrected admin check to allow a ``OneToOneField`` in ``ModelAdmin.autocomplete_fields`` (:ticket:`28898`).
zh_hans: 已经纠正了管理员检查，允许在 ``ModelAdmin.autocomplete_fields`` 中使用 ``OneToOneField`` （:ticket:`28898`）。

source: Fixed a regression on SQLite where ``DecimalField`` returned a result with trailing zeros in the fractional part truncated (:ticket:`28915`).
zh_hans: 已修复 SQLite 上的回归问题，其中 ``DecimalField`` 返回的结果在小数部分截断时具有尾随零（:ticket:`28915`）。

source: Fixed crash in the ``testserver`` command startup (:ticket:`28941`).
id: Diperbaiki kegagalan dalam memulai perintah ``testserver`` (:ticket:`28941`).
zh_hans: 已修复 ``testserver`` 命令启动时的崩溃问题（:ticket:`28941`）。

source: Fixed crash when coercing a translatable URL pattern to ``str`` (:ticket:`28947`).
id: Diperbaiki kegagalan ketika memaksa pola URL terjemahan pada ``str`` (:ticket:`28947`).
zh_hans: 已修复将可翻译的 URL 模式强制转换为 ``str`` 时的崩溃问题（:ticket:`28947`）。

source: Fixed crash on SQLite when renaming a field in a model referenced by a ``ManyToManyField`` (:ticket:`28884`).
id: Diperbaiki kegagalan pada SQLite ketika menamai kembali sebuah bidang dalam sebuah model diacukan oleh sebuah ``ManyToManyField`` (:ticket:`28884`).
zh_hans: 已修复在 SQLite 上重命名被 ``ManyToManyField`` 引用的模型中的字段时的崩溃问题（:ticket:`28884`）。

source: Fixed a crash when chaining ``values()`` or ``values_list()`` after ``QuerySet.select_for_update(of=(...))`` (:ticket:`28944`).
id: Diperbaiki sebuah kegagalan ketika mengikat ``values()`` atau ``values_list()`` setelah ``QuerySet.select_for_update(of=(...))`` (:ticket:`28944`).
zh_hans: 已修复在 ``QuerySet.select_for_update(of=(...))`` 之后链式调用 ``values()`` 或 ``values_list()`` 时的崩溃问题（:ticket:`28944`）。

source: Fixed admin changelist crash when using a query expression in the page's ordering (:ticket:`28958`).
id: Diperbaiki kegagalan daftar rubah admin ketika menggunakan sebuah pernyataan permintaan dalam pengurutan halaman (:ticket:`28958`).
zh_hans: 已修复在页面排序中使用查询表达式时管理员 changelist 的崩溃问题（:ticket:`28958`）。

source: Django 2.0.10 release notes
zh_hans: Django 2.0.10 版本发行说明

source: Django 2.0.10 fixes a security issue and several bugs in 2.0.9.
zh_hans: Django 2.0.10 修复了 2.0.9 版本中的一个安全问题和一些错误。

source: Prevented repetitive calls to ``geos_version_tuple()`` in the ``WKBWriter`` class in an attempt to fix a random crash involving ``LooseVersion`` since Django 2.0.6 (:ticket:`29959`).
zh_hans: 尝试修复与 ``LooseVersion`` 相关的随机崩溃问题，防止在 ``WKBWriter`` 类中反复调用 ``geos_version_tuple()`` （:ticket:`29959`）。

source: Fixed a schema corruption issue on SQLite 3.26+. You might have to drop and rebuild your SQLite database if you applied a migration while using an older version of Django with SQLite 3.26 or later (:ticket:`29182`).
zh_hans: 已修复在 SQLite 3.26+ 上的模式损坏问题。如果在使用旧版本的 Django 与 SQLite 3.26 或更高版本时应用了迁移，可能需要删除并重建您的 SQLite 数据库（:ticket:`29182`）。

source: Prevented SQLite schema alterations while foreign key checks are enabled to avoid the possibility of schema corruption (:ticket:`30023`).
zh_hans: 防止在启用外键检查时进行 SQLite 模式更改，以避免可能导致模式损坏的情况发生（:ticket:`30023`）。

source: Django 2.0.11 release notes
zh_hans: Django 2.0.11 版本发行说明

source: Django 2.0.11 fixes a security issue in 2.0.10.
zh_hans: Django 2.0.11 修复了 2.0.10 版本中的一个安全问题。

source: Django 2.0.12 release notes
zh_hans: Django 2.0.12 版本发行说明

source: Django 2.0.12 fixes a packaging error in 2.0.11.
zh_hans: Django 2.0.12 修复了 2.0.11 版本中的打包错误。

source: Corrected packaging error from 2.0.11 (:ticket:`30175`).
zh_hans: 已纠正了来自 2.0.11 的打包错误（:ticket:`30175`）。

source: Django 2.0.13 release notes
zh_hans: Django 2.0.13 版本发行说明

source: *February 12, 2019*
zh_hans: *2019 年 2 月 12 日*

source: Django 2.0.13 fixes a regression in 2.0.12/2.0.11.
zh_hans: Django 2.0.13 修复了 2.0.12 / 2.0.11 版本中的一个回归问题。

source: Fixed crash in ``django.utils.numberformat.format_number()`` when the number has over 200 digits (:ticket:`30177`).
zh_hans: 已修复在数字超过 200 位时导致 ``django.utils.numberformat.format_number()`` 崩溃的问题（:ticket:`30177`）。

source: Django 2.0.2 release notes
zh_hans: Django 2.0.2 版本发行说明

source: Django 2.0.2 fixes a security issue and several bugs in 2.0.1.
zh_hans: Django 2.0.2 修复了 2.0.1 版本中的一个安全问题和一些错误。

source: Fixed hidden content at the bottom of the "The install worked successfully!" page for some languages (:ticket:`28885`).
zh_hans: 已修复某些语言版本的 "安装成功！" 页面底部的隐藏内容问题（:ticket:`28885`）。

source: Fixed regression in the use of ``QuerySet.values_list(..., flat=True)`` followed by ``annotate()`` (:ticket:`29067`).
zh_hans: 已修复在使用 ``QuerySet.values_list(..., flat=True)`` 后跟 ``annotate()`` 时的回归问题（:ticket:`29067`）。

source: Fixed a regression where a queryset that annotates with geometry objects crashes (:ticket:`29054`).
zh_hans: 已修复一个回归问题，其中对包含几何对象的查询集进行注释会导致崩溃（:ticket:`29054`）。

source: Fixed a regression where ``makemigrations`` crashes if a migrations directory doesn't have an ``__init__.py`` file (:ticket:`29091`).
zh_hans: 已修复一个回归问题，其中如果迁移目录没有 ``__init__.py`` 文件，``makemigrations`` 会崩溃（:ticket:`29091`）。

source: Django 2.0.3 release notes
zh_hans: Django 2.0.3 版本发行说明

source: Django 2.0.3 fixes two security issues and several bugs in 2.0.2. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 2.0.3 修复了 2.0.2 版本中的两个安全问题和一些错误。此外，还整合了来自 Transifex 的最新字符串翻译。

source: Fixed a regression that caused sliced ``QuerySet.distinct().order_by()`` followed by ``count()`` to crash (:ticket:`29108`).
zh_hans: 已修复一个回归问题，该问题导致切片的 ``QuerySet.distinct().order_by()`` 后跟 ``count()`` 会导致崩溃（:ticket:`29108`）。

source: Prioritized the datetime and time input formats without ``%f`` for the Thai locale to fix the admin time picker widget displaying "undefined" (:ticket:`29109`).
zh_hans: 优先考虑了在泰国区域设置下没有 ``%f`` 的日期时间和时间输入格式，以修复管理员时间选择器小部件显示 "undefined" 的问题（:ticket:`29109`）。

source: Fixed crash with ``QuerySet.order_by(Exists(...))`` (:ticket:`29118`).
zh_hans: 已修复使用 ``QuerySet.order_by(Exists(...))`` 时的崩溃问题（:ticket:`29118`）。

source: Made ``Q.deconstruct()`` deterministic with multiple keyword arguments (:ticket:`29125`). You may need to modify ``Q``'s in existing migrations, or accept an autogenerated migration.
zh_hans: 使 ``Q.deconstruct()`` 在多个关键字参数的情况下具有确定性（:ticket:`29125`）。您可能需要修改现有迁移中的 ``Q``，或者接受一个自动生成的迁移。

source: Fixed a regression where a ``When()`` expression with a list argument crashes (:ticket:`29166`).
zh_hans: 已修复一个回归问题，其中带有列表参数的 ``When()`` 表达式会导致崩溃（:ticket:`29166`）。

source: Fixed crash when using a ``Window()`` expression in a subquery (:ticket:`29172`).
zh_hans: 已修复在子查询中使用 ``Window()`` 表达式时的崩溃问题（:ticket:`29172`）。

source: Fixed ``AbstractBaseUser.normalize_username()`` crash if the ``username`` argument isn't a string (:ticket:`29176`).
zh_hans: 已修复 ``AbstractBaseUser.normalize_username()`` 在 ``username`` 参数不是字符串时的崩溃问题（:ticket:`29176`）。

source: Django 2.0.4 release notes
zh_hans: Django 2.0.4 版本发行说明

source: Django 2.0.4 fixes several bugs in 2.0.3.
zh_hans: Django 2.0.4 修复了 2.0.3 版本中的一些错误。

source: Fixed a crash when filtering with an ``Exists()`` annotation of a queryset containing a single field (:ticket:`29195`).
zh_hans: 已修复在使用包含单个字段的查询集的 ``Exists()`` 注释进行过滤时的崩溃问题（:ticket:`29195`）。

source: Fixed admin autocomplete widget's translations for ``zh-hans`` and ``zh-hant`` languages (:ticket:`29213`).
zh_hans: 已修复管理员自动完成小部件在 ``zh-hans`` 和 ``zh-hant`` 语言下的翻译问题（:ticket:`29213`）。

source: Corrected admin's autocomplete widget to add a space after custom classes (:ticket:`29221`).
zh_hans: 已纠正管理员的自动完成小部件，以在自定义类之后添加空格（:ticket:`29221`）。

source: Fixed ``PasswordResetConfirmView`` crash when using a user model with a ``UUIDField`` primary key and the reset URL contains an encoded primary key value that decodes to an invalid UUID (:ticket:`29206`).
zh_hans: 已修复在使用具有 ``UUIDField`` 主键的用户模型且重置 URL 包含解码为无效 UUID 的编码主键值时，``PasswordResetConfirmView`` 的崩溃问题（:ticket:`29206`）。

source: Fixed a regression in Django 2.0 where ``OpenLayersWidget`` deserialization ignored the widget map's SRID and assumed 4326 (WGS84) (:ticket:`29116`).
zh_hans: 已修复 Django 2.0 中的回归问题，其中 ``OpenLayersWidget`` 反序列化忽略了小部件地图的 SRID 并假设为 4326（WGS84）（:ticket:`29116`）。

source: Django 2.0.5 release notes
zh_hans: Django 2.0.5 版本发行说明

source: Django 2.0.5 fixes several bugs in 2.0.4.
zh_hans: Django 2.0.5 修复了 2.0.4 版本中的一些错误。

source: Corrected the import paths that ``inspectdb`` generates for ``django.contrib.postgres`` fields (:ticket:`29307`).
zh_hans: 已纠正 ``inspectdb`` 为 ``django.contrib.postgres`` 字段生成的导入路径（:ticket:`29307`）。

source: Fixed a regression in Django 2.0.4 where ``QuerySet.values()`` or ``values_list()`` after combining an annotated and unannotated queryset with ``union()``, ``difference()``, or ``intersection()`` crashed due to mismatching columns (:ticket:`29286`).
zh_hans: 已修复 Django 2.0.4 中的回归问题，其中在使用 ``union()``, ``difference()`` 或 ``intersection()`` 合并已注释和未注释的查询集后，调用 ``QuerySet.values()`` 或 ``values_list()`` 会因列不匹配而崩溃（:ticket:`29286`）。

source: Django 2.0.6 release notes
zh_hans: Django 2.0.6 版本发行说明

source: *June 1, 2018*
zh_hans: *2018 年 6 月 1 日*

source: Django 2.0.6 fixes several bugs in 2.0.5.
zh_hans: Django 2.0.6 修复了 2.0.5 版本中的一些错误。

source: Fixed a regression that broke custom template filters that use decorators (:ticket:`29400`).
zh_hans: 已修复导致破坏使用装饰器的自定义模板过滤器的回归问题（:ticket:`29400`）。

source: Fixed detection of custom URL converters in included patterns (:ticket:`29415`).
zh_hans: 已修复对包含模式中自定义 URL 转换器的检测问题（:ticket:`29415`）。

source: Fixed a regression that added an unnecessary subquery to the ``GROUP BY`` clause on MySQL when using a ``RawSQL`` annotation (:ticket:`29416`).
zh_hans: 已修复在使用 ``RawSQL`` 注释时，在 MySQL 上向 ``GROUP BY`` 子句添加不必要的子查询的回归问题（:ticket:`29416`）。

source: Django 2.0.7 release notes
zh_hans: Django 2.0.7 版本发行说明

source: Django 2.0.7 fixes several bugs in 2.0.6.
zh_hans: Django 2.0.7 修复了 2.0.6 版本中的一些错误。

source: Fixed admin changelist crash when using a query expression without ``asc()`` or ``desc()`` in the page's ordering (:ticket:`29428`).
zh_hans: 已修复管理员 changelist 在页面排序中使用没有 ``asc()`` 或 ``desc()`` 的查询表达式时的崩溃问题（:ticket:`29428`）。

source: Fixed admin check crash when using a query expression in ``ModelAdmin.ordering`` (:ticket:`29428`).
zh_hans: 已修复在 ``ModelAdmin.ordering`` 中使用查询表达式时，导致管理员检查崩溃的问题（:ticket:`29428`）。

source: Fixed ``__regex`` and ``__iregex`` lookups with MySQL 8 (:ticket:`29451`).
zh_hans: 已修复与 MySQL 8 中的 ``__regex`` 和 ``__iregex`` 查找相关的问题（:ticket:`29451`）。

source: Fixed migrations crash with namespace packages on Python 3.7 (:ticket:`28814`).
zh_hans: 已修复在 Python 3.7 上使用命名空间包时导致迁移崩溃的问题（:ticket:`28814`）。

source: Django 2.0.8 release notes
zh_hans: Django 2.0.8 版本发行说明

source: Django 2.0.8 fixes a security issue and several bugs in 2.0.7.
zh_hans: Django 2.0.8 修复了 2.0.7 版本中的一个安全问题和一些错误。

source: Fixed a regression in Django 2.0.7 that broke the ``regex`` lookup on MariaDB (even though MariaDB isn't officially supported) (:ticket:`29544`).
zh_hans: 已修复 Django 2.0.7 中的回归问题，该问题破坏了对 MariaDB 上的 ``regex`` 查找（尽管 MariaDB 并未得到官方支持）（:ticket:`29544`）。

source: Fixed a regression where ``django.template.Template`` crashed if the ``template_string`` argument is lazy (:ticket:`29617`).
zh_hans: 已修复回归问题，其中如果 ``template_string`` 参数是懒惰的，则 ``django.template.Template`` 会崩溃（:ticket:`29617`）。

source: Django 2.0.9 release notes
zh_hans: Django 2.0.9 版本发行说明

source: Django 2.0.9 fixes a data loss bug in 2.0.8.
zh_hans: Django 2.0.9 修复了 2.0.8 版本中的一个数据丢失错误。

source: Django 2.1 release notes
zh_hans: Django 2.1 版本发行说明

source: Welcome to Django 2.1!
zh_hans: 欢迎使用 Django 2.1 ！

source: These release notes cover the :ref:`new features <whats-new-2.1>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-2.1>` you'll want to be aware of when upgrading from Django 2.0 or earlier. We've :ref:`dropped some features<removed-features-2.1>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-2.1>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-2.1>`，以及从 Django 2.0 或更早版本升级时需要注意的 :ref:`不兼容变更 <backwards-incompatible-2.1>`。我们已经 :ref:`删除了一些功能 <removed-features-2.1>`，这些功能已经到达了他们的弃用周期的末端，并且我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-2.1>`。

source: Django 2.1 supports Python 3.5, 3.6, and 3.7. Django 2.0 is the last version to support Python 3.4. We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 2.1 支持 Python 3.5、3.6 和 3.7。Django 2.0 是最后一个支持 Python 3.4 的版本。我们 **强烈推荐** 并且只官方支持每个系列的最新发布版本。

source: What's new in Django 2.1
zh_hans: Django 2.1 的新特性是什么？

source: Model "view" permission
zh_hans: 模型的“查看”权限

source: A "view" permission is added to the model :attr:`Meta.default_permissions <django.db.models.Options.default_permissions>`. The new permissions will be created automatically when running :djadmin:`migrate`.
zh_hans: 模型的 :attr:`Meta.default_permissions <django.db.models.Options.default_permissions>` 属性中添加了 "view" 权限。这些新权限将在运行 :djadmin:`migrate` 时自动创建。

source: This allows giving users read-only access to models in the admin. :meth:`.ModelAdmin.has_view_permission` is new. The implementation is backwards compatible in that there isn't a need to assign the "view" permission to allow users who have the "change" permission to edit objects.
zh_hans: 这允许将用户赋予对管理员中的模型的只读访问权限。新增了 :meth:`.ModelAdmin.has_view_permission`。该实现是向后兼容的，不需要分配 "view" 权限以允许拥有 "change" 权限的用户编辑对象。

source: There are a couple of :ref:`backwards incompatible considerations <view_permission_backwards_incompatible>`.
zh_hans: 有一些 :ref:`不兼容考虑 <view_permission_backwards_incompatible>`。

source: :attr:`.ModelAdmin.search_fields` now accepts any lookup such as ``field__exact``.
zh_hans: 现在，:attr:`.ModelAdmin.search_fields` 接受任何查找，如 ``field__exact``。

source: jQuery is upgraded from version 2.2.3 to 3.3.1.
zh_hans: jQuery 的版本已从 2.2.3 升级到 3.3.1 。

source: The new :meth:`.ModelAdmin.delete_queryset` method allows customizing the deletion process of the "delete selected objects" action.
zh_hans: 新的 :meth:`.ModelAdmin.delete_queryset` 方法允许自定义 "删除选定对象" 操作的删除过程。

source: You can now :ref:`override the default admin site <overriding-default-admin-site>`.
zh_hans: 现在你可以 :ref:`覆盖默认的管理站点 <overriding-default-admin-site>`。

source: The new :attr:`.ModelAdmin.sortable_by` attribute and :meth:`.ModelAdmin.get_sortable_by` method allow limiting the columns that can be sorted in the change list page.
zh_hans: 新的 :attr:`.ModelAdmin.sortable_by` 属性和 :meth:`.ModelAdmin.get_sortable_by` 方法允许限制可以在更改列表页面中排序的列。

source: The ``admin_order_field`` attribute for elements in :attr:`.ModelAdmin.list_display` may now be a query expression.
zh_hans: 在 :attr:`.ModelAdmin.list_display` 中的元素的 ``admin_order_field`` 属性现在可以是一个查询表达式。

source: The new :meth:`.ModelAdmin.get_deleted_objects()` method allows customizing the deletion process of the delete view and the "delete selected" action.
zh_hans: 新的 :meth:`.ModelAdmin.get_deleted_objects()` 方法允许自定义删除视图和 "删除选定" 操作的删除过程。

source: The ``actions.html``, ``change_list_results.html``, ``date_hierarchy.html``, ``pagination.html``, ``prepopulated_fields_js.html``, ``search_form.html``, and ``submit_line.html`` templates can now be :ref:`overridden per app or per model <admin-templates-overridden-per-app-or-model>` (besides overridden globally).
zh_hans: ``actions.html``、``change_list_results.html``、``date_hierarchy.html``、``pagination.html``、``prepopulated_fields_js.html``、``search_form.html`` 和 ``submit_line.html`` 模板现在可以在每个应用程序或每个模型的基础上 :ref:`被覆盖 <admin-templates-overridden-per-app-or-model>` （除了全局覆盖）。

source: The admin change list and change form object tools can now be :ref:`overridden per app, per model, or globally <admin-templates-overridden-per-app-or-model>` with ``change_list_object_tools.html`` and ``change_form_object_tools.html`` templates.
zh_hans: 管理员更改列表和更改表单对象工具现在可以在每个应用程序、每个模型或全局 :ref:`被覆盖 <admin-templates-overridden-per-app-or-model>`，使用 ``change_list_object_tools.html`` 和 ``change_form_object_tools.html`` 模板。

source: :meth:`.InlineModelAdmin.has_add_permission` is now passed the parent object as the second positional argument, ``obj``.
zh_hans: :meth:`.InlineModelAdmin.has_add_permission` 现在将父对象作为第二个位置参数传递，``obj``。

source: Admin actions may now :ref:`specify permissions <admin-action-permissions>` to limit their availability to certain users.
zh_hans: 管理员操作现在可以 :ref:`指定权限 <admin-action-permissions>` 以限制它们对某些用户的可用性。

source: :djadmin:`createsuperuser` now gives a prompt to allow bypassing the :setting:`AUTH_PASSWORD_VALIDATORS` checks.
zh_hans: :djadmin:`createsuperuser` 现在会提示是否允许绕过 :setting:`AUTH_PASSWORD_VALIDATORS` 检查。

source: The new :meth:`.GEOSGeometry.buffer_with_style` method is a version of :meth:`~.GEOSGeometry.buffer` that allows customizing the style of the buffer.
zh_hans: 新的 :meth:`.GEOSGeometry.buffer_with_style` 方法是 :meth:`~.GEOSGeometry.buffer` 的一个版本，允许自定义缓冲区的样式。

source: :class:`~django.contrib.gis.forms.widgets.OpenLayersWidget` is now based on OpenLayers 4.6.5 (previously 3.20.1).
zh_hans: :class:`~django.contrib.gis.forms.widgets.OpenLayersWidget` 现在基于 OpenLayers 4.6.5（之前是 3.20.1）。

source: Added the :setting:`SESSION_COOKIE_SAMESITE` setting to set the ``SameSite`` cookie flag on session cookies.
zh_hans: 添加了 :setting:`SESSION_COOKIE_SAMESITE` 设置，用于在会话 cookie 上设置 ``SameSite`` cookie 标志。

source: The :ref:`local-memory cache backend <local-memory-caching>` now uses a least-recently-used (LRU) culling strategy rather than a pseudo-random one.
zh_hans: :ref:`本地内存缓存后端 <local-memory-caching>` 现在使用最近最少使用（LRU）的淘汰策略，而不是伪随机策略。

source: The new :meth:`~django.core.cache.cache.touch` method of the :ref:`low-level cache API <low-level-cache-api>` updates the timeout of cache keys.
zh_hans: :ref:`低级缓存 API <low-level-cache-api>` 的新方法 :meth:`~django.core.cache.cache.touch` 可以更新缓存键的超时时间。

source: Added the :setting:`CSRF_COOKIE_SAMESITE` setting to set the ``SameSite`` cookie flag on CSRF cookies.
zh_hans: 添加了 :setting:`CSRF_COOKIE_SAMESITE` 设置，用于在 CSRF cookie 上设置 ``SameSite`` cookie 标志。

source: The widget for ``ImageField`` now renders with the HTML attribute ``accept="image/*"``.
zh_hans: ``ImageField`` 的小部件现在以带有 HTML 属性 ``accept="image/*"`` 渲染。

source: Added the :meth:`~django.utils.translation.get_supported_language_variant` function.
zh_hans: 添加了 :meth:`~django.utils.translation.get_supported_language_variant` 函数。

source: Untranslated strings for territorial language variants now use the translations of the generic language. For example, untranslated ``pt_BR`` strings use ``pt`` translations.
zh_hans: 领土语言变体的未翻译字符串现在使用通用语言的翻译。例如，未翻译的 ``pt_BR`` 字符串使用 ``pt`` 的翻译。

source: The new :option:`inspectdb --include-views` option allows creating models for database views.
zh_hans: 新的 :option:`inspectdb --include-views` 选项允许为数据库视图创建模型。

source: The :class:`~django.core.management.BaseCommand` class now uses a custom help formatter so that the standard options like ``--verbosity`` or ``--settings`` appear last in the help output, giving a more prominent position to subclassed command's options.
zh_hans: :class:`~django.core.management.BaseCommand` 类现在使用自定义的帮助格式化程序，以使标准选项如 ``--verbosity`` 或 ``--settings`` 出现在帮助输出的最后，从而为子类命令的选项提供更突出的位置。

source: Added support for serialization of ``functools.partialmethod`` objects.
zh_hans: 添加了对 ``functools.partialmethod`` 对象的序列化支持。

source: To support frozen environments, migrations may be loaded from ``.pyc`` files.
zh_hans: 为了支持冻结的环境，迁移可以从 ``.pyc`` 文件中加载。

source: Models can now use ``__init_subclass__()`` from :pep:`487`.
zh_hans: 模型现在可以使用来自 :pep:`487` 的 ``__init_subclass__()`` 方法。

source: A ``BinaryField`` may now be set to ``editable=True`` if you wish to include it in model forms.
zh_hans: 如果希望将它包含在模型表单中，可以将 ``BinaryField`` 设置为 ``editable=True``。
