Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``contrib.auth`` password reset hash
id: Aakan penyetelan kembali sandi ``contrib.auth``
zh_hans: ``contrib.auth`` 密码重置哈希

source: Consequences: Password reset links from before the upgrade will not work.
id: Konsekuensi: Tautan setel kembai sandi dari sebelum peningkatan tidak akan bekerja.
zh_hans: 后果：升级前的密码重置链接将无法使用。

source: Time period: Defined by ``PASSWORD_RESET_TIMEOUT_DAYS``.
zh_hans: 时间段：由 ``PASSWORD_RESET_TIMEOUT_DAYS`` 定义。

source: Form-related hashes: these have a much shorter lifetime and are relevant only for the short window where a user might fill in a form generated by the pre-upgrade Django instance and try to submit it to the upgraded Django instance:
zh_hans: 与表单相关的哈希：它们的生命周期要短得多，仅与用户可能填写由升级前的 Django 实例生成的表单并尝试将其提交到升级后的 Django 实例的短暂窗口期相关。

source: ``contrib.comments`` form security hash
id: Campuran keamanan formulir ``contrib.comments``
zh_hans: ``contrib.comments`` 表单安全哈希

source: Consequences: The user will see the validation error "Security hash failed."
id: Konsekuensi: penggunakan akan melihat kesalahan pengesahan "Security hash failed."
zh_hans: 后果：用户将看到验证错误 "安全哈希失败。"

source: Time period: The amount of time you expect users to take filling out comment forms.
id: Periode waktu: Sejumlah waktu anda harapkan pengguna mengisi formulir komentar.
zh_hans: 时间周期：您预期用户填写评论表单所需的时间。

source: ``FormWizard`` security hash
id: Campuran keamanan ``FormWizard``
zh_hans: ``FormWizard`` 安全哈希

source: Consequences: The user will see an error about the form having expired and will be sent back to the first page of the wizard, losing the data entered so far.
id: Konsekuensi: Pengguna akan melihat sebuah kesalahan tentang formulir memiliki kadaluarsa dan akan dikirim kembali ke halaman pertama dari wizard, kehilangan data dimasukkan sejauh ini.
zh_hans: 后果：用户将看到关于表单已过期的错误，并被退回到向导的第一页，迄今为止输入的数据将丢失。

source: Time period: The amount of time you expect users to take filling out the affected forms.
id: Periode waktu: Sejumlah waktu anda harapkan pengguna mengisi formulir terpengaruh.
zh_hans: 时间周期：您预期用户填写受影响表单所需的时间。

source: CSRF check
id: Pemeriksaan CSRF
zh_hans: CSRF 检查

source: Note: This is actually a Django 1.1 fallback, not Django 1.2, and it applies only if you're upgrading from 1.1.
id: Catat: Ini adalah sebenarnya sebuah fallback Django 1.1, bukan Django 1.2, dan itu berlaku hanya jika anda sedang meningkatkan dari 1.1.
zh_hans: 注意：这实际上是一个从 Django 1.1 回退，而不是 Django 1.2，仅在您从 1.1 升级时适用。

source: Consequences: The user will see a 403 error with any CSRF-protected POST form.
id: Konsekuensi: Pengguna akan melihat kesalahan 403 dengan formulir POST dilindungi-CSRF.
zh_hans: 后果：用户在任何受 CSRF 保护的 POST 表单中都会看到 403 错误。

source: Time period: The amount of time you expect user to take filling out such forms.
id: Periode waktu: Sejumlah waktu anda harapkan pengguna mengisi formulir seperti itu.
zh_hans: 时间周期：您预期用户填写此类表单所需的时间。

source: ``contrib.auth`` user password hash-upgrade sequence
id: Urutan peningkatan-campuran sandi pengguna ``contrib.auth``
zh_hans: ``contrib.auth`` 用户密码升级哈希序列

source: Consequences: Each user's password will be updated to a stronger password hash when it's written to the database in 1.4. This means that if you upgrade to 1.4 and then need to downgrade to 1.3, version 1.3 won't be able to read the updated passwords.
id: Konsekuensi: Setiap sandi pengguna akan diperbaharui ke acakan sandi terkuat ketika itu ditulis ke basisdata di 1.4. Ini berarti bahwa jika anda meningkatkan ke 1.4 dan kemudian butuh untuk menurunkan ke 1.3, versi 1.3 tidak akan dapat membaca sandi terperbaharui.
zh_hans: 后果：在 1.4 版本中，每个用户的密码将在写入数据库时更新为更强的密码散列。这意味着如果您升级到 1.4 然后需要降级到 1.3，1.3 版本将无法读取更新后的密码。

source: Remedy: Set :setting:`PASSWORD_HASHERS` to use your original password hashing when you initially upgrade to 1.4. After you confirm your app works well with Django 1.4 and you won't have to roll back to 1.3, enable the new password hashes.
id: Memperbaiki: Setel :setting:`PASSWORD_HASHERS` untuk menggunakan mengacak sandi asli ketika anda awalnya meningkatkan ke 1.4. Setelah anda menegaskan aplikasi anda bekerja baik dengan Django 1.4 dan anda tidak harus mengembalikan ke 1.3, adakan acakan sandi baru.
zh_hans: 解决方法：在初始升级到 1.4 时将 :setting:`PASSWORD_HASHERS` 设置为使用您原始的密码哈希方式。确认您的应用在 Django 1.4 上运行良好且不需要回滚到 1.3 后，启用新的密码哈希方式。

source: Starting in 1.4, the :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` only adds a trailing slash and redirects if the resulting URL refers to an existing flatpage. For example, requesting ``/notaflatpageoravalidurl`` in a previous version would redirect to ``/notaflatpageoravalidurl/``, which would subsequently raise a 404. Requesting ``/notaflatpageoravalidurl`` now will immediately raise a 404.
id: Memulai di 1.4, :class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` hanya menambah buntutan garis miring dan pengalihan jika URL dihaslikan mengacu pada sebuah flatpage yang ada. Sebagai contoh, meminta ``/notaflatpageoravalidurl`` di versi sebelumnya akan mengalihkan ke ``/notaflatpageoravalidurl/``, yang akan kemudian memunculkan sebuah 404. Meminta ``/notaflatpageoravalidurl`` sekarang akan segera memunculkan sebuah 404.
zh_hans: 从 1.4 版本开始，:class:`~django.contrib.flatpages.middleware.FlatpageFallbackMiddleware` 仅在生成的 URL 引用现有的平面页面时才会添加尾随斜杠并重定向。例如，在以前的版本中，请求 ``/notaflatpageoravalidurl`` 会重定向到 ``/notaflatpageoravalidurl/``，然后会引发 404 错误。现在请求 ``/notaflatpageoravalidurl`` 将立即引发 404 错误。

source: Also, redirects returned by flatpages are now permanent (with 301 status code), to match the behavior of :class:`~django.middleware.common.CommonMiddleware`.
id: Juga, pengalihan dikembalikan oleh flatpage sekarang tetap (dengan kode keadaan 301), untuk mencocokkan perilaku dari :class:`~django.middleware.common.CommonMiddleware`.
zh_hans: 此外，平面页面返回的重定向现在是永久性的（使用 301 状态代码），以与 :class:`~django.middleware.common.CommonMiddleware` 的行为一致。

source: Serialization of :class:`~datetime.datetime` and :class:`~datetime.time`
id: Serialisasi dari :class:`~datetime.datetime` dan :class:`~datetime.time`
zh_hans: :class:`~datetime.datetime` 和 :class:`~datetime.time` 的序列化

source: As a consequence of time-zone support, and according to the ECMA-262 specification, we made changes to the JSON serializer:
id: Sebagai konsekuensi dari dukungan zona-waktu, dan menurut pada spesifikasi ECMA-262, kami membuat perubahan pada penserial JSON:
zh_hans: 作为时区支持的结果，并根据 ECMA-262 规范，我们对 JSON 序列化器进行了更改：

source: It includes the time zone for aware datetime objects. It raises an exception for aware time objects.
id: Itu termasuk zona waktu untuk obyek datetime sadar. Itu memunculkan sebuah pengecualian untuk obyek waktu sadar.
zh_hans: 它包括了具有时区感知的 datetime 对象的时区。对于具有时区感知的 time 对象，它会引发一个异常。

source: It includes milliseconds for datetime and time objects. There is still some precision loss, because Python stores microseconds (6 digits) and JSON only supports milliseconds (3 digits). However, it's better than discarding microseconds entirely.
id: Itu menyertakan milidetik untuk obyek datetime dan time. Masih ada beberapa kehilangan ketelitian, karena Python menyimpan mikrodetik (6 angka) dan JSON hanya mendukung milidetik (3 angka). Bagaimanapun, itu lebih baik daripada mengabaikan mikrodetik seluruhnya.
zh_hans: 它包括了 datetime 和 time 对象的毫秒数。由于 Python 存储微秒（6 位数字）而 JSON 仅支持毫秒（3 位数字），因此仍然存在一些精度损失。然而，这总比完全丢弃微秒要好。

source: We changed the XML serializer to use the ISO8601 format for datetimes. The letter ``T`` is used to separate the date part from the time part, instead of a space. Time zone information is included in the ``[+-]HH:MM`` format.
id: Kami merubah penserial XML untuk menggunakan bentuk ISO8601 untuk datetime. Huruf ``T`` digunakan untuk memisahkan bagian tanggal dari bagian waktu, bukannya spasi. Informasi zona waktu disertakan di bentuk ``[+-]HH:MM``.
zh_hans: 我们更改了 XML 序列化器以使用 ISO8601 格式来表示日期时间。使用字母 ``T`` 来分隔日期部分和时间部分，而不是使用空格。时区信息以 ``[+-]HH:MM`` 格式包含在内。

source: Though the serializers now use these new formats when creating fixtures, they can still load fixtures that use the old format.
id: Meskipun penserial sekarang menggunakan bentuk baru ini ketika membuat alat bantu, mereka masih dapat memuat alat bantu yang menggunakan bentuk lama.
zh_hans: 尽管序列化器在创建固件时现在使用这些新格式，但它们仍然可以加载使用旧格式的固件。

source: ``supports_timezone`` changed to ``False`` for SQLite
id: ``supports_timezone`` dirubah ke ``False`` untuk SQLite
zh_hans: ``supports_timezone`` 对于 SQLite 现在更改为 ``False``。

source: The database feature ``supports_timezone`` used to be ``True`` for SQLite. Indeed, if you saved an aware datetime object, SQLite stored a string that included an UTC offset. However, this offset was ignored when loading the value back from the database, which could corrupt the data.
id: Fitur basisdata ``supports_timezone`` biasanya ``True`` untuk SQLite. Memang, jika anda menyimpan sebuah obyek datetime sadar, SQLite menyimpan sebuah deretan karakter yang disertakan sebuah perimbangan UTC. Bagaimanapun, perimbangan ini telah diabaikan ketika memuat nilai kembali dari basisdata, yang dapat merusak data.
zh_hans: 数据库特性 ``supports_timezone`` 以前对于 SQLite 是 ``True``。确实，如果您保存了一个带有时区信息的 datetime 对象，SQLite 会存储一个包含 UTC 偏移的字符串。然而，在从数据库加载值时会忽略此偏移量，这可能会导致数据损坏。

source: In the context of time-zone support, this flag was changed to ``False``, and datetimes are now stored without time-zone information in SQLite. When :setting:`USE_TZ` is ``False``, if you attempt to save an aware datetime object, Django raises an exception.
id: Dalam konteks dari dukungan zona-waktu, bendera ini telah berubah menjadi ``False``, dan datetime sekarang disimpan tanpa informasi zona-waktu di SQLite. Ketika :setting:`USE_TZ` adalah ``False``, jika anda berusaha menyimpan sebuah obyek zona waktu disadari, Django memunculkan sebuah pengecualian.
zh_hans: 在时区支持的背景下，此标志已更改为 ``False``，并且在 SQLite 中现在以不带时区信息的方式存储日期时间。当 :setting:`USE_TZ` 为 ``False`` 时，如果尝试保存一个带有时区信息的 datetime 对象，Django 将引发异常。

source: ``MySQLdb``-specific exceptions
id: Pengecualian ``MySQLdb``-khusus
zh_hans: ``MySQLdb`` 特定的异常

source: The MySQL backend historically has raised ``MySQLdb.OperationalError`` when a query triggered an exception. We've fixed this bug, and we now raise :exc:`django.db.DatabaseError` instead. If you were testing for ``MySQLdb.OperationalError``, you'll need to update your ``except`` clauses.
id: Riwayat backend MySQL telah memunculkan ``MySQLdb.OperationalError`` ketika permintaan memicu sebuah pengecualian. Kami telah memperbaiki kesalahan ini, dan kami sekarang memunculkan :exc:`django.db.DatabaseError` sebagai gantinya. Jika anda sedang mencoba untuk ``MySQLdb.OperationalError``, anda akan butuh memperbaharui klausa ``except`` anda.
zh_hans: MySQL 后端在历史上在查询触发异常时引发了 ``MySQLdb.OperationalError``。我们已经修复了这个 bug，现在我们会引发 :exc:`django.db.DatabaseError`。如果您在测试时使用了 ``MySQLdb.OperationalError``，您需要更新您的 ``except`` 子句。

source: Database connection's thread-locality
id: Thread-locality hubungan basisdata
zh_hans: 数据库连接的线程局部性

source: ``DatabaseWrapper`` objects (i.e. the connection objects referenced by ``django.db.connection`` and ``django.db.connections["some_alias"]``) used to be thread-local. They are now global objects in order to be potentially shared between multiple threads. While the individual connection objects are now global, the ``django.db.connections`` dictionary referencing those objects is still thread-local. Therefore if you just use the ORM or ``DatabaseWrapper.cursor()`` then the behavior is still the same as before. Note, however, that ``django.db.connection`` does not directly reference the default ``DatabaseWrapper`` object anymore and is now a proxy to access that object's attributes. If you need to access the actual ``DatabaseWrapper`` object, use ``django.db.connections[DEFAULT_DB_ALIAS]`` instead.
id: Obyek ``DatabaseWrapper`` (yaitu hubungan obyek diacukan oleh ``django.db.connection`` dan ``django.db.connections["some_alias"]``) biasanya thread-local. Mereka sekarang obyek global untuk berpeluang berbagi diantara banyak thread. Selagi hubungan obyek individu sekarang global, kamus ``django.db.connections`` mengacu obyek tersebut adalah masih thread-local. Karena itu jika anda hanya menggunakan ORM atau ``DatabaseWrapper.cursor()`` kemudian kebiasan masih sama seperti sebelumnya. Catat, bagaimanapun, bahwa ``django.db.connection`` tidak secara langsung mengacu awalan obyek ``DatabaseWrapper`` lagi dan sekarang sebuah proxy untuk mengakses atribut obyek itu. Jika anda butuh mengakses obyek ``DatabaseWrapper`` sesungguhnya, gunakan ``django.db.connections[DEFAULT_DB_ALIAS]`` sebagai gantinya.
zh_hans: ``DatabaseWrapper`` 对象（即由 ``django.db.connection`` 和 ``django.db.connections["some_alias"]`` 引用的连接对象）以前是线程局部的。现在它们是全局对象，可以在多个线程之间共享。尽管单个连接对象现在是全局的，但引用这些对象的 ``django.db.connections`` 字典仍然是线程局部的。因此，如果您只是使用 ORM 或 ``DatabaseWrapper.cursor()``，那么行为仍然与以前相同。但请注意，``django.db.connection`` 现在不再直接引用默认的 ``DatabaseWrapper`` 对象，而是代理访问该对象的属性。如果您需要访问实际的 ``DatabaseWrapper`` 对象，请改用 ``django.db.connections[DEFAULT_DB_ALIAS]``。

source: As part of this change, all underlying SQLite connections are now enabled for potential thread-sharing (by passing the ``check_same_thread=False`` attribute to ``pysqlite``). ``DatabaseWrapper`` however preserves the previous behavior by disabling thread-sharing by default, so this does not affect any existing code that purely relies on the ORM or on ``DatabaseWrapper.cursor()``.
zh_hans: 作为这个改变的一部分，现在所有底层的 SQLite 连接都已经启用了潜在的线程共享（通过将 ``check_same_thread=False`` 属性传递给 ``pysqlite``）。然而，``DatabaseWrapper`` 默认情况下仍然保留以前的行为，通过禁用线程共享，因此这不会影响任何纯粹依赖 ORM 或 ``DatabaseWrapper.cursor()`` 的现有代码。

source: Finally, while it's now possible to pass connections between threads, Django doesn't make any effort to synchronize access to the underlying backend. Concurrency behavior is defined by the underlying backend implementation. Check their documentation for details.
id: Akhirnya, selagi itu sekarang mungkin untuk melewatkan hubungan diantara thread, Django tidak membuat usaha apapun untuk menyelaraskan akses ke backend pokok. Perilaku berulang ditentukan oleh penerapan backend pokok. Periksa dokumentasi mereka untuk rincian.
zh_hans: 最后，尽管现在可以在线程之间传递连接，但 Django 并未尝试同步访问底层后端。并发行为由底层后端实现定义。请查阅它们的文档以获取详细信息。

source: ``COMMENTS_BANNED_USERS_GROUP`` setting
zh_hans: ``COMMENTS_BANNED_USERS_GROUP`` 配置

source: Django's comments has historically supported excluding the comments of a special user group, but we've never documented the feature properly and didn't enforce the exclusion in other parts of the app such as the template tags. To fix this problem, we removed the code from the feed class.
id: Komentar Django mempunyai riwayat didukung mengeluarkan komentar dari kelompok pengguna khusus, tetapi kami tidak pernah mendokumentasikan fitur dengan benar dan tidak memaksa pengecualian di bagian lain dari aplikasi seperti etiket cetakan. Untuk memperbaiki masalah ini, kami telah menganjurkan kode dari kelas umpan.
zh_hans: Django 的评论历史上支持排除特殊用户组的评论，但我们从未正确记录此功能，并且没有在应用程序的其他部分（如模板标签）中执行排除。为了解决这个问题，我们从 feed 类中删除了代码。

source: If you rely on the feature and want to restore the old behavior, use a custom comment model manager to exclude the user group, like this::
id: Jika anda bergantung pada fitur dan ingin menyimpan kembali perilaku lama, gunakan penyesuaian pengelola model komentar untuk mengeluarkan kelompok pengguna, seperti ini::
zh_hans: 如果您依赖此功能并希望恢复旧的行为，可以使用自定义评论模型管理器来排除用户组，如下所示：

source: Save this model manager in your custom comment app (e.g., in ``my_comments_app/managers.py``) and add it your custom comment app model::
id: Simpan pengelola model ini di aplikasi komentar penyesuaian anda (sebagai contoh, di ``my_comments_app/managers.py``) dan tambah itu ke model aplikasi komentar penyesuaian anda::
zh_hans: 请将此模型管理器保存在您的自定义评论应用中（例如，在 ``my_comments_app/managers.py`` 中），然后将其添加到您的自定义评论应用模型中：

source: ``IGNORABLE_404_STARTS`` and ``IGNORABLE_404_ENDS`` settings
zh_hans: ``IGNORABLE_404_STARTS`` 和 ``IGNORABLE_404_ENDS`` 配置

source: Until Django 1.3, it was possible to exclude some URLs from Django's :doc:`404 error reporting</howto/error-reporting>` by adding prefixes to ``IGNORABLE_404_STARTS`` and suffixes to ``IGNORABLE_404_ENDS``.
id: Sampai Django 1.3, itu memungkinkan mengeluarkan beberapa URL dari :doc:`404 error reporting</howto/error-reporting>` Django dengan menambahkan awalan pada ``IGNORABLE_404_STARTS`` dan akhiran pada ``IGNORABLE_404_ENDS``.
zh_hans: 在 Django 1.3 之前，可以通过在 ``IGNORABLE_404_STARTS`` 添加前缀和在 ``IGNORABLE_404_ENDS`` 添加后缀来将某些 URL 排除在 Django 的 :doc:`404 错误报告 </howto/error-reporting>` 之外。

source: In Django 1.4, these two settings are superseded by :setting:`IGNORABLE_404_URLS`, which is a list of compiled regular expressions. Django won't send an email for 404 errors on URLs that match any of them.
id: Di Django 1.4, kedua pengaturan ini adalah digantikan oleh :setting:`IGNORABLE_404_URLS`, yang sebuah daftar dari regular expression yang disusun. Django tidak akan mengirim sebuah surel untuk kesalahan 404 pada URL yang cocok dari tiap mereka.
zh_hans: 在 Django 1.4 中，这两个设置被 :setting:`IGNORABLE_404_URLS` 取代，它是一个编译后的正则表达式列表。Django 不会为匹配其中任何一个的 URL 的 404 错误发送电子邮件。

source: Furthermore, the previous settings had some rather arbitrary default values::
id: Lebih lanjut, pengaturan sebelumnya mempunyai beberapa nilai awalan agak berubah-ubah::
zh_hans: 此外，以前的设置具有一些相当任意的默认值：

source: It's not Django's role to decide if your website has a legacy ``/cgi-bin/`` section or a ``favicon.ico``. As a consequence, the default values of :setting:`IGNORABLE_404_URLS`, ``IGNORABLE_404_STARTS``, and ``IGNORABLE_404_ENDS`` are all now empty.
id: Itu bukan peran Django untuk memutuskan jika situs jaringan anda mempunyai warisan bagian ``/cgi-bin/`` atau ``favicon.ico``. Sebagai konsekuensi, nilai awalan dari :setting:`IGNORABLE_404_URLS`, ``IGNORABLE_404_STARTS``, dan ``IGNORABLE_404_ENDS`` semua sekarang kosong.
zh_hans: Django 不负责决定您的网站是否有一个遗留的 ``/cgi-bin/`` 部分或一个 ``favicon.ico``。因此，:setting:`IGNORABLE_404_URLS`、``IGNORABLE_404_STARTS`` 和 ``IGNORABLE_404_ENDS`` 的默认值现在都为空。

source: If you have customized ``IGNORABLE_404_STARTS`` or ``IGNORABLE_404_ENDS``, or if you want to keep the old default value, you should add the following lines in your settings file::
id: Jika anda telah menyesuaikan ``IGNORABLE_404_STARTS`` atau ``IGNORABLE_404_ENDS``, atau jika anda ingin menjaga nilai awalan lama, anda harus menambahkan baris-baris berikut ke berkas pengaturan anda::
zh_hans: 如果您已经定制了 ``IGNORABLE_404_STARTS`` 或 ``IGNORABLE_404_ENDS``，或者希望保留旧的默认值，您应该在您的设置文件中添加以下行：

source: Don't forget to escape characters that have a special meaning in a regular expression, such as periods.
id: Jangan lupa untuk meloloskan karakter yang mempunyai arti khusus di regular expression, seperti masa.
zh_hans: 不要忘记转义在正则表达式中具有特殊含义的字符，例如句点。

source: CSRF protection extended to PUT and DELETE
id: Perlindungan CSRF diperpanjang pada PUT dan DELETE
zh_hans: CSRF 保护扩展到 PUT 和 DELETE 操作

source: Previously, Django's :doc:`CSRF protection </ref/csrf/>` provided protection only against POST requests. Since use of PUT and DELETE methods in AJAX applications is becoming more common, we now protect all methods not defined as safe by :rfc:`2616` -- i.e., we exempt GET, HEAD, OPTIONS and TRACE, and we enforce protection on everything else.
id: Sebelumnya, :doc:`CSRF protection </ref/csrf/>` Django menyediakan perlindungan hanya terhadap permintaan POST. Sejak penggunaan metode PUT dan DELETE di aplikasi AJAX menjadi lebih umum, kami sekarang melindungi semua metode tidak ditentukan sebagai aman oleh :rfc:`2616` -- yaitu, kami membebaskan GET, HEAD, OPTIONS dan TRACE, dan kami memaksa perlindungan yang lainnya.
zh_hans: 以前，Django 的 :doc:`CSRF 保护 </ref/csrf/>` 仅对 POST 请求提供保护。由于在 AJAX 应用中使用 PUT 和 DELETE 方法变得越来越常见，因此现在我们对所有未被 :rfc:`2616` 定义为安全的方法提供保护 — 即，我们排除了 GET、HEAD、OPTIONS 和 TRACE，对其他一切进行保护。

source: If you're using PUT or DELETE methods in AJAX applications, please see the :ref:`instructions about using AJAX and CSRF <csrf-ajax>`.
id: Jika anda sedang menggunakan metode PUT atau DELETE di aplikasi AJAX, harap melihat :ref:`instructions about using AJAX and CSRF <csrf-ajax>`.
zh_hans: 如果您在 AJAX 应用中使用 PUT 或 DELETE 方法，请参阅有关使用 AJAX 和 CSRF 的 :ref:`说明 <csrf-ajax>`。

source: Password reset view now accepts ``subject_template_name``
id: Tampilan penyetelan ulang sandi sekarang menerima ``subject_template_name``
zh_hans: 密码重置视图现在接受 ``subject_template_name``

source: The ``password_reset`` view in ``django.contrib.auth`` now accepts a ``subject_template_name`` parameter, which is passed to the password save form as a keyword argument. If you are using this view with a custom password reset form, then you will need to ensure your form's ``save()`` method accepts this keyword argument.
id: Tampilan ``password_reset`` di ``django.contrib.auth`` sekarang menerima sebuah parameter ``subject_template_name``, yang dilewati ke formulir simpan sandi sebagai argumen kata kunci. Jika anda sedang menggunakan tampilan ini dengan penyesuaian formulir setel kembali sandi, kemudian anda akan butuh memastikan metode ``save()`` formulir anda menerima argumen kata kunci ini.
zh_hans: ``django.contrib.auth`` 中的 ``password_reset`` 视图现在接受一个 ``subject_template_name`` 参数，该参数作为关键字参数传递给密码保存表单。如果您正在使用自定义密码重置表单与此视图一起使用，那么您需要确保您的表单的 ``save()`` 方法接受此关键字参数。

source: This was an alias to ``django.template.loader`` since 2005, and we've removed it without emitting a warning due to the length of the deprecation. If your code still referenced this, please use ``django.template.loader`` instead.
id: Ini adalah nama lain pada ``django.template.loader`` sejak 2005, dan kami telah memindahkannya tanpa mengilangkan sebuah peringatan karena panjang dari pengusangan. Jika kode anda masih mengacu ini, harap gunakan ``django.template.loader`` sebagai gantinya.
zh_hans: 自 2005 年以来，这是对 ``django.template.loader`` 的别名，由于过长的弃用期，我们已将其删除而不发出警告。如果您的代码仍然引用了它，请改用 ``django.template.loader``。

source: This functionality has been removed due to intractable performance and security issues. Any existing usage of ``verify_exists`` should be removed.
id: Kegunaan ini telah dipindahkan karena masalah penampilan dan keamanan. Tiap penggunaan yang ada dari ``verify_exists`` harus dipindahkan.
zh_hans: 由于无法解决的性能和安全问题，已删除了此功能。应删除任何现有的 ``verify_exists`` 用法。

source: The ``open`` method of the base Storage class used to take an obscure parameter ``mixin`` that allowed you to dynamically change the base classes of the returned file object. This has been removed. In the rare case you relied on the ``mixin`` parameter, you can easily achieve the same by overriding the ``open`` method, like this::
id: Metode ``open`` dari kelas Penyimpanan dasar digunakan untuk mengambil sebuah parameter kabur ``mixin`` yang mengizinkan anda secara dinamis merubah perubahan kelas-kelas dasar dari obyek berkas yang dikembalikan. Ini telah dipindahkan. Di kasus yang jarang anda bergantung pada parameter ``mixin``, anda dapat dengan mudah mencapai kesamaan dengan menimpa metode ``open``, seperti ini::
zh_hans: 基本 Storage 类的 ``open`` 方法曾经接受一个晦涩的参数 ``mixin``，允许您动态更改返回的文件对象的基类。这已被移除。在极少数情况下，如果您依赖于 ``mixin`` 参数，您可以通过覆盖 ``open`` 方法轻松实现相同的效果，如下所示：

source: YAML deserializer now uses ``yaml.safe_load``
id: Deserializer YAML sekarang menggunakan ``yaml.safe_load``
zh_hans: YAML 反序列化器现在使用 ``yaml.safe_load``
