Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``django.db.backends.DatabaseValidation.validate_field`` is removed in favor of the ``check_field`` method.
id: ``django.db.backends.DatabaseValidation.validate_field`` dipindahkan mendukung metode ``check_field``.
zh_hans: ``django.db.backends.DatabaseValidation.validate_field`` 被移除，取而代之的是 ``check_field`` 方法。

source: The ``validate`` management command is removed.
id: Perintah pengelolaan ``validate`` dipindahkan.
zh_hans: ``validate`` 管理命令已被移除。

source: ``django.utils.module_loading.import_by_path`` is removed in favor of ``django.utils.module_loading.import_string``.
id: ``django.utils.module_loading.import_by_path`` dipindahkan mendukung ``django.utils.module_loading.import_string``.
zh_hans: ``django.utils.module_loading.import_by_path`` 被移除，取而代之的是 ``django.utils.module_loading.import_string``。

source: ``ssi`` and ``url`` template tags are removed from the ``future`` template tag library.
id: Etiket cetakan ``ssi`` dan ``url`` dipindahkan dari pustaka etiket cetakan ``future``.
zh_hans: ``ssi`` 和 ``url`` 模板标签已从 ``future`` 模板标签库中移除。

source: ``django.utils.text.javascript_quote()`` is removed.
id: ``django.utils.text.javascript_quote()`` dipindahkan.
zh_hans: ``django.utils.text.javascript_quote()`` 已被移除。

source: Database test settings as independent entries in the database settings, prefixed by ``TEST_``, are no longer supported.
id: Pengaturan percobaan basisdata sebagai masukan berdiri sendiri dalam pengaturan basisdata, diawali oleh ``TEST_``, tidak lagi didukung.
zh_hans: 不再支持将数据库测试设置作为独立的条目出现在数据库设置中，并以 ``TEST_`` 为前缀。

source: The ``cache_choices`` option to :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField` is removed.
zh_hans: ``cache_choices`` 选项已被移除，不再适用于 :class:`~django.forms.ModelChoiceField` 和 :class:`~django.forms.ModelMultipleChoiceField`。

source: The default value of the :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` attribute has changed from ``True`` to ``False``.
id: Nilai awal dari atribut :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` telah dirubah dari ``True`` ke ``False``.
zh_hans: :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` 属性的默认值已从 ``True`` 更改为 ``False``。

source: ``django.contrib.sitemaps.FlatPageSitemap`` is removed in favor of ``django.contrib.flatpages.sitemaps.FlatPageSitemap``.
id: ``django.contrib.sitemaps.FlatPageSitemap`` dipindahkan mendukung ``django.contrib.flatpages.sitemaps.FlatPageSitemap``.
zh_hans: ``django.contrib.sitemaps.FlatPageSitemap`` 已被移除，取而代之的是 ``django.contrib.flatpages.sitemaps.FlatPageSitemap``。

source: Private API ``django.test.utils.TestTemplateLoader`` is removed.
id: API pribadi ``django.test.utils.TestTemplateLoader`` dipindahkan.
zh_hans: 私有 API ``django.test.utils.TestTemplateLoader`` 已被移除。

source: The ``django.contrib.contenttypes.generic`` module is removed.
id: Modul ``django.contrib.contenttypes.generic`` dipindahkan.
zh_hans: ``django.contrib.contenttypes.generic`` 模块已被移除。

source: Django 1.9.1 release notes
id: Catatan terbitan Django 1.9.1
zh_hans: Django 1.9.1 版本发行说明

source: Django 1.9.1 fixes several bugs in 1.9.
id: Django 1.9.1 memperbaiki beberapa kesalahan di 1.9.
zh_hans: Django 1.9.1 修复了 1.9 版本中的一些错误。

source: Fixed ``BaseCache.get_or_set()`` with the ``DummyCache`` backend (:ticket:`25840`).
id: Diperbaiki ``BaseCache.get_or_set()`` dengan backend ``DummyCache`` (:ticket:`25840`).
zh_hans: 修复了使用 ``DummyCache`` 后端的 ``BaseCache.get_or_set()`` 方法（:ticket:`25840`）。

source: Fixed a regression in ``FormMixin`` causing forms to be validated twice (:ticket:`25548`, :ticket:`26018`).
id: Diperbaiki sebuah pemulihan di ``FormMixin`` menyebabkan formulir menjadi disahkan dua kali (:ticket:`25548`, :ticket:`26018`).
zh_hans: 修复了 ``FormMixin`` 中的回归问题，导致表单被验证两次（:ticket:`25548`, :ticket:`26018`）。

source: Fixed a system check crash with nested ``ArrayField``\s (:ticket:`25867`).
id: Diperbaiki kegagalan pemeriksaan sistem dengan ``ArrayField`` bersarang (:ticket:`25867`).
zh_hans: 修复了嵌套 ``ArrayField`` 的系统检查崩溃问题（:ticket:`25867`）。

source: Fixed a regression in ``CommonMiddleware`` causing ``If-None-Match`` checks to always return HTTP 200 (:ticket:`25900`).
id: Diperbaiki sebuah pemulihan di ``CommonMiddleware`` menyebabkan pemeriksaan ``If-None-Match`` menjadi selalu mengembalikan HTTP 200 (:ticket:`25900`).
zh_hans: 修复了 ``CommonMiddleware`` 中的回归问题，导致 ``If-None-Match`` 检查始终返回 HTTP 200（:ticket:`25900`）。

source: Fixed admin's delete confirmation page's summary counts of related objects (:ticket:`25883`).
id: Diperbaiki jumlah ringkasan halaman penegasan hapus admin dari obyek terkait (:ticket:`25883`).
zh_hans: 修复了管理界面中删除确认页面上相关对象的摘要计数（:ticket:`25883`）。

source: Added ``from __future__ import unicode_literals`` to the default ``apps.py`` created by ``startapp`` on Python 2 (:ticket:`25909`). Add this line to your own ``apps.py`` files created using Django 1.9 if you want your migrations to work on both Python 2 and Python 3.
id: Ditambahkan ``from __future__ import unicode_literals`` ke awalan ``apps.py`` dibuat oleh ``startapp`` pada Python 2 (:ticket:`25909`). Tambah baris ini ke berkas-berkas ``apps.py`` anda sendiri dibuat menggunakan Django 1.9 jika anda ingin perpindahan bekerja pada kedua Python 2 dan Python 3.
zh_hans: 在 Python 2 上由 ``startapp`` 创建的默认 ``apps.py`` 中添加了 ``from __future__ import unicode_literals`` （:ticket:`25909`）。如果你希望你自己使用 Django 1.9 创建的 ``apps.py`` 文件在 Python 2 和 Python 3 上都能正常工作，可以将这一行添加到你自己的 ``apps.py`` 文件中。

source: Prevented ``QuerySet.delete()`` from crashing on MySQL when querying across relations (:ticket:`25882`).
id: Dicegah ``QuerySet.delete()`` dari gagal di MySQL ketika meminta antar hubungan (:ticket:`25882`).
zh_hans: 修复了在跨关系查询时防止 ``QuerySet.delete()`` 在 MySQL 上崩溃的问题（:ticket:`25882`）。

source: Fixed evaluation of zero-length slices of ``QuerySet.values()`` (:ticket:`25894`).
id: Diperbaiki penilaian dari potongan panjang-nol dari ``QuerySet.values()`` (:ticket:`25894`).
zh_hans: 修复了对 ``QuerySet.values()`` 的零长度切片的评估问题（:ticket:`25894`）。

source: Fixed ``TypedChoiceField`` change detection with nullable fields (:ticket:`25942`).
id: Diperbaiki penemuan perubahan ``TypedChoiceField`` dengan bidang null (:ticket:`25942`).
zh_hans: 修复了带有可空字段的 ``TypedChoiceField`` 更改检测问题（:ticket:`25942`）。

source: Fixed incorrect timezone warnings in custom admin templates that don't have a ``data-admin-utc-offset`` attribute in the ``body`` tag. (:ticket:`25845`).
id: Diperbaiki peringatan zonawaktu tidak benar di cetakan admin penyesuaian yang tidak mempunyai atribut ``data-admin-utc-offset`` di etiket ``body``. (:ticket:`25845`).
zh_hans: 修复了自定义管理模板中不带有 ``data-admin-utc-offset`` 属性的 ``body`` 标签中的不正确的时区警告问题（:ticket:`25845`）。

source: Avoided hiding some exceptions, like an invalid ``INSTALLED_APPS`` setting, behind ``AppRegistryNotReady`` when starting ``runserver`` (:ticket:`25510`). This regression appeared in 1.8.5 as a side effect of fixing :ticket:`24704` and by mistake the fix wasn't applied to the ``stable/1.9.x`` branch.
id: Dihindari menyembunyikan beberapa pengecualian, seperti sebuah pengaturan ``INSTALLED_APPS`` tidak sah, dibelakang ``AppRegistryNotReady`` ketika memulai ``runserver`` (:ticket:`25510`). Pemulihan ini muncul di 1.8.5 sebagai pengaruh samping dari perbaikan :ticket:`24704` dan oleh kesalahan perbaikan tidak diberlakukan pada cabang ``stable/1.9.x``.
zh_hans: 在启动 ``runserver`` 时避免将一些异常（如无效的 ``INSTALLED_APPS`` 设置）隐藏在 ``AppRegistryNotReady`` 后面（:ticket:`25510`）。这个回归问题出现在 1.8.5 版中，是在修复 :ticket:`24704` 时的副作用，不小心没有将修复应用到 ``stable/1.9.x`` 分支。

source: Fixed ``migrate --fake-initial`` detection of many-to-many tables (:ticket:`25922`).
id: Diperbaiki penemuan ``migrate --fake-initial`` dari tabel many-to-many (:ticket:`25922`).
zh_hans: 修复了 ``migrate --fake-initial`` 对于多对多表的检测问题（:ticket:`25922`）。

source: Restored the functionality of the admin's ``list_editable`` add and change buttons (:ticket:`25903`).
id: Menyimpan kembali kegunaan dari tambah ``list_editable`` admin dan tombol rubah (:ticket:`25903`).
zh_hans: 恢复了管理界面的 ``list_editable`` 添加和更改按钮的功能（:ticket:`25903`）。

source: Fixed ``isnull`` query lookup for ``ForeignObject`` (:ticket:`25972`).
id: Diperbaiki pencarian permintaan ``isnull`` untuk ``ForeignObject`` (:ticket:`25972`).
zh_hans: 修复了对于 ``ForeignObject`` 的 ``isnull`` 查询查找问题（:ticket:`25972`）。

source: Fixed incorrect object reference in ``SingleObjectMixin.get_context_object_name()`` (:ticket:`26006`).
id: Diperbaiki acuan objek tidak benar di ``SingleObjectMixin.get_context_object_name()`` (:ticket:`26006`).
zh_hans: 修复了 ``SingleObjectMixin.get_context_object_name()`` 中的不正确对象引用问题（:ticket:`26006`）。

source: Restored ``contrib.auth`` hashers compatibility with ``py-bcrypt`` (:ticket:`26016`).
zh_hans: 恢复了 ``contrib.auth`` 哈希算法与 ``py-bcrypt`` 的兼容性（:ticket:`26016`）。

source: Django 1.9.10 release notes
id: Catatan terbitan Django 1.9.10
zh_hans: Django 1.9.10 版本发行说明

source: Django 1.9.10 fixes a security issue in 1.9.9.
id: Django 1.9.10 memperbaiki sebuah masalah keamanan di 1.9.9.
zh_hans: Django 1.9.10 修复了 1.9.9 版本中的一个安全问题。

source: Django 1.9.11 release notes
id: Catatan terbitan Django 1.9.11
zh_hans: Django 1.9.11 版本发行说明

source: Django 1.9.11 fixes two security issues in 1.9.10.
id: Django 1.9.11 memperbaiki dua masalah keamanan di 1.9.10.
zh_hans: Django 1.9.11 修复了 1.9.10 版本中的两个安全问题。

source: Django 1.9.12 release notes
id: Catatan terbitan Django 1.9.12
zh_hans: Django 1.9.12 版本发行说明

source: Django 1.9.12 fixes a regression in 1.9.11.
id: Django 1.9.12 memperbaiki sebuah pemulihan di terbitan keamanan 1.9.11.
zh_hans: Django 1.9.12 修复了 1.9.11 版本中的一个回归问题。

source: Django 1.9.13 release notes
id: Catatan terbitan Django 1.9.13
zh_hans: Django 1.9.13 版本发行说明

source: Django 1.9.13 fixes two security issues and a bug in 1.9.12. This is the final release of the 1.9.x series.
id: Django 1.9.13 memperbaiki dua masalah keamanan dan sebuah kesalahan dalam 1.9.12. Ini adalah terbitan akhir dari rangkaian 1.9.x.
zh_hans: Django 1.9.13 修复了 1.9.12 版本中的两个安全问题和一个错误。这是 1.9.x 系列的最后一个版本发布。

source: Django 1.9.2 release notes
id: Catatan terbitan Django 1.9.2
zh_hans: Django 1.9.2 版本发行说明

source: Django 1.9.2 fixes a security regression in 1.9 and several bugs in 1.9.1. It also makes a small backwards incompatible change that hopefully doesn't affect any users.
id: Django 1.9.2 memperbaiki sebuah pemulihan keamanan di 1.9 dan beberapa kesalahan di 1.9.1. Itu juga membuat perubahan ketidaksesuaian kebelakang kecil yang semoga tidak mempengaruhi pengguna lainnya.
zh_hans: Django 1.9.2 修复了 1.9 版本中的一个安全回归问题以及 1.9.1 版本中的一些错误。它还进行了一个小的不向后兼容的更改，希望不会影响任何用户。

source: Security issue: User with "change" but not "add" permission can create objects for ``ModelAdmin``’s with ``save_as=True``
zh_hans: 安全问题：拥有“更改”但没有“添加”权限的用户可以为具有 ``save_as=True`` 的 ``ModelAdmin`` 创建对象。这个问题已得到修复。

source: If a ``ModelAdmin`` uses ``save_as=True`` (not the default), the admin provides an option when editing objects to "Save as new". A regression in Django 1.9 prevented that form submission from raising a "Permission Denied" error for users without the "add" permission.
id: Jika ``ModelAdmin`` menggunakan ``save_as=True`` (bukan awalan), admin menyediakan sebuah pilihan ketika menyunting obyek ke "Save as new". Sebuah pemulihan di Django 1.9 mencegah itu membentuk pengajuan dari pemunculan sebuah kesalahan "Permission Denied" untuk pengguna tanpa perizinan "add".
zh_hans: 如果一个 ``ModelAdmin`` 使用了 ``save_as=True`` （不是默认值），在编辑对象时，管理员提供了一个选项来“另存为新对象”。在 Django 1.9 中的一个回归问题阻止了对于没有“添加”权限的用户，这个表单提交不会引发“权限被拒绝”的错误。这个问题已得到修复。

source: Backwards incompatible change: ``.py-tpl`` files rewritten in project/app templates
id: Perubahan ketidaksesuaian kebelakang: berkas-berkas ``.py-tpl`` ditulis kembali di cetakan project/app
zh_hans: 向后不兼容的变更：在项目/应用程序模板中重新编写了 ``.py-tpl`` 文件。

source: The addition of some Django template language syntax to the default app template in Django 1.9 means those files now have some invalid Python syntax. This causes difficulties for packaging systems that unconditionally byte-compile ``*.py`` files.
id: Tambahan dari beberapa sintaksis bahasa cetakan Django pada cetakan aplikasi awalan di Django 1.9 berarti berkas-berkas tersebut sekarang mempunyai beberapa sintaksis Python tidak sah. Ini menyebabkan kesulitan untuk sistem pemaketan yang secara tidak tanpa syarat menyusun-byte berkas-berkas ``*.py``.
zh_hans: 在 Django 1.9 中将一些 Django 模板语言语法添加到默认应用程序模板中，这意味着这些文件现在具有一些无效的 Python 语法。这会对无条件地字节编译 ``*.py`` 文件的打包系统造成困难。

source: To remedy this, a ``.py-tpl`` suffix is now used for the project and app template files included in Django. The ``.py-tpl`` suffix is replaced with ``.py`` by the ``startproject`` and ``startapp`` commands. For example, a template with the filename ``manage.py-tpl`` will be created as ``manage.py``.
id: Untuk memperbaiki ini, sebuah akhiran ``.py-tpl`` sekarang digunakan untuk proyek dan berkas-berkas cetakan aplikasi disertakan di Django. Akhiran ``.py-tpl`` diganti dengan ``.py`` oleh perintah ``startproject`` dan ``startapp``. Sebagai contoh, sebuah cetakan dengan nama berkas ``manage.py-tpl`` akan dibuat sebagai ``manage.py``.
zh_hans: 为了解决这个问题，现在在 Django 中使用 ``.py-tpl`` 后缀来表示项目和应用程序模板文件。``startproject`` 和 ``startapp`` 命令会将 ``.py-tpl`` 后缀替换为 ``.py``。例如，文件名为 ``manage.py-tpl`` 的模板将被创建为 ``manage.py``。

source: Please file a ticket if you have a custom project template containing ``.py-tpl`` files and find this behavior problematic.
id: Harap berkaskan sebuah tiket jika anda mempunyai sebuah penyesuaian cetakan proyek mengandung berkas-berkas ``.py-tpl`` dan menemukan perilaku ini bermasalah.
zh_hans: 如果你有一个包含 ``.py-tpl`` 文件的自定义项目模板，并且发现这个行为有问题，请提交一个问题报告。

source: Fixed a regression in ``ConditionalGetMiddleware`` causing ``If-None-Match`` checks to always return HTTP 200 (:ticket:`26024`).
id: Diperbaiki sebuah pemulihan di ``ConditionalGetMiddleware`` menyebabkan pemeriksaan ``If-None-Match`` menjadi selalu mengembalikan HTTP 200 (:ticket:`26024`).
zh_hans: 修复了 ``ConditionalGetMiddleware`` 中的回归问题，导致 ``If-None-Match`` 检查始终返回 HTTP 200（:ticket:`26024`）。

source: Fixed a regression in the admin's edit related model popup that caused an escaped value to be displayed in the select dropdown of the parent window (:ticket:`25997`).
id: Diperbaiki sebuah pemulihan di popup model terkait sunting admin yang menyebabkan sebuah nilai diloloskan untuk menampilkan di dropdown pilihan dari jendela induk (:ticket:`25997`).
zh_hans: 修复了管理界面中编辑相关模型弹出窗口的回归问题，导致在父窗口的选择下拉菜单中显示转义的值（:ticket:`25997`）。

source: Fixed a regression where defining a relation on an abstract model's field using a string model name without an app_label no longer resolved that reference to the abstract model's app if using that model in another application (:ticket:`25858`).
id: Diperbaiki sebuah pemulihan dimana menentukan sebuah hubungan pada sebuah bidang model abstrak menggunakan nama model string tanpa sebuah app_label tidak lagi terselesaikan acuan itu ke aplikasi model abstrak jika menggunakan model itu di aplikasi lain (:ticket:`25858`).
zh_hans: 修复了一个回归问题，当在抽象模型的字段上使用字符串模型名称定义关系时，如果在另一个应用程序中使用该模型，没有指定 app_label 的引用将不再解析到抽象模型的应用程序（:ticket:`25858`）。

source: Fixed a crash when destroying an existing test database on MySQL or PostgreSQL (:ticket:`26096`).
id: Diperbaiki sebuah kegagalan ketika menghancurkan basisdata percobaan yang ada pada MySQL atau PostgreSQL (:ticket:`26096`).
zh_hans: 修复了在 MySQL 或 PostgreSQL 上销毁现有测试数据库时崩溃的问题（:ticket:`26096`）。

source: Fixed CSRF cookie check on POST requests when ``USE_X_FORWARDED_PORT=True`` (:ticket:`26094`).
id: Diperbaiki pemeriksaan kue CSRF pada permintaan POST ketika ``USE_X_FORWARDED_PORT=True`` (:ticket:`26094`).
zh_hans: 修复了在 ``USE_X_FORWARDED_PORT=True`` 时对 POST 请求的 CSRF Cookie 检查问题（:ticket:`26094`）。

source: Fixed a ``QuerySet.order_by()`` crash when ordering by a relational field of a ``ManyToManyField`` ``through`` model (:ticket:`26092`).
id: Diperbaiki sebuah kegagalan ``QuerySet.order_by()`` ketika diurutkan berdasarkan pada bidang hubungan dari model ``through`` ``ManyToManyField`` (:ticket:`26092`).
zh_hans: 修复了当按照 ``ManyToManyField`` 的 ``through`` 模型的关联字段进行排序时，导致 ``QuerySet.order_by()`` 崩溃的问题（:ticket:`26092`）。

source: Fixed a regression that caused an exception when making database queries on SQLite with more than 2000 parameters when :setting:`DEBUG` is ``True`` on distributions that increase the ``SQLITE_MAX_VARIABLE_NUMBER`` compile-time limit to over 2000, such as Debian (:ticket:`26063`).
id: Diperbaiki sebuah pemulihan yang menyebabkan sebuah pengecualian ketika membuat permintaan basisdata pada SQLite dengan lebih dari 2000 parameter ketika :setting:`DEBUG` adalah ``True`` pada pembagian yang meningkatkan batasan waktu-susun ``SQLITE_MAX_VARIABLE_NUMBER`` menjadi lebih 2000, seperti Debian (:ticket:`26063`).
zh_hans: 修复了在使用分布式时，当在 SQLite 上进行数据库查询参数超过 2000 个且 :setting:`DEBUG` 为 ``True`` 时导致异常的回归问题，这个问题发生在一些分布式中，它将 ``SQLITE_MAX_VARIABLE_NUMBER`` 编译时限制增加到了 2000 以上，比如 Debian（:ticket:`26063`）。

source: Fixed a crash when calling the ``migrate`` command in a test case with the ``available_apps`` attribute pointing to an application with migrations disabled using the ``MIGRATION_MODULES`` setting (:ticket:`26135`).
id: Diperbaiki sebuah kegagalan ketika memanggil perintah ``migrate`` di kasus percobaan dengan atribut ``available_apps`` menunjuk pada sebuah aplikasi dengan perpindahan ditiadakan menggunakan pengaturan ``MIGRATION_MODULES`` (:ticket:`26135`).
zh_hans: 修复了在测试用例中调用 ``migrate`` 命令，并且 ``available_apps`` 属性指向一个使用 ``MIGRATION_MODULES`` 设置禁用迁移的应用程序时导致崩溃的问题（:ticket:`26135`）。

source: Restored the ability for testing and debugging tools to determine the template from which a node came from, even during template inheritance or inclusion. Prior to Django 1.9, debugging tools could access the template origin from the node via ``Node.token.source[0]``. This was an undocumented, private API. The origin is now available directly on each node using the ``Node.origin`` attribute (:ticket:`25848`).
id: Disimpan kembali kemampuan untuk peralatan mencoba dan mencari kesalahan untuk menentukan cetakan dari node mana datangnya, bahkan selama pewarisan cetakan atau penyertaan. Sebelumnya pada Django 1.9, alat pencari kesalahan dapat mengakses cetakan asli dari node melalui ``Node.token.source[0]``. Ini telah didokumentasikan, API pribadi. Aslinya sekarang tersedia secara langsung pada setiap node menggunakan atribut ``Node.origin`` (:ticket:`25848`).
zh_hans: 恢复了测试和调试工具在模板继承或包含期间确定节点来自哪个模板的能力。在 Django 1.9 之前，调试工具可以通过 ``Node.token.source[0]`` 从节点中访问模板来源。这是一个未记录的私有 API。现在，每个节点都可以直接使用 ``Node.origin`` 属性获取源信息（:ticket:`25848`）。

source: Always included ``geometry_field`` in the GeoJSON serializer output regardless of the ``fields`` parameter (:ticket:`26138`).
id: Selalu disertakan ``geometry_field`` di keluaran penserial GeoJSON tanpa memperhatikan dari parameter ``field`` (:ticket:`26138`).
zh_hans: 无论 ``fields`` 参数如何，GeoJSON 序列化器输出中始终包含了 ``geometry_field`` （:ticket:`26138`）。

source: Made invalid forms display the initial of values of their disabled fields (:ticket:`26129`).
id: Dibuat formulir tidak sah menampilkan inisial nilai-nilai dari bidang-bidang mereka yang ditiadakan (:ticket:`26129`).
zh_hans: 使无效的表单显示其禁用字段的初始值（:ticket:`26129`）。

source: Django 1.9.3 release notes
id: Catatan terbitan Django 1.9.3
zh_hans: Django 1.9.3 版本发行说明

source: Django 1.9.3 fixes two security issues and several bugs in 1.9.2.
id: Django 1.9.3 memperbaiki dua masalah keamanan dan beberapa kesalahan dalam 1.9.2.
zh_hans: Django 1.9.3 修复了 1.9.2 版本中的两个安全问题和一些错误。

source: Skipped URL checks (new in 1.9) if the ``ROOT_URLCONF`` setting isn't defined (:ticket:`26155`).
id: Dilewatkan pemeriksaan URL (baru di 1.9) jika pengaturan ``ROOT_URLCONF`` tidak ditentukan (:ticket:`26155`).
zh_hans: 如果未定义 ``ROOT_URLCONF`` 设置，则跳过 URL 检查（在 1.9 中新增）（:ticket:`26155`）。

source: Fixed a regression for cases where ``ForeignObject.get_extra_descriptor_filter()`` returned a ``Q`` object (:ticket:`26153`).
id: Diperbaiki sebuah pemulihan untuk kasus-kasus dimana ``ForeignObject.get_extra_descriptor_filter()`` mengembalikan sebuah obyek ``Q`` (:ticket:`26153`).
zh_hans: 修复了在 ``ForeignObject.get_extra_descriptor_filter()`` 返回 ``Q`` 对象的情况下导致的回归问题（:ticket:`26153`）。

source: Fixed regression with an ``__in=qs`` lookup for a ``ForeignKey`` with ``to_field`` set (:ticket:`26196`).
id: Diperbaiki pemulihan dengan sebuah permintaan ``__in=qs`` untuk sebuah ``ForeignKey`` dengan kumpulan ``to_field`` (:ticket:`26196`).
zh_hans: 修复了在为设置了 ``to_field`` 的 ``ForeignKey`` 使用 ``__in=qs`` 查找时导致的回归问题（:ticket:`26196`）。

source: Fixed a crash when filtering by a ``Decimal`` in ``RawQuery`` (:ticket:`26219`).
id: Memperbaiki kegagalan ketika menyaring berdasarkan ``Decimal`` dalam `RawQuery`` (:ticket:`26219`).
zh_hans: 修复了在 ``RawQuery`` 中使用 ``Decimal`` 进行过滤时导致崩溃的问题（:ticket:`26219`）。

source: Fixed some crashing deprecation shims in ``SimpleTemplateResponse`` that regressed in Django 1.9 (:ticket:`26253`).
id: Diperbaiki beberapa kegagalan pengusangan shim di ``SimpleTemplateResponse`` yang mundur di Django 1.9 (:ticket:`26253`).
zh_hans: 修复了在 Django 1.9 中回归的 ``SimpleTemplateResponse`` 中一些导致崩溃的废弃 shims（:ticket:`26253`）。

source: Changed the admin's "permission denied" message in the login template to use ``get_username`` instead of ``username`` to support custom user models (:ticket:`26231`).
id: Dirubah pesan "permission denied" admin di cetakan masuk untuk menggunakan ``get_username`` daripada ``username`` untuk mendukung penyesuaian model user (:ticket:`26231`).
zh_hans: 更改了管理界面登录模板中的“权限被拒绝”的消息，使用 ``get_username`` 而不是 ``username``，以支持自定义用户模型（:ticket:`26231`）。

source: Fixed a crash when passing a nonexistent template name to the cached template loader's ``load_template()`` method (:ticket:`26280`).
id: Diperbaiki sebuah kegagalan ketika melewatkan nama cetakan yang tidak ada ke metode ``load_template()`` pemuat cetakan penyimpanan sementara (:ticket:`26280`).
zh_hans: 修复了在将不存在的模板名称传递给缓存模板加载器的 ``load_template()`` 方法时导致崩溃的问题（:ticket:`26280`）。

source: Reverted a change in Django 1.9.2 (:ticket:`25858`) that prevented relative lazy relationships defined on abstract models to be resolved according to their concrete model's ``app_label`` (:ticket:`26186`).
id: Dipulihkan sebuah perubahan di Django 1.9.2 (:ticket:`25858`) yang mencegah hubungan lazy relatif ditentukan pada model abstrak untuk diselesaikan menurut ``app_label`` model wujud mereka (:ticket:`26186`).
zh_hans: 回滚了 Django 1.9.2 中的一个更改（:ticket:`25858`），该更改阻止了在抽象模型上定义的相对延迟关系根据其具体模型的 ``app_label`` 解析的更改（:ticket:`26186`）。

source: Django 1.9.4 release notes
id: Catatan terbitan Django 1.9.4
zh_hans: Django 1.9.4 版本发行说明

source: Django 1.9.4 fixes a regression on Python 2 in the 1.9.3 security release where ``utils.http.is_safe_url()`` crashes on bytestring URLs (:ticket:`26308`).
id: Django 1.9.4 memperbaiki sebuah pemulihan di Python 2 di terbitan keamanan 1.9.3 dimana ``utils.http.is_safe_url()`` gagal di URL bytestring (:ticket:`26308`).
zh_hans: Django 1.9.4 修复了 1.9.3 版本中的一个安全更新中在 Python 2 上出现的回归问题，其中 ``utils.http.is_safe_url()`` 在字节串 URL 上崩溃的问题（:ticket:`26308`）。

source: Django 1.9.5 release notes
id: Catatan terbitan Django 1.9.5
zh_hans: Django 1.9.5 版本发行说明

source: Django 1.9.5 fixes several bugs in 1.9.4.
id: Django 1.9.5 memperbaiki beberapa kesalahan dalam 1.9.4.
zh_hans: Django 1.9.5 修复了 1.9.4 中的几个错误。
