Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Support for multiple enclosures per feed item has been added. If multiple enclosures are defined on a RSS feed, an exception is raised as RSS feeds, unlike Atom feeds, do not support multiple enclosures per feed item.
id: Dukungan untuk lampiran per umpan barang telah ditambahkan. Jika banyak lampiran ditentukan pada umpan RSS, sebuah pengecualian dimunculkan sebagai umpan RSS, tidak seperti umpan Atom, tidak mendukung banyak lampiran per umpan barang.
zh_hans: 添加了对每个订阅项多个附件的支持。如果在 RSS 订阅中定义了多个附件，则会引发异常，因为 RSS 订阅不支持每个订阅项多个附件，而 Atom 订阅支持。

source: ``django.core.cache.backends.base.BaseCache`` now has a ``get_or_set()`` method.
id: ``django.core.cache.backends.base.BaseCache`` sekarang mempunyai metode ``get_or_set()``.
zh_hans: ``django.core.cache.backends.base.BaseCache`` 现在具有一个 ``get_or_set()`` 方法。

source: :func:`django.views.decorators.cache.never_cache` now sends more persuasive headers (added ``no-cache, no-store, must-revalidate`` to ``Cache-Control``) to better prevent caching. This was also added in Django 1.8.8.
id: :func:`django.views.decorators.cache.never_cache` sekarang mengirim kepala meyakinkan (ditambahkan ``no-cache, no-store, must-revalidate`` ke ``Cache-Control``) untuk lebih baik mencegah menyimpan sementara. Ini juga ditambahkan di Django 1.8.8.
zh_hans: :func:`django.views.decorators.cache.never_cache` 现在发送更具说服力的头部信息（在 ``Cache-Control`` 中添加了 ``no-cache, no-store, must-revalidate``），以更好地防止缓存。这也在 Django 1.8.8 中添加了。

source: The request header's name used for CSRF authentication can be customized with :setting:`CSRF_HEADER_NAME`.
id: Nama kepala permintaan digunakan untuk otentifikasi CSRF dapat disesuaikan dengan :setting:`CSRF_HEADER_NAME`.
zh_hans: 用于 CSRF 认证的请求头名称可以通过 :setting:`CSRF_HEADER_NAME` 进行自定义。

source: The CSRF referer header is now validated against the :setting:`CSRF_COOKIE_DOMAIN` setting if set. See :ref:`how-csrf-works` for details.
id: Kepala pengacu CSRF sekarang disahkan terhadap pengaturan :setting:`CSRF_COOKIE_DOMAIN` jika disetel. Lihat :ref:`how-csrf-works` untuk rincian.
zh_hans: 如果设置了 :setting:`CSRF_COOKIE_DOMAIN` 设置，CSRF 的 referer 头现在将与其进行验证。有关详细信息，请参阅 :ref:`how-csrf-works`。

source: The new :setting:`CSRF_TRUSTED_ORIGINS` setting provides a way to allow cross-origin unsafe requests (e.g. ``POST``) over HTTPS.
id: Pengaturan :setting:`CSRF_TRUSTED_ORIGINS` baru menyediakan cara mengizinkan permintaan tidak aman lintas-asli (sebagai contoh ``POST``) terhadap HTTPS.
zh_hans: 新的 :setting:`CSRF_TRUSTED_ORIGINS` 设置提供了一种允许跨源不安全请求（例如 ``POST``）通过 HTTPS 的方式。

source: The PostgreSQL backend (``django.db.backends.postgresql_psycopg2``) is also available as ``django.db.backends.postgresql``. The old name will continue to be available for backwards compatibility.
id: Backend PostgreSQL (``django.db.backends.postgresql_psycopg2``) juga tersedia sebagai ``django.db.backends.postgresql``. Nama lama akan lanjut menjadi tersedia untuk kesesuaian kebelakang.
zh_hans: PostgreSQL 后端（``django.db.backends.postgresql_psycopg2``）也可以使用 ``django.db.backends.postgresql``。旧名称将继续保持以确保向后兼容。

source: :meth:`Storage.get_valid_name() <django.core.files.storage.Storage.get_valid_name>` is now called when the :attr:`~django.db.models.FileField.upload_to` is a callable.
id: :meth:`Storage.get_valid_name() <django.core.files.storage.Storage.get_valid_name>` sekarang dipanggil ketika :attr:`~django.db.models.FileField.upload_to` dapat dipanggil.
zh_hans: 当 :attr:`~django.db.models.FileField.upload_to` 是可调用对象时，现在会调用 :meth:`Storage.get_valid_name() <django.core.files.storage.Storage.get_valid_name>`。

source: :class:`~django.core.files.File` now has the ``seekable()`` method when using Python 3.
id: :class:`~django.core.files.File` sekarang mempunyai metode ``seekable()`` ketika menggunakan Python 3.
zh_hans: 在使用 Python 3 时，:class:`~django.core.files.File` 现在具有 ``seekable()`` 方法。

source: :class:`~django.forms.ModelForm` accepts the new ``Meta`` option ``field_classes`` to customize the type of the fields. See :ref:`modelforms-overriding-default-fields` for details.
id: :class:`~django.forms.ModelForm` menerima pilhan ``Meta`` baru ``field_classes`` untuk menyesuaikan jenis dari bidang. Lihat :ref:`modelforms-overriding-default-fields` untuk rincian.
zh_hans: :class:`~django.forms.ModelForm` 接受新的 ``Meta`` 选项 ``field_classes`` 以自定义字段的类型。有关详细信息，请参阅 :ref:`modelforms-overriding-default-fields`。

source: You can now specify the order in which form fields are rendered with the :attr:`~django.forms.Form.field_order` attribute, the ``field_order`` constructor argument , or the :meth:`~django.forms.Form.order_fields` method.
id: Anda sekarang dapat menentukan urutan dimana bidang-bidang formulir dengan atribut :attr:`~django.forms.Form.field_order`, argumen pembangun ``field_order``, atau metode :meth:`~django.forms.Form.order_fields`.
zh_hans: 现在可以使用 :attr:`~django.forms.Form.field_order` 属性、``field_order`` 构造函数参数或 :meth:`~django.forms.Form.order_fields` 方法指定表单字段呈现的顺序。

source: A form prefix can be specified inside a form class, not only when instantiating a form. See :ref:`form-prefix` for details.
id: Sebuah awalan formulir dapat ditentukan didalam sebuah kelas formulir, bukan hanya ketika menginstasiasikan sebuah formulir. Lihat :ref:`form-prefix` untuk rincian.
zh_hans: 现在可以在表单类内部指定表单前缀，而不仅仅是在实例化表单时。有关详细信息，请参阅 :ref:`form-prefix`。

source: You can now :ref:`specify keyword arguments <custom-formset-form-kwargs>` that you want to pass to the constructor of forms in a formset.
id: Anda sekarang dapat :ref:`specify keyword arguments <custom-formset-form-kwargs>` yang ingin melewatkan ke pembangun dari formulir di sebuah formset.
zh_hans: 现在可以 :ref:`指定要传递给表单集合中表单构造函数的关键字参数 <custom-formset-form-kwargs>`。

source: :class:`~django.forms.SlugField` now accepts an :attr:`~django.forms.SlugField.allow_unicode` argument to allow Unicode characters in slugs.
id: :class:`~django.forms.SlugField` sekarang menerima sebuah argumen :attr:`~django.forms.SlugField.allow_unicode` untuk mengizinkan karakter Unicode dalam keong.
zh_hans: :class:`~django.forms.SlugField` 现在接受一个 :attr:`~django.forms.SlugField.allow_unicode` 参数，以允许在 slug 中使用 Unicode 字符。

source: :class:`~django.forms.CharField` now accepts a :attr:`~django.forms.CharField.strip` argument to strip input data of leading and trailing whitespace. As this defaults to ``True`` this is different behavior from previous releases.
id: :class:`~django.forms.CharField` sekarang menerima sebuah argumen :attr:`~django.forms.CharField.strip` untuk melucuti masukan data dari awalan dan buntutan ruang kosong. Ketika awalan ini menjadi ``True`` ini adalah perilaku berbeda dari terbitan sebelumnya.
zh_hans: :class:`~django.forms.CharField` 现在接受一个 :attr:`~django.forms.CharField.strip` 参数，以去除输入数据的前导和尾随空格。由于默认为 ``True``，这与之前的版本不同。

source: Form fields now support the :attr:`~django.forms.Field.disabled` argument, allowing the field widget to be displayed disabled by browsers.
id: Bidang-bidang formulir sekarang mendukung argumen :attr:`~django.forms.Field.disabled`, mengizinkan widget bidang ditampilkan ditiadakan oleh peramban.
zh_hans: 现在，表单字段支持 :attr:`~django.forms.Field.disabled` 参数，允许浏览器将字段小部件显示为禁用状态。

source: It's now possible to customize bound fields by overriding a field's :meth:`~django.forms.Field.get_bound_field()` method.
id: Itu sekarang menimpa menyesuaikan ikatan bidang dengan menimpa metode :meth:`~django.forms.Field.get_bound_field()` bidang.
zh_hans: 现在可以通过重写字段的 :meth:`~django.forms.Field.get_bound_field()` 方法来自定义绑定字段。

source: Class-based views generated using ``as_view()`` now have ``view_class`` and ``view_initkwargs`` attributes.
id: Tampilan berdasarkan-kelas dibangkitkan menggunakan ``as_view()`` sekarang mempunyai atribut ``view_class`` dan ``view_initkwargs``.
zh_hans: 使用 ``as_view()`` 生成的基于类的视图现在具有 ``view_class`` 和 ``view_initkwargs`` 属性。

source: :func:`~django.utils.decorators.method_decorator` can now be used with a list or tuple of decorators. It can also be used to :ref:`decorate classes instead of methods <decorating-class-based-views>`.
id: :func:`~django.utils.decorators.method_decorator` sekarang dapat digunakan dengan sebuah daftar atau tuple dari penghias. Itu juga dapat digunakan untuk :ref:`decorate classes instead of methods <decorating-class-based-views>`.
zh_hans: 现在可以使用 :func:`~django.utils.decorators.method_decorator` 与装饰器的列表或元组一起使用。它还可以用于 :ref:`装饰类而不是方法 <decorating-class-based-views>`。

source: The :func:`django.views.i18n.set_language` view now properly redirects to :ref:`translated URLs <url-internationalization>`, when available.
id: Tampilan :func:`django.views.i18n.set_language` sekarang dengan benar mengarahkan ke :ref:`translated URLs <url-internationalization>`, ketika tersedia.
zh_hans: 当可用时，:func:`django.views.i18n.set_language` 视图现在正确重定向到 :ref:`已翻译的 URL <url-internationalization>`。

source: The ``django.views.i18n.javascript_catalog()`` view now works correctly if used multiple times with different configurations on the same page.
id: Tampilan ``django.views.i18n.javascript_catalog()``sekarang bekerja dengan benar jika digunakan banyak kali dengan konfigurasi berbeda pada halaman sama.
zh_hans: 如果在同一页上多次使用不同配置调用 ``django.views.i18n.javascript_catalog()`` 视图，它现在会正常工作。

source: The :func:`django.utils.timezone.make_aware` function gained an ``is_dst`` argument to help resolve ambiguous times during DST transitions.
id: Fungsi :func:`django.utils.timezone.make_aware` memperoleh sebuah argumen ``is_dst`` untuk membantu menyelesaikan waktu tidak pasti selama masa peralihan DST.
zh_hans: :func:`django.utils.timezone.make_aware` 函数新增了一个 ``is_dst`` 参数，以帮助解决夏令时转换期间的模糊时间。

source: You can now use locale variants supported by gettext. These are usually used for languages which can be written in different scripts, for example Latin and Cyrillic (e.g. ``be@latin``).
id: Anda sekarang dapat menggunakan beragam lokal didukung oleh gettext. Ini adalah biasanya digunakan untuk bahasa yang dapat ditulis dalam tulisan berbeda, sebagai contoh Latin dan Cyrillic (sebagai contoh ``be@latin``).
zh_hans: 现在可以使用 gettext 支持的语言区域变体。这通常用于可以使用不同字符集书写的语言，例如拉丁文和西里尔文（例如 ``be@latin``）。

source: Added the ``django.views.i18n.json_catalog()`` view to help build a custom client-side i18n library upon Django translations. It returns a JSON object containing a translations catalog, formatting settings, and a plural rule.
id: Ditambahkan tampilan ``django.views.i18n.json_catalog()`` untuk membantu membangun penyesuaian sisi-klien pustaka i18n diatas terjemahan Django. Itu mengembalikan sebuah obyek JSON mengandung sebuah katalog terjemahan, pengaturan bentuk, dan aturan jamak.
zh_hans: 新增了 ``django.views.i18n.json_catalog()`` 视图，以帮助构建基于 Django 翻译的自定义客户端端国际化库。它返回一个包含翻译目录、格式设置和复数规则的 JSON 对象。

source: Added the ``name_translated`` attribute to the object returned by the :ttag:`get_language_info` template tag. Also added a corresponding template filter: :tfilter:`language_name_translated`.
id: Ditambahkan atribut ``name_translated`` pada obyek dikembalikan oleh etiket cetakan :ttag:`get_language_info`. Juga ditambahkan penyaring cetakan berhubungan: :tfilter:`language_name_translated`.
zh_hans: 新增了 :ttag:`get_language_info` 模板标签返回的对象的 ``name_translated`` 属性。还新增了相应的模板过滤器：:tfilter:`language_name_translated`。

source: You can now run :djadmin:`compilemessages` from the root directory of your project and it will find all the app message files that were created by :djadmin:`makemessages`.
id: Anda sekarang dapat menjalankan :djadmin:`compilemessages` dari direktori akar dari proyek anda dan itu akan menemukan semua berkas pesan aplikasi dibuat oleh :djadmin:`makemessages`.
zh_hans: 现在你可以从项目的根目录运行 :djadmin:`compilemessages`，它将找到所有由 :djadmin:`makemessages` 创建的应用程序消息文件。

source: :djadmin:`makemessages` now calls ``xgettext`` once per locale directory rather than once per translatable file. This speeds up localization builds.
zh_hans: 现在 :djadmin:`makemessages` 每个区域目录调用一次 ``xgettext`` 而不是每个可翻译文件调用一次。这加快了本地化构建的速度。

source: :ttag:`blocktrans` supports assigning its output to a variable using ``asvar``.
id: :ttag:`blocktrans` mendukung memberikan keluarannya ke sebuah variabel menggunakan ``asvar``.
zh_hans: :ttag:`blocktrans` 支持使用 ``asvar`` 将其输出分配给变量。

source: Two new languages are available: Colombian Spanish and Scottish Gaelic.
id: Dua bahasa baru tersedia: Spanyol Kolombia dan Gael Skotlandia.
zh_hans: 新增了两种新语言：哥伦比亚西班牙语和苏格兰盖尔语。

source: The new :djadmin:`sendtestemail` command lets you send a test email to easily confirm that email sending through Django is working.
id: Perintah :djadmin:`sendtestemail` baru membiarkan anda mengirim sebuah percobaan surel untuk dengan mudah menegaskan bahwa pengiriman surel melalui Django bekerja.
zh_hans: 新的 :djadmin:`sendtestemail` 命令允许您发送测试邮件，以轻松确认通过 Django 发送邮件是否正常工作。

source: To increase the readability of the SQL code generated by :djadmin:`sqlmigrate`, the SQL code generated for each migration operation is preceded by the operation's description.
id: Untuk meningkatkan kesiapan dari pembangkitan kode SQL oleh :djadmin:`sqlmigrate`, pembangkit kode SQL untuk setiap tindaan perpindahan didahului oleh gambaran tindakan.
zh_hans: 为了增加 :djadmin:`sqlmigrate` 生成的 SQL 代码的可读性，为每个迁移操作生成的 SQL 代码前面都有操作的描述。

source: The :djadmin:`dumpdata` command output is now deterministically ordered. Moreover, when the ``--output`` option is specified, it also shows a progress bar in the terminal.
id: Keluaran perintah :djadmin:`dumpdata` sekarang menentukan urutan. Bahkan, ketika pilihan ``--output`` ditentukan, itu juga menampilkan batang kemajuan dalam terminal.
zh_hans: :djadmin:`dumpdata` 命令的输出现在具有确定性的顺序。此外，当指定了 ``--output`` 选项时，它还在终端中显示一个进度条。

source: The :djadmin:`createcachetable` command now has a ``--dry-run`` flag to print out the SQL rather than execute it.
id: Perintah :djadmin:`createcachetable` sekarang mempunyai bendera ``--dry-run``untuk mencetak SQL daripada menjalankannya.
zh_hans: :djadmin:`createcachetable` 命令现在有一个 ``--dry-run`` 标志，可以打印出 SQL 而不执行它。

source: The :djadmin:`startapp` command creates an ``apps.py`` file. Since it doesn't use ``default_app_config`` (:ref:`a discouraged API <configuring-applications-ref>`), you must specify the app config's path, e.g. ``'polls.apps.PollsConfig'``, in :setting:`INSTALLED_APPS` for it to be used (instead of just ``'polls'``).
id: Perintah :djadmin:`startapp` membuat sebuah berkas ``apps.py``. Sejak itu tidak menggunakan ``default_app_config`` (:ref:`a discouraged API <configuring-applications-ref>`), anda harus menentukan jalur konfigurasi aplikasi, sebagai contoh ``'polls.apps.PollsConfig'``, dalam :setting:`INSTALLED_APPS` untuk itu digunakan (daripada hanya ``'polls'``).
zh_hans: :djadmin:`startapp` 命令会创建一个 ``apps.py`` 文件。由于它不使用 ``default_app_config`` （ :ref:`一个不推荐使用的 API <configuring-applications-ref>` ），你必须在 :setting:`INSTALLED_APPS` 中指定 app 配置的路径，例如 ``'polls.apps.PollsConfig'``，以便使用它（而不仅仅是 ``'polls'``）。

source: When using the PostgreSQL backend, the :djadmin:`dbshell` command can connect to the database using the password from your settings file (instead of requiring it to be manually entered).
id: Ketika menggunakan backend PostgreSQL, perintah :djadmin:`dbshell` dapat terhubung ke basisdata menggunakan sandi dari berkas pengaturan anda (daripada membutuhkannya untuks ecara manual dimasukkan).
zh_hans: 在使用 PostgreSQL 后端时，:djadmin:`dbshell` 命令可以使用设置文件中的密码来连接数据库（而不需要手动输入密码）。

source: The ``django`` package may be run as a script, i.e. ``python -m django``, which will behave the same as ``django-admin``.
id: paket ``django`` mungkin dilarikan sebagai sebuah tulisan, yaitu ``python -m django``, yang akan berperilaku sama seperti ``django-admin``.
zh_hans: ``django`` 包可以作为脚本运行，即 ``python -m django``，它的行为与 ``django-admin`` 相同。

source: Management commands that have the ``--noinput`` option now also take ``--no-input`` as an alias for that option.
id: Perintah pengelolaan yang mempunyai pilihan ``--noinput`` sekarang juga mengambil ``--noinput`` sebagai sebuah nama lain untuk pilihan itu.
zh_hans: 具有 ``--noinput`` 选项的管理命令现在还支持 ``--no-input`` 作为该选项的别名。

source: Initial migrations are now marked with an :attr:`initial = True <django.db.migrations.Migration.initial>` class attribute which allows :option:`migrate --fake-initial` to more easily detect initial migrations.
id: Perpindahan inisial sekarang ditandai dengan sebuah atribut kelas :attr:`initial = True <django.db.migrations.Migration.initial>` yang mengizinkan option:`migrate --fake-initial` untuk lebih mudah mengenali perpindahan inisial.
zh_hans: 初始迁移现在带有一个 :attr:`initial = True <django.db.migrations.Migration.initial>` 类属性，这允许 :option:`migrate --fake-initial` 更容易检测到初始迁移。

source: Added support for serialization of ``functools.partial`` and ``LazyObject`` instances.
id: Ditambahkan dukungan untuk serialisasi dari instance ``functools.partial`` dan ``LazyObject``.
zh_hans: 增加了对 ``functools.partial`` 和 ``LazyObject`` 实例的序列化支持。

source: When supplying ``None`` as a value in :setting:`MIGRATION_MODULES`, Django will consider the app an app without migrations.
id: Ketika menyediakan ``None`` sebagai sebuah nilai dalam :setting:`MIGRATION_MODULES`, Django akan menganggap aplikasi sebuah aplikasi tanpa perpindahan.
zh_hans: 当在 :setting:`MIGRATION_MODULES` 中提供 ``None`` 作为值时，Django 将考虑该应用程序为没有迁移的应用程序。

source: When applying migrations, the "Rendering model states" step that's displayed when running migrate with verbosity 2 or higher now computes only the states for the migrations that have already been applied. The model states for migrations being applied are generated on demand, drastically reducing the amount of required memory.
id: Ketika memberlakukan perpindahan, langkah "Rendering model states" yang ditampilkan ketika menjalankan perpindahan dengan bertele-tele 2 atau lebih tinggi sekarang menghitung hanya untuk perpindahan yang telah diberlakukan. Keadaan model sedang diberlakukan dibangkitkan di permintaan, secara drastis mengurangi sejumlah memori yang dibutuhkan.
zh_hans: 在应用迁移时，当以 verbosity 2 或更高级别运行 migrate 命令时，" Rendering model states " 步骤现在仅计算已应用的迁移的模型状态。正在应用的迁移的模型状态将按需生成，大大减少了所需的内存。

source: However, this improvement is not available when unapplying migrations and therefore still requires the precomputation and storage of the intermediate migration states.
id: Bagaimanapun, perbaikan ini tidak tersedia ketika tidak memberlakukan perpindahan dan karena itu masih membutuhkan pra perhitungan dan penyimpanan dari keadaan perpindahan menengah.
zh_hans: 然而，这个改进在取消应用迁移时不适用，因此仍然需要预先计算和存储中间迁移状态。

source: This improvement also requires that Django no longer supports mixed migration plans. Mixed plans consist of a list of migrations where some are being applied and others are being unapplied. This was never officially supported and never had a public API that supports this behavior.
id: Perbaikan ini juga membutuhkan bahwa Django tidak lagi mendukung rencana perpindahan campuran. Rencana campuran terdiri dari daftar perpindahan dimana beberapa sedang diberlakukan dan lainnya tidak diberlakukan. Ini tidak pernah secara resmi didukung dan tidak pernah mempunyai API umum yang mendukung kebiasaan ini.
zh_hans: 这个改进还要求 Django 不再支持混合迁移计划。混合计划包含一系列迁移，其中一些正在应用，而其他一些正在取消应用。这从未得到官方支持，并且从未有过公共 API 来支持这种行为。

source: The :djadmin:`squashmigrations` command now supports specifying the starting migration from which migrations will be squashed.
id: Perintah :djadmin:`squashmigrations` sekarang mendukung menentukan permulaan perpindahan dari dimana perpindahan dilumatkan.
zh_hans: :djadmin:`squashmigrations` 命令现在支持指定要压缩的迁移的起始迁移。

source: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` now works on proxy models.
id: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` sekarang bekerja pada model proxi.
zh_hans: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` 现在可以在代理模型上使用。

source: Database configuration gained a :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` option for interacting with databases that store datetimes in local time and don't support time zones when :setting:`USE_TZ` is ``True``.
id: Konfigurasi basisdata mendapatkan sebuah pilihan :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` untuk interaksi dengan basisdata yang menyimpan datetime di waktu lokal dan tidak mendukung zona waktu ketika :setting:`USE_TZ` adalah ``True``.
zh_hans: 数据库配置增加了一个 :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` 选项，用于与在 :setting:`USE_TZ` 为 ``True`` 时不支持时区的数据库交互，这些数据库将日期时间存储在本地时间中。

source: Added the :meth:`RelatedManager.set() <django.db.models.fields.related.RelatedManager.set()>` method to the related managers created by ``ForeignKey``, ``GenericForeignKey``, and ``ManyToManyField``.
id: Ditambahkan metode :meth:`RelatedManager.set() <django.db.models.fields.related.RelatedManager.set()>` pada pengelola terkait dibuat oleh ``ForeignKey``, ``GenericForeignKey``, dan ``ManyToManyField``.
zh_hans: 新增了 :meth:`RelatedManager.set() <django.db.models.fields.related.RelatedManager.set()>` 方法，用于与由 ``ForeignKey``、``GenericForeignKey`` 和 ``ManyToManyField`` 创建的相关管理器交互。

source: The :meth:`~django.db.models.fields.related.RelatedManager.add` method on a reverse foreign key now has a ``bulk`` parameter to allow executing one query regardless of the number of objects being added rather than one query per object.
id: Metode :meth:`~django.db.models.fields.related.RelatedManager.add` pada sebuah foreign key balikan sekarang mempunyai parameter ``bulk`` untuk mengizinkan menjalankan satu permintaan tanpa memperhatikan dari sejumlah obyek sedang dtambahkan daripada satu permintaan per obyek.
zh_hans: :meth:`~django.db.models.fields.related.RelatedManager.add` 方法在反向外键上现在有一个 ``bulk`` 参数，允许执行一个查询，而不管要添加的对象数量如何，而不是每个对象执行一个查询。

source: Added the ``keep_parents`` parameter to :meth:`Model.delete() <django.db.models.Model.delete>` to allow deleting only a child's data in a model that uses multi-table inheritance.
id: Ditambahkan parameter ``keep_parents`` pada :meth:`Model.delete() <django.db.models.Model.delete>` untuk mengizinkan haya menghapus data anak di model yang menggunakan warisan banyak-tabel.
zh_hans: 在 :meth:`Model.delete() <django.db.models.Model.delete>` 方法中添加了 ``keep_parents`` 参数，允许仅删除使用多表继承的模型中子模型的数据。

source: :meth:`Model.delete() <django.db.models.Model.delete>` and :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` return the number of objects deleted.
id: :meth:`Model.delete() <django.db.models.Model.delete>` dan :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` mengembalikan sejumlah obyek dihapus.
zh_hans: :meth:`Model.delete() <django.db.models.Model.delete>` 和 :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` 返回被删除的对象数量。

source: Added a system check to prevent defining both ``Meta.ordering`` and ``order_with_respect_to`` on the same model.
id: Ditambahkan sebuah pemeriksaan sistem untuk mencegah menentukan kedua ``Meta.ordering`` dan ``order_with_respect_to`` pada model sama.
zh_hans: 添加了一个系统检查，防止在同一模型上同时定义 ``Meta.ordering`` 和 ``order_with_respect_to``。

source: :lookup:`Date and time <year>` lookups can be chained with other lookups (such as :lookup:`exact`, :lookup:`gt`, :lookup:`lt`, etc.). For example: ``Entry.objects.filter(pub_date__month__gt=6)``.
id: Pencarian :lookup:`Date and time <year>` dapat ditambatkan dengan pecnarian lain (seperti :lookup:`exact`, :lookup:`gt`, :lookup:`lt`, dll.). Sebagai contoh: ``Entry.objects.filter(pub_date__month__gt=6)``.
zh_hans: :lookup:`日期和时间 <year>` 查询可以与其他查询（如 :lookup:`exact`, :lookup:`gt`, :lookup:`lt` 等）链接使用。例如：``Entry.objects.filter(pub_date__month__gt=6)``。
