Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed migrations crash on SQLite when altering a model containing partial indexes (:ticket:`30754`).
zh_hans: 修复了在 SQLite 上修改包含部分索引的模型时导致迁移崩溃的问题 (:ticket:`30754`)。

source: Fixed a regression in Django 2.2.4 that caused a crash when filtering with a ``Subquery()`` annotation of a queryset containing ``django.contrib.postgres.fields.JSONField`` or :class:`~django.contrib.postgres.fields.HStoreField` (:ticket:`30769`).
zh_hans: 修复了 Django 2.2.4 中的一个回归问题，导致在使用包含 ``django.contrib.postgres.fields.JSONField`` 或 :class:`~django.contrib.postgres.fields.HStoreField` 的查询集的 ``Subquery()`` 注释进行过滤时崩溃的问题 (:ticket:`30769`)。

source: Django 2.2.7 release notes
zh_hans: Django 2.2.7 版本发行说明

source: Django 2.2.7 fixes several bugs in 2.2.6.
zh_hans: Django 2.2.7 修复了 Django 2.2.6 中的若干个错误。

source: Prevented :option:`migrate --plan` from showing that ``RunPython`` operations are irreversible when ``reverse_code`` callables don't have docstrings or when showing a forward migration plan (:ticket:`30870`).
zh_hans: 防止 :option:`migrate --plan` 显示 ``RunPython`` 操作是不可逆转的，当 ``reverse_code`` 可调用对象没有文档字符串或者在显示正向迁移计划时 (:ticket:`30870`)。

source: Fixed migrations crash on PostgreSQL when adding an :class:`~django.db.models.Index` with fields ordering and :attr:`~.Index.opclasses` (:ticket:`30903`).
zh_hans: 修复了在 PostgreSQL 上添加带有字段排序和 :attr:`~.Index.opclasses` 的 :class:`~django.db.models.Index` 时导致迁移崩溃的问题 (:ticket:`30903`)。

source: Restored the ability to override :meth:`~django.db.models.Model.get_FOO_display` (:ticket:`30931`).
zh_hans: 恢复了覆盖 :meth:`~django.db.models.Model.get_FOO_display` 的能力 (:ticket:`30931`)。

source: Django 2.2.8 release notes
zh_hans: Django 2.2.8 版本发行说明

source: Django 2.2.8 fixes a security issue, several bugs in 2.2.7, and adds compatibility with Python 3.8.
zh_hans: Django 2.2.8 修复了 Django 2.2.7 中的一个安全问题和若干个错误，并增加了与 Python 3.8 的兼容性。

source: Fixed a data loss possibility in the admin changelist view when a custom :ref:`formset's prefix <formset-prefix>` contains regular expression special characters, e.g. ``'$'`` (:ticket:`31031`).
zh_hans: 修复了在自定义 :ref:`formset 的前缀 <formset-prefix>` 包含正则表达式特殊字符（例如 ``'$'``）时，管理 changelist 视图中的数据丢失可能性的问题 (:ticket:`31031`)。

source: Fixed a regression in Django 2.2.1 that caused a crash when migrating permissions for proxy models with a multiple database setup if the ``default`` entry was empty (:ticket:`31021`).
zh_hans: 修复了 Django 2.2.1 中的一个回归问题，如果 ``default`` 条目为空，在具有多个数据库设置的情况下，迁移权限时会导致代理模型崩溃 (:ticket:`31021`)。

source: Django 2.2.9 release notes
zh_hans: Django 2.2.9 版本发行说明

source: Django 2.2.9 fixes a security issue and a data loss bug in 2.2.8.
zh_hans: Django 2.2.9 修复了 Django 2.2.8 中的一个安全问题和一个数据丢失错误。

source: Django 3.0 release notes
zh_hans: Django 3.0 版本发行说明

source: Welcome to Django 3.0!
zh_hans: 欢迎使用 Django 3.0 ！

source: These release notes cover the :ref:`new features <whats-new-3.0>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-3.0>` you'll want to be aware of when upgrading from Django 2.2 or earlier. We've :ref:`dropped some features<removed-features-3.0>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-3.0>`.
zh_hans: 这些发行说明涵盖了 :ref:`新功能 <whats-new-3.0>`，以及一些 :ref:`不兼容的变化 <backwards-incompatible-3.0>`，当您从 Django 2.2 或更早版本升级时需要注意。我们已经 :ref:`删除了一些已经完成了其弃用周期的功能 <removed-features-3.0>`，并且我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-3.0>`。

source: Django 3.0 supports Python 3.6, 3.7, 3.8, and 3.9 (as of 3.0.11). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 3.0 支持 Python 3.6、3.7、3.8 和 3.9（截至 3.0.11 版）。我们 **强烈推荐** 并且只官方支持每个系列的最新版本。

source: The Django 2.2.x series is the last to support Python 3.5.
zh_hans: Django 2.2.x 系列是最后一个支持 Python 3.5 的版本。

source: Following the release of Django 3.0, we suggest that third-party app authors drop support for all versions of Django prior to 2.2. At that time, you should be able to run your package's tests using ``python -Wd`` so that deprecation warnings appear. After making the deprecation warning fixes, your app should be compatible with Django 3.0.
zh_hans: 在发布 Django 3.0 后，我们建议第三方应用程序作者停止支持 Django 2.2 之前的所有版本。在那个时候，您应该能够使用 ``python -Wd`` 运行您包的测试，以便看到弃用警告。在进行弃用警告修复后，您的应用程序应该与 Django 3.0 兼容。

source: What's new in Django 3.0
zh_hans: Django 3.0 新特性

source: MariaDB support
zh_hans: MariaDB 支持

source: Django now officially supports `MariaDB <https://mariadb.org/>`_ 10.1 and higher. See :ref:`MariaDB notes <mariadb-notes>` for more details.
zh_hans: Django 现在正式支持 `MariaDB <https://mariadb.org/>`_ 10.1 及更高版本。更多详情请参阅 :ref:`MariaDB 注意事项 <mariadb-notes>`。

source: ASGI support
zh_hans: ASGI 支持

source: Django 3.0 begins our journey to making Django fully async-capable by providing support for running as an `ASGI <https://asgi.readthedocs.io/>`_ application.
zh_hans: Django 3.0 开始了我们使 Django 完全支持异步的旅程，通过提供作为 `ASGI <https://asgi.readthedocs.io/>`_ 应用程序运行的支持。

source: This is in addition to our existing WSGI support. Django intends to support both for the foreseeable future. Async features will only be available to applications that run under ASGI, however.
zh_hans: 这是在我们现有的 WSGI 支持之外的补充。 Django 计划在可预见的未来同时支持两者。然而，异步功能只适用于在 ASGI 下运行的应用程序。

source: At this stage async support only applies to the outer ASGI application. Internally everything remains synchronous. Asynchronous middleware, views, etc. are not yet supported. You can, however, use ASGI middleware around Django's application, allowing you to combine Django with other ASGI frameworks.
zh_hans: 在当前阶段，异步支持仅适用于外部 ASGI 应用程序。内部的所有内容仍然是同步的。异步中间件、视图等尚不受支持。但是，您可以在 Django 应用程序周围使用 ASGI 中间件，从而可以将 Django 与其他 ASGI 框架结合使用。

source: There is no need to switch your applications over unless you want to start experimenting with asynchronous code, but we have :doc:`documentation on deploying with ASGI </howto/deployment/asgi/index>` if you want to learn more.
zh_hans: 除非您想开始尝试异步代码，否则没有必要切换您的应用程序，但如果您想了解更多信息，我们有关于使用 ASGI 部署的 :doc:`文档 </howto/deployment/asgi/index>`。

source: Note that as a side-effect of this change, Django is now aware of asynchronous event loops and will block you calling code marked as "async unsafe" - such as ORM operations - from an asynchronous context. If you were using Django from async code before, this may trigger if you were doing it incorrectly. If you see a ``SynchronousOnlyOperation`` error, then closely examine your code and move any database operations to be in a synchronous child thread.
zh_hans: 请注意，由于这个改变的副作用，Django 现在可以识别异步事件循环，并会阻止您从异步上下文中调用标记为 "async unsafe" 的代码，比如 ORM 操作。如果您以前从异步代码中使用 Django，那么如果使用不正确，这可能会触发问题。如果看到 ``SynchronousOnlyOperation`` 错误，请仔细检查您的代码，并将任何数据库操作移动到同步的子线程中。

source: Exclusion constraints on PostgreSQL
zh_hans: PostgreSQL 上的排除约束

source: The new :class:`~django.contrib.postgres.constraints.ExclusionConstraint` class enable adding exclusion constraints on PostgreSQL. Constraints are added to models using the :attr:`Meta.constraints <django.db.models.Options.constraints>` option.
zh_hans: 新的 :class:`~django.contrib.postgres.constraints.ExclusionConstraint` 类允许在 PostgreSQL 上添加排除约束。约束通过在模型中使用 :attr:`Meta.constraints <django.db.models.Options.constraints>` 选项来添加。

source: Filter expressions
zh_hans: 过滤表达式

source: Expressions that output :class:`~django.db.models.BooleanField` may now be used directly in ``QuerySet`` filters, without having to first annotate and then filter against the annotation.
zh_hans: 现在可以直接在 ``QuerySet`` 过滤器中使用输出 :class:`~django.db.models.BooleanField` 的表达式，而不需要首先注释然后对注释进行过滤。

source: Enumerations for model field choices
zh_hans: 模型字段选择的枚举类型

source: Custom enumeration types ``TextChoices``, ``IntegerChoices``, and ``Choices`` are now available as a way to define :attr:`.Field.choices`. ``TextChoices`` and ``IntegerChoices`` types are provided for text and integer fields. The ``Choices`` class allows defining a compatible enumeration for other concrete data types. These custom enumeration types support human-readable labels that can be translated and accessed via a property on the enumeration or its members. See :ref:`Enumeration types <field-choices-enum-types>` for more details and examples.
zh_hans: 现在可以使用自定义枚举类型 ``TextChoices``、``IntegerChoices`` 和 ``Choices`` 来定义 :attr:`.Field.choices`。``TextChoices`` 和 ``IntegerChoices`` 类型用于文本和整数字段。``Choices`` 类允许为其他具体数据类型定义兼容的枚举。这些自定义枚举类型支持可翻译的人类可读标签，并可以通过枚举或其成员的属性来访问。有关更多详细信息和示例，请参阅 :ref:`枚举类型 <field-choices-enum-types>`。

source: Added support for the ``admin_order_field`` attribute on properties in :attr:`.ModelAdmin.list_display`.
zh_hans: 在 :attr:`.ModelAdmin.list_display` 中的属性上添加了对 ``admin_order_field`` 属性的支持。

source: The new :meth:`ModelAdmin.get_inlines() <django.contrib.admin.ModelAdmin.get_inlines>` method allows specifying the inlines based on the request or model instance.
zh_hans: 新的 :meth:`ModelAdmin.get_inlines() <django.contrib.admin.ModelAdmin.get_inlines>` 方法允许根据请求或模型实例来指定内联。

source: Select2 library is upgraded from version 4.0.3 to 4.0.7.
zh_hans: Select2 库的版本已从 4.0.3 升级到 4.0.7 。

source: jQuery is upgraded from version 3.3.1 to 3.4.1.
zh_hans: jQuery 的版本已从 3.3.1 升级到 3.4.1 。

source: The new ``reset_url_token`` attribute in :class:`~django.contrib.auth.views.PasswordResetConfirmView` allows specifying a token parameter displayed as a component of password reset URLs.
zh_hans: 在 :class:`~django.contrib.auth.views.PasswordResetConfirmView` 中新增了 ``reset_url_token`` 属性，允许指定作为密码重置 URL 组件显示的令牌参数。

source: Added :class:`~django.contrib.auth.backends.BaseBackend` class to ease customization of authentication backends.
zh_hans: 添加了 :class:`~django.contrib.auth.backends.BaseBackend` 类，以便更容易自定义身份验证后端。

source: Added :meth:`~django.contrib.auth.models.User.get_user_permissions()` method to mirror the existing :meth:`~django.contrib.auth.models.User.get_group_permissions()` method.
zh_hans: 添加了 :meth:`~django.contrib.auth.models.User.get_user_permissions()` 方法，以对应现有的 :meth:`~django.contrib.auth.models.User.get_group_permissions()` 方法。

source: Added HTML ``autocomplete`` attribute to widgets of username, email, and password fields in :mod:`django.contrib.auth.forms` for better interaction with browser password managers.
zh_hans: 在 :mod:`django.contrib.auth.forms` 中的用户名、电子邮件和密码字段的小部件中添加了 HTML ``autocomplete`` 属性，以更好地与浏览器密码管理器交互。

source: :djadmin:`createsuperuser` now falls back to environment variables for password and required fields, when a corresponding command line argument isn't provided in non-interactive mode.
zh_hans: :djadmin:`createsuperuser` 现在在非交互模式下，当没有提供相应的命令行参数时，会回退到环境变量来获取密码和必填字段。

source: :attr:`~django.contrib.auth.models.CustomUser.REQUIRED_FIELDS` now supports :class:`~django.db.models.ManyToManyField`\s.
zh_hans: :attr:`~django.contrib.auth.models.CustomUser.REQUIRED_FIELDS` 现在支持 :class:`~django.db.models.ManyToManyField`。

source: The new :meth:`.UserManager.with_perm` method returns users that have the specified permission.
zh_hans: 新的 :meth:`.UserManager.with_perm` 方法返回具有指定权限的用户。

source: The default iteration count for the PBKDF2 password hasher is increased from 150,000 to 180,000.
zh_hans: PBKDF2 密码哈希器的默认迭代次数从 150 , 000 增加到 180 , 000 。

source: Allowed MySQL spatial lookup functions to operate on real geometries. Previous support was limited to bounding boxes.
zh_hans: 允许 MySQL 空间查询函数在真实几何对象上操作。之前的支持仅限于边界框。

source: Added the :class:`~django.contrib.gis.db.models.functions.GeometryDistance` function, supported on PostGIS.
zh_hans: 添加了 :class:`~django.contrib.gis.db.models.functions.GeometryDistance` 函数，在 PostGIS 上支持。

source: Added support for the ``furlong`` unit in :class:`~django.contrib.gis.measure.Distance`.
zh_hans: 在 :class:`~django.contrib.gis.measure.Distance` 中添加了对 ``furlong`` 单位的支持。

source: The :setting:`GEOIP_PATH` setting now supports :class:`pathlib.Path`.
zh_hans: :setting:`GEOIP_PATH` 设置现在支持 :class:`pathlib.Path`。

source: The :class:`~django.contrib.gis.geoip2.GeoIP2` class now accepts :class:`pathlib.Path` ``path``.
zh_hans: :class:`~django.contrib.gis.geoip2.GeoIP2` 类现在接受 :class:`pathlib.Path` 的 ``path``。

source: The new :class:`~django.contrib.postgres.fields.RangeOperators` helps to avoid typos in SQL operators that can be used together with :class:`~django.contrib.postgres.fields.RangeField`.
zh_hans: 新的 :class:`~django.contrib.postgres.fields.RangeOperators` 有助于避免在可以与 :class:`~django.contrib.postgres.fields.RangeField` 一起使用的 SQL 运算符中出现拼写错误。

source: The new :class:`~django.contrib.postgres.fields.RangeBoundary` expression represents the range boundaries.
zh_hans: 新的 :class:`~django.contrib.postgres.fields.RangeBoundary` 表达式表示范围的边界。

source: The new :class:`~django.contrib.postgres.operations.AddIndexConcurrently` and :class:`~django.contrib.postgres.operations.RemoveIndexConcurrently` classes allow creating and dropping indexes ``CONCURRENTLY`` on PostgreSQL.
zh_hans: 新的 :class:`~django.contrib.postgres.operations.AddIndexConcurrently` 和 :class:`~django.contrib.postgres.operations.RemoveIndexConcurrently` 类允许在 PostgreSQL 上使用 ``CONCURRENTLY`` 创建和删除索引。

source: The new :meth:`~django.contrib.sessions.backends.base.SessionBase.get_session_cookie_age()` method allows dynamically specifying the session cookie age.
zh_hans: 新的 :meth:`~django.contrib.sessions.backends.base.SessionBase.get_session_cookie_age()` 方法允许动态指定会话 cookie 的过期时间。

source: Added the ``language`` class attribute to the :class:`django.contrib.syndication.views.Feed` to customize a feed language. The default value is :func:`~django.utils.translation.get_language()` instead of :setting:`LANGUAGE_CODE`.
zh_hans: 在 :class:`django.contrib.syndication.views.Feed` 中添加了 ``language`` 类属性，以自定义 feed 的语言。默认值是 :func:`~django.utils.translation.get_language()`，而不是 :setting:`LANGUAGE_CODE`。

source: :func:`~django.utils.cache.add_never_cache_headers` and :func:`~django.views.decorators.cache.never_cache` now add the ``private`` directive to ``Cache-Control`` headers.
zh_hans: :func:`~django.utils.cache.add_never_cache_headers` 和 :func:`~django.views.decorators.cache.never_cache` 现在在 ``Cache-Control`` 头中添加了 ``private`` 指令。

source: The new :meth:`.Storage.get_alternative_name` method allows customizing the algorithm for generating filenames if a file with the uploaded name already exists.
zh_hans: 新的 :meth:`.Storage.get_alternative_name` 方法允许自定义生成文件名的算法，如果已经存在具有上传名称的文件。

source: Formsets may control the widget used when ordering forms via :attr:`~django.forms.formsets.BaseFormSet.can_order` by setting the :attr:`~django.forms.formsets.BaseFormSet.ordering_widget` attribute or overriding :attr:`~django.forms.formsets.BaseFormSet.get_ordering_widget()`.
zh_hans: 通过设置 :attr:`~django.forms.formsets.BaseFormSet.ordering_widget` 属性或覆盖 :attr:`~django.forms.formsets.BaseFormSet.get_ordering_widget()`，表单集合可以控制在通过 :attr:`~django.forms.formsets.BaseFormSet.can_order` 排序表单时使用的小部件。

source: Added the :setting:`LANGUAGE_COOKIE_HTTPONLY`, :setting:`LANGUAGE_COOKIE_SAMESITE`, and :setting:`LANGUAGE_COOKIE_SECURE` settings to set the ``HttpOnly``, ``SameSite``, and ``Secure`` flags on language cookies. The default values of these settings preserve the previous behavior.
zh_hans: 添加了 :setting:`LANGUAGE_COOKIE_HTTPONLY`、:setting:`LANGUAGE_COOKIE_SAMESITE` 和 :setting:`LANGUAGE_COOKIE_SECURE` 设置，用于在语言 cookie 上设置 ``HttpOnly``、``SameSite`` 和 ``Secure`` 标志。这些设置的默认值保留了以前的行为。

source: Added support and translations for the Uzbek language.
zh_hans: 增加了对乌兹别克语的支持和翻译。

source: The new ``reporter_class`` parameter of :class:`~django.utils.log.AdminEmailHandler` allows providing an ``django.views.debug.ExceptionReporter`` subclass to customize the traceback text sent to site :setting:`ADMINS` when :setting:`DEBUG` is ``False``.
zh_hans: :class:`~django.utils.log.AdminEmailHandler` 的新参数 ``reporter_class`` 允许提供一个 ``django.views.debug.ExceptionReporter`` 的子类，以自定义在 :setting:`DEBUG` 为 ``False`` 时发送给站点 :setting:`ADMINS` 的异常回溯文本。

source: The new :option:`compilemessages --ignore` option allows ignoring specific directories when searching for ``.po`` files to compile.
zh_hans: 新的 :option:`compilemessages --ignore` 选项允许在搜索要编译的 ``.po`` 文件时忽略特定目录。

source: :option:`showmigrations --list` now shows the applied datetimes when ``--verbosity`` is 2 and above.
zh_hans: :option:`showmigrations --list` 在 ``--verbosity`` 为 2 及以上时现在会显示已应用的日期时间。

source: On PostgreSQL, :djadmin:`dbshell` now supports client-side TLS certificates.
zh_hans: 在 PostgreSQL 上，:djadmin:`dbshell` 现在支持客户端端的 TLS 证书。

source: :djadmin:`inspectdb` now introspects :class:`~django.db.models.OneToOneField` when a foreign key has a unique or primary key constraint.
zh_hans: :djadmin:`inspectdb` 现在在外键具有唯一或主键约束时会检查 :class:`~django.db.models.OneToOneField`。

source: The new :option:`--skip-checks` option skips running system checks prior to running the command.
zh_hans: 新的 :option:`--skip-checks` 选项在运行命令之前跳过运行系统检查。

source: The :option:`startapp --template` and :option:`startproject --template` options now support templates stored in XZ archives (``.tar.xz``, ``.txz``) and LZMA archives (``.tar.lzma``, ``.tlz``).
zh_hans: :option:`startapp --template` 和 :option:`startproject --template` 选项现在支持存储在 XZ 存档（``.tar.xz``、``.txz``）和 LZMA 存档（``.tar.lzma``、``.tlz``）中的模板。

source: Added hash database functions :class:`~django.db.models.functions.MD5`, :class:`~django.db.models.functions.SHA1`, :class:`~django.db.models.functions.SHA224`, :class:`~django.db.models.functions.SHA256`, :class:`~django.db.models.functions.SHA384`, and :class:`~django.db.models.functions.SHA512`.
zh_hans: 添加了哈希数据库函数 :class:`~django.db.models.functions.MD5`、:class:`~django.db.models.functions.SHA1`、:class:`~django.db.models.functions.SHA224`、:class:`~django.db.models.functions.SHA256`、:class:`~django.db.models.functions.SHA384` 和 :class:`~django.db.models.functions.SHA512`。

source: Added the :class:`~django.db.models.functions.Sign` database function.
zh_hans: 添加了 :class:`~django.db.models.functions.Sign` 数据库函数。

source: The new ``is_dst`` parameter of the :class:`~django.db.models.functions.Trunc` database functions determines the treatment of nonexistent and ambiguous datetimes.
zh_hans: :class:`~django.db.models.functions.Trunc` 数据库函数的新参数 ``is_dst`` 决定了不存在和模糊的日期时间的处理方式。

source: ``connection.queries`` now shows ``COPY … TO`` statements on PostgreSQL.
zh_hans: ``connection.queries`` 现在在 PostgreSQL 上显示 ``COPY … TO`` 语句。

source: :class:`~django.db.models.FilePathField` now accepts a callable for ``path``.
zh_hans: :class:`~django.db.models.FilePathField` 现在接受可调用对象作为 ``path``。

source: Allowed symmetrical intermediate table for self-referential :class:`~django.db.models.ManyToManyField`.
zh_hans: 允许自引用 :class:`~django.db.models.ManyToManyField` 的对称中间表。

source: The ``name`` attributes of :class:`~django.db.models.CheckConstraint`, :class:`~django.db.models.UniqueConstraint`, and :class:`~django.db.models.Index` now support app label and class interpolation using the ``'%(app_label)s'`` and ``'%(class)s'`` placeholders.
zh_hans: :class:`~django.db.models.CheckConstraint`、:class:`~django.db.models.UniqueConstraint` 和 :class:`~django.db.models.Index` 的 ``name`` 属性现在支持使用 ``'%(app_label)s'`` 和 ``'%(class)s'`` 占位符进行应用标签和类插值。

source: The new :attr:`.Field.descriptor_class` attribute allows model fields to customize the get and set behavior by overriding their :py:ref:`descriptors <descriptors>`.
zh_hans: 新的 :attr:`.Field.descriptor_class` 属性允许模型字段通过重写它们的 :py:ref:`描述符 <descriptors>` 来自定义获取和设置行为。

source: :class:`~django.db.models.Avg` and :class:`~django.db.models.Sum` now support the ``distinct`` argument.
zh_hans: :class:`~django.db.models.Avg` 和 :class:`~django.db.models.Sum` 现在支持 ``distinct`` 参数。

source: Added :class:`~django.db.models.SmallAutoField` which acts much like an :class:`~django.db.models.AutoField` except that it only allows values under a certain (database-dependent) limit. Values from ``1`` to ``32767`` are safe in all databases supported by Django.
zh_hans: 添加了 :class:`~django.db.models.SmallAutoField`，它的行为类似于 :class:`~django.db.models.AutoField`，但它只允许在某个（与数据库相关的）限制内的值。在Django支持的所有数据库中，值从 ``1`` 到 ``32767`` 都是安全的。

source: :class:`~django.db.models.AutoField`, :class:`~django.db.models.BigAutoField`, and :class:`~django.db.models.SmallAutoField` now inherit from ``IntegerField``, ``BigIntegerField`` and ``SmallIntegerField`` respectively. System checks and validators are now also properly inherited.
zh_hans: :class:`~django.db.models.AutoField`、:class:`~django.db.models.BigAutoField` 和 :class:`~django.db.models.SmallAutoField` 现在分别继承自 ``IntegerField``、``BigIntegerField`` 和 ``SmallIntegerField``。系统检查和验证器现在也会正确继承。

source: :attr:`.FileField.upload_to` now supports :class:`pathlib.Path`.
zh_hans: :attr:`.FileField.upload_to` 现在支持 :class:`pathlib.Path`。

source: :class:`~django.db.models.CheckConstraint` is now supported on MySQL 8.0.16+.
zh_hans: :class:`~django.db.models.CheckConstraint` 现在在 MySQL 8.0.16+ 上受支持。

source: The new ``allows_group_by_selected_pks_on_model()`` method of ``django.db.backends.base.BaseDatabaseFeatures`` allows optimization of ``GROUP BY`` clauses to require only the selected models' primary keys. By default, it's supported only for managed models on PostgreSQL.
zh_hans: ``django.db.backends.base.BaseDatabaseFeatures`` 的新方法 ``allows_group_by_selected_pks_on_model()`` 允许优化 ``GROUP BY`` 子句，只需要选定的模型主键。默认情况下，它仅在 PostgreSQL 上支持托管的模型。

source: To enable the ``GROUP BY`` primary key-only optimization for unmanaged models, you have to subclass the PostgreSQL database engine, overriding the features class ``allows_group_by_selected_pks_on_model()`` method as you require. See :ref:`Subclassing the built-in database backends <subclassing-database-backends>` for an example.
zh_hans: 要启用针对未托管模型的 ``GROUP BY`` 主键优化，您需要子类化 PostgreSQL 数据库引擎，并根据需要覆盖 features 类的 ``allows_group_by_selected_pks_on_model()`` 方法。有关示例，请参阅 :ref:`子类化内置数据库后端 <subclassing-database-backends>`。

source: Allowed :class:`~django.http.HttpResponse` to be initialized with :class:`memoryview` content.
zh_hans: 允许使用 :class:`memoryview` 内容初始化 :class:`~django.http.HttpResponse`。

source: For use in, for example, Django templates, :attr:`.HttpRequest.headers` now allows lookups using underscores (e.g. ``user_agent``) in place of hyphens.
zh_hans: 例如，在 Django 模板中，现在允许使用下划线（例如，``user_agent``）来查找 :attr:`.HttpRequest.headers`，而不是连字符。

source: Security
zh_hans: 安全

source: :setting:`X_FRAME_OPTIONS` now defaults to ``'DENY'``. In older versions, the :setting:`X_FRAME_OPTIONS` setting defaults to ``'SAMEORIGIN'``. If your site uses frames of itself, you will need to explicitly set ``X_FRAME_OPTIONS = 'SAMEORIGIN'`` for them to continue working.
zh_hans: :setting:`X_FRAME_OPTIONS` 现在默认为 ``'DENY'``。在较旧的版本中，:setting:`X_FRAME_OPTIONS` 设置默认为 ``'SAMEORIGIN'``。如果您的站点使用自身的框架，您将需要显式设置 ``X_FRAME_OPTIONS = 'SAMEORIGIN'``，以便它们继续正常工作。

source: :setting:`SECURE_CONTENT_TYPE_NOSNIFF` now defaults to ``True``. With this enabled, :class:`~django.middleware.security.SecurityMiddleware` sets the :ref:`x-content-type-options` header on all responses that do not already have it.
zh_hans: :setting:`SECURE_CONTENT_TYPE_NOSNIFF` 现在默认为 ``True``。启用此选项后，:class:`~django.middleware.security.SecurityMiddleware` 会在所有尚未设置该标头的响应上设置 :ref:`x-content-type-options` 标头。

source: :class:`~django.middleware.security.SecurityMiddleware` can now send the :ref:`Referrer-Policy <referrer-policy>` header.
zh_hans: :class:`~django.middleware.security.SecurityMiddleware` 现在可以发送 :ref:`Referrer-Policy <referrer-policy>` 标头。
