Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The new ``CIText`` mixin and :class:`~django.contrib.postgres.operations.CITextExtension` migration operation allow using PostgreSQL's ``citext`` extension for case-insensitive lookups. Three fields are provided: ``CICharField``, ``CIEmailField``, and ``CITextField``.
zh_hans: 新的 ``CIText`` 混合类和 :class:`~django.contrib.postgres.operations.CITextExtension` 迁移操作允许在 PostgreSQL 中使用 ``citext`` 扩展来进行不区分大小写的查找。提供了三个字段：``CICharField``、``CIEmailField`` 和 ``CITextField``。

source: The new :class:`~django.contrib.postgres.aggregates.JSONBAgg` allows aggregating values as a JSON array.
id: :class:`~django.contrib.postgres.aggregates.JSONBAgg` baru mengizinkan menggabungkan nilai-nilai sebagai larik JSON.
zh_hans: 新的 :class:`~django.contrib.postgres.aggregates.JSONBAgg` 允许将值聚合为 JSON 数组。

source: The :class:`~django.contrib.postgres.fields.HStoreField` (model field) and :class:`~django.contrib.postgres.forms.HStoreField` (form field) allow storing null values.
id: :class:`~django.contrib.postgres.fields.HStoreField` (bidang model) dan :class:`~django.contrib.postgres.forms.HStoreField` (bidang formulir) mengizinkan menyimpan nilai null.
zh_hans: :class:`~django.contrib.postgres.fields.HStoreField` （模型字段）和 :class:`~django.contrib.postgres.forms.HStoreField` （表单字段）允许存储空值。

source: Memcached backends now pass the contents of :setting:`OPTIONS <CACHES-OPTIONS>` as keyword arguments to the client constructors, allowing for more advanced control of client behavior. See the :ref:`cache arguments <cache_arguments>` documentation for examples.
id: Backend memcached sekarang melewatkan isi dari :setting:`OPTIONS 1` sebagai argumen katakunci ke pembangun klien, mengizinkan untuk pengendalian lebih lanjut dari perulaku klien. Lihat dokumentasi :ref:`cache arguments 2` sebagai contoh.
zh_hans: Memcached 后端现在将 :setting:`OPTIONS <CACHES-OPTIONS>` 的内容作为关键字参数传递给客户端构造函数，允许更高级的客户端行为控制。请参阅 :ref:`cache arguments <cache_arguments>` 文档以获取示例。

source: Memcached backends now allow defining multiple servers as a comma-delimited string in :setting:`LOCATION <CACHES-LOCATION>`, for convenience with third-party services that use such strings in environment variables.
id: Backend memcached sekarang mengizinkan banyak peladen sebagai string comma-delimited dalam :setting:`LOCATION 1`, untuk kenyamanan dengan layanan pihak-ketiga yang menggunakan string tersebut dalam variabel lingkungan.
zh_hans: Memcached 后端现在允许在 :setting:`LOCATION <CACHES-LOCATION>` 中定义多个服务器，使用逗号分隔的字符串，以方便处理使用这种字符串的环境变量的第三方服务。

source: Added the :setting:`CSRF_USE_SESSIONS` setting to allow storing the CSRF token in the user's session rather than in a cookie.
id: Ditambahkan pengaturan :setting:`CSRF_USE_SESSIONS` untuk mengizinkan menyimpan token CSRF dalam sesi pengguna daripada dalam sebuah kue.
zh_hans: 新增了 :setting:`CSRF_USE_SESSIONS` 设置，允许将 CSRF 令牌存储在用户的会话中，而不是在 cookie 中。

source: Added the ``skip_locked`` argument to :meth:`.QuerySet.select_for_update()` on PostgreSQL 9.5+ and Oracle to execute queries with ``FOR UPDATE SKIP LOCKED``.
id: Ditambahkan argumen ``skip_locked`` pada :meth:`.QuerySet.select_for_update()` pada PostgreSQL 9.5+ dan Oracle untuk menjalankan permintaan dengan ``FOR UPDATE SKIP LOCKED``.
zh_hans: 在 PostgreSQL 9.5+ 和 Oracle 上，新增了 ``skip_locked`` 参数，用于执行带有 ``FOR UPDATE SKIP LOCKED`` 的查询，可通过 :meth:`.QuerySet.select_for_update()` 使用。

source: Added the :setting:`TEST['TEMPLATE'] <TEST_TEMPLATE>` setting to let PostgreSQL users specify a template for creating the test database.
id: Ditambahkan pengaturan :setting:`TEST['TEMPLATE'] <TEST_TEMPLATE>` untuk membuat pengguna PostgreSQL menentukan sebuah cetakan untuk membuat basisdata percobaan.
zh_hans: 新增了 :setting:`TEST['TEMPLATE'] <TEST_TEMPLATE>` 设置，允许 PostgreSQL 用户指定用于创建测试数据库的模板。

source: :meth:`.QuerySet.iterator()` now uses `server-side cursors`_ on PostgreSQL. This feature transfers some of the worker memory load (used to hold query results) to the database and might increase database memory usage.
zh_hans: :meth:`.QuerySet.iterator()` 现在在 PostgreSQL 上使用 `server-side cursors`_。这个功能将一些用于保存查询结果的工作内存负载转移到数据库，可能会增加数据库的内存使用量。

source: Added MySQL support for the ``'isolation_level'`` option in :setting:`OPTIONS` to allow specifying the :ref:`transaction isolation level <mysql-isolation-level>`. To avoid possible data loss, it's recommended to switch from MySQL's default level, repeatable read, to read committed.
id: Ditambahkan dukungan MySQL untuk pilihan ``'isolation_level'`` dalam :setting:`OPTIONS` untuk mengizinkan menentukan :ref:`transaction isolation level <mysql-isolation-level>`. Untuk menghindari kemungkinan data hilang, itu dianjurkan untuk mengganti dari tingkat awalan MySQL, pembacaan berulang, untuk membaca diperbaiki.
zh_hans: 新增了对在 :setting:`OPTIONS` 中使用 ``'isolation_level'`` 选项的 MySQL 支持，允许指定 :ref:`事务隔离级别 <mysql-isolation-level>`。为了避免可能的数据丢失，建议从 MySQL 的默认级别 repeatable read 切换到 read committed。

source: Added support for ``cx_Oracle`` 5.3.
id: Ditambahkan dukungan untuk ``cx_Oracle`` 5.3.
zh_hans: 新增了对 ``cx_Oracle`` 5.3 的支持。

source: Email
id: Surel
zh_hans: 电子邮件

source: Added the :setting:`EMAIL_USE_LOCALTIME` setting to allow sending SMTP date headers in the local time zone rather than in UTC.
id: Ditambahkan pengaturan :setting:`EMAIL_USE_LOCALTIME` untuk mengizinkan mengirimkan kepala tanggal SMTP dalam zona waktu lokal daripada dalam UTC.
zh_hans: 新增了 :setting:`EMAIL_USE_LOCALTIME` 设置，允许将 SMTP 日期标头发送到本地时区，而不是 UTC。

source: ``EmailMessage.attach()`` and ``attach_file()`` now fall back to MIME type :mimetype:`application/octet-stream` when binary content that can't be decoded as UTF-8 is specified for a :mimetype:`text/*` attachment.
zh_hans: ``EmailMessage.attach()`` 和 ``attach_file()`` 现在在为 :mimetype:`text/*` 附件指定无法解码为 UTF-8 的二进制内容时，会回退到 MIME 类型 :mimetype:`application/octet-stream`。

source: To make it wrappable by :class:`io.TextIOWrapper`, :class:`~django.core.files.File` now has the ``readable()``, ``writable()``, and ``seekable()`` methods.
id: Untuk membuatnya dapat dibungkus oleh :class:`io.TextIOWrapper`, :class:`~django.core.files.File` sekarang mempunyai metode ``readable()``, ``writable()``, dan ``seekable()``.
zh_hans: 为了能够被 :class:`io.TextIOWrapper` 包装，:class:`~django.core.files.File` 现在具有 ``readable()``、``writable()`` 和 ``seekable()`` 方法。

source: The new ``empty_value`` attribute on :class:`~django.forms.CharField`, :class:`~django.forms.EmailField`, :class:`~django.forms.RegexField`, :class:`~django.forms.SlugField`, and :class:`~django.forms.URLField` allows specifying the Python value to use to represent "empty".
zh_hans: 在 :class:`~django.forms.CharField`、:class:`~django.forms.EmailField`、:class:`~django.forms.RegexField`、:class:`~django.forms.SlugField` 和 :class:`~django.forms.URLField` 上新增了 ``empty_value`` 属性，允许指定表示 "空" 的 Python 值。

source: The new :meth:`Form.get_initial_for_field() <django.forms.Form.get_initial_for_field>` method returns initial data for a form field.
id: Metode :meth:`Form.get_initial_for_field() <django.forms.Form.get_initial_for_field>` baru mengembalikan data inisial untuk sebuah bidang formulir.
zh_hans: 新的 :meth:`Form.get_initial_for_field() <django.forms.Form.get_initial_for_field>` 方法返回表单字段的初始数据。

source: Number formatting and the :setting:`NUMBER_GROUPING` setting support non-uniform digit grouping.
id: Pembentukan angka dan pengaturan :setting:`NUMBER_GROUPING` dukungan pengelompokan angka bukan-seragam.
zh_hans: 数字格式化和 :setting:`NUMBER_GROUPING` 设置支持非均匀的数字分组。

source: The new :option:`loaddata --exclude` option allows excluding models and apps while loading data from fixtures.
id: Pilihan :option:`loaddata --exclude` baru mengizinkan tidak menyertakan model dan aplikasi selagi memuat data dari peralatan tetap.
zh_hans: 新的 :option:`loaddata --exclude` 选项允许在从 fixture 加载数据时排除模型和应用程序。

source: The new :option:`diffsettings --default` option allows specifying a settings module other than Django's default settings to compare against.
id: Pilihan :option:`diffsettings --default`baru mengizinkan menentukan modul pengaturan selain dari pengaturan awalan Django untuk dibandingkan.
zh_hans: 新的 :option:`diffsettings --default` 选项允许指定与 Django 默认设置进行比较的设置模块。

source: ``app_label``\s arguments now limit the :option:`showmigrations --plan` output.
id: Argumen ``app_label`` sekarang membatasi keluaran :option:`showmigrations --plan`.
zh_hans: ``app_label`` 参数现在限制了 :option:`showmigrations --plan` 输出。

source: Added support for serialization of ``uuid.UUID`` objects.
id: Ditambahkan dukungan untuk serialisasi dari obyek ``uuid.UUID``.
zh_hans: 新增了对 ``uuid.UUID`` 对象的序列化支持。

source: Added support for callable values in the ``defaults`` argument of :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` and :meth:`~django.db.models.query.QuerySet.get_or_create`.
id: Ditambahkan dukungan untuk nilai dapat dipanggil dalam argumen ``defaults`` dari :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` dan :meth:`~django.db.models.query.QuerySet.get_or_create`.
zh_hans: 在 :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` 和 :meth:`~django.db.models.query.QuerySet.get_or_create` 的 ``defaults`` 参数中新增了对可调用值的支持。

source: :class:`~django.db.models.ImageField` now has a default :data:`~django.core.validators.validate_image_file_extension` validator. (This validator moved to the form field in :doc:`Django 1.11.2 <1.11.2>`.)
id: :class:`~django.db.models.ImageField` sekarang mempunyai pengesah awalan :data:`~django.core.validators.validate_image_file_extension`. (Pengesah ini pindah dari bidang formulir dalam :doc:`Django 1.11.2 <1.11.2>`.)
zh_hans: :class:`~django.db.models.ImageField` 现在具有默认的 :data:`~django.core.validators.validate_image_file_extension` 验证器。（此验证器在 :doc:`Django 1.11.2 <1.11.2>` 中移至表单字段。）

source: Added support for time truncation to :class:`~django.db.models.functions.Trunc` functions.
id: Ditambahkan dukungan untuk pemotongan waktu pada fungsi-fungsi :class:`~django.db.models.functions.Trunc`.
zh_hans: :class:`~django.db.models.functions.Trunc` 函数现在支持时间截断。

source: Added the :class:`~django.db.models.functions.ExtractWeek` function to extract the week from :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField` and exposed it through the :lookup:`week` lookup.
id: Ditambahkan fungsi :class:`~django.db.models.functions.ExtractWeek`untuk mengambil minggu dari :class:`~django.db.models.DateField` dan :class:`~django.db.models.DateTimeField`dan dibuka melalui pencarian :lookup:`week`.
zh_hans: 新增了 :class:`~django.db.models.functions.ExtractWeek` 函数，用于从 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 中提取周，并通过 :lookup:`week` 查询公开。

source: Added the :class:`~django.db.models.functions.TruncTime` function to truncate :class:`~django.db.models.DateTimeField` to its time component and exposed it through the :lookup:`time` lookup.
id: Ditambahkan fungsi :class:`~django.db.models.functions.TruncTime` untuk memotong :class:`~django.db.models.DateTimeField`ke komponen waktunya dan dibuka melalui pencarian :lookup:`time`.
zh_hans: 新增了 :class:`~django.db.models.functions.TruncTime` 函数，用于将 :class:`~django.db.models.DateTimeField` 截断到其时间组件，并通过 :lookup:`time` 查询公开。

source: Added support for expressions in :meth:`.QuerySet.values` and :meth:`~.QuerySet.values_list`.
id: Ditambahkan dukungan untuk pernyataan dalam :meth:`.QuerySet.values` dan :meth:`~.QuerySet.values_list`.
zh_hans: 在 :meth:`.QuerySet.values` 和 :meth:`~.QuerySet.values_list` 中添加了对表达式的支持。

source: Added support for query expressions on lookups that take multiple arguments, such as ``range``.
id: Ditambahkan dukungan untuk pernyataan permintaan yang mengambil banyak argumen, seperti ``range``.
zh_hans: 对于接受多个参数的查询，如 ``range``，新增了对查询表达式的支持。

source: You can now use the ``unique=True`` option with :class:`~django.db.models.FileField`.
id: Anda dapat sekarang menggunakan pilihan ``unique=True`` dengan :class:`~django.db.models.FileField`.
zh_hans: 现在可以在 :class:`~django.db.models.FileField` 上使用 ``unique=True`` 选项。

source: Added the ``nulls_first`` and ``nulls_last`` parameters to :class:`Expression.asc() <django.db.models.Expression.asc>` and :meth:`~django.db.models.Expression.desc` to control the ordering of null values.
id: Ditambahkan parameter ``nulls_first`` dan ``nulls_last`` ke :class:`Expression.asc() <django.db.models.Expression.asc>` dan :meth:`~django.db.models.Expression.desc` untuk mengendalikan urutan dari nilai-nilai null.
zh_hans: 新增了 :class:`Expression.asc() <django.db.models.Expression.asc>` 和 :meth:`~django.db.models.Expression.desc` 的 ``nulls_first`` 和 ``nulls_last`` 参数，用于控制空值的排序顺序。

source: The new ``F`` expression ``bitleftshift()`` and ``bitrightshift()`` methods allow :ref:`bitwise shift operations <using-f-expressions-in-filters>`.
id: Pernyataan ``F`` baru metode ``bitleftshift()`` dan ``bitrightshift()`` mengizinkan :ref:`bitwise shift operations <using-f-expressions-in-filters>`.
zh_hans: 新的 ``F`` 表达式中的 ``bitleftshift()`` 和 ``bitrightshift()`` 方法允许进行 :ref:`位移位操作 <using-f-expressions-in-filters>`。

source: Added :meth:`.QuerySet.union`, :meth:`~.QuerySet.intersection`, and :meth:`~.QuerySet.difference`.
id: Ditambahkan :meth:`.QuerySet.union`, :meth:`~.QuerySet.intersection`, dan :meth:`~.QuerySet.difference`.
zh_hans: 新增了 :meth:`.QuerySet.union`、:meth:`~.QuerySet.intersection` 和 :meth:`~.QuerySet.difference` 方法。

source: Added :meth:`QueryDict.fromkeys() <django.http.QueryDict.fromkeys>`.
id: Ditambahkan :meth:`QueryDict.fromkeys() <django.http.QueryDict.fromkeys>`.
zh_hans: 新增了 :meth:`QueryDict.fromkeys() <django.http.QueryDict.fromkeys>` 方法。

source: :class:`~django.middleware.common.CommonMiddleware` now sets the ``Content-Length`` response header for non-streaming responses.
id: :class:`~django.middleware.common.CommonMiddleware` sekarang menyetel kepala tanggapan ``Content-Length``untuk tanggapan bukan-aliran.
zh_hans: :class:`~django.middleware.common.CommonMiddleware` 现在为非流式响应设置 ``Content-Length`` 响应头。

source: Added the :setting:`SECURE_HSTS_PRELOAD` setting to allow appending the ``preload`` directive to the ``Strict-Transport-Security`` header.
id: Ditambahkan pengaturan :setting:`SECURE_HSTS_PRELOAD` untuk mengizinkan menambahkan petunjuk ``preload`` ke kepala ``Strict-Transport-Security``.
zh_hans: 新增了 :setting:`SECURE_HSTS_PRELOAD` 设置，允许将 ``preload`` 指令附加到 ``Strict-Transport-Security`` 头部。

source: :class:`~django.middleware.http.ConditionalGetMiddleware` now adds the ``ETag`` header to responses.
id: :class:`~django.middleware.http.ConditionalGetMiddleware` sekarang menambahkan kepala ``ETag``pada tanggapan.
zh_hans: :class:`~django.middleware.http.ConditionalGetMiddleware` 现在将 ``ETag`` 头部添加到响应中。

source: The new ``django.core.serializers.base.Serializer.stream_class`` attribute allows subclasses to customize the default stream.
id: Atribut ``django.core.serializers.base.Serializer.stream_class`` baru mengizinkan subkelas untuk menyesuaiakan aliran awalan.
zh_hans: 新的 ``django.core.serializers.base.Serializer.stream_class`` 属性允许子类自定义默认流。

source: The encoder used by the :ref:`JSON serializer <serialization-formats-json>` can now be customized by passing a ``cls`` keyword argument to the ``serializers.serialize()`` function.
id: Penyandi digunakan oleh :ref:`JSON serializer 1` dapat disesuaikan dengan melewatkan argumen katakunci ``cls`` pada fungsi ``serializers.serialize()``.
zh_hans: 可以通过向 ``serializers.serialize()`` 函数传递一个 ``cls`` 关键字参数来自定义 :ref:`JSON 序列化器 <serialization-formats-json>` 使用的编码器。

source: :class:`~django.core.serializers.json.DjangoJSONEncoder` now serializes :class:`~datetime.timedelta` objects (used by :class:`~django.db.models.DurationField`).
id: :class:`~django.core.serializers.json.DjangoJSONEncoder` sekarang menserialkan obyek :class:`~datetime.timedelta` (digunakan oleh :class:`~django.db.models.DurationField`).
zh_hans: :class:`~django.core.serializers.json.DjangoJSONEncoder` 现在可以序列化 :class:`~datetime.timedelta` 对象（被 :class:`~django.db.models.DurationField` 使用）。

source: :meth:`~django.utils.safestring.mark_safe` can now be used as a decorator.
id: :meth:`~django.utils.safestring.mark_safe` sekarang dapat digunakan sebagai penghias.
zh_hans: 现在可以将 :meth:`~django.utils.safestring.mark_safe` 用作装饰器。

source: The :class:`~django.template.backends.jinja2.Jinja2` template backend now supports context processors by setting the ``'context_processors'`` option in :setting:`OPTIONS <TEMPLATES-OPTIONS>`.
id: Backend cetakan :class:`~django.template.backends.jinja2.Jinja2` sekarang mendukung pengolah konteks dengan mengatur pilihan ``'context_processors'`` dalam :setting:`OPTIONS 1`.
zh_hans: :class:`~django.template.backends.jinja2.Jinja2` 模板后端现在支持通过在 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 中设置 ``'context_processors'`` 选项来配置上下文处理器。

source: The :ttag:`regroup` tag now returns ``namedtuple``\s instead of dictionaries so you can unpack the group object directly in a loop, e.g. ``{% for grouper, list in regrouped %}``.
id: Etiket :ttag:`regroup` sekarang mengembalikan ``namedtuple`` daripada dictionay sehingga anda dapat mengeluarkan kelompok obyek langsung dalam putaran, sebagai contoh ``{% for grouper, list in regrouped %}``.
zh_hans: :ttag:`regroup` 标签现在返回 ``namedtuple`` 而不是字典，因此你可以在循环中直接解包组对象，例如 ``{% for grouper, list in regrouped %}``。

source: Added a :ttag:`resetcycle` template tag to allow resetting the sequence of the :ttag:`cycle` template tag.
id: Ditambahkan etiket cetakan :ttag:`resetcycle` untuk mengizinkan mengatur kembali urutan dari etiket cetakan :ttag:`cycle`.
zh_hans: 新增了 :ttag:`resetcycle` 模板标签，允许重置 :ttag:`cycle` 模板标签的序列。

source: You can now specify specific directories for a particular :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>`.
id: Anda sekarang dapat menentukan direktori khusus untuk :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>` tertentu.
zh_hans: 现在可以为特定的 :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>` 指定特定的目录。

source: Added :meth:`.DiscoverRunner.get_test_runner_kwargs` to allow customizing the keyword arguments passed to the test runner.
id: Ditambahkan :meth:`.DiscoverRunner.get_test_runner_kwargs` untuk mengizinkan penyesuaian argumen katakunci dilewatkan ke penjalan percobaan.
zh_hans: 新增了 :meth:`.DiscoverRunner.get_test_runner_kwargs` 方法，允许自定义传递给测试运行器的关键字参数。

source: Added the :option:`test --debug-mode` option to help troubleshoot test failures by setting the :setting:`DEBUG` setting to ``True``.
id: Ditambahkan pilihan :option:`test --debug-mode` untuk membantu memecahkan masalah kegagalan percobaan dengan mengatur pengaturan :setting:`DEBUG` menjadi ``True``.
zh_hans: 新增了 :option:`test --debug-mode` 选项，通过将 :setting:`DEBUG` 设置为 ``True`` 来帮助排查测试失败。

source: The new :func:`django.test.utils.setup_databases` (moved from ``django.test.runner``) and :func:`~django.test.utils.teardown_databases` functions make it easier to build custom test runners.
id: :func:`django.test.utils.setup_databases` baru (dipindah dari ``django.test.runner``) dan fungsi :func:`~django.test.utils.teardown_databases` membuatnya lebih mudah membangun pejalan percobaan penyesuaian.
zh_hans: 新的 :func:`django.test.utils.setup_databases` （从 ``django.test.runner`` 移动过来）和 :func:`~django.test.utils.teardown_databases` 函数使构建自定义测试运行器更加容易。

source: Added support for :meth:`python:unittest.TestCase.subTest`’s when using the :option:`test --parallel` option.
zh_hans: 在使用 :option:`test --parallel` 选项时，新增了对 :meth:`python:unittest.TestCase.subTest` 的支持。

source: ``DiscoverRunner`` now runs the system checks at the start of a test run. Override the :meth:`.DiscoverRunner.run_checks` method if you want to disable that.
id: ``DiscoverRunner`` sekarang menjalankan pemeriksaan sistem pada awal dari penjalanan percobaan. Timpa metode :meth:`.DiscoverRunner.run_checks` jika anda ingin meniadakan itu.
zh_hans: ``DiscoverRunner`` 现在在测试运行开始时运行系统检查。如果要禁用此功能，请覆盖 :meth:`.DiscoverRunner.run_checks` 方法。

source: Added :class:`~django.core.validators.FileExtensionValidator` to validate file extensions and :data:`~django.core.validators.validate_image_file_extension` to validate image files.
id: Ditambahkan :class:`~django.core.validators.FileExtensionValidator`untuk mensahkan berkas tambahan dan :data:`~django.core.validators.validate_image_file_extension` untuk mensahkan berkas-berkas gambar.
zh_hans: 新增了 :class:`~django.core.validators.FileExtensionValidator` 以验证文件扩展名，以及 :data:`~django.core.validators.validate_image_file_extension` 以验证图像文件。

source: Backwards incompatible changes in 1.11
id: Perubahan ketidaksesuaian kebelakang dalam 1.11
zh_hans: 1.11 中的向后不兼容更改

source: To simplify the codebase and because it's easier to install than when ``contrib.gis`` was first released, :ref:`gdalbuild` is now a required dependency for GeoDjango. In older versions, it's only required for SQLite.
id: Untuk memudahkan basiskode dan karena itu lebih mudah memasang daripada ketika ``contrib.gis`` terbitan pertama, :ref:`gdalbuild` sekarang membutuhkan ketergantungan untuk GeoDjango. Dalam versi terlama, itu hanya dibutuhkan untuk SQLite.
zh_hans: 为了简化代码库并且因为现在安装起来更容易（相对于最初发布 ``contrib.gis`` 时的情况），现在在 GeoDjango 中需要 :ref:`gdalbuild` 作为依赖。在旧版本中，它只对 SQLite 有要求。

source: ``contrib.gis.maps`` is removed as it interfaces with a retired version of the Google Maps API and seems to be unmaintained. If you're using it, :ticket:`let us know <14284>`.
zh_hans: ``contrib.gis.maps`` 已被移除，因为它与已退役的 Google Maps API 版本进行交互，似乎没有维护。如果您正在使用它，请 :ticket:`告诉我们 <14284>`。

source: The ``GEOSGeometry`` equality operator now also compares SRID.
id: Penghubung persamaan ``GEOSGeometry`` sekarang juga membandingkan SRID.
zh_hans: ``GEOSGeometry`` 的等号运算符现在也会比较 SRID。

source: The OpenLayers-based form widgets now use OpenLayers 3, and the ``gis/openlayers.html`` and ``gis/openlayers-osm.html`` templates have been updated. Check your project if you subclass these widgets or extend the templates. Also, the new widgets work a bit differently than the old ones. Instead of using a toolbar in the widget, you click to draw, click and drag to move the map, and click and drag a point/vertex/corner to move it.
id: Widget formulir berdasarkan-OpenLayer sekarang menggunakan OpenLayer 3, dan cetakan ``gis/openlayers.html`` dan ``gis/openlayers-osm.html``telah diperbaharui. Periksa proyek anda jika anda mensubkelaskan widget-widget ini atau memperpanjang cetakan. Juga, widget baru bekerja sedikit berbeda daripada satu yang lama. Daripada menggunakan sebuah alat batang dalam widget, anda klik untuk menggambar, klik dan seret untuk memindahkan peta, dan klik dan seret titik, vertex/sudut untuk memindahkan itu.
zh_hans: 基于 OpenLayers 的表单小部件现在使用 OpenLayers 3，同时更新了 ``gis/openlayers.html`` 和 ``gis/openlayers-osm.html`` 模板。如果您对这些小部件进行子类化或扩展模板，请检查您的项目。此外，新的小部件与旧的小部件有一些不同。不再使用小部件中的工具栏，而是点击以绘制，点击并拖动以移动地图，以及点击并拖动一个点/顶点/角来移动它。

source: Support for SpatiaLite < 4.0 is dropped.
id: Dukungan untuk SpatiaLite < 4.0 telah dibuang.
zh_hans: 不再支持 SpatiaLite < 4.0 。

source: Support for GDAL 1.7 and 1.8 is dropped.
id: Dukungan untuk GDAL 1.7 dan 1.8 telah dibuang.
zh_hans: 不再支持 GDAL 1.7 和 1.8 。
