Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Previous versions of Django generated cache keys using a request's path and query string but not the scheme or host. If a Django application was serving multiple subdomains or domains, cache keys could collide. In Django 1.7, cache keys vary by the absolute URL of the request including scheme, host, path, and query string. For example, the URL portion of a cache key is now generated from ``https://www.example.com/path/to/?key=val`` rather than ``/path/to/?key=val``. The cache keys generated by Django 1.7 will be different from the keys generated by older versions of Django. After upgrading to Django 1.7, the first request to any previously cached URL will be a cache miss.
id: Versi sebelumnya dari Django membangkitkan kunci tembolok menggunakan jalur permintaan dan permintaan deretan karakter tetapi bukan skema atau penyimpanan. Jika sebuah aplikasi Django telah melayani banyak subranah atau ranah, kunci tembolok dapat bertabrakan. Di Django 1.7, kunci tembolok beragam berdasarkan URL mutlak dari permintaan termasuk skema, penyimpanan, jalur, dan permintaan deretan karakter. Sebagai contoh, bagian URL dari kunci tembolok sekarang dibangkitkan dari ``https://www.example.com/path/to/?key=val`` daripada ``/path/to/?key=val``.Kunci tembolok dibangkitkan oleh Django 1.7 akan menjadi berbeda dari kunci dibangkitkan oleh versi terlama dari Django. Setelah meningkatkan ke Django 1.7, permintaan pertama pada setiap URL disembunyikan sebelumnya akan lolos menyimpan.
zh_hans: 在以前的 Django 版本中，缓存键是使用请求的路径和查询字符串生成的，但不包括 scheme 和 host。如果一个 Django 应用程序服务多个子域或域名，缓存键可能会发生冲突。在 Django 1.7 中，缓存键会根据请求的绝对 URL 包括 scheme、host、path 和查询字符串而变化。例如，缓存键的 URL 部分现在是从 ``https://www.example.com/path/to/?key=val`` 生成的，而不是 ``/path/to/?key=val``。Django 1.7 生成的缓存键将与旧版本的 Django 生成的键不同。升级到 Django 1.7 后，对任何以前缓存的 URL 的第一个请求将导致缓存未命中。

source: Passing ``None`` to ``Manager.db_manager()``
id: Melewati ``None`` ke ``Manager.db_manager()``
zh_hans: 将 ``None`` 传递给 ``Manager.db_manager()``

source: In previous versions of Django, it was possible to use ``db_manager(using=None)`` on a model manager instance to obtain a manager instance using default routing behavior, overriding any manually specified database routing. In Django 1.7, a value of ``None`` passed to db_manager will produce a router that *retains* any manually assigned database routing -- the manager will *not* be reset. This was necessary to resolve an inconsistency in the way routing information cascaded over joins. See :ticket:`13724` for more details.
id: Di versi sebelumnya dari Django, itu memungkinkan menggunakan ``db_manager(using=None)`` di sebuah instance pengelola model untuk mengambil sebuah instance pengelola menggunakan perilaku rute awalan, menimpa setiap secara manual ditentukan rute basisdata. Di Djang0 1.7, sebuah nilai dari ``None`` dilewatkan ke db_manager akan menghasilkan sebuah perute yang *mempertahankan* setiap secara manual diberikan rute basisdata -- pengelola *tidak* akan disetel kembali. Ini diperlukan untuk menyelesaikan ketidakmantapan dalam cara merute aliran informasi terhadap join. Lihat :ticket:`13724` untuk lebih rinci.
zh_hans: 在以前的 Django 版本中，可以在模型管理器实例上使用 ``db_manager(using=None)`` 来获取一个使用默认路由行为的管理器实例，覆盖任何手动指定的数据库路由。在 Django 1.7 中，传递给 db_manager 的值为 ``None`` 将产生一个保留任何手动分配的数据库路由的路由器 -- 管理器将 *不* 被重置。这是为了解决路由信息在连接中级联的方式存在的不一致性。详情请参阅 :ticket:`13724`。

source: ``pytz`` may be required
zh_hans: 可能需要使用 ``pytz``

source: If your project handles datetimes before 1970 or after 2037 and Django raises a :exc:`ValueError` when encountering them, you will have to install :pypi:`pytz`. You may be affected by this problem if you use Django's time zone-related date formats or :mod:`django.contrib.syndication`.
zh_hans: 如果你的项目处理 1970 年之前或 2037 年之后的日期时间，并且当 Django 遇到它们时引发 :exc:`ValueError`，那么你将需要安装 :pypi:`pytz`。如果你使用了 Django 的时区相关的日期格式或 :mod:`django.contrib.syndication`，可能会受到这个问题的影响。

source: ``remove()`` and ``clear()`` methods of related managers
id: Metode ``remove()`` dan ``clear()`` dari pengelola terkait
zh_hans: 关于相关管理器的 ``remove()`` 和 ``clear()`` 方法

source: The ``remove()`` and ``clear()`` methods of the related managers created by ``ForeignKey``, ``GenericForeignKey``, and ``ManyToManyField`` suffered from a number of issues. Some operations ran multiple data modifying queries without wrapping them in a transaction, and some operations didn't respect default filtering when it was present (i.e. when the default manager on the related model implemented a custom ``get_queryset()``).
id: Metode ``remove()`` dan ``clear()`` dari pengelola terkait dibuat oleh ``ForeignKey``, ``GenericForeignKey``, and ``ManyToManyField`` menderita dari sejumlah masalah. Beberapa tindakan berjalan banyak data merubah permintaan tanpa membungkus mereka di sebuah transaksi, dan beberapa tindakan tidak menanggapi penyaringan awalan ketika itu dicegah (yaitu ketika pengelola awalan di model terkait menerapkan sebuah penyesuaian ``get_queryset()``).
zh_hans: ``ForeignKey``、``GenericForeignKey`` 和 ``ManyToManyField`` 创建的相关管理器的 ``remove()`` 和 ``clear()`` 方法存在一些问题。一些操作在没有包装在事务中的情况下运行多个数据修改查询，而一些操作在存在默认过滤条件时（即当相关模型上的默认管理器实现了自定义的 ``get_queryset()`` 时）不会尊重默认过滤条件。

source: Fixing the issues introduced some backward incompatible changes:
id: Memperbaiki beberapa masalah memperkenalkan beberapa perubahan tidakkesuaian kebelakang:
zh_hans: 修复这些问题引入了一些向后不兼容的更改：

source: The default implementation of ``remove()`` for ``ForeignKey`` related managers changed from a series of ``Model.save()`` calls to a single ``QuerySet.update()`` call. The change means that ``pre_save`` and ``post_save`` signals aren't sent anymore. You can use the ``bulk=False`` keyword argument to revert to the previous behavior.
id: Penerapan awalan dari ``remove()`` untuk pengelola terkait ``ForeignKey`` berubah dari rangkaian panggilan ``Model.save()`` ke panggilan ``QuerySet.update()`` tunggal. Perubahan berarti bahwa sinyal ``pre_save`` dan ``post_save`` tidak dikirim lagi. Anda dapat menggunakan argumen kata kunci ``bulk=False`` untuk kembali ke perilaku sebelumnya.
zh_hans: ``ForeignKey`` 相关管理器的默认 ``remove()`` 实现从一系列的 ``Model.save()`` 调用更改为单个 ``QuerySet.update()`` 调用。这个改变意味着不再发送 ``pre_save`` 和 ``post_save`` 信号。你可以使用 ``bulk=False`` 关键字参数来恢复到以前的行为。

source: The ``remove()`` and ``clear()`` methods for ``GenericForeignKey`` related managers now perform bulk delete. The ``Model.delete()`` method isn't called on each instance anymore. You can use the ``bulk=False`` keyword argument to revert to the previous behavior.
id: Metode ``remove()`` dan ``clear()`` untuk pengelola terkait ``GenericForeignKey`` sekarang melakukan penghapusan dalam jumlah besar. Metode ``Model.delete()`` tidak dipanggil di setiap instance lagi. Anda dapat menggunakan argumen kata kunci ``bulk=False`` untuk kembali ke perilaku sebelumnya.
zh_hans: ``GenericForeignKey`` 相关管理器的 ``remove()`` 和 ``clear()`` 方法现在执行批量删除。不再在每个实例上调用 ``Model.delete()`` 方法。你可以使用 ``bulk=False`` 关键字参数来恢复到以前的行为。

source: The ``remove()`` and ``clear()`` methods for ``ManyToManyField`` related managers perform nested queries when filtering is involved, which may or may not be an issue depending on your database and your data itself. See :ref:`this note <nested-queries-performance>` for more details.
id: Metode ``remove()`` dan ``clear()`` untuk pengelola terkait ``ManyToManyField`` melakukan permintaan ketika penyaringan dilibatkan, yang mungkin atau tidak menjadi sebuah masalah tergantung pada basisdata anda dan data anda itu sendiri. Lihat :ref:`this note <nested-queries-performance>` untuk rincian lebih.
zh_hans: 与 ``ManyToManyField`` 相关的管理器的 ``remove()`` 和 ``clear()`` 方法在涉及到过滤时执行嵌套查询，这可能会根据你的数据库和数据本身是否成问题而有所不同。有关更多详情，请参阅 :ref:`此说明 <nested-queries-performance>`。

source: Admin login redirection strategy
id: Siasat pengalihan masuk admin
zh_hans: 管理员登录重定向策略

source: Historically, the Django admin site passed the request from an unauthorized or unauthenticated user directly to the login view, without HTTP redirection. In Django 1.7, this behavior changed to conform to a more traditional workflow where any unauthorized request to an admin page will be redirected (by HTTP status code 302) to the login page, with the ``next`` parameter set to the referring path. The user will be redirected there after a successful login.
id: Secara riwayat, situs admin Django melewatkan permintaan dari sebuah pengguna tidak terotorisasi dan tidak terautentifikasi secara langsun gke tampilan masuk, tanpa pengalihan HTTP. Di Django 1.7, perilaku ini berukan untuk memenuhi lebih alur kerja tradisional dimana permintaan tidak terotorisasi pada halaman admin akan diarahkan (dengan kode keadaan HTTP 302) ke halaman masuk, dengan parameter ``next`` disetel ke jalur yang diacukan. Pengguna akan dialihkan disana setelah berhasil masuk.
zh_hans: 在历史上，Django 管理站点会将未经授权或未经身份验证的用户的请求直接传递给登录视图，而不进行 HTTP 重定向。在 Django 1.7 中，这种行为发生了变化，以符合更传统的工作流程，其中任何未经授权的请求到管理页面都会被重定向（通过 HTTP 状态码 302）到登录页面，其中 ``next`` 参数设置为引用的路径。用户在成功登录后将被重定向到那里。

source: Note also that the admin login form has been updated to not contain the ``this_is_the_login_form`` field (now unused) and the ``ValidationError`` code has been set to the more regular ``invalid_login`` key.
id: Catat juga bahwa formulir masuk admin telah diperbaharui untuk tidak mengandung bidang ``this_is_the_login_form`` (sekarang tidak berguna) dan kode ``ValidationError`` telah dikirim ke lebih biasa kunci ``invalid_login``
zh_hans: 还请注意，管理员登录表单已更新，不再包含无用的 ``this_is_the_login_form`` 字段，而且 ``ValidationError`` 代码已设置为更常规的 ``invalid_login`` 键。

source: This change was made because such errors can be caused by including an app which expects global transactions (e.g. :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` set to ``True``), or Django's old autocommit behavior, in a project which runs without them; and further, such errors may manifest as data-corruption bugs. It was also made in Django 1.6.3.
id: Perubahan ini telah dibuat karena kesalahan itu dapat disebabkan oleh menyertakan sebuah aplikasi yang mengharapkan transaksi global (sebagai contoh :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` disetel menjadi ``True``), atau perilaku perbaikan otomatis lama Django, di sebuah proyek yang berjalan tanpa mereka; dan lebih lanjut, kesalahan itu mungkin wujud sebagai kesalahan kerusakan-data. Itu juga telah dibuat di Django 1.6.3.
zh_hans: 这个更改是因为这样的错误可能是由包含一个期望全局事务的应用程序（例如：:setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` 设置为 ``True``）或者 Django 的旧的自动提交行为，在一个不需要它们的项目中运行时引起的；而且，这样的错误可能会表现为数据损坏的问题。这个更改也是在 Django 1.6.3 中进行的。

source: Contrib middleware removed from default ``MIDDLEWARE_CLASSES``
id: Sumbangan middleware dipindahkan dari ``MIDDLEWARE_CLASSES`` awalan
zh_hans: Contrib 中间件从默认的 ``MIDDLEWARE_CLASSES`` 中移除

source: The :ref:`app-loading refactor <app-loading-refactor-17-release-note>` deprecated using models from apps which are not part of the :setting:`INSTALLED_APPS` setting. This exposed an incompatibility between the default :setting:`INSTALLED_APPS` and ``MIDDLEWARE_CLASSES`` in the global defaults (``django.conf.global_settings``). To bring these settings in sync and prevent deprecation warnings when doing things like testing reusable apps with minimal settings, :class:`~django.contrib.sessions.middleware.SessionMiddleware`, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware`, and :class:`~django.contrib.messages.middleware.MessageMiddleware` were removed from the defaults. These classes will still be included in the default settings generated by :djadmin:`startproject`. Most projects will not be affected by this change but if you were not previously declaring the ``MIDDLEWARE_CLASSES`` in your project settings and relying on the global default you should ensure that the new defaults are in line with your project's needs. You should also check for any code that accesses ``django.conf.global_settings.MIDDLEWARE_CLASSES`` directly.
id: :ref:`app-loading refactor ` diusangkan menggunakan model dari aplikasi yang bukan bagian dari pengaturan :setting:`INSTALLED_APPS`. Ini menunjukkan sebuah ketidaksesuaian diantara :setting:`INSTALLED_APPS` awalan dan ``MIDDLEWARE_CLASSES`` awalan keseluruhan (``django.conf.global_settings``). Untuk membawa pengaturan ini dalam sinkronisasi dan mencegah peringatan pengusangan ketika melakukan hal-hal seperti menguji aplikasi digunakan kembali dengan pengaturan minimal, :class:`~django.contrib.sessions.middleware.SessionMiddleware`, :class:`~django.contrib.auth.middleware.AuthenticationMiddleware`, dan :class:`~django.contrib.messages.middleware.MessageMiddleware`dipindahkan dari awalan. Kelas-kelas ini masih disertakan dalam pengaturan awalan dibangkitkan oleh :djadmin:`startproject`. Kebanyakan proyek tidak akan terpegnaruh oleh perubahan ini tetapi jika anda tidak sebelumnya mnyatakan ``MIDDLEWARE_CLASSES`` dalam pengaturan proyek anda dan bergantung pada awalan keseluruhan anda harus memastikan bawah awalan baru sejalan dengan kebutuhan proyek anda. Anda harus juga memeriksa untuk setiap kode yang mengakses ``django.conf.global_settings.MIDDLEWARE_CLASSES``langsung.
zh_hans: :ref:`应用加载重构 <app-loading-refactor-17-release-note>` 弃用了使用不在 :setting:`INSTALLED_APPS` 设置中的应用程序中的模型。这暴露出默认的 :setting:`INSTALLED_APPS` 和全局默认值（``django.conf.global_settings``）中的 ``MIDDLEWARE_CLASSES`` 之间的不兼容性。为了使这些设置保持同步，并且在使用最小设置测试可重用应用程序等情况下防止弃用警告，从默认设置中移除了 :class:`~django.contrib.sessions.middleware.SessionMiddleware`、:class:`~django.contrib.auth.middleware.AuthenticationMiddleware` 和 :class:`~django.contrib.messages.middleware.MessageMiddleware`。这些类仍然会包含在由 :djadmin:`startproject` 生成的默认设置中。大多数项目不会受到这个更改的影响，但如果你之前没有在项目设置中声明 ``MIDDLEWARE_CLASSES`` 并依赖于全局默认值，你应该确保新的默认值符合你的项目需求。你还应该检查任何访问 ``django.conf.global_settings.MIDDLEWARE_CLASSES`` 的代码。

source: The :meth:`django.core.files.uploadhandler.FileUploadHandler.new_file()` method is now passed an additional ``content_type_extra`` parameter. If you have a custom :class:`~django.core.files.uploadhandler.FileUploadHandler` that implements ``new_file()``, be sure it accepts this new parameter.
id: Metode :meth:`django.core.files.uploadhandler.FileUploadHandler.new_file()` sekarang melewatkan sebuah parameter ``content_type_extra`` tambahan. Jika anda mempunyai penyesuaian :class:`~django.core.files.uploadhandler.FileUploadHandler` yang menerapkan ``new_file()``, pastikan itu menerima parameter baru ini.
zh_hans: :meth:`django.core.files.uploadhandler.FileUploadHandler.new_file()` 方法现在传递了一个额外的 ``content_type_extra`` 参数。如果你有一个自定义的 :class:`~django.core.files.uploadhandler.FileUploadHandler`，实现了 ``new_file()`` 方法，请确保它接受这个新参数。

source: :class:`ModelFormSet<django.forms.models.BaseModelFormSet>`\s no longer delete instances when ``save(commit=False)`` is called. See :attr:`~django.forms.formsets.BaseFormSet.can_delete` for instructions on how to manually delete objects from deleted forms.
id: :class:`ModelFormSet<django.forms.models.BaseModelFormSet>` tidak lagi menghapus instance ketika ``save(commit=False)`` dipanggil. Lihat :attr:`~django.forms.formsets.BaseFormSet.can_delete` untuk petunjuk pada bagaimana secara manual menghapus obyek dari formulir dihapus.
zh_hans: :class:`ModelFormSet<django.forms.models.BaseModelFormSet>` 在调用 ``save(commit=False)`` 时不再删除实例。请查看 :attr:`~django.forms.formsets.BaseFormSet.can_delete` 以获取如何手动从删除的表单中删除对象的说明。

source: Loading empty fixtures emits a ``RuntimeWarning`` rather than raising :exc:`~django.core.management.CommandError`.
id: Memuat alat bantu kosong memancarkan ``RuntimeWarning`` dari pada memunculkan :exc:`~django.core.management.CommandError`.
zh_hans: 加载空的 fixture 现在会发出一个 ``RuntimeWarning``，而不是引发 :exc:`~django.core.management.CommandError`。

source: :func:`django.contrib.staticfiles.views.serve` will now raise an :exc:`~django.http.Http404` exception instead of :exc:`~django.core.exceptions.ImproperlyConfigured` when :setting:`DEBUG` is ``False``. This change removes the need to conditionally add the view to your root URLconf, which in turn makes it safe to reverse by name. It also removes the ability for visitors to generate spurious HTTP 500 errors by requesting static files that don't exist or haven't been collected yet.
id: :func:`django.contrib.staticfiles.views.serve` akan sekarang memunculkan sebuah pengecualian :exc:`~django.http.Http404` daripada :exc:`~django.core.exceptions.ImproperlyConfigured` ketika :setting:`DEBUG` adalah ``False``. Perubahan ini memindahkan kebutuhkan untuk kondisional menambah tampilan ke akar URLconf anda, yang pada gilirannya membuat itu aman untuk membalikkan berdasarkan nama. Itu juga memindahkan kemampuan pengunjung untuk membangkitkan kesalahan HTTP 500 palsu dengan meminta berkas tetap yang tidak ada atau belum dikumpulkan.
zh_hans: 当 :setting:`DEBUG` 为 ``False`` 时，:func:`django.contrib.staticfiles.views.serve` 现在会引发一个 :exc:`~django.http.Http404` 异常，而不是 :exc:`~django.core.exceptions.ImproperlyConfigured`。这个更改消除了将视图有条件地添加到根 URLconf 的需要，从而使其能够通过名称安全地反转。它还消除了访问者通过请求不存在或尚未收集的静态文件而生成虚假的 HTTP 500 错误的能力。

source: The :meth:`django.db.models.Model.__eq__` method is now defined in a way where instances of a proxy model and its base model are considered equal when primary keys match. Previously only instances of exact same class were considered equal on primary key match.
id: Metode :meth:`django.db.models.Model.__eq__` sekarang ditentukan dengan cara dimana instance dari model proxy dan model dasarnya dianggap setara ketika primary key cocok. Sebelumnya hanya instance dari kelas sama yang tepat dianggap setara di primary key cocok.
zh_hans: :meth:`django.db.models.Model.__eq__` 方法现在以一种新的方式定义，其中代理模型的实例和其基模型的实例在主键匹配时被视为相等。以前，只有完全相同类的实例在主键匹配时被视为相等。

source: The :meth:`django.db.models.Model.__eq__` method has changed such that two ``Model`` instances without primary key values won't be considered equal (unless they are the same instance).
id: Metode :meth:`django.db.models.Model.__eq__` telah berubah seperti instance ``Model`` dua itu tanpa nilai primar key tidak akan dianggap setara (meskipun mereka adalah instance sama).
zh_hans: :meth:`django.db.models.Model.__eq__` 方法已更改，因此两个没有主键值的 ``Model`` 实例不会被视为相等（除非它们是同一个实例）。

source: The :meth:`django.db.models.Model.__hash__` method will now raise ``TypeError`` when called on an instance without a primary key value. This is done to avoid mutable ``__hash__`` values in containers.
id: Metode :meth:`django.db.models.Model.__hash__` sekarang akan menampilkan ``TypeError`` ketika dipanggil pada sebuah instance tanpa nilai primary key. Ini dilakukan untuk menghindari nilai ``__hash__`` mungkin berubah dalam penampungan.
zh_hans: 当在没有主键值的实例上调用 :meth:`django.db.models.Model.__hash__` 方法时，现在会引发 ``TypeError``。这是为了避免在容器中使用可变的 ``__hash__`` 值。

source: :class:`~django.db.models.AutoField` columns in SQLite databases will now be created using the ``AUTOINCREMENT`` option, which guarantees monotonic increments. This will cause primary key numbering behavior to change on SQLite, becoming consistent with most other SQL databases. This will only apply to newly created tables. If you have a database created with an older version of Django, you will need to migrate it to take advantage of this feature. For example, you could do the following:
id: Kolom :class:`~django.db.models.AutoField` di basisdata SQLite akan sekarang dibuat selama pilihan ``AUTOINCREMENT``, yang menjamin penaikan monoton. Ini akan menyebabkan perilaku penomoran primary key berubah di SQLite, menjadi mantap selaras dengan kebanykan basisdata SQL lain. Ini akan hanya berlaku pada tabel yang dibuat baru. Jika anda mempunyai sebuah basisdata dibuat dengan versi terlama dari Django, anda akan butuh memindahkann itu untuk mengambil keuntungan dari fitur ini. Sebagai contoh, anda dapat melakukan berikut:
zh_hans: 在 SQLite 数据库中，:class:`~django.db.models.AutoField` 列现在将使用 ``AUTOINCREMENT`` 选项创建，以确保单调递增。这将导致 SQLite 上的主键编号行为发生变化，与大多数其他 SQL 数据库保持一致。这仅适用于新创建的表。如果你有一个使用较早版本的 Django 创建的数据库，你需要迁移它以利用这个功能。例如，你可以执行以下操作：

source: Use :djadmin:`dumpdata` to save your data.
id: Gunakan :djadmin:`dumpdata` untuk menyimpan data anda.
zh_hans: 使用 :djadmin:`dumpdata` 来保存你的数据。

source: Rename the existing database file (keep it as a backup).
id: Namai kembali berkas basisdata yang ada (biarkan sebagai sokongan).
zh_hans: 重命名现有的数据库文件（将其保留作为备份）。

source: Run :djadmin:`migrate` to create the updated schema.
id: Jalankan :djadmin:`migrate` untuk membuat skema terperbaharui.
zh_hans: 运行 :djadmin:`migrate` 来创建更新后的模式。

source: Use :djadmin:`loaddata` to import the fixtures you exported in (1).
id: Gunakan :djadmin:`loaddata` untuk mengimpor perlengkapan anda ekspor dalam (1).
zh_hans: 使用 :djadmin:`loaddata` 导入你在第一步导出的 fixture 数据。

source: ``django.contrib.auth.models.AbstractUser`` no longer defines a :meth:`~django.db.models.Model.get_absolute_url()` method. The old definition returned ``"/users/%s/" % urlquote(self.username)`` which was arbitrary since applications may or may not define such a url in ``urlpatterns``. Define a ``get_absolute_url()`` method on your own custom user object or use :setting:`ABSOLUTE_URL_OVERRIDES` if you want a URL for your user.
id: ``django.contrib.auth.models.AbstractUser`` tidak lagi menentukan sebuah metode :meth:`~django.db.models.Model.get_absolute_url()`. Definisi lama mengembalikan ``"/users/%s/" % urlquote(self.username)`` yang sebelumnya berubah-rubah sejak aplikasi mungkin atau mungkin tidak ditentukan seperti url di ``urlpatterns``. Tentukan sebuah metode ``get_absolute_url()`` pada obyek pengguna penyesuaian anda sendiri atau menggunakan :setting:`ABSOLUTE_URL_OVERRIDES` jika anda ingin URL untuk pengguna anda.
zh_hans: ``django.contrib.auth.models.AbstractUser`` 不再定义 :meth:`~django.db.models.Model.get_absolute_url()` 方法。旧的定义返回 ``"/users/%s/" % urlquote(self.username)``，这是任意的，因为应用程序可以或不可以在 ``urlpatterns`` 中定义这样的 URL。在你自己的自定义用户对象上定义一个 ``get_absolute_url()`` 方法，或者如果你想要一个用户的 URL，可以使用 :setting:`ABSOLUTE_URL_OVERRIDES`。

source: The static asset-serving functionality of the :class:`django.test.LiveServerTestCase` class has been simplified: Now it's only able to serve content already present in :setting:`STATIC_ROOT` when tests are run. The ability to transparently serve all the static assets (similarly to what one gets with :setting:`DEBUG = True <DEBUG>` at development-time) has been moved to a new class that lives in the ``staticfiles`` application (the one actually in charge of such feature): :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`. In other words, ``LiveServerTestCase`` itself is less powerful but at the same time has less magic.
id: Kegunaan melayani-aset tetap dari kelas :class:`django.test.LiveServerTestCase` telah disederhanakan: Sekarang itu hanya dapat melayani isi sudah hadir di :setting:`STATIC_ROOT` ketika percobaan berjalan. Kemampuan untuk secara transparan melayani semua aset tetap (mirip pada apa satu dapatkan dengan :setting:`DEBUG = True <DEBUG>` pada waktu-pengembangan) telah dipindahkan ke kelas baru yang tinggal di aplikasi ``staticfiles`` (satu yang sebenarnya bertanggung jawab dari fitur seperti itu): :class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`. Dengan kata lain, ``LiveServerTestCase`` itu sendiri kurang kuat tetapi pada saat bersamaan mempunyai sedikit keajaiban.
zh_hans: :class:`django.test.LiveServerTestCase` 类的静态资源服务功能已经简化：现在它只能在运行测试时服务于已经存在于 :setting:`STATIC_ROOT` 中的内容。像在开发时使用 :setting:`DEBUG = True <DEBUG>` 那样透明地提供所有静态资源的能力已经移动到一个新的类中，该类位于 ``staticfiles`` 应用程序中（实际负责此功能的应用程序）：:class:`django.contrib.staticfiles.testing.StaticLiveServerTestCase`。换句话说，``LiveServerTestCase`` 本身的功能减弱了，但同时也减少了魔法。

source: Rationale behind this is removal of dependency of non-contrib code on contrib applications.
id: Alasan dibelakang perpindahan ini adalah ketergantungan dari kdoe bukan-bantuan di aplikasi bantuan.
zh_hans: 这样做的原因是将非 contrib 代码与 contrib 应用程序的依赖关系移除。
