Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Code taking advantage of any of the features below will raise a ``PendingDeprecationWarning`` in Django 1.3. This warning will be silent by default, but may be turned on using Python's :mod:`warnings` module, or by running Python with a ``-Wd`` or ``-Wall`` flag.
id: Kode mengambil keuntungan dari tiap fitur dibawah ini akan memunculkan sebuah ``PendingDeprecationWarning`` di Django 1.3. Peringatan ini akan diam secara awalan, tetapi mungkin berubah menggunakan modul :mod:`warnings` Python, atau dengan menjalankan Python dengan sebuah bendera ``-Wd`` atau ``-Wall``.
zh_hans: 使用以下任何特性的代码将在 Django 1.3 中引发 ``PendingDeprecationWarning``。默认情况下，此警告是静默的，但可以使用 Python 的 :mod:`warnings` 模块打开，或者通过在运行 Python 时使用 ``-Wd`` 或 ``-Wall`` 标志来打开。

source: In Django 1.4, these warnings will become a ``DeprecationWarning``, which is *not* silent. In Django 1.5 support for these features will be removed entirely.
id: Di Django 1.4, peringatan ini akan menjadi ``DeprecationWarning``, yang *tidak* diam. Di Django 1.5 mendukung untuk fitur-fitur ini akan dipindahkan sepenuhnya.
zh_hans: 在 Django 1.4 中，这些警告将变成 ``DeprecationWarning``，它是 *不* 静默的。在 Django 1.5 中，将完全删除对这些特性的支持。

source: For more details, see the documentation :doc:`Django's release process </internals/release-process>` and our :doc:`deprecation timeline </internals/deprecation>`.
id: Untuk rincian lebih, lihat dokumentasi :doc:`Django's release process </internals/release-process>` dan :doc:`deprecation timeline </internals/deprecation>` kami.
zh_hans: 有关更多详细信息，请参阅文档 :doc:`Django 的发布流程 </internals/release-process>` 和我们的 :doc:`弃用时间表 </internals/deprecation>`。

source: ``mod_python`` support
id: dukungan ``mod_python``
zh_hans: ``mod_python`` 支持

source: The ``mod_python`` library has not had a release since 2007 or a commit since 2008. The Apache Foundation board voted to remove ``mod_python`` from the set of active projects in its version control repositories, and its lead developer has shifted all of his efforts toward the lighter, slimmer, more stable, and more flexible ``mod_wsgi`` backend.
id: Pustaka ``mod_python`` belum mempunyai terbitan sejak 2007 atau perbaikan sejak 2008. Badan Apache Foundation memilih untuk memindahkan ``mod_python`` dari kumpulan dari proyek aktif di gudang kendali versinya, dan pimpinan pengembangnya telah mengganti semua usahanya menuju lebih ringan, ramping, lebih stabil, dan lebih fleksibel backend ``mod_wsgi``.
zh_hans: ``mod_python`` 库自 2007 年以来没有发布过新版本，自 2008 年以来也没有提交。Apache 基金会董事会投票决定将 ``mod_python`` 从其版本控制存储库的活动项目集中删除，其主要开发人员已将所有工作重心转向了更轻巧、更稳定、更灵活的 ``mod_wsgi`` 后端。

source: If you are currently using the ``mod_python`` request handler, you should redeploy your Django projects using another request handler. :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>` is the request handler recommended by the Django project, but FastCGI is also supported. Support for ``mod_python`` deployment will be removed in Django 1.5.
id: Jika anda saat ini menggunakan penangan permintaan ``mod_python``, anda harus menyebarkan kembali proyek Django anda menggunakan penangan permintaan lain. :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>` adalah penangan permintaan dianjurkan oleh proyek Django, tetapi FastCGI juga didukung. Dukungan untuk penyebaran ``mod_python`` akan dipindahkan di Django 1.5.
zh_hans: 如果您当前使用的是 ``mod_python`` 请求处理程序，您应该重新部署您的 Django 项目，使用其他请求处理程序。Django 项目推荐使用的请求处理程序是 :doc:`mod_wsgi </howto/deployment/wsgi/modwsgi>`，但也支持 FastCGI。对于 ``mod_python`` 部署的支持将在 Django 1.5 中被移除。

source: Function-based generic views
id: Tampilan umum berdasarkan-fungsi
zh_hans: 基于函数的通用视图

source: As a result of the introduction of class-based generic views, the function-based generic views provided by Django have been deprecated. The following modules and the views they contain have been deprecated:
id: Sebagai hasil dari perkenalan dari tampilan umum berdasarkan-kelas, tampilan umum berdasarkan fungsi disediakan oleh Django telah diusangkan. Modul-modul berikut dan tampilan mereka kandung telah diusangkan:
zh_hans: 由于引入了基于类的通用视图，Django 提供的基于函数的通用视图已被弃用。以下模块及其包含的视图已被弃用：

source: Test client response ``template`` attribute
id: Percobaan klien tanggapan atribut ``template``
zh_hans: 测试客户端响应的 ``template`` 属性

source: Django's :ref:`test client <test-client>` returns :class:`~django.test.Response` objects annotated with extra testing information. In Django versions prior to 1.3, this included a ``template`` attribute containing information about templates rendered in generating the response: either None, a single :class:`~django.template.Template` object, or a list of :class:`~django.template.Template` objects. This inconsistency in return values (sometimes a list, sometimes not) made the attribute difficult to work with.
id: Obyek :ref:`test client <test-client>` returns :class:`~django.test.Response` Django diberi keterangan dengan informasi percobaan tambahan. Di Django versi sebelum 1.3, ini menyertakan atribut ``template`` mengandung informasi tentang cetakan dibangun dalam membangkitkan tanggapan: baik None, obyek :class:`~django.template.Template` tunggal, atau daftar dari obyek :class:`~django.template.Template`. Ketidakkonsistenan ini mengembalikan nilai (terkadang daftar, terkadang bukan) membuat atribut sulit bekerja dengannya.
zh_hans: Django 的 :ref:`测试客户端 <test-client>` 返回带有额外测试信息的 :class:`~django.test.Response` 对象。在 Django 1.3 之前的版本中，这包括一个 ``template`` 属性，其中包含有关在生成响应时渲染的模板的信息：可以是 None、一个 :class:`~django.template.Template` 对象，或一个 :class:`~django.template.Template` 对象的列表。返回值的这种不一致性（有时是列表，有时不是）使得这个属性难以使用。

source: In Django 1.3 the ``template`` attribute is deprecated in favor of a new :attr:`~django.test.Response.templates` attribute, which is always a list, even if it has only a single element or no elements.
id: Di Django 1.3 atribut ``template`` diusangkan dalam mendukung dari atribut :attr:`~django.test.Response.templates` baru, yang selalu sebuah daftar, bahkan jika itu hanya mempunyai unsur tunggal atau tidak ada unsur.
zh_hans: 在 Django 1.3 中，``template`` 属性已被弃用，改为使用新的 :attr:`~django.test.Response.templates` 属性，该属性始终是一个列表，即使它只有一个元素或没有元素。

source: As a result of the introduction of support for ``unittest2``, the features of ``django.test.simple.DjangoTestRunner`` (including fail-fast and Ctrl-C test termination) have been made redundant. In view of this redundancy, ``DjangoTestRunner`` has been turned into an empty placeholder class, and will be removed entirely in Django 1.5.
zh_hans: 由于引入了对 ``unittest2`` 的支持，``django.test.simple.DjangoTestRunner`` 的特性（包括快速失败和 Ctrl-C 测试终止）已经变得多余。考虑到这种多余性，``DjangoTestRunner`` 已经被转变成一个空的占位符类，并将在 Django 1.5 中完全删除。

source: Changes to ``url`` and ``ssi``
id: Dirubah ke ``url`` dan ``ssi``
zh_hans: 关于 ``url`` 和 ``ssi`` 的更改

source: Most template tags will allow you to pass in either constants or variables as arguments -- for example:
zh_hans: 大多数模板标签允许您将常量或变量作为参数传递，例如：

source: allows you to specify a base template as a constant, but if you have a context variable ``templ`` that contains the value ``base.html``:
zh_hans: 允许您将一个基本模板指定为常量，但如果您有一个包含值 ``base.html`` 的上下文变量 ``templ``：

source: is also legal.
id: juga sah.
zh_hans: 这也是合法的。

source: However, due to an accident of history, the ``url`` and ``ssi`` are different. These tags use the second, quoteless syntax, but interpret the argument as a constant. This means it isn't possible to use a context variable as the target of a ``url`` and ``ssi`` tag.
id: Bagaimanapun, karena sebuah kecelakan dari sejarah, ``url`` dan ``ssi`` adalah berbeda. Etiket ini menggunakan kedua, sintaksis tanpa dikutip, tetapi menafsirkan argumen sebagai ketetapan. Ini berarti itu tidak memungkinkan menggunakan konteks variabel sebagai sasaran dari etiket ``url`` dan ``ssi``.
zh_hans: 然而，由于历史原因，``url`` 和 ``ssi`` 是不同的。这些标签使用第二种无引号的语法，但将参数解释为常量。这意味着无法使用上下文变量作为 ``url`` 和 ``ssi`` 标签的目标。

source: Django 1.3 marks the start of the process to correct this historical accident. Django 1.3 adds a new template library -- ``future`` -- that provides alternate implementations of the ``url`` and ``ssi`` template tags. This ``future`` library implement behavior that makes the handling of the first argument consistent with the handling of all other variables. So, an existing template that contains:
zh_hans: Django 1.3 标志着纠正这个历史意外的过程的开始。Django 1.3 添加了一个新的模板库 -- ``future``，提供了 ``url`` 和 ``ssi`` 模板标签的替代实现。这个 ``future`` 库实现了使第一个参数的处理与所有其他变量的处理一致的行为。因此，一个包含以下内容的现有模板：

source: should be replaced with:
zh_hans: 应该替换为：

source: The tags implementing the old behavior have been deprecated, and in Django 1.5, the old behavior will be replaced with the new behavior. To ensure compatibility with future versions of Django, existing templates should be modified to use the new ``future`` libraries and syntax.
id: Etiket yang menerapkan perilaku lama telah diusangkan, dan di Django 1.5, perilaku lama akan diganti dengan perilaku baru. Untuk memastikan kesesuaian dengan versi selanjutnya dari Django, cetakan yang ada harus dirubah menggunakan pustaka-pustaka ``future`` dan sintaksis baru.
zh_hans: 实现旧行为的标签已经被弃用，在 Django 1.5 中，旧行为将被新行为替代。为了确保与未来版本的 Django 兼容，现有模板应该被修改以使用新的 ``future`` 库和语法。

source: Changes to the login methods of the admin
id: Perubahan ke cara masuk dari admin
zh_hans: 管理员登录方法的更改

source: In previous version the admin app defined login methods in multiple locations and ignored the almost identical implementation in the already used auth app. A side effect of this duplication was the missing adoption of the changes made in :commit:`r12634 <c8015052d935a99a5c8f96434b2d0cd16d8a4e14>` to support a broader set of characters for usernames.
zh_hans: 在之前的版本中，管理应用在多个位置定义了登录方法，并忽略了已经使用的 auth 应用中几乎相同的实现。这种重复的副作用是没有采用 :commit:`r12634 <c8015052d935a99a5c8f96434b2d0cd16d8a4e14>` 中所做的更改，以支持更广泛的用户名字符集。

source: This release refactors the admin's login mechanism to use a subclass of the :class:`~django.contrib.auth.forms.AuthenticationForm` instead of a manual form validation. The previously undocumented method ``'django.contrib.admin.sites.AdminSite.display_login_form'`` has been removed in favor of a new :attr:`~django.contrib.admin.AdminSite.login_form` attribute.
id: Terbitan ini refaktor mekanisme masuk admin untuk menggunakan subkelas dari :class:`~django.contrib.auth.forms.AuthenticationForm` daripada pengesahan formulir manual. Cara tidak terdokumentasi sebelumnya ``'django.contrib.admin.sites.AdminSite.display_login_form'`` telah diusangkan dalam mendukung dari atribut :attr:`~django.contrib.admin.AdminSite.login_form` baru.
zh_hans: 这个版本重构了管理界面的登录机制，使用了 :class:`~django.contrib.auth.forms.AuthenticationForm` 的子类来代替手动表单验证。以前未记录的方法 ``'django.contrib.admin.sites.AdminSite.display_login_form'`` 已被移除，改为使用新的 :attr:`~django.contrib.admin.AdminSite.login_form` 属性。

source: ``reset`` and ``sqlreset`` management commands
id: Perintah pengelolaan ``reset`` dan ``sqlreset``
zh_hans: ``reset`` 和 ``sqlreset`` 管理命令

source: Those commands have been deprecated. The ``flush`` and ``sqlflush`` commands can be used to delete everything. You can also use ALTER TABLE or DROP TABLE statements manually.
id: Perintah-perintah tersebut telah diusangkan. Perintah ``flush`` dan ``sqlflush`` dapat digunakan untuk menghapus apapun. Anda dapat juga menggunakan pernyataan ALTER TABLE atau DROP TABLE secara manual.
zh_hans: 这些命令已经被弃用。可以使用 ``flush`` 和 ``sqlflush`` 命令来删除所有内容。您也可以手动使用 ALTER TABLE 或 DROP TABLE 语句。

source: The function-based :setting:`TEST_RUNNER` previously used to execute the GeoDjango test suite, ``django.contrib.gis.tests.run_gis_tests``, was deprecated for the class-based runner, ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``.
id: :setting:`TEST_RUNNER` berdasarkan-fungsi sebelumnya digunakan untuk menjalankan deretan percobaan GeoDjango, ``django.contrib.gis.tests.run_gis_tests``, akhirnya diusangkan dalam mendukung pejalan percobaan berdasarkan kelas, ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``.
zh_hans: 用于执行 GeoDjango 测试套件的函数式 :setting:`TEST_RUNNER`，以前称为 ``django.contrib.gis.tests.run_gis_tests``，已被弃用，取而代之的是基于类的运行器，``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``。

source: Previously, calling :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` would silently do nothing when GDAL wasn't available. Now, a :class:`~django.contrib.gis.geos.GEOSException` is properly raised to indicate possible faulty application code. A warning is now raised if :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` is called when the SRID of the geometry is less than 0 or ``None``.
id: Sebelumnya, memanggil :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` akan secara diam tidak melakukan apapun ketika GDAL tidak tersedia. Sekarang :class:`~django.contrib.gis.geos.GEOSException` secara pantas dimunculkan untuk menunjukkan kemungkinan kegagalan kode aplikasi. Sebuah peringatan sekarang dimunculkan jika :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` dipanggil ketika SRID dari geometri kurang dari 0 atau ``None``
zh_hans: 以前，调用 :meth:`~django.contrib.gis.geos.GEOSGeometry.transform` 在没有安装 GDAL 时会默默地什么也不做。现在，会引发一个 :class:`~django.contrib.gis.geos.GEOSException` 来指示可能存在问题的应用程序代码。如果在几何对象的 SRID 小于 0 或为 ``None`` 时调用 :meth:`~django.contrib.gis.geos.GEOSGeometry.transform`，则会引发警告。

source: Previously this field's ``clean()`` method accepted a second, gender, argument which allowed stronger validation checks to be made, however since this argument could never actually be passed from the Django form machinery it is now pending deprecation.
id: Sebelumnya metode ``clean()`` bidang ini menerima kedua, kelamin, argumen yang mengizinkan pemeriksanaan pengesahan lebih kuat untuk dibuat, bagaimanapun sejak argumen ini dapat tidak pernah sebenarnya dilewatkan dari mesin-mesin formulir Django itu sekarang ditunda pengusangan.
zh_hans: 以前，这个字段的 ``clean()`` 方法接受第二个参数 gender，允许进行更强的验证检查，但由于这个参数实际上无法从 Django 表单机制中传递，因此它现在处于待弃用状态。

source: Previously, ``django.http`` exposed an undocumented ``CompatCookie`` class, which was a bugfix wrapper around the standard library ``SimpleCookie``. As the fixes are moving upstream, this is now deprecated - you should use ``from django.http import SimpleCookie`` instead.
id: Sebelumnya, ``django.http`` membedah sebuah kelas ``CompatCookie`` tidak didokumentasikan, yang merupakan pembungkus perbaikan kesalahan disekitar pustaka standar ``SimpleCookie``. Ketika perbaikan dipindahkan ke hulu, ini sekarang diusangkan - anda harus menggunakan ``from django.http import SimpleCookie`` sebagai gantinya.
zh_hans: 以前，``django.http`` 暴露了一个未记录的 ``CompatCookie`` 类，它是标准库 ``SimpleCookie`` 的一个修复包装。由于修复已经被合并到标准库中，这个类现在已被弃用 - 您应该使用 ``from django.http import SimpleCookie``。

source: Loading of *project-level* translations
id: Memuat penterjemahan *tingkatan-proyek*
zh_hans: 加载 *项目级别* 的翻译

source: This release of Django starts the deprecation process for inclusion of translations located under the so-called *project path* in the translation building process performed at runtime. The :setting:`LOCALE_PATHS` setting can be used for the same task by adding the filesystem path to a ``locale`` directory containing project-level translations to the value of that setting.
id: Terbitan dari Django memulai pengolahan pengusangan untuk penyertaan dari terjemahan ditempatkan dibawah disebut *jalur proyek* di pengolahan membangun terjemahan dilakukan pada saat runtime. Pengaturan :setting:`LOCALE_PATHS` dapat digunakan untuk tugas yang sama dengan menambahkan jalur sistem berkas pada direktori ``locale`` mengandung terjemahan tingkatan-proyek pada nilai dari pengaturan itu.
zh_hans: Django 的这个版本开始了对在运行时进行的翻译构建过程中包含位于所谓的 *项目路径* 下的翻译的弃用过程。可以使用 :setting:`LOCALE_PATHS` 设置来执行相同的任务，只需将包含项目级别翻译的 ``locale`` 目录的文件系统路径添加到该设置的值中。

source: Rationale for this decision:
id: Alasan untuk keputusan ini:
zh_hans: 这个决定的理由：

source: The *project path* has always been a loosely defined concept (actually, the directory used for locating project-level translations is the directory containing the settings module) and there has been a shift in other parts of the framework to stop using it as a reference for location of assets at runtime.
id: *jalur proyek* selalu konsep ditentukan longgar (sebenarnya, direktori digunakan untuk menempatkan tingkat-proyek terjemahan adalah direktori mengandung pengaturan modul) dan telah ada pergantian di bagian lain dari kerangka kerja untuk menghentikan menggunakan itu sebagai sebuah acuan untuk tempat dari aset pada waktu berjalan.
zh_hans: *项目路径* 一直是一个宽泛定义的概念（实际上，用于定位项目级别翻译的目录是包含设置模块的目录），在框架的其他部分也已经有了不再将其作为运行时资源位置的参考的变化。

source: Detection of the ``locale`` subdirectory tends to fail when the deployment scenario is more complex than the basic one. e.g. it fails when the settings module is a directory (ticket #10765).
id: Penemuan dari subdirektori ``locale`` cenderung gagal ketika menyebarkan skenario adalah lebih rumit daripada satu yang dasar. sebagai contoh dia gagal ketika modul pengaturan adalah sebuah direktori (tiket #10765).
zh_hans: 当部署场景比基本情况更复杂时，检测 ``locale`` 子目录的功能往往会失败，例如，当设置模块是一个目录时（ticket #10765）。

source: There are potential strange development- and deployment-time problems like the fact that the ``project_dir/locale/`` subdir can generate spurious error messages when the project directory is added to the Python path (``manage.py runserver`` does this) and then it clashes with the equally named standard library module, this is a typical warning message:
zh_hans: 存在一些潜在的奇怪的开发和部署时的问题，比如在将项目目录添加到 Python 路径时（``manage.py runserver`` 会这样做），``project_dir/locale/`` 子目录可能会生成虚假的错误消息，并且会与同名的标准库模块发生冲突，这是一个典型的警告消息：

source: This location wasn't included in the translation building process for JavaScript literals. This deprecation removes such inconsistency.
id: Tempat ini tidak disertakan di pengeolahan membangun terjemahan untuk harfiah JavaScript. Pengusangan ini memindahkan ketidakkonsistenan itu.
zh_hans: 此位置未包含在 JavaScript 字面量的翻译构建过程中。这种弃用消除了此类不一致性。

source: ``PermWrapper`` moved to ``django.contrib.auth.context_processors``
id: ``PermWrapper`` dipindah ke ``django.contrib.auth.context_processors``
zh_hans: ``PermWrapper`` 已移动到 ``django.contrib.auth.context_processors``

source: In Django 1.2, we began the process of changing the location of the ``auth`` context processor from ``django.core.context_processors`` to ``django.contrib.auth.context_processors``. However, the ``PermWrapper`` support class was mistakenly omitted from that migration. In Django 1.3, the ``PermWrapper`` class has also been moved to ``django.contrib.auth.context_processors``, along with the ``PermLookupDict`` support class. The new classes are functionally identical to their old versions; only the module location has changed.
id: Di Django 1.2, kami mulai mengolah dari merubah tempat dari pengolah konteks ``auth`` dari ``django.core.context_processors`` menjadi ``django.contrib.auth.context_processors``. Bagaimanapun, ``PermWrapper``mendukung kelas adalah kesalahan dihilangkan dari perpindahan itu. Di Django 1.3, kelas ``PermWrapper`` juga dipindahkan ke ``django.contrib.auth.context_processors``, bersama dengan kelas pendukung ``PermLookupDict`` . Kelas-kelas baru secara kegunaan mirip pada versi lama mereka; hanya tempat modul yang berubah.
zh_hans: 在 Django 1.2 中，我们开始了将 ``auth`` 上下文处理器的位置从 ``django.core.context_processors`` 更改为 ``django.contrib.auth.context_processors`` 的过程。然而，``PermWrapper`` 支持类被错误地遗漏在迁移中。在 Django 1.3 中，``PermWrapper`` 类也已经移动到 ``django.contrib.auth.context_processors``，与 ``PermLookupDict`` 支持类一起。新的类在功能上与旧版本完全相同；只是模块位置发生了变化。

source: Removal of ``XMLField``
id: Perpindahan ``XMLField``
zh_hans: 移除了 ``XMLField``

source: When Django was first released, Django included an ``XMLField`` that performed automatic XML validation for any field input. However, this validation function hasn't been performed since the introduction of ``newforms``, prior to the 1.0 release. As a result, ``XMLField`` as currently implemented is functionally indistinguishable from a simple :class:`~django.db.models.TextField`.
id: Ketika Django pertama kali diterbitkan, Django menyertakan sebuah ``XMLField`` yang melakukan pengecekan XML otomatis untuk tiap bidang masukan. Bagaimanapun, fungsi pengecekan ini belum dilakukan sejak perkenalan dari ``newforms``, sebelum pada terbitan 1.0. Sebagai hasil, ``XMLField`` sebagai :class:`~django.db.models.TextField`.
zh_hans: 当 Django 首次发布时，Django 包括了一个 ``XMLField``，用于对任何字段输入执行自动 XML 验证。然而，自从引入了 ``newforms`` （在 1.0 版本发布之前）以来，这种验证功能就不再执行。因此，当前实现的 ``XMLField`` 在功能上与一个简单的 :class:`~django.db.models.TextField` 没有区别。

source: For this reason, Django 1.3 has fast-tracked the deprecation of ``XMLField`` -- instead of a two-release deprecation, ``XMLField`` will be removed entirely in Django 1.4.
id: Untuk alasan ini, Django 1.3 mempunyai jalur-cepat pengusangan dari ``XMLField`` -- sebagai ganti dua-terbitan pengusangan, ``XMLField`` akan dipindahkan seluruhnya di Django 1.4.
zh_hans: 因此，Django 1.3 已经加速了对 ``XMLField`` 的弃用 -- 不再需要两个版本的弃用，``XMLField`` 将在 Django 1.4 中被完全删除。

source: It's easy to update your code to accommodate this change -- just replace all uses of ``XMLField`` with ``TextField``, and remove the ``schema_path`` keyword argument (if it is specified).
id: Itu sangat mudah memperbaharui kode anda untuk menampung perubahan ini -- cukup ganti semua penggunaan dari ``XMLField`` dengan``TextField``, dan pindahkan argumen kata kunci ``schema_path`` (jika itu ditentukan).
zh_hans: 更新您的代码以适应这个更改非常简单 -- 只需将所有使用的 ``XMLField`` 替换为 ``TextField``，并删除 ``schema_path`` 关键字参数（如果已指定）。

source: Django 1.3.1 release notes
id: Catatan terbitan Django 1.3.1
zh_hans: Django 1.3.1 版本发行说明

source: Welcome to Django 1.3.1!
id: Selamat datang di Django 1.3.1!
zh_hans: 欢迎来到 Django 1.3.1 版本！

source: This is the first security release in the Django 1.3 series, fixing several security issues in Django 1.3. Django 1.3.1 is a recommended upgrade for all users of Django 1.3.
id: Ini adalah terbitan keamanan pertama di rangkaian Django 1.3, memperbaiki beberapa masalah keamanan di Django 1.3. Django 1.3.1 adalah peningkatan dianjurkan untuk semua pengguna dari Django 1.3.
zh_hans: 这是 Django 1.3 系列中的第一个安全版本，修复了 Django 1.3 中的几个安全问题。强烈建议所有使用 Django 1.3 的用户升级到 Django 1.3.1 。

source: Django 1.3.2 release notes
id: Catatan terbitan Django 1.3.2
zh_hans: Django 1.3.2 版本发行说明

source: *July 30, 2012*
id: *30 Juli 2012*
zh_hans: *2012 年 7 月 30 日*

source: This is the second security release in the Django 1.3 series, fixing several security issues in Django 1.3. Django 1.3.2 is a recommended upgrade for all users of Django 1.3.
id: Ini adalah terbitan keamanan kedua di rangkaian Django 1.3, memperbaiki beberapa masalah keamanan di Django 1.3. Django 1.3.2 adalah peningkatan yang dianjurkan untuk semua pengguna dari Django 1.3.
zh_hans: 这是 Django 1.3 系列中的第二个安全版本，修复了 Django 1.3 中的几个安全问题。强烈建议所有使用 Django 1.3 的用户升级到 Django 1.3.2 。

source: Django 1.3.3 release notes
id: Catatan terbitan Django 1.3.3
zh_hans: Django 1.3.3 版本发行说明

source: *August 1, 2012*
id: *Agustus 1, 2012*
zh_hans: *2012 年 8 月 1 日*

source: Following Monday's security release of :doc:`Django 1.3.2 </releases/1.3.2>`, we began receiving reports that one of the fixes applied was breaking Python 2.4 compatibility for Django 1.3. Since Python 2.4 is a supported Python version for that release series, this release fixes compatibility with Python 2.4.
id: Mengikuti terbitan keamananan Senin dari :doc:`Django 1.3.2 </releases/1.3.2>`, kami mulai menerima laporan bahwa satu dariperbaikan yang berlaku telah memutuskan kesesuaian Python 2.4 untuk Django 1.3. Sejak Python 2.4 adalah versi Python yang didukung untuk rangkaian terbitan itu, kesesuaian perbaikan terbitan ini dengan Python 2.4.
zh_hans: 在周一发布了 :doc:`Django 1.3.2 </releases/1.3.2>` 的安全更新后，我们开始收到报告称其中一个应用的修复措施破坏了 Django 1.3 的 Python 2.4 兼容性。由于 Python 2.4 是该版本系列的支持 Python 版本，因此这个发布修复了与 Python 2.4 的兼容性。
