Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: In previous Django versions, various internal ORM methods (mostly ``as_sql`` methods) accepted a ``qn`` (for "quote name") argument, which was a reference to a function that quoted identifiers for sending to the database. In Django 1.8, that argument has been renamed to ``compiler`` and is now a full ``SQLCompiler`` instance. For backwards-compatibility, calling a ``SQLCompiler`` instance performs the same name-quoting that the ``qn`` function used to. However, this backwards-compatibility shim is immediately deprecated: you should rename your ``qn`` arguments to ``compiler``, and call ``compiler.quote_name_unless_alias(...)`` where you previously called ``qn(...)``.
id: Di versi Django sebelumnya, beragam internal cara ORM (kebanyakan cara ``as_sql``) menerima sebuah argumen ``qn`` (untuk "mengutip nama"), yang telah diacukan ke fungsi yang mengutip penciri untuk mengirimkan ke basisdata. Di Django 1.8, argumen tersebut telah dinamai kembali ke ``compiler`` dan sekarang instance ``SQLCompiler`` penuh. Untuk kesesuaian kebelakang, memanggil instance ``SQLCompiler`` melakukan pengutipan-nama sama yang fungsi ``qn`` biasanya. Bagaimanapun, shim kesesuaian kebelakang ini segera diusangkan: anda harus menamai kembali argumen ``qn`` anda ke ``compiler``, dan panggil ``compiler.quote_name_unless_alias(...)`` dimana anda sebelumnya memanggil ``qn(...)``.
zh_hans: 在以前的 Django 版本中，各种内部的 ORM 方法（主要是 ``as_sql`` 方法）接受一个名为 ``qn`` （代表 "quote name"）的参数，它是一个引用了一个函数来为发送到数据库的标识符加引号的参数。在 Django 1.8 中，这个参数已被重命名为 ``compiler``，并且现在是一个完整的 ``SQLCompiler`` 实例。为了向后兼容，调用一个 ``SQLCompiler`` 实例执行与之前 ``qn`` 函数相同的名称引用操作。然而，这个向后兼容性的支持被立即弃用：您应该将您的 ``qn`` 参数重命名为 ``compiler``，并在以前调用 ``qn(...)`` 的地方改为调用 ``compiler.quote_name_unless_alias(...)``。

source: Default value of ``RedirectView.permanent``
id: Nilai awal dari ``RedirectView.permanent``
zh_hans: ``RedirectView.permanent`` 的默认值

source: The default value of the :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` attribute will change from ``True`` to ``False`` in Django 1.9.
id: Nilai awal dari atribut :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` akan berubah dari ``True`` menjadi ``False`` di Django 1.9.
zh_hans: :attr:`RedirectView.permanent <django.views.generic.base.RedirectView.permanent>` 属性的默认值将在 Django 1.9 中从 ``True`` 更改为 ``False``。

source: Using ``AuthenticationMiddleware`` without ``SessionAuthenticationMiddleware``
id: Menggunakan ``AuthenticationMiddleware`` tanpa ``SessionAuthenticationMiddleware``
zh_hans: 在没有使用 ``SessionAuthenticationMiddleware`` 的情况下使用 ``AuthenticationMiddleware``。

source: ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` was added in Django 1.7. In Django 1.7.2, its functionality was moved to ``auth.get_user()`` and, for backwards compatibility, enabled only if ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` appears in ``MIDDLEWARE_CLASSES``.
id: ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` telah ditambahkan di Django 1.7. Di 1.7.2, fungsionalitasnya telah dipindahkan ke ``auth.get_user()`` dan, untuk kesesuaian kebelakang, ada hanya jika ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` muncul di ``MIDDLEWARE_CLASSES``..
zh_hans: ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` 是在 Django 1.7 中添加的。在 Django 1.7.2 中，它的功能被移动到了 ``auth.get_user()`` 中，并且为了向后兼容，只有在 ``MIDDLEWARE_CLASSES`` 中出现 ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` 才会启用它。

source: In Django 1.10, session verification will be enabled regardless of whether or not ``SessionAuthenticationMiddleware`` is enabled (at which point ``SessionAuthenticationMiddleware`` will have no significance). You can add it to your ``MIDDLEWARE_CLASSES`` sometime before then to opt-in. Please read the :ref:`upgrade considerations <session-invalidation-on-password-change>` first.
id: Di Django 1.10, pengecekan sesi akan diadakan meskipun apakah atau tidak ``SessionAuthenticationMiddleware`` diadakan (di mana titik ``SessionAuthenticationMiddleware`` akan tidak mempunyai makna). Anda dapat menambahkannya ke ``MIDDLEWARE_CLASSES`` anda terkadang sebelum kemudian dimasukkan. Silahkan baca :ref:`upgrade considerations <session-invalidation-on-password-change>` dahulu.
zh_hans: 在 Django 1.10 中，无论是否启用 ``SessionAuthenticationMiddleware``，会启用会话验证（此时 ``SessionAuthenticationMiddleware`` 将不再具有重要意义）。您可以在那之前的某个时候将其添加到您的 ``MIDDLEWARE_CLASSES`` 中以选择启用它。请首先阅读 :ref:`升级注意事项 <session-invalidation-on-password-change>`。

source: ``django.contrib.sitemaps.FlatPageSitemap`` has moved to ``django.contrib.flatpages.sitemaps.FlatPageSitemap``. The old import location is deprecated and will be removed in Django 1.9.
id: ``django.contrib.sitemaps.FlatPageSitemap`` telah dipindahkan ke ``django.contrib.flatpages.sitemaps.FlatPageSitemap``. Tempat impor lama diusangkan dan akan dipindahkan di Django 1.9.
zh_hans: ``django.contrib.sitemaps.FlatPageSitemap`` 已经移动到 ``django.contrib.flatpages.sitemaps.FlatPageSitemap``。旧的导入位置已被弃用，并将在 Django 1.9 中移除。

source: Model ``Field.related``
zh_hans: 模型 ``Field.related``

source: Private attribute ``django.db.models.Field.related`` is deprecated in favor of ``Field.rel``. The latter is an instance of ``django.db.models.fields.related.ForeignObjectRel`` which replaces ``django.db.models.related.RelatedObject``. The ``django.db.models.related`` module has been removed and the ``Field.related`` attribute will be removed in Django 1.10.
id: Atribut pribadi ``django.db.models.Field.related`` diusangkan mendukung ``Field.rel``. Yang terakhir adalah sebuah instance dari ``django.db.models.fields.related.ForeignObjectRel`` yang menggantikan ``django.db.models.related.RelatedObject``. Modul ``django.db.models.related`` telah dipindahkan dan atribut ``Field.related`` akan dipindahkan di Django 1.10.
zh_hans: 私有属性 ``django.db.models.Field.related`` 已被弃用，建议使用 ``Field.rel``。后者是 ``django.db.models.fields.related.ForeignObjectRel`` 的一个实例，它替代了 ``django.db.models.related.RelatedObject``。``django.db.models.related`` 模块已被移除，``Field.related`` 属性将在 Django 1.10 中移除。

source: ``ssi`` template tag
id: etiket cetakan ``ssi``
zh_hans: ``ssi`` 模板标签

source: The ``ssi`` template tag allows files to be included in a template by absolute path. This is of limited use in most deployment situations, and the :ttag:`include` tag often makes more sense. This tag is now deprecated and will be removed in Django 1.10.
id: Etiket cetakan ``ssi`` mengizinkan berkas untuk disertakan dalam sebuah cetakan oleh jalur mutlak. Ini adalah dari keterbatasan penggunaan paling di keadaan penyebaran, dan etiket :ttag:`include` sering lebih masuk akal. Etiket ini sekarang diusangkan dan akan dipindahkan di Django 1.10.
zh_hans: ``ssi`` 模板标签允许通过绝对路径将文件包含到模板中。在大多数部署情况下，这具有有限的用途，通常更有意义的是使用 :ttag:`include` 标签。此标签现在已被弃用，并将在 Django 1.10 中移除。

source: ``=`` as comparison operator in ``if`` template tag
id: ``=`` sebagai perbandingan penghubung di etiket cetakan ``if``
zh_hans: ``if`` 模板标签中的比较运算符 ``=`` 已被弃用

source: Using a single equals sign with the ``{% if %}`` template tag for equality testing was undocumented and untested. It's now deprecated in favor of ``==``.
id: Menggunakan tanda persamaan tunggal dengan etiket cetakan ``{% if %}`` untuk persamaan percobaan tidak didokumentasikan dan tidak dicoba. Itu sekarang diusangkan mendukung ``==``.
zh_hans: 在 ``{% if %}`` 模板标签中使用单个等号进行相等性测试是未记录和未经测试的。现在已弃用，建议使用 ``==``。

source: ``%(<foo>)s`` syntax in ``ModelFormMixin.success_url``
id: ``%(<foo>)s`` sintaksis di ``ModelFormMixin.success_url``
zh_hans: 在 ``ModelFormMixin.success_url`` 中使用的 ``%(<foo>)s`` 语法已被弃用

source: The legacy ``%(<foo>)s`` syntax in :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` is deprecated and will be removed in Django 1.10.
id: Warisan sintaksis ``%(<foo>)s`` di :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` diusangkan dan akan dipindahkan di Django 1.10.
zh_hans: 在 :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` 中的遗留 ``%(<foo>)s`` 语法已被弃用，并将在 Django 1.10 中移除。

source: ``GeoQuerySet`` aggregate methods
id: Metode pengumpulan ``GeoQuerySet``
zh_hans: ``GeoQuerySet`` 聚合方法

source: The ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, and ``unionagg()`` aggregate methods are deprecated and should be replaced by their function-based aggregate equivalents (``Collect``, ``Extent``, ``Extent3D``, ``MakeLine``, and ``Union``).
id: Metode pengumpulan ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, dan ``unionagg()`` diusangkan dan harus diganti dengan berdasarkan-fungsi mereka pengumpulan yang sama (``Collect``, ``Extent``, ``Extent3D``, ``MakeLine``, dan ``Union``).
zh_hans: ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, 和 ``unionagg()`` 聚合方法已被弃用，应该用它们的基于函数的聚合等效方法（``Collect``、``Extent``、``Extent3D``、``MakeLine`` 和 ``Union``）来替代。

source: Signature of the ``allow_migrate`` router method
id: Tanda tangan dari metode perute ``allow_migrate``
zh_hans: ``allow_migrate`` 路由方法的签名

source: The signature of the :meth:`allow_migrate` method of database routers has changed from ``allow_migrate(db, model)`` to ``allow_migrate(db, app_label, model_name=None, **hints)``.
id: Tanda tangan dari metode :meth:`allow_migrate` dari perute basisdata telah berubah dari ``allow_migrate(db, model)`` menjadi ``allow_migrate(db, app_label, model_name=None, **hints)``.
zh_hans: 数据库路由器的 :meth:`allow_migrate` 方法的签名已从 ``allow_migrate(db, model)`` 更改为 ``allow_migrate(db, app_label, model_name=None, **hints)``。

source: When ``model_name`` is set, the value that was previously given through the ``model`` positional argument may now be found inside the ``hints`` dictionary under the key ``'model'``.
id: Ketika ``model_name`` disetel, nilai yang telah sebelumnya diberikan melalui penempatan argumen ``model`` mungkin tidak ditemukan didalam kamus ``hints`` dibawah kunci ``'model'``.
zh_hans: 当设置了 ``model_name`` 时，之前通过 ``model`` 位置参数传递的值现在可以在 ``hints`` 字典中的键 ``'model'`` 下找到。

source: After switching to the new signature the router will also be called by the :class:`~django.db.migrations.operations.RunPython` and :class:`~django.db.migrations.operations.RunSQL` operations.
id: Setelah berganti ke tanda tangan baru perute akan juga dipanggil oleh tindakan :class:`~django.db.migrations.operations.RunPython` dan :class:`~django.db.migrations.operations.RunSQL`.
zh_hans: 在切换到新签名后，路由器还将被 :class:`~django.db.migrations.operations.RunPython` 和 :class:`~django.db.migrations.operations.RunSQL` 操作调用。

source: Features removed in 1.8
id: Fitur-fitur dipindahkan di 1.8
zh_hans: 在 1.8 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 1.8. See :ref:`deprecated-features-1.6` for details, including how to remove usage of these features.
id: Fitur-fitur ini telah mencapai akhir siklus pengusangan mereka dan dipindahkan di Django 1.8. Lihat :ref:`deprecated-features-1.6` untuk rincian, termasuk bagaimana memindahkan penggunaan fitur ini.
zh_hans: 这些特性已经到达了它们的弃用周期的尽头，并在 Django 1.8 中被移除。有关详细信息，包括如何删除对这些特性的使用，请参阅 :ref:`deprecated-features-1.6`。

source: ``django.contrib.comments`` is removed.
id: ``django.contrib.comments`` dipindahkan.
zh_hans: ``django.contrib.comments`` 已被移除。

source: The following transaction management APIs are removed:
id: API pengelolaan transaksi berikut dipindahkan:
zh_hans: 以下事务管理 API 已被移除：

source: the decorators and context managers ``autocommit``, ``commit_on_success``, and ``commit_manually``, defined in ``django.db.transaction``
id: penghias dan pengelola konteks ``autocommit``, ``commit_on_success``, dan ``commit_manually``, ditentukan di ``django.db.transaction``
zh_hans: 在 ``django.db.transaction`` 中定义的装饰器和上下文管理器 ``autocommit``, ``commit_on_success``, 和 ``commit_manually`` 已被移除。

source: the functions ``commit_unless_managed`` and ``rollback_unless_managed``, also defined in ``django.db.transaction``
id: Fungsi ``commit_unless_managed`` dan ``rollback_unless_managed``, juga ditentukan di ``django.db.transaction``
zh_hans: 在 ``django.db.transaction`` 中定义的函数 ``commit_unless_managed`` 和 ``rollback_unless_managed`` 也已被移除。

source: The :ttag:`cycle` and :ttag:`firstof` template tags auto-escape their arguments.
id: Etiket cetakan :ttag:`cycle` dan :ttag:`firstof` meloloskan otomatis argumen mereka.
zh_hans: :ttag:`cycle` 和 :ttag:`firstof` 模板标签会自动转义其参数。

source: The ``SEND_BROKEN_LINK_EMAILS`` setting is removed.
id: Pengaturan ``SEND_BROKEN_LINK_EMAILS`` dipindahkan.
zh_hans: ``SEND_BROKEN_LINK_EMAILS`` 设置已被移除。

source: ``django.middleware.doc.XViewMiddleware`` is removed.
id: ``django.middleware.doc.XViewMiddleware`` dipindahkan.
zh_hans: ``django.middleware.doc.XViewMiddleware`` 已被移除。

source: The ``Model._meta.module_name`` alias is removed.
id: Nama lain ``Model._meta.module_name`` dipindahkan.
zh_hans: ``Model._meta.module_name`` 别名已被移除。

source: The backward compatible shims introduced to rename ``get_query_set`` and similar queryset methods are removed. This affects the following classes: ``BaseModelAdmin``, ``ChangeList``, ``BaseCommentNode``, ``GenericForeignKey``, ``Manager``, ``SingleRelatedObjectDescriptor`` and ``ReverseSingleRelatedObjectDescriptor``.
id: Shim kesesuaian kebelakang diperkenalkan untuk menamai kembali ``get_query_set`` dan metode queryset yang mirip dipindahkan. Ini mempengaruhi kelas-kelas berikut: ``BaseModelAdmin``, ``ChangeList``, ``BaseCommentNode``, ``GenericForeignKey``, ``Manager``, ``SingleRelatedObjectDescriptor`` dan ``ReverseSingleRelatedObjectDescriptor``.
zh_hans: 已经移除了为了重命名 ``get_query_set`` 和类似的查询集方法而引入的向后兼容的包装。这会影响以下类：``BaseModelAdmin``、``ChangeList``、``BaseCommentNode``、``GenericForeignKey``、``Manager``、``SingleRelatedObjectDescriptor`` 和 ``ReverseSingleRelatedObjectDescriptor``。

source: The backward compatible shims introduced to rename the attributes ``ChangeList.root_query_set`` and ``ChangeList.query_set`` are removed.
id: Shim kesesuaian kebelakang diperkenalkan untuk menamai kembali atribut ``ChangeList.root_query_set`` dan ``ChangeList.query_set`` dipindahkan.
zh_hans: 已经移除了为了重命名属性 ``ChangeList.root_query_set`` 和 ``ChangeList.query_set`` 而引入的向后兼容的包装。

source: ``django.views.defaults.shortcut`` and ``django.conf.urls.shortcut`` are removed.
id: ``django.views.defaults.shortcut`` dan ``django.conf.urls.shortcut`` dipindahkan.
zh_hans: ``django.views.defaults.shortcut`` 和 ``django.conf.urls.shortcut`` 已被移除。

source: Support for the Python Imaging Library (PIL) module is removed.
id: Dukungan untuk modul Python Imaging Library (PIL) dipindahkan.
zh_hans: 不再支持 Python Imaging Library (PIL) 模块。

source: The following private APIs are removed:
id: API pribadi berikut dipindahkan:
zh_hans: 以下私有 API 已被移除：

source: ``django.forms.widgets.RadioInput`` is removed.
id: ``django.forms.widgets.RadioInput`` telah dipindah.
zh_hans: ``django.forms.widgets.RadioInput`` 已被移除。

source: The module ``django.test.simple`` and the class ``django.test.simple.DjangoTestSuiteRunner`` are removed.
id: Modul ``django.test.simple`` dan kelas ``django.test.simple.DjangoTestSuiteRunner`` dipindahkan.
zh_hans: 模块 ``django.test.simple`` 和类 ``django.test.simple.DjangoTestSuiteRunner`` 已被移除。

source: The module ``django.test._doctest`` is removed.
id: Modul ``django.test._doctest`` telah dipindahkan.
zh_hans: 模块 ``django.test._doctest`` 已被移除。

source: The ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` setting is removed. This change affects both ``django.middleware.cache.CacheMiddleware`` and ``django.middleware.cache.UpdateCacheMiddleware`` despite the lack of a deprecation warning in the latter class.
id: Pengaturan ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` dipindahkan. Perubahan ini mempengaruhi kedua ``django.middleware.cache.CacheMiddleware`` dan ``django.middleware.cache.UpdateCacheMiddleware`` meskipun kekurangan dari peringatan pengusangan di kelas terakhir.
zh_hans: ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` 设置已被移除。这个改变影响了 ``django.middleware.cache.CacheMiddleware`` 和 ``django.middleware.cache.UpdateCacheMiddleware``，尽管在后者类中没有弃用警告。

source: Usage of the hard-coded *Hold down "Control", or "Command" on a Mac, to select more than one.* string to override or append to user-provided ``help_text`` in forms for ``ManyToMany`` model fields is not performed by Django anymore either at the model or forms layer.
id: Penggunaan dari kode-keras *Tahan "Control", atau "Command" pada Mac, untuk memilih lebih dari satu.* deretan karakter untuk dikesampingkan atau ditambahkan untuk ``help_text`` disediakan-pengguna dalam bentuk untuk bidang model ``ManyToMany`` tidak dilakukan oleh Django lagi baik pada lapisan model atau formulir.
zh_hans: Django 不再在模型或表单层面使用硬编码的字符串 *Hold down "Control", or "Command" on a Mac, to select more than one.* 来覆盖或附加到用户提供的 ``ManyToMany`` 模型字段的 ``help_text``。

source: The ``Model._meta.get_(add|change|delete)_permission`` methods are removed.
id: Metode ``Model._meta.get_(add|change|delete)_permission`` dipindahkan.
zh_hans: ``Model._meta.get_(add|change|delete)_permission`` 方法已被移除。

source: The session key ``django_language`` is no longer read for backwards compatibility.
id: Kunci sesi ``django_language`` tidak lagi membaca untuk kesesuaian kebelakang.
zh_hans: 不再读取会话键 ``django_language`` 以保持向后兼容性。

source: Geographic Sitemaps are removed (``django.contrib.gis.sitemaps.views.index`` and ``django.contrib.gis.sitemaps.views.sitemap``).
id: Peta situs geografis dipindahkan (``django.contrib.gis.sitemaps.views.index`` dan ``django.contrib.gis.sitemaps.views.sitemap``).
zh_hans: 地理位置 Sitemaps 已被移除（``django.contrib.gis.sitemaps.views.index`` 和 ``django.contrib.gis.sitemaps.views.sitemap``）。

source: ``django.utils.html.fix_ampersands``, the ``fix_ampersands`` template filter, and ``django.utils.html.clean_html`` are removed.
id: ``django.utils.html.fix_ampersands``, saringan cetakan ``fix_ampersands``, dan ``django.utils.html.clean_html`` dipindahkan.
zh_hans: ``django.utils.html.fix_ampersands``、``fix_ampersands`` 模板过滤器以及 ``django.utils.html.clean_html`` 都已被移除。

source: Django 1.8.1 release notes
id: Catatan terbitan Django 1.8.1
zh_hans: Django 1.8.1 版本发行说明

source: Django 1.8.1 fixes several bugs in 1.8 and includes some optimizations in the migrations framework.
id: Django 1.8.1 memperbaiki beberapa kesalahan di 1.8 termasuk beberapa optimalisasi di kerangka kerja perpindahan.
zh_hans: Django 1.8.1 修复了 1.8 版本中的一些错误，并对迁移框架进行了一些优化。

source: Added support for serializing :class:`~datetime.timedelta` objects in migrations (:ticket:`24566`).
id: Ditambahkan dukungan untuk serialisasi obyek :class:`~datetime.timedelta` di perpindahan (:ticket:`24566`).
zh_hans: 在迁移中添加了对 :class:`~datetime.timedelta` 对象的序列化支持 (:ticket:`24566`)。

source: Restored proper parsing of the :djadmin:`testserver` command's positional arguments (fixture names) (:ticket:`24571`).
id: Menyimpan kembali penguraian sesuai dari :djadmin:`testserver` argumen penempatan perintah (nama perlengkapan tetap) (:ticket:`24571`).
zh_hans: 已恢复对 :djadmin:`testserver` 命令的位置参数（fixture 名称）进行正确解析 (:ticket:`24571`)。

source: Prevented ``TypeError`` in translation functions ``check_for_language()`` and ``get_language_bidi()`` when translations are deactivated (:ticket:`24569`).
id: Dicegah ``TypeError`` di fungsi terjemahan ``check_for_language()`` dan ``get_language_bidi()`` ketika terjemahan dinonaktifkan (:ticket:`24569`).
zh_hans: 在翻译函数 ``check_for_language()`` 和 ``get_language_bidi()`` 中，在翻译被停用时，防止了 ``TypeError`` (:ticket:`24569`)。

source: Fixed :djadmin:`squashmigrations` command when using :class:`~django.db.migrations.operations.SeparateDatabaseAndState` (:ticket:`24278`).
id: Diperbaiki perintah :djadmin:`squashmigrations` ketika menggunakan :class:`~django.db.migrations.operations.SeparateDatabaseAndState` (:ticket:`24278`).
zh_hans: 修复了在使用 :class:`~django.db.migrations.operations.SeparateDatabaseAndState` 时 :djadmin:`squashmigrations` 命令的问题 (:ticket:`24278`)。

source: Stripped microseconds from ``datetime`` values when using an older version of the MySQLdb DB API driver as it does not support fractional seconds (:ticket:`24584`).
id: Dilucuti mikrodetik dari nilai ``datetime`` ketika menggunakan versi terlama dari pemacu API DB MySQLdb ketika itu tidak mendukung pecahan detik (:ticket:`24584`).
zh_hans: 在使用较旧版本的 MySQLdb DB API 驱动程序时，从 ``datetime`` 值中去除了微秒，因为它不支持分数秒 (:ticket:`24584`)。

source: Fixed a migration crash when altering :class:`~django.db.models.ManyToManyField`\s (:ticket:`24513`).
id: Diperbaiki perpindahan kegagalan ketika mengubah :class:`~django.db.models.ManyToManyField` (:ticket:`24513`) .
zh_hans: 修复了在修改 :class:`~django.db.models.ManyToManyField` 时发生的迁移崩溃问题 (:ticket:`24513`)。

source: Fixed a crash with ``QuerySet.update()`` on foreign keys to one-to-one fields (:ticket:`24578`).
id: Diperbaiki sebuah kegagalan dengan ``QuerySet.update()`` pada foreign key ke bidang satu-ke-satu (:ticket:`24578`).
zh_hans: 修复了在对外键到一对一字段的情况下使用 ``QuerySet.update()`` 时发生的崩溃问题 (:ticket:`24578`)。

source: Fixed a regression in the model detail view of :mod:`~django.contrib.admindocs` when a model has a reverse foreign key relation (:ticket:`24624`).
id: Diperbaiki pemulihan di tampilan rincian model dari :mod:`~django.contrib.admindocs` ketika sebuah model telah memutar hubungan foreign key (:ticket:`24624`).
zh_hans: 修复了 :mod:`~django.contrib.admindocs` 的模型详细视图中的一个回归问题，当一个模型具有反向外键关系时 (:ticket:`24624`)。

source: Prevented arbitrary file inclusions in :mod:`~django.contrib.admindocs` (:ticket:`24625`).
id: Dicegah pemasukan berkas sewenang-wenang di :mod:`~django.contrib.admindocs` (:ticket:`24625`).
zh_hans: 防止了在 :mod:`~django.contrib.admindocs` 中的任意文件包含问题 (:ticket:`24625`)。

source: Fixed a crash with ``QuerySet.update()`` on foreign keys to instances with ``uuid`` primary keys (:ticket:`24611`).
id: Diperbaiki sebuah kegagalan dengan ``QuerySet.update()`` pada foreign key untuk dicirikan dengan primary key ``uuid`` (:ticket:`24611`).
zh_hans: 修复了在对外键到具有 ``uuid`` 主键的实例使用 ``QuerySet.update()`` 时发生的崩溃问题 (:ticket:`24611`)。

source: Fixed database introspection with SQLite 3.8.9 (released April 8, 2015) (:ticket:`24637`).
id: Diperbaiki interospeksi basisdata dengan SQLite 3.8.9 (diterbitkan 8 April 2015) (:ticket:`24637`).
zh_hans: 修复了与 SQLite 3.8.9（发布于 2015 年 4 月 8 日）的数据库内省问题 (:ticket:`24637`)。

source: Updated ``urlpatterns`` examples generated by :djadmin:`startproject` to remove usage of referencing views by dotted path in ``django.conf.urls.url()`` which is deprecated in Django 1.8 (:ticket:`24635`).
zh_hans: 更新了由 :djadmin:`startproject` 生成的 ``urlpatterns`` 示例，移除了在 ``django.conf.urls.url()`` 中使用点路径引用视图的用法，该用法在 Django 1.8 中已被弃用 (:ticket:`24635`)。

source: Fixed queries where an expression was referenced in ``order_by()``, but wasn't part of the select clause. An example query is ``qs.annotate(foo=F('field')).values('pk').order_by('foo'))`` (:ticket:`24615`).
id: Diperbaiki permintaan dimana sebuah pernyataan telah diacukan di ``order_by()``, tetapi bukan bagian dari klausa select. Sebuah contoh permintaan adalah ``qs.annotate(foo=F('field')).values('pk').order_by('foo'))`` (:ticket:`24615`).
zh_hans: 修复了在查询中引用了 ``order_by()`` 中的表达式，但该表达式不是选择子句的一部分的问题。一个示例查询是 ``qs.annotate(foo=F('field')).values('pk').order_by('foo'))`` (:ticket:`24615`)。

source: Fixed a database table name quoting regression (:ticket:`24605`).
id: Diperbaiki sebuah nama tabel basisdata mengutip pemulihan (:ticket:`24605`).
zh_hans: 修复了一个数据库表名引用的回归问题 (:ticket:`24605`)。
