Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Third-party database backends should add a ``DatabaseIntrospection.get_sequences()`` method based on the stub in ``BaseDatabaseIntrospection``.
zh_hans: 第三方数据库后端应该基于 ``BaseDatabaseIntrospection`` 中的存根添加一个名为 ``DatabaseIntrospection.get_sequences()`` 的方法。

source: Dropped support for Oracle 11.2
id: Dijatuhkan dukungan untuk Oracle 11.2
zh_hans: 不再支持 Oracle 11.2

source: The end of upstream support for Oracle 11.2 is Dec. 2020. Django 1.11 will be supported until April 2020 which almost reaches this date. Django 2.0 officially supports Oracle 12.1+.
zh_hans: Oracle 11.2 的上游支持将于 2020 年 12 月结束。 Django 1.11 将在 2020 年 4 月之前得到支持，几乎达到了这个日期。 Django 2.0 正式支持 Oracle 12.1 及更高版本。

source: Default MySQL isolation level is read committed
zh_hans: 默认的 MySQL 隔离级别为读已提交（read committed）

source: MySQL's default isolation level, repeatable read, may cause data loss in typical Django usage. To prevent that and for consistency with other databases, the default isolation level is now read committed. You can use the :setting:`DATABASES` setting to :ref:`use a different isolation level <mysql-isolation-level>`, if needed.
zh_hans: MySQL 的默认隔离级别，可重复读（repeatable read），在典型的 Django 使用中可能会导致数据丢失。为了防止这种情况并保持与其他数据库的一致性，现在默认的隔离级别是读提交（read committed）。如果需要，您可以使用 :setting:`DATABASES` 设置来 :ref:`使用不同的隔离级别 <mysql-isolation-level>`。

source: :attr:`AbstractUser.last_name <django.contrib.auth.models.User.last_name>` ``max_length`` increased to 150
id: ``max_length`` :attr:`AbstractUser.last_name <django.contrib.auth.models.User.last_name>` ditingkatkan menjadi 150
zh_hans: :attr:`AbstractUser.last_name <django.contrib.auth.models.User.last_name>` 的 ``max_length`` 增加到了 150。

source: A migration for :attr:`django.contrib.auth.models.User.last_name` is included. If you have a custom user model inheriting from ``AbstractUser``, you'll need to generate and apply a database migration for your user model.
zh_hans: 包含了 :attr:`django.contrib.auth.models.User.last_name` 的迁移。如果您有一个从 ``AbstractUser`` 继承的自定义用户模型，您需要生成并应用一个数据库迁移来更新您的用户模型。

source: If you want to preserve the 30 character limit for last names, use a custom form::
id: Jika anda ingin menyediakan batasan 30 karakter untuk nama terakhir, gunakan formulir penyesuaian::
zh_hans: 如果您想保留姓氏的 30 个字符限制，请使用自定义表单：

source: If you wish to keep this restriction in the admin when editing users, set ``UserAdmin.form`` to use this form::
id: Jika anda berharap menjaga pembatasan ini dalam admin ketika mengubah pengguna, setel ``UserAdmin.form`` untuk menggunakan formulir ini::
zh_hans: 如果你想在管理中编辑用户时保留这个限制，请将 ``UserAdmin.form`` 设置为使用这个表单：

source: ``QuerySet.reverse()`` and ``last()`` are prohibited after slicing
id: ``QuerySet.reverse()`` dan ``last()`` terlarang setelah membelah
zh_hans: 在切片之后，禁止使用 ``QuerySet.reverse()`` 和 ``last()``。

source: Calling ``QuerySet.reverse()`` or ``last()`` on a sliced queryset leads to unexpected results due to the slice being applied after reordering. This is now prohibited, e.g.:
zh_hans: 在切片后调用 ``QuerySet.reverse()`` 或 ``last()`` 会导致意外的结果，因为切片是在重新排序后应用的。现在已禁止这样使用，例如：

source: Form fields no longer accept optional arguments as positional arguments
id: Formulir bidang tidak lagi menerima argumen pilihan sebagai argumen penempatan
zh_hans: 表单字段不再将可选参数作为位置参数接受

source: To help prevent runtime errors due to incorrect ordering of form field arguments, optional arguments of built-in form fields are no longer accepted as positional arguments. For example::
zh_hans: 为了帮助防止由于表单字段参数顺序不正确而导致的运行时错误，内置表单字段的可选参数不再作为位置参数接受。例如：

source: raises an exception and should be replaced with::
id: memunculkan sebuah pengecualian dan harus diganti dengan::
zh_hans: 会引发异常，并且应该替换为：

source: ``call_command()`` validates the options it receives
id: ``call_command()`` mensahkan pilihan dia terima
zh_hans: ``call_command()`` 验证它接收到的选项

source: ``call_command()`` now validates that the argument parser of the command being called defines all of the options passed to ``call_command()``.
zh_hans: ``call_command()`` 现在验证被调用的命令的参数解析器是否定义了传递给 ``call_command()`` 的所有选项。

source: For custom management commands that use options not created using ``parser.add_argument()``, add a ``stealth_options`` attribute on the command::
zh_hans: 对于使用非 ``parser.add_argument()`` 创建的选项的自定义管理命令，请在命令上添加一个名为 ``stealth_options`` 的属性：

source: Indexes no longer accept positional arguments
id: Indeks-indeks tidak lagi menerima argumen penempatan
zh_hans: 索引不再接受位置参数

source: Foreign key constraints are now enabled on SQLite
id: Batasan foreign key sekarang diadakan pada SQLite
zh_hans: 现在在 SQLite 上启用了外键约束（Foreign key constraints）

source: This will appear as a backwards-incompatible change (``IntegrityError: FOREIGN KEY constraint failed``) if attempting to save an existing model instance that's violating a foreign key constraint.
zh_hans: 如果尝试保存违反外键约束的现有模型实例，将会出现不兼容的后向变更（``IntegrityError: FOREIGN KEY constraint failed``）。

source: Foreign keys are now created with ``DEFERRABLE INITIALLY DEFERRED`` instead of ``DEFERRABLE IMMEDIATE``. Thus, tables may need to be rebuilt to recreate foreign keys with the new definition, particularly if you're using a pattern like this::
zh_hans: 外键现在使用 ``DEFERRABLE INITIALLY DEFERRED`` 而不是 ``DEFERRABLE IMMEDIATE`` 来创建。因此，可能需要重新构建表以使用新的定义重新创建外键，特别是如果您使用了类似这样的模式：

source: If you don't recreate the foreign key as ``DEFERRED``, the first ``create()`` would fail now that foreign key constraints are enforced.
id: Jika anda tidak membuat kembali foreign key sebagai ``DEFERRED``, pertama-tama ``create()`` akan gagal sekarang dimana batasan foreign key dipaksakan.
zh_hans: 如果不将外键重新创建为 ``DEFERRED``，那么由于现在强制执行外键约束，第一次的 ``create()`` 将会失败。

source: Backup your database first! After upgrading to Django 2.0, you can then rebuild tables using a script similar to this::
id: Cadangkan basisdata anda dahulu! Setelah meningkatkan ke Django 2.0, anda dapat kemudian membangun kembali tabel-tabel menggunakan tulisan mirip ini::
zh_hans: 首先备份您的数据库！在升级到 Django 2.0 后，您可以使用类似以下脚本的方式重新构建表格：

source: This script hasn't received extensive testing and needs adaption for various cases such as multiple databases. Feel free to contribute improvements.
zh_hans: 这个脚本尚未经过广泛测试，并且需要根据不同情况进行调整，比如多个数据库的情况。欢迎贡献改进。

source: In addition, because of a table alteration limitation of SQLite, it's prohibited to perform :class:`~django.db.migrations.operations.RenameModel` and :class:`~django.db.migrations.operations.RenameField` operations on models or fields referenced by other models in a transaction. In order to allow migrations containing these operations to be applied, you must set the ``Migration.atomic`` attribute to ``False``.
zh_hans: 另外，由于 SQLite 的表更改限制，禁止在事务中对被其他模型引用的模型或字段执行 :class:`~django.db.migrations.operations.RenameModel` 和 :class:`~django.db.migrations.operations.RenameField` 操作。为了允许应用包含这些操作的迁移，您必须将 ``Migration.atomic`` 属性设置为 ``False``。

source: The ``SessionAuthenticationMiddleware`` class is removed. It provided no functionality since session authentication is unconditionally enabled in Django 1.10.
id: Kelas ``SessionAuthenticationMiddleware``dipindahkan. Itu tidak menyediakan kegunaan sejak autentifikasi sesi tanpa syarat ada di Django 1.10.
zh_hans: ``SessionAuthenticationMiddleware`` 类已被移除。自 Django 1.10 版本起，它不再提供任何功能，因为会话身份验证已无条件启用。

source: The default HTTP error handlers (``handler404``, etc.) are now callables instead of dotted Python path strings. Django favors callable references since they provide better performance and debugging experience.
zh_hans: 默认的 HTTP 错误处理程序（``handler404`` 等）现在是可调用函数，而不再是点分 Python 路径字符串。Django 更倾向于可调用引用，因为它们提供更好的性能和调试体验。

source: :class:`~django.views.generic.base.RedirectView` no longer silences ``NoReverseMatch`` if the ``pattern_name`` doesn't exist.
id: :class:`~django.views.generic.base.RedirectView` tidak lagi diam ``NoReverseMatch`` jika ``pattern_name`` tidak ada.
zh_hans: :class:`~django.views.generic.base.RedirectView` 不再在 ``pattern_name`` 不存在时抑制 ``NoReverseMatch``。

source: When ``USE_L10N`` is off, :class:`~django.forms.FloatField` and :class:`~django.forms.DecimalField` now respect :setting:`DECIMAL_SEPARATOR` and :setting:`THOUSAND_SEPARATOR` during validation. For example, with the settings::
zh_hans: 当 ``USE_L10N`` 关闭时，:class:`~django.forms.FloatField` 和 :class:`~django.forms.DecimalField` 现在在验证过程中会尊重 :setting:`DECIMAL_SEPARATOR` 和 :setting:`THOUSAND_SEPARATOR`。例如，使用以下设置：

source: an input of ``"1.345"`` is now converted to ``1345`` instead of ``1.345``.
id: sebuah masukan dari ``"1.345"`` sekarang dirubah ke ``1345`` daripada ``1.345``.
zh_hans: 输入值 ``"1.345"`` 现在被转换为 ``1345``，而不是 ``1.345``。

source: Subclasses of :class:`~django.contrib.auth.models.AbstractBaseUser` are no longer required to implement ``get_short_name()`` and ``get_full_name()``. (The base implementations that raise ``NotImplementedError`` are removed.) ``django.contrib.admin`` uses these methods if implemented but doesn't require them. Third-party apps that use these methods may want to adopt a similar approach.
zh_hans: :class:`~django.contrib.auth.models.AbstractBaseUser` 的子类不再需要实现 ``get_short_name()`` 和 ``get_full_name()``。（已删除引发 ``NotImplementedError`` 的基本实现。）如果实现了这些方法，``django.contrib.admin`` 将使用它们，但不再要求它们。使用这些方法的第三方应用程序可能希望采用类似的方法。

source: The ``FIRST_DAY_OF_WEEK`` and ``NUMBER_GROUPING`` format settings are now kept as integers in JavaScript and JSON i18n view outputs.
id: Pengaturan bentuk ``FIRST_DAY_OF_WEEK`` dan ``NUMBER_GROUPING`` sekarang dijaga sebagai integer dalam keluaran tampilan JavaScript dan JSON.
zh_hans: ``FIRST_DAY_OF_WEEK`` 和 ``NUMBER_GROUPING`` 格式设置现在在 JavaScript 和 JSON i18n 视图输出中保持为整数。

source: :meth:`~django.test.TransactionTestCase.assertNumQueries` now ignores connection configuration queries. Previously, if a test opened a new database connection, those queries could be included as part of the ``assertNumQueries()`` count.
zh_hans: :meth:`~django.test.TransactionTestCase.assertNumQueries` 现在忽略连接配置查询。以前，如果一个测试打开了一个新的数据库连接，那些查询可能会被包括在 ``assertNumQueries()`` 计数中。

source: The default size of the Oracle test tablespace is increased from 20M to 50M and the default autoextend size is increased from 10M to 25M.
zh_hans: Oracle 测试表空间的默认大小从 20M 增加到 50M，自动扩展的默认大小从 10M 增加到 25M 。

source: To improve performance when streaming large result sets from the database, :meth:`.QuerySet.iterator` now fetches 2000 rows at a time instead of 100. The old behavior can be restored using the ``chunk_size`` parameter. For example::
zh_hans: 为了提高从数据库流式传输大型结果集的性能，:meth:`.QuerySet.iterator` 现在一次获取 2000 行，而不是 100 行。可以使用 ``chunk_size`` 参数恢复旧的行为。例如：

source: Providing unknown package names in the ``packages`` argument of the :class:`~django.views.i18n.JavaScriptCatalog` view now raises ``ValueError`` instead of passing silently.
zh_hans: 在 :class:`~django.views.i18n.JavaScriptCatalog` 视图的 ``packages`` 参数中提供未知的包名称现在会引发 ``ValueError``，而不是默默通过。

source: A model instance's primary key now appears in the default ``Model.__str__()`` method, e.g. ``Question object (1)``.
zh_hans: 现在，默认的 ``Model.__str__()`` 方法中会显示模型实例的主键，例如 ``Question object (1)``。

source: ``makemigrations`` now detects changes to the model field ``limit_choices_to`` option. Add this to your existing migrations or accept an auto-generated migration for fields that use it.
zh_hans: 现在，``makemigrations`` 会检测到模型字段的 ``limit_choices_to`` 选项的更改。请将其添加到现有的迁移中，或接受为使用它的字段生成的自动生成的迁移。

source: Performing queries that require :ref:`automatic spatial transformations <automatic-spatial-transformations>` now raises ``NotImplementedError`` on MySQL instead of silently using non-transformed geometries.
zh_hans: 在 MySQL 上执行需要 :ref:`自动空间转换 <automatic-spatial-transformations>` 的查询现在会引发 ``NotImplementedError``，而不再默默地使用未经转换的几何图形。

source: ``django.core.exceptions.DjangoRuntimeWarning`` is removed. It was only used in the cache backend as an intermediate class in ``CacheKeyWarning``'s inheritance of ``RuntimeWarning``.
id: ``django.core.exceptions.DjangoRuntimeWarning`` dipindahkan. Itu hanya digunakan dalam backend cache sebagai sebuah kelas pertengahan dalam warisan ``CacheKeyWarning`` dari ``RuntimeWarning``.
zh_hans: 移除了 ``django.core.exceptions.DjangoRuntimeWarning``。它只在缓存后端中用作 ``CacheKeyWarning`` 继承 ``RuntimeWarning`` 的中间类。

source: Renamed ``BaseExpression._output_field`` to ``output_field``. You may need to update custom expressions.
zh_hans: 将 ``BaseExpression._output_field`` 重命名为 ``output_field``。您可能需要更新自定义表达式。

source: In older versions, forms and formsets combine their ``Media`` with widget ``Media`` by concatenating the two. The combining now tries to :ref:`preserve the relative order of elements in each list <form-media-asset-order>`. ``MediaOrderConflictWarning`` is issued if the order can't be preserved.
zh_hans: 在旧版本中，表单和表单集通过连接两者的 ``Media`` 来合并小部件的 ``Media``。现在，合并尝试 :ref:`保持每个列表中元素的相对顺序 <form-media-asset-order>`。如果无法保持顺序，将发出 ``MediaOrderConflictWarning`` 警告。

source: ``django.contrib.gis.gdal.OGRException`` is removed. It's been an alias for ``GDALException`` since Django 1.8.
zh_hans: 移除了 ``django.contrib.gis.gdal.OGRException``。自 Django 1.8 起，它一直是 ``GDALException`` 的别名。

source: Support for GEOS 3.3.x is dropped.
id: Dukungan GEOS 3.3.x dijatuhkan.
zh_hans: 不再支持 GEOS 3.3.x 版本。

source: The way data is selected for ``GeometryField`` is changed to improve performance, and in raw SQL queries, those fields must now be wrapped in ``connection.ops.select``. See the :ref:`Raw queries note<gis-raw-sql>` in the GIS tutorial for an example.
zh_hans: 选择 ``GeometryField`` 的数据的方式已更改以提高性能，在原始 SQL 查询中，现在必须将这些字段包装在 ``connection.ops.select`` 中。请参阅 GIS 教程中的 :ref:`原始查询注意事项 <gis-raw-sql>` 以获取示例。

source: Features deprecated in 2.0
id: Fitur-fitur diusangkan di 2.0
zh_hans: 在 2.0 中被废弃的功能

source: ``context`` argument of ``Field.from_db_value()`` and ``Expression.convert_value()``
id: Argumen ``context`` dari ``Field.from_db_value()`` dan ``Expression.convert_value()``
zh_hans: ``Field.from_db_value()`` 和 ``Expression.convert_value()`` 的 ``context`` 参数

source: The ``context`` argument of ``Field.from_db_value()`` and ``Expression.convert_value()`` is unused as it's always an empty dictionary. The signature of both methods is now::
zh_hans: ``Field.from_db_value()`` 和 ``Expression.convert_value()`` 的 ``context`` 参数未被使用，因为它始终是一个空字典。现在这两个方法的签名是：

source: Support for the old signature in custom fields and expressions remains until Django 3.0.
zh_hans: 对于自定义字段和表达式的旧签名，将继续支持直到 Django 3.0 版本。

source: The ``django.db.backends.postgresql_psycopg2`` module is deprecated in favor of ``django.db.backends.postgresql``. It's been an alias since Django 1.9. This only affects code that imports from the module directly. The ``DATABASES`` setting can still use ``'django.db.backends.postgresql_psycopg2'``, though you can simplify that by using the ``'django.db.backends.postgresql'`` name added in Django 1.9.
zh_hans: ``django.db.backends.postgresql_psycopg2`` 模块已被弃用，推荐使用 ``django.db.backends.postgresql``。自 Django 1.9 起，它一直是一个别名。这仅影响直接从模块导入的代码。尽管如此，``DATABASES`` 设置仍然可以使用 ``'django.db.backends.postgresql_psycopg2'``，但您可以使用 Django 1.9 中添加的 ``'django.db.backends.postgresql'`` 名称来简化它。

source: ``django.shortcuts.render_to_response()`` is deprecated in favor of :func:`django.shortcuts.render`. ``render()`` takes the same arguments except that it also requires a ``request``.
zh_hans: ``django.shortcuts.render_to_response()`` 已被弃用，推荐使用 :func:`django.shortcuts.render`。``render()`` 接受与之前相同的参数，只是现在需要传递一个 ``request`` 参数。

source: The ``DEFAULT_CONTENT_TYPE`` setting is deprecated. It doesn't interact well with third-party apps and is obsolete since HTML5 has mostly superseded XHTML.
zh_hans: ``DEFAULT_CONTENT_TYPE`` 设置已被弃用。它与第三方应用程序的兼容性不佳，并且自 HTML5 大多代替了 XHTML 后已过时。

source: ``HttpRequest.xreadlines()`` is deprecated in favor of iterating over the request.
zh_hans: ``HttpRequest.xreadlines()`` 已被弃用，建议改为迭代请求对象。

source: The ``field_name`` keyword argument to :meth:`.QuerySet.earliest` and :meth:`.QuerySet.latest` is deprecated in favor of passing the field names as arguments. Write ``.earliest('pub_date')`` instead of ``.earliest(field_name='pub_date')``.
zh_hans: :meth:`.QuerySet.earliest` 和 :meth:`.QuerySet.latest` 中的 ``field_name`` 关键字参数已被弃用，推荐将字段名称作为参数传递。请使用 ``.earliest('pub_date')`` 而不是 ``.earliest(field_name='pub_date')``。

source: Features removed in 2.0
id: Fitur-fitur dipindahkan di 2.0
zh_hans: 在 2.0 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 2.0.
zh_hans: 这些功能已经完成了废弃周期，并在 Django 2.0 中被移除。

source: See :ref:`deprecated-features-1.9` for details on these changes, including how to remove usage of these features.
zh_hans: 有关这些更改的详细信息，包括如何删除对这些特性的使用，请参阅 :ref:`deprecated-features-1.9`。

source: The ``weak`` argument to ``django.dispatch.signals.Signal.disconnect()`` is removed.
zh_hans: ``django.dispatch.signals.Signal.disconnect()`` 中的 ``weak`` 参数已被移除。

source: ``django.db.backends.base.BaseDatabaseOperations.check_aggregate_support()`` is removed.
zh_hans: ``django.db.backends.base.BaseDatabaseOperations.check_aggregate_support()`` 已被移除。

source: The ``django.forms.extras`` package is removed.
zh_hans: ``django.forms.extras`` 包已被移除。

source: The ``assignment_tag`` helper is removed.
zh_hans: ``assignment_tag`` 辅助函数已被移除。

source: The ``host`` argument to ``SimpleTestCase.assertsRedirects()`` is removed. The compatibility layer which allows absolute URLs to be considered equal to relative ones when the path is identical is also removed.
zh_hans: ``SimpleTestCase.assertsRedirects()`` 中的 ``host`` 参数已被移除。兼容性层也被移除，该层允许在路径相同时将绝对 URL 视为与相对 URL 相等。

source: ``Field.rel`` and ``Field.remote_field.to`` are removed.
id: ``Field.rel`` dan ``Field.remote_field.to`` dipindahkan.
zh_hans: ``Field.rel`` 和 ``Field.remote_field.to`` 已被移除。

source: The ``on_delete`` argument for ``ForeignKey`` and ``OneToOneField`` is now required in models and migrations. Consider squashing migrations so that you have fewer of them to update.
zh_hans: 在模型和迁移中，``ForeignKey`` 和 ``OneToOneField`` 的 ``on_delete`` 参数现在是必需的。考虑合并迁移以减少需要更新的迁移数量。

source: ``django.db.models.fields.add_lazy_relation()`` is removed.
id: ``django.db.models.fields.add_lazy_relation()`` dipindahkan.
zh_hans: 移除了 ``django.db.models.fields.add_lazy_relation()``。

source: When time zone support is enabled, database backends that don't support time zones no longer convert aware datetimes to naive values in UTC anymore when such values are passed as parameters to SQL queries executed outside of the ORM, e.g. with ``cursor.execute()``.
zh_hans: 启用时间区域支持时，不再在数据库后端不支持时间区域的情况下将感知的日期时间转换为 UTC 中的非感知值，当这样的值作为参数传递给 ORM 之外的 SQL 查询执行时（例如使用 ``cursor.execute()``）。

source: ``django.contrib.auth.tests.utils.skipIfCustomUser()`` is removed.
id: ``django.contrib.auth.tests.utils.skipIfCustomUser()`` dipindahkan.
zh_hans: ``django.contrib.auth.tests.utils.skipIfCustomUser()`` 已被移除。

source: The ``GeoManager`` and ``GeoQuerySet`` classes are removed.
id: Kelas ``GeoManager`` dan ``GeoQuerySet`` dipindahkan.
zh_hans: ``GeoManager`` 和 ``GeoQuerySet`` 类已被移除。

source: The ``django.contrib.gis.geoip`` module is removed.
zh_hans: ``django.contrib.gis.geoip`` 模块已被移除。

source: The ``supports_recursion`` check for template loaders is removed from:
zh_hans: 模板加载器的 ``supports_recursion`` 检查已从以下地方移除：

source: The ``load_template`` and ``load_template_sources`` template loader methods are removed.
zh_hans: 已移除 ``load_template`` 和 ``load_template_sources`` 模板加载器方法。

source: The ``template_dirs`` argument for template loaders is removed:
zh_hans: 模板加载器的 ``template_dirs`` 参数已被移除：

source: ``django.template.loaders.base.Loader.__call__()`` is removed.
id: ``django.template.loaders.base.Loader.__call__()`` dipindahkan.
zh_hans: ``django.template.loaders.base.Loader.__call__()`` 已被移除。

source: Support for custom error views that don't accept an ``exception`` parameter is removed.
zh_hans: 不接受 ``exception`` 参数的自定义错误视图的支持已被移除。

source: The ``mime_type`` attribute of ``django.utils.feedgenerator.Atom1Feed`` and ``django.utils.feedgenerator.RssFeed`` is removed.
zh_hans: ``django.utils.feedgenerator.Atom1Feed`` 和 ``django.utils.feedgenerator.RssFeed`` 的 ``mime_type`` 属性已被移除。

source: The ``app_name`` argument to ``include()`` is removed.
zh_hans: ``include()`` 中的 ``app_name`` 参数已被移除。

source: Support for passing a 3-tuple (including ``admin.site.urls``) as the first argument to ``include()`` is removed.
zh_hans: 不再支持将一个包含 ``admin.site.urls`` 的 3 元组作为 ``include()`` 的第一个参数。

source: Support for setting a URL instance namespace without an application namespace is removed.
zh_hans: 不再支持在没有应用程序命名空间的情况下设置 URL 实例命名空间。

source: ``Field._get_val_from_obj()`` is removed.
zh_hans: ``Field._get_val_from_obj()`` 已被移除。

source: ``django.template.loaders.eggs.Loader`` is removed.
zh_hans: 移除了 ``django.template.loaders.eggs.Loader``。

source: The ``current_app`` parameter to the ``contrib.auth`` function-based views is removed.
zh_hans: ``contrib.auth`` 函数式视图的 ``current_app`` 参数已被移除。

source: The ``callable_obj`` keyword argument to ``SimpleTestCase.assertRaisesMessage()`` is removed.
zh_hans: ``SimpleTestCase.assertRaisesMessage()`` 中的 ``callable_obj`` 关键字参数已被移除。

source: Support for the ``allow_tags`` attribute on ``ModelAdmin`` methods is removed.
zh_hans: 不再支持在 ``ModelAdmin`` 方法上的 ``allow_tags`` 属性。

source: The ``enclosure`` keyword argument to ``SyndicationFeed.add_item()`` is removed.
zh_hans: ``SyndicationFeed.add_item()`` 中的 ``enclosure`` 关键字参数已被移除。

source: The ``django.template.loader.LoaderOrigin`` and ``django.template.base.StringOrigin`` aliases for ``django.template.base.Origin`` are removed.
zh_hans: ``django.template.loader.LoaderOrigin`` 和 ``django.template.base.StringOrigin`` 别名已被移除，对应的是 ``django.template.base.Origin``。

source: See :ref:`deprecated-features-1.10` for details on these changes.
zh_hans: 请参阅 :ref:`deprecated-features-1.10` 以获取有关这些更改的详细信息。

source: The ``makemigrations --exit`` option is removed.
zh_hans: ``makemigrations --exit`` 选项已被移除。

source: Support for direct assignment to a reverse foreign key or many-to-many relation is removed.
zh_hans: 不再支持直接对反向外键或多对多关系进行赋值。

source: The ``get_srid()`` and ``set_srid()`` methods of ``django.contrib.gis.geos.GEOSGeometry`` are removed.
zh_hans: ``django.contrib.gis.geos.GEOSGeometry`` 的 ``get_srid()`` 和 ``set_srid()`` 方法已被移除。

source: The ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, and ``set_z()`` methods of ``django.contrib.gis.geos.Point`` are removed.
zh_hans: ``django.contrib.gis.geos.Point`` 的 ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, 和 ``set_z()`` 方法已被移除。

source: The ``get_coords()`` and ``set_coords()`` methods of ``django.contrib.gis.geos.Point`` are removed.
zh_hans: ``django.contrib.gis.geos.Point`` 的 ``get_coords()`` 和 ``set_coords()`` 方法已被移除。

source: The ``cascaded_union`` property of ``django.contrib.gis.geos.MultiPolygon`` is removed.
zh_hans: ``django.contrib.gis.geos.MultiPolygon`` 的 ``cascaded_union`` 属性已被移除。

source: ``django.utils.functional.allow_lazy()`` is removed.
zh_hans: ``django.utils.functional.allow_lazy()`` 已被移除。

source: The ``shell --plain`` option is removed.
zh_hans: ``shell --plain`` 选项已被移除。

source: The ``django.core.urlresolvers`` module is removed in favor of its new location, ``django.urls``.
zh_hans: ``django.core.urlresolvers`` 模块已被移除，现在请使用其新位置 ``django.urls``。

source: ``CommaSeparatedIntegerField`` is removed, except for support in historical migrations.
zh_hans: ``CommaSeparatedIntegerField`` 已被移除，除了对历史迁移的支持外。

source: The template ``Context.has_key()`` method is removed.
zh_hans: 模板 ``Context.has_key()`` 方法已被移除。

source: Support for the ``django.core.files.storage.Storage.accessed_time()``, ``created_time()``, and ``modified_time()`` methods is removed.
zh_hans: 对于 ``django.core.files.storage.Storage.accessed_time()``, ``created_time()`` 和 ``modified_time()`` 方法的支持已被移除。
