Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The default settings in ``django.conf.global_settings`` were a combination of lists and tuples. All settings that were formerly tuples are now lists.
id: Pengaturan awalan di ``django.conf.global_settings`` dipadukan dari daftar dan tuple. Semua pengaturan yang sebelumnya tuple sekarang adalah daftar.
zh_hans: 在 ``django.conf.global_settings`` 中的默认设置原来是列表和元组的组合。以前是元组的所有设置现在都改为了列表。

source: ``is_usable`` attribute on template loaders is removed
id: Atribut ``is_usable`` pada pemuat cetakan dipindahkan
zh_hans: 模板加载器上的 ``is_usable`` 属性已被移除。

source: Django template loaders previously required an ``is_usable`` attribute to be defined. If a loader was configured in the template settings and this attribute was ``False``, the loader would be silently ignored. In practice, this was only used by the egg loader to detect if ``setuptools`` was installed. The ``is_usable`` attribute is now removed and the egg loader instead fails at runtime if ``setuptools`` is not installed.
zh_hans: 以前，Django 模板加载器需要定义一个 ``is_usable`` 属性。如果在模板设置中配置了一个加载器并且该属性为 ``False``，则加载器将被静默忽略。在实际应用中，这只有 egg 加载器用于检测是否安装了 ``setuptools``。现在已删除 ``is_usable`` 属性，而 egg 加载器在运行时如果没有安装 ``setuptools`` 则会失败。

source: Related set direct assignment
id: Kumpulan terkait penetapan langsung
zh_hans: 相关集合直接赋值

source: Direct assignment of related objects in the ORM used to perform a ``clear()`` followed by a call to ``add()``. This caused needlessly large data changes and prevented using the :data:`~django.db.models.signals.m2m_changed` signal to track individual changes in many-to-many relations.
id: Penugasan langsung dari objek terkait di ORM digunakan untuk melakukan ``clear()`` diikuti oleh sebuah panggilan pada ``add()``. Ini menyebabkan sia-sia perubahan data besar dan dicegah menggunakan sinyal :data:`~django.db.models.signals.m2m_changed` untuk melacak perubahan individu di hubungan many-to-many.
zh_hans: 在 ORM 中直接分配相关对象以前会执行 ``clear()``，然后调用 ``add()``。这导致了不必要的大量数据更改，并且阻止使用 :data:`~django.db.models.signals.m2m_changed` 信号来跟踪多对多关系中的个别更改。

source: Direct assignment now relies on the new :meth:`~django.db.models.fields.related.RelatedManager.set` method on related managers which by default only processes changes between the existing related set and the one that's newly assigned. The previous behavior can be restored by replacing direct assignment by a call to ``set()`` with the keyword argument ``clear=True``.
zh_hans: 直接赋值现在依赖于相关管理器上的新 :meth:`~django.db.models.fields.related.RelatedManager.set` 方法，默认情况下只处理现有相关集合与新分配的相关集合之间的更改。可以通过将直接赋值替换为带有关键字参数 ``clear=True`` 的 ``set()`` 调用来恢复先前的行为。

source: ``ModelForm``, and therefore ``ModelAdmin``, internally rely on direct assignment for many-to-many relations and as a consequence now use the new behavior.
id: ``ModelForm``, dan oleh karena itu ``ModelAdmin``, secara internal bergantung pada penugasan langsung untuk hubungan many-to-many dan sebagai sebuah konsekuensi sekarang menggunakan perilaku baru.
zh_hans: ``ModelForm``，因此 ``ModelAdmin``，在内部对于多对多关系依赖于直接赋值，并因此现在使用新行为。

source: Filesystem-based template loaders catch more specific exceptions
id: Pemuat cetakan berdasarkan sistem berkas menangkap lebih pengecualian tertentu
zh_hans: 基于文件系统的模板加载器捕获更具体的异常

source: When using the :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>` or :class:`app_directories.Loader <django.template.loaders.app_directories.Loader>` template loaders, earlier versions of Django raised a :exc:`~django.template.TemplateDoesNotExist` error if a template source existed but was unreadable. This could happen under many circumstances, such as if Django didn't have permissions to open the file, or if the template source was a directory. Now, Django only silences the exception if the template source does not exist. All other situations result in the original ``IOError`` being raised.
id: Ketika menggunakan pemuat cetakan :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>` atau :class:`app_directories.Loader <django.template.loaders.app_directories.Loader>`, versi paling awal dari Django memunculkan sebuah kesalahan :exc:`~django.template.TemplateDoesNotExist` jika sebuah sumber cetakan ada tetapi tidak dapat dibaca. Ini dapat terjadi dibawah banyak keadaan, seperti jika Django tidak mempunyai perizinan untuk membuka berkas, atau jika sumber cetakan adalah sebuah direktori. Sekarang, Django hanya mendiamkan pengecualian jika sumber cetakan tidak ada. Semua keadaan lain menghasilkan `IOError`` asli sedang dimunculkan.
zh_hans: 使用 :class:`filesystem.Loader <django.template.loaders.filesystem.Loader>` 或 :class:`app_directories.Loader <django.template.loaders.app_directories.Loader>` 模板加载器时，较早版本的 Django 如果模板源存在但不可读，会引发 :exc:`~django.template.TemplateDoesNotExist` 错误。这可能发生在许多情况下，例如如果 Django 没有权限打开文件，或者模板源是一个目录。现在，只有当模板源不存在时，Django 才会抑制异常。所有其他情况都会引发原始的 ``IOError``。

source: HTTP redirects no longer forced to absolute URIs
id: Pengalihan HTTP tidak lagi memaksa ke URI mutlak
zh_hans: HTTP 重定向不再强制要求使用绝对 URI

source: Relative redirects are no longer converted to absolute URIs. :rfc:`2616` required the ``Location`` header in redirect responses to be an absolute URI, but it has been superseded by :rfc:`7231` which allows relative URIs in ``Location``, recognizing the actual practice of user agents, almost all of which support them.
id: Pengalihan relatif tidak lagi dirubah ke URI mutlak. :rfc:`2616` membutuhkan kepala ``Location`` di tanggapan pengalihan menjadi URI mutlak, tetapi itu telah digantikan oleh :rfc:`7231` yang mengizinkan URI relatif dalam ``Location``, mengenali praktik sebenarnya dari agen pengguna, kebanyakan semua dari yang mendukung mereka.
zh_hans: 相对重定向不再被转换为绝对 URI。:rfc:`2616` 要求重定向响应中的 ``Location`` 标头必须是绝对 URI，但它已被 :rfc:`7231` 取代，允许在 ``Location`` 中使用相对 URI，承认用户代理的实际实践，几乎所有用户代理都支持相对 URI。

source: Consequently, the expected URLs passed to ``assertRedirects`` should generally no longer include the scheme and domain part of the URLs. For example, ``self.assertRedirects(response, 'http://testserver/some-url/')`` should be replaced by ``self.assertRedirects(response, '/some-url/')`` (unless the redirection specifically contained an absolute URL).
zh_hans: 因此，传递给 ``assertRedirects`` 的预期 URL 通常不再应包括 URL 的方案和域部分。例如，``self.assertRedirects(response, 'http://testserver/some-url/')`` 应该替换为 ``self.assertRedirects(response, '/some-url/')`` （除非重定向明确包含绝对 URL）。

source: In the rare case that you need the old behavior (discovered with an ancient version of Apache with ``mod_scgi`` that interprets a relative redirect as an "internal redirect"), you can restore it by writing a custom middleware::
id: Dalam kasus yang jarang bahwa anda butuh perilaku lama (ditemukan dengan versi lama dari Apache dengan ``mod_wsgi`` yang menterjemahkan pengalihan relatif sebagai sebuah "internal redirect"), anda dapat memulihkan itu dengan menulis penyesuaian middleware::
zh_hans: 在极少数情况下，如果您需要旧的行为（使用一个古老版本的 Apache 和 ``mod_scgi`` 发现将相对重定向解释为 "内部重定向" 的情况），您可以通过编写自定义中间件来恢复它：

source: Dropped support for PostgreSQL 9.0
id: Dukungan dibuang untuk PostgreSQL 9.0
zh_hans: 不再支持 PostgreSQL 9.0 版本

source: Upstream support for PostgreSQL 9.0 ended in September 2015. As a consequence, Django 1.9 sets 9.1 as the minimum PostgreSQL version it officially supports.
id: Dukungan hulu untuk PostgreSQL 9.0 berakhir di September 2015. Sebagai konsekuensinya, Django 1.9 menyetel PostgreSQL 9.1 sebagai versi minimal dia secara resmi dukung.
zh_hans: PostgreSQL 9.0 的上游支持于 2015 年 9 月结束。因此，Django 1.9 将 9.1 版本设定为其正式支持的最低 PostgreSQL 版本。

source: Dropped support for Oracle 11.1
id: Dukungan dibuang untuk Oracle 11.1
zh_hans: 不再支持 Oracle 11.1 版本

source: Upstream support for Oracle 11.1 ended in August 2015. As a consequence, Django 1.9 sets 11.2 as the minimum Oracle version it officially supports.
id: Dukungan hulu untuk PostgreSQL 11.1 berakhir di Agustus 2015. Sebagai konsekuensinya, Django 1.9 menyetel PostgreSQL 11.2 sebagai versi minimal Oracle secara resmi dukung.
zh_hans: Oracle 11.1 的上游支持于 2015 年 8 月结束。因此，Django 1.9 将 11.2 版本设定为其正式支持的最低 Oracle 版本。

source: Bulk behavior of ``add()`` method of related managers
id: Perilaku dalam jumlah besar dari metode ``add()`` dari pengelola terkait
zh_hans: 关于相关管理器的 ``add()`` 方法的批量行为

source: To improve performance, the ``add()`` methods of the related managers created by ``ForeignKey`` and ``GenericForeignKey`` changed from a series of ``Model.save()`` calls to a single ``QuerySet.update()`` call. The change means that ``pre_save`` and ``post_save`` signals aren't sent anymore. You can use the ``bulk=False`` keyword argument to revert to the previous behavior.
id: Untuk memperbaiki penampilan, metode ``add()`` dari pengelola terkait dibuat oleh ``ForeignKey`` dan ``GenericForeignKey`` berubah dari rangkaian dari ``Model.save()`` panggilan ke satu panggilan ``QuerySet.update()`` tunggal. Perubahan berarti bahwa sinyal ``pre_save`` dan ``post_save`` tidak dikirm lagi. Anda dapat menggunakan argumen kata kunci ``bulk=False`` untuk kembali ke perilaku sebelumnya.
zh_hans: 为了提高性能，由 ``ForeignKey`` 和 ``GenericForeignKey`` 创建的相关管理器的 ``add()`` 方法从一系列 ``Model.save()`` 调用改为单个 ``QuerySet.update()`` 调用。这个变化意味着不再发送 ``pre_save`` 和 ``post_save`` 信号。您可以使用 ``bulk=False`` 关键字参数来恢复到以前的行为。

source: Template ``LoaderOrigin`` and ``StringOrigin`` are removed
id: Cetakan ``LoaderOrigin`` dan ``StringOrigin`` dipindahkan
zh_hans: 模板中移除了 ``LoaderOrigin`` 和 ``StringOrigin``

source: In previous versions of Django, when a template engine was initialized with debug as ``True``, an instance of ``django.template.loader.LoaderOrigin`` or ``django.template.base.StringOrigin`` was set as the origin attribute on the template object. These classes have been combined into :class:`~django.template.base.Origin` and is now always set regardless of the engine debug setting. For a minimal level of backwards compatibility, the old class names will be kept as aliases to the new ``Origin`` class until Django 2.0.
id: Di versi sebelumnya dari Django, ketika mesin cetakan diinisialisasikan dengan mencari kesalahan sebagai ``True``, sebuah instance dari ``django.template.loader.LoaderOrigin`` atau ``django.template.base.StringOrigin`` disetel sebagai atribut asli di obyek cetakan. Kelas-kelas ini telah dipadukan kedalam :class:`~django.template.base.Origin` dan sekarang selalu disetel tanpa memperhatikan dari pengaturan mesin mencari kesalahan. Untuk tingkat minimal dari kesesuaian kebelakang, nama-nama kelas lama akan disimpan sebagai nama lain ke kelas ``Origin`` baru sampai Django 2.0.
zh_hans: 在之前的 Django 版本中，当一个模板引擎以 ``True`` 的调试设置初始化时，一个 ``django.template.loader.LoaderOrigin`` 或 ``django.template.base.StringOrigin`` 的实例被设置为模板对象的 origin 属性。这些类已经合并为 :class:`~django.template.base.Origin`，并且无论引擎的调试设置如何，都会始终设置。为了最小程度的向后兼容性，旧的类名将保留为新的 ``Origin`` 类的别名，直到 Django 2.0。

source: Changes to the default logging configuration
id: Perubahan pada konfigurasi pencatatan awalan
zh_hans: 默认日志配置的更改

source: To make it easier to write custom logging configurations, Django's default logging configuration no longer defines ``django.request`` and ``django.security`` loggers. Instead, it defines a single ``django`` logger, filtered at the ``INFO`` level, with two handlers:
id: Untuk membuatnya lebih mudah menulis penyesuaian konfigurasi pencatatan, konfigurasi pencatatan awalan Django tidak lagi menentukan pencatat ``django.request`` dan ``django.security``. Sebagai gantinya, itu menentukan pencatat ``django`` tunggal, disaring pada tingkat ``INFO``, dengan dua penangan:
zh_hans: 为了更容易编写自定义的日志配置，Django 的默认日志配置不再定义 ``django.request`` 和 ``django.security`` 记录器。取而代之的是，它定义了一个名为 ``django`` 的记录器，过滤级别为 ``INFO``，具有两个处理程序：

source: ``console``: filtered at the ``INFO`` level and only active if ``DEBUG=True``.
id: ``console``: disaring di tingkat ``INFO`` dan hanya aktif jika ``DEBUG=True``.
zh_hans: ``console``：过滤级别为 ``INFO``，仅在 ``DEBUG=True`` 时激活。

source: ``mail_admins``: filtered at the ``ERROR`` level and only active if ``DEBUG=False``.
id: ``mail_admins``: disaring di tingkat ``ERROR`` dan hanya aktif jika ``DEBUG=True``.
zh_hans: ``mail_admins``：过滤级别为 ``ERROR``，仅在 ``DEBUG=False`` 时激活。

source: If you aren't overriding Django's default logging, you should see minimal changes in behavior, but you might see some new logging to the ``runserver`` console, for example.
id: Jika anda tidak menimpa pencatat awalan Django, anda harus melihat minimal perubahan di perilaku, tetapi anda mungkin melihat beberapa pencatatan baru pada konsol ``runserver``, sebagai contoh.
zh_hans: 如果您没有覆盖 Django 的默认日志配置，您的行为应该只会发生较少的变化，但您可能会在 ``runserver`` 控制台上看到一些新的日志记录，例如。

source: If you are overriding Django's default logging, you should check to see how your configuration merges with the new defaults.
id: Jika anda menimpa pencatat awalan Django, anda harus memeriksa untuk melihat bagaimana konfigurasi anda bergabung dengan awalan baru.
zh_hans: 如果您正在覆盖 Django 的默认日志配置，您应该检查您的配置与新默认值如何合并。

source: ``HttpRequest`` details in error reporting
id: Rincian ``HttpRequest`` dalam pelaporan kesalahan
zh_hans: 在错误报告中的 ``HttpRequest`` 详细信息

source: It was redundant to display the full details of the :class:`~django.http.HttpRequest` each time it appeared as a stack frame variable in the HTML version of the debug page and error email. Thus, the HTTP request will now display the same standard representation as other variables (``repr(request)``). As a result, the ``ExceptionReporterFilter.get_request_repr()`` method and the undocumented ``django.http.build_request_repr()`` function were removed.
id: Itu berlebihan menampilkan rincian penuh dari :class:`~django.http.HttpRequest`setiap kali itu muncul sebagai variabel tumpukan bingkai dalam versi HTML dari halaman mencari kesalahan dan kesalahan surel. Dengan demikian, permintaan HTTP akan sekarang menampilkan perwakilan standar sama seperti variabel lain, (``repr(request)``).Hasilnya, metode ``ExceptionReporterFilter.get_request_repr()`` dan tidak terdokumentasi fungsi ``django.http.build_request_repr()`` dipindahkan.
zh_hans: 每次在调试页面的 HTML 版本和错误邮件中作为堆栈帧变量出现时都显示完整的 :class:`~django.http.HttpRequest` 详细信息是多余的。因此，HTTP 请求现在将显示与其他变量相同的标准表示形式（``repr(request)``）。因此，删除了 ``ExceptionReporterFilter.get_request_repr()`` 方法和未记录的 ``django.http.build_request_repr()`` 函数。

source: The contents of the text version of the email were modified to provide a traceback of the same structure as in the case of AJAX requests. The traceback details are rendered by the ``ExceptionReporter.get_traceback_text()`` method.
id: Isi dari versi teks dari surel dirubah untuk menyediakan jejak kebelakang dari struktur sama seperti dalam kasus permintaan AJAX. Rincian jejak kebelakang dibangun oleh metode ``ExceptionReporter.get_traceback_text()``.
zh_hans: 电子邮件的文本版本内容已修改，以提供与 AJAX 请求的情况相同结构的回溯。回溯详细信息由 ``ExceptionReporter.get_traceback_text()`` 方法呈现。

source: Removal of time zone aware global adapters and converters for datetimes
id: Pemindahan dari sadar zona waktu penyadur global dan perubah untuk datetime
zh_hans: 移除了日期时间的时区感知全局适配器和转换器

source: Django no longer registers global adapters and converters for managing time zone information on :class:`~datetime.datetime` values sent to the database as query parameters or read from the database in query results. This change affects projects that meet all the following conditions:
id: Django tidak lagi mendaftarkan penyadur global dan perubah untuk mengelola informasi zona waktu pada nilai-nilai :class:`~datetime.datetime` dikirim ke basisdata sebagai permintaan parameter atau membaca dari basisdata dalam hasil permintaan. Perubahan ini mempengaruhi proyek yang memenuhi semua kondisi berikut:
zh_hans: Django 不再注册全局适配器和转换器来管理发送到数据库的查询参数中的 :class:`~datetime.datetime` 值的时区信息，以及从查询结果中读取的时区信息。这个变化影响满足以下所有条件的项目：

source: The :setting:`USE_TZ` setting is ``True``.
id: Pengaturan :setting:`USE_TZ` adalah ``True``.
zh_hans: :setting:`USE_TZ` 设置为 ``True``。

source: The database is SQLite, MySQL, Oracle, or a third-party database that doesn't support time zones. In doubt, you can check the value of ``connection.features.supports_timezones``.
id: Basisdata adalah SQLite, MySQL, Oracle, atau sebuah basisdata pihak-ketiga yang tidak mendukung zona waktu. Dalam keraguan, anda dapat memeriksa nilai dari ``connection.features.supports_timezones``.
zh_hans: 数据库是 SQLite、MySQL、Oracle 或不支持时区的第三方数据库。如有疑问，您可以检查 ``connection.features.supports_timezones`` 的值。

source: The code queries the database outside of the ORM, typically with ``cursor.execute(sql, params)``.
id: Kode meminta basisdata diluar dari ORM, khususnya dengan ``cursor.execute(sql, params)``.
zh_hans: 代码在 ORM 之外查询数据库，通常使用 ``cursor.execute(sql, params)``。

source: If you're passing aware :class:`~datetime.datetime` parameters to such queries, you should turn them into naive datetimes in UTC::
id: Jika anda sedang melewatkan parameter :class:`~datetime.datetime` kesadaran ke permintaan tersebut, anda harus merubah mereka menjadi datetime yang tidak dibuat-buat di UTC.
zh_hans: 如果您将感知的 :class:`~datetime.datetime` 参数传递给这些查询，您应该将它们转换为 UTC 中的非感知日期时间：

source: If you fail to do so, the conversion will be performed as in earlier versions (with a deprecation warning) up until Django 1.11. Django 2.0 won't perform any conversion, which may result in data corruption.
id: Jika anda gagal untuk melakukannya, perubahan akan dilakukan seperti di versi paling awal (dengan peringatan pengusangan) sampai Django 1.11. Django 2.0 tidak akan melakukan perubahan apapun, yang mungkin menghasilkan di kerusakan data.
zh_hans: 如果您未这样做，转换将按照早期版本（带有弃用警告）中的方式执行，直到 Django 1.11 为止。 Django 2.0 不会执行任何转换，这可能导致数据损坏。

source: If you're reading :class:`~datetime.datetime` values from the results, they will be naive instead of aware. You can compensate as follows::
id: Jika anda sedang membaca nilai-nilai :class:`~datetime.datetime` dari hasil, mereka akan menjadi tidak dibuat-buat daripada sadar. Anda dapat mengimbangi sebagai berikut::
zh_hans: 如果您从结果中读取 :class:`~datetime.datetime` 值，它们将是非感知的，而不是感知的。您可以按以下方式进行补偿：

source: You don't need any of this if you're querying the database through the ORM, even if you're using :meth:`raw() <django.db.models.query.QuerySet.raw>` queries. The ORM takes care of managing time zone information.
id: Anda tidak memerlukan semua ini jika anda sedang meminta basisdata melalui ORM, bahkan jika anda sedang menggunakan permintaan :meth:`raw() <django.db.models.query.QuerySet.raw>`. ORM merawat pengelolaan informasi zona waktu.
zh_hans: 如果您通过 ORM 查询数据库，即使使用 :meth:`raw() <django.db.models.query.QuerySet.raw>` 查询，也不需要进行上述操作。ORM 会处理时区信息的管理。

source: Template tag modules are imported when templates are configured
id: Modul etiket cetakan diimpor ketika cetakan sedang dikonfigurasikan
zh_hans: 在配置模板时导入模板标签模块

source: The :class:`~django.template.backends.django.DjangoTemplates` backend now performs discovery on installed template tag modules when instantiated. This update enables libraries to be provided explicitly via the ``'libraries'`` key of :setting:`OPTIONS <TEMPLATES-OPTIONS>` when defining a :class:`~django.template.backends.django.DjangoTemplates` backend. Import or syntax errors in template tag modules now fail early at instantiation time rather than when a template with a :ttag:`{% load %}<load>` tag is first compiled.
id: Backend :class:`~django.template.backends.django.DjangoTemplates` sekarang melakukan penemuan pada modul etiket cetakan terpasang ketika diinstasiasikan. Perbaharuan ini mengadakan pustaka untuk disediakan jelas melalui kuncu ``'libraries'`` dari :setting:`OPTIONS <TEMPLATES-OPTIONS>` ketika menentukan sebuah backend :class:`~django.template.backends.django.DjangoTemplates` . Impor atau kesalahan sintaksis dalam modul etiket cetakan sekarang gagal awal pada waktu instasiasi daripada ketika sebuah cetakan dengan sebuah etiket :ttag:`{% load %}<load>` adalah pertama yang disusun.
zh_hans: :class:`~django.template.backends.django.DjangoTemplates` 后端现在在实例化时执行已安装的模板标签模块的发现。此更新使得在定义 :class:`~django.template.backends.django.DjangoTemplates` 后端时，可以通过 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 的 ``'libraries'`` 键明确提供库。模板标签模块中的导入或语法错误现在会在实例化时提前失败，而不是在首次编译带有 :ttag:`{% load %}<load>` 标签的模板时失败。

source: ``django.template.base.add_to_builtins()`` is removed
id: ``django.template.base.add_to_builtins()`` dipindahkan
zh_hans: 已删除 ``django.template.base.add_to_builtins()``。

source: Although it was a private API, projects commonly used ``add_to_builtins()`` to make template tags and filters available without using the :ttag:`{% load %}<load>` tag. This API has been formalized. Projects should now define built-in libraries via the ``'builtins'`` key of :setting:`OPTIONS <TEMPLATES-OPTIONS>` when defining a :class:`~django.template.backends.django.DjangoTemplates` backend.
id: Meskipun itu adalah API pribadi, proyek umumnya menggunakan ``add_to_builtins()`` untuk membuat etiket cetakan dan ketersedian penyaring tanpa menggunakan etiket :ttag:`{% load %}<load>`. API ini telah dirumuskan. Proyek harus sekarang menentukan pustaka siap-pakai melalui kunci ``'builtins'`` dari :setting:`OPTIONS <TEMPLATES-OPTIONS>` ketika menentukan backend :class:`~django.template.backends.django.DjangoTemplates`.
zh_hans: 虽然它是一个私有 API，但项目通常使用 ``add_to_builtins()`` 来使模板标签和过滤器在不使用 :ttag:`{% load %}<load>` 标签的情况下可用。这个 API 已经正式化。现在项目应该在定义 :class:`~django.template.backends.django.DjangoTemplates` 后端时，通过 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 的 ``'builtins'`` 键来定义内置库。

source: ``simple_tag`` now wraps tag output in ``conditional_escape``
id: ``simple_tag`` sekarang membungkus etiket keluaran di ``conditional_escape``
zh_hans: ``simple_tag`` 现在在标签输出中包装了 ``conditional_escape``

source: In general, template tags do not autoescape their contents, and this behavior is :ref:`documented <tags-auto-escaping>`. For tags like :class:`~django.template.Library.inclusion_tag`, this is not a problem because the included template will perform autoescaping. For ``assignment_tag()``, the output will be escaped when it is used as a variable in the template.
id: Secara umum, etiket cetakan tidak meloloskan otomatis isi mereka, dan perilaku ini adalah :ref:`documented <tags-auto-escaping>`. Untuk etiket-etiket seperti :class:`~django.template.Library.inclusion_tag`, ini adalah bukan sebuah masalah karena cetakan disertakan akan melakukan pelolosan otomatis. Untuk ``assignment_tag()``, keluaran akan diloloskan ketika itu adalah digunakan sebagai sebuah variabel di cetakan.
zh_hans: 通常，模板标签不会自动转义其内容，这种行为是被 :ref:`文档记录的 <tags-auto-escaping>`。对于像 :class:`~django.template.Library.inclusion_tag` 这样的标签，这不是问题，因为被包含的模板会执行自动转义。对于 ``assignment_tag()``，当它在模板中作为变量使用时，输出会被转义。

source: For the intended use cases of :class:`~django.template.Library.simple_tag`, however, it is very easy to end up with incorrect HTML and possibly an XSS exploit. For example::
id: Untuk kasus-kasus penggunaan yang diharapkan dari :class:`~django.template.Library.simple_tag`, bagaimanapun, itu adakah mudah mengakhiri dengan HTML yang tidak benar dan kemungkinan sebuah serangan XSS. Sebagai contoh::
zh_hans: 然而，对于 :class:`~django.template.Library.simple_tag` 的预期用例，很容易出现不正确的 HTML 和可能的 XSS 攻击。例如：

source: In older versions of Django, this will be an XSS issue because ``user.first_name`` is not escaped.
id: Di versi terlama dari Django, ini akan menjadi masalah XSS karena ``user.first_name`` tidak diloloskan.
zh_hans: 在较早版本的 Django 中，这将是一个 XSS 问题，因为``user.first_name`` 没有经过转义。
