Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: When reversing URLs, Django didn't apply ``django.utils.http.urlquote`` to arguments before interpolating them in URL patterns. This bug is fixed in Django 1.6. If you worked around this bug by applying URL quoting before passing arguments to ``reverse()``, this may result in double-quoting. If this happens, simply remove the URL quoting from your code. You will also have to replace special characters in URLs used in :func:`~django.test.SimpleTestCase.assertRedirects` with their encoded versions.
id: Ketika membalikkan URL, Django tidak memberlakukan ``django.utils.http.urlquote``pada argumen-argumen sebelum menyisipkan mereka dalam pola URL. Kesalahan ini diperbaiki di Django 1.6. Jika anda bekerja disekitar kesalahan ini dengan memberlakukan kutipan URL sebelum melewatkan argumen pada ``reverse()``, ini mungkin menghasilkan kutipan-ganda. Jika ini terjadi, cukup pindahkan kutipan URL dari kode anda. Ini akan juga mengganti karakter khusus dalam URL digunakan dalam :func:`~django.test.SimpleTestCase.assertRedirects` dengan versi tersandikan mereka.
zh_hans: 在反查 URL 时，Django 在将参数插入 URL 模式之前未应用 ``django.utils.http.urlquote``。这个 bug 在 Django 1.6 中已经修复。如果你之前通过在将参数传递给 ``reverse()`` 之前应用 URL 引用来解决这个问题，这可能导致双重引用。如果发生这种情况，请从你的代码中移除 URL 引用。你还需要将在 :func:`~django.test.SimpleTestCase.assertRedirects` 中使用的 URL 中的特殊字符替换为它们的编码版本。

source: Storage of IP addresses in the comments app
id: Penyimpanan dari alamat IP dalam aplikasi komentar
zh_hans: 在评论应用中存储 IP 地址

source: The comments app now uses a ``GenericIPAddressField`` for storing commenters' IP addresses, to support comments submitted from IPv6 addresses. Until now, it stored them in an ``IPAddressField``, which is only meant to support IPv4. When saving a comment made from an IPv6 address, the address would be silently truncated on MySQL databases, and raise an exception on Oracle. You will need to change the column type in your database to benefit from this change.
id: Aplikasi komentar sekarang menggunakan sebuah ``GenericIPAddressField`` untuk menyimpan alamat IP komentar, untuk mendukung komentar diajukan dari alamat IPv6. Sampai sekarang, itu menyimpan mereka di sebuah ``IPAddressField``, yang hanya berarti mendukung IPv4. Ketika menyimpan sebuah komentar yang dibuat dari alamat IPv6, alamat akan secara diam dipotong di basisdata MySQL, dan memunculkan sebuah pengecualian di Oracle. Anda akan butuh merubah jenis kolom di basisdata anda untuk mengambil keuntungan dari perubahan ini.
zh_hans: 评论应用现在使用 ``GenericIPAddressField`` 来存储评论者的IP地址，以支持从 IPv6 地址提交的评论。直到现在，它们是存储在 ``IPAddressField`` 中的，这个字段只支持 IPv4。当保存来自 IPv6 地址的评论时，在 MySQL 数据库上，该地址将被静默截断，并在 Oracle 上引发异常。你需要更改数据库中的列类型才能从这个更改中受益。

source: For MySQL, execute this query on your project's database:
id: Untuk MySQL, jalankan permintaan ini di basisdata proyek anda:
zh_hans: 对于 MySQL，在您的项目数据库上执行以下查询：

source: For Oracle, execute this query:
id: Untuk Oracle, jalankan permintaan ini:
zh_hans: 对于 Oracle，请执行以下查询：

source: If you do not apply this change, the behavior is unchanged: on MySQL, IPv6 addresses are silently truncated; on Oracle, an exception is generated. No database change is needed for SQLite or PostgreSQL databases.
id: Jika anda tidak memberlakukan perubahan ini, perilaku tidak berubah: di MySQL, alamat IPv6 secara diam dipotong; di Oracle, sebuah pengecualian dibangkitkan. Tidak ada perubahan basisdata dibutuhkan untuk basisdata SQLite atau PostgreSQL.
zh_hans: 如果您不应用此更改，行为将保持不变：在 MySQL 上，IPv6 地址会被静默截断；在 Oracle 上，会生成异常。对于 SQLite 或 PostgreSQL 数据库，不需要进行数据库更改。

source: Percent literals in ``cursor.execute`` queries
id: Harfiah persen di permintaan ``cursor.execute``
zh_hans: 在 ``cursor.execute`` 查询中的百分比文字面值

source: When you are running raw SQL queries through the :ref:`cursor.execute <executing-custom-sql>` method, the rule about doubling percent literals (``%``) inside the query has been unified. Past behavior depended on the database backend. Now, across all backends, you only need to double literal percent characters if you are also providing replacement parameters. For example::
id: Ketika anda sedang menjalankan permintaan SQL mentah melalui metode :ref:`cursor.execute <executing-custom-sql>`, aturan mengenai hardiah persen ganda (``%``) didalam permintaan telah kompak. Perilaku lama bergantung di backend basisdata. Sekarang, lintas semua backend, anda hanya butuh menggandakan karakter persen harfiah jika anda sedang juga menyediakan parameter pengganti. Sebagai contoh::
zh_hans: 当你通过 :ref:`cursor.execute <executing-custom-sql>` 方法运行原始 SQL 查询时，关于在查询内部加倍百分比文字面值（``%``）的规则已经统一。过去的行为取决于数据库后端。现在，在所有后端中，只有在你还提供替换参数的情况下，才需要加倍文字百分比字符。例如：

source: ``SQLite`` users need to check and update such queries.
id: Pengguna ``SQLite`` butuh memeriksa dan memperbaharui permintaan tersebut.
zh_hans: ``SQLite`` 用户需要检查和更新这样的查询。

source: Help text of model form fields for ManyToManyField fields
id: Teks bantuan dari bidang formulir model untuk bidang ManyToManyField
zh_hans: 对于 ManyToManyField 字段的模型表单字段的帮助文本。

source: HTML rendering of model form fields corresponding to :class:`~django.db.models.ManyToManyField` model fields used to get the hard-coded sentence:
id: Membangun HTML dari bidang formulir model sesuai pada bidang model :class:`~django.db.models.ManyToManyField` digunakan untuk mendapatkan kalimat kode-keras:
zh_hans: HTML 渲染模型表单字段，对应于用于获取硬编码句子的 :class:`~django.db.models.ManyToManyField` 模型字段：

source: *Hold down "Control", or "Command" on a Mac, to select more than one.*
id: *Tekan "Control", atau "Command" pada Mac, untuk memilih lebih dari satu.*
zh_hans: *按住 "Control" 键，或者在 Mac 上按住 "Command" 键，以选择多个选项。*

source: (or its translation to the active locale) imposed as the help legend shown along them if neither :attr:`model <django.db.models.Field.help_text>` nor :attr:`form <django.forms.Field.help_text>` ``help_text`` attributes were specified by the user (or this string was appended to any ``help_text`` that was provided).
id: (atau terjemahannya pada lokal aktif) dikenakan sebagai bantuan lagenda ditampilkan bersama mereka jika tak ada :attr:`model <django.db.models.Field.help_text>` maupun :attr:`form <django.forms.Field.help_text>` atribut ``help_text`` telah ditentukan oleh pengguna (atau string ini telah ditambahkan ke setiap ``help_text`` yang telah disediakan).
zh_hans: （或其翻译成活动语言环境的版本）将作为帮助提示显示在它们旁边，如果用户没有指定 :attr:`model <django.db.models.Field.help_text>` 或 :attr:`form <django.forms.Field.help_text>` ``help_text`` 属性（或者该字符串被附加到任何已提供的 ``help_text`` 中）。

source: Since this happened at the model layer, there was no way to prevent the text from appearing in cases where it wasn't applicable such as form fields that implement user interactions that don't involve a keyboard and/or a mouse.
id: Sejak ini terjadi di lapisan model, tidak ada cara mencegah teks dari muncul di kasus-kasus domana itu tidak berlaku seperti bidang formulir yang menerapkan interaksi pengguna yang anda tidak melibatkan papan kunci dan/atau sebuah tetikus.
zh_hans: 由于这发生在模型层，因此无法阻止文本在不适用的情况下出现，例如实现了不涉及键盘和/或鼠标的用户交互的表单字段。

source: Starting with Django 1.6, as an ad-hoc temporary backward-compatibility provision, the logic to add the "Hold down..." sentence has been moved to the model form field layer and modified to add the text only when the associated widget is :class:`~django.forms.SelectMultiple` or selected subclasses.
id: Dimulai dengan Django 1.6, sebagai sebuah ketentuan kesesuaian-kebelakang sementara ad-hoc, logika untuk menambahkan kalimat "Hold down..." telah dipindahkan ke lapisan bidang formulir model dan dirubah untuk menambahkan hanya teks ketika widget terkait adalah :class:`~django.forms.SelectMultiple` atau subkelas terpilih.
zh_hans: 从 Django 1.6 开始，作为临时的向后兼容性规定，添加 "按住..." 句子的逻辑已经移动到模型表单字段层，并修改为仅在关联的小部件为 :class:`~django.forms.SelectMultiple` 或其选定的子类时添加文本。

source: The change can affect you in a backward incompatible way if you employ custom model form fields and/or widgets for ``ManyToManyField`` model fields whose UIs do rely on the automatic provision of the mentioned hard-coded sentence. These form field implementations need to adapt to the new scenario by providing their own handling of the ``help_text`` attribute.
id: Perubahan ini dapat mempengaruhi anda di cara ketidaksesuaian kebelakang jika anda menggunakan bidang formulir model penyesuaian dan/atau widget untuk bidang model ``ManyToManyField`` yang UI nya bergantung pada ketentuan otomatis dari kalimat kode-kerasyang disebutkan. Penerapan bidang formulir ini butuh menyesuaikan ke skenario baru dengan menyediakan penanganan milik mereka dari atribut ``help_text``.
zh_hans: 如果您为依赖于提供的硬编码句子的自动方式的 ``ManyToManyField`` 模型字段使用自定义模型表单字段和/或小部件，这个变更可以以向后不兼容的方式影响您。这些表单字段实现需要适应新的情况，通过提供自己的处理 ``help_text`` 属性的方式来处理它。

source: Applications that use Django :doc:`model form </topics/forms/modelforms>` facilities together with Django built-in form :doc:`fields </ref/forms/fields>` and :doc:`widgets </ref/forms/widgets>` aren't affected but need to be aware of what's described in :ref:`m2m-help_text-deprecation` below.
id: Apliaksi yang menggunakan fasilitas :doc:`model form </topics/forms/modelforms>` Django bersama-sama dengan formulir siap-pakai Django :doc:`fields </ref/forms/fields>` dan :doc:`widgets </ref/forms/widgets>` tidak terpengaruh tetapi butuh disadari dari apa digambarkan dalam :ref:`m2m-help_text-deprecation` dibawah.
zh_hans: 使用 Django :doc:`模型表单 </topics/forms/modelforms>` 功能以及 Django 内置的表单 :doc:`字段 </ref/forms/fields>` 和 :doc:`小部件 </ref/forms/widgets>` 的应用不受影响，但需要注意下面 :ref:`m2m-help_text-deprecation` 中描述的内容。

source: QuerySet iteration
id: Perulangan QuerySet
zh_hans: QuerySet 迭代

source: The ``QuerySet`` iteration was changed to immediately convert all fetched rows to ``Model`` objects. In Django 1.5 and earlier the fetched rows were converted to ``Model`` objects in chunks of 100.
id: Perulangan ``QuerySet`` telah berubah untuk segera merubah semua baris yang diambil pada obyek ``Model``. Di Django 1.5 dan lebih awal untuk mengambil baris telah dirubah ke obyek ``Model`` dalam 100 potongan.
zh_hans: ``QuerySet`` 的迭代方式已更改为立即将所有检索到的行转换为 ``Model`` 对象。在 Django 1.5 及之前，检索到的行是以 100 行为单位转换为 ``Model`` 对象的。

source: Existing code will work, but the amount of rows converted to objects might change in certain use cases. Such usages include partially looping over a queryset or any usage which ends up doing ``__bool__`` or ``__contains__``.
id: Kode yang ada akan bekerja, tetapi sejumlah baris dirubah ke obyek mungkin berubah dalam kasus penggunaan tertentu. Penggunaan seperti itu termasuk sebagian berulang terhadap sebuah queryset atau penggunaan apapun yang mengakhiri melakukan ``__bool__`` atau ``__contains__``.
zh_hans: 现有的代码将正常工作，但在某些用例中，转换为对象的行数可能会发生变化。这些用法包括部分遍历查询集或任何最终执行 ``__bool__`` 或 ``__contains__`` 操作的用法。

source: Notably most database backends did fetch all the rows in one go already in 1.5.
id: Terutama kebanyakan backend basisdata melakukan pengambilan semua baris dalam satu pergi sudah di 1.5.
zh_hans: 值得注意的是，大多数数据库后端在 1.5 版本中已经一次性获取了所有行。

source: It is still possible to convert the fetched rows to ``Model`` objects lazily by using the :meth:`~django.db.models.query.QuerySet.iterator()` method.
id: Itu masih memungkinkan merubah barisan diambil pada obyek ``Model`` lazily dengan menggunakan metode :meth:`~django.db.models.query.QuerySet.iterator()`.
zh_hans: 仍然可以通过使用 :meth:`~django.db.models.query.QuerySet.iterator()` 方法来惰性地将检索到的行转换为 ``Model`` 对象。

source: :meth:`BoundField.label_tag<django.forms.BoundField.label_tag>` now includes the form's :attr:`~django.forms.Form.label_suffix`
id: :meth:`BoundField.label_tag<django.forms.BoundField.label_tag>` sekarang menyertakan :attr:`~django.forms.Form.label_suffix` formulir
zh_hans: :meth:`BoundField.label_tag<django.forms.BoundField.label_tag>` 现在包括表单的 :attr:`~django.forms.Form.label_suffix`

source: This is consistent with how methods like :meth:`Form.as_p<django.forms.Form.as_p>` and :meth:`Form.as_ul<django.forms.Form.as_ul>` render labels.
id: Ini adalah konsisten dengan bagaimana metode seperti :meth:`Form.as_p<django.forms.Form.as_p>` dan :meth:`Form.as_ul<django.forms.Form.as_ul>` membangun label.
zh_hans: 这与 :meth:`Form.as_p<django.forms.Form.as_p>` 和 :meth:`Form.as_ul<django.forms.Form.as_ul>` 等方法呈现标签的方式保持一致。

source: If you manually render ``label_tag`` in your templates:
id: Jika anda secara manual membangun ``label_tag`` dalam cetakan anda:
zh_hans: 如果您在模板中手动呈现 ``label_tag``：

source: you'll want to remove the colon (or whatever other separator you may be using) to avoid duplicating it when upgrading to Django 1.6. The following template in Django 1.6 will render identically to the above template in Django 1.5, except that the colon will appear inside the ``<label>`` element.
id: anda akan ingin memindahkan titik dua (atau apapun pemisah lainnya anda mungkin gunakan) untuk menghindari penggandaan itu ketika meningkatkan ke Django 1.6. Cetakan berikut di Django 1.6 akan membangun secara mirip ke cetakan diatas di Django 1.5, kecuali bahwa titik koma akan muncul didalam unsur ``<label>``.
zh_hans: 在升级到 Django 1.6 时，你需要移除冒号（或你可能使用的任何其他分隔符），以避免重复。以下 Django 1.6 中的模板与 Django 1.5 中的上述模板渲染效果相同，只是冒号会出现在 ``<label>`` 元素内部。

source: will render something like:
id: akan membangun sesuatu seperti:
zh_hans: 将呈现类似于：

source: If you want to keep the current behavior of rendering ``label_tag`` without the ``label_suffix``, instantiate the form ``label_suffix=''``. You can also customize the ``label_suffix`` on a per-field basis using the new ``label_suffix`` parameter on :meth:`~django.forms.BoundField.label_tag`.
id: Jika anda ingin menjaga perilaku saat ini dari membangun ``label_tag`` tanpa ``label_suffix``, instatiate formulir ``label_suffix=''``. Anda dapat juga menyesuaikan ``label_suffix`` di berdasarkan per-bidang menggunakan parameter ``label_suffix`` baru di :meth:`~django.forms.BoundField.label_tag`.
zh_hans: 如果您想保留呈现不带 ``label_suffix`` 的 ``label_tag`` 的当前行为，请实例化表单时使用 ``label_suffix=''``。您还可以使用 :meth:`~django.forms.BoundField.label_tag` 上的新 ``label_suffix`` 参数来根据每个字段进行自定义。

source: Admin views ``_changelist_filters`` GET parameter
id: Tampilan admin parameter GET ``_changelist_filters``
zh_hans: 管理员视图 ``_changelist_filters`` GET 参数

source: To achieve preserving and restoring list view filters, admin views now pass around the ``_changelist_filters`` GET parameter. It's important that you account for that change if you have custom admin templates or if your tests rely on the previous URLs. If you want to revert to the original behavior you can set the :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` attribute to ``False``.
zh_hans: 为了保留和恢复列表视图过滤器，管理员视图现在传递 ``_changelist_filters`` GET 参数。如果您有自定义的管理员模板或者您的测试依赖于以前的URL，请确保考虑到这个变化。如果您想恢复到原始行为，您可以将 :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` 属性设置为 ``False``。

source: ``django.contrib.auth`` password reset uses base 64 encoding of ``User`` PK
id: Penyetelan kembali sandi ``django.contrib.auth`` menggunakan pengkodean berbasis 64 dari PK ``User``
zh_hans: ``django.contrib.auth`` 密码重置使用了对 ``User`` 主键（PK）的 Base64 编码。

source: Past versions of Django used base 36 encoding of the ``User`` primary key in the password reset views and URLs (``django.contrib.auth.views.password_reset_confirm()``). Base 36 encoding is sufficient if the user primary key is an integer, however, with the introduction of custom user models in Django 1.5, that assumption may no longer be true.
zh_hans: Django 的过去版本在密码重置视图和URLs（``django.contrib.auth.views.password_reset_confirm()``）中使用了 ``User`` 主键的 Base 36 编码。Base 36 编码对于用户主键是整数的情况足够了，然而，随着 Django 1.5 中引入自定义用户模型，这个假设可能不再成立。

source: ``django.contrib.auth.views.password_reset_confirm()`` has been modified to take a ``uidb64`` parameter instead of ``uidb36``. If you are reversing this view, for example in a custom ``password_reset_email.html`` template, be sure to update your code.
zh_hans: ``django.contrib.auth.views.password_reset_confirm()`` 已经修改为接受 ``uidb64`` 参数，而不是 ``uidb36``。如果您需要反向这个视图，例如在自定义的 ``password_reset_email.html`` 模板中，请确保更新您的代码。

source: A temporary shim for ``django.contrib.auth.views.password_reset_confirm()`` that will allow password reset links generated prior to Django 1.6 to continue to work has been added to provide backwards compatibility; this will be removed in Django 1.7. Thus, as long as your site has been running Django 1.6 for more than ``PASSWORD_RESET_TIMEOUT_DAYS``, this change will have no effect. If not (for example, if you upgrade directly from Django 1.5 to Django 1.7), then any password reset links generated before you upgrade to Django 1.7 or later won't work after the upgrade.
zh_hans: 为了提供向后兼容性，已经添加了一个临时的 shim，用于允许在 Django 1.6 之前生成的密码重置链接继续工作；这将在 Django 1.7 中被移除。因此，只要您的站点在 Django 1.6 上运行的时间超过了 ``PASSWORD_RESET_TIMEOUT_DAYS``，这个变化将不会产生影响。如果不是这样（例如，如果您直接从 Django 1.5 升级到 Django 1.7），那么在升级后，任何在升级到 Django 1.7 或更高版本之前生成的密码重置链接将在升级后不起作用。

source: In addition, if you have any custom password reset URLs, you will need to update them by replacing ``uidb36`` with ``uidb64`` and the dash that follows that pattern with a slash. Also add ``_\-`` to the list of characters that may match the ``uidb64`` pattern.
id: Sebagai tambahan, jika anda mempunyai apapun penyesuaian URL setel kembali sandi, anda akan butuh memperbaharui mereka dengan mengganti ``uidb36`` dengan ``uidb64`` dan tanda garis yang mengikuti pola dengan sebuah garis miring. Juga tambah ``_\-`` ke daftar dari karakter yang mungkin cocok dengan pola ``uidb64``.
zh_hans: 此外，如果您有任何自定义密码重置的URL，您需要通过将 ``uidb36`` 替换为 ``uidb64`` 并将跟随该模式的短划线替换为斜杠来更新它们。还要将 ``_\-`` 添加到可能与 ``uidb64`` 模式匹配的字符列表中。

source: For example::
id: Sebagai contoh::
zh_hans: 例子：

source: You may also want to add the shim to support the old style reset links. Using the example above, you would modify the existing url by replacing ``django.contrib.auth.views.password_reset_confirm`` with ``django.contrib.auth.views.password_reset_confirm_uidb36`` and also remove the ``name`` argument so it doesn't conflict with the new url::
id: Anda mungkin juga ingin menambahkan shim untuk mendukung gaya lama tautan setel kembali. Menggunakan contoh diatas, anda akan merubah url yang ada dengan mengganti ``django.contrib.auth.views.password_reset_confirm`` dengan ``django.contrib.auth.views.password_reset_confirm_uidb36`` dan juga memindahkan argumen ``name`` jadi itu tidak bertentangan dengan url baru::
zh_hans: 您可能还希望添加 shim 来支持旧式的重置链接。使用上面的示例，您可以通过将现有的 URL 中的 ``django.contrib.auth.views.password_reset_confirm`` 替换为 ``django.contrib.auth.views.password_reset_confirm_uidb36``，并删除 ``name`` 参数，以防止与新的 URL 冲突：

source: You can remove this URL pattern after your app has been deployed with Django 1.6 for ``PASSWORD_RESET_TIMEOUT_DAYS``.
zh_hans: 在您的应用程序在 Django 1.6 上部署了超过 ``PASSWORD_RESET_TIMEOUT_DAYS`` 后，您可以删除这个 URL 模式。

source: Default session serialization switched to JSON
id: Serialisasi sesi awalan diganti ke JSON
zh_hans: 默认会话序列化方式切换为 JSON

source: Historically, :mod:`django.contrib.sessions` used :mod:`pickle` to serialize session data before storing it in the backend. If you're using the :ref:`signed cookie session backend<cookie-session-backend>` and :setting:`SECRET_KEY` is known by an attacker (there isn't an inherent vulnerability in Django that would cause it to leak), the attacker could insert a string into their session which, when unpickled, executes arbitrary code on the server. The technique for doing so is simple and easily available on the internet. Although the cookie session storage signs the cookie-stored data to prevent tampering, a :setting:`SECRET_KEY` leak immediately escalates to a remote code execution vulnerability.
zh_hans: 在历史上，:mod:`django.contrib.sessions` 使用 :mod:`pickle` 来序列化会话数据，然后将其存储在后端。如果您使用 :ref:`签名的 Cookie 会话后端 <cookie-session-backend>`，并且 :setting:`SECRET_KEY` 已知于攻击者（Django 本身没有固有的漏洞会导致其泄漏），攻击者可以在其会话中插入一个字符串，当反序列化时，会在服务器上执行任意代码。执行此操作的技术非常简单，且在互联网上很容易找到。尽管 Cookie 会话存储使用签名来防止篡改存储在 Cookie 中的数据，但如果 :setting:`SECRET_KEY` 泄漏，会立即升级为远程代码执行漏洞。

source: This attack can be mitigated by serializing session data using JSON rather than :mod:`pickle`. To facilitate this, Django 1.5.3 introduced a new setting, :setting:`SESSION_SERIALIZER`, to customize the session serialization format. For backwards compatibility, this setting defaulted to using :mod:`pickle` in Django 1.5.3, but we've changed the default to JSON in 1.6. If you upgrade and switch from pickle to JSON, sessions created before the upgrade will be lost. While JSON serialization does not support all Python objects like :mod:`pickle` does, we highly recommend using JSON-serialized sessions. Be aware of the following when checking your code to determine if JSON serialization will work for your application:
id: Serangan ini dapat diredakan dengan menserialkan data sesi menggunakan JSON daripada :mod:`pickle`. Untuk menfasilitasi ini, Django 1.5.3 memperkenalkan pengaturan baru, :setting:`SESSION_SERIALIZER`, untuk menyesuaikan bentuk serialisasi sesi. Untuk kesesuaian kebelakang, awalan pengaturan ini menggunakan :mod:`pickle` di Django 1.5.3, tetapi kami telah merubah awalan ke JSOn di 1.6. Jika anda meningkatkan dan mengganti dari pickle ke JSON, sesi dibuat sebelum peningkatan akan hilang. Selagi serialisasi JSON tidak mendukung semua obyek Python seperti :mod:`pickle` lakukan, kami sangat menganjurkan menggunakan sesi serialisasi-JSON. Waspada dari berikut ketika memeriksa kode anda untuk menentukan jika serialisasi JSON akan bekerja untuk aplikasi anda:
zh_hans: 这种攻击可以通过使用 JSON 而不是 :mod:`pickle` 来序列化会话数据来减轻。为了实现这一点，Django 1.5.3 引入了一个新的设置，:setting:`SESSION_SERIALIZER`，用于自定义会话序列化格式。为了向后兼容，Django 1.5.3 中默认使用 :mod:`pickle`，但在 1.6 中我们将默认值更改为 JSON。如果您升级并从 pickle 切换到 JSON，升级之前创建的会话将丢失。虽然 JSON 序列化不支持所有像 :mod:`pickle` 那样的 Python 对象，但我们强烈建议使用 JSON 序列化的会话。在检查您的代码以确定 JSON 序列化是否适用于您的应用程序时，请注意以下内容：

source: JSON requires string keys, so you will likely run into problems if you are using non-string keys in ``request.session``.
id: JSON membutuhkan kunci string, jadi anda kemungkinan akan berjalan kedalam masalah jika anda sedang menggunakan kunci bukan-string di ``request.session``.
zh_hans: JSON 要求使用字符串键，因此如果您在 ``request.session`` 中使用非字符串键，则可能会遇到问题。

source: Setting session expiration by passing ``datetime`` values to :meth:`~django.contrib.sessions.backends.base.SessionBase.set_expiry` will not work as ``datetime`` values are not serializable in JSON. You can use integer values instead.
id: Setel kadaluarsa sesi dengan melewatkan nilai ``datetime`` ke :meth:`~django.contrib.sessions.backends.base.SessionBase.set_expiry` akan tidak bekerja seperti nilai ``datetime`` adalah tidak dapat serialisasi di JSON. Anda dapat menggunakan nilai integer sebagai gantinya.
zh_hans: 通过将 ``datetime`` 值传递给 :meth:`~django.contrib.sessions.backends.base.SessionBase.set_expiry` 来设置会话到期时间将不起作用，因为 ``datetime`` 值在 JSON 中无法序列化。您可以改为使用整数值。

source: See the :ref:`session_serialization` documentation for more details.
id: Lihat dokumentasi :ref:`session_serialization` untuk lebih rinci.
zh_hans: 请查看 :ref:`session_serialization` 文档以获取更多详细信息。

source: Object Relational Mapper changes
id: Perubahan Object Relational Mapper
zh_hans: 对象关系映射器（ORM）的变更

source: Django 1.6 contains many changes to the ORM. These changes fall mostly in three categories:
id: Django 1.6 mengandung banyak perubahan pada ORM. Perubahan ini dibagi menjadi tiga kategori:
zh_hans: Django 1.6 包含了许多 ORM 的变更。这些变更主要可以分为三个类别：

source: Bug fixes (e.g. proper join clauses for generic relations, query combining, join promotion, and join trimming fixes)
id: Perbaikan kesalahan (sebagai contoh klausa join benar untuk hubungan umum, memadukan permintaan, kenaikan join, dan perbaikan memotong join)
zh_hans: 错误修复（例如，针对通用关系的正确连接子句、查询合并、连接提升和连接修剪的修复）
