Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: In order to prevent exposure to denial-of-service attacks related to external entity references and entity expansion, the XML model deserializer now refuses to parse XML documents containing a DTD (DOCTYPE definition). Since the XML serializer does not output a DTD, this will not impact typical usage, only cases where custom-created XML documents are passed to Django's model deserializer.
id: Untuk mencegah pembukaan pada serangan denial-of-service terkait pada acuan entitas eksternal dan perpanjangan entitas, deserial model XML sekarang menolak mengurai XML dokumen mengandung sebuah DTD (DOCTYPE definition). Sejak penserial XML tidak mengeluarkan DTD, ini tidak akan berdampak penggunaan khusus, hanya kasus-kasus dimana dokumen XML dibuat-penyesuaian yang dilewatkan ke deserial model Django .
zh_hans: 为了防止与外部实体引用和实体扩展相关的拒绝服务攻击，XML 模型反序列化器现在拒绝解析包含 DTD（DOCTYPE 定义）的 XML 文档。由于 XML 序列化器不输出 DTD，这只会影响传递给 Django 模型反序列化器的自定义创建的 XML 文档，而不会影响典型的用法。

source: Formsets default ``max_num``
id: Awalan formset ``max_num``
zh_hans: Formsets 的默认 ``max_num`` 值

source: A (default) value of ``None`` for the ``max_num`` argument to a formset factory no longer defaults to allowing any number of forms in the formset. Instead, in order to prevent memory-exhaustion attacks, it now defaults to a limit of 1000 forms. This limit can be raised by explicitly setting a higher value for ``max_num``.
id: Sebuah nilai (awalan) dari ``None`` untuk argumen ``max_num`` pada pabrik formset awalan tidak lagi untuk mengizinkan angka apapun dari formulir di formset. Malahan, untuk mencegah serangan kelelahan-memori, itu sekarang awalan ke batasan dari 1000 formulir. Batasan ini dapat dimunculkan dengan tegas mengatur nilai tertinggi untuk ``max_num``.
zh_hans: 表单集工厂的 ``max_num`` 参数的默认值为 ``None`` 不再默认允许表单集中的任意数量的表单。相反，为了防止内存耗尽攻击，它现在默认为限制为 1000 个表单。可以通过显式设置更高的 ``max_num`` 值来提高此限制。

source: :class:`django.forms.ModelMultipleChoiceField` now returns an empty ``QuerySet`` as the empty value instead of an empty list.
id: :class:`django.forms.ModelMultipleChoiceField` sekarang mengembalikan sebuah ``QuerySet`` kosong sebagai nilai kosong daripada sebuah daftar kosong.
zh_hans: :class:`django.forms.ModelMultipleChoiceField` 现在将空的 ``QuerySet`` 作为空值返回，而不是空列表。

source: :func:`~django.utils.http.int_to_base36` properly raises a :exc:`TypeError` instead of :exc:`ValueError` for non-integer inputs.
id: :func:`~django.utils.http.int_to_base36` sebagaimana mestinya memunculkan :exc:`TypeError` sebagai gantinya dari :exc:`ValueError` untuk masukan bukan-integer
zh_hans: :func:`~django.utils.http.int_to_base36` 对于非整数输入现在会正确引发 :exc:`TypeError`，而不是 :exc:`ValueError`。

source: The ``slugify`` template filter is now available as a standard Python function at :func:`django.utils.text.slugify`. Similarly, ``remove_tags`` is available at ``django.utils.html.remove_tags()``.
zh_hans: 模板过滤器中的 ``slugify`` 现在作为标准的 Python 函数在 :func:`django.utils.text.slugify` 中可用。同样，``remove_tags`` 在 ``django.utils.html.remove_tags()`` 中也可用。

source: Uploaded files are no longer created as executable by default. If you need them to be executable change :setting:`FILE_UPLOAD_PERMISSIONS` to your needs. The new default value is ``0o666`` (octal) and the current umask value is first masked out.
id: Berkas-berkas terunggah tidak lagi dibuat sebagai dapat dijalankan secara awalan. Jika anda butuh mereka untuk menjadi dapat dijalankan rubah :setting:`FILE_UPLOAD_PERMISSIONS` ke kebutuhan anda. Nilai awalan baru adalah ``0o666`` (octal) dan nilai umask saat ini adalah pertama yang disembunyikan.
zh_hans: 上传的文件不再默认创建为可执行文件。如果需要它们成为可执行文件，请更改 :setting:`FILE_UPLOAD_PERMISSIONS` 以满足您的需求。新的默认值是 ``0o666`` （八进制），并且当前的掩码值首先被掩码掉。

source: The :class:`F expressions <django.db.models.F>` supported bitwise operators by ``&`` and ``|``. These operators are now available using ``.bitand()`` and ``.bitor()`` instead. The removal of ``&`` and ``|`` was done to be consistent with :ref:`Q() expressions <complex-lookups-with-q>` and ``QuerySet`` combining where the operators are used as boolean AND and OR operators.
id: :class:`F expressions <django.db.models.F>` mendukung penghubung bitwise berdasarkan ``&`` and ``|``. Penghubung ini sekarang tersedia menggunakan ``.bitand()`` and ``.bitor()``. Perpindahan dari ``&`` and ``|`` telah selesai untuk menjadi tetap dengan :ref:`Q() expressions <complex-lookups-with-q>` dan ``QuerySet`` memadukan dimana penghubung digunakan sebagai boolean penghubung AND dan OR.
zh_hans: :class:`F 表达式 <django.db.models.F>` 支持位运算符 ``&`` 和 ``|``。现在，可以使用 ``.bitand()`` 和 ``.bitor()`` 来代替这些运算符。移除 ``&`` 和 ``|`` 是为了与 :ref:`Q() 表达式 <complex-lookups-with-q>` 和 ``QuerySet`` 结合使用时保持一致，其中这些运算符被用作布尔 AND 和 OR 运算符。

source: In a ``filter()`` call, when :class:`F expressions <django.db.models.F>` contained lookups spanning multi-valued relations, they didn't always reuse the same relations as other lookups along the same chain. This was changed, and now F() expressions will always use the same relations as other lookups within the same ``filter()`` call.
id: Dalam panggilan ``filter()``, ketika :class:`F expressions <django.db.models.F>` mengandung pencarian mencangkup hubungan banyak-nilai, mereka tidak selalu menggunakan kembali hubungan sama sebagai pencarian lain bersama rantai sama. Ini telah berubah, dan sekarang pernyataan F() akan selalu menggunakan hubungan sama sebagai pencarian lain dalam panggilan ``filter()`` yang sama
zh_hans: 在 ``filter()`` 调用中，当 :class:`F 表达式 <django.db.models.F>` 包含跨多值关联的查找时，它们并不总是重用与同一链中其他查找相同的关联。这已经发生了变化，现在 F() 表达式将始终与同一 ``filter()`` 调用中的其他查找使用相同的关联。

source: The :ttag:`csrf_token` template tag is no longer enclosed in a div. If you need HTML validation against pre-HTML5 Strict DTDs, you should add a div around it in your pages.
id: Etiket cetakan :ttag:`csrf_token` tidak lagi tertutup di sebuah div. Jika anda butuh pengesahan HTML terhadap pra=HTML5 Strict DTD, anda harus menambahkan sebuah div disekitarnya di halaman anda.
zh_hans: :ttag:`csrf_token` 模板标签不再包含在一个 div 中。如果您需要针对 HTML5 之前的 Strict DTD 进行 HTML 验证，您应该在页面中添加一个 div。

source: The template tags library ``adminmedia``, which only contained the deprecated template tag ``{% admin_media_prefix %}``, was removed. Attempting to load it with ``{% load adminmedia %}`` will fail. If your templates still contain that line you must remove it.
id: Pustaka cetakan etiket ``adminmedia``, yang hanya mengandung etiket etakan diusangkan ``{% admin_media_prefix %}``, telah dipindahkan. Berusaha memuat itu dengan ``{% load adminmedia %}`` akan gagal. Jika cetakan anda masih mengandung baris itu anda harus memindahkannya.
zh_hans: 已删除模板标签库 ``adminmedia``，它只包含了已弃用的模板标签 ``{% admin_media_prefix %}``。尝试使用 ``{% load adminmedia %}`` 加载它将会失败。如果您的模板仍然包含该行代码，您必须将其删除。

source: Because of an implementation oversight, it was possible to use :doc:`django.contrib.redirects </ref/contrib/redirects>` without enabling :doc:`django.contrib.sites </ref/contrib/sites>`. This isn't allowed any longer. If you're using ``django.contrib.redirects``, make sure :setting:`INSTALLED_APPS` contains ``django.contrib.sites``.
id: Karena kelalaian penerapan , itu memungkinkan menggunakan :doc:`django.contrib.redirects </ref/contrib/redirects>` tanpa mengadakan :doc:`django.contrib.sites </ref/contrib/sites>`. Ini tidak diizinkan lagi. Jika anda sedang menggunakan ``django.contrib.redirects``, pastikan :setting:`INSTALLED_APPS` mengandung ``django.contrib.sites``.
zh_hans: 由于一个实现上的疏忽，以前可以在没有启用 :doc:`django.contrib.sites </ref/contrib/sites>` 的情况下使用 :doc:`django.contrib.redirects </ref/contrib/redirects>`。现在不再允许这样做了。如果您正在使用 ``django.contrib.redirects``，请确保 :setting:`INSTALLED_APPS` 包含 ``django.contrib.sites``。

source: :meth:`BoundField.label_tag <django.forms.BoundField.label_tag>` now escapes its ``contents`` argument. To avoid the HTML escaping, use :func:`django.utils.safestring.mark_safe` on the argument before passing it.
id: :meth:`BoundField.label_tag <django.forms.BoundField.label_tag>` sekarang meloloskan argumen ``contents`` nya. Untuk menghindari pelolosan HTML, gunakan :func:`django.utils.safestring.mark_safe` pada argumen sebelum melewatkannya.
zh_hans: :meth:`BoundField.label_tag <django.forms.BoundField.label_tag>` 现在会对其 ``contents`` 参数进行 HTML 转义。要避免 HTML 转义，可以在传递参数之前使用 :func:`django.utils.safestring.mark_safe`。

source: Accessing reverse one-to-one relations fetched via :meth:`~django.db.models.query.QuerySet.select_related` now raises :exc:`~django.db.models.Model.DoesNotExist` instead of returning ``None``.
id: Mengakses pembalikan hubungan one-to-one diambil melalui :meth:`~django.db.models.query.QuerySet.select_related` sekarang memunculkan :exc:`~django.db.models.Model.DoesNotExist` dari pada mengembalikan ``None``.
zh_hans: 通过 :meth:`~django.db.models.query.QuerySet.select_related` 获取的反向一对一关系现在会引发 :exc:`~django.db.models.Model.DoesNotExist` 异常，而不是返回 ``None``。

source: Features deprecated in 1.5
id: Fitur usang di 1.5
zh_hans: 在 1.5 中被废弃的功能

source: The localflavor contrib app has been split into separate packages. ``django.contrib.localflavor`` itself will be removed in Django 1.6, after an accelerated deprecation.
id: Aplikasi bantuan localfalvor telah dipisah menjadi paket-paket berbeda. ``django.contrib.localflavor`` itu sendiri akan dipindahkan di Django 1.6, setelah mempercepat pengusangan.
zh_hans: localflavor 贡献应用程序已分成单独的包。``django.contrib.localflavor`` 本身将在 Django 1.6 中移除，经过加速的弃用期。

source: The new packages are available on GitHub. The core team cannot efficiently maintain these packages in the long term — it spans just a dozen countries at this time; similar to translations, maintenance will be handed over to interested members of the community.
zh_hans: 新的软件包已在 GitHub 上提供。核心团队无法长期高效地维护这些软件包 - 目前仅覆盖了几个国家；与翻译类似，维护工作将移交给感兴趣的社区成员。

source: The markup contrib module has been deprecated and will follow an accelerated deprecation schedule. Direct use of Python markup libraries or 3rd party tag libraries is preferred to Django maintaining this functionality in the framework.
id: Modul bantuan markah telah diusangkan dan akan mengikuti jadwal pengusangan dipercepat. Penggunaan langsung dari pustaka markah Python atau pustaka etiket pihak ketiga dipilih untuk Django merawat kegunaan ini di kerangka kerja.
zh_hans: markup contrib 模块已被弃用，并将按照加速弃用计划进行处理。直接使用 Python 标记库或第三方标签库比 Django 在框架中维护此功能更受推荐。

source: With the introduction of :ref:`custom user models <auth-custom-user>`, there is no longer any need for a built-in mechanism to store user profile data.
id: Dengan perkenalan dari :ref:`custom user models <auth-custom-user>`, tidak lagi butuh untuk mekanisme siap-pakai untuk menyimpan data prodil pengguna.
zh_hans: 引入 :ref:`自定义用户模型 <auth-custom-user>` 后，不再需要内置机制来存储用户配置文件数据。

source: You can still define user profiles models that have a one-to-one relation with the User model - in fact, for many applications needing to associate data with a User account, this will be an appropriate design pattern to follow. However, the ``AUTH_PROFILE_MODULE`` setting, and the ``django.contrib.auth.models.User.get_profile()`` method for accessing the user profile model, should not be used any longer.
id: Anda dapat masih menentukan model profil pengguna yang mempunyai hubungan one-to-one dengan model User - sebenarnya, untuk banyak aplikasi dibutuhkan untuk data terhubung dengan akun User, ini akan menjadi sebuah pola rancangan sesuai untuk diikuti. Bagaimanapun, pengaturan ``AUTH_PROFILE_MODULE``, dan metode ``django.contrib.auth.models.User.get_profile()`` untuk mengakses model profil pengguna, tidak boleh digunakan lagi.
zh_hans: 您仍然可以定义与用户模型具有一对一关系的用户配置文件模型 - 实际上，对于许多需要将数据与用户帐户关联的应用程序，这将是一个适当的设计模式。然而，不再应使用 ``AUTH_PROFILE_MODULE`` 设置以及用于访问用户配置文件模型的 ``django.contrib.auth.models.User.get_profile()`` 方法。

source: Streaming behavior of :class:`~django.http.HttpResponse`
id: Mengalirkan perilaku dari :class:`~django.http.HttpResponse`
zh_hans: :class:`~django.http.HttpResponse` 的流式传输行为

source: Django 1.5 deprecates the ability to stream a response by passing an iterator to :class:`~django.http.HttpResponse`. If you rely on this behavior, switch to :class:`~django.http.StreamingHttpResponse`. See :ref:`explicit-streaming-responses` above.
id: Django 1.5 mengusangkan kemampuan mengalirkan tanggapan dengan melewatkan perulangan pada :class:`~django.http.HttpResponse`. Jika anda bergantung pada perilaku ini, ganti ke :class:`~django.http.StreamingHttpResponse`. Lihat :ref:`explicit-streaming-responses` diatas.
zh_hans: Django 1.5 不再支持通过将迭代器传递给 :class:`~django.http.HttpResponse` 来流式传输响应的能力。如果您依赖此行为，请切换到 :class:`~django.http.StreamingHttpResponse`。请参阅 :ref:`explicit-streaming-responses`。

source: In Django 1.7 and above, the iterator will be consumed immediately by :class:`~django.http.HttpResponse`.
id: Dalam Django 1.7 dan diatas, perulangan akan memakan segera oleh :class:`~django.http.HttpResponse`.
zh_hans: 在 Django 1.7 及以上版本中，迭代器将立即被 :class:`~django.http.HttpResponse` 消耗。

source: Since Django 1.5 drops support for Python 2.5, we can now rely on the :mod:`json` module being available in Python's standard library, so we've removed our own copy of ``simplejson``. You should now import :mod:`json` instead of ``django.utils.simplejson``.
id: Sejak Django 1.5 menjatuhkan dukungan untuk Python 2.5, kami sekarang dapat bergantung pada modul :mod:`json` sedang tersedia di pustaka standar Python, jadi kami telah memindahkan salinan kami sendiri dari ``simplejson``. Anda harus sekarang mengimpor :mod:`json` dari pada ``django.utils.simplejson``.
zh_hans: 由于 Django 1.5 不再支持 Python 2.5，我们现在可以依赖于 Python 标准库中的 :mod:`json` 模块，因此我们已经移除了我们自己的 ``simplejson`` 副本。您现在应该导入 :mod:`json`，而不是 ``django.utils.simplejson``。

source: Unfortunately, this change might have unwanted side-effects, because of incompatibilities between versions of ``simplejson`` -- see the :ref:`backwards-incompatible changes <simplejson-incompatibilities>` section. If you rely on features added to ``simplejson`` after it became Python's :mod:`json`, you should import ``simplejson`` explicitly.
id: Sayangnya, perubahan ini mungkin mempunyai pengaruh yang tidak diinginkan, karena ketidaksesuaian diantara versi dari ``simplejson`` -- lihat bagian :ref:`backwards-incompatible changes <simplejson-incompatibilities>`. Jika anda bergantung pada fitur-fitur yang ditambahkan pada ``simplejson`` setelahnya menjadi :mod:`json` Python, anda harus mengimpor ``simplejson`` dengan tegas.
zh_hans: 不幸的是，这个改变可能会产生意想不到的副作用，因为不同版本的 ``simplejson`` 之间存在不兼容性，详见 :ref:`不兼容变更 <simplejson-incompatibilities>` 部分。如果您依赖于在它成为 Python 的 :mod:`json` 之后添加到 ``simplejson`` 的功能，您应该显式导入 ``simplejson``。

source: The ``django.utils.encoding.StrAndUnicode`` mix-in has been deprecated. Define a ``__str__`` method and apply the ``django.utils.encoding.python_2_unicode_compatible`` decorator instead.
zh_hans: ``django.utils.encoding.StrAndUnicode`` 混合类已被弃用。应该定义一个 ``__str__`` 方法，并应用 ``django.utils.encoding.python_2_unicode_compatible`` 装饰器。

source: The ``django.utils.itercompat.product`` function has been deprecated. Use the built-in :func:`itertools.product` instead.
id: Fungsi ``django.utils.itercompat.product`` telah diusangkan. Gunakan :func:`itertools.product` siap-pakai sebagai gantinya.
zh_hans: ``django.utils.itercompat.product`` 函数已被弃用。应该使用内置的 :func:`itertools.product`。

source: ``cleanup`` management command
id: perintah pengelolaan ``pembersihan``
zh_hans: ``cleanup`` 管理命令

source: The ``cleanup`` management command has been deprecated and replaced by :djadmin:`clearsessions`.
id: Perintah pengelolaan ``pembersihan`` telah usang dan diganti dengan :djadmin:`clearsessions`.
zh_hans: ``cleanup`` 管理命令已被弃用，并被 :djadmin:`clearsessions` 取代。

source: ``daily_cleanup.py`` script
id: Tulisan ``daily_cleanup.py``
zh_hans: ``daily_cleanup.py`` 脚本

source: The undocumented ``daily_cleanup.py`` script has been deprecated. Use the :djadmin:`clearsessions` management command instead.
id: Tulisan ``daily_cleanup.py`` tidak terdokumentasi telah diusangkan. Gunakan perintah pengelolaan :djadmin:`clearsessions` sebagai gantinya.
zh_hans: 未记录的 ``daily_cleanup.py`` 脚本已被弃用。请使用 :djadmin:`clearsessions` 管理命令。

source: ``depth`` keyword argument in ``select_related``
id: Argumen kata kunci ``depth`` di ``select_related``
zh_hans: ``select_related`` 中的 ``depth`` 关键字参数

source: The ``depth`` keyword argument in :meth:`~django.db.models.query.QuerySet.select_related` has been deprecated. You should use field names instead.
id: Argumen kata kunci ``depth`` dalam :meth:`~django.db.models.query.QuerySet.select_related` telah diusangkan. Anda harus menggunakannama bidang sebagai gantinya.
zh_hans: 在 :meth:`~django.db.models.query.QuerySet.select_related` 中的 ``depth`` 关键字参数已被弃用。您应该使用字段名称代替。

source: Django 1.5.1 release notes
id: Catatan terbitan Django 1.5.1
zh_hans: Django 1.5.1 版本发行说明

source: *March 28, 2013*
id: *28 Maret 2013*
zh_hans: *2013 年 3 月 28 日*

source: This is Django 1.5.1, a bugfix release for Django 1.5. It's completely backwards compatible with Django 1.5, but includes a handful of fixes.
id: Ini adalah Django 1.5.1, sebuah terbitan perbaikan kesalahan untuk Django 1.5. Itu sepenuhnya kesesuaian kebelakang dengan Django 1.5, tetapi termasuk perbaikan berguna.
zh_hans: 这是 Django 1.5.1，是 Django 1.5 的修复错误版本。它与 Django 1.5 完全向后兼容，但包含了一些修复。

source: The biggest fix is for a memory leak introduced in Django 1.5. Under certain circumstances, repeated iteration over querysets could leak memory - sometimes quite a bit of it. If you'd like more information, the details are in :ticket:`our ticket tracker <19895>` (and in :bpo:`a related issue <17468>` in Python itself).
zh_hans: 最重要的修复是针对 Django 1.5 引入的内存泄漏。在某些情况下，反复迭代查询集可能会导致内存泄漏 - 有时会泄漏相当多的内存。如果您想了解更多信息，详细信息可以在我们的 :ticket:`问题跟踪器 <19895>`（以及 Python 自身的 :bpo:`相关问题 <17468>`）中找到。

source: If you've noticed memory problems under Django 1.5, upgrading to 1.5.1 should fix those issues.
id: Jika anda telah menyadari masalah penyimpanan sementara dibawah Django 1.5, meningkatkan ke 1.5.1 harus memperbaiki masalah tersebut.
zh_hans: 如果您在 Django 1.5 下遇到了内存问题，升级到 1.5.1 版本应该可以解决这些问题。

source: Django 1.5.1 also includes a couple smaller fixes:
id: Django 1.5.1 juga menyertakan sepasang perbaikan paling kecil:
zh_hans: Django 1.5.1 还包含了一些较小的修复：

source: Module-level warnings emitted during tests are no longer silently hidden (:ticket:`18985`).
id: Peringatan tingkatan-modul dikeluarkan selama percobaan tidak lagi secara diam bersembunyi (:ticket:`18985`).
zh_hans: 在测试期间发出的模块级警告不再被默默隐藏 (:ticket:`18985`)。

source: Prevented filtering on password hashes in the user admin (:ticket:`20078`).
id: Dicegah menyaring pada acakan sandi di pengguna admin (:ticket:`20078`).
zh_hans: 防止在用户管理界面中对密码哈希进行过滤 (:ticket:`20078`)。

source: Django 1.5.10 release notes
id: Catatan terbitan Django 1.5.10
zh_hans: Django 1.5.10 版本发行说明

source: Django 1.5.10 fixes a regression in the 1.5.9 security release.
id: Django 1.5.10 memperbaiki sebuah pemulihan di terbitan keamanan 1.5.9.
zh_hans: Django 1.5.10 修复了 1.5.9 安全发布中的回归错误。

source: Django 1.5.11 release notes
id: Catatan terbitan Django 1.5.11
zh_hans: Django 1.5.11 版本发行说明

source: Django 1.5.11 fixes a couple regressions in the 1.5.9 security release.
id: Django 1.5.11 memperbaiki sepasang pemulihan di terbitan keamanan 1.5.9.
zh_hans: Django 1.5.11 修复了 1.5.9 安全发布中的一些回归错误。

source: Django 1.5.12 release notes
id: Catatan terbitan Django 1.5.12
zh_hans: Django 1.5.12 版本发行说明

source: Django 1.5.12 fixes a regression in the 1.5.9 security release.
id: Django 1.5.12 memperbaiki sebuah pemulihan di terbitan keamanan 1.5.9.
zh_hans: Django 1.5.12 修复了 1.5.9 安全发布中的一个回归错误。

source: Django 1.5.2 release notes
id: Catatan terbitan Django 1.5.2
zh_hans: Django 1.5.2 版本发行说明

source: This is Django 1.5.2, a bugfix and security release for Django 1.5.
id: Ini adalah Django 1.5.2, terbitan perbaikan kesalahan dan keamanan untuk Django 1.5.
zh_hans: 这是 Django 1.5.2，是 Django 1.5 的修复错误和安全发布版本。

source: XSS vulnerability in :mod:`django.contrib.admin`
id: Kerentanan XSS di :mod:`django.contrib.admin`
zh_hans: :mod:`django.contrib.admin` 中的 XSS 漏洞

source: If a :class:`~django.db.models.URLField` is used in Django 1.5, it displays the current value of the field and a link to the target on the admin change page. The display routine of this widget was flawed and allowed for XSS.
id: Jika sebuah :class:`~django.db.models.URLField` di Django 1.5, itu menampilkan nilai saat ini dari bidang dan sebuah tautan pada sasaran di halaman merubah admin. Rutin tampilan dari widget ini telah cacar dan diizinkan untuk XSS.
zh_hans: 如果在 Django 1.5 中使用了 :class:`~django.db.models.URLField`，它会在管理页面的更改页面上显示字段的当前值和到目标的链接。这个小部件的显示程序存在缺陷，允许进行 XSS 攻击。

source: Fixed a crash with :meth:`~django.db.models.query.QuerySet.prefetch_related` (#19607) as well as some ``pickle`` regressions with ``prefetch_related`` (#20157 and #20257).
id: Diperbaiki sebuah kegagalan dengan :meth:`~django.db.models.query.QuerySet.prefetch_related` (#19607) sama halnya beberapa pemulihan ``pickle`` dengan ``prefetch_related`` (#20157 and #20257).
zh_hans: 修复了与 :meth:`~django.db.models.query.QuerySet.prefetch_related` 有关的崩溃问题 (#19607)，以及一些与 ``prefetch_related`` 有关的 ``pickle`` 回归问题 (#20157 和 #20257)。

source: Fixed a regression in :mod:`django.contrib.gis` in the Google Map output on Python 3 (#20773).
id: Diperbaiki sebuah pemulihan di :mod:`django.contrib.gis` di keluaran Google Map pada Pyhton 3 (#20773).
zh_hans: 在 Python 3 上修复了 :mod:`django.contrib.gis` 中 Google 地图输出的回归问题 (#20773)。

source: Made ``DjangoTestSuiteRunner.setup_databases`` properly handle aliases for the default database (#19940) and prevented ``teardown_databases`` from attempting to tear down aliases (#20681).
id: Dibuat `DjangoTestSuiteRunner.setup_databases`` dengan benar menangani nama lain untuk basisdata awalan (#19940) dan dicegah ``teardown_databases`` untuk mencoba merobohkan nama lain (#20681).
zh_hans: 使 ``DjangoTestSuiteRunner.setup_databases`` 正确处理默认数据库的别名 (#19940)，并防止 ``teardown_databases`` 尝试拆除别名 (#20681)。

source: Fixed the ``django.core.cache.backends.memcached.MemcachedCache`` backend's ``get_many()`` method on Python 3 (#20722).
id: Diperbaiki ``django.core.cache.backends.memcached.MemcachedCache`` metode ``get_many()`` backend pada Python 3 (#20722).
zh_hans: 修复了 Python 3 上的 ``django.core.cache.backends.memcached.MemcachedCache`` 后端的 ``get_many()`` 方法 (#20722)。

source: Fixed :mod:`django.contrib.humanize` translation syntax errors. Affected languages: Mexican Spanish, Mongolian, Romanian, Turkish (#20695).
id: Diperbaiki kesalahan sintaksis terjemahan :mod:`django.contrib.humanize`. Bahasa terpengaruh: Meksiko Spanyol, Mongolia, Rumania, Turki (#20695).
zh_hans: 修复了 :mod:`django.contrib.humanize` 中的翻译语法错误。受影响的语言包括墨西哥西班牙语、蒙古语、罗马尼亚语和土耳其语 (#20695)。

source: Added support for wheel packages (#19252).
id: Ditambahkan dukungan untuk paket wheel (#19252).
zh_hans: 新增对 wheel 软件包的支持（ #19252 ）。

source: The CSRF token now rotates when a user logs in.
id: Token CSRF sekarang berputar ketika pengguna masuk.
zh_hans: 用户登录时，CSRF 令牌现在会轮换。

source: Some Python 3 compatibility fixes including #20212 and #20025.
id: Beberapa perbaikan kesesuaian Python 3 termasuk #20212 dan #20025.
zh_hans: 包括 #20212 和 #20025 在内的一些 Python 3 兼容性修复。

source: Fixed some rare cases where :meth:`~django.db.models.query.QuerySet.get` exceptions recursed infinitely (#20278).
id: Diperbaiki beberapa kasus jarang dimana pengecualian :meth:`~django.db.models.query.QuerySet.get` berulang tidak terbatas (#20278).
zh_hans: 修复了一些罕见情况下 :meth:`~django.db.models.query.QuerySet.get` 引发无限递归异常的问题 (#20278)。

source: :djadmin:`makemessages` no longer crashes with ``UnicodeDecodeError`` (#20354).
id: :djadmin:`makemessages` tidak lagi gagal dengan ``UnicodeDecodeError`` (#20354).
zh_hans: :djadmin:`makemessages` 不再因为 ``UnicodeDecodeError`` 而崩溃 (#20354)。
