Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Calls to management services in your code now need to use ``call_command``. For example, if you have some test code that calls flush and load_data::
id: Panggilan pada pengelolaan pelayanan di kode anda sekarang butuh untuk menggunakan ``call_command``. Sebagai contoh, jika anda mempunyai beberapa percobaan yang memanggil flush dan load_data::
zh_hans: 你的代码中对管理服务的调用现在需要使用 ``call_command``。例如，如果你有一些调用 flush 和 load_data 的测试代码：

source: ...you'll need to change this code to read::
id: ...anda akan butuh merubah kdoe ini untuk dibaca::
zh_hans: ...你需要更改这段代码为：

source: Subcommands must now precede options
id: Sub perintah sekarang harus mendahulukan pilihan
zh_hans: 现在子命令必须在选项之前。

source: ``django-admin.py`` and ``manage.py`` now require subcommands to precede options. So:
id: ``django-admin.py`` dan ``manage.py`` sekarang membutuhkan sub perintah untuk mendahulukan pilihan. Jadi:
zh_hans: ``django-admin.py`` 和 ``manage.py`` 现在要求子命令必须在选项之前。因此：

source: ...no longer works and should be changed to:
id: ...tidak lagi bekerja dan harus dirubah menjadi:
zh_hans: ...不再起作用，应该改为：

source: Syndication
id: Kongsi
zh_hans: 联合

source: ``Feed.__init__`` has changed
id: ``Feed.__init__`` telah berubah
zh_hans: ``Feed.__init__`` 发生了变化

source: The ``__init__()`` method of the syndication framework's ``Feed`` class now takes an ``HttpRequest`` object as its second parameter, instead of the feed's URL. This allows the syndication framework to work without requiring the sites framework. This only affects code that subclasses ``Feed`` and overrides the ``__init__()`` method, and code that calls ``Feed.__init__()`` directly.
id: metode ``__init__()`` dari kongsi kelas ``Feed`` kerangka kerja sekarang mengambil sebuah obyek ``HttpRequest`` sebagai parameter keduanya, daripada URL umpan. Ini mengizinkan kongsi kerangka kerja untuk bekerja tanpa membutuhkan kerangka kerja situs. Ini hanya mempengaruhi kode yang subkelas ``Feed`` dan menimpa metode ``__init__()``, dan kode yang memanggil ``Feed.__init__()`` secara langsung.
zh_hans: syndication 框架的 ``Feed`` 类的 ``__init__()`` 方法现在将 ``HttpRequest`` 对象作为其第二个参数，而不是 feed 的 URL。这允许 syndication 框架在不需要 sites 框架的情况下工作。这只影响到子类化 ``Feed`` 并覆盖 ``__init__()`` 方法的代码，以及直接调用 ``Feed.__init__()`` 的代码。

source: Data structures
id: Struktur data
zh_hans: 数据结构

source: ``SortedDictFromList`` is gone
id: `SortedDictFromList`` telah pergi
zh_hans: ``SortedDictFromList`` 已被移除

source: ``django.newforms.forms.SortedDictFromList`` was removed. ``django.utils.datastructures.SortedDict`` can now be instantiated with a sequence of tuples.
id: ``django.newforms.forms.SortedDictFromList`` telah dipindahkan. ``django.utils.datastructures.SortedDict`` sekarang dapat membuat obyek dengan urutan dari tuple-tuple.
zh_hans: ``django.newforms.forms.SortedDictFromList`` 已被移除。``django.utils.datastructures.SortedDict`` 现在可以通过元组序列进行实例化。

source: To update your code:
id: Untuk memperbaharui kode anda:
zh_hans: 要更新你的代码：

source: Use ``django.utils.datastructures.SortedDict`` wherever you were using ``django.newforms.forms.SortedDictFromList``.
id: Gunakan ``django.utils.datastructures.SortedDict`` dimanapun anda menggunakan ``django.newforms.forms.SortedDictFromList``.
zh_hans: 在原先使用 ``django.newforms.forms.SortedDictFromList`` 的地方，现在应该使用 ``django.utils.datastructures.SortedDict``。

source: Because ``django.utils.datastructures.SortedDict.copy`` doesn't return a deepcopy as ``SortedDictFromList.copy()`` did, you will need to update your code if you were relying on a deepcopy. Do this by using ``copy.deepcopy`` directly.
id: Karena ``django.utils.datastructures.SortedDict.copy`` tidak mengemblikan salinan dalam sebagai ``SortedDictFromList.copy()`` lakukan, anda akan butuh memperbaharui kode anda jika anda bergantung pada saliann dalam. Lakukan ini dengan menggunakan ``copy.deepcopy`` secara langsung.
zh_hans: 因为 ``django.utils.datastructures.SortedDict.copy`` 不像 ``SortedDictFromList.copy()`` 那样返回深拷贝，如果你依赖于深拷贝，你需要更新你的代码。通过直接使用 ``copy.deepcopy`` 来实现这一点。

source: Database backend functions
id: Fungsi basisdata backend
zh_hans: 数据库后端函数

source: Database backend functions have been renamed
id: Fungsi basisdata backend telah diubah namanya
zh_hans: 数据库后端函数已经改名。

source: Almost *all* of the database backend-level functions have been renamed and/or relocated. None of these were documented, but you'll need to change your code if you're using any of these functions, all of which are in :mod:`django.db`:
id: Hampir *semua* dari fungsi tingkatan backend basisdata telah dinamai kembali dan/atau ditempatkan kembali. Tidak ada dari ini didokumentasikan, tetapi anda akan butuh merubah kode anda jika anda sedang menggunakan tiap fungsi ini, semua dari yang berada di :mod:`django.db`:
zh_hans: 几乎所有数据库后端级别的函数都已被重命名和/或移动。虽然这些函数没有被文档化，但如果你使用了其中的任何一个函数，你需要修改你的代码，所有这些函数都在 :mod:`django.db` 中：

source: Django 1.0.1 release notes
id: Catatan terbitan Django 1.0.1
zh_hans: Django 1.0.1 版本发行说明

source: Welcome to Django 1.0.1!
id: Selamat datang di Django 1.0.1!
zh_hans: 欢迎来到 Django 1.0.1 版本！

source: This is the first "bugfix" release in the Django 1.0 series, improving the stability and performance of the Django 1.0 codebase. As such, Django 1.0.1 contains no new features (and, pursuant to :doc:`our compatibility policy </misc/api-stability/>`, maintains backwards compatibility with Django 1.0), but does contain a number of fixes and other improvements. Django 1.0.1 is a recommended upgrade for any development or deployment currently using or targeting Django 1.0.
id: Ini adalah terbitan "bugfix" pertama di rangkaian Django 1.0, meningkatkan kestabilan dan penampilan dari basis kode Django 1.0. Dengan demikian, Django 1.0.1 tidak mengandung fitur baru (dan, sesuai pada :doc:`our compatibility policy </misc/api-stability/>`, perawatan kesesuaian kebelakang dengan Django 1.0), tetapi mengandung sejumlah dari perbaikan dan perbaharuan lainnya. Django 1.0.1 adalah peningkatan yang dianjurkan untuk tiap pengembangan atau penyebaran saat ini menggunakan atau menyasar Django 1.0.
zh_hans: 这是 Django 1.0 系列的第一个“修复错误”版本，改进了 Django 1.0 代码库的稳定性和性能。因此，Django 1.0.1 不包含新功能（根据 :doc:`我们的兼容性政策 </misc/api-stability/>`，保持了与 Django 1.0 的向后兼容性），但包含了许多修复和其他改进。Django 1.0.1 是任何当前使用或针对 Django 1.0 的开发或部署的推荐升级版本。

source: Fixes and improvements in Django 1.0.1
id: Perbaikan dan pembetulan di Django 1.0.1
zh_hans: Django 1.0.1 中的修正和改进

source: Django 1.0.1 contains over two hundred fixes to the original Django 1.0 codebase; full details of every fix are available in `the history of the 1.0.X branch`_, but here are some of the highlights:
id: Django 1.0.1 mengandung lebih dua ratus perbaikan pada basis kode Django 1.0 asli; rincian penuh dari setiap perbaikan tersedia di `the history of the 1.0.X branch`_, tetapi ini ada beberapa dari sorotan:
zh_hans: Django 1.0.1 包含了对原始 Django 1.0 代码库的两百多个修复；关于每个修复的详细信息可以在 `1.0.X 分支的历史记录`_ 中找到，以下是一些亮点：

source: Several fixes in ``django.contrib.comments``, pertaining to RSS feeds of comments, default ordering of comments and the XHTML and internationalization of the default templates for comments.
id: Beberapa perbaikan di ``django.contrib.comments``, berkaitan pada umpan RSS dari komentar, urutan awal dari komentar dan XHTML dan internasionalisasi dari cetakan awal untuk komentar.
zh_hans: 在 ``django.contrib.comments`` 中进行了一些修复，涉及到评论的 RSS 订阅、评论的默认排序以及评论默认模板的 XHTML 和国际化。

source: Multiple fixes for Django's support of Oracle databases, including pagination support for GIS QuerySets, more efficient slicing of results and improved introspection of existing databases.
id: Banyak perbaikan untuk dukungan Django dari basisdata Oracle, termasuk dukungan penomoran untuk QuerySet GIS, lebih efisien memotong dan ditingkatkan interospeksi dari basisdata yang ada.
zh_hans: 对于 Django 对 Oracle 数据库的支持进行了多个修复，包括对 GIS QuerySets 的分页支持，更高效的结果切片和对现有数据库的改进的内省。

source: Several fixes for query support in the Django object-relational mapper, including repeated setting and resetting of ordering and fixes for working with ``INSERT``-only queries.
id: Beberapa perbaikan untuk dukungan permintaan di pemetaan hubungan obyek Django, termasuk pengaturan berulang dan mengatur kembali dari urutan dan perbaikan untuk bekerja dengan permintaan ``INSERT``-only.
zh_hans: Django 对象关系映射中的查询支持修复，包括重复设置和重置排序以及与仅支持 ``INSERT`` 查询的修复。

source: Multiple fixes for inline forms in formsets.
id: Banyak perbaikan untuk formulir berderet di kumpulan formulir.
zh_hans: 对于表单集中的内联表单进行了多个修复。

source: Multiple fixes for ``unique`` and ``unique_together`` model constraints in automatically-generated forms.
id: Banyak perbaikan untuk batasan model ``unique`` dan ``unique_together`` dalam formulir dibangkitkan otomatis.
zh_hans: 对于自动生成的表单中的 ``unique`` 和 ``unique_together`` 模型约束进行了多个修复。

source: Fixed support for custom callable ``upload_to`` declarations when handling file uploads through automatically-generated forms.
id: Diperbaiki dukungan untuk callable penyesuaian pernyataan ``upload_to`` ketika menangani unggahan berkas melalui formulir dibangkitkan otomatis.
zh_hans: 修复了通过自动生成的表单处理文件上传时，对自定义可调用的 ``upload_to`` 声明的支持。

source: Fixed support for sorting an admin change list based on a callable attributes in ``list_display``.
id: Diperbaiki dukungan untuk mengurutkan daftar perubahan admin berdasarkan pada atribut callable dalam ``list_display``.
zh_hans: 修复了基于`list_display`中的可调用属性来排序管理更改列表的支持。

source: A fix to the application of autoescaping for literal strings passed to the ``join`` template filter. Previously, literal strings passed to ``join`` were automatically escaped, contrary to :ref:`the documented behavior for autoescaping and literal strings <string-literals-and-automatic-escaping>`. Literal strings passed to ``join`` are no longer automatically escaped, meaning you must now manually escape them; this is an incompatibility if you were relying on this bug, but not if you were relying on escaping behaving as documented.
id: Sebuah perbaikan ke aplikasi dari pelolosan otomatis untuk deretan karakter harfiah dilewatkan ke penyaring cetakan ``join``. Sebelumnya, deretan karakter harfiah dilewatkan ke ``join`` secara otomatis diloloskan, kebalikan pada :ref:`the documented behavior for autoescaping and literal strings <string-literals-and-automatic-escaping>`. Deretan karakter harfiah dilewatkan ke ``join`` tidak lagi secara otomatis dilewatkan, berarti anda sekarang harus meloloskan mereka secara manual; ini adalah ketidaksesuaian jika anda sedang bergantung pada kesalahan ini, tetapi tidak jika anda sedang bergantung pada meloloskan berperilaku seperti didokumentasi.
zh_hans: 修复了自动转义应用于传递给 ``join`` 模板过滤器的文字字符串的问题。以前，传递给 ``join`` 的文字字符串会自动进行转义，与 :ref:`文档中自动转义和文字字符串的记录行为 <string-literals-and-automatic-escaping>` 相矛盾。现在，传递给 ``join`` 的文字字符串不再自动进行转义，这意味着你现在必须手动进行转义；如果你依赖于这个错误，这是一个不兼容的变化，但如果你依赖于转义的行为与文档一致，那么就没有问题。

source: Improved and expanded translation files for many of the languages Django supports by default.
id: Peningkatan dan perluasan berkas-berkas terjemahan untuk banyak dukungan bahasa Django secara awal.
zh_hans: 对 Django 默认支持的许多语言进行了改进和扩展的翻译文件。

source: And as always, a large number of improvements to Django's documentation, including both corrections to existing documents and expanded and new documentation.
id: Dan seperti selalu, sejumlah besar dari peningkatan pada dokumentasi Django, termasuk perbaikan kedua pada dokumen yang ada dan dokumentasi baru.
zh_hans: 一如既往地，对 Django 的文档进行了大量改进，包括对现有文档的修正和扩展以及全新的文档。

source: Django 1.0.2 release notes
id: Catatan terbitan Django 1.0.2
zh_hans: Django 1.0.2 版本发行说明

source: Welcome to Django 1.0.2!
id: Selamat datang di Django 1.0.2!
zh_hans: 欢迎来到 Django 1.0.2 版本！

source: This is the second "bugfix" release in the Django 1.0 series, improving the stability and performance of the Django 1.0 codebase. As such, Django 1.0.2 contains no new features (and, pursuant to :doc:`our compatibility policy </misc/api-stability>`, maintains backwards compatibility with Django 1.0.0), but does contain a number of fixes and other improvements. Django 1.0.2 is a recommended upgrade for any development or deployment currently using or targeting Django 1.0.
id: Ini adalah terbitan "bugfix" kedua di rangkaian Django 1.0, meningkatkan kestabilan dan penampilan dari basis kode Django 1.0. Dengan demikian, Django 1.0.2 tidak mengandung fitur baru (dan, sesuai pada :doc:`our compatibility policy </misc/api-stability>`, merawat kesesuaian kebelakang dengan Django 1.0.0), tetapi megnandung sejumlah perbaikan dan peningkatan lain. Django 1.0.2 dianjurkan ditingkatkan untuk tiap pengembangan atau penyebaran saat ini menggunakan atau menyasar Django 1.0.
zh_hans: 这是 Django 1.0 系列的第二个“修复错误”版本，改进了 Django 1.0 代码库的稳定性和性能。因此，Django 1.0.2 不包含新功能（根据我们的兼容性政策，保持了与 Django 1.0.0 的向后兼容性），但包含了许多修复和其他改进。Django 1.0.2 是任何当前使用或针对 Django 1.0 的开发或部署的推荐升级版本。

source: Fixes and improvements in Django 1.0.2
id: Perbaikan dan pembetulan di Django 1.0.2
zh_hans: Django 1.0.2 中的修正和改进

source: The primary reason behind this release is to remedy an issue in the recently-released Django 1.0.1; the packaging scripts used for Django 1.0.1 omitted some directories from the final release package, including one directory required by ``django.contrib.gis`` and part of Django's unit-test suite.
id: Alasan utama dibelakang terbitan ini adalah untuk memperbaiki sebuah masalah di terbitan saat ini Django 1.0.1; tulisan paket digunakan untuk Django 1.0.1 menghilangkan beberapa pelipat dari paket terbitan akhir, termasuk satu direktori diwajibkan oleh ``django.contrib.gis`` dan bagian deretan percobaan satuan Django.
zh_hans: 这个版本发布的主要原因是修复了最近发布的 Django 1.0.1 中的一个问题；Django 1.0.1 使用的打包脚本在最终发布包中省略了一些目录，包括 ``django.contrib.gis`` 需要的一个目录以及 Django 单元测试套件的一部分。

source: Django 1.0.2 contains updated packaging scripts, and the release package contains the directories omitted from Django 1.0.1. As such, this release contains all of the fixes and improvements from Django 1.0.1; see :doc:`the Django 1.0.1 release notes </releases/1.0.1>` for details.
id: Django 1.0.2 mengandung tulisan paket terperbaharui, dan paket terbitan mengandung direktori dihilangkan dari Django 1.0.1. Dengan demikian, terbitan ini mengandung semua perbaikan dan peningkatan dari Django 1.0.1; lihat :doc:`the Django 1.0.1 release notes </releases/1.0.1>` untuk rincian.
zh_hans: Django 1.0.2 包含更新的打包脚本，并且发布包中包含了在 Django 1.0.1 中遗漏的目录。因此，这个版本包含了来自 Django 1.0.1 的所有修复和改进；请查看 :doc:`Django 1.0.1 发布说明 </releases/1.0.1>` 以获取详细信息。

source: Additionally, in the period since Django 1.0.1 was released:
id: Selain itu, pada periode sejak Django 1.0 telah diterbitkan:
zh_hans: 此外，在发布 Django 1.0.1 之后的一段时间里：

source: Updated Hebrew and Danish translations have been added.
id: Terjemahan Ibrani dan Denmark diperbaharui telah ditambahkan.
zh_hans: 已添加更新的希伯来语和丹麦语翻译。

source: The default ``__repr__`` method of Django models has been made more robust in the face of bad Unicode data coming from the ``__unicode__`` method; rather than raise an exception in such cases, ``repr()`` will now contain the string "[Bad Unicode data]" in place of the invalid Unicode.
id: Metode ``__repr__`` awalan dari model Django telah dibuat lebih kuat dalam menghadapi data Unicode buruk datang dari cara ``__unicode__``; daripada memunculkan sebuah pengecualian di kasus seperti itu, ``repr()`` akan sekarang mengandung deretan karakter "[Bad Unicode data]" ditempat dari Unicode tidak sah.
zh_hans: Django 模型的默认 ``__repr__`` 方法在处理来自 ``__unicode__`` 方法的坏 Unicode 数据时变得更加健壮；在这种情况下，不会引发异常，而是 ``repr()`` 将包含字符串 "[Bad Unicode data]" 来替代无效的 Unicode。

source: A bug involving the interaction of Django's ``SafeUnicode`` class and the MySQL adapter has been resolved; ``SafeUnicode`` instances (generated, for example, by template rendering) can now be assigned to model attributes and saved to MySQL without requiring an explicit intermediate cast to ``unicode``.
id: Sebuah kesalahan melibatkan interaksi dari kelas ``SafeUnicode`` Django dan penyadur MySQL telah terselesaikan; instance ``SafeUnicode`` (dibangkitkan, sebagai contoh, dengan membangun cetakan) dapat sekarang diberikan ke atribut model dan disimpan ke MySQL tanpa membutuhkan pemasukan menegah secara eksplisit pada intermediate
zh_hans: 已解决了与 Django 的 ``SafeUnicode`` 类和 MySQL 适配器交互的一个 bug；现在可以将 ``SafeUnicode`` 实例（例如，由模板渲染生成）分配给模型属性并保存到 MySQL，而无需显式的中间强制转换为 ``unicode``。

source: A bug affecting filtering on a nullable ``DateField`` in SQLite has been resolved.
id: Sebuah kesalahan menyaring di ``DateField`` nullable dalam SQLite telah terselesaikan.
zh_hans: 已解决了在 SQLite 中对可为空的 ``DateField`` 进行过滤时出现的 bug。

source: Several updates and improvements have been made to Django's documentation.
id: Beberapa pembaharuan dan peningkatan telah dibuat pada dokumentasi Django.
zh_hans: 对 Django 的文档进行了多次更新和改进。

source: Django 1.1 release notes
id: Catatan terbitan Django 1.1
zh_hans: Django 1.1 版本发行说明

source: July 29, 2009
id: 29 Juli 2009
zh_hans: 2009 年 7 月 29 日

source: Welcome to Django 1.1!
id: Selamat datang di Django 1.1!
zh_hans: 欢迎来到 Django 1.1 版本！

source: Django 1.1 includes a number of nifty :ref:`new features <whats-new-1.1>`, lots of bug fixes, and an easy upgrade path from Django 1.0.
id: Django 1.1 menyertakan sejumlah dari :ref:`new features <whats-new-1.1>` bagus, banyak perbaikan kesalahan, dan jalur peningkatan mudah dari Django 1.0.
zh_hans: Django 1.1 包含了许多 :ref:`新功能 <whats-new-1.1>`、大量的 bug 修复，以及从 Django 1.0 升级的简便路径。

source: Backwards-incompatible changes in 1.1
id: Perubahan bertentangan kebelakang di 1.1
zh_hans: 1.1 中的不向后兼容的变更

source: Django has a policy of :doc:`API stability </misc/api-stability>`. This means that, in general, code you develop against Django 1.0 should continue to work against 1.1 unchanged. However, we do sometimes make backwards-incompatible changes if they're necessary to resolve bugs, and there are a handful of such (minor) changes between Django 1.0 and Django 1.1.
id: Django mempunyai sebuah kebijakan :doc:`API stability </misc/api-stability>`. Ini berarti bahwa, secara umum, kode anda kembangkan terhadap Django 1.0 harus lanjut bekerja terhadap tanpa perubahan 1.1. Bagaimanapun, kami melakukan terkadang membuat perubahan bertentangan kebelakang jika mereka butuh untuk menyelesaikan kesalahan, dan ada bantuan dari perubahan (kecil) seperti itu diantara Django 1.0 dan Django 1.1.
zh_hans: Django 具有一项 :doc:`API 稳定性 </misc/api-stability>` 的政策。这意味着通常情况下，你在 Django 1.0 上开发的代码应该可以在 1.1 上无需修改继续运行。然而，如果需要解决 bug，我们有时会进行不兼容的变更，而在 Django 1.0 和 Django 1.1 之间存在一些这样的（小的）变更。

source: Before upgrading to Django 1.1 you should double-check that the following changes don't impact you, and upgrade your code if they do.
id: Sebelum meningkatkan ke Django 1.1 anda harus memeriksa kembali bahwa perubahan berikut tidak berdampak anda, dan tingkatkan kode anda jika mereka lakukan.
zh_hans: 在升级到 Django 1.1 之前，你应该仔细检查以下更改是否会影响你的代码，并在需要时进行代码升级。

source: Changes to constraint names
id: Perubahan pada batasan nama
zh_hans: 约束名称的更改

source: Django 1.1 modifies the method used to generate database constraint names so that names are consistent regardless of machine word size. This change is backwards incompatible for some users.
id: Django 1.1 merubah cara yang digunakan untuk membangkitkan nama batasan basisdata sehingga nama selaras tanpa memperhatikan ukuran kata mesin. Perubahan ini bertentangan kebelakang untuk beberapa pengguna.
zh_hans: Django 1.1 修改了生成数据库约束名称的方法，使得名称在不同机器字长下保持一致。这个改变对一些用户来说是不兼容的。

source: If you are using a 32-bit platform, you're off the hook; you'll observe no differences as a result of this change.
id: Jika anda sedang menggunakan serambi32-bit, anda diluar hubungan; anda akan mengamati tidak ada perbedaan sebagai hasil dari perubahan ini.
zh_hans: 如果你使用的是 32 位平台，你就不用担心了；你不会因为这个改变而观察到任何差异。

source: However, **users on 64-bit platforms may experience some problems** using the ``reset`` management command. Prior to this change, 64-bit platforms would generate a 64-bit, 16 character digest in the constraint name; for example:
zh_hans: 然而，**在 64 位平台上的用户可能会在使用 ``reset`` 管理命令时遇到一些问题**。在这个更改之前，64 位平台会生成一个 64 位、16 个字符的约束名称；例如：

source: Following this change, all platforms, regardless of word size, will generate a 32-bit, 8 character digest in the constraint name; for example:
zh_hans: 在这个改变之后，所有平台（无论字长如何）都将在约束名称中生成一个 32 位、8 个字符的摘要；例如：

source: As a result of this change, you will not be able to use the ``reset`` management command on any table made by a 64-bit machine. This is because the new generated name will not match the historically generated name; as a result, the SQL constructed by the reset command will be invalid.
id: Sebagai hasil dari perubahan ini, anda tidak akan dapat menggunakan perintah pengelolaan ``reset`` pada setiap tabel dibuat oleh mesin 64-bit. Ini karena nama dibangkitkan baru tidak akan cocok secara riwayat nama dibangkitkan; sebagai hasilnya, SQL dibangun oleh perintah pengaturan kembali akan tidak sah.
zh_hans: 由于这个更改，你将无法在由 64 位机器创建的任何表上使用 ``reset`` 管理命令。这是因为新生成的名称将不匹配历史生成的名称；因此，reset 命令构建的 SQL 将无效。

source: If you need to reset an application that was created with 64-bit constraints, you will need to manually drop the old constraint prior to invoking ``reset``.
id: Jika anda butuh menyetek kembali sebuah aplikasi yang telah dibuat dengan batasan 64-bit, anda akan butuh secara manual menjatuhkan batasan lama sebelum meminta ``reset``.
zh_hans: 如果你需要重置一个使用 64 位约束创建的应用程序，你需要在调用 ``reset`` 命令之前手动删除旧的约束。

source: Test cases are now run in a transaction
id: Kasus percobaan sekarang berjalan di transaksi.
zh_hans: 现在测试用例在一个事务中运行

source: Django 1.1 runs tests inside a transaction, allowing better test performance (see `test performance improvements`_ for details).
id: Django 1.1 menjalankan percobaan didalam transaksi, mengizinkan penampilan percobaan terbaik (lihat `test performance improvements`_ untuk rincian).
zh_hans: Django 1.1 在事务内运行测试，从而提高了测试性能（详细信息请参见 `测试性能改进`_）。

source: This change is slightly backwards incompatible if existing tests need to test transactional behavior, if they rely on invalid assumptions about the test environment, or if they require a specific test case ordering.
id: Perubahan ini sedikit bertentangan kebelakang jika percobaan yang ada butuh mencoba perilaku transaksional, jika mereka bergantung pada prasangka tidak sah tentang lingkungan percobaan, atau jika mereka membutuhkan sebuah urutan kasus percobaan khusus.
zh_hans: 如果现有的测试需要测试事务行为，如果它们依赖于对测试环境的无效假设，或者如果它们需要特定的测试用例顺序，那么这个改变在某种程度上是不兼容的。

source: For these cases, :class:`~django.test.TransactionTestCase` can be used instead. This is a just a quick fix to get around test case errors revealed by the new rollback approach; in the long-term tests should be rewritten to correct the test case.
id: Untuk kasus-kasus ini, :class:`~django.test.TransactionTestCase` dapat digunakan sebagai gantinya. Ini hanya perbaikan cepat untuk berkeliling-keliling kesalahan kasus percobaan terungkap oleh pendekatan rollback baru; di percobaan jangka panjang harus ditulis kembali untuk memperbaiki percobaan kasus.
zh_hans: 对于这些情况，可以使用 :class:`~django.test.TransactionTestCase`。这只是一个快速的修复方法，用来解决新的回滚方式暴露出的测试用例错误；从长远来看，应该重新编写测试用例以纠正问题。

source: Removed ``SetRemoteAddrFromForwardedFor`` middleware
id: Pindahkan middleware ``SetRemoteAddrFromForwardedFor``
zh_hans: 移除了 ``SetRemoteAddrFromForwardedFor`` 中间件
