Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed ``geojson`` detection with SpatiaLite.
id: Diperbaiki penemuan ``geojson`` dengan SpatiaLite.
zh_hans: 修复了与 SpatiaLite 的 ``geojson`` 检测问题。

source: :meth:`~django.test.SimpleTestCase.assertContains` once again works with binary content (#20237).
id: :meth:`~django.test.SimpleTestCase.assertContains` sekali lagi bekerja denganisi biner (#20237).
zh_hans: :meth:`~django.test.SimpleTestCase.assertContains` 再次能够处理二进制内容 (#20237)。

source: Fixed :class:`~django.db.models.ManyToManyField` if it has a Unicode ``name`` parameter (#20207).
zh_hans: 修复了如果 :class:`~django.db.models.ManyToManyField` 具有 Unicode ``name`` 参数时的问题 (#20207)。

source: Ensured that the WSGI request's path is correctly based on the ``SCRIPT_NAME`` environment variable or the :setting:`FORCE_SCRIPT_NAME` setting, regardless of whether or not either has a trailing slash (#20169).
id: Pastikan bahwa jalur permintaan WSGI benar berdasarkan di variabel lingkungan ``SCRIPT_NAME`` atau pengaturan :setting:`FORCE_SCRIPT_NAME`, terlepas dari apapun atau tidak baik mempunyai buntutan garis miring (#20169).
zh_hans: 确保 WSGI 请求的路径根据 ``SCRIPT_NAME`` 环境变量或 :setting:`FORCE_SCRIPT_NAME` 设置正确设置，无论它们是否以斜杠结尾 (#20169)。

source: Django 1.5.3 release notes
id: Catatan terbitan Django 1.5.3
zh_hans: Django 1.5.3 版本发行说明

source: This is Django 1.5.3, the third release in the Django 1.5 series. It addresses one security issue and also contains an opt-in feature to enhance the security of :mod:`django.contrib.sessions`.
id: Ini adalah Django 1.5.3, terbitan ketiga di rangkaian Django 1.5. Itu mengalamatkan satu masalah keamanan dan juga mengandung sebuah fitur pilihan untuk meningkatkan keamanan dari :mod:`django.contrib.sessions`.
zh_hans: 这是 Django 1.5.3，是 Django 1.5 系列的第三个发布版本。它解决了一个安全问题，并包含一个可选择的功能，以增强 :mod:`django.contrib.sessions` 的安全性。

source: Mitigating a remote-code execution vulnerability in :mod:`django.contrib.sessions`
id: Mengurangi kerentenan pengerjaan kode-terpencil di :mod:`django.contrib.sessions`
zh_hans: 应对 :mod:`django.contrib.sessions` 中的远程代码执行漏洞。

source: :mod:`django.contrib.sessions` currently uses :mod:`pickle` to serialize session data before storing it in the backend. If you're using the :ref:`signed cookie session backend<cookie-session-backend>` and :setting:`SECRET_KEY` is known by an attacker (there isn't an inherent vulnerability in Django that would cause it to leak), the attacker could insert a string into their session which, when unpickled, executes arbitrary code on the server. The technique for doing so is simple and easily available on the internet. Although the cookie session storage signs the cookie-stored data to prevent tampering, a :setting:`SECRET_KEY` leak immediately escalates to a remote code execution vulnerability.
zh_hans: :mod:`django.contrib.sessions` 目前在将会话数据存储到后端之前使用 :mod:`pickle` 进行序列化。如果您使用的是 :ref:`签名的 Cookie 会话后端 <cookie-session-backend>` 并且 :setting:`SECRET_KEY` 被攻击者知晓（Django 本身没有固有的漏洞导致泄漏），攻击者可以在他们的会话中插入一个字符串，当反序列化时，在服务器上执行任意代码。执行此操作的技术简单且易于在互联网上找到。虽然 Cookie 会话存储会对存储在 Cookie 中的数据进行签名以防止篡改，但一旦 :setting:`SECRET_KEY` 泄漏，立即升级为远程代码执行漏洞。

source: This attack can be mitigated by serializing session data using JSON rather than :mod:`pickle`. To facilitate this, Django 1.5.3 introduces a new setting, :setting:`SESSION_SERIALIZER`, to customize the session serialization format. For backwards compatibility, this setting defaults to using :mod:`pickle`. While JSON serialization does not support all Python objects like :mod:`pickle` does, we highly recommend switching to JSON-serialized values. Also, as JSON requires string keys, you will likely run into problems if you are using non-string keys in ``request.session``. See the :ref:`session_serialization` documentation for more details.
id: Serangan ini dapat dikurangi dengan menserialisasikan sesi data menggunakan JSON daripada :mod:`pickle`. Untuk memudahkan ini, Django 1.5.3 memperkenalkan pengaturan baru, :setting:`SESSION_SERIALIZER`, untuk menyesuaikan bentuk serialisasi sesi. Untuk kesesuaian kebelakang, awalan pengaturan ini untuk menggunakan :mod:`pickle`. Selagi serialisasi JSON tidak mendukung semua obyek Python seperti :mod:`pickle` lakukan, kami sangat menganjurkan mengganti ke JSON-serialisasi nilai. Juga, seperti JSON membutuhkan kunci deretan karakter, anda akan sepertinya berjalan kedalam masalah jika anda menggunakan kuncu bukan-deretan karakter di ``request.session``. Lihat dokumentasi :ref:`session_serialization` untuk rincian lebih.
zh_hans: 可以通过使用 JSON 而不是 :mod:`pickle` 对会话数据进行序列化来缓解此攻击。为了方便这一点，Django 1.5.3 引入了一个新的设置 :setting:`SESSION_SERIALIZER`，用于自定义会话序列化格式。为了向后兼容，默认情况下这个设置使用 :mod:`pickle`。虽然 JSON 序列化不像 :mod:`pickle` 那样支持所有的 Python 对象，但我们强烈建议切换到 JSON 序列化的值。此外，由于 JSON 要求使用字符串键，如果在 ``request.session`` 中使用非字符串键，可能会遇到问题。有关更多详细信息，请参阅 :ref:`session_serialization` 文档。

source: Django 1.5.4 release notes
id: Catatan terbitan Django 1.5.4
zh_hans: Django 1.5.4 版本发行说明

source: This is Django 1.5.4, the fourth release in the Django 1.5 series. It addresses two security issues and one bug.
id: Ini adalah Django 1.5.4, terbitan keempat di rangkaian Django 1.5. Itu mengalamatkan dua masalah keamanan dan satu kesalahan.
zh_hans: 这是 Django 1.5.4，是 Django 1.5 系列的第四个版本。它解决了两个安全问题和一个 bug 。

source: As of 1.5.4, Django's authentication framework imposes a 4096-byte limit on passwords, and will fail authentication with any submitted password of greater length.
id: Sejak kerangka kerja otentifikasi Django 1.5.4 memaksa batasan 4096-byte di sandi, dan otentifikasi akan gagal dengan sandi apapun yang diajukan dari panjang lebih besar.
zh_hans: 从 1.5.4 版本开始，Django 的身份验证框架对密码设置了 4096 字节的限制，如果提交的密码长度超过限制，身份验证将失败。

source: Fixed a bug that prevented a ``QuerySet`` that uses :meth:`~django.db.models.query.QuerySet.prefetch_related` from being pickled and unpickled more than once (the second pickling attempt raised an exception) (#21102).
id: Diperbaiki sebuah kesalahan yang mencegah sebuah ``QuerySet`` yang menggunakan :meth:`~django.db.models.query.QuerySet.prefetch_related` dari menjadi kesulitan dan tidak kesulitan lebih dari sekali (kesulitan kedua berusaha memunculkan sebuah pengecualian) (#21102).
zh_hans: 修复了一个 bug，该 bug 阻止了使用 :meth:`~django.db.models.query.QuerySet.prefetch_related` 的查询集被多次 pickled 和 unpickled（第二次 pickling 尝试会引发异常）(#21102)。

source: Django 1.5.5 release notes
id: Catatan terbitan Django 1.5.5
zh_hans: Django 1.5.5 版本发行说明

source: Django 1.5.5 fixes a couple security-related bugs and several other bugs in the 1.5 series.
id: Django 1.5.5 memperbaiki sepasang kesalahan terkait-keamanan dan beberapa kesalahan lain di rangkaian 1.5.
zh_hans: Django 1.5.5 修复了一些与安全相关的错误以及 1.5 系列中的其他几个错误。

source: Django 1.5.4 imposes a 4096-byte limit on passwords in order to mitigate a denial-of-service attack through submission of bogus but extremely large passwords. In Django 1.5.5, we've reverted this change and instead improved the speed of our PBKDF2 algorithm by not rehashing the key on every iteration.
id: Django 1.5.4 menyebabkan batasan 4096-byte pada sandi agar mengurangi serangan denial-of-service melalui pengajuan tiruan tetapi sandi sangat besar. Di Django 1.4.9, kami telah merubah perubahan ini dan malah memperbaiki kecepatan dari algoritma PBKDF2 kami dengan tidak mengacak kembali kunci pada setiap putaran.
zh_hans: Django 1.5.4 为了减轻通过提交虚假但极其大的密码进行的拒绝服务攻击，对密码设置了 4096 字节的限制。在 Django 1.5.5 中，我们撤销了这一更改，改为通过不在每次迭代中重新计算哈希密钥来提高 PBKDF2 算法的速度。

source: Properly rotate CSRF token on login
id: Perputaran tepat token CSRF pada masuk
zh_hans: 登录时正确地轮换 CSRF 令牌

source: This behavior introduced as a security hardening measure in Django 1.5.2 did not work properly and is now fixed.
id: Perilaku ini diperkenalkan sebagai pengukuran pengerasan keamanan di Django 1.5.2 tidak bekerja dengan benar dan sekarang diperbaiki.
zh_hans: 这个在 Django 1.5.2 中作为安全加固措施引入的行为没有正常工作，现已修复。

source: Fixed a Python 3 incompatibility in ``django.utils.text.unescape_entities()`` (#21185).
id: Diperbaiki ketidaksesuaian Python 3 di ``django.utils.text.unescape_entities()`` (#21185).
zh_hans: 修复了 ``django.utils.text.unescape_entities()`` 中的 Python 3 不兼容问题 (#21185)。

source: Fixed a couple data corruption issues with ``QuerySet`` edge cases under Oracle and MySQL (#21203, #21126).
id: Diperbaiki masalah kerusakan sepasang data dengan sisi kasus ``QuerySet`` dibawah Oracle dan MySQL (#21203, #21126).
zh_hans: 修复了在 Oracle 和 MySQL 下的一些 ``QuerySet`` 边缘情况下的数据损坏问题 (#21203, #21126)。

source: Fixed crashes when using combinations of ``annotate()``, ``select_related()``, and ``only()`` (#16436).
id: Diperbaiki kegagalan ketika menggunakan perpaduan dari ``annotate()``, ``select_related()``, dan ``only()`` (#16436).
zh_hans: 修复了在使用 ``annotate()``, ``select_related()`` 和 ``only()`` 的组合时引发崩溃的问题 (#16436)。

source: The undocumented ``django.core.servers.basehttp.WSGIServerException`` has been removed. Use ``socket.error`` provided by the standard library instead.
id: ``django.core.servers.basehttp.WSGIServerException`` tidak terdokumentasi telah dipindahkan. Gunakan ``socket.error`` disediakan oleh pustaka standar sebagai gantinya.
zh_hans: 已删除未记录的 ``django.core.servers.basehttp.WSGIServerException``。请改用标准库提供的 ``socket.error``。

source: Django 1.5.6 release notes
id: Catatan terbitan Django 1.5.6
zh_hans: Django 1.5.6 版本发行说明

source: Django 1.5.6 fixes several bugs in 1.5.5, including three security issues.
id: Django 1.5.6 memperbaiki beberapa kesalahan di 1.5.5, termasuk tiga masalah keamanan.
zh_hans: Django 1.5.6 修复了 1.5.5 中的多个错误，包括三个安全问题。

source: Fixed :class:`~django.contrib.auth.backends.ModelBackend` raising ``UnboundLocalError`` if :func:`~django.contrib.auth.get_user_model` raised an error (#21439).
id: Diperbaiki :class:`~django.contrib.auth.backends.ModelBackend` memunculkan ``UnboundLocalError`` jika :func:`~django.contrib.auth.get_user_model` memunculkan sebuah kesalahan (#21439).
zh_hans: 修复了如果 :func:`~django.contrib.auth.get_user_model` 引发错误时， :class:`~django.contrib.auth.backends.ModelBackend` 引发 ``UnboundLocalError`` 的问题 (#21439)。

source: Additionally, Django's vendored version of six, ``django.utils.six``, has been upgraded to the latest release (1.6.1).
id: Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.6.1).
zh_hans: 此外，Django 内置的 six 版本 ``django.utils.six`` 已升级到最新版本 (1.6.1)。

source: Django 1.5.7 release notes
id: Catatan terbitan Django 1.5.7
zh_hans: Django 1.5.7 版本发行说明

source: Django 1.5.7 fixes a regression in the 1.5.6 security release.
id: Django 1.5.7 memperbaiki pemulihan di terbitan keamanan 1.5.6.
zh_hans: Django 1.5.7 修复了 1.5.6 安全发布中的一个退化问题。

source: Django 1.5.8 release notes
id: Catatan terbitan Django 1.5.8
zh_hans: Django 1.5.8 版本发行说明

source: Django 1.5.8 fixes two security issues in 1.5.8.
id: Django 1.5.8 memperbaiki dua masalah keamanan di 1.5.8.
zh_hans: Django 1.5.8 修复了 1.5.8 中的两个安全问题。

source: Django 1.5.9 release notes
id: Catatan terbitan Django 1.5.9
zh_hans: Django 1.5.9 版本发行说明

source: Django 1.5.9 fixes several security issues in 1.5.8.
id: Django 1.5.9 memperbaiki beberapa masalah keamanan di 1.5.8.
zh_hans: Django 1.5.9 修复了 1.5.8 中的多个安全问题。

source: Django 1.6 release notes
id: Catatan terbitan Django 1.6
zh_hans: Django 1.6 版本发行说明

source: Dedicated to Malcolm Tredinnick
id: Dipersembahkan kepada Malcolm Tredinnick
zh_hans: 献给 Malcolm Tredinnick

source: On March 17, 2013, the Django project and the free software community lost a very dear friend and developer.
id: Pada 17 Maret 2013, proyek Django dan komunitas perangkat lunak bebas kehilangan teman dan pengembang.
zh_hans: 在 2013 年 3 月 17 日，Django 项目和自由软件社区失去了一位非常亲爱的朋友和开发者。

source: Malcolm was a long-time contributor to Django, a model community member, a brilliant mind, and a friend. His contributions to Django — and to many other open source projects — are nearly impossible to enumerate. Many on the core Django team had their first patches reviewed by him; his mentorship enriched us. His consideration, patience, and dedication will always be an inspiration to us.
zh_hans: Malcolm 是 Django 的长期贡献者，模范社区成员，一位聪明的人，也是我们的朋友。他对 Django 和其他许多开源项目的贡献几乎无法计数。 Django 核心团队中的许多人都是通过他审查第一批补丁，他的指导使我们受益匪浅。他的关心、耐心和奉献精神将永远激励着我们。

source: This release of Django is for Malcolm.
id: Terbitan Django ini untuk Malcolm.
zh_hans: 这个 Django 版本是为了纪念 Malcolm 而发布的。

source: -- The Django Developers
id: -- Pengembang Django
zh_hans: -- Django 开发者们

source: Welcome to Django 1.6!
id: Selamat datang di Django 1.6!
zh_hans: 欢迎使用 Django 1.6 ！

source: These release notes cover the :ref:`new features <whats-new-1.6>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.6>` you'll want to be aware of when upgrading from Django 1.5 or older versions. We've also dropped some features, which are detailed in :ref:`our deprecation plan <deprecation-removed-in-1.6>`, and we've :ref:`begun the deprecation process for some features <deprecated-features-1.6>`.
id: Catatan terbitan ini mencangkupi :ref:`new features <whats-new-1.6>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.6>` anda akan ingin menjadi waspada ketika meningkatkan dari Django 1.5 atau versi terlama. Kami telah membuang beberapa fitur, yang rinciannya di :ref:`our deprecation plan <deprecation-removed-in-1.6>`, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.6>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.6>`，以及从 Django 1.5 或更早版本升级时需要注意的一些 :ref:`向后不兼容的更改 <backwards-incompatible-1.6>`。我们还删除了一些功能，详细信息在 :ref:`我们的弃用计划 <deprecation-removed-in-1.6>` 中说明，同时我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-1.6>`。

source: Django 1.6, like Django 1.5, requires Python 2.6.5 or above. Python 3 is also officially supported. We **highly recommend** the latest minor release for each supported Python series (2.6.X, 2.7.X, 3.2.X, and 3.3.X).
id: Django 1.6, seperti Django 1.5, membutuhkan Python 2.6.5 atau diatasnya. Python 3 juga secara resmi didukung. Kami **sangat menganjurkan** terbitan kecil terakhir untuk setiap rangkaian Python yang didukung (2.6.X, 2.7.X, 3.2.X, and 3.3.X).
zh_hans: 与 Django 1.5 一样，Django 1.6 需要 Python 2.6.5 或更高版本。Python 3 也得到官方支持。我们 **强烈推荐** 使用每个支持的 Python 系列的最新次要版本（2.6.X、2.7.X、3.2.X 和 3.3.X）。

source: Django 1.6 will be the final release series to support Python 2.6; beginning with Django 1.7, the minimum supported Python version will be 2.7.
id: Django 1.6 akan menjadi rangkaian terbitan terakhir untuk mendukung Python 2.6; dimulai dengan Django 1.7, minimal dukungan versi Python akan menjadi 2.7.
zh_hans: Django 1.6 将是最后一个支持 Python 2.6 的发布系列；从 Django 1.7 开始，最低支持的 Python 版本将是 2.7 。

source: Python 3.4 is not supported, but support will be added in Django 1.7.
id: Python 3.4 tidak didukung, tetapi dukungan akan ditambahkan di Django 1.7.
zh_hans: Python 3.4 目前不被支持，但将在 Django 1.7 中添加支持。

source: What's new in Django 1.6
id: Apa yang baru di Django 1.6
zh_hans: Django 1.6 的新功能有哪些？

source: Simplified default project and app templates
id: Sederhanakan proyek awal dan cetakan aplikasi
zh_hans: 简化了默认的项目和应用模板

source: The default templates used by :djadmin:`startproject` and :djadmin:`startapp` have been simplified and modernized. The :doc:`admin </ref/contrib/admin/index>` is now enabled by default in new projects; the :doc:`sites </ref/contrib/sites>` framework no longer is. :ref:`clickjacking prevention <clickjacking-prevention>` is now on and the database defaults to SQLite.
id: Cetakan awalan digunakan oleh :djadmin:`startproject` dan :djadmin:`startapp` telah disederhanakan dan dimodernisasikan. :doc:`admin </ref/contrib/admin/index>` sekarng diadakan secara awalan di proyek baru; kerangka kerja :doc:`sites </ref/contrib/sites>` tidak lagi. :ref:`clickjacking prevention <clickjacking-prevention>` sekarang di dan awalan basisdata pada SQLite.
zh_hans: :djadmin:`startproject` 和 :djadmin:`startapp` 使用的默认模板已经简化和现代化。新项目默认启用 :doc:`admin </ref/contrib/admin/index>`，不再使用 :doc:`sites </ref/contrib/sites>` 框架。:ref:`防止点击劫持 <clickjacking-prevention>` 现在默认开启，数据库默认为 SQLite。

source: If the default templates don't suit your tastes, you can use :ref:`custom project and app templates <custom-app-and-project-templates>`.
id: Jika awalan cetakan tidak cocok dengan rasa anda, anda dapat menggunakan :ref:`custom project and app templates <custom-app-and-project-templates>`.
zh_hans: 如果默认模板不符合您的喜好，您可以使用 :ref:`自定义项目和应用程序模板 <custom-app-and-project-templates>`。

source: Improved transaction management
id: Perbaikan pengelolaan transaksi
zh_hans: 改进了事务管理

source: Django's transaction management was overhauled. Database-level autocommit is now turned on by default. This makes transaction handling more explicit and should improve performance. The existing APIs were deprecated, and new APIs were introduced, as described in the :doc:`transaction management docs </topics/db/transactions>`.
id: Pengelolaan transaksi Django dirombak. Tingkat-basisdata pembenaran otomatis sekarang nyala sebagai awalan. Ini membuat penanganan transaksi lebih jelas dan harus meningkatkan penampilan. API yang ada diusangkan, dan API baru telah diperkenalkan, sebagai digambarkan di :doc:`transaction management docs </topics/db/transactions>`.
zh_hans: Django 的事务管理经过了彻底改进。现在默认情况下已经打开了数据库级别的自动提交。这使得事务处理更加明确，并应该提高性能。现有的 API 已被弃用，并引入了新的 API，详情请参阅 :doc:`事务管理文档 </topics/db/transactions>`。

source: Persistent database connections
id: Hubungan basisdata gigih
zh_hans: 引入了持久性数据库连接

source: Django now supports reusing the same database connection for several requests. This avoids the overhead of reestablishing a connection at the beginning of each request. For backwards compatibility, this feature is disabled by default. See :ref:`persistent-database-connections` for details.
zh_hans: Django 现在支持在多个请求中重复使用同一个数据库连接。这可以避免在每个请求开始时重新建立连接的开销。出于向后兼容性考虑，此功能默认是禁用的。请查看 :ref:`persistent-database-connections` 以获取详细信息。

source: Discovery of tests in any test module
id: Penemuan percobaan di tiap modul percobaan
zh_hans: 能够发现任何测试模块中的测试

source: Django 1.6 ships with a new test runner that allows more flexibility in the location of tests. The previous runner (``django.test.simple.DjangoTestSuiteRunner``) found tests only in the ``models.py`` and ``tests.py`` modules of a Python package in :setting:`INSTALLED_APPS`.
id: Django 1.6 dibekali dengan pejalan percobaan baru yang mengizinkan lebih keluwesan di tempat dari percobaan. Pejalan sebelumnya (``django.test.simple.DjangoTestSuiteRunner``) menemukan percobaan hanya di modul ``models.py`` dan ``tests.py`` dari paket Python di :setting:`INSTALLED_APPS`.
zh_hans: Django 1.6 提供了一个新的测试运行器，允许更灵活地定位测试。之前的运行器（``django.test.simple.DjangoTestSuiteRunner``）只在 :setting:`INSTALLED_APPS` 中的 Python 包的 ``models.py`` 和 ``tests.py`` 模块中找到测试。

source: The new runner (``django.test.runner.DiscoverRunner``) uses the test discovery features built into ``unittest2`` (the version of ``unittest`` in the Python 2.7+ standard library, and bundled with Django). With test discovery, tests can be located in any module whose name matches the pattern ``test*.py``.
id: Pejalan baru (``django.test.runner.DiscoverRunner``) menggunakan fitur penemuan percobaan dibangun kedalam ``unittest2`` (versi dari ``unittest`` di pustaka standar Python 2.7+, dan digabung dengan Django). Dengan penemuan percobaan, percobaan dapat ditempatkan di tiap modul yang namanya cocok dengan pola ``test*.py``.
zh_hans: 新的运行器（``django.test.runner.DiscoverRunner``）使用了内置于 ``unittest2`` 中的测试发现功能（Python 2.7+ 标准库中的 ``unittest`` 版本，与 Django 捆绑在一起）。使用测试发现，测试可以位于任何模块中，其名称匹配模式 ``test*.py``。

source: In addition, the test labels provided to ``./manage.py test`` to nominate specific tests to run must now be full Python dotted paths (or directory paths), rather than ``applabel.TestCase.test_method_name`` pseudo-paths. This allows running tests located anywhere in your codebase, rather than only in :setting:`INSTALLED_APPS`. For more details, see :doc:`/topics/testing/index`.
id: Sebagai tambahan, label percobaan disediakan pada ``./manage.py test`` untuk menunjuk percobaan khusus untuk berjalan harus sekarang menjadi jalur bertitik Python penuh (atau jalur direktori), daripada halur-semu ``applabel.TestCase.test_method_name``. Ini mengizinkan menjalankan percobaan ditempatkan dimana saja di basis kode anda, daripada hanya di :setting:`INSTALLED_APPS`. Untuk rincian lebih, lihat :doc:`/topics/testing/index`.
zh_hans: 此外，提供给 ``./manage.py test`` 的测试标签，用于指定要运行的特定测试，现在必须是完整的 Python 点路径（或目录路径），而不是伪路径 ``applabel.TestCase.test_method_name``。这允许运行位于代码库中任何位置的测试，而不仅仅是 :setting:`INSTALLED_APPS` 中的测试。有关更多详细信息，请参阅 :doc:`/topics/testing/index`。

source: This change is backwards-incompatible; see the :ref:`backwards-incompatibility notes<new-test-runner>`.
id: Perubahan ini adalah kesesuaian-kebelakang; lihat :ref:`backwards-incompatibility notes<new-test-runner>`.
zh_hans: 这个改变是向后不兼容的，请参阅 :ref:`向后不兼容的说明<new-test-runner>`。

source: Time zone aware aggregation
id: Mengetahui pengumpulan zona waktu
zh_hans: 时区感知的聚合

source: The support for :doc:`time zones </topics/i18n/timezones>` introduced in Django 1.4 didn't work well with :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>`: aggregation was always performed in UTC. This limitation was lifted in Django 1.6. Use :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` to perform time zone aware aggregation on a :class:`~django.db.models.DateTimeField`.
id: Dukungan untuk :doc:`time zones </topics/i18n/timezones>` diperkenalkan di DJango 1.4 tidak bekerja baik dengan :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>`: pengumpulan selalu dilakukan di UTC. Batasan ini telah diangkat di Django 1.6. Gunakan :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`untuk melakukan mengetahui pengumpulan zona waktu di :class:`~django.db.models.DateTimeField`.
zh_hans: Django 1.4 中引入的对 :doc:`时区 </topics/i18n/timezones>` 的支持在 :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` 上并不完善：聚合总是在 UTC 中执行。在 Django 1.6 中解除了这个限制。使用 :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` 来对 :class:`~django.db.models.DateTimeField` 进行时区感知的聚合。

source: Support for savepoints in SQLite
id: Dukungan untuk savepoint di SQLite
zh_hans: 在 SQLite 中支持保存点（savepoints）

source: Django 1.6 adds support for savepoints in SQLite, with some :ref:`limitations <savepoints-in-sqlite>`.
id: Django 1.6 menambahkan dukungan untuk savepoint di SQLite, dengan beberapa :ref:`limitations <savepoints-in-sqlite>`.
zh_hans: Django 1.6 在 SQLite 中添加了对保存点的支持，但存在一些 :ref:`限制 <savepoints-in-sqlite>`。

source: ``BinaryField`` model field
id: Bidang model ``BinaryField``
zh_hans: ``BinaryField`` 模型字段

source: A new :class:`django.db.models.BinaryField` model field allows storage of raw binary data in the database.
id: Bidang model :class:`django.db.models.BinaryField` baru mengizinkan penyimpanan dari data biner mentah di basisdata.
zh_hans: 新的 :class:`django.db.models.BinaryField` 模型字段允许在数据库中存储原始二进制数据。

source: GeoDjango form widgets
id: GeoDjango dari widget
zh_hans: GeoDjango 表单小部件

source: GeoDjango now provides :doc:`form fields and widgets </ref/contrib/gis/forms-api>` for its geo-specialized fields. They are OpenLayers-based by default, but they can be customized to use any other JS framework.
id: GeoDjango sekarang menyediakan :doc:`form fields and widgets </ref/contrib/gis/forms-api>` untuk bidang khusus-geo nya. Mereka adalah berdasarkan-OpenLayer secara awalan, tetapi mereka dapat disesuaiakan untuk menggunakan apapun kerangka kerja JS lain.
zh_hans: GeoDjango 现在为其地理专用字段提供了 :doc:`表单字段和小部件 </ref/contrib/gis/forms-api>`。它们默认使用 OpenLayers，但可以自定义为使用任何其他 JavaScript 框架。
