Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Permission escalation in intermediate-level directories of the file system cache on Python 3.7+. `Full description <https://www.djangoproject.com/weblog/2020/sep/01/security-releases/>`__
zh_hans: 在 Python 3.7+ 上，文件系统缓存的中间层目录的权限升级。`完整说明 <https://www.djangoproject.com/weblog/2020/sep/01/security-releases/>`__

source: Django 3.1 :commit:`(patch) <2b099caa5923afa8cfb5f1e8c0d56b6e0e81915b>`
zh_hans: Django 3.1 :commit:`（补丁） <2b099caa5923afa8cfb5f1e8c0d56b6e0e81915b>`

source: Django 3.0 :commit:`(patch) <cdb367c92a0ba72ddc0cbd13ff42b0e6df709554>`
zh_hans: Django 3.0 :commit:`（补丁） <cdb367c92a0ba72ddc0cbd13ff42b0e6df709554>`

source: Django 2.2 :commit:`(patch) <a3aebfdc8153dc230686b6d2454ccd32ed4c9e6f>`
zh_hans: Django 2.2 :commit:`（补丁） <a3aebfdc8153dc230686b6d2454ccd32ed4c9e6f>`

source: September 1, 2020 - :cve:`2020-24583`
zh_hans: 2020 年 9 月 1 日 - :cve:`2020-24583`

source: Incorrect permissions on intermediate-level directories on Python 3.7+. `Full description <https://www.djangoproject.com/weblog/2020/sep/01/security-releases/>`__
zh_hans: 在 Python 3.7+ 上，中间层目录的权限不正确。`完整说明 <https://www.djangoproject.com/weblog/2020/sep/01/security-releases/>`__

source: Django 3.1 :commit:`(patch) <934430d22aa5d90c2ba33495ff69a6a1d997d584>`
zh_hans: Django 3.1 :commit:`（补丁） <934430d22aa5d90c2ba33495ff69a6a1d997d584>`

source: Django 3.0 :commit:`(patch) <08892bffd275c79ee1f8f67639eb170aaaf1181e>`
zh_hans: Django 3.0 :commit:`（补丁） <08892bffd275c79ee1f8f67639eb170aaaf1181e>`

source: Django 2.2 :commit:`(patch) <375657a71c889c588f723469bd868bd1d40c369f>`
zh_hans: Django 2.2 :commit:`（补丁） <375657a71c889c588f723469bd868bd1d40c369f>`

source: June 3, 2020 - :cve:`2020-13596`
zh_hans: 2020 年 6 月 3 日 - :cve:`2020-13596`

source: Possible XSS via admin ``ForeignKeyRawIdWidget``. `Full description <https://www.djangoproject.com/weblog/2020/jun/03/security-releases/>`__
zh_hans: 可能通过管理 ``ForeignKeyRawIdWidget`` 进行 XSS。`完整说明 <https://www.djangoproject.com/weblog/2020/jun/03/security-releases/>`__

source: Django 3.0 :commit:`(patch) <1f2dd37f6fcefdd10ed44cb233b2e62b520afb38>`
zh_hans: Django 3.0 :commit:`（补丁） <1f2dd37f6fcefdd10ed44cb233b2e62b520afb38>`

source: Django 2.2 :commit:`(patch) <6d61860b22875f358fac83d903dc629897934815>`
zh_hans: Django 2.2 :commit:`（补丁） <6d61860b22875f358fac83d903dc629897934815>`

source: June 3, 2020 - :cve:`2020-13254`
zh_hans: 2020 年 6 月 3 日 - :cve:`2020-13254`

source: Potential data leakage via malformed memcached keys. `Full description <https://www.djangoproject.com/weblog/2020/jun/03/security-releases/>`__
zh_hans: 通过畸形的 memcached 密钥可能造成数据泄露。`完整说明 <https://www.djangoproject.com/weblog/2020/jun/03/security-releases/>`__

source: Django 3.0 :commit:`(patch) <84b2da5552e100ae3294f564f6c862fef8d0e693>`
zh_hans: Django 3.0 :commit:`（补丁） <84b2da5552e100ae3294f564f6c862fef8d0e693>`

source: Django 2.2 :commit:`(patch) <07e59caa02831c4569bbebb9eb773bdd9cb4b206>`
zh_hans: Django 2.2 :commit:`（补丁） <07e59caa02831c4569bbebb9eb773bdd9cb4b206>`

source: March 4, 2020 - :cve:`2020-9402`
zh_hans: 2020 年 3 月 4 日 - :cve:`2020-9402`

source: Potential SQL injection via ``tolerance`` parameter in GIS functions and aggregates on Oracle. `Full description <https://www.djangoproject.com/weblog/2020/mar/04/security-releases/>`__
zh_hans: 针对 Oracle 数据库， 通过 GIS 函数和聚合函数中的 ``tolerance`` 参数带来的潜在 SQL 注入。`完整说明 <https://www.djangoproject.com/weblog/2020/mar/04/security-releases/>`__

source: Django 3.0 :commit:`(patch) <26a5cf834526e291db00385dd33d319b8271fc4c>`
zh_hans: Django 3.0 :commit:`（补丁） <26a5cf834526e291db00385dd33d319b8271fc4c>`

source: Django 2.2 :commit:`(patch) <fe886a3b58a93cfbe8864b485f93cb6d426cd1f2>`
zh_hans: Django 2.2 :commit:`（补丁） <fe886a3b58a93cfbe8864b485f93cb6d426cd1f2>`

source: Django 1.11 :commit:`(patch) <02d97f3c9a88adc890047996e5606180bd1c6166>`
zh_hans: Django 1.11 :commit:`（补丁） <02d97f3c9a88adc890047996e5606180bd1c6166>`

source: February 3, 2020 - :cve:`2020-7471`
zh_hans: 2020 年 2 月 3 日 - :cve:`2020-7471`

source: Potential SQL injection via ``StringAgg(delimiter)``. `Full description <https://www.djangoproject.com/weblog/2020/feb/03/security-releases/>`__
zh_hans: 通过 ``StringAgg(delimiter)`` 带来的潜在 SQL 注入。 `完整说明 <https://www.djangoproject.com/weblog/2020/feb/03/security-releases/>`__

source: Django 3.0 :commit:`(patch) <505826b469b16ab36693360da9e11fd13213421b>`
zh_hans: Django 3.0 :commit:`（补丁） <505826b469b16ab36693360da9e11fd13213421b>`

source: Django 2.2 :commit:`(patch) <c67a368c16e4680b324b4f385398d638db4d8147>`
zh_hans: Django 2.2 :commit:`（补丁） <c67a368c16e4680b324b4f385398d638db4d8147>`

source: Django 1.11 :commit:`(patch) <001b0634cd309e372edb6d7d95d083d02b8e37bd>`
zh_hans: Django 1.11 :commit:`（补丁） <001b0634cd309e372edb6d7d95d083d02b8e37bd>`

source: December 18, 2019 - :cve:`2019-19844`
zh_hans: 2019 年 12 月 18 日 - :cve:`2019-19844`

source: Potential account hijack via password reset form. `Full description <https://www.djangoproject.com/weblog/2019/dec/18/security-releases/>`__
zh_hans: 通过密码重置表单带来的潜在账户劫持。`完整说明 <https://www.djangoproject.com/weblog/2019/dec/18/security-releases/>`__

source: Django 3.0 :commit:`(patch) <302a4ff1e8b1c798aab97673909c7a3dfda42c26>`
zh_hans: Django 3.0 :commit:`（补丁） <302a4ff1e8b1c798aab97673909c7a3dfda42c26>`

source: Django 2.2 :commit:`(patch) <4d334bea06cac63dc1272abcec545b85136cca0e>`
zh_hans: Django 2.2 :commit:`（补丁） <4d334bea06cac63dc1272abcec545b85136cca0e>`

source: Django 1.11 :commit:`(patch) <f4cff43bf921fcea6a29b726eb66767f67753fa2>`
zh_hans: Django 1.11 :commit:`（补丁） <f4cff43bf921fcea6a29b726eb66767f67753fa2>`

source: December 2, 2019 - :cve:`2019-19118`
zh_hans: 2019 年 12 月 2 日 - :cve:`2019-19118`

source: Privilege escalation in the Django admin. `Full description <https://www.djangoproject.com/weblog/2019/dec/02/security-releases/>`__
zh_hans: 在 Django 管理中的特权提升。`完整说明 <https://www.djangoproject.com/weblog/2019/dec/02/security-releases/>`__

source: Django 3.0 :commit:`(patch) <092cd66cf3c3e175acce698d6ca2012068d878fa>`
zh_hans: Django 3.0 :commit:`（补丁） <092cd66cf3c3e175acce698d6ca2012068d878fa>`

source: Django 2.2 :commit:`(patch) <36f580a17f0b3cb087deadf3b65eea024f479c21>`
zh_hans: Django 2.2 :commit:`（补丁） <36f580a17f0b3cb087deadf3b65eea024f479c21>`

source: Django 2.1 :commit:`(patch) <103ebe2b5ff1b2614b85a52c239f471904d26244>`
zh_hans: Django 2.1 :commit:`（补丁） <103ebe2b5ff1b2614b85a52c239f471904d26244>`

source: August 1, 2019 - :cve:`2019-14235`
zh_hans: 2019 年 8 月 1 日 - :cve:`2019-14235`

source: Potential memory exhaustion in ``django.utils.encoding.uri_to_iri()``. `Full description <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__
zh_hans: 在 ``django.utils.encoding.uri_to_iri()`` 函数中潜在的内存耗尽。 `完整说明 <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__

source: Django 2.2 :commit:`(patch) <cf694e6852b0da7799f8b53f1fb2f7d20cf17534>`
zh_hans: Django 2.2 :commit:`（补丁） <cf694e6852b0da7799f8b53f1fb2f7d20cf17534>`

source: Django 2.1 :commit:`(patch) <5d50a2e5fa36ad23ab532fc54cf4073de84b3306>`
zh_hans: Django 2.1 :commit:`（补丁） <5d50a2e5fa36ad23ab532fc54cf4073de84b3306>`

source: Django 1.11 :commit:`(patch) <869b34e9b3be3a4cfcb3a145f218ffd3f5e3fd79>`
zh_hans: Django 1.11 :commit:`（补丁） <869b34e9b3be3a4cfcb3a145f218ffd3f5e3fd79>`

source: August 1, 2019 - :cve:`2019-14234`
zh_hans: 2019 年 8 月 1 日 - :cve:`2019-14234`

source: SQL injection possibility in key and index lookups for ``JSONField``/``HStoreField``. `Full description <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__
zh_hans: 针对 ``JSONField`` ／``HStoreField`` 在键和索引查询时带来的潜在 SQL 注入。 `完整说明 <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__

source: Django 2.2 :commit:`(patch) <4f5b58f5cd3c57fee9972ab074f8dc6895d8f387>`
zh_hans: Django 2.2 :commit:`（补丁） <4f5b58f5cd3c57fee9972ab074f8dc6895d8f387>`

source: Django 2.1 :commit:`(patch) <f74b3ae3628c26e1b4f8db3d13a91d52a833a975>`
zh_hans: Django 2.1 :commit:`（补丁） <f74b3ae3628c26e1b4f8db3d13a91d52a833a975>`

source: Django 1.11 :commit:`(patch) <ed682a24fca774818542757651bfba576c3fc3ef>`
zh_hans: Django 1.11 :commit:`（补丁） <ed682a24fca774818542757651bfba576c3fc3ef>`

source: August 1, 2019 - :cve:`2019-14233`
zh_hans: 2019 年 8 月 1 日 - :cve:`2019-14233`

source: Denial-of-service possibility in ``strip_tags()``. `Full description <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__
zh_hans: 存在于 ``strip_tags()`` 函数的拒绝服务攻击。`完整说明 <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__

source: Django 2.2 :commit:`(patch) <e34f3c0e9ee5fc9022428fe91640638bafd4cda7>`
zh_hans: Django 2.2 :commit:`（补丁） <e34f3c0e9ee5fc9022428fe91640638bafd4cda7>`

source: Django 2.1 :commit:`(patch) <5ff8e791148bd451180124d76a55cb2b2b9556eb>`
zh_hans: Django 2.1 :commit:`（补丁） <5ff8e791148bd451180124d76a55cb2b2b9556eb>`

source: Django 1.11 :commit:`(patch) <52479acce792ad80bb0f915f20b835f919993c72>`
zh_hans: Django 1.11 :commit:`（补丁） <52479acce792ad80bb0f915f20b835f919993c72>`

source: August 1, 2019 - :cve:`2019-14232`
zh_hans: 2019 年 8 月 1 日 - :cve:`2019-14232`

source: Denial-of-service possibility in ``django.utils.text.Truncator``. `Full description <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__
zh_hans: 存在于 ``django.utils.text.Truncator`` 的拒绝服务攻击。`完整说明 <https://www.djangoproject.com/weblog/2019/aug/01/security-releases/>`__

source: Django 2.2 :commit:`(patch) <c3289717c6f21a8cf23daff1c78c0c014b94041f>`
zh_hans: Django 2.2 :commit:`（补丁） <c3289717c6f21a8cf23daff1c78c0c014b94041f>`

source: Django 2.1 :commit:`(patch) <c23723a1551340cc7d3126f04fcfd178fa224193>`
zh_hans: Django 2.1 :commit:`（补丁） <c23723a1551340cc7d3126f04fcfd178fa224193>`

source: Django 1.11 :commit:`(patch) <42a66e969023c00536256469f0e8b8a099ef109d>`
zh_hans: Django 1.11 :commit:`（补丁） <42a66e969023c00536256469f0e8b8a099ef109d>`

source: July 1, 2019 - :cve:`2019-12781`
zh_hans: 2019 年 7 月 1 日 - :cve:`2019-12781`

source: Incorrect HTTP detection with reverse-proxy connecting via HTTPS. `Full description <https://www.djangoproject.com/weblog/2019/jul/01/security-releases/>`__
zh_hans: 通过 HTTPS 连接反向代理的 HTTP 检测不正确。。`完整说明 <https://www.djangoproject.com/weblog/2019/jul/01/security-releases/>`__

source: Django 2.2 :commit:`(patch) <77706a3e4766da5d5fb75c4db22a0a59a28e6cd6>`
zh_hans: Django 2.2 :commit:`（补丁） <77706a3e4766da5d5fb75c4db22a0a59a28e6cd6>`

source: Django 2.1 :commit:`(patch) <1e40f427bb8d0fb37cc9f830096a97c36c97af6f>`
zh_hans: Django 2.1 :commit:`（补丁） <1e40f427bb8d0fb37cc9f830096a97c36c97af6f>`

source: Django 1.11 :commit:`(patch) <32124fc41e75074141b05f10fc55a4f01ff7f050>`
zh_hans: Django 1.11 :commit:`（补丁） <32124fc41e75074141b05f10fc55a4f01ff7f050>`

source: June 3, 2019 - :cve:`2019-12308`
zh_hans: 2019 年 6 月 3 日 - :cve:`2019-12308`

source: XSS via "Current URL" link generated by ``AdminURLFieldWidget``. `Full description <https://www.djangoproject.com/weblog/2019/jun/03/security-releases/>`__
zh_hans: 由 ``AdminURLFieldWidget`` 生成的 “Current URL” 连接引起的跨站脚本漏洞。`完整说明 <https://www.djangoproject.com/weblog/2019/jun/03/security-releases/>`__

source: Django 2.2 :commit:`(patch) <afddabf8428ddc89a332f7a78d0d21eaf2b5a673>`
zh_hans: Django 2.2 :commit:`（补丁） <afddabf8428ddc89a332f7a78d0d21eaf2b5a673>`

source: Django 2.1 :commit:`(patch) <09186a13d975de6d049f8b3e05484f66b01ece62>`
zh_hans: Django 2.1 :commit:`（补丁） <09186a13d975de6d049f8b3e05484f66b01ece62>`

source: Django 1.11 :commit:`(patch) <c238701859a52d584f349cce15d56c8e8137c52b>`
zh_hans: Django 1.11 :commit:`（补丁） <c238701859a52d584f349cce15d56c8e8137c52b>`

source: June 3, 2019 - :cve:`2019-11358`
zh_hans: 2019 年 6 月 3 日 - :cve:`2019-11358`

source: Prototype pollution in bundled jQuery. `Full description <https://www.djangoproject.com/weblog/2019/jun/03/security-releases/>`__
zh_hans: 捆绑 jQuery 的原型污染。`完整说明 <https://www.djangoproject.com/weblog/2019/jun/03/security-releases/>`__

source: Django 2.2 :commit:`(patch) <baaf187a4e354bf3976c51e2c83a0d2f8ee6e6ad>`
zh_hans: Django 2.2 :commit:`（补丁） <baaf187a4e354bf3976c51e2c83a0d2f8ee6e6ad>`

source: Django 2.1 :commit:`(patch) <95649bc08547a878cebfa1d019edec8cb1b80829>`
zh_hans: Django 2.1 :commit:`（补丁） <95649bc08547a878cebfa1d019edec8cb1b80829>`

source: February 11, 2019 - :cve:`2019-6975`
zh_hans: 2019 年 2 月 11 日 - :cve:`2019-6975`

source: Memory exhaustion in ``django.utils.numberformat.format()``. `Full description <https://www.djangoproject.com/weblog/2019/feb/11/security-releases/>`__
zh_hans: ``django.utils.numberformat.format()`` 中内存耗尽。`完整说明 <https://www.djangoproject.com/weblog/2019/feb/11/security-releases/>`__

source: Django 2.1 :commit:`(patch) <40cd19055773705301c3428ed5e08a036d2091f3>`
zh_hans: Django 2.1 :commit:`（补丁） <40cd19055773705301c3428ed5e08a036d2091f3>`

source: Django 2.0 :commit:`(patch <1f42f82566c9d2d73aff1c42790d6b1b243f7676>` and :commit:`correction) <392e040647403fc8007708d52ce01d915b014849>`
zh_hans: Django 2.0 :commit:`（补丁 <1f42f82566c9d2d73aff1c42790d6b1b243f7676>` 和 :commit:`修正） <392e040647403fc8007708d52ce01d915b014849>`

source: Django 1.11 :commit:`(patch) <0bbb560183fabf0533289700845dafa94951f227>`
zh_hans: Django 1.11 :commit:`（补丁） <0bbb560183fabf0533289700845dafa94951f227>`

source: January 4, 2019 - :cve:`2019-3498`
zh_hans: 2019 年 1 月 4 日 - :cve:`2019-3498`

source: Content spoofing possibility in the default 404 page. `Full description <https://www.djangoproject.com/weblog/2019/jan/04/security-releases/>`__
zh_hans: 默认 404 页面存在内容欺骗的可能。`完整说明 <https://www.djangoproject.com/weblog/2019/jan/04/security-releases/>`__

source: Django 2.1 :commit:`(patch) <64d2396e83aedba3fcc84ca40f23fbd22f0b9b5b>`
zh_hans: Django 2.1 :commit:`（补丁） <64d2396e83aedba3fcc84ca40f23fbd22f0b9b5b>`

source: Django 2.0 :commit:`(patch) <9f4ed7c94c62e21644ef5115e393ac426b886f2e>`
zh_hans: Django 2.0 :commit:`（补丁） <9f4ed7c94c62e21644ef5115e393ac426b886f2e>`

source: Django 1.11 :commit:`(patch) <1cd00fcf52d089ef0fe03beabd05d59df8ea052a>`
zh_hans: Django 1.11 :commit:`（补丁） <1cd00fcf52d089ef0fe03beabd05d59df8ea052a>`

source: October 1, 2018 - :cve:`2018-16984`
zh_hans: 2018 年 10 月 1 日 - :cve:`2018-16984`

source: Password hash disclosure to "view only" admin users. `Full description <https://www.djangoproject.com/weblog/2018/oct/01/security-release/>`__
zh_hans: 密码哈希值披露给了 “只看” 的管理员用户。`完整说明 <https://www.djangoproject.com/weblog/2018/oct/01/security-release/>`__

source: Django 2.1 :commit:`(patch) <c4bd5b597e0aa2432e4c867b86650f18af117851>`
zh_hans: Django 2.1 :commit:`（补丁） <c4bd5b597e0aa2432e4c867b86650f18af117851>`

source: August 1, 2018 - :cve:`2018-14574`
zh_hans: 2018 年 8 月 1 日 - :cve:`2018-14574`

source: Open redirect possibility in ``CommonMiddleware``. `Full description <https://www.djangoproject.com/weblog/2018/aug/01/security-releases/>`__
zh_hans: 在 ``CommonMiddleware`` 中开放重定向的可能性。`完整说明 <https://www.djangoproject.com/weblog/2018/aug/01/security-releases/>`__

source: Django 2.1 :commit:`(patch) <c4e5ff7fdb5fce447675e90291fd33fddd052b3c>`
zh_hans: Django 2.1 :commit:`（补丁） <c4e5ff7fdb5fce447675e90291fd33fddd052b3c>`

source: Django 2.0 :commit:`(patch) <6fffc3c6d420e44f4029d5643f38d00a39b08525>`
zh_hans: Django 2.0 :commit:`（补丁） <6fffc3c6d420e44f4029d5643f38d00a39b08525>`

source: Django 1.11 :commit:`(patch) <d6eaee092709aad477a9894598496c6deec532ff>`
zh_hans: Django 1.11 :commit:`（补丁） <d6eaee092709aad477a9894598496c6deec532ff>`

source: March 6, 2018 - :cve:`2018-7537`
zh_hans: 2018 年 3 月 6 日 - :cve:`2018-7537`

source: Denial-of-service possibility in ``truncatechars_html`` and ``truncatewords_html`` template filters. `Full description <https://www.djangoproject.com/weblog/2018/mar/06/security-releases/>`__
zh_hans: ``truncatechars_html`` 和 ``truncatewords_html`` 模板过滤器中存在拒绝服务的可能性。`完整说明 <https://www.djangoproject.com/weblog/2018/mar/06/security-releases/>`__

source: Django 2.0 :commit:`(patch) <94c5da1d17a6b0d378866c66b605102c19f7988c>`
zh_hans: Django 2.0 :commit:`（补丁） <94c5da1d17a6b0d378866c66b605102c19f7988c>`

source: Django 1.11 :commit:`(patch) <a91436360b79a6ff995c3e5018bcc666dfaf1539>`
zh_hans: Django 1.11 :commit:`（补丁） <a91436360b79a6ff995c3e5018bcc666dfaf1539>`

source: Django 1.8 :commit:`(patch) <d17974a287a6ea2e361daff88fcc004cbd6835fa>`
zh_hans: Django 1.8 :commit:`（补丁） <d17974a287a6ea2e361daff88fcc004cbd6835fa>`

source: March 6, 2018 - :cve:`2018-7536`
zh_hans: 2018 年 3 月 6 日 - :cve:`2018-7536`

source: Denial-of-service possibility in ``urlize`` and ``urlizetrunc`` template filters. `Full description <https://www.djangoproject.com/weblog/2018/mar/06/security-releases/>`__
zh_hans: ``urlize`` 和 ``urlizetrunc`` 模板过滤器中存在拒绝服务的可能性。`完整说明 <https://www.djangoproject.com/weblog/2018/mar/06/security-releases/>`__

source: Django 2.0 :commit:`(patch) <e157315da3ae7005fa0683ffc9751dbeca7306c8>`
zh_hans: Django 2.0 :commit:`（补丁） <e157315da3ae7005fa0683ffc9751dbeca7306c8>`

source: Django 1.11 :commit:`(patch) <abf89d729f210c692a50e0ad3f75fb6bec6fae16>`
zh_hans: Django 1.11 :commit:`（补丁） <abf89d729f210c692a50e0ad3f75fb6bec6fae16>`

source: Django 1.8 :commit:`(patch) <1ca63a66ef3163149ad822701273e8a1844192c2>`
zh_hans: Django 1.8 :commit:`（补丁） <1ca63a66ef3163149ad822701273e8a1844192c2>`

source: February 1, 2018 - :cve:`2018-6188`
zh_hans: 2018 年 2 月 1 日 - :cve:`2018-6188`

source: Information leakage in ``AuthenticationForm``. `Full description <https://www.djangoproject.com/weblog/2018/feb/01/security-releases/>`__
zh_hans: ``AuthenticationForm`` 中的信息泄露。`完整说明 <https://www.djangoproject.com/weblog/2018/feb/01/security-releases/>`__

source: Django 2.0 :commit:`(patch) <c37bb28677295f6edda61d8ac461014ef0d3aeb2>`
zh_hans: Django 2.0 :commit:`（补丁） <c37bb28677295f6edda61d8ac461014ef0d3aeb2>`

source: Django 1.11 :commit:`(patch) <57b95fedad5e0b83fc9c81466b7d1751c6427aae>`
zh_hans: Django 1.11 :commit:`（补丁） <57b95fedad5e0b83fc9c81466b7d1751c6427aae>`

source: September 5, 2017 - :cve:`2017-12794`
id: 5 September 2017 - :cve:`2017-12794`
zh_hans: 2017 年 9 月 5 日 - :cve:`2017-12794`

source: Possible XSS in traceback section of technical 500 debug page. `Full description <https://www.djangoproject.com/weblog/2017/sep/05/security-releases/>`__
id: Kemungkinan XSS di melacak kembali bagian dari halaman teknis mencari kesalahan 500. `Full description <https://www.djangoproject.com/weblog/2017/sep/05/security-releases/>`__
zh_hans: 在技术 500 调试页面的回溯部分可能存在 XSS。`完整说明 <https://www.djangoproject.com/weblog/2017/sep/05/security-releases/>`__

source: Django 1.11 :commit:`(patch) <e35a0c56086924f331e9422daa266e907a4784cc>`
zh_hans: Django 1.11 :commit:`（补丁） <e35a0c56086924f331e9422daa266e907a4784cc>`

source: Django 1.10 :commit:`(patch) <58e08e80e362db79eb0fd775dc81faad90dca47a>`
zh_hans: Django 1.10 :commit:`（补丁） <58e08e80e362db79eb0fd775dc81faad90dca47a>`

source: April 4, 2017 - :cve:`2017-7234`
id: 4 April 2017 - :cve:`2017-7234`
zh_hans: 2017 年 4 月 4 日 - :cve:`2017-7234`

source: Open redirect vulnerability in ``django.views.static.serve()``. `Full description <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__
id: Membuka kerentanan pangalihan dalam ``django.views.static.serve()``. `Full description <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__
zh_hans: ``django.views.static.service()`` 中的开放重定向漏洞。`完整说明 <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__

source: Django 1.10 :commit:`(patch) <2a9f6ef71b8e23fd267ee2be1be26dde8ab67037>`
zh_hans: Django 1.10 :commit:`（补丁） <2a9f6ef71b8e23fd267ee2be1be26dde8ab67037>`

source: Django 1.9 :commit:`(patch) <5f1ffb07afc1e59729ce2b283124116d6c0659e4>`
zh_hans: Django 1.9 :commit:`（补丁） <5f1ffb07afc1e59729ce2b283124116d6c0659e4>`

source: Django 1.8 :commit:`(patch) <4a6b945dffe8d10e7cec107d93e6efaebfbded29>`
zh_hans: Django 1.8 :commit:`（补丁） <4a6b945dffe8d10e7cec107d93e6efaebfbded29>`

source: April 4, 2017 - :cve:`2017-7233`
id: 4 April 2017 - :cve:`2017-7233`
zh_hans: 2017 年 4 月 4 日 - :cve:`2017-7233`

source: Open redirect and possible XSS attack via user-supplied numeric redirect URLs. `Full description <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__
id: Dibuka pengalihan dan kemungkinan serangan XSS melalui URL pengalihan numerik disokong-pengguna. `Full description <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__
zh_hans: 通过用户提供的数字重定向 URL 打开重定向和可能的 XSS 攻击。`完整说明 <https://www.djangoproject.com/weblog/2017/apr/04/security-releases/>`__

source: Django 1.10 :commit:`(patch) <f824655bc2c50b19d2f202d7640785caabc82787>`
zh_hans: Django 1.10 :commit:`（补丁） <f824655bc2c50b19d2f202d7640785caabc82787>`

source: Django 1.9 :commit:`(patch) <254326cb3682389f55f886804d2c43f7b9f23e4f>`
zh_hans: Django 1.9 :commit:`（补丁） <254326cb3682389f55f886804d2c43f7b9f23e4f>`

source: Django 1.8 :commit:`(patch) <8339277518c7d8ec280070a780915304654e3b66>`
zh_hans: Django 1.8 :commit:`（补丁） <8339277518c7d8ec280070a780915304654e3b66>`

source: November 1, 2016 - :cve:`2016-9014`
id: 1 November 2016 - :cve:`2016-9014`
zh_hans: 2016 年 11 月 1 日 - :cve:`2016-9014`

source: DNS rebinding vulnerability when ``DEBUG=True``. `Full description <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__
id: Kerentanan mengikat kembali ketika ``DEBUG=True``. `Full description <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__
zh_hans: 当 ``DEBUG=Tr`` 时，DNS 重绑定漏洞。`完整说明 <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__

source: Django 1.10 :commit:`(patch) <884e113838e5a72b4b0ec9e5e87aa480f6aa4472>`
zh_hans: Django 1.10 :commit:`（补丁） <884e113838e5a72b4b0ec9e5e87aa480f6aa4472>`

source: Django 1.9 :commit:`(patch) <45acd6d836895a4c36575f48b3fb36a3dae98d19>`
zh_hans: Django 1.9 :commit:`（补丁） <45acd6d836895a4c36575f48b3fb36a3dae98d19>`

source: Django 1.8 :commit:`(patch) <c401ae9a7dfb1a94a8a61927ed541d6f93089587>`
zh_hans: Django 1.8 :commit:`（补丁） <c401ae9a7dfb1a94a8a61927ed541d6f93089587>`

source: November 1, 2016 - :cve:`2016-9013`
id: 1 November 2016 - :cve:`2016-9013`
zh_hans: 2016 年 11 月 1 日 - :cve:`2016-9013`

source: User with hardcoded password created when running tests on Oracle. `Full description <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__
id: Pengguna dengan sandi kode keras sandi dibuat ketika menjalankan percobaan pada Oracle. `Full description <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__
zh_hans: 在 Oracle 上运行测试时创建的带有硬编码密码的用户。`完整说明 <https://www.djangoproject.com/weblog/2016/nov/01/security-releases/>`__

source: Django 1.10 :commit:`(patch) <34e10720d81b8d407aa14d763b6a7fe8f13b4f2e>`
zh_hans: Django 1.10 :commit:`（补丁） <34e10720d81b8d407aa14d763b6a7fe8f13b4f2e>`

source: Django 1.9 :commit:`(patch) <4844d86c7728c1a5a3bbce4ad336a8d32304072b>`
zh_hans: Django 1.9 :commit:`（补丁） <4844d86c7728c1a5a3bbce4ad336a8d32304072b>`

source: Django 1.8 :commit:`(patch) <70f99952965a430daf69eeb9947079aae535d2d0>`
zh_hans: Django 1.8 :commit:`（补丁） <70f99952965a430daf69eeb9947079aae535d2d0>`

source: September 26, 2016 - :cve:`2016-7401`
id: 26 September 2016 - :cve:`2016-7401`
zh_hans: 2016 年 9 月 26 日 - :cve:`2016-7401`

source: CSRF protection bypass on a site with Google Analytics. `Full description <https://www.djangoproject.com/weblog/2016/sep/26/security-releases/>`__
id: Pemotongan perlindungan CSRF pada situs dengan Google Analytics. `Full description <https://www.djangoproject.com/weblog/2016/sep/26/security-releases/>`__
zh_hans: 在有 Google Analytics 的网站上绕过 CSRF 保护。`完整说明 <https://www.djangoproject.com/weblog/2016/sep/26/security-releases/>`__

source: Django 1.9 :commit:`(patch) <d1bc980db1c0fffd6d60677e62f70beadb9fe64a>`
zh_hans: Django 1.9 :commit:`（补丁） <d1bc980db1c0fffd6d60677e62f70beadb9fe64a>`
