Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: In all :doc:`generic class-based views </topics/class-based-views/index>` (or any class-based view inheriting from ``ContextMixin``), the context dictionary contains a ``view`` variable that points to the ``View`` instance.
id: Di semua :doc:`generic class-based views </topics/class-based-views/index>` (atau tampilan berdasarkan-kelas apapun warisan dari ``ContextMixin``), kamus konteks mengandung sebuah variabel ``view`` yang menunjuk ke instance ``View``.
zh_hans: 在所有 :doc:`通用类基视图 </topics/class-based-views/index>` （或继承自 ``ContextMixin`` 的任何类基视图）中，上下文字典包含一个指向 ``View`` 实例的 ``view`` 变量。

source: :class:`~django.contrib.gis.geos.LineString` and :class:`~django.contrib.gis.geos.MultiLineString` GEOS objects now support the :meth:`~django.contrib.gis.geos.GEOSGeometry.interpolate()` and :meth:`~django.contrib.gis.geos.GEOSGeometry.project()` methods (so-called linear referencing).
id: Obyek GEOS :class:`~django.contrib.gis.geos.LineString` dan :class:`~django.contrib.gis.geos.MultiLineString` sekarang mendukung metode :meth:`~django.contrib.gis.geos.GEOSGeometry.interpolate()` dan :meth:`~django.contrib.gis.geos.GEOSGeometry.project()` (disebut acuan segaris).
zh_hans: :class:`~django.contrib.gis.geos.LineString` 和 :class:`~django.contrib.gis.geos.MultiLineString` GEOS 对象现在支持 :meth:`~django.contrib.gis.geos.GEOSGeometry.interpolate()` 和 :meth:`~django.contrib.gis.geos.GEOSGeometry.project()` 方法（称为线性参考）。

source: The ``wkb`` and ``hex`` properties of :class:`~django.contrib.gis.geos.GEOSGeometry` objects preserve the Z dimension.
id: Sifat ``wkb`` dan ``hex`` dari obyek :class:`~django.contrib.gis.geos.GEOSGeometry` menjaga dimensi Z.
zh_hans: :class:`~django.contrib.gis.geos.GEOSGeometry` 对象的 ``wkb`` 和 ``hex`` 属性保留了 Z 维度。

source: Support for PostGIS 2.0 has been added and support for GDAL < 1.5 has been dropped.
id: Dukungan untuk PostGIS 2.0 telah ditambahkan dan dukungan untuk GDAL < 1.5 telah dibuang.
zh_hans: 已添加对 PostGIS 2.0 的支持，并且已放弃对 GDAL < 1.5 的支持。

source: New tutorials
id: Tutorial baru
zh_hans: 新教程

source: Additions to the docs include a revamped :doc:`Tutorial 3</intro/tutorial03>` and a new :doc:`tutorial on testing</intro/tutorial05>`. A new section, "Advanced Tutorials", offers :doc:`How to write reusable apps </intro/reusable-apps>` as well as a step-by-step guide for new contributors in :doc:`Writing your first patch for Django </intro/contributing>`.
id: Tambahan pada dokumen menyertakan :doc:`Tutorial 3</intro/tutorial03>` dirubah dan :doc:`tutorial on testing</intro/tutorial05>` baru. Bagian baru, "Advanced Tutorials", menawarkan :doc:`How to write reusable apps </intro/reusable-apps>` dan juga panduan langkah-demi-langkah untuk pembantu baru di :doc:`Writing your first patch for Django </intro/contributing>`.
zh_hans: 文档中的新内容包括全新的 :doc:`教程 3 </intro/tutorial03>` 和新的 :doc:`测试教程 </intro/tutorial05>`。一个新的部分，"高级教程"，提供了 :doc:`如何编写可重用应用程序 </intro/reusable-apps>` 以及新贡献者的逐步指南 :doc:`为 Django 编写你的第一个补丁 </intro/contributing>`。

source: Django 1.5 also includes several smaller improvements worth noting:
id: Django 1.5 juga menyertakan beberapa perbaikan kecil yang tidak berharga:
zh_hans: Django 1.5 还包括一些值得注意的较小改进：

source: The template engine now interprets ``True``, ``False`` and ``None`` as the corresponding Python objects.
id: Mesin cetakan sekarang mengartikan ``True``, ``False`` dan ``None`` sebagai obyek Python sesuai.
zh_hans: 模板引擎现在将 ``True``、``False`` 和 ``None`` 解释为相应的 Python 对象。

source: :mod:`django.utils.timezone` provides a helper for converting aware datetimes between time zones. See :func:`~django.utils.timezone.localtime`.
id: :mod:`django.utils.timezone` menyediakan pembantu untuk merubah datetime sadar diantara zona waktu. Lihat :func:`~django.utils.timezone.localtime`.
zh_hans: :mod:`django.utils.timezone` 提供了一个帮助程序，用于在不同时区之间转换带有时区信息的日期时间。请查看 :func:`~django.utils.timezone.localtime`。

source: The generic views support OPTIONS requests.
id: Tampilan umum mendukung permintaan OPTION.
zh_hans: 通用视图支持 OPTIONS 请求。

source: Management commands do not raise ``SystemExit`` any more when called by code from :func:`~django.core.management.call_command`. Any exception raised by the command (mostly :exc:`~django.core.management.CommandError`) is propagated.
id: Perintah pengelolaan tidak memunculkan ``SystemExit`` lagi ketika dipanggil oleh kode dari :func:`~django.core.management.call_command`. Pengecualian apapun dimunculkan oleh perintah (kebanyakan :exc:`~django.core.management.CommandError`) adalah diperbanyak.
zh_hans: 当通过 :func:`~django.core.management.call_command` 从代码中调用管理命令时，管理命令不再引发 ``SystemExit``。任何由命令引发的异常（主要是 :exc:`~django.core.management.CommandError`）将被传播。

source: Moreover, when you output errors or messages in your custom commands, you should now use ``self.stdout.write('message')`` and ``self.stderr.write('error')`` (see the note on :ref:`management commands output <management-commands-output>`).
id: Bahkan, ketika anda mengelurkan kesalahan atau pesan di perintah penyesuaian anda, anda harus sekarang menggunakan ``self.stdout.write('message')`` and ``self.stderr.write('error')`` (lihat catatan pada :ref:`management commands output <management-commands-output>`).
zh_hans: 此外，当在自定义命令中输出错误或消息时，现在应该使用 ``self.stdout.write('message')`` 和 ``self.stderr.write('error')`` （参见 :ref:`管理命令输出 <management-commands-output>` 中的说明）。

source: The :djadmin:`dumpdata` management command outputs one row at a time, preventing out-of-memory errors when dumping large datasets.
zh_hans: :djadmin:`dumpdata` 管理命令现在逐行输出数据，以防止在导出大型数据集时出现内存不足错误。

source: In the localflavor for Canada, ``pq`` was added to the acceptable codes for Quebec. It's an old abbreviation.
zh_hans: 在加拿大的本地化中，已经添加了 ``pq`` 作为魁北克省的可接受缩写。这是一个旧的缩写。

source: The :ref:`receiver <connecting-receiver-functions>` decorator is now able to connect to more than one signal by supplying a list of signals.
id: Penghias :ref:`receiver <connecting-receiver-functions>` sekarang dapat terhubung ke lebih dari satu sinyal dengan menyokong daftar sinyal.
zh_hans: :ref:`receiver <connecting-receiver-functions>` 装饰器现在可以通过提供一个信号列表来连接多个信号。

source: In the admin, you can now filter users by groups which they are members of.
id: Di admin, anda sekarang dapat menyaring pengguna berdasarkan keanggotaan mereka.
zh_hans: 在管理员界面中，您现在可以根据用户所属的群组来筛选用户。

source: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` now has a batch_size argument. By default the batch_size is unlimited except for SQLite where single batch is limited so that 999 parameters per query isn't exceeded.
id: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` sekarang mempunyai sebuah argumen batch_size. Secara awalan batch_size tidak terbatas kecuali untuk SQLite dimana kumpulan tunggal terpada sehingga parameter 888 per permintaan tidak melebihi.
zh_hans: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` 现在具有一个 batch_size 参数。默认情况下，batch_size 是无限的，除了 SQLite，其中单个批次受限，以确保不超过每个查询的 999 个参数。

source: The :setting:`LOGIN_URL` and :setting:`LOGIN_REDIRECT_URL` settings now also accept view function names and :ref:`named URL patterns <naming-url-patterns>`. This allows you to reduce configuration duplication. More information can be found in the :func:`~django.contrib.auth.decorators.login_required` documentation.
id: Pengaturan :setting:`LOGIN_URL` dan :setting:`LOGIN_REDIRECT_URL` sekarang juga menerima tampilan nama fungsi dan :ref:`named URL patterns <naming-url-patterns>`. Ini mengizinkan anda mengurangi penggandaan konfigurasi. Informasi lebih dapat ditemukan di dokumentasi :func:`~django.contrib.auth.decorators.login_required`.
zh_hans: :setting:`LOGIN_URL` 和 :setting:`LOGIN_REDIRECT_URL` 设置现在也接受视图函数名称和 :ref:`命名的 URL 模式 <naming-url-patterns>`。这允许您减少配置的重复。更多信息可以在 :func:`~django.contrib.auth.decorators.login_required` 文档中找到。

source: Django now provides a mod_wsgi :doc:`auth handler </howto/deployment/wsgi/apache-auth>`.
id: Django sekarang menyediakan mod_wsgi :doc:`auth handler </howto/deployment/wsgi/apache-auth>`.
zh_hans: Django 现在提供了一个 mod_wsgi :doc:`认证处理程序 </howto/deployment/wsgi/apache-auth>`。

source: The :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` and :meth:`Model.delete() <django.db.models.Model.delete()>` can now take fast-path in some cases. The fast-path allows for less queries and less objects fetched into memory. See :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` for details.
id: :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` dan :meth:`Model.delete() <django.db.models.Model.delete()>` sekarang dapat mengambil jalur-cepat di beberapa kasus. Jalur-cepat mengizinkan untuk sedikit permintaan dan sedikit obyek diambil kedalam memori. Lihat :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` untuk rincian.
zh_hans: 在某些情况下，:meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` 和 :meth:`Model.delete() <django.db.models.Model.delete()>` 现在可以采用快速路径。快速路径可以减少查询和减少加载到内存中的对象。请查看 :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` 以获取详细信息。

source: An instance of ``ResolverMatch`` is stored on the request as ``resolver_match``.
id: Sebuah instance dari ``ResolverMatch`` disimpan pada permintaan sebagai ``resolver_match``.
zh_hans: 一个 ``ResolverMatch`` 的实例被存储在请求上，命名为 ``resolver_match``。

source: By default, all logging messages reaching the ``django`` logger when :setting:`DEBUG` is ``True`` are sent to the console (unless you redefine the logger in your :setting:`LOGGING` setting).
id: Secara awalan, semua pencatatan pesan mencapat pencatat ``django`` ketika :setting:`DEBUG` adalah ``True``dikirim ke konsol (meskipun anda menentukan kembali pencatat di pengaturan :setting:`LOGGING` anda).
zh_hans: 默认情况下，当 :setting:`DEBUG` 为 ``True`` 时，所有达到 ``django`` 日志器的日志消息都会发送到控制台（除非您在 :setting:`LOGGING` 设置中重新定义了日志器）。

source: When using :class:`~django.template.RequestContext`, it is now possible to look up permissions by using ``{% if 'someapp.someperm' in perms %}`` in templates.
id: Ketika menggunakan :class:`~django.template.RequestContext`, itu memungkinkan mencari perizinan dengan menggunakan ``{% if 'someapp.someperm' in perms %}`` di cetakan.
zh_hans: 在使用 :class:`~django.template.RequestContext` 时，现在可以在模板中使用 ``{% if 'someapp.someperm' in perms %}`` 来查找权限。

source: It's not required any more to have ``404.html`` and ``500.html`` templates in the root templates directory. Django will output some basic error messages for both situations when those templates are not found. It's still recommended as good practice to provide those templates in order to present pretty error pages to the user.
zh_hans: 不再需要在根模板目录中拥有 ``404.html`` 和 ``500.html`` 模板。当这些模板找不到时，Django 会输出一些基本的错误消息。仍然建议作为良好的实践提供这些模板，以便向用户呈现漂亮的错误页面。

source: :mod:`django.contrib.auth` provides a new signal that is emitted whenever a user fails to login successfully. See :data:`~django.contrib.auth.signals.user_login_failed`
id: :mod:`django.contrib.auth` menyediakan sinyal bau yang dikeluarkan ketika pengguna gagal untuk berhasil masuk. Lihat :data:`~django.contrib.auth.signals.user_login_failed`
zh_hans: :mod:`django.contrib.auth` 提供了一个新的信号，每当用户登录失败时都会发出该信号。请查看 :data:`~django.contrib.auth.signals.user_login_failed`。

source: The new :option:`loaddata --ignorenonexistent` option ignore data for fields that no longer exist.
id: Pilihan :option:`loaddata --ignorenonexistent` baru mengabaikan data untuk bidang yang tidak lagi ada.
zh_hans: 新的 :option:`loaddata --ignorenonexistent` 选项会忽略不再存在的字段的数据。

source: :meth:`~django.test.SimpleTestCase.assertXMLEqual` and :meth:`~django.test.SimpleTestCase.assertXMLNotEqual` new assertions allow you to test equality for XML content at a semantic level, without caring for syntax differences (spaces, attribute order, etc.).
id: Tuntutan baru :meth:`~django.test.SimpleTestCase.assertXMLEqual` dan :meth:`~django.test.SimpleTestCase.assertXMLNotEqual` mengizinkan anda untuk mencoba persamaan untuk isi XML pada tingkat semantik, tanpa peduli untuk perbedaan sintaksis (spasi, urutan atribut, dll.).
zh_hans: :meth:`~django.test.SimpleTestCase.assertXMLEqual` 和 :meth:`~django.test.SimpleTestCase.assertXMLNotEqual` 这两个新的断言允许您在语义级别测试 XML 内容的相等性，而不必关心语法差异（空格、属性顺序等）。

source: RemoteUserMiddleware now forces logout when the REMOTE_USER header disappears during the same browser session.
id: RemoteUserMiddleware sekarang memaksa keluar ketika kepala REMOTE_USER hilang selama sesi peramban sama.
zh_hans: 当同一浏览器会话中的 REMOTE_USER 头消失时，RemoteUserMiddleware 现在会强制注销。

source: The :ref:`cache-based session backend <cached-sessions-backend>` can store session data in a non-default cache.
id: :ref:`cache-based session backend <cached-sessions-backend>` dapat menyimpan data sesi di tembolok bukan-awalan.
zh_hans: 基于缓存的会话后端（:ref:`cache-based session backend <cached-sessions-backend>`）可以将会话数据存储在非默认的缓存中。

source: During Django's logging configuration verbose Deprecation warnings are enabled and warnings are captured into the logging system. Logged warnings are routed through the ``console`` logging handler, which by default requires :setting:`DEBUG` to be True for output to be generated. The result is that DeprecationWarnings should be printed to the console in development environments the way they have been in Python versions < 2.7.
id: Selama konfigurasi pencatatan peringatan Pengusangan bertele-tele diadakan dan peringatan ditangkap kedalam sistem pencatatan. Peringatan tercatat dirutekan melalui penangan pencataan ``console``, yang secara awalan membutuhkan :setting:`DEBUG` menjadi True untuk keluaran menjadi dibangkitkan. Hasil adalah DeprecationWarning harus dicetak ke console dalam lingkungan pengembangan cara mereka telah di versi Python < 2.7.
zh_hans: 在 Django 的日志配置中，详细的弃用警告被启用，并且警告被捕获到日志系统中。已记录的警告通过 ``console`` 日志处理程序路由，其默认情况下需要 :setting:`DEBUG` 为 True 才能生成输出。因此，在开发环境中，DeprecationWarnings 应该以与 Python 版本 < 2.7 中相同的方式打印到控制台。

source: The API for :meth:`django.contrib.admin.ModelAdmin.message_user` method has been modified to accept additional arguments adding capabilities similar to :func:`django.contrib.messages.add_message`. This is useful for generating error messages from admin actions.
id: API untuk metode :meth:`django.contrib.admin.ModelAdmin.message_user` tekah dirubah untuk kemampuan menerima argumen tambahan mirip pada :func:`django.contrib.messages.add_message`. Ini sangat berguna untuk membangkitkan pesan kesalahan dari tindakan admin.
zh_hans: :meth:`django.contrib.admin.ModelAdmin.message_user` 方法的 API 已经修改，以接受额外的参数，增加了类似于 :func:`django.contrib.messages.add_message` 的功能。这对于从管理操作生成错误消息非常有用。

source: The admin's list filters can now be customized per-request thanks to the new :meth:`django.contrib.admin.ModelAdmin.get_list_filter` method.
id: Daftar penyaring admin sekarang dapat disesuaiakan per-permintaan terima kasih pada metode :meth:`django.contrib.admin.ModelAdmin.get_list_filter` baru.
zh_hans: 管理员的列表过滤器现在可以根据每个请求进行自定义，这要归功于新的 :meth:`django.contrib.admin.ModelAdmin.get_list_filter` 方法。

source: Backwards incompatible changes in 1.5
id: Perubahan bertentangan kebelakang di 1.5
zh_hans: 1.5 中的向后不兼容更改

source: In addition to the changes outlined in this section, be sure to review the :ref:`deprecation plan <deprecation-removed-in-1.5>` for any features that have been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada perubahan diuraikan di bagian ini, pastikan untuk meninjau kembali :ref:`deprecation plan <deprecation-removed-in-1.5>` untuk setiap fitur yang telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur yang diberikan, perpindahannya mugkin muncul sebagai perubahan ketidaksesuaian kebelakang.
zh_hans: 除了本节中概述的更改外，确保查看 :ref:`弃用计划 <deprecation-removed-in-1.5>`，以了解已删除的任何功能。如果您没有在给定功能的弃用时间表内更新您的代码，其删除可能会被视为向后不兼容的更改。

source: ``ALLOWED_HOSTS`` required in production
id: ``ALLOWED_HOSTS`` dibutuhkan dalam produksi
zh_hans: 在生产环境中必须设置 ``ALLOWED_HOSTS``

source: The new :setting:`ALLOWED_HOSTS` setting validates the request's ``Host`` header and protects against host-poisoning attacks. This setting is now required whenever :setting:`DEBUG` is ``False``, or else :meth:`django.http.HttpRequest.get_host()` will raise :exc:`~django.core.exceptions.SuspiciousOperation`. For more details see the :setting:`full documentation<ALLOWED_HOSTS>` for the new setting.
id: Pengaturan :setting:`ALLOWED_HOSTS` baru mensahkan kepala ``Host`` permintaan dan melindungi terhadap serangan host-poisoning. Pengaturan ini sekarang wajib kapanpun :setting:`DEBUG` adalah ``False``, atau :meth:`django.http.HttpRequest.get_host()` lain akan memunculkan :exc:`~django.core.exceptions.SuspiciousOperation`. Untuk lebih rinci lihat :setting:`full documentation<ALLOWED_HOSTS>` untuk pengaturan baru.
zh_hans: 新的 :setting:`ALLOWED_HOSTS` 设置验证请求的 ``Host`` 头并保护免受主机投毒攻击。此设置现在在 :setting:`DEBUG` 为 ``False`` 时是必需的，否则 :meth:`django.http.HttpRequest.get_host()` 将引发 :exc:`~django.core.exceptions.SuspiciousOperation`。更多详情请参阅新设置的 :setting:`完整文档 <ALLOWED_HOSTS>`。

source: Managers on abstract models
id: Pengelola pada model abstrak.
zh_hans: 抽象模型上的管理器

source: Abstract models are able to define a custom manager, and that manager :ref:`will be inherited by any concrete models extending the abstract model <custom-managers-and-inheritance>`. However, if you try to use the abstract model to call a method on the manager, an exception will now be raised. Previously, the call would have been permitted, but would have failed as soon as any database operation was attempted (usually with a "table does not exist" error from the database).
id: Model-model abstrak dapat menentukan pengelola penyesuaian, dan pengelola itu :ref:`will be inherited by any concrete models extending the abstract model <custom-managers-and-inheritance>`. Bagaimanapun, jika anda mencoba menggunakan model abstrak untuk memanggil sebuah metode pada pengelola, sebuah pengecualian sekarang akan dimunculkan. Sebelumnya, panggilan telah diizinkan, tetapi akan gagal segera setelah tindakan basisdata apapun telah diusahakan (biasanya dengan sebuah kesalahan "tabel tidak ada" dari basisdata).
zh_hans: 抽象模型可以定义一个自定义管理器，并且该管理器 :ref:`将被任何扩展抽象模型的具体模型继承 <custom-managers-and-inheritance>`。然而，如果您尝试在抽象模型上调用管理器的方法，现在将会引发异常。以前，允许调用，但只要尝试进行任何数据库操作，通常会导致数据库报错 "表不存在"。

source: If you have functionality on a manager that you have been invoking using the abstract class, you should migrate that logic to a Python ``staticmethod`` or ``classmethod`` on the abstract class.
id: Jika anda mempunyai kegunaan pada pengelola yang anda telah minta menggunakan kelas abstrak, anda harus pindah logika tersebut ke ``staticmethod`` Python atau ``classmethod`` pada kelas abstrak.
zh_hans: 如果您在管理器上有功能，一直在使用抽象类进行调用，您应该将该逻辑迁移到抽象类上的 Python ``staticmethod`` 或 ``classmethod``。

source: Context in year archive class-based views
id: Konteks di arsip tahun tampilan berdasarkan-kelas
zh_hans: 基于类的年度归档视图中的上下文

source: For consistency with the other date-based generic views, :class:`~django.views.generic.dates.YearArchiveView` now passes ``year`` in the context as a :class:`datetime.date` rather than a string. If you are using ``{{ year }}`` in your templates, you must replace it with ``{{ year|date:"Y" }}``.
id: Untuk kemantapan dengan tampilan umum berdasarkan-tanggal lainnya, :class:`~django.views.generic.dates.YearArchiveView` sekarang melewatkan ``year`` dalam konteks sebagai :class:`datetime.date` daripada sebuah string. Jika anda sedang menggunakan ``{{ year }}`` dalam cetakan anda, anda harus mengganti itu dengan ``{{ year|date:"Y" }}``.
zh_hans: 为了与其他基于日期的通用视图保持一致，:class:`~django.views.generic.dates.YearArchiveView` 现在将 ``year`` 作为一个 :class:`datetime.date` 而不是一个字符串传递给上下文。如果您在模板中使用了 ``{{ year }}``，您必须将其替换为 ``{{ year|date:"Y" }}``。

source: ``next_year`` and ``previous_year`` were also added in the context. They are calculated according to ``allow_empty`` and ``allow_future``.
id: ``next_year`` dan ``previous_year`` juga ditambahkan dalam konteks. Mereka dihitung berdasarkan pada ``allow_empty`` dan ``allow_future``.
zh_hans: ``next_year`` 和 ``previous_year`` 也被添加到上下文中。它们根据 ``allow_empty`` 和 ``allow_future`` 进行计算。

source: Context in year and month archive class-based views
id: Konteks dalam arsip tahun dan bulan tampilan berdasarkan-kelas
zh_hans: 基于类的年度和月度归档视图中的上下文

source: :class:`~django.views.generic.dates.YearArchiveView` and :class:`~django.views.generic.dates.MonthArchiveView` were documented to provide a ``date_list`` sorted in ascending order in the context, like their function-based predecessors, but it actually was in descending order. In 1.5, the documented order was restored. You may want to add (or remove) the ``reversed`` keyword when you're iterating on ``date_list`` in a template:
zh_hans: :class:`~django.views.generic.dates.YearArchiveView` 和 :class:`~django.views.generic.dates.MonthArchiveView` 的文档中曾经说明在上下文中提供一个按升序排序的 ``date_list``，就像它们的基于函数的前身一样，但实际上它是按降序排序的。在1.5版本中，文档中的顺序已经恢复。在模板中迭代 ``date_list`` 时，您可能需要添加（或删除） ``reversed`` 关键字：

source: :class:`~django.views.generic.dates.ArchiveIndexView` still provides a ``date_list`` in descending order.
id: :class:`~django.views.generic.dates.ArchiveIndexView` maish menyediakan ``date_list`` di urutan menurun.
zh_hans: :class:`~django.views.generic.dates.ArchiveIndexView` 仍然以降序提供一个 ``date_list``。

source: Context in TemplateView
id: Konteks dalam TemplateView
zh_hans: TemplateView 中的上下文

source: For consistency with the design of the other generic views, :class:`~django.views.generic.base.TemplateView` no longer passes a ``params`` dictionary into the context, instead passing the variables from the URLconf directly into the context.
id: Untuk kemantapan dengan rancangan dari tampilan umum lain, :class:`~django.views.generic.base.TemplateView` tidak lagi melewatkan kamus ``params`` kedalam konteks, sebagai gantinya melewati variabel dari URLconf secara langsung kedalam konteks.
zh_hans: 为了与其他通用视图的设计保持一致，:class:`~django.views.generic.base.TemplateView` 不再将一个 ``params`` 字典传递到上下文中，而是直接将来自 URLconf 的变量传递到上下文中。

source: Non-form data in HTTP requests
id: Data bukan-formulir dalam permintaan HTTP
zh_hans: HTTP 请求中的非表单数据

source: :attr:`request.POST <django.http.HttpRequest.POST>` will no longer include data posted via HTTP requests with non form-specific content-types in the header. In prior versions, data posted with content-types other than :mimetype:`multipart/form-data` or :mimetype:`application/x-www-form-urlencoded` would still end up represented in the :attr:`request.POST <django.http.HttpRequest.POST>` attribute. Developers wishing to access the raw POST data for these cases, should use the :attr:`request.body <django.http.HttpRequest.body>` attribute instead.
zh_hans: :attr:`request.POST <django.http.HttpRequest.POST>` 将不再包含通过非表单特定内容类型的 HTTP 请求发布的数据。在以前的版本中，使用除 :mimetype:`multipart/form-data` 或 :mimetype:`application/x-www-form-urlencoded` 之外的内容类型发布的数据仍然会在 :attr:`request.POST <django.http.HttpRequest.POST>` 属性中表示出来。希望访问这些情况下的原始 POST 数据的开发人员应该使用 :attr:`request.body <django.http.HttpRequest.body>` 属性。

source: :data:`~django.core.signals.request_finished` signal
id: Sinyal :data:`~django.core.signals.request_finished`
zh_hans: :data:`~django.core.signals.request_finished` 信号
