Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The old cache URI syntax (e.g. ``"locmem://"``) is no longer supported. It still worked, even though it was not documented or officially supported. If you're still using it, please update to the current :setting:`CACHES` syntax.
id: Sintaksis URL cache lama (sebagai contoh ``"locmem://"``) tidak lagi didukung. Itu masih bekerja, meskipun itu tidak didokumentasikan atau secara resmi didukung. Jika anda masih menggunakan itu, harap memperbaharui sintaksis :setting:`CACHES` saat ini.
zh_hans: 旧的缓存 URI 语法（例如 ``"locmem://"``）不再受支持。尽管它之前可以工作，但它并没有被记录或正式支持。如果你仍在使用它，请更新到当前的 :setting:`CACHES` 语法。

source: The default ordering of ``Form`` fields in case of inheritance has changed to follow normal Python MRO. Fields are now discovered by iterating through the MRO in reverse with the topmost class coming last. This only affects you if you relied on the default field ordering while having fields defined on both the current class *and* on a parent ``Form``.
id: Urutan awalan dari bidang ``Form`` dalam kasus dari warisan telah berubah untuk mengikuti MRO Python biasa. Bidang-bidang sekarang ditemukan dengan memutar melalui MRO di balikan dengan kelas paling atas datang terakhir. Ini hanya berpengaruh jika anda bergantung pada urutan bidang awalan selagi mempunyai bidang-bidang ditentukan pada kedua keadaan kelas 8dan* pada induk ``Form``.
zh_hans: 在继承情况下，``Form`` 字段的默认排序方式已更改为遵循正常的 Python MRO。现在，字段是通过反向迭代 MRO 来发现的，最顶层的类最后被考虑。这只会在你同时在当前类和父类 ``Form`` 中定义字段并且依赖于默认字段顺序时影响你。

source: The ``required`` argument of :class:`~django.forms.SelectDateWidget` has been removed. This widget now respects the form field's ``is_required`` attribute like other widgets.
id: Argumen ``required`` dari :class:`~django.forms.SelectDateWidget` telah dipindahkan. Widget ini sekarang menhormati atribut ``is_required`` bidang formulir seperti widget-widget lain.
zh_hans: :class:`~django.forms.SelectDateWidget` 的 ``required`` 参数已被移除。这个小部件现在会像其他小部件一样尊重表单字段的 ``is_required`` 属性。

source: ``Widget.is_hidden`` is now a read-only property, getting its value by introspecting the presence of ``input_type == 'hidden'``.
id: ``Widget.is_hidden`` sekarang adalah sifat hanya-baca, mendapatkan nilainya dengan menginterospeksi kehadiran dari ``input_type == 'hidden'``.
zh_hans: ``Widget.is_hidden`` 现在是一个只读属性，通过检查 ``input_type == 'hidden'`` 的存在来获取其值。

source: :meth:`~django.db.models.query.QuerySet.select_related` now chains in the same way as other similar calls like ``prefetch_related``. That is, ``select_related('foo', 'bar')`` is equivalent to ``select_related('foo').select_related('bar')``. Previously the latter would have been equivalent to ``select_related('bar')``.
id: :meth:`~django.db.models.query.QuerySet.select_related` sekarang menambat di cara sama seperti panggilan mirip lainnya seperti ``prefetch_related``. Yaitu, ``select_related('foo', 'bar')`` setara pada ``select_related('foo').select_related('bar')``. Sebelumnya yang terakhir akan setara pada ``select_related('bar')``.
zh_hans: :meth:`~django.db.models.query.QuerySet.select_related` 现在与其他类似的调用（如 ``prefetch_related``）以相同的方式链式调用。也就是说，``select_related('foo', 'bar')`` 等同于 ``select_related('foo').select_related('bar')``。以前，后者等同于 ``select_related('bar')``。

source: GeoDjango dropped support for GEOS < 3.1.
id: GeoDjango membuang dukungan untuk GEOS < 3.1.
zh_hans: GeoDjango 不再支持 GEOS < 3.1 。

source: The ``init_connection_state`` method of database backends now executes in autocommit mode (unless you set :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` to ``False``). If you maintain a custom database backend, you should check that method.
id: Metode ``init_connection_state`` dari backend basisdata sekarang berjalan dalam suasana pembetulan otomatis (meskipun anda menyetel :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` menjadi ``False``). Jika anda merawat penyesuaian backend backend basisdata, anda harus memeriksa metode itu.
zh_hans: 数据库后端的 ``init_connection_state`` 方法现在在自动提交模式下执行（除非你将 :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` 设置为 ``False``）。如果你维护一个自定义数据库后端，你应该检查这个方法。

source: The ``django.db.backends.BaseDatabaseFeatures.allows_primary_key_0`` attribute has been renamed to ``allows_auto_pk_0`` to better describe it. It's ``True`` for all database backends included with Django except MySQL which does allow primary keys with value 0. It only forbids *autoincrement* primary keys with value 0.
id: Atribut ``django.db.backends.BaseDatabaseFeatures.allows_primary_key_0`` telah dinamai menjadi ``allows_auto_pk_0``untuk menggambarkan itu lebih baik. Itu adalah ``True`` untuk semua backend basisdata termasuk dengan Django kecuali MySQL yang mengizinkan primary key dengan nilai 0. Itu hanya melarang primary key *autoincrement* dengan nilai 0.
zh_hans: ``django.db.backends.BaseDatabaseFeatures.allows_primary_key_0`` 属性已重命名为 ``allows_auto_pk_0``，以更好地描述它。对于所有包含在 Django 中的数据库后端，除了 MySQL，它都为 ``True``，因为 MySQL 允许主键值为 0。它只禁止具有值 0 的 *autoincrement* 主键。

source: Shadowing model fields defined in a parent model has been forbidden as this creates ambiguity in the expected model behavior. In addition, clashing fields in the model inheritance hierarchy result in a system check error. For example, if you use multi-inheritance, you need to define custom primary key fields on parent models, otherwise the default ``id`` fields will clash. See :ref:`model-multiple-inheritance-topic` for details.
id: Pembayangan bidang-bidang model ditentukan di model induk telah dilarang ketika ini membuat kebingungan dalam perilaku model yang diharapkan. Sebagai tambahan, bidang-bidang yang bertabrakan di hasil susunan model warisan dalam sistem pemeriksaan kesalahan. Sebagai contoh, jika butuh anda menggunakan banyak-warisan, anda butuh menentukan penyesuaian bidang-bidang primary key pada model induk, jika tidak bidang ``id`` awalan akan bertabrakan. Lihat :ref:`model-multiple-inheritance-topic` untuk rincian.
zh_hans: 禁止在子模型中定义与父模型中已定义的字段同名的字段，因为这会导致模型行为的歧义。此外，在模型继承层次结构中发生字段冲突将导致系统检查错误。例如，如果使用多继承，你需要在父模型中定义自定义主键字段，否则默认的 ``id`` 字段将发生冲突。有关详细信息，请参阅 :ref:`model-multiple-inheritance-topic`。

source: ``django.utils.translation.parse_accept_lang_header()`` now returns lowercase locales, instead of the case as it was provided. As locales should be treated case-insensitive this allows us to speed up locale detection.
id: ``django.utils.translation.parse_accept_lang_header()`` sekarang mengembalikan lokal huruf kecil, sebagai ganti dari kasus ketika itu disediakan. Sebagai lokal harus di perlakukan tidak sensitif-kasus ini mengizinkan kamu mempercepat penemuan lokal.
zh_hans: ``django.utils.translation.parse_accept_lang_header()`` 现在返回小写的区域设置，而不是提供的大小写。由于区域设置应该被视为不区分大小写，这使得我们能够加速区域设置的检测。

source: ``django.utils.translation.get_language_from_path()`` and ``django.utils.translation.trans_real.get_supported_language_variant()`` now no longer have a ``supported`` argument.
id: ``django.utils.translation.get_language_from_path()`` dan ``django.utils.translation.trans_real.get_supported_language_variant()`` sekarang tidak lagi mempunyai argumen ``supported``.
zh_hans: ``django.utils.translation.get_language_from_path()`` 和 ``django.utils.translation.trans_real.get_supported_language_variant()`` 现在不再接受 ``supported`` 参数。

source: The ``shortcut`` view in ``django.contrib.contenttypes.views`` now supports protocol-relative URLs (e.g. ``//example.com``).
id: Tampilan ``shortcut`` dalam ``django.contrib.contenttypes.views`` sekarang mendukung protocol-relative URL (sebagai contoh ``//example.com``).
zh_hans: ``django.contrib.contenttypes.views`` 中的 ``shortcut`` 视图现在支持协议相对 URL（例如 ``//example.com``）。

source: :class:`~django.contrib.contenttypes.fields.GenericRelation` now supports an optional ``related_query_name`` argument. Setting ``related_query_name`` adds a relation from the related object back to the content type for filtering, ordering and other query operations.
id: :class:`~django.contrib.contenttypes.fields.GenericRelation` sekarang mendukung sebuah pilihan argumen ``related_query_name``. Pengaturan ``related_query_name`` menambahkan sebuah hubungan dari obyek terkait kebelakang pada jenis isi untuk penyaringan, pengurutan dan tindakan permintaan lain.
zh_hans: :class:`~django.contrib.contenttypes.fields.GenericRelation` 现在支持一个可选的 ``related_query_name`` 参数。设置 ``related_query_name`` 可以在相关对象和内容类型之间添加关系，用于过滤、排序和其他查询操作。

source: When running tests on PostgreSQL, the :setting:`USER` will need read access to the built-in ``postgres`` database. This is in lieu of the previous behavior of connecting to the actual non-test database.
id: Ketika menjalankan percobaan pada PostgreSQL, :setting:`USER` akan butuh membaca akses pada basisdata ``postgres`` siap-pakai. Ini adalah daripada perilaku sebelumnya dari menghubungkan ke basisdata bukan-percobaan sebenarnya.
zh_hans: 在 PostgreSQL 上运行测试时，:setting:`USER` 将需要对内置的 ``postgres`` 数据库进行读取访问权限。这是替代了以前连接到实际非测试数据库的行为。

source: As part of the :doc:`System check framework </ref/checks>`, :ref:`fields, models, and model managers <field-checking>` all implement a ``check()`` method that is registered with the check framework. If you have an existing method called ``check()`` on one of these objects, you will need to rename it.
id: Sebagai bagian dari :doc:`System check framework </ref/checks>`, :ref:`fields, models, and model managers <field-checking>` semua menerapkan sebuah metode ``check()`` yang terdaftar dengan pemeriksaan kerangka. Jika anda mempunyai sebuah metode yang ada memanggil ``check()`` pada satu dari obyek ini, anda akan butuh menamai kembalinya.
zh_hans: 作为 :doc:`系统检查框架 </ref/checks>` 的一部分，:ref:`字段、模型和模型管理器 <field-checking>` 都实现了一个已在检查框架中注册的 ``check()`` 方法。如果你已经在其中一个对象上有一个名为 ``check()`` 的现有方法，你需要将其重命名。

source: As noted above in the "Cache" section of "Minor Features", defining the :setting:`TIMEOUT <CACHES-TIMEOUT>` argument of the :setting:`CACHES` setting as ``None`` will set the cache keys as "non-expiring". Previously, with the memcache backend, a :setting:`TIMEOUT <CACHES-TIMEOUT>` of ``0`` would set non-expiring keys, but this was inconsistent with the set-and-expire (i.e. no caching) behavior of ``set("key", "value", timeout=0)``. If you want non-expiring keys, please update your settings to use ``None`` instead of ``0`` as the latter now designates set-and-expire in the settings as well.
id: Seperti dicatat diatas di bagian "Cache" dari "Minor Features", menentukan argumen :setting:`TIMEOUT <CACHES-TIMEOUT>` dari pengaturan :setting:`CACHES` sebagai ``None`` akan menyetel kunci cache sebagai "non-expiring". Sebelumnya, dengan backend memcache, sebuah :setting:`TIMEOUT <CACHES-TIMEOUT>` dari ``0`` akan menyetel kunci tidak-kadaluarsa, tetapi ini tidak tetap dengan setel-dan-kadaluarsa (yaitu tidak ada penyimpanan sementara) perilaku dari ``set("key", "value", timeout=0)``. Jika anda ingin kuncu tidak-kadaluarsa, harap memperbaharui pengaturan anda untuk menggunakan ``None`` daripada ``0`` sebagai yang terakhir sekarang menunjuk setel-dan-kadaluarsa di pengaturan juga.
zh_hans: 如上述 "缓存" 部分所提到的，将 :setting:`CACHES` 设置的 :setting:`TIMEOUT <CACHES-TIMEOUT>` 参数定义为 ``None`` 将设置缓存键为 "不过期"。以前，对于 memcache 后端，:setting:`TIMEOUT <CACHES-TIMEOUT>` 为 ``0`` 会设置不过期的键，但这与 ``set("key", "value", timeout=0)`` 的设置和过期（即不缓存）行为不一致。如果你想要不过期的键，请更新你的设置，将 ``0`` 改为 ``None``，因为后者现在在设置中也表示设置和过期。

source: The ``sql*`` management commands now respect the ``allow_migrate()`` method of :setting:`DATABASE_ROUTERS`. If you have models synced to non-default databases, use the ``--database`` flag to get SQL for those models (previously they would always be included in the output).
id: Perintah pengelolaan ``sql*`` sekarang menghormati metode ``allow_migrate()`` dari :setting:`DATABASE_ROUTERS`. Jika anda mempunyai model disamakan pada basisdata bukan-awalan, gunakan bendera ``--database`` untuk mendapatkan SQL untuk model tersebut (sebelumnya mereka akan selalu disertakan dalam keluaran).
zh_hans: ``sql*`` 管理命令现在尊重 :setting:`DATABASE_ROUTERS` 的 ``allow_migrate()`` 方法。如果你的模型与非默认数据库同步，请使用 ``--database`` 标志来获取这些模型的 SQL（以前它们总是包含在输出中）。

source: Decoding the query string from URLs now falls back to the ISO-8859-1 encoding when the input is not valid UTF-8.
id: Membaca permintaan string dari URL sekarang jatuh kembali ke penyandian ISO-8859-1 ketika masukan bukan YTF-8 yang sah.
zh_hans: 解码 URL 中的查询字符串现在在输入不是有效的 UTF-8 时会回退到 ISO-8859-1 编码。

source: With the addition of the ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` to the default project template (pre-1.7.2 only), a database must be created before accessing a page using :djadmin:`runserver`.
id: Dengan tambahan dari ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` ke cetakan proyek awalan (hanya pra-1.7.2), sebuah basisdata harus dibuat sebelum mengakses sebuah halaman menggunakan :djadmin:`runserver`.
zh_hans: 通过将 ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` 添加到默认项目模板（仅适用于 1.7.2 之前的版本），在使用 :djadmin:`runserver` 访问页面之前必须创建一个数据库。

source: The addition of the ``schemes`` argument to ``URLValidator`` will appear as a backwards-incompatible change if you were previously using a custom regular expression to validate schemes. Any scheme not listed in ``schemes`` will fail validation, even if the regular expression matches the given URL.
id: Tambahan dari argumen ``schemes`` pada `URLValidator`` akan muncul sebagai ketidaksesuaian-kebelakang berubah jika anda sebelumnya menggunakan penyesuaian regular expression untuk mensahkan skema. Setiap skema tidak terdaftar di ``schemes`` akan gagal disahkan, bahkan jika regular expression cocok di URL yang diberikan.
zh_hans: 将 ``schemes`` 参数添加到 ``URLValidator`` 中可能会在你之前使用自定义正则表达式来验证 schemes 的情况下出现向后不兼容的更改。如果 schemes 中没有列出的任何 scheme 将失败验证，即使正则表达式匹配给定的 URL。

source: Features deprecated in 1.7
id: Fitur usang di 1.7
zh_hans: 在 1.7 中被废弃的功能

source: ``django.core.cache.get_cache`` has been supplanted by :data:`django.core.cache.caches`.
id: ``django.core.cache.get_cache`` telah digantikan oleh :data:`django.core.cache.caches`.
zh_hans: ``django.core.cache.get_cache`` 已被 :data:`django.core.cache.caches` 取代。

source: ``django.utils.dictconfig`` and ``django.utils.importlib`` were copies of respectively :mod:`logging.config` and :mod:`importlib` provided for Python versions prior to 2.7. They have been deprecated.
id: ``django.utils.dictconfig`` dan ``django.utils.importlib`` telah disalin masing-masing :mod:`logging.config` dan :mod:`importlib` disediakan untuk Python versi sebelum 2.7. Mereka telah diusangkan.
zh_hans: ``django.utils.dictconfig`` 和 ``django.utils.importlib`` 分别是在 Python 版本 2.7 之前提供的 :mod:`logging.config` 和 :mod:`importlib` 的副本。它们已经被弃用。

source: The current ``django.utils.module_loading.import_by_path`` function catches ``AttributeError``, ``ImportError``, and ``ValueError`` exceptions, and re-raises :exc:`~django.core.exceptions.ImproperlyConfigured`. Such exception masking makes it needlessly hard to diagnose circular import problems, because it makes it look like the problem comes from inside Django. It has been deprecated in favor of :meth:`~django.utils.module_loading.import_string`.
id: Fungsi ``django.utils.module_loading.import_by_path`` saat ini menangkap pengecualian ``AttributeError``, ``ImportError``, dan ``ValueError``, dan memunculkan kembali :exc:`~django.core.exceptions.ImproperlyConfigured`. Penutupan pengecualian tersebut membuat itu sia-sia keras untuk mengenal lingkaran masalah import, karena itu membuat itu seperti masalah datang dari dalam Django. Itu telah diusangkan dalam mendukung :meth:`~django.utils.module_loading.import_string`.
zh_hans: 当前的 ``django.utils.module_loading.import_by_path`` 函数捕获 ``AttributeError``、``ImportError`` 和 ``ValueError`` 异常，并重新引发 :exc:`~django.core.exceptions.ImproperlyConfigured` 异常。这种异常掩盖使得诊断循环导入问题变得不必要地困难，因为它让问题看起来像是来自 Django 内部。它已被弃用，推荐使用 :meth:`~django.utils.module_loading.import_string`。

source: ``django.utils.tzinfo`` provided two :class:`~datetime.tzinfo` subclasses, ``LocalTimezone`` and ``FixedOffset``. They've been deprecated in favor of more correct alternatives provided by :mod:`django.utils.timezone`, :func:`django.utils.timezone.get_default_timezone` and :func:`django.utils.timezone.get_fixed_timezone`.
id: ``django.utils.tzinfo`` menyediakan dua :class:`~datetime.tzinfo` subclasses, ``LocalTimezone`` dan ``FixedOffset``. Mereka telah diusangkan dalam mendukung lebih jalan lain yang benar disediakan oleh :mod:`django.utils.timezone`, :func:`django.utils.timezone.get_default_timezone` dan :func:`django.utils.timezone.get_fixed_timezone`.
zh_hans: ``django.utils.tzinfo`` 提供了两个 :class:`~datetime.tzinfo` 的子类，分别是 ``LocalTimezone`` 和 ``FixedOffset``。它们已经被弃用，推荐使用更正确的替代方案，由 :mod:`django.utils.timezone` 提供的 :func:`django.utils.timezone.get_default_timezone` 和 :func:`django.utils.timezone.get_fixed_timezone`。

source: ``django.utils.unittest`` provided uniform access to the ``unittest2`` library on all Python versions. Since ``unittest2`` became the standard library's :mod:`unittest` module in Python 2.7, and Django 1.7 drops support for older Python versions, this module isn't useful anymore. It has been deprecated. Use :mod:`unittest` instead.
id: ``django.utils.unittest`` menyediakan akses seragam akses ke pustaka ``unittest2`` di semua versi Python. Sejak ``unittest2`` menjadi modul :mod:`unittest` pustaka standar di Python 2.7, dan Django 1.7 menjatuhkan dukungan untuk versi Python terlama, modul ini tidak berguna lagi. itu telah diusangkan. Gunakan :mod:`unittest` sebagai gantinya.
zh_hans: ``django.utils.unittest`` 在所有 Python 版本上提供了对 ``unittest2`` 库的统一访问。由于 ``unittest2`` 在 Python 2.7 中成为标准库的 :mod:`unittest` 模块，并且 Django 1.7 不再支持旧的 Python 版本，因此该模块不再有用。它已被弃用，请改用 :mod:`unittest`。

source: As :class:`~collections.OrderedDict` was added to the standard library in Python 2.7, ``SortedDict`` is no longer needed and has been deprecated.
id: Ketika :class:`~collections.OrderedDict` telah ditambahkan ke pustaka standar di Python 2.7, ``SortedDict`` tidak lagi dibutuhkan dan telah diusangkan.
zh_hans: 由于 Python 2.7 中已经添加了 :class:`~collections.OrderedDict` 到标准库中，因此不再需要 ``SortedDict``，它已经被弃用。

source: The two additional, deprecated methods provided by ``SortedDict`` (``insert()`` and ``value_for_index()``) have been removed. If you relied on these methods to alter structures like form fields, you should now treat these ``OrderedDict``\s as immutable objects and override them to change their content.
id: Dua tambahan, metode diusangkan disediakan oleh ``SortedDict`` (``insert()`` dan ``value_for_index()``) telah dipindahkan. Jika anda bergantung pada metode ini untuk merubah struktur bidang formulir seperti, anda harus sekarang memperlakukan ``OrderedDict`` sebagai obyek kekal dan menimpa mereka untuk merubah isi mereka.
zh_hans: ``SortedDict`` 提供的两个额外且已弃用的方法（``insert()`` 和 ``value_for_index()``）已被移除。如果您曾依赖这些方法来更改类似表单字段的结构，现在应将这些 ``OrderedDict`` 视为不可变对象，并重写它们以更改其内容。

source: For example, you might want to override ``MyFormClass.base_fields`` (although this attribute isn't considered a public API) to change the ordering of fields for all ``MyFormClass`` instances; or similarly, you could override ``self.fields`` from inside ``MyFormClass.__init__()``, to change the fields for a particular form instance. For example (from Django itself)::
id: Sebagai contoh, anda mungkin ingin menimpa ``MyFormClass.base_fields`` (meskipun atribut ini tidak dianggap API umum) untuk merubah urutan dari bidang untuk semua instance ``MyFormClass``; atau sama halnya, anda dapat mengesampingkan ``self.fields`` dari dalam ``MyFormClass.__init__()``, untuk merubah bidang-bidang untuk instance formulir tertentu. Sebagai contoh (dari Django itu sendiri)::
zh_hans: 例如，您可能希望覆盖 ``MyFormClass.base_fields`` （尽管该属性不被视为公共 API）以更改所有 ``MyFormClass`` 实例的字段顺序；或者类似地，您可以在 ``MyFormClass.__init__()`` 中从内部覆盖 ``self.fields``，以更改特定表单实例的字段。例如（来自 Django 自身）：

source: Custom SQL location for models package
id: Penyesuaian tempat SQL untuk paket model
zh_hans: 自定义模型包的 SQL 位置

source: Previously, if models were organized in a package (``myapp/models/``) rather than simply ``myapp/models.py``, Django would look for initial SQL data in ``myapp/models/sql/``. This bug has been fixed so that Django will search ``myapp/sql/`` as documented. After this issue was fixed, migrations were added which deprecates initial SQL data. Thus, while this change still exists, the deprecation is irrelevant as the entire feature will be removed in Django 1.9.
id: Sebelumnya, jika model diatur dalam paket (``myapp/models/``) daripada hanya ``myapp/models.py``, Django akan mencari inisial data SQL di ``myapp/models/sql/``. Kesalahan ini telah diperbaiki sehingga Django akan mencari ``myapp/sql/`` seperti yang didokumentasikan. Setelah masalah ini telah diperbaiki, perpindahan ditambahkan dimana pengusangan inisial data SQL. Demikian, selagi perubahan ini masih ada, pengusangan tidak bersangkut paut sebagai fitur keseluruhan akan dipindahkan di Django 1.9.
zh_hans: 以前，如果模型组织在一个包中（``myapp/models/``）而不是简单的 ``myapp/models.py``，Django 会在 ``myapp/models/sql/`` 中查找初始 SQL 数据。这个问题已经被修复，Django 将按文档中的方式搜索 ``myapp/sql/``。在解决了这个问题后，添加了迁移，从而废弃了初始 SQL 数据。因此，尽管这个改变仍然存在，但废弃已经不相关，因为整个功能将在 Django 1.9 中被移除。

source: Reorganization of ``django.contrib.sites``
id: Reorganisasi dari ``django.contrib.sites``
zh_hans: ``django.contrib.sites`` 的重新组织

source: ``django.contrib.sites`` provides reduced functionality when it isn't in :setting:`INSTALLED_APPS`. The app-loading refactor adds some constraints in that situation. As a consequence, two objects were moved, and the old locations are deprecated:
id: ``django.contrib.sites`` menyediakan pengurangan kegunaan ketika itu tidak di :setting:`INSTALLED_APPS`. Refaktor memuat-aplikasi menambahkan beberapa batasan di keadaan tersebut. Sebagai akibatnya, dua obyek dipindah, dan tempat lama diusangkan:
zh_hans: 当 ``django.contrib.sites`` 不在 :setting:`INSTALLED_APPS` 中时，它提供的功能会减少。应用程序加载的重构在这种情况下添加了一些限制。因此，两个对象被移动，旧的位置已被弃用：

source: :class:`~django.contrib.sites.requests.RequestSite` now lives in ``django.contrib.sites.requests``.
id: :class:`~django.contrib.sites.requests.RequestSite` sekarang berada di ``django.contrib.sites.requests``.
zh_hans: :class:`~django.contrib.sites.requests.RequestSite` 现在位于 ``django.contrib.sites.requests`` 中。

source: :func:`~django.contrib.sites.shortcuts.get_current_site` now lives in ``django.contrib.sites.shortcuts``.
id: :func:`~django.contrib.sites.shortcuts.get_current_site` sekarang berada di ``django.contrib.sites.shortcuts``.
zh_hans: :func:`~django.contrib.sites.shortcuts.get_current_site` 现在位于 ``django.contrib.sites.shortcuts`` 中。

source: ``declared_fieldsets`` attribute on ``ModelAdmin``
id: Atribut ``declared_fieldsets`` pada ``ModelAdmin``
zh_hans: ``ModelAdmin`` 上的 ``declared_fieldsets`` 属性

source: ``ModelAdmin.declared_fieldsets`` has been deprecated. Despite being a private API, it will go through a regular deprecation path. This attribute was mostly used by methods that bypassed ``ModelAdmin.get_fieldsets()`` but this was considered a bug and has been addressed.
id: ``ModelAdmin.declared_fieldsets`` telah diusangkan. Meskipun menjadi sebuah API pribadi, itu akan melalui jalur pengusangan biasa. Atribut ini kebanyakan digunakan oleh metode yang meloloskan ``ModelAdmin.get_fieldsets()`` tetapi ini telah dianggap sebuah kesalahan dan telah dialamatkan.
zh_hans: ``ModelAdmin.declared_fieldsets`` 已经被弃用。尽管它是一个私有 API，但它将按照常规的弃用路径进行处理。这个属性主要被一些绕过了 ``ModelAdmin.get_fieldsets()`` 方法的方法使用，但这被视为一个错误，并已得到解决。

source: Reorganization of ``django.contrib.contenttypes``
id: Reorganisasi dari ``django.contrib.contenttypes``
zh_hans: ``django.contrib.contenttypes`` 的重新组织
