Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django now requires all Field classes and all of their constructor arguments to be serializable. If you modify the constructor signature in your custom Field in any way, you'll need to implement a deconstruct() method; we've expanded the custom field documentation with :ref:`instructions on implementing this method <custom-field-deconstruct-method>`.
id: Django sekarang membutuhkan semua kelas-kelas Field dan semua dari argumen pembangun mereka untuk diserialisasikan. Jika anda merubah tanda tangan pembangun di penyesuaian Field dengan cara apapun, anda akan butuh menerapkan sebuah metode deconstruct(); kami telah memperpanjang penyesuaian dokumentasi bidang dengan :ref:`instructions on implementing this method <custom-field-deconstruct-method>`.

source: If you're using Django in a plain Python script rather than a management command and you rely on the :envvar:`DJANGO_SETTINGS_MODULE` environment variable, you must now explicitly initialize Django at the beginning of your script with::
id: Jika anda sedang menggunakan Django dalam tulisan Python polos - daripada perintah pengelolaan - dan anda menggantungkan pada variabel lingkungan :envvar:`DJANGO_SETTINGS_MODULE`, anda harus sekarang secara eksplisit menginisialisasi Django pada permulaan dari tulisan anda dengan::

source: Also if you directly assigned the return value of ``update_error_dict()`` to ``Form._errors`` you may inadvertently add `list` instances where ``ErrorList`` instances are expected. This is a problem because unlike a simple `list`, an ``ErrorList`` knows how to handle instances of ``ValidationError``.
id: Juga jika anda secara langsung memberikan nilai kembali dari ``update_error_dict()`` pada ``Form._errors`` anda mungkin secar tidak sengaja menambah instance `list`` dimana instance ``ErrorList`` yang diharapkan. Ini adalah sebuah masalah karena tidak seperti sebuah `list` sederhana, sebuah ``ErrorList`` tahu bagaimana menangani instance dari ``ValidationError``.

source: pytz may be required
id: pytz mungkin dibutuhkan

source: If your project handles datetimes before 1970 or after 2037 and Django raises a :exc:`ValueError` when encountering them, you will have to install pytz_. You may be affected by this problem if you use Django's time zone-related date formats or :mod:`django.contrib.syndication`.
id: Jika proyek anda menangani datetime sebelum 1970 dan setelah 2037 dan Django memunculkan sebuah :exc:`ValueError` ketika menghadapi mereka, anda harus memasang pytz_. Anda mungkin terpengaruh oleh masalah ini jika anda menggunakan bentuk terkait-zona waktu Django atau :mod:`django.contrib.syndication`.

source: The function ``memoize`` is deprecated and should be replaced by the ``functools.lru_cache`` decorator (available from Python 3.2 onwards).
id: Fungsi ``memoize`` diusangkan dan harus diganti oleh penghias ``functools.lru_cache`` (tersedia dari Python 3.2 ke depan).

source: Avoided masking some `ImportError` exceptions during application loading (:ticket:`22920`).
id: Dihindari menutupi beberapa pengecualian `ImportError` selama memuat aplikasi (:ticket:`22920`).

source: Made the :setting:`SERIALIZE <TEST_SERIALIZE>` entry in the :setting:`TEST <DATABASE-TEST>` dictionary usable (:ticket:`23421`).
id: Membuat masukan :setting:`SERIALIZE <TEST_SERIALIZE>` di kamus :setting:`TEST <DATABASE-TEST>` berguna (:ticket:`23421`).

source: Coerced the ``related_name`` model field option to unicode during migration generation to generate migrations that work with both Python 2 and 3 (:ticket:`23455`).
id: Dipaksa pilihan bidang model ``related_name`` ke unicode selama pembangkitan perpindahan untuk membangkitkan perpindahan yang bekerja dengan kedua Python 2 dan 3 (:ticket:`23455`).

source: Made :func:`~django.utils.http.urlsafe_base64_decode` return the proper type (byte string) on Python 3 (:ticket:`23333`).
id: Dibuat :func:`~django.utils.http.urlsafe_base64_decode` mengembalikan jenis yang sesuai (string byte) d Python 3 (:ticket:`23333`).

source: Always converted ``related_name`` to text (unicode), since that is required on Python 3 for interpolation. Removed conversion of ``related_name`` to text in migration deconstruction (:ticket:`23455` and :ticket:`23982`).
id: Selalu dirubah ``related_name`` menjadi teks (unicokde), sejak itu diwajibkan pada Python 3 untuk penambahan. Dipindahkan perubahan dari ``related_name`` pada teks di perpindahan dekonstruksi (:ticket:`23455` and :ticket:`23982`).

source: Added quoting to field indexes in the SQL generated by migrations to prevent a crash when the index name requires it (:ticket:`#24015`).
id: Ditambahkan mengutip pada indeks bidang di SQL dibangkitkan oleh perpindahan untuk mencegah kegagalan nama indeks mewajibkan itu (:ticket:`24015`).

source: Fixed a migration crash when unapplying ``contrib.contenttypes``s or ``contrib.auth``s first migration (:ticket:`24075`).
id: Diperbaiki sebuah kegagalan perpindahan ketika tidak memberlakukan perpindahan pertama ``contrib.contenttypes`` atau ``contrib.auth`` (:ticket:`24075`).

source: Reverted a fix that prevented a migration crash when unapplying ``contrib.contenttypes``s or ``contrib.auth``s first migration (:ticket:`24075`) due to severe impact on the test performance (:ticket:`24251`) and problems in multi-database setups (:ticket:`24298`).
id: Dirubah sebuah perbaikan yang mencegah sebuah kegagalan perpindahan ketika tidak memberlakukan perpindahan pertama ``contrib.contenttypes`` atau ``contrib.auth`` (:ticket:`24075`) karena dampak parah pada penampilan percobaan (:ticket:`24251`) dan masalah di penyetelan banyak-basisdata (:ticket:`24298`).

source: Added the ability to set the isolation level on PostgreSQL with psycopg2 2.4.2 (:ticket:`24318`). It was advertised as a new feature in Django 1.6 but it didn't work in practice.
id: Ditambahkan kemampuan menyetel tingkatan pemisahan di PostgreSQL dengan psycopg2 = 2.4.2 (:ticket:`24318`). Itu telah diperkenalkan sebagai fitur baru di Django 1.6 tetapi itu tidak bekerja dalam praktiknya.

source: Django 1.8 has been designated as Django's second :term:`long-term support release`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 1.4, will end 6 months from the release date of Django 1.8.
id: Django 1.8 telah dirancang sebagai :term:`long-term support release` kedua Django. Itu akan menerima pembaharuan keamanan untuk setidaknya tiga tahun setelah terbitannya. Dukungang untuk LTS sebelumnya, Django 1.4 akan berakhir 6 bulan dari tanggal terbitan Django 1.8.

source: ``Model._meta`` API
id: API ``Model._meta``

source: The ``Model._meta`` object has been part of Django since the days of pre-0.96 "Magic Removal" -- it just wasn't an official, stable API. In recognition of this, we've endeavored to maintain backwards-compatibility with the old API endpoint where possible. However, API endpoints that aren't part of the new official API have been deprecated and will eventually be removed. A :ref:`guide to migrating from the old API to the new API <migrating-old-meta-api>` has been provided.
id: Obyek ``Model._meta`` telah menjadi bagian dari Django sejak haru dari pra-0.96 "Magic Removal" -- Itu hanya bukan sebuah resmi, API stabil. Dalam mengenali ini, kami telah berusaha merawat kesesuaian-kebelakang dengan titik akhir API lama dimana memungkinkan. Bagaimanapun, titik akhir API yang bukan bagian dari API resmi baru telah diusangkan dan akhirnya akan dipindahkan. Sebuah ref:`guide to migrating from the old API to the new API <migrating-old-meta-api>` telah disediakan.

source: Several features of the django-secure_ third-party library have been integrated into Django. :class:`django.middleware.security.SecurityMiddleware` provides several security enhancements to the request/response cycle. The new :option:`check --deploy` option allows you to check your production settings file for ways to increase the security of your site.
id: Beberapa fitur-fitur dari pustaka pihak-ketiga django-secure_ telah dipadukan kedalam Django. :class:`django.middleware.security.SecurityMiddleware` menyediakan beberapa peningkatan keamanan pada siklus request/response. Pilihan :option:`check --deploy` baru mengizinkan anda untuk memeriksa berkas pengaturan produksi untuk cara meningkatkan keamanan dari situs anda.

source: The class method :meth:`TestCase.setUpTestData() <django.test.TestCase.setUpTestData>` adds the ability to setup test data at the class level. Using this technique can speed up the tests as compared to using ``setUp()``.
id: Metode kelas :meth:`TestCase.setUpTestData() <django.test.TestCase.setUpTestData>` menambah kemampuan untuk mengatur percobaan data pada tingkat kelas. Menggunakan teknik ini dapat mempercepat percobaan seperti dibandingkan untuk menggunakan ``setUp()``.

source: :class:`~django.forms.Field` now accepts a :attr:`~django.forms.Field.label_suffix` argument, which will override the form's :attr:`~django.forms.Form.label_suffix`. This enables customizing the suffix on a per-field basis previously it wasn't possible to override a form's :attr:`~django.forms.Form.label_suffix` while using shortcuts such as ``{{ form.as_p }}`` in templates.
id: :class:`~django.forms.Field` sekarang menerima sebuah argumen :attr:`~django.forms.Field.label_suffix`, yang akan menimpa :attr:`~django.forms.Form.label_suffix` formulir. Ini mengadakan penyesuaian akhiran pada berdasarkan per bidang - sebelumnya itu tidak memungkinkan untuk mengesampingkan sebuah :attr:`~django.forms.Form.label_suffix` formulir selagi menggunakan jalan pintas seperti ``{{ form.as_p }}`` di cetakan.

source: Model field ``default``s are now used when primary key field's are set to ``None``.
id: Bidang model ``default`` ini sekarang digunakan ketika bidang primary key disetel menjadi ``None``.

source: :class:`~django.core.validators.URLValidator` now supports IPv6 addresses, unicode domains, and URLs containing authentication data.
id: :class:`~django.core.validators.URLValidator` sekarang mendukung alamat IPv6, ranah unicode, dan URL mengandung data otentifikasi.

source: To more easily allow in-memory usage of models, this change was reverted in Django 1.8.4 and replaced with a check during ``model.save()``. For example::
id: Untuk lebih mudah mengizinkan penggunaan dalam-memori dari model, perubahan ini telah dikembalikan di Django 1.8.4 dan diganti dengan pemeriksaan selama ``model.save()``. Sebagai contoh::

source: Previously, the assignment of an unsaved object would be silently ignored. For example::
id: Sebelumnya, penugasan dari obyek tidak disimpan dapat secara diam diabaikan. Sebagai contoh::

source: Now, an error will be raised to prevent data loss::
id: Sekarang, sebuah kesalahan akan muncul untuk mencegah kehilangan data::

source: The method to add custom arguments to the `test` management command through the test runner has changed. Previously, you could provide an `option_list` class variable on the test runner to add more arguments ( la :py:mod:`optparse`). Now to implement the same behavior, you have to create an ``add_arguments(cls, parser)`` class method on the test runner and call ``parser.add_argument`` to add any custom arguments, as parser is now an :py:class:`argparse.ArgumentParser` instance.
id: Metode untuk menambah penyesuaian argumen pada perintah pengelolaan `test` melalui pejalan percobaan telah berubah. Sebelumnya, anda dapat menyediakan sebuah variabel kelas `option_list` pada pejalan percobaan untuk menambah argumen lebih ( la :py:mod:`optparse`). Sekarang menerapkan perilaku lama, anda telah membuat sebuah metode kelas ``add_arguments(cls, parser)`` dan memanggil ``parser.add_argument`` untuk menambahkan setiap penyesuaian argumen, sebagai pengurai adalah sekarang sebuah instance :py:class:`argparse.ArgumentParser`.

source: Querying for model lookups now checks if the object passed is of correct type and raises a :exc:`ValueError` if not. Previously, Django didn't care if the object was of correct type; it just used the object's related field attribute (e.g. ``id``) for the lookup. Now, an error is raised to prevent incorrect lookups::
id: Meminta untuk pencarian model sekarang diperiksa jika obyek diloloskan adalah jenis benar dan memunculkan sebuah :exc:`ValueError` jika tidak. Sebelumnya, Django tidak peduli jika objek adalah jenis benar; itu cukup menggunakan atribut bidang terkait objek (sebagai contoh ``id``) untuk pencarian. Sekarang, sebuah kesalahan dimunculkan untuk mencegah pencarian tidak benar::

source: ``select_related()`` now validates that the given fields actually exist. Previously, nonexistent fields were silently ignored. Now, an error is raised::
id: ``select_related()`` sekarang mengesahkan bahwa bidang yang diberikan sebenarnya ada. Sebelumnya, bidang tidak ada secara diam diabaikan. Sekarang, sebuah kesalahan dimunculkan::

source: The validation also makes sure that the given field is relational::
id: Pengesahan juga memastikan bahwa bidang yang diberikan adalah terhubung::

source: Consider this example from the tutorial in Django 1.8::
id: Pertimbangkan contoh ini dari tutorial di Django 1.8::

source: and compare it to the behavior on older versions::
id: dan bandingkan dia pada perilaku versi lama::

source: Also note that ``get_all_related_objects()`` is deprecated in 1.8. See the :ref:`upgrade guide <migrating-old-meta-api>` for the new API.
id: Juga catat bahwa ``get_all_related_objects()`` diusangkan di 1.8. Lihat :ref:`upgrade guide <migrating-old-meta-api>` untuk API baru.

source: ``reverse()`` and ``reverse_lazy()`` now return Unicode strings instead of byte strings.
id: ``reverse()`` dan ``reverse_lazy()`` sekarang mengembalikan string Unicode daripada string byte.

source: When iterating over lines, :class:`~django.core.files.File` now uses `universal newlines`_. The following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``.
id: Ketika mengulang terhadap baris, :class:`~django.core.files.File` sekarang menggunakan `universal newlines`_. Berikut dikenali sebagai akhiran sebuah baris: kebiasaan akhir-baris Unix ``'\n'``, kebiasaan Windows ``'\r\n'``, dan kebiasaan Macintosh lama ``'\r'``.

source: A :ref:`migration guide <migrating-old-meta-api>` has been provided to assist in converting your code from the old API to the new, official API.
id: Sebuah :ref:`migration guide <migrating-old-meta-api>` telah disediakan untuk memandu dalam merubah kode anda dari API lama ke baru, API resmi.

source: Thus ``patterns()`` serves little purpose and is a burden when teaching new users (answering the newbie's question "why do I need this empty string as the first argument to ``patterns()``?"). For these reasons, we are deprecating it. Updating your code is as simple as ensuring that ``urlpatterns`` is a list of :func:`django.conf.urls.url` instances. For example::
id: Dengan demikian ``patterns()`` melayani sedikit tujuan dan adalah sebuah tanggunan ketika mengajarkan pengguna baru (menjawab pertanyaan baru "mengapa Saya butuh string kosong ini sebagai argumen pertama pada ``patterns()``?"). Untuk alasan ini, kami sedang mengusangkan itu. Memperbaharui kode anda adalah semudah memastikan bahwa ``urlpatterns`` adalah sebuah daftar dari instance :func:`django.conf.urls.url`. Sebagai contoh::

source: Passing a string as ``view`` to :func:`~django.conf.urls.url`
id: Melewatkan sebuah string sebagai ``view`` pada :func:`~django.conf.urls.url`

source: Related to the previous item, the ``prefix`` argument to :func:`django.conf.urls.i18n.i18n_patterns` has been deprecated. Simply pass a list of :func:`django.conf.urls.url` instances instead.
id: Terkait pada barang sebelumnya, argumen ``prefix`` pada :func:`django.conf.urls.i18n.i18n_patterns` telah diusangkan. Cukup melewatkan sebuah daftar dai instance :func:`django.conf.urls.url` sebagai gantinya.

source: The ``django.utils.checksums`` module has been deprecated and will be removed in Django 1.10. The functionality it provided (validating checksum using the Luhn algorithm) was undocumented and not used in Django. The module has been moved to the `django-localflavor`_ package (version 1.1+).
id: Modul ``django.utils.checksums`` telah diusangkan dan akan dipindahkan di Django 1.10. Fungsionalitas dia sediakan (memeriksa checksum menggunakan algoritma Luhn) tidak didokumentasikan dan tidak digunakan di Django. Modul telah dipindahkan ke paket `django-localflavor`_ (versi 1.1+).

source: ``django.views.generic.edit.FormMixin.get_form()``s ``form_class`` argument
id: Argumen ``form_class`` ``django.views.generic.edit.FormMixin.get_form()``

source: Updated ``urlpatterns`` examples generated by :djadmin:`startproject` to remove usage of referencing views by dotted path in :func:`~django.conf.urls.url` which is deprecated in Django 1.8 (:ticket:`24635`).
id: Diperbaharui contoh ``urlpatterns`` dibangkitkan oleh :djadmin:`startproject` untuk memindahkan penggunaan dari tampilan acuan oleh jalur bertitik di :func:`~django.conf.urls.url` yang diusangkan di Django 1.8 (:ticket:`24635`).

source: Fixed JavaScript path of ``contrib.admin``s related field widget when using alternate static file storages (:ticket:`24655`).
id: Diperbaiki jalur JavaScript dari widget bidang acuan ``contrib.admin`` ketika bergantian menggunakan penyimpanan berkas tetap (:ticket:`24655`).

source: Fixed `AttributeError: function 'GDALAllRegister' not found` error when initializing ``contrib.gis`` on Windows.
id: Diperbaiki kesalahan `AttributeError: function 'GDALAllRegister' not found` ketika menginisialisasikan ``contrib.gis`` di Windows.

source: Fixed a MySQL crash when a migration removes a combined index (unique_together or index_together) containing a foreign key (:ticket:`24757`).
id: Diperbaiki kegagalan MySQL ketika sebuah perpindahan memindahkan indeks dipadukan (unique_together atau index_together) mengandung foreign key (:ticket:`24757`).

source: Fixed display of ``contrib.admin``s ``ForeignKey`` widget when it's used in a row with other fields (:ticket:`24784`).
id: Diperbaiki tampilan dari widget ``ForeignKey`` ``contrib.admin`` ketika itu digunakan dalam sebuah baris dengan bidang lain (:ticket:`24784`).

source: Fixed ``BaseRangeField.prepare_value()`` to use each ``base_field``s ``prepare_value()`` method (:ticket:`24841`).
id: Diperbaiki ``BaseRangeField.prepare_value()`` untuk digunakan setiap metode ``prepare_value()`` ``base_field`` (:ticket:`24841`).

source: Improved `pyinotify` ``runserver`` polling (:ticket:`23882`).
id: Diperbaiki jejak pendapat `pyinotify` ``runserver`` (:ticket:`23882`).

source: Fixed a typo in the name of the `strictly_above` PostGIS lookup (:ticket:`25592`).
id: Diperbaiki sebuah kesalahan ketik di nama dari pencarian PostGIS `strictly_above` (:ticket:`25592`).

source: Python 3.2 users, please be advised that we've decided to drop support for Python 3.2 in Django 1.8.x at the end of 2016. We won't break things intentionally after that, but we won't test subsequent releases against Python 3.2 either. Upstream support for Python 3.2 ends February 2016 so we don't find much value in providing security updates for a version of Python that could be insecure. To read more about the decision and to let us know if this will be problematic for you, please read the `django-developers thread <https://groups.google.com/d/topic/django-developers/eMu5UQpUdWs/discussion>`_.
id: Pengguna Python 3.2, harap maklum bahwa kami telah memutuskan untuk menjatuhkan dukungan untuk Python 3.2 di Django 1.8.x pada akhir 2016. Kami tidak akan merusak hal-hal sengaja setelah itu, tetapi kami tidak mencoba terbitan berikut terhadap Python 3.2 juga. Dukungan hulu untuk Python 3.2 berakhir Februari 2016 jadi kami tidak menemukan banyak nilai dalam menyediakan perbaharuan keamanan untuk versi dari Python yang dapat tidak aman. Untuk membaca lebih tentang keputusan dan biarkan kami mengetahui jika ini akan menjadi bermasalah untuk anda, harap baca `django-developers thread <https://groups.google.com/d/topic/django-developers/eMu5UQpUdWs/discussion>`_.

source: This functionality from the `django-transaction-hooks`_ package has been integrated into Django.
id: Fungsi ini dari paket `django-transaction-hooks`_ telah dipadukan kedalam Django.

source: The new :meth:`GDALRaster.warp() <django.contrib.gis.gdal.GDALRaster.warp>` method allows warping a raster by specifying target raster properties such as origin, width, height, or pixel size (amongst others).
id: Metode :meth:`GDALRaster.warp() <django.contrib.gis.gdal.GDALRaster.warp>` baru mengizinkan membengkokkan sebuah raster dengan menentukan sifat sasaran seperti asal, lebar, tinggi, atau ukuran pixel (terhadap lainnya).

source: Added :class:`~django.contrib.postgres.fields.JSONField`.
id: Ditambahkan :class:`~django.contrib.postgres.fields.JSONField`.

source: :djadmin:`makemessages` now calls xgettext once per locale directory rather than once per translatable file. This speeds up localization builds.
id: :djadmin:`makemessages` sekarang memanggil xgettext sekali per direktori lokal daripada sekali per berkas diterjemahkan. Ini mempercepat membangun lokalisasi.

source: The :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` now ignores 404s when the referer is equal to the requested URL. To circumvent the empty referer check already implemented, some Web bots set the referer to the requested URL.
id: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` sekarang mengabaikan 404 ketika pengarah setara pada URL yang diminta. Untuk mengelak pemeriksaan pengarah kosong sudah diterapkan, beberapa Web bot menyetel pengarah ke URL diminta.

source: :meth:`Context.update() <django.template.Context.update>` can now be used as a context manager.
id: :meth:`Context.update() <django.template.Context.update>` sekarang dapat digunakan sebagai pengelola konteks.

source: Django template loaders previously required an ``is_usable`` attribute to be defined. If a loader was configured in the template settings and this attribute was ``False``, the loader would be silently ignored. In practice, this was only used by the egg loader to detect if setuptools was installed. The ``is_usable`` attribute is now removed and the egg loader instead fails at runtime if setuptools is not installed.
id: Pemuat cetakan Django sebelumnya membutuhkan sebuah atribut ``is_usable`` untuk ditentukan. Jika sebuah pemuat dikonfigurasikan di pengaturan cetakan dan atribut ini adalah ``False``, pemuat akan secara diam mengabaikan. Dalam praktiknya, ini hanya digunakan oleh pemuat telur untuk mengenali jika alat pengaturan telah dipasang. Atribut ``is_usable`` sekarang dipindah dan pemuat telur sebagai gantinya gagal pada waktu jalan jika alat pengaturan tidak dipasang.

source: Consequently, the expected URLs passed to ``assertRedirects`` should generally no longer include the scheme and domain part of the URLs. For example, ``self.assertRedirects(response, 'http://testserver/some-url/')`` should be replaced by ``self.assertRedirects(response, '/some-url/')`` (unless the redirection specifically contained an absolute URL, of course).
id: Karena itu, URL diharapkan dilewatkan ke ``assertRedirects`` harus seara umum tidak lagi menyertakan skema dan bagian ranah dari URL. Sebagai contoh, ``self.assertRedirects(response, 'http://testserver/some-url/')`` harus diganti dengan ``self.assertRedirects(response, '/some-url/')`` (meskipun pengalihan secara khusus mengandung sebuah URL mutlak, tentu saja).
