Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a regression in Django 3.0 where ``QuerySet.values()`` and ``values_list()`` crashed if a queryset contained an aggregation and ``Exists()`` annotation (:ticket:`31136`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致如果查询集中包含聚合和 ``Exists()`` 注释，那么 ``QuerySet.values()`` 和 ``values_list()`` 会崩溃 (:ticket:`31136`)。

source: Relaxed the system check added in Django 3.0 to reallow use of a sublanguage in the :setting:`LANGUAGE_CODE` setting, when a base language is available in Django but the sublanguage is not (:ticket:`31141`).
zh_hans: 在 Django 3.0 中放宽了系统检查，允许在 :setting:`LANGUAGE_CODE` 设置中使用子语言，当 Django 中有基本语言可用但子语言不可用时 (:ticket:`31141`)。

source: Added support for using enumeration types ``TextChoices``, ``IntegerChoices``, and ``Choices`` in templates (:ticket:`31154`).
zh_hans: 添加了在模板中使用枚举类型 ``TextChoices``、``IntegerChoices`` 和 ``Choices`` 的支持 (:ticket:`31154`)。

source: Fixed a system check to ensure the ``max_length`` attribute fits the longest choice, when a named group contains only non-string values (:ticket:`31155`).
zh_hans: 修复了一个系统检查，以确保当一个命名组只包含非字符串值时，``max_length`` 属性适合最长的选择 (:ticket:`31155`)。

source: Fixed a regression in Django 2.2 that caused a crash of :class:`~django.contrib.postgres.aggregates.ArrayAgg` and :class:`~django.contrib.postgres.aggregates.StringAgg` with ``filter`` argument when used in a ``Subquery`` (:ticket:`31097`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当在 ``Subquery`` 中使用带有 ``filter`` 参数的 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg` 时导致崩溃 (:ticket:`31097`)。

source: Fixed a regression in Django 2.2.7 that caused :meth:`~django.db.models.Model.get_FOO_display` to work incorrectly when overriding inherited choices (:ticket:`31124`).
zh_hans: 修复了 Django 2.2.7 中的一个回归问题，当覆盖继承的选择项时，导致 :meth:`~django.db.models.Model.get_FOO_display` 不正确工作 (:ticket:`31124`)。

source: Fixed a regression in Django 3.0 that caused a crash of ``QuerySet.prefetch_related()`` for ``GenericForeignKey`` with a custom ``ContentType`` foreign key (:ticket:`31190`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在具有自定义 ``ContentType`` 外键的 ``GenericForeignKey`` 上使用 ``QuerySet.prefetch_related()`` 时崩溃 (:ticket:`31190`)。

source: Django 3.0.4 release notes
zh_hans: Django 3.0.4 版本发行说明

source: Django 3.0.4 fixes a security issue and several bugs in 3.0.3.
zh_hans: Django 3.0.4 修复了 3.0.3 版本中的一个安全问题和多个错误。

source: Fixed a data loss possibility when using caching from async code (:ticket:`31253`).
zh_hans: 修复了在异步代码中使用缓存时可能导致数据丢失的问题 (:ticket:`31253`)。

source: Fixed a regression in Django 3.0 that caused a file response using a temporary file to be closed incorrectly (:ticket:`31240`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致使用临时文件的文件响应被不正确地关闭 (:ticket:`31240`)。

source: Fixed a regression in Django 3.0 that caused misplacing parameters in logged SQL queries on Oracle (:ticket:`31271`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在 Oracle 上记录的 SQL 查询中参数位置不正确 (:ticket:`31271`)。

source: Fixed a regression in Django 3.0.3 that caused misplacing parameters of SQL queries when subtracting ``DateField`` or ``DateTimeField`` expressions on MySQL (:ticket:`31312`).
zh_hans: 修复了 Django 3.0.3 中的一个回归问题，该问题导致在 MySQL 上在减去 ``DateField`` 或 ``DateTimeField`` 表达式时，SQL 查询的参数位置不正确 (:ticket:`31312`)。

source: Fixed a regression in Django 3.0 that didn't include subqueries spanning multivalued relations in the ``GROUP BY`` clause (:ticket:`31150`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在 ``GROUP BY`` 子句中未包括跨多值关系的子查询 (:ticket:`31150`)。

source: Django 3.0.5 release notes
zh_hans: Django 3.0.5 版本发行说明

source: Django 3.0.5 fixes several bugs in 3.0.4.
zh_hans: Django 3.0.5 修复了 3.0.4 版本中的多个错误。

source: Fixed a regression in Django 3.0 where ``QuerySet.values()`` and ``values_list()`` crashed if a queryset contained an aggregation and ``Subquery()`` annotation that collides with a field name (:ticket:`31377`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致如果查询集中包含了聚合和与字段名称冲突的 ``Subquery()`` 注释，那么 ``QuerySet.values()`` 和 ``values_list()`` 会崩溃 (:ticket:`31377`)。

source: Django 3.0.6 release notes
zh_hans: Django 3.0.6 版本发行说明

source: *May 4, 2020*
zh_hans: *2020 年 5 月 4 日*

source: Django 3.0.6 fixes a bug in 3.0.5.
zh_hans: Django 3.0.6 修复了 3.0.5 版本中的一个错误。

source: Fixed a regression in Django 3.0 that caused a crash when filtering a ``Subquery()`` annotation of a queryset containing a single related field against a ``SimpleLazyObject`` (:ticket:`31420`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致在针对包含单个相关字段的查询集的 ``Subquery()`` 注释进行筛选时与 ``SimpleLazyObject`` 发生冲突时崩溃 (:ticket:`31420`)。

source: Django 3.0.7 release notes
zh_hans: Django 3.0.7 版本发行说明

source: Django 3.0.7 fixes two security issues and several bugs in 3.0.6.
zh_hans: Django 3.0.7 修复了 3.0.6 版本中的两个安全问题和多个错误。

source: Fixed a regression in Django 3.0 by restoring the ability to use field lookups in ``Meta.ordering`` (:ticket:`31538`).
zh_hans: 通过恢复在 ``Meta.ordering`` 中使用字段查找的功能，修复了 Django 3.0 中的一个回归问题 (:ticket:`31538`)。

source: Fixed a regression in Django 3.0 where ``QuerySet.values()`` and ``values_list()`` crashed if a queryset contained an aggregation and a subquery annotation (:ticket:`31566`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致如果查询集中包含了聚合和子查询注释，那么 ``QuerySet.values()`` 和 ``values_list()`` 会崩溃 (:ticket:`31566`)。

source: Fixed a regression in Django 3.0 where aggregates used wrong annotations when a queryset has multiple subqueries annotations (:ticket:`31568`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，当查询集具有多个子查询注释时，聚合使用了错误的注释 (:ticket:`31568`)。

source: Fixed a regression in Django 3.0 where ``QuerySet.values()`` and ``values_list()`` crashed if a queryset contained an aggregation and an ``Exists()`` annotation on Oracle (:ticket:`31584`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致如果查询集中包含了聚合和 Oracle 上的 ``Exists()`` 注释，那么 ``QuerySet.values()`` 和 ``values_list()`` 会崩溃 (:ticket:`31584`)。

source: Fixed a regression in Django 3.0 where all resolved ``Subquery()`` expressions were considered equal (:ticket:`31607`).
zh_hans: 修复了 Django 3.0 中的一个回归问题，该问题导致所有已解析的 ``Subquery()`` 表达式被视为相等 (:ticket:`31607`)。

source: Fixed a regression in Django 3.0.5 that affected translation loading for apps providing translations for territorial language variants as well as a generic language, where the project has different plural equations for the language (:ticket:`31570`).
zh_hans: 修复了 Django 3.0.5 中的一个回归问题，该问题影响了为领土语言变体和通用语言提供翻译的应用程序的翻译加载，其中项目对该语言具有不同的复数规则 (:ticket:`31570`)。

source: Tracking a jQuery security release, upgraded the version of jQuery used by the admin from 3.4.1 to 3.5.1.
zh_hans: 追踪了一个 jQuery 的安全发布，将管理员界面中使用的 jQuery 版本从 3.4.1 升级到 3.5.1 。

source: Django 3.0.8 release notes
zh_hans: Django 3.0.8 版本发行说明

source: Django 3.0.8 fixes several bugs in 3.0.7.
zh_hans: Django 3.0.8 修复了 3.0.7 版本中的多个错误。

source: Fixed a regression in Django 3.0.7 that caused a queryset crash when grouping by a many-to-one relationship (:ticket:`31660`).
zh_hans: 修复了 Django 3.0.7 中的一个回归问题，该问题导致在按多对一关系进行分组时查询集崩溃 (:ticket:`31660`)。

source: Reallowed, following a regression in Django 3.0, non-expressions having a ``filterable`` attribute to be used as the right-hand side in queryset filters (:ticket:`31664`).
zh_hans: 在 Django 3.0 中放宽了一个系统检查，允许在查询集过滤器的右侧使用具有 ``filterable`` 属性的非表达式对象，这是因为在 Django 3.0 中发生了一个回归问题 (:ticket:`31664`)。

source: Fixed a regression in Django 3.0.2 that caused a migration crash on PostgreSQL when adding a foreign key to a model with a namespaced ``db_table`` (:ticket:`31735`).
zh_hans: 修复了 Django 3.0.2 中的一个回归问题，该问题导致在向具有命名空间 ``db_table`` 的模型添加外键时在 PostgreSQL 上发生迁移崩溃 (:ticket:`31735`)。

source: Added compatibility for ``cx_Oracle`` 8 (:ticket:`31751`).
zh_hans: 为 ``cx_Oracle`` 8 添加了兼容性 (:ticket:`31751`)。

source: Django 3.0.9 release notes
zh_hans: Django 3.0.9 版本发行说明

source: Django 3.0.9 fixes several bugs in 3.0.8.
zh_hans: Django 3.0.9 修复了 3.0.8 版本中的多个错误。

source: Django 3.1 release notes
zh_hans: Django 3.1 版本发行说明

source: *August 4, 2020*
zh_hans: *2020 年 8 月 4 日*

source: Welcome to Django 3.1!
zh_hans: 欢迎来到 Django 3.1 版本！

source: These release notes cover the :ref:`new features <whats-new-3.1>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-3.1>` you'll want to be aware of when upgrading from Django 3.0 or earlier. We've :ref:`dropped some features<removed-features-3.1>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-3.1>`.
zh_hans: 此版本说明涵盖了一些 :ref:`新特性 <whats-new-3.1>` ，以及从 Django 3.0 或更早版本升级时需要注意的 :ref:`向后不兼容 <backwards-incompatible-3.1>` 的地方。我们已经 :ref:`删除了一些过期的功能 <removed-features-3.1>` ，并且已经开始 :ref:`淘汰一些特性 <deprecated-features-3.1>` 。

source: Django 3.1 supports Python 3.6, 3.7, 3.8, and 3.9 (as of 3.1.3). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 3.1 支持 Python 3.6、3.7、3.8 和 3.9（从 3.1.3 开始）。我们 **强烈推荐** 且官方只支持每个系列的最新版本。

source: What's new in Django 3.1
zh_hans: Django 3.1 新特性

source: Asynchronous views and middleware support
zh_hans: 异步视图和中间件支持

source: Django now supports a fully asynchronous request path, including:
zh_hans: Django 现在支持完全异步的请求路径，包括：

source: :ref:`Asynchronous views <async-views>`
zh_hans: :ref:`异步视图 <async-views>`

source: :ref:`Asynchronous middleware <async-middleware>`
zh_hans: :ref:`异步中间件 <async-middleware>`

source: :ref:`Asynchronous tests and test client <async-tests>`
zh_hans: :ref:`异步测试和测试客户端 <async-tests>`

source: To get started with async views, you need to declare a view using ``async def``::
zh_hans: 要开始使用异步视图，你需要使用 ``async def`` 来声明一个视图：

source: All asynchronous features are supported whether you are running under WSGI or ASGI mode. However, there will be performance penalties using async code in WSGI mode. You can read more about the specifics in :doc:`/topics/async` documentation.
zh_hans: 无论你是在 WSGI 或 ASGI 模式下运行，都支持所有的异步功能。但是，在 WSGI 模式下使用 async 代码会有性能上的惩罚。你可以在 :doc:`/topics/async` 文档中阅读更多的具体内容。

source: You are free to mix async and sync views, middleware, and tests as much as you want. Django will ensure that you always end up with the right execution context. We expect most projects will keep the majority of their views synchronous, and only have a select few running in async mode - but it is entirely your choice.
zh_hans: 你可以自由地混合异步和同步视图、中间件和测试，只要你愿意。Django 会确保你最终使用正确的执行上下文。我们希望大多数项目会保持大部分视图的同步，只有少数视图在异步模式下运行，但这完全是你的选择。

source: Django's ORM, cache layer, and other pieces of code that do long-running network calls do not yet support async access. We expect to add support for them in upcoming releases. Async views are ideal, however, if you are doing a lot of API or HTTP calls inside your view, you can now natively do all those HTTP calls in parallel to considerably speed up your view's execution.
zh_hans: Django 的 ORM、缓存层和其他做长期网络调用的代码还不支持异步访问。我们希望在即将发布的版本中增加对它们的支持。但是，异步视图是很理想的，如果你在视图里面做了大量的 API 或 HTTP 调用，你现在可以原生地将所有这些 HTTP 调用并行进行，以大大加快你的视图的执行速度。

source: Asynchronous support should be entirely backwards-compatible and we have tried to ensure that it has no speed regressions for your existing, synchronous code. It should have no noticeable effect on any existing Django projects.
zh_hans: 异步支持应该是完全向后兼容的，我们已经尝试确保它不会对你现有的同步代码造成速度上的倒退。它应该不会对任何现有的 Django 项目产生明显的影响。

source: JSONField for all supported database backends
zh_hans: JSONField 适用于所有支持的数据库后端。

source: Django now includes :class:`.models.JSONField` and :class:`forms.JSONField <django.forms.JSONField>` that can be used on all supported database backends. Both fields support the use of custom JSON encoders and decoders. The model field supports the introspection, :ref:`lookups, and transforms <querying-jsonfield>` that were previously PostgreSQL-only::
zh_hans: Django 现在包含 :class:`.models.JSONField` 和 :class:`forms.JSONField <django.forms.JSONField>`，可以在所有支持的数据库后端使用。这两个字段都支持使用自定义 JSON 编码器和解码器。模型字段支持自省、:ref:`查找和变换 <querying-jsonfield>`，这些功能以前只有 PostgreSQL 才有：

source: If your project uses ``django.contrib.postgres.fields.JSONField``, plus the related form field and transforms, you should adjust to use the new fields, and generate and apply a database migration. For now, the old fields and transforms are left as a reference to the new ones and are :ref:`deprecated as of this release <deprecated-jsonfield>`.
zh_hans: 如果你的项目使用了 ``django.contrib.postgres.fields.JSONField``，加上相关的表单字段和变换，你应该调整使用新的字段，并生成和应用数据库迁移。目前，旧的字段和变换体作为新字段的引用留存下来，并且 :ref:`从这个版本开始取消 <deprecated-jsonfield>`。

source: ``DEFAULT_HASHING_ALGORITHM`` settings
zh_hans: ``DEFAULT_HASHING_ALGORITHM`` 配置

source: The new ``DEFAULT_HASHING_ALGORITHM`` transitional setting allows specifying the default hashing algorithm to use for encoding cookies, password reset tokens in the admin site, user sessions, and signatures created by :class:`django.core.signing.Signer` and :meth:`django.core.signing.dumps`.
zh_hans: 新的 ``DEFAULT_HASHING_ALGORITHM`` 过渡设置允许指定用于编码 cookie、管理员站点中的密码重置令牌、用户会话以及由 :class:`django.core.signing.Signer` 和 :meth:`django.core.signing.dumps` 创建的签名的默认哈希算法。

source: Support for SHA-256 was added in Django 3.1. If you are upgrading multiple instances of the same project to Django 3.1, you should set ``DEFAULT_HASHING_ALGORITHM`` to ``'sha1'`` during the transition, in order to allow compatibility with the older versions of Django. Note that this requires Django 3.1.1+. Once the transition to 3.1 is complete you can stop overriding ``DEFAULT_HASHING_ALGORITHM``.
zh_hans: 在 Django 3.1 中添加了对 SHA-256 的支持。如果您正在将同一项目的多个实例升级到 Django 3.1，您应该在过渡期间将 ``DEFAULT_HASHING_ALGORITHM`` 设置为 ``'sha1'``，以便与旧版本的 Django 兼容。请注意，这需要 Django 3.1.1+。一旦完成到 3.1 的过渡，您可以停止覆盖 ``DEFAULT_HASHING_ALGORITHM``。

source: This setting is deprecated as of this release, because support for tokens, cookies, sessions, and signatures that use SHA-1 algorithm will be removed in Django 4.0.
zh_hans: 因为在 Django 4.0 中，对使用 SHA-1 算法的令牌、cookie、会话和签名的支持将被取消，所以这个配置从这个版本开始就被取消了。

source: The new ``django.contrib.admin.EmptyFieldListFilter`` for :attr:`.ModelAdmin.list_filter` allows filtering on empty values (empty strings and nulls) in the admin changelist view.
zh_hans: 新的 ``django.contrib.admin.EmptyFieldListFilter`` 为 :attr:`.ModelAdmin.list_filter` 允许在管理的变更列表视图中过滤空值（空字符串和空值）。

source: Filters in the right sidebar of the admin changelist view now contain a link to clear all filters.
zh_hans: 管理员更改列表视图右侧的过滤器现在包含一个清除所有过滤器的链接。

source: The admin now has a sidebar on larger screens for easier navigation. It is enabled by default but can be disabled by using a custom ``AdminSite`` and setting :attr:`.AdminSite.enable_nav_sidebar` to ``False``.
zh_hans: 管理员现在在大屏幕上有一个侧栏，以便于导航。它是默认启用的，但可以通过使用一个自定义的 ``AdminSite`` 和设置 :attr:`.AdminSite.enable_nav_sidebar` 为 ``False`` 来禁用。

source: Rendering the sidebar requires access to the current request in order to set CSS and ARIA role affordances. This requires using ``'django.template.context_processors.request'`` in the ``'context_processors'`` option of :setting:`OPTIONS <TEMPLATES-OPTIONS>`.
zh_hans: 渲染侧边栏需要访问当前请求，以便设置 CSS 和 ARIA 角色的负担。这就需要使用 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 的 ``'context_processors'`` 选项中的 ``'django.template.context_processors.request'``。

source: Initially empty ``extra`` inlines can now be removed, in the same way as dynamically created ones.
zh_hans: 最初的空 ``extra`` 内联现在可以被删除，与动态创建的内联相同。

source: ``XRegExp`` is upgraded from version 2.0.0 to 3.2.0.
zh_hans: ``XRegExp`` 从 2.0.0 版本升级到 3.2.0。

source: jQuery is upgraded from version 3.4.1 to 3.5.1.
zh_hans: jQuery 从 3.4.1 版本升级到 3.5.1。

source: Select2 library is upgraded from version 4.0.7 to 4.0.13.
zh_hans: Select2 库从 4.0.7 版本升级到 4.0.13。

source: The default iteration count for the PBKDF2 password hasher is increased from 180,000 to 216,000.
zh_hans: PBKDF2 密码哈希的默认迭代次数从 180,000 增加到 216,000。

source: The new :setting:`PASSWORD_RESET_TIMEOUT` setting allows defining the number of seconds a password reset link is valid for. This is encouraged instead of the deprecated ``PASSWORD_RESET_TIMEOUT_DAYS`` setting, which will be removed in Django 4.0.
zh_hans: 新的 :setting:`PASSWORD_RESET_TIMEOUT` 配置允许定义密码重置链接的有效秒数。我们鼓励这样做，而不是使用被废弃的 ``PASSWORD_RESET_TIMEOUT_DAYS`` 配置，后者将在 Django 4.0 中被删除。

source: The password reset mechanism now uses the SHA-256 hashing algorithm. Support for tokens that use the old hashing algorithm remains until Django 4.0.
zh_hans: 密码重置机制现在使用 SHA-256 散列算法。在 Django 4.0 之前，对使用旧的散列算法的令牌的支持仍然存在。

source: :meth:`.AbstractBaseUser.get_session_auth_hash` now uses the SHA-256 hashing algorithm. Support for user sessions that use the old hashing algorithm remains until Django 4.0.
zh_hans: :meth:`.AbstractBaseUser.get_session_auth_hash` 现在使用 SHA-256 散列算法。在 Django 4.0 之前，对使用旧的散列算法的用户会话的支持仍然存在。

source: The new :option:`remove_stale_contenttypes --include-stale-apps` option allows removing stale content types from previously installed apps that have been removed from :setting:`INSTALLED_APPS`.
zh_hans: 新的 :option:`remove_stale_contenttypes --include-stale-apps` 选项允许从以前安装的应用程序中删除陈旧的内容类型，这些应用程序已经从 :setting:`INSTALLED_APPS` 中删除。

source: :lookup:`relate` lookup is now supported on MariaDB.
zh_hans: :lookup:`relate` 查找现已在 MariaDB 上支持。

source: Added the :attr:`.LinearRing.is_counterclockwise` property.
zh_hans: 添加了 :attr:`.LinearRing.is_counterclockwise` 属性。

source: :class:`~django.contrib.gis.db.models.functions.AsGeoJSON` is now supported on Oracle.
zh_hans: :class:`~django.contrib.gis.db.models.function.AsGeoJSON` 现已在 Oracle 上支持。

source: Added the :class:`~django.contrib.gis.db.models.functions.AsWKB` and :class:`~django.contrib.gis.db.models.functions.AsWKT` functions.
zh_hans: 添加了 :class:`~django.contrib.gis.db.models.function.AsWKB` 和 :class:`~django.contrib.gis.db.models.function.AsWKT` 函数。

source: Added support for PostGIS 3 and GDAL 3.
zh_hans: 增加了对 PostGIS 3 和 GDAL 3 的支持。

source: :tfilter:`intword` template filter now supports negative integers.
zh_hans: :tfilter:`intword` 模板过滤器现在支持负整数。

source: The new :class:`~django.contrib.postgres.indexes.BloomIndex` class allows creating ``bloom`` indexes in the database. The new :class:`~django.contrib.postgres.operations.BloomExtension` migration operation installs the ``bloom`` extension to add support for this index.
zh_hans: 新的 :class:`~django.contrib.postgres.indexes.BloomIndex` 类允许在数据库中创建 ``bloom`` 索引。新的 :class:`~django.contrib.postgres.operations.BloomExtension` 迁移操作安装 ``bloom`` 扩展来增加对该索引的支持。

source: :meth:`~django.db.models.Model.get_FOO_display` now supports :class:`~django.contrib.postgres.fields.ArrayField` and :class:`~django.contrib.postgres.fields.RangeField`.
zh_hans: :meth:`~django.db.models.Model.get_FOO_display` 现在支持 :class:`~django.contrib.postgres.field.ArrayField` 和 :class:`~django.contrib.postgres.field.RangeField`。

source: The new :lookup:`rangefield.lower_inc`, :lookup:`rangefield.lower_inf`, :lookup:`rangefield.upper_inc`, and :lookup:`rangefield.upper_inf` lookups allow querying :class:`~django.contrib.postgres.fields.RangeField` by a bound type.
zh_hans: 新的 :lookup:`rangefield.lower_inc`, :lookup:`rangefield.lower_inf`、:lookup:`rangefield.upper_inc` 和 :lookup:`rangefield.upper_inf` 查找允许通过绑定类型查询 :class:`~django.contrib.postgres.field.RangeField`。

source: :lookup:`rangefield.contained_by` now supports :class:`~django.db.models.SmallAutoField`, :class:`~django.db.models.AutoField`, :class:`~django.db.models.BigAutoField`, :class:`~django.db.models.SmallIntegerField`, and :class:`~django.db.models.DecimalField`.
zh_hans: :lookup:`rangefield.contained_by` 现在支持 :class:`~django.db.models.SmallAutoField`、:class:`~django.db.models.AutoField`、:class:`~django.db.models.BigAutoField`、:class:`~django.db.models.SmallIntegerField` 和 :class:`~django.db.models.DecimalField`。

source: :class:`~django.contrib.postgres.search.SearchQuery` now supports ``'websearch'`` search type on PostgreSQL 11+.
zh_hans: :class:`~django.contrib.postgres.search.SearchQuery` 现在支持 PostgreSQL 11+ 上的 ``'websearch'`` 搜索类型。

source: :class:`SearchQuery.value <django.contrib.postgres.search.SearchQuery>` now supports query expressions.
zh_hans: :class:`SearchQuery.value <django.contrib.postgres.search.SearchQuery>` 现在支持查询表达式。

source: The new :class:`~django.contrib.postgres.search.SearchHeadline` class allows highlighting search results.
zh_hans: 新的 :class:`~django.contrib.postgres.search.SearchHeadline` 类可以高亮显示搜索结果。

source: :lookup:`search` lookup now supports query expressions.
zh_hans: :lookup:`search` 查找现在支持查询表达式。

source: The new ``cover_density`` parameter of :class:`~django.contrib.postgres.search.SearchRank` allows ranking by cover density.
zh_hans: 新的 :class:`~django.contrib.postgres.search.SearchRank` 的 ``cover_density`` 参数允许按覆盖密度进行排名。

source: The new ``normalization`` parameter of :class:`~django.contrib.postgres.search.SearchRank` allows rank normalization.
zh_hans: :class:`~django.contrib.postgres.search.SearchRank` 的新 ``normalization`` 参数允许进行排名规范化。

source: The new :attr:`.ExclusionConstraint.deferrable` attribute allows creating deferrable exclusion constraints.
zh_hans: 新的 :attr:`.ExclusionConstraint.deferrable` 属性允许创建可推迟的排除约束。

source: The :setting:`SESSION_COOKIE_SAMESITE` setting now allows ``'None'`` (string) value to explicitly state that the cookie is sent with all same-site and cross-site requests.
zh_hans: :setting:`SESSION_COOKIE_SAMESITE` 配置现在允许 ``'None'`` （字符串）值明确表示所有同站和跨站请求都会发送 cookie。

source: The :setting:`STATICFILES_DIRS` setting now supports :class:`pathlib.Path`.
zh_hans: :setting:`STATICFILES_DIRS` 配置现在支持 :class:`pathlib.Path`。

source: The :func:`~django.views.decorators.cache.cache_control` decorator and :func:`~django.utils.cache.patch_cache_control` method now support multiple field names in the ``no-cache`` directive for the ``Cache-Control`` header, according to :rfc:`7234#section-5.2.2.2`.
zh_hans: 根据 :rfc:`7234#section-5.2.2.2`，:func:`~django.views.decorators.cache.cache_control` 装饰器和 :func:`~django.utils.cache.patch_cache_control` 方法现在支持 ``Cache-Control`` 头的 ``no-cache`` 指令中的多个字段名。

source: :meth:`~django.core.cache.cache.delete` now returns ``True`` if the key was successfully deleted, ``False`` otherwise.
zh_hans: :meth:`~django.core.cache.cache.delete` 现在在成功删除键时返回 ``True``，否则返回 ``False``。

source: The :setting:`CSRF_COOKIE_SAMESITE` setting now allows ``'None'`` (string) value to explicitly state that the cookie is sent with all same-site and cross-site requests.
zh_hans: :setting:`CSRF_COOKIE_SAMESITE` 配置现在允许 ``'None'`` （字符串）值来明确说明所有同站和跨站请求都会发送 cookie。

source: The :setting:`EMAIL_FILE_PATH` setting, used by the :ref:`file email backend <topic-email-file-backend>`, now supports :class:`pathlib.Path`.
zh_hans: :ref:`附件邮件后端 <topic-email-file-backend>` 使用的 :setting:`EMAIL_FILE_PATH` 配置，现在支持 :class:`pathlib.Path`。

source: Error Reporting
zh_hans: 错误报告

source: :class:`django.views.debug.SafeExceptionReporterFilter` now filters sensitive values from ``request.META`` in exception reports.
zh_hans: :class:`django.view.debug.SafeExceptionReporterFilter` 现在可以过滤异常报告中 ``request.META`` 中的敏感值。

source: The new :attr:`.SafeExceptionReporterFilter.cleansed_substitute` and :attr:`.SafeExceptionReporterFilter.hidden_settings` attributes allow customization of sensitive settings and ``request.META`` filtering in exception reports.
zh_hans: 新的 :attr:`.SafeExceptionReporterFilter.cleansed_substitute` 和 :attr:`.SafeExceptionReporterFilter.hidden_settings` 属性允许在异常报告中自定义敏感配置和 ``request.META`` 过滤。

source: The technical 404 debug view now respects :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` when applying settings filtering.
zh_hans: 在应用配置过滤时，技术 404 调试视图现在尊重 :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER`。
