Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: A number of new text database functions are added: :class:`~django.db.models.functions.Chr`, :class:`~django.db.models.functions.Left`, :class:`~django.db.models.functions.LPad`, :class:`~django.db.models.functions.LTrim`, :class:`~django.db.models.functions.Ord`, :class:`~django.db.models.functions.Repeat`, :class:`~django.db.models.functions.Replace`, :class:`~django.db.models.functions.Right`, :class:`~django.db.models.functions.RPad`, :class:`~django.db.models.functions.RTrim`, and :class:`~django.db.models.functions.Trim`.
zh_hans: 新增了一些新的文本数据库函数：:class:`~django.db.models.functions.Chr`、:class:`~django.db.models.functions.Left`、:class:`~django.db.models.functions.LPad`、:class:`~django.db.models.functions.LTrim`、:class:`~django.db.models.functions.Ord`、:class:`~django.db.models.functions.Repeat`、:class:`~django.db.models.functions.Replace`、:class:`~django.db.models.functions.Right`、:class:`~django.db.models.functions.RPad`、:class:`~django.db.models.functions.RTrim` 和 :class:`~django.db.models.functions.Trim`。

source: The new :class:`~django.db.models.functions.TruncWeek` function truncates :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField` to the Monday of a week.
zh_hans: 新的 :class:`~django.db.models.functions.TruncWeek` 函数将 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 截断到一周的星期一。

source: Query expressions can now be negated using a minus sign.
zh_hans: 现在可以使用减号对查询表达式进行否定。

source: :meth:`.QuerySet.order_by` and :meth:`distinct(*fields) <.QuerySet.distinct>` now support using field transforms.
zh_hans: :meth:`.QuerySet.order_by` 和 :meth:`distinct(*fields) <.QuerySet.distinct>` 现在支持使用字段变换。

source: :class:`~django.db.models.BooleanField` can now be ``null=True``. This is encouraged instead of ``NullBooleanField``, which will likely be deprecated in the future.
zh_hans: :class:`~django.db.models.BooleanField` 现在可以设置为 ``null=True``。这是鼓励的，而不是使用 ``NullBooleanField``，后者可能会在将来被弃用。

source: The new :meth:`.QuerySet.explain` method displays the database's execution plan of a queryset's query.
zh_hans: 新的 :meth:`.QuerySet.explain` 方法显示查询集查询的数据库执行计划。

source: :meth:`.QuerySet.raw` now supports :meth:`~.QuerySet.prefetch_related`.
zh_hans: :meth:`.QuerySet.raw` 现在支持 :meth:`~.QuerySet.prefetch_related`。

source: Added :meth:`.HttpRequest.get_full_path_info`.
zh_hans: 添加了 :meth:`.HttpRequest.get_full_path_info`。

source: Added the ``samesite`` argument to :meth:`.HttpResponse.set_cookie` to allow setting the ``SameSite`` cookie flag.
zh_hans: 添加了 ``samesite`` 参数到 :meth:`.HttpResponse.set_cookie` 以允许设置 ``SameSite`` cookie 标志。

source: The new ``as_attachment`` argument for :class:`~django.http.FileResponse` sets the ``Content-Disposition`` header to make the browser ask if the user wants to download the file. ``FileResponse`` also tries to set the ``Content-Type`` and ``Content-Length`` headers where appropriate.
zh_hans: :class:`~django.http.FileResponse` 的新 ``as_attachment`` 参数设置了 ``Content-Disposition`` 头，使浏览器询问用户是否要下载文件。``FileResponse`` 还会在适当的情况下尝试设置 ``Content-Type`` 和 ``Content-Length`` 头。

source: The new :tfilter:`json_script` filter safely outputs a Python object as JSON, wrapped in a ``<script>`` tag, ready for use with JavaScript.
zh_hans: 新的 :tfilter:`json_script` 过滤器安全地将 Python 对象输出为 JSON，包装在 ``<script>`` 标签中，可供 JavaScript 使用。

source: Added test :class:`~django.test.Client` support for 307 and 308 redirects.
zh_hans: 添加了对 307 和 308 重定向的测试支持，测试 :class:`~django.test.Client`。

source: The test :class:`~django.test.Client` now serializes a request data dictionary as JSON if ``content_type='application/json'``. You can customize the JSON encoder with test client's ``json_encoder`` parameter.
zh_hans: 测试 :class:`~django.test.Client` 现在如果 ``content_type='application/json'``，会将请求数据字典序列化为 JSON。你可以通过测试客户端的 ``json_encoder`` 参数自定义 JSON 编码器。

source: The new :meth:`.SimpleTestCase.assertWarnsMessage` method is a simpler version of :meth:`~unittest.TestCase.assertWarnsRegex`.
zh_hans: 新的 :meth:`.SimpleTestCase.assertWarnsMessage` 方法是 :meth:`~unittest.TestCase.assertWarnsRegex` 的简化版本。

source: Backwards incompatible changes in 2.1
zh_hans: 2.1 版本中的不向后兼容变更

source: To adhere to :pep:`249`, exceptions where a database doesn't support a feature are changed from :exc:`NotImplementedError` to :exc:`django.db.NotSupportedError`.
zh_hans: 为了遵循 :pep:`249`，在数据库不支持某项功能时，异常已从 :exc:`NotImplementedError` 更改为 :exc:`django.db.NotSupportedError`。

source: Renamed the ``allow_sliced_subqueries`` database feature flag to ``allow_sliced_subqueries_with_in``.
zh_hans: 将数据库特性标志 ``allow_sliced_subqueries`` 重命名为 ``allow_sliced_subqueries_with_in``。

source: ``DatabaseOperations.distinct_sql()`` now requires an additional ``params`` argument and returns a tuple of SQL and parameters instead of an SQL string.
zh_hans: ``DatabaseOperations.distinct_sql()`` 现在需要额外的 ``params`` 参数，并返回一个包含 SQL 和参数的元组，而不是一个 SQL 字符串。

source: ``DatabaseFeatures.introspected_boolean_field_type`` is changed from a method to a property.
zh_hans: ``DatabaseFeatures.introspected_boolean_field_type`` 从方法更改为属性。

source: Support for SpatiaLite 4.0 is removed.
zh_hans: 移除对 SpatiaLite 4.0 的支持。

source: Dropped support for MySQL 5.5
zh_hans: 不再支持 MySQL 5.5 版本

source: The end of upstream support for MySQL 5.5 is December 2018. Django 2.1 supports MySQL 5.6 and higher.
zh_hans: MySQL 5.5 的上游支持结束于 2018 年 12 月。 Django 2.1 支持 MySQL 5.6 及更高版本。

source: Dropped support for PostgreSQL 9.3
zh_hans: 不再支持 PostgreSQL 9.3 版本

source: The end of upstream support for PostgreSQL 9.3 is September 2018. Django 2.1 supports PostgreSQL 9.4 and higher.
zh_hans: PostgreSQL 9.3 的上游支持结束于 2018 年 9 月。 Django 2.1 支持 PostgreSQL 9.4 及更高版本。

source: Removed ``BCryptPasswordHasher`` from the default ``PASSWORD_HASHERS`` setting
zh_hans: 从默认的 ``PASSWORD_HASHERS`` 设置中移除了 ``BCryptPasswordHasher``。

source: If you used bcrypt with Django 1.4 or 1.5 (before ``BCryptSHA256PasswordHasher`` was added in Django 1.6), you might have some passwords that use the ``BCryptPasswordHasher`` hasher.
zh_hans: 如果你在 Django 1.4 或 1.5 中使用了 bcrypt（在 Django 1.6 中添加了 ``BCryptSHA256PasswordHasher``），你可能有一些使用了 ``BCryptPasswordHasher`` 哈希算法的密码。

source: You can check if that's the case like this::
zh_hans: 您可以像这样检查是否符合条件：

source: If you want to continue to allow those passwords to be used, you'll have to define the :setting:`PASSWORD_HASHERS` setting (if you don't already) and include ``'django.contrib.auth.hashers.BCryptPasswordHasher'``.
zh_hans: 如果你想继续允许使用这些密码，你将需要定义 :setting:`PASSWORD_HASHERS` 设置（如果尚未定义），并包含 ``'django.contrib.auth.hashers.BCryptPasswordHasher'``。

source: Moved ``wrap_label`` widget template context variable
zh_hans: 移动了 ``wrap_label`` 小部件模板上下文变量

source: To fix the lack of ``<label>`` when using ``RadioSelect`` and ``CheckboxSelectMultiple`` with ``MultiWidget``, the ``wrap_label`` context variable now appears as an attribute of each option. For example, in a custom ``input_option.html`` template, change ``{% if wrap_label %}`` to ``{% if widget.wrap_label %}``.
zh_hans: 为了解决在使用 ``MultiWidget`` 时使用 ``RadioSelect`` 和 ``CheckboxSelectMultiple`` 时缺少 ``<label>`` 的问题，现在 ``wrap_label`` 上下文变量已经作为每个选项的属性出现。例如，在自定义的 ``input_option.html`` 模板中，将 ``{% if wrap_label %}`` 更改为 ``{% if widget.wrap_label %}``。

source: The cookies used for ``django.contrib.sessions``, ``django.contrib.messages``, and Django's CSRF protection now set the ``SameSite`` flag to ``Lax`` by default. Browsers that respect this flag won't send these cookies on cross-origin requests. If you rely on the old behavior, set the :setting:`SESSION_COOKIE_SAMESITE` and/or :setting:`CSRF_COOKIE_SAMESITE` setting to ``None``.
zh_hans: 用于 ``django.contrib.sessions``、``django.contrib.messages`` 和 Django 的 CSRF 保护的 cookie 现在默认将 ``SameSite`` 标志设置为 ``Lax``。遵循此标志的浏览器不会在跨源请求上发送这些 cookie。如果依赖旧行为，请将 :setting:`SESSION_COOKIE_SAMESITE` 和/或 :setting:`CSRF_COOKIE_SAMESITE` 设置为 ``None``。

source: Considerations for the new model "view" permission
zh_hans: 新模型“查看”权限的注意事项

source: Custom admin forms need to take the view-only case into account
zh_hans: 自定义管理表单需要考虑只读视图的情况。

source: With the new "view" permission, existing custom admin forms may raise errors when a user doesn't have the change permission because the form might access nonexistent fields. Fix this by overriding :meth:`.ModelAdmin.get_form` and checking if the user has the "change" permissions and returning the default form if not::
zh_hans: 新的 "view" 权限引入后，已存在的自定义管理员表单可能会在用户没有 "change" 权限时引发错误，因为表单可能会访问不存在的字段。通过覆盖 :meth:`.ModelAdmin.get_form` 方法，可以解决此问题，检查用户是否具有 "change" 权限，如果没有，则返回默认表单：

source: New default view permission could allow unwanted access to admin views
zh_hans: 新的默认视图权限可能会导致对管理员视图的非预期访问。

source: If you have a custom permission with a codename of the form ``view_<modelname>``, the new view permission handling in the admin will allow view access to the changelist and detail pages for those models. If this is unwanted, you must change your custom permission codename.
zh_hans: 如果你有一个自定义权限，其代码名称的形式为 ``view_<modelname>``，新的管理员中的视图权限处理将允许访问这些模型的 changelist 和详情页。如果这不是你想要的行为，你必须更改你的自定义权限代码名称。

source: The minimum supported version of ``mysqlclient`` is increased from 1.3.3 to 1.3.7.
zh_hans: ``mysqlclient`` 的最低支持版本已从 1.3.3 增加到 1.3.7。

source: Support for SQLite < 3.7.15 is removed.
zh_hans: 不再支持 SQLite 版本低于 3.7.15 。

source: The date format of ``Set-Cookie``'s ``Expires`` directive is changed to follow :rfc:`7231#section-7.1.1.1` instead of Netscape's cookie standard. Hyphens present in dates like ``Tue, 25-Dec-2018 22:26:13 GMT`` are removed. This change should be merely cosmetic except perhaps for antiquated browsers that don't parse the new format.
zh_hans: ``Set-Cookie`` 的 ``Expires`` 指令的日期格式已更改，以遵循 :rfc:`7231#section-7.1.1.1`，而不是 Netscape 的 cookie 标准。在日期中出现的连字符（如 ``Tue, 25-Dec-2018 22:26:13 GMT``）已被移除。这个改变应该只是视觉上的变化，除非是一些不支持新格式的过时浏览器。

source: ``allowed_hosts`` is now a required argument of private API ``django.utils.http.is_safe_url()``.
zh_hans: ``allowed_hosts`` 现在是私有 API ``django.utils.http.is_safe_url()`` 的必需参数。

source: The ``multiple`` attribute rendered by the :class:`~django.forms.SelectMultiple` widget now uses HTML5 boolean syntax rather than XHTML's ``multiple="multiple"``.
zh_hans: :class:`~django.forms.SelectMultiple` 小部件渲染的 ``multiple`` 属性现在使用 HTML5 的布尔语法，而不是 XHTML 的 ``multiple="multiple"``。

source: HTML rendered by form widgets no longer includes a closing slash on void elements, e.g. ``<br>``. This is incompatible within XHTML, although some widgets already used aspects of HTML5 such as boolean attributes.
zh_hans: 由表单小部件渲染的 HTML 不再在空元素上包含闭合斜杠，例如 ``<br>``。这在 XHTML 中不兼容，尽管一些小部件已经使用了 HTML5 的一些特性，如布尔属性。

source: The value of :class:`~django.forms.SelectDateWidget`'s empty options is changed from 0 to an empty string, which mainly may require some adjustments in tests that compare HTML.
zh_hans: :class:`~django.forms.SelectDateWidget` 的空选项的值已从 0 更改为空字符串，这主要可能需要在比较 HTML 的测试中进行一些调整。

source: :meth:`.User.has_usable_password` and the :func:`~django.contrib.auth.hashers.is_password_usable` function no longer return ``False`` if the password is ``None`` or an empty string, or if the password uses a hasher that's not in the :setting:`PASSWORD_HASHERS` setting. This undocumented behavior was a regression in Django 1.6 and prevented users with such passwords from requesting a password reset. Audit your code to confirm that your usage of these APIs don't rely on the old behavior.
zh_hans: :meth:`.User.has_usable_password` 和 :func:`~django.contrib.auth.hashers.is_password_usable` 函数不再在密码为 ``None``、空字符串或使用不在 :setting:`PASSWORD_HASHERS` 设置中的哈希器时返回 ``False``。这种未记录的行为是 Django 1.6 中的一个回归，阻止了使用这些密码的用户请求密码重置。审查你的代码以确认你的这些 API 的使用不依赖于旧的行为。

source: Since migrations are now loaded from ``.pyc`` files, you might need to delete them if you're working in a mixed Python 2 and Python 3 environment.
zh_hans: 由于迁移现在从 ``.pyc`` 文件加载，如果你在混合 Python 2 和 Python 3 环境中工作，你可能需要删除它们。

source: Using ``None`` as a ``django.contrib.postgres.fields.JSONField`` lookup value now matches objects that have the specified key and a null value rather than objects that don't have the key.
zh_hans: 在 ``django.contrib.postgres.fields.JSONField`` 上使用 ``None`` 作为查找值现在匹配具有指定键和空值的对象，而不是不具有该键的对象。

source: The admin CSS class ``field-box`` is renamed to ``fieldBox`` to prevent conflicts with the class given to model fields named "box".
zh_hans: 管理员的 CSS 类 ``field-box`` 已重命名为 ``fieldBox``，以防止与模型字段命名为 "box" 的类发生冲突。

source: Since the admin's ``actions.html``, ``change_list_results.html``, ``date_hierarchy.html``, ``pagination.html``, ``prepopulated_fields_js.html``, ``search_form.html``, and ``submit_line.html`` templates can now be overridden per app or per model, you may need to rename existing templates with those names that were written for a different purpose.
zh_hans: 由于现在可以按应用程序或模型覆盖管理员的 ``actions.html``、``change_list_results.html``、``date_hierarchy.html``、``pagination.html``、``prepopulated_fields_js.html``、``search_form.html`` 和 ``submit_line.html`` 模板，因此您可能需要重命名已为不同目的编写的具有这些名称的现有模板。

source: ``QuerySet.raw()`` now caches its results like regular querysets. Use ``iterator()`` if you don't want caching.
zh_hans: ``QuerySet.raw()`` 现在像常规的查询集一样缓存其结果。如果不想缓存，请使用 ``iterator()``。

source: The database router :meth:`allow_relation` method is called in more cases. Improperly written routers may need to be updated accordingly.
zh_hans: 数据库路由器的 :meth:`allow_relation` 方法在更多情况下被调用。不正确编写的路由器可能需要相应地进行更新。

source: Translations are no longer deactivated before running management commands. If your custom command requires translations to be deactivated (for example, to insert untranslated content into the database), use the new :ref:`@no_translations decorator <management-commands-and-locales>`.
zh_hans: 在运行管理命令之前不再停用翻译。如果你的自定义命令需要停用翻译（例如，将未翻译的内容插入数据库），可以使用新的 :ref:`@no_translations 装饰器 <management-commands-and-locales>`。

source: Management commands no longer allow the abbreviated forms of the ``--settings`` and ``--pythonpath`` arguments.
zh_hans: 管理命令不再允许 ``--settings`` 和 ``--pythonpath`` 参数的缩写形式。

source: The private ``django.db.models.sql.constants.QUERY_TERMS`` constant is removed. The :meth:`~.RegisterLookupMixin.get_lookup` and :meth:`~.RegisterLookupMixin.get_lookups` methods of the :ref:`Lookup Registration API <lookup-registration-api>` may be suitable alternatives. Compared to the ``QUERY_TERMS`` constant, they allow your code to also account for any custom lookups that have been registered.
zh_hans: 私有常量 ``django.db.models.sql.constants.QUERY_TERMS`` 已被移除。 :ref:`查找注册 API <lookup-registration-api>` 的 :meth:`~.RegisterLookupMixin.get_lookup` 和 :meth:`~.RegisterLookupMixin.get_lookups` 方法可能是合适的替代方案。与 ``QUERY_TERMS`` 常量相比，它们允许您的代码还考虑了已注册的任何自定义查找。

source: Compatibility with ``py-bcrypt`` is removed as it's unmaintained. Use :pypi:`bcrypt` instead.
zh_hans: 与 ``py-bcrypt`` 的兼容性已被移除，因为它已不再维护。请改用 :pypi:`bcrypt`。

source: Features deprecated in 2.1
zh_hans: 在 2.1 中被废弃的功能

source: The ``ForceRHR`` GIS function is deprecated in favor of the new :class:`~django.contrib.gis.db.models.functions.ForcePolygonCW` function.
zh_hans: ``ForceRHR`` GIS 函数已被弃用，建议使用新的 :class:`~django.contrib.gis.db.models.functions.ForcePolygonCW` 函数。

source: ``django.utils.http.cookie_date()`` is deprecated in favor of :func:`~django.utils.http.http_date`, which follows the format of the latest RFC.
zh_hans: ``django.utils.http.cookie_date()`` 已被弃用，建议使用 :func:`~django.utils.http.http_date`，它遵循最新 RFC 的格式。

source: ``{% load staticfiles %}`` and ``{% load admin_static %}`` are deprecated in favor of ``{% load static %}``, which works the same.
zh_hans: ``{% load staticfiles %}`` 和 ``{% load admin_static %}`` 已被弃用，建议使用 ``{% load static %}``，它具有相同的功能。

source: ``django.contrib.staticfiles.templatetags.static()`` is deprecated in favor of ``django.templatetags.static.static()``.
zh_hans: ``django.contrib.staticfiles.templatetags.static()`` 已被弃用，建议使用 ``django.templatetags.static.static()``。

source: Support for :meth:`.InlineModelAdmin.has_add_permission` methods that don't accept ``obj`` as the second positional argument will be removed in Django 3.0.
zh_hans: 不接受 ``obj`` 作为第二个位置参数的 :meth:`.InlineModelAdmin.has_add_permission` 方法的支持将在 Django 3.0 中被移除。

source: Features removed in 2.1
zh_hans: 在 2.1 版本中删除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 2.1. See :ref:`deprecated-features-1.11` for details, including how to remove usage of these features.
zh_hans: 这些功能已经完成了其弃用周期，并在 Django 2.1 中被移除。有关详细信息，包括如何删除这些功能的用法，请参阅 :ref:`deprecated-features-1.11`。

source: ``contrib.auth.views.login()``, ``logout()``, ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, and ``password_reset_complete()`` are removed.
zh_hans: ``contrib.auth.views.login()``, ``logout()``, ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, 和 ``password_reset_complete()`` 已被移除。

source: The ``extra_context`` parameter of ``contrib.auth.views.logout_then_login()`` is removed.
zh_hans: ``contrib.auth.views.logout_then_login()`` 的 ``extra_context`` 参数已被移除。

source: ``django.test.runner.setup_databases()`` is removed.
zh_hans: ``django.test.runner.setup_databases()`` 已被移除。

source: ``django.utils.translation.string_concat()`` is removed.
zh_hans: ``django.utils.translation.string_concat()`` 已被移除。

source: ``django.core.cache.backends.memcached.PyLibMCCache`` no longer supports passing ``pylibmc`` behavior settings as top-level attributes of ``OPTIONS``.
zh_hans: ``django.core.cache.backends.memcached.PyLibMCCache`` 不再支持将 ``pylibmc`` 行为设置作为 ``OPTIONS`` 的顶级属性传递。

source: The ``host`` parameter of ``django.utils.http.is_safe_url()`` is removed.
zh_hans: ``django.utils.http.is_safe_url()`` 的 ``host`` 参数已被移除。

source: Silencing of exceptions raised while rendering the ``{% include %}`` template tag is removed.
zh_hans: 不再屏蔽在渲染 ``{% include %}`` 模板标签时引发的异常。

source: ``DatabaseIntrospection.get_indexes()`` is removed.
zh_hans: ``DatabaseIntrospection.get_indexes()`` 已被移除。

source: The ``authenticate()`` method of authentication backends requires ``request`` as the first positional argument.
zh_hans: 认证后端的 ``authenticate()`` 方法要求将 ``request`` 作为第一个位置参数。

source: The ``django.db.models.permalink()`` decorator is removed.
zh_hans: ``django.db.models.permalink()`` 装饰器已被移除。

source: The ``USE_ETAGS`` setting is removed. ``CommonMiddleware`` and ``django.utils.cache.patch_response_headers()`` no longer set ETags.
zh_hans: ``USE_ETAGS`` 设置已被移除。``CommonMiddleware`` 和 ``django.utils.cache.patch_response_headers()`` 不再设置 ETags。

source: The ``Model._meta.has_auto_field`` attribute is removed.
zh_hans: ``Model._meta.has_auto_field`` 属性已被移除。

source: ``url()``'s support for inline flags in regular expression groups (``(?i)``, ``(?L)``, ``(?m)``, ``(?s)``, and ``(?u)``) is removed.
zh_hans: ``url()`` 对正则表达式组中的内联标志（``(?i)``、``(?L)``、``(?m)``、``(?s)`` 和 ``(?u)``）的支持已被移除。

source: Support for ``Widget.render()`` methods without the ``renderer`` argument is removed.
zh_hans: 不再支持没有 ``renderer`` 参数的 ``Widget.render()`` 方法。

source: Django 2.1.1 release notes
zh_hans: Django 2.1.1 版本发行说明

source: *August 31, 2018*
zh_hans: *2018 年 8 月 31 日*

source: Django 2.1.1 fixes several bugs in 2.1.
zh_hans: Django 2.1.1 修复了 2.1 版本中的一些错误。

source: Fixed a regression where ``QueryDict.urlencode()`` crashed if the dictionary contains a non-string value (:ticket:`29627`).
zh_hans: 修复了一个回归问题，即如果字典包含非字符串值，``QueryDict.urlencode()`` 会崩溃 (:ticket:`29627`)。

source: Fixed a regression in Django 2.0 where using ``manage.py test --keepdb`` fails on PostgreSQL if the database exists and the user doesn't have permission to create databases (:ticket:`29613`).
zh_hans: 在 Django 2.0 中修复了一个回归问题，即如果数据库存在并且用户没有创建数据库的权限，则在 PostgreSQL 上使用 ``manage.py test --keepdb`` 失败 (:ticket:`29613`)。

source: Fixed a regression in Django 2.0 where combining ``Q`` objects with ``__in`` lookups and lists crashed (:ticket:`29643`).
zh_hans: 在 Django 2.0 中修复了一个回归问题，即组合 ``Q`` 对象和 ``__in`` 查找与列表一起使用会崩溃 (:ticket:`29643`)。

source: Fixed translation failure of ``DurationField``'s "overflow" error message (:ticket:`29623`).
zh_hans: 修复了 ``DurationField`` 的 "溢出" 错误消息的翻译失败问题 (:ticket:`29623`)。

source: Fixed a regression where the admin change form crashed if the user doesn't have the 'add' permission to a model that uses ``TabularInline`` (:ticket:`29637`).
zh_hans: 修复了一个回归问题，即如果用户没有对使用 ``TabularInline`` 的模型具有 'add' 权限，管理员更改表单会崩溃 (:ticket:`29637`)。

source: Fixed a regression where a ``related_query_name`` reverse accessor wasn't set up when a ``GenericRelation`` is declared on an abstract base model (:ticket:`29653`).
zh_hans: 修复了一个回归问题，即当在抽象基础模型上声明了 ``GenericRelation`` 时，未设置 ``related_query_name`` 反向访问器 (:ticket:`29653`)。

source: Fixed the test client's JSON serialization of a request data dictionary for structured content type suffixes (:ticket:`29662`).
zh_hans: 修复了测试客户端在处理结构化内容类型后缀时对请求数据字典的 JSON 序列化问题 (:ticket:`29662`)。

source: Made the admin change view redirect to the changelist view after a POST if the user has the 'view' permission (:ticket:`29663`).
zh_hans: 在用户具有 'view' 权限的情况下，使管理员更改视图在 POST 后重定向到 changelist 视图 (:ticket:`29663`)。

source: Fixed admin change view crash for view-only users if the form has an extra form field (:ticket:`29682`).
zh_hans: 修复了管理员更改视图在只有查看权限的用户访问时，如果表单具有额外的表单字段，会导致崩溃的问题 (:ticket:`29682`)。

source: Fixed a regression in Django 2.0.5 where ``QuerySet.values()`` or ``values_list()`` after combining querysets with ``extra()`` with ``union()``, ``difference()``, or ``intersection()`` crashed due to mismatching columns (:ticket:`29694`).
zh_hans: 在 Django 2.0.5 中修复了一个回归问题，即在将带有 ``extra()`` 的查询集与 ``union()``, ``difference()`` 或 ``intersection()`` 结合使用后，调用 ``QuerySet.values()`` 或 ``values_list()`` 会因列不匹配而导致崩溃 (:ticket:`29694`)。

source: Fixed crash if ``InlineModelAdmin.has_add_permission()`` doesn't accept the ``obj`` argument (:ticket:`29723`).
zh_hans: 修复了如果 ``InlineModelAdmin.has_add_permission()`` 不接受 ``obj`` 参数会导致崩溃的问题 (:ticket:`29723`)。

source: Django 2.1.10 release notes
zh_hans: Django 2.1.10 版本发行说明

source: Django 2.1.10 fixes a security issue in 2.1.9.
zh_hans: Django 2.1.10 修复了 2.1.9 版本中的一个安全问题。

source: Django 2.1.11 release notes
zh_hans: Django 2.1.11 版本发行说明

source: Django 2.1.11 fixes security issues in 2.1.10.
zh_hans: Django 2.1.11 修复了 2.1.10 版本中的安全问题。

source: Django 2.1.12 release notes
zh_hans: Django 2.1.12 版本发行说明

source: Django 2.1.12 fixes a regression in 2.1.11.
zh_hans: Django 2.1.12 修复了 2.1.11 版本中的回归问题。

source: Django 2.1.13 release notes
zh_hans: Django 2.1.13 版本发行说明

source: Django 2.1.13 fixes a regression in 2.1.11.
zh_hans: Django 2.1.13 修复了 2.1.11 版本中的回归问题。

source: Django 2.1.14 release notes
zh_hans: Django 2.1.14 版本发行说明

source: Django 2.1.14 fixes a regression in 2.1.13.
zh_hans: Django 2.1.14 修复了 2.1.13 版本中的回归问题。

source: Django 2.1.15 release notes
zh_hans: Django 2.1.15 版本发行说明

source: *December 2, 2019*
zh_hans: *2019 年 12 月 2 日*

source: Django 2.1.15 fixes a security issue and a data loss bug in 2.1.14.
zh_hans: Django 2.1.15 修复了 2.1.14 版本中的安全问题和数据丢失错误。

source: CVE-2019-19118: Privilege escalation in the Django admin.
zh_hans: CVE-2019-19118 : Django admin 中的特权升级漏洞。

source: Since Django 2.1, a Django model admin displaying a parent model with related model inlines, where the user has view-only permissions to a parent model but edit permissions to the inline model, would display a read-only view of the parent model but editable forms for the inline.
zh_hans: 自 Django 2.1 起，当 Django 模型管理器显示带有相关模型内联的父模型时，如果用户对父模型具有只读权限但对内联模型具有编辑权限，则会在父模型上显示只读视图，但在内联模型上显示可编辑表单。
