Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The new :setting:`DEFAULT_EXCEPTION_REPORTER` allows providing a :class:`django.views.debug.ExceptionReporter` subclass to customize exception report generation. See :ref:`custom-error-reports` for details.
zh_hans: 新的 :setting:`DEFAULT_EXCEPTION_REPORTER` 允许提供 :class:`django.views.debug.ExceptionReporter` 子类来定制异常报告的生成。详情请参见 :ref:`custom-error-reports`。

source: ``FileSystemStorage.save()`` method now supports :class:`pathlib.Path`.
zh_hans: ``FileSystemStorage.save()`` 方法现在支持 :class:`pathlib.Path`。

source: :class:`~django.db.models.FileField` and :class:`~django.db.models.ImageField` now accept a callable for ``storage``. This allows you to modify the used storage at runtime, selecting different storages for different environments, for example.
zh_hans: :class:`~django.db.models.FileField` 和 :class:`~django.db.models.ImageField` 现在可以接受 ``storage`` 的调用。这允许你在运行时修改所使用的存储，例如为不同的环境选择不同的存储。

source: :class:`~django.forms.ModelChoiceIterator`, used by :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField`, now uses :class:`~django.forms.ModelChoiceIteratorValue` that can be used by widgets to access model instances. See :ref:`iterating-relationship-choices` for details.
zh_hans: :class:`~django.forms.ModelChoiceIterator`，被 :class:`~django.forms.ModelChoiceField` 和 :class:`~django.forms.ModelMultipleChoiceField` 使用，现在使用 :class:`~django.forms.ModelChoiceIteratorValue`，可以被部件用来访问模型实例。详情请看 :ref:`iterating-relationship-choices`。

source: :class:`django.forms.DateTimeField` now accepts dates in a subset of ISO 8601 datetime formats, including optional timezone, e.g. ``2019-10-10T06:47``, ``2019-10-10T06:47:23+04:00``, or ``2019-10-10T06:47:23Z``. The timezone will always be retained if provided, with timezone-aware datetimes being returned even when :setting:`USE_TZ` is ``False``.
zh_hans: :class:`django.forms.DateTimeField` 现在接受 ISO 8601 日期时间格式的子集，包括可选的时区，例如 ``2019-10-10T06:47``、``2019-10-10T06:47:23+04:00`` 或 ``2019-10-10T06:47:23Z``。如果提供了时区，将始终保留时区，即使 :setting:`USE_TZ` 为 ``False`` 时，也会返回时区感知的日期时间。

source: Additionally, ``DateTimeField`` now uses ``DATE_INPUT_FORMATS`` in addition to ``DATETIME_INPUT_FORMATS`` when converting a field input to a ``datetime`` value.
zh_hans: 此外，``DateTimeField`` 现在在将字段输入转换为 ``datetime`` 值时，除了使用 ``DATETIME_INPUT_FORMATS`` 外，还使用 ``DATE_INPUT_FORMATS``。

source: :attr:`.MultiWidget.widgets` now accepts a dictionary which allows customizing subwidget ``name`` attributes.
zh_hans: :attr:`.MultiWidget.widgets` 现在接受一个字典，允许自定义子部件 ``name`` 属性。

source: The new :attr:`.BoundField.widget_type` property can be used to dynamically adjust form rendering based upon the widget type.
zh_hans: 新的 :attr:`.BoundField.widget_type` 属性可用于根据部件类型动态调整表单渲染。

source: The :setting:`LANGUAGE_COOKIE_SAMESITE` setting now allows ``'None'`` (string) value to explicitly state that the cookie is sent with all same-site and cross-site requests.
zh_hans: :setting:`LANGUAGE_COOKIE_SAMESITE` 配置现在允许 ``'None'`` （字符串）值明确表示所有同站和跨站请求都会发送 cookie。

source: Added support and translations for the Algerian Arabic, Igbo, Kyrgyz, Tajik, and Turkmen languages.
zh_hans: 增加了对阿尔及利亚阿拉伯语、伊博语、吉尔吉斯语、塔吉克语和土库曼语的支持和翻译。

source: The new :option:`check --database` option allows specifying database aliases for running the ``database`` system checks. Previously these checks were enabled for all configured :setting:`DATABASES` by passing the ``database`` tag to the command.
zh_hans: 新的 :option:`check --database` 选项允许指定数据库别名，以便运行 ``database`` 系统检查。以前，通过向命令传递 ``database`` 标签，为所有设置的 :setting:`DATABASES` 启用这些检查。

source: The new :option:`migrate --check` option makes the command exit with a non-zero status when unapplied migrations are detected.
zh_hans: 新的 :option:`migrate --check` 选项使命令在检测到未应用的迁移时以非零状态退出。

source: The new ``returncode`` argument for :attr:`~django.core.management.CommandError` allows customizing the exit status for management commands.
zh_hans: :attr:`~django.core.management.CommandError` 的新 ``returncode`` 参数允许自定义管理命令的退出状态。

source: The new :option:`dbshell -- ARGUMENTS <dbshell -->` option allows passing extra arguments to the command-line client for the database.
zh_hans: 新的 :option:`dbshell -- ARGUMENTS <dbshell -->` 选项允许向数据库的命令行客户端传递额外的参数。

source: The :djadmin:`flush` and :djadmin:`sqlflush` commands now include SQL to reset sequences on SQLite.
zh_hans: :djadmin:`flush` 和 :djadmin:`sqlflush` 命令现在包括 SQL 来重置 SQLite 上的序列。

source: The new :class:`~django.db.models.functions.ExtractIsoWeekDay` function extracts ISO-8601 week days from :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField`, and the new :lookup:`iso_week_day` lookup allows querying by an ISO-8601 day of week.
zh_hans: 新的 :class:`~django.db.models.function.ExtractIsoWeekDay` 函数从 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 中提取 ISO-8601 周天，新的 :lookup:`iso_week_day` 查询可以按 ISO-8601 周天查询。

source: :meth:`.QuerySet.explain` now supports:
zh_hans: :meth:`.QuerySet.explain` 现在支持：

source: ``TREE`` format on MySQL 8.0.16+,
zh_hans: MySQL 8.0.16+ 上的 ``TREE`` 格式，

source: ``analyze`` option on MySQL 8.0.18+ and MariaDB.
zh_hans: MySQL 8.0.18+ 和 MariaDB 上的 ``analyze`` 选项。

source: Added :class:`~django.db.models.PositiveBigIntegerField` which acts much like a :class:`~django.db.models.PositiveIntegerField` except that it only allows values under a certain (database-dependent) limit. Values from ``0`` to ``9223372036854775807`` are safe in all databases supported by Django.
zh_hans: 添加了 :class:`~django.db.models.PositiveBigIntegerField`，它的作用很像 :class:`~django.db.models.PositiveIntegerField`，只是它只允许在一定（依赖于数据库的）限制下取值。从 ``0`` 到 ``9223372036854775807`` 的值在 Django 支持的所有数据库中都是安全的。

source: The new :class:`~django.db.models.RESTRICT` option for :attr:`~django.db.models.ForeignKey.on_delete` argument of ``ForeignKey`` and ``OneToOneField`` emulates the behavior of the SQL constraint ``ON DELETE RESTRICT``.
zh_hans: 新的 :class:`~django.db.models.RESTRICT` 选项为 ``ForeignKey`` 和 ``OneToOneField`` 的 :attr:`~django.db.models.ForeignKey.on_delete` 参数模拟了 SQL 约束 ``ON DELETE RESTRICT`` 的行为。

source: The :meth:`.RelatedManager.add`, :meth:`~.RelatedManager.create`, and :meth:`~.RelatedManager.set` methods now accept callables as values in the ``through_defaults`` argument.
zh_hans: :meth:`.RelatedManager.add`、:meth:`~.RelatedManager.create` 和 :meth:`~.RelatedManager.set` 方法现在接受可调用对象参数作为 ``through_defaults`` 参数的值。

source: The new ``is_dst`` parameter of the :meth:`.QuerySet.datetimes` determines the treatment of nonexistent and ambiguous datetimes.
zh_hans: :meth:`.QuerySet.datetimes` 的新 ``is_dst`` 参数决定了如何处理不存在和不明确的日期。

source: The new :class:`~django.db.models.F` expression ``bitxor()`` method allows :ref:`bitwise XOR operation <using-f-expressions-in-filters>`.
zh_hans: 新的 :class:`~django.db.models.F` 表达式 ``bitxor()`` 方法允许 :ref:`bitwise XOR 操作 <using-f-expressions-in-filters>`。

source: :meth:`.QuerySet.bulk_create` now sets the primary key on objects when using MariaDB 10.5+.
zh_hans: :meth:`.QuerySet.bulk_create` 在使用 MariaDB 10.5+ 时，现在可以设置对象的主键。

source: The ``DatabaseOperations.sql_flush()`` method now generates more efficient SQL on MySQL by using ``DELETE`` instead of ``TRUNCATE`` statements for tables which don't require resetting sequences.
zh_hans: ``DatabaseOperations.sql_flush()`` 方法现在可以在 MySQL 上生成更有效的 SQL，对于不需要重置序列的表，使用 ``DELETE`` 而不是 ``TRUNCATE`` 语句。

source: SQLite functions are now marked as :py:meth:`deterministic <sqlite3.Connection.create_function>` on Python 3.8+. This allows using them in check constraints and partial indexes.
zh_hans: SQLite 函数现已在 Python 3.8+ 上被标记为 :py:meth:`deterministic <sqlite3.Connection.create_function>`。这允许在检查约束和部分索引中使用它们。

source: The new :attr:`.UniqueConstraint.deferrable` attribute allows creating deferrable unique constraints.
zh_hans: 新的 :attr:`.UniqueConstraint.deferrable` 属性允许创建可推迟的唯一约束。

source: :class:`~django.core.paginator.Paginator` can now be iterated over to yield its pages.
zh_hans: :class:`~django.core.paginator.Paginator` 现在可以迭代产生其页面。

source: If :setting:`ALLOWED_HOSTS` is empty and ``DEBUG=True``, subdomains of localhost are now allowed in the ``Host`` header, e.g. ``static.localhost``.
zh_hans: 如果 :setting:`ALLOWED_HOSTS` 为空且 ``DEBUG=True``，则在 ``Host`` 头中允许使用 localhost 的子域，例如 ``static.localhost``。

source: :meth:`.HttpResponse.set_cookie` and :meth:`.HttpResponse.set_signed_cookie` now allow using ``samesite='None'`` (string) to explicitly state that the cookie is sent with all same-site and cross-site requests.
zh_hans: :meth:`.HttpResponse.set_cookie` 和 :meth:`.HttpResponse.set_signed_cookie` 现在允许使用 ``samesite='None'`` （字符串）来明确说明所有同站和跨站请求都会发送cookie。

source: The new :meth:`.HttpRequest.accepts` method returns whether the request accepts the given MIME type according to the ``Accept`` HTTP header.
zh_hans: 新的 :meth:`.HttpRequest.accepts` 方法根据 ``Accept`` HTTP 头返回请求是否接受给定的 MIME 类型。

source: The :setting:`SECURE_REFERRER_POLICY` setting now defaults to ``'same-origin'``. With this configured, :class:`~django.middleware.security.SecurityMiddleware` sets the :ref:`referrer-policy` header to ``same-origin`` on all responses that do not already have it. This prevents the ``Referer`` header being sent to other origins. If you need the previous behavior, explicitly set :setting:`SECURE_REFERRER_POLICY` to ``None``.
zh_hans: :setting:`SECURE_REFERRER_POLICY` 配置现在默认为 ``'same-origin'``。设置了这个之后，:class:`~django.middleware.security.SecurityMiddleware` 会在所有还没有设置 :ref:`referrer-policy` 头的情况下，将其设置为 ``same-origin``。这可以防止 ``Referer`` 头被发送到其他来源。如果你需要以前的行为，明确地设置 :setting:`SECURE_REFERRER_POLICY` 为 ``None``。

source: The default algorithm of :class:`django.core.signing.Signer`, :meth:`django.core.signing.loads`, and :meth:`django.core.signing.dumps` is changed to the SHA-256. Support for signatures made with the old SHA-1 algorithm remains until Django 4.0.
zh_hans: :class:`django.core.signing.Signer`、:meth:`django.core.signing.load` 和 :meth:`django.core.signing.dumps` 的默认算法改为 SHA-256。在 Django 4.0 之前，仍然支持用旧的 SHA-1 算法进行签名。

source: Also, the new ``algorithm`` parameter of the :class:`~django.core.signing.Signer` allows customizing the hashing algorithm.
zh_hans: 另外，:class:`~django.core.signing.Signer` 的新 ``algorithm`` 参数允许自定义哈希算法。

source: The renamed :ttag:`translate` and :ttag:`blocktranslate` template tags are introduced for internationalization in template code. The older :ttag:`trans` and :ttag:`blocktrans` template tags aliases continue to work, and will be retained for the foreseeable future.
zh_hans: 重新命名的 :ttag:`translate` 和 :ttag:`blocktranslate` 模板标签被引入，用于模板代码的国际化。旧的 :ttag:`trans` 和 :ttag:`blocktrans` 模板标签的别名继续工作，并将在可预见的未来保留。

source: The :ttag:`include` template tag now accepts iterables of template names.
zh_hans: :ttag:`include` 模板标签现在接受模板名称的可迭代对象。

source: :class:`~django.test.SimpleTestCase` now implements the ``debug()`` method to allow running a test without collecting the result and catching exceptions. This can be used to support running tests under a debugger.
zh_hans: :class:`~django.test.SimpleTestCase` 现在实现了 ``debug()`` 方法，允许在不收集结果和捕获异常的情况下运行测试。这可以用来支持在调试器下运行测试。

source: The new :setting:`MIGRATE <TEST_MIGRATE>` test database setting allows disabling of migrations during a test database creation.
zh_hans: 新的 :setting:`MIGRATE <TEST_MIGRATE>` 测试数据库配置允许在创建测试数据库时禁止迁移。

source: :class:`~django.test.runner.DiscoverRunner` now skips running the system checks on databases not :ref:`referenced by tests<testing-multi-db>`.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 现在会跳过对非 :ref:`测试所引用 <testing-multi-db>` 的数据库进行系统检查。

source: :class:`~django.test.TransactionTestCase` teardown is now faster on MySQL due to :djadmin:`flush` command improvements. As a side effect the latter doesn't automatically reset sequences on teardown anymore. Enable :attr:`.TransactionTestCase.reset_sequences` if your tests require this feature.
zh_hans: :class:`~django.test.TransactionTestCase` 关闭现在在 MySQL 上的速度更快了，这是因为 :djadmin:`flush` 命令的改进。作为一个副作用，后者不会再在关闭时自动重置序列。如果你的测试需要这个功能，请启用 :attr:`.TransactionTestCase.reset_sequences`。

source: :ref:`Path converters <registering-custom-path-converters>` can now raise ``ValueError`` in ``to_url()`` to indicate no match when reversing URLs.
zh_hans: :ref:`Path 转换器 <registering-custom-path-converters>` 现在可以在 ``to_url()`` 中引发 ``ValueError``，在反查 URL 时表示不匹配。

source: :func:`~django.utils.encoding.filepath_to_uri` now supports :class:`pathlib.Path`.
zh_hans: :func:`~django.utils.encoding.filepath_to_uri` 现在支持 :class:`pathlib.Path`。

source: :func:`~django.utils.dateparse.parse_duration` now supports comma separators for decimal fractions in the ISO 8601 format.
zh_hans: :func:`~django.utils.dateparse.parse_duration` 现在支持 ISO 8601 格式的小数点用逗号分隔。

source: :func:`~django.utils.dateparse.parse_datetime`, :func:`~django.utils.dateparse.parse_duration`, and :func:`~django.utils.dateparse.parse_time` now support comma separators for milliseconds.
zh_hans: :func:`~django.utils.dateparse.parse_datetime`、:func:`~django.utils.dateparse.parse_duration` 和 :func:`~django.utils.dateparse.parse_time` 现在支持用逗号分隔毫秒。

source: The SQLite backend now supports :class:`pathlib.Path` for the ``NAME`` setting.
zh_hans: SQLite 后端现在支持 :class:`pathlib.Path` 为 ``NAME`` 的配置。

source: The ``settings.py`` generated by the :djadmin:`startproject` command now uses :class:`pathlib.Path` instead of :mod:`os.path` for building filesystem paths.
zh_hans: 由 :djadmin:`startproject` 命令生成的 ``settings.py`` 现在使用 :class:`pathlib.Path` 代替 :mod:`os.path` 来建立文件系统路径。

source: The :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` setting is now allowed on databases that support time zones.
zh_hans: 现在允许在支持时区的数据库上进行 :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` 设置。

source: Backwards incompatible changes in 3.1
zh_hans: 3.1 中的不向后兼容的变更

source: ``DatabaseOperations.fetch_returned_insert_columns()`` now requires an additional ``returning_params`` argument.
zh_hans: ``DatabaseOperations.fetch_returned_insert_columns()`` 现在需要一个额外的 ``returning_params`` 参数。

source: ``connection.timezone`` property is now ``'UTC'`` by default, or the :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` when :setting:`USE_TZ` is ``True`` on databases that support time zones. Previously, it was ``None`` on databases that support time zones.
zh_hans: ``connection.timezone`` 属性现在默认为 ``'UTC``，或者当 :setting:`USE_TZ` 为 ``True`` 时，支持时区的数据库上的 :setting:`TIME_ZONE <DATABASE-TIME_ZONE>`。此前，在支持时区的数据库上是 ``None``。

source: ``connection._nodb_connection`` property is changed to the ``connection._nodb_cursor()`` method and now returns a context manager that yields a cursor and automatically closes the cursor and connection upon exiting the ``with`` statement.
zh_hans: ``connection._nodb_connection`` 属性改为 ``connection._nodb_cursor()`` 方法，现在返回一个产生游标的上下文管理器，并在退出 ``with`` 语句后自动关闭游标和连接。

source: ``DatabaseClient.runshell()`` now requires an additional ``parameters`` argument as a list of extra arguments to pass on to the command-line client.
zh_hans: ``DatabaseClient.runshell()`` 现在需要一个额外的 ``parameters`` 参数，作为传递给命令行客户端的额外参数列表。

source: The ``sequences`` positional argument of ``DatabaseOperations.sql_flush()`` is replaced by the boolean keyword-only argument ``reset_sequences``. If ``True``, the sequences of the truncated tables will be reset.
zh_hans: ``DatabaseOperations.sql_flush()`` 的 ``sequences`` 位置参数被只用关键字的布尔参数 ``reset_sequences`` 取代。如果 ``True``，截断表的序列将被重置。

source: The ``allow_cascade`` argument of ``DatabaseOperations.sql_flush()`` is now a keyword-only argument.
zh_hans: ``DatabaseOperations.sql_flush()`` 的 ``allow_cascade`` 参数现在是一个纯关键字的参数。

source: The ``using`` positional argument of ``DatabaseOperations.execute_sql_flush()`` is removed. The method now uses the database of the called instance.
zh_hans: ``DatabaseOperations.execute_sql_flush()`` 的 ``using`` 位置参数被删除。该方法现在使用被调用实例的数据库。

source: Third-party database backends must implement support for ``JSONField`` or set ``DatabaseFeatures.supports_json_field`` to ``False``. If storing primitives is not supported, set ``DatabaseFeatures.supports_primitives_in_json_field`` to ``False``. If there is a true datatype for JSON, set ``DatabaseFeatures.has_native_json_field`` to ``True``. If :lookup:`jsonfield.contains` and :lookup:`jsonfield.contained_by` are not supported, set ``DatabaseFeatures.supports_json_field_contains`` to ``False``.
zh_hans: 第三方数据库后端必须实现对 ``JSONField`` 的支持，或者将 ``DatabaseFeatures.supports_json_field`` 设置为 ``False``。如果不支持存储基元，则设置 ``DatabaseFeatures.supports_primitives_in_json_field`` 为 ``False``。如果 JSON 的数据类型为真，则设置 ``DatabaseFeatures.has_native_json_field`` 为 ``True``。如果不支持 :lookup:`jsonfield.contains` 和 :lookup:`jsonfield.contains_by`，则将 ``DatabaseFeatures.support_json_field_contains`` 设置为 ``False``。

source: Third party database backends must implement introspection for ``JSONField`` or set ``can_introspect_json_field`` to ``False``.
zh_hans: 第三方数据库后端必须实现对 ``JSONField`` 的自省，或者将 ``can_introspect_json_field`` 设置为 ``False``。

source: Dropped support for MariaDB 10.1
zh_hans: 丢弃了对 MariaDB 10.1 的支持

source: Upstream support for MariaDB 10.1 ends in October 2020. Django 3.1 supports MariaDB 10.2 and higher.
zh_hans: 对 MariaDB 10.1 的上游支持在 2020 年 10 月结束。Django 3.1 支持 MariaDB 10.2 及以上版本。

source: The admin no longer supports the legacy Internet Explorer browser. See :ref:`the admin FAQ <admin-browser-support>` for details on supported browsers.
zh_hans: 管理不再支持传统的 Internet Explorer 浏览器。关于支持的浏览器，请参见 :ref:`管理常见问题 <admin-browser-support>`。

source: :attr:`AbstractUser.first_name <django.contrib.auth.models.User.first_name>` ``max_length`` increased to 150
zh_hans: :attr:`AbstractUser.first_name <django.contrib.auth.models.User.first_name>` 的 ``max_length`` 增加到 150

source: A migration for :attr:`django.contrib.auth.models.User.first_name` is included. If you have a custom user model inheriting from ``AbstractUser``, you'll need to generate and apply a database migration for your user model.
zh_hans: 包含了 :attr:`django.contrib.auth.models.User.first_name` 的迁移。如果你有一个继承自 ``AbstractUser`` 的自定义用户模型，你将需要为你的用户模型生成并应用数据库迁移。

source: If you want to preserve the 30 character limit for first names, use a custom form::
zh_hans: 如果你想保留 first name 的 30 个字符限制，请使用自定义表单：

source: The cache keys used by :ttag:`cache` and generated by :func:`~django.core.cache.utils.make_template_fragment_key` are different from the keys generated by older versions of Django. After upgrading to Django 3.1, the first request to any previously cached template fragment will be a cache miss.
zh_hans: :ttag:`cache` 使用的缓存密钥和 :func:`~django.core.cache.utils.make_template_fragment_key` 生成的缓存密钥与旧版本 Django 生成的密钥不同。升级到 Django 3.1 后，第一次请求任何之前缓存的模板片段都会被缓存错过。

source: The logic behind the decision to return a redirection fallback or a 204 HTTP response from the :func:`~django.views.i18n.set_language` view is now based on the ``Accept`` HTTP header instead of the ``X-Requested-With`` HTTP header presence.
zh_hans: 从 :func:`~django.views.i18n.set_language` 视图中返回重定向回退或 204 HTTP 响应背后的逻辑现在是基于 ``Accept`` HTTP 头而不是 ``X-Requested-With`` HTTP 头的存在。

source: The compatibility imports of ``django.core.exceptions.EmptyResultSet`` in ``django.db.models.query``, ``django.db.models.sql``, and ``django.db.models.sql.datastructures`` are removed.
zh_hans: ``django.db.models.query``、``django.db.models.sql`` 和 ``django.db.models.sql.datastructures`` 中的 ``django.core.exceptions.EmptyResultSet`` 的兼容性导入被移除。

source: The compatibility import of ``django.core.exceptions.FieldDoesNotExist`` in ``django.db.models.fields`` is removed.
zh_hans: 删除了 ``django.db.models.field`` 中 ``django.core.exceptions.FieldDoesNotExist`` 的兼容性导入。

source: The compatibility imports of ``django.forms.utils.pretty_name()`` and ``django.forms.boundfield.BoundField`` in ``django.forms.forms`` are removed.
zh_hans: 删除了 ``django.forms.utils.pretty_name()`` 和 ``django.forms.boundfield.BoundField`` 的兼容性导入。

source: The compatibility imports of ``Context``, ``ContextPopException``, and ``RequestContext`` in ``django.template.base`` are removed.
zh_hans: ``django.template.base`` 中的 ``Context``、``ContextPopException`` 和 ``RequestContext`` 的兼容性导入被移除。

source: The compatibility import of ``django.contrib.admin.helpers.ACTION_CHECKBOX_NAME`` in ``django.contrib.admin`` is removed.
zh_hans: 删除了 ``django.contrib.admin.helpers.ACTION_CHECKBOX_NAME`` 中的兼容性导入。

source: The :setting:`STATIC_URL` and :setting:`MEDIA_URL` settings set to relative paths are now prefixed by the server-provided value of ``SCRIPT_NAME`` (or ``/`` if not set). This change should not affect settings set to valid URLs or absolute paths.
zh_hans: 设置为相对路径的 :setting:`STATIC_URL` 和 :setting:`MEDIA_URL` 配置现在以服务器提供的 ``SCRIPT_NAME`` 的值为前缀（如果没有设置，则为 ``/``）。这一变化不应影响设置为有效 URL 或绝对路径的配置。

source: :class:`~django.middleware.http.ConditionalGetMiddleware` no longer adds the ``ETag`` header to responses with an empty :attr:`~django.http.HttpResponse.content`.
zh_hans: :class:`~django.middleware.http.ConditionalGetMiddleware` 不再为空 :attr:`~django.http.HttpResponse.content` 的响应添加 ``ETag`` 头。

source: ``django.utils.decorators.classproperty()`` decorator is made public and moved to :class:`django.utils.functional.classproperty()`.
zh_hans: ``django.utils.disturators.classproperty()`` 装饰器被公开并移到 :class:`django.utils.functional.classproperty()`。

source: :tfilter:`floatformat` template filter now outputs (positive) ``0`` for negative numbers which round to zero.
zh_hans: :tfilter:`floatform` 模板过滤器现在对四舍五入为零的负数输出（正）``0```。

source: :attr:`Meta.ordering <django.db.models.Options.ordering>` and :attr:`Meta.unique_together <django.db.models.Options.unique_together>` options on models in ``django.contrib`` modules that were formerly tuples are now lists.
zh_hans: :attr:`Meta.ordering <django.db.models.Options.ordering>` 和 :attr:`Meta.unique_together <django.db.models.Options.unique_together>`` 模块中模型的选项，以前是元组，现在是列表。

source: The admin calendar widget now handles two-digit years according to the Open Group Specification, i.e. values between 69 and 99 are mapped to the previous century, and values between 0 and 68 are mapped to the current century.
zh_hans: 管理日历部件现在根据开放组规范处理两位数的年份，即 69 和 99 之间的值被映射到上一个世纪，0 和 68 之间的值被映射到当前世纪。

source: Date-only formats are removed from the default list for :setting:`DATETIME_INPUT_FORMATS`.
zh_hans: 从 :setting:`DATETIME_INPUT_FORMATS` 的默认列表中删除了仅限日期的格式。

source: The :class:`~django.forms.FileInput` widget no longer renders with the ``required`` HTML attribute when initial data exists.
zh_hans: 当初始数据存在时，:class:`~django.forms.FileInput` 小部件不再使用 ``required`` HTML 属性进行渲染。

source: The undocumented ``django.views.debug.ExceptionReporterFilter`` class is removed. As per the :ref:`custom-error-reports` documentation, classes to be used with :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` need to inherit from :class:`django.views.debug.SafeExceptionReporterFilter`.
zh_hans: 删除了未记录的 ``django.views.debug.ExceptionReporterFilter`` 类。根据 :ref:`custom-error-reports` 文档，与 :setting:`DEFAULT_EXCEPTION_REPORTER_FILTER` 一起使用的类需要继承 :class:`django.views.debug.SafeExceptionReporterFilter`。

source: The cache timeout set by :func:`~django.views.decorators.cache.cache_page` decorator now takes precedence over the ``max-age`` directive from the ``Cache-Control`` header.
zh_hans: :func:`~django.views.decorators.cache.cache_page` 装饰器设置的缓存超时现在优先于 ``Cache-Control`` 头的 ``max-age`` 指令。

source: Providing a non-local remote field in the :attr:`.ForeignKey.to_field` argument now raises :class:`~django.core.exceptions.FieldError`.
zh_hans: 在 :attr:`.ForeignKey.to_field` 参数中提供一个非本地的远程字段，现在会引发 :class:`~django.core.exceptions.FieldError`。
