Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a regression in pickling of ``LazyObject`` on Python 2 when the wrapped object doesn't have ``__reduce__()`` (:ticket:`28389`).
id: Diperbaiki pemulihan dalam pickle dari ``LazyObject`` pada Python 2 ketika obyek dibungkus tidak memiliki ``__reduce__()`` (:ticket:`28389`).
zh_hans: 修复了在 Python 2 上的 ``LazyObject`` 的 pickling 回归问题，当封装的对象没有 ``__reduce__()`` 时 (:ticket:`28389`)。

source: Fixed crash in ``runserver``'s ``autoreload`` with Python 2 on Windows with non-``str`` environment variables (:ticket:`28174`).
id: Diperbaiki kegagalan dalam ``autoreload````runserver`` dengan Python 2 pada Windows dengan variabel lignkunan bukan-``str``(:ticket:`28174`).
zh_hans: 修复了在 Windows 上使用 Python 2，并且环境变量不是 ``str`` 类型时，导致 ``runserver`` 的 ``autoreload`` 崩溃的问题 (:ticket:`28174`)。

source: Corrected ``Field.has_changed()`` to return ``False`` for disabled form fields: ``BooleanField``, ``MultipleChoiceField``, ``MultiValueField``, ``FileField``, ``ModelChoiceField``, and ``ModelMultipleChoiceField``.
id: Diperbaiki ``Field.has_changed()`` untuk mengembalikan ``False`` untuk meniadakan bidang formulir: ``BooleanField``, ``MultipleChoiceField``, ``MultiValueField``, ``FileField``, ``ModelChoiceField``, dan ``ModelMultipleChoiceField``.
zh_hans: 已更正 ``Field.has_changed()``，使其对于禁用的表单字段（如 ``BooleanField``、``MultipleChoiceField``、``MultiValueField``、``FileField``、``ModelChoiceField`` 和 ``ModelMultipleChoiceField``）返回 ``False``。

source: Fixed ``QuerySet.count()`` for ``union()``, ``difference()``, and ``intersection()`` queries. (:ticket:`28399`).
id: Diperbaiki permintaan ``QuerySet.count()`` for ``union()``, ``difference()``, dan ``intersection()`` (:ticket:`28399`).
zh_hans: 修复了 ``union()``, ``difference()`` 和 ``intersection()`` 查询的 ``QuerySet.count()`` 方法 (:ticket:`28399`)。

source: Fixed ``ClearableFileInput`` rendering as a subwidget of ``MultiWidget`` (:ticket:`28414`). Custom ``clearable_file_input.html`` widget templates will need to adapt for the fact that context values ``checkbox_name``, ``checkbox_id``, ``is_initial``, ``input_text``, ``initial_text``, and ``clear_checkbox_label`` are now attributes of ``widget`` rather than appearing in the top-level context.
id: Diperbaiki membangun ``ClearableFileInput`` sebagai sub widget dari ``MultiWidget`` (:ticket:`28414`). Cetakan widget ``clearable_file_input.html`` penyesuaian akan butuh menyesuaikan untuk fakta yang nilai-nilai konteks ``checkbox_name``, ``checkbox_id``, ``is_initial``, ``input_text``, ``initial_text``, dan ``clear_checkbox_label`` sekarang atribut-atribut dari ``widget`` daripada memunculkan dalam konteks tingkat-tinggi.
zh_hans: 修复了 ``ClearableFileInput`` 以 ``MultiWidget`` 的子小部件形式呈现的问题 (:ticket:`28414`)。自定义的 ``clearable_file_input.html`` 小部件模板需要适应这样的事实，即上下文值 ``checkbox_name``、``checkbox_id``、``is_initial``、``input_text``、``initial_text`` 和 ``clear_checkbox_label`` 现在是 ``widget`` 的属性，而不是出现在顶级上下文中。

source: Fixed queryset crash when using a ``GenericRelation`` to a proxy model (:ticket:`28418`).
id: Diperbaiki kegagalan queryset ketika menggunakan ``GenericRelation`` pada model proxy (:ticket:`28418`).
zh_hans: 修复了在使用 ``GenericRelation`` 到代理模型时，查询集崩溃的问题 (:ticket:`28418`)。

source: Django 1.11.5 release notes
id: Catatan terbitan Django 1.11.5
zh_hans: Django 1.11.5 版本发行说明

source: Django 1.11.5 fixes a security issue and several bugs in 1.11.4.
id: Django 1.11.5 memperbaiki masalah keamanan dan beberapa kesalahan di 1.11.4.
zh_hans: Django 1.11.5 修复了 1.11.4 中的一个安全问题和几个漏洞。

source: Fixed GEOS version parsing if the version has a commit hash at the end (new in GEOS 3.6.2) (:ticket:`28441`).
id: Diperbaiki penguraian versi GEOS jika versi mempunyai campuran commit pada akhir (baru di GEOS 3.6.2) (:ticket:`28441`).
zh_hans: 修复了如果 GEOS 版本在末尾具有提交哈希（在 GEOS 3.6.2 中新引入）时的版本解析问题 (:ticket:`28441`)。

source: Added compatibility for ``cx_Oracle`` 6 (:ticket:`28498`).
id: Ditambahkan kesesuaian untuk ``cx_Oracle`` 6 (:ticket:`28498`).
zh_hans: 添加了对 ``cx_Oracle`` 6 的兼容性 (:ticket:`28498`)。

source: Fixed select widget rendering when option values are tuples (:ticket:`28502`).
id: Diperbaiki pemilihan membangun widget ketika nilai ilihan adalah tuple (:ticket:`28502`).
zh_hans: 修复了当选项值为元组时，选择小部件的呈现问题 (:ticket:`28502`)。

source: Django 1.11 inadvertently changed the sequence and trigger naming scheme on Oracle. This causes errors on INSERTs for some tables if ``'use_returning_into': False`` is in the ``OPTIONS`` part of ``DATABASES``. The pre-1.11 naming scheme is now restored. Unfortunately, it necessarily requires an update to Oracle tables created with Django 1.11.[1-4]. Use the upgrade script in :ticket:`28451` comment 8 to update sequence and trigger names to use the pre-1.11 naming scheme.
id: Django 1.11 secara tidak sengaja merubah urutan dan pemicu skema penamaan pada Oracle. Ini menyebabkan kesalahan pada INSERT untuk beberapa tabel jika ``'use_returning_into': False``adalah dalam ``OPTIONS`` bagian dari ``DATABASES``. Pra-1.11 skema penamaan sekarang disimpan kembali. Sayangnya, itu perlu butuh sebuah pembaharuan pada tabel-tabel Oracle dibuat dengan Django 1.11.[1-4]. Gunakan tulisan memperbaharui dalam :ticket:`28451` komentar 8 untuk memperbaharui urutan dan pemicu nama-nama untuk menggunakan skema penamaan pra-1.11.
zh_hans: Django 1.11 无意中改变了 Oracle 上的序列和触发器命名方案。如果在 ``DATABASES`` 的 ``OPTIONS`` 部分中包含 ``'use_returning_into': False``，这会导致一些表的插入操作出错。现在已经恢复了 1.11 之前的命名方案。不幸的是，这必然需要更新使用 Django 1.11.[1-4] 创建的 Oracle 表。可以使用 :ticket:`28451` 评论 8 中的升级脚本来更新序列和触发器的名称，以使用 1.11 之前的命名方案。

source: Added POST request support to ``LogoutView``, for equivalence with the function-based ``logout()`` view (:ticket:`28513`).
id: Ditambahkan dukungan permintaan POST pada ``LogoutView``, untuk kesetaraan dengan tampilan ``logout()`` berdasarkan-fungsi (:ticket:`28513`).
zh_hans: 为了与基于函数的 ``logout()`` 视图相等，为 ``LogoutView`` 添加了 POST 请求支持 (:ticket:`28513`)。

source: Omitted ``pages_per_range`` from ``BrinIndex.deconstruct()`` if it's ``None`` (:ticket:`25809`).
id: Dihilangkan ``pages_per_range`` dari ``BrinIndex.deconstruct()`` jika itu adalah ``None`` (:ticket:`25809`).
zh_hans: 如果 ``pages_per_range`` 为 ``None``，则在 ``BrinIndex.deconstruct()`` 中省略了它 (:ticket:`25809`)。

source: Fixed a regression where ``SelectDateWidget`` localized the years in the select box (:ticket:`28530`).
id: Diperbaiki sebuah pemulihan dimana ``SelectDateWidget`` melokalkan tahun dalam kotak pilihan (:ticket:`28530`).
zh_hans: 修复了 ``SelectDateWidget`` 本地化选择框中的年份的回归问题 (:ticket:`28530`)。

source: Fixed a regression in 1.11.4 where ``runserver`` crashed with non-Unicode system encodings on Python 2 + Windows (:ticket:`28487`).
id: Diperbaiki sebuah pemulihan dalam 1.11.4 dimana ``runserver`` gagal dengan sistem pengkodean bukan-Unicode pada Python 2 + Windows (:ticket:`28487`).
zh_hans: 修复了在 Python 2 + Windows 上使用非 Unicode 系统编码时，1.11.4 中的 ``runserver`` 崩溃的回归问题 (:ticket:`28487`)。

source: Fixed a regression in Django 1.10 where changes to a ``ManyToManyField`` weren't logged in the admin change history (:ticket:`27998`) and prevented ``ManyToManyField`` initial data in model forms from being affected by subsequent model changes (:ticket:`28543`).
id: Diperbaiki sebuah pemulihan dalam Django 1.10 dimana perubahan pada ``ManyToManyField`` tidak tercatat dalam riwayat perubahan admin (:ticket:`27998`) dan dicegah data inisial ``ManyToManyField`` dalam formulir model sedang dipengaruhi oleh perubahan model selanjutnya (:ticket:`28543`).
zh_hans: 修复了 Django 1.10 中的回归问题，其中对 ``ManyToManyField`` 的更改未在管理员更改历史中记录 (:ticket:`27998`)，并防止模型表单中的 ``ManyToManyField`` 初始数据受到后续模型更改的影响 (:ticket:`28543`)。

source: Fixed non-deterministic results or an ``AssertionError`` crash in some queries with multiple joins (:ticket:`26522`).
id: Diperbaiki hasil bukan-deterministik atau sebuah kegagalan ``AssertionError``dalam beberapa permintaan dengan banyak penggabungan (:ticket:`26522`).
zh_hans: 修复了在某些具有多个连接的查询中产生非确定性结果或引发 ``AssertionError`` 崩溃的问题 (:ticket:`26522`)。

source: Fixed a regression in ``contrib.auth``'s ``login()`` and ``logout()`` views where they ignored positional arguments (:ticket:`28550`).
id: Diperbaiki sebuah pemulihan dalam tampilan-tampilan ``login()`` dan ``logout()`` ``contrib.auth`` dimana mereka mengabaikan penempatan argumen-argumen (:ticket:`28550`).
zh_hans: 修复了 ``contrib.auth`` 中的 ``login()`` 和 ``logout()`` 视图中的回归问题，它们忽略了位置参数 (:ticket:`28550`)。

source: Django 1.11.6 release notes
id: Catatan terbitan Django 1.11.6
zh_hans: Django 1.11.6 版本发行说明

source: *October 5, 2017*
id: *5 Oktober 2017*
zh_hans: *2017 年 10 月 5 日*

source: Django 1.11.6 fixes several bugs in 1.11.5.
id: Django 1.11.6 memperbaiki beberapa kesalahan di 1.11.5.
zh_hans: Django 1.11.6 修复了 1.11.5 中的几个漏洞。

source: Made the ``CharField`` form field convert whitespace-only values to the ``empty_value`` when ``strip`` is enabled (:ticket:`28555`).
id: DIbuat bidang formulir ``CharField`` merubah nilai hanya-ruang-putih menjadi ``empty_value`` ketika ``strip``diadakan (:ticket:`28555`).
zh_hans: 当启用 ``strip`` 时，使 ``CharField`` 表单字段将仅包含空白的值转换为 ``empty_value`` (:ticket:`28555`)。

source: Fixed crash when using the name of a model's autogenerated primary key (``id``) in an ``Index``'s ``fields`` (:ticket:`28597`).
id: Diperbaiki kegagalanketika menggunakan nama dari model primary key (``id``) dibangkitkan otomatis dalam sebuah ``fields`` ``Index`` (:ticket:`28597`).
zh_hans: 修复了在索引的 ``fields`` 中使用模型的自动生成的主键（``id``）名称时的崩溃问题 (:ticket:`28597`)。

source: Fixed a regression in Django 1.9 where a custom view error handler such as ``handler404`` that accesses ``csrf_token`` could cause CSRF verification failures on other pages (:ticket:`28488`).
id: Diperbaiki sebuah pemulihan dalam Django 1.9 dimana penangan tampilan penyesuaian seperti ``handler404`` yang mengakses ``csrf_token`` dapat menyebabkan kegagalan pengecekan CSRF pada halaman-halaman lain (:ticket:`28488`).
zh_hans: 修复了 Django 1.9 中的回归问题，其中一个自定义视图错误处理程序（例如 ``handler404``），如果访问了 ``csrf_token``，可能会导致其他页面上的 CSRF 验证失败 (:ticket:`28488`)。

source: Django 1.11.7 release notes
id: Catatan terbitan Django 1.11.7
zh_hans: Django 1.11.7 版本发行说明

source: *November 1, 2017*
id: *1 November 2017*
zh_hans: *2017 年 11 月 1 日*

source: Django 1.11.7 fixes several bugs in 1.11.6.
id: Django 1.11.7 memperbaiki beberapa kesalahan di 1.11.6.
zh_hans: Django 1.11.7 修复了 1.11.6 中的几个漏洞。

source: Prevented ``cache.get_or_set()`` from caching ``None`` if the ``default`` argument is a callable that returns ``None`` (:ticket:`28601`).
id: Dicegah ``cache.get_or_set()`` dari cache ``None`` jika argumen ``default`` dapat dipanggil yang mengembalikan ``None`` (:ticket:`28601`).
zh_hans: 防止 ``cache.get_or_set()`` 在 ``default`` 参数是返回 ``None`` 的可调用对象时缓存 ``None`` (:ticket:`28601`)。

source: Fixed the Basque ``DATE_FORMAT`` string (:ticket:`28710`).
id: Diperbaiki string ``DATE_FORMAT`` Basque (:ticket:`28710`).
zh_hans: 修复了巴斯克语的 ``DATE_FORMAT`` 字符串 (:ticket:`28710`)。

source: Made ``QuerySet.reverse()`` affect ``nulls_first`` and ``nulls_last`` (:ticket:`28722`).
id: Membuat ``QuerySet.reverse()`` mempengaruhi ``nulls_first`` dan ``nulls_last`` (:ticket:`28722`).
zh_hans: 使 ``QuerySet.reverse()`` 影响 ``nulls_first`` 和 ``nulls_last`` (:ticket:`28722`)。

source: Fixed unquoted table names in ``Subquery`` SQL when using ``OuterRef`` (:ticket:`28689`).
id: Diperbaiki nama tabel-tabel tidak dikutip dalam SQL ``Subquery`` ketika menggunakan ``OuterRef`` (:ticket:`28689`).
zh_hans: 在使用 ``OuterRef`` 时，修复了 ``Subquery`` SQL 中未引用的表名 (:ticket:`28689`)。

source: Django 1.11.8 release notes
id: Catatan terbitan Django 1.11.8
zh_hans: Django 1.11.8 版本发行说明

source: *December 2, 2017*
id: *2 Desember 2017*
zh_hans: *2017 年 12 月 2 日*

source: Django 1.11.8 fixes several bugs in 1.11.7.
id: Django 1.11.8 memperbaiki beberapa kesalahan di 1.11.7.
zh_hans: Django 1.11.8 修复了 1.11.7 中的几个漏洞。

source: Reallowed, following a regression in Django 1.10, ``AuthenticationForm`` to raise the inactive user error when using ``ModelBackend`` (:ticket:`28645`).
id: Mengizinkan kembali, mengikuti pemulihan di Django 1.10, ``AuthenticationForm`` untuk memunculkan kesalahan pengguna tidak aktif ketika menggunakan ``ModelBackend`` (:ticket:`28645`).
zh_hans: 在 Django 1.10 中由于回归问题，重新允许 ``AuthenticationForm`` 在使用 ``ModelBackend`` 时引发不活跃用户错误 (:ticket:`28645`)。

source: Added support for ``QuerySet.values()`` and ``values_list()`` for ``union()``, ``difference()``, and ``intersection()`` queries (:ticket:`28781`).
id: Ditambahkan dukungan untuk ``QuerySet.values()`` dan ``values_list()`` untuk permintaan ``union()``, ``difference()``, dan``intersection()``(:ticket:`28781`).
zh_hans: 为 ``union()``, ``difference()`` 和 ``intersection()`` 查询添加了对 ``QuerySet.values()`` 和 ``values_list()`` 的支持 (:ticket:`28781`)。

source: Fixed incorrect index name truncation when using a namespaced ``db_table`` (:ticket:`28792`).
id: Diperbaiki pemotongan nama indeks tidak benar ketika menggunakan namespace ``db_table`` (:ticket:`28792`).
zh_hans: 在使用命名空间的 ``db_table`` 时，修复了索引名称截断不正确的问题 (:ticket:`28792`)。

source: Made ``QuerySet.iterator()`` use server-side cursors on PostgreSQL after ``values()`` and ``values_list()`` (:ticket:`28817`).
id: Dibuat ``QuerySet.iterator()`` menggunakan kursor sisi-peladen pada PostgreSQL setelah ``values()`` dan ``values_list()`` (:ticket:`28817`).
zh_hans: 在 ``values()`` 和 ``values_list()`` 之后，使 ``QuerySet.iterator()`` 在 PostgreSQL 上使用服务器端游标 (:ticket:`28817`)。

source: Fixed crash on SQLite and MySQL when ordering by a filtered subquery that uses ``nulls_first`` or ``nulls_last`` (:ticket:`28848`).
id: Diperbaiki kegagalan pada SQLite dan MySQL ketika mengurutkan berdasarkan subpermintaan yang menggunakan ``nulls_first`` atau ``nulls_last`` (:ticket:`28848`).
zh_hans: 在使用 ``nulls_first`` 或 ``nulls_last`` 进行排序的已过滤子查询中，在 SQLite 和 MySQL 上修复了崩溃问题 (:ticket:`28848`)。

source: Made query lookups for ``CICharField``, ``CIEmailField``, and ``CITextField`` use a ``citext`` cast (:ticket:`28702`).
id: Dibuat pencarian permintaan untuk ``CICharField``, ``CIEmailField``, dan ``CITextField`` menggunakan masukan ``citext`` (:ticket:`28702`).
zh_hans: 对于 ``CICharField``、``CIEmailField`` 和 ``CITextField``，使查询查找使用了 ``citext`` 转换 (:ticket:`28702`)。

source: Fixed a regression in caching of a ``GenericForeignKey`` when the referenced model instance uses multi-table inheritance (:ticket:`28856`).
id: Diperbaiki sebuah pemulihan dalam cache dari ``GenericForeignKey`` ketika contoh-contoh model dirujuk menggunakan warisan banyak-tabel (:ticket:`28856`).
zh_hans: 修复了当引用的模型实例使用多表继承时，``GenericForeignKey`` 的缓存回归问题 (:ticket:`28856`)。

source: Fixed "Cannot change column 'x': used in a foreign key constraint" crash on MySQL with a sequence of ``AlterField`` and/or ``RenameField`` operations in a migration (:ticket:`28305`).
id: Diperbaiki kegagalan "Tidak dapat merubah kolom 'x': digunakan dalam sebuah batasan foreign key" pada MySQL dengan urutan dari tindakan-tindakan ``AlterField`` dan/atau ``RenameField``dalam sebuah perpindahan (:ticket:`28305`).
zh_hans: 在迁移中对 MySQL 进行一系列的 ``AlterField`` 和/或 ``RenameField`` 操作时，修复了“无法更改列 'x'：在外键约束中使用”崩溃问题 (:ticket:`28305`)。

source: Django 1.11.9 release notes
id: Catatan rilis Django 1.11.9
zh_hans: Django 1.11.9 版本发行说明

source: *January 1, 2018*
id: *1 Januari 2018*
zh_hans: *2018 年 1 月 1 日*

source: Django 1.11.9 fixes several bugs in 1.11.8.
id: Django 1.11.9 memperbaiki sejumlah bugs dari 1.11.8.
zh_hans: Django 1.11.9 修复了 1.11.8 中的几个漏洞。

source: Fixed a regression in Django 1.11 that added newlines between ``MultiWidget``'s subwidgets (:ticket:`28890`).
id: Diperbaiki sebuah pemulihan dalam Django 1.11 yang ditambahkan baris baru diantara subwidget ``MultiWidget`` (:ticket:`28890`).
zh_hans: 修复了 Django 1.11 中的回归问题，该问题在 ``MultiWidget`` 的子部件之间添加了换行符 (:ticket:`28890`)。

source: Fixed incorrect class-based model index name generation for models with quoted ``db_table`` (:ticket:`28876`).
id: Diperbaiki pembangkitan nama indeks model berdasarkan-kelas tidak benar untuk model-model dengan dikutip ``db_table`` (:ticket:`28876`).
zh_hans: 修复了对带有引用的 ``db_table`` 的模型生成索引名称时的错误问题 (:ticket:`28876`)。

source: Fixed incorrect foreign key constraint name for models with quoted ``db_table`` (:ticket:`28876`).
id: Diperbaiki nama batasan foreign key tidak benar untuk model-model dengan dikutip `db_table`` (:ticket:`28876`).
zh_hans: 修复了对带有引用的 ``db_table`` 的模型生成错误的外键约束名称问题 (:ticket:`28876`)。

source: Fixed a regression in caching of a ``GenericForeignKey`` when the referenced model instance uses more than one level of multi-table inheritance (:ticket:`28856`).
id: Diperbaiki sebuah pemulihan dalam cache dari ``GenericForeignKey`` ketika contoh-contoh model dirujuk menggunakan lebih dari satu tingkatan dari warisan banyak-tabel (:ticket:`28856`).
zh_hans: 修复了当引用的模型实例使用多级多表继承时，``GenericForeignKey`` 缓存的回归问题 (:ticket:`28856`)。

source: Django 1.2 release notes
id: Catatan terbitan Django 1.2
zh_hans: Django 1.2 版本发行说明

source: *May 17, 2010.*
id: *Mei 17, 2010.*
zh_hans: *2017 年 5 月 17 日*

source: Welcome to Django 1.2!
id: Selamat datang di Django 1.2!
zh_hans: 欢迎来到 Django 1.2 版本！

source: Nearly a year in the making, Django 1.2 packs an impressive list of :ref:`new features <whats-new-1.2>` and lots of bug fixes. These release notes cover the new features, as well as important changes you'll want to be aware of when upgrading from Django 1.1 or older versions.
id: Hanpir setahun dalam membuat, Django 1.2 membungkus sebuah daftar mengagumkan dari :ref:`new features <whats-new-1.2>` dan banyak perbaikan kesalahan. Catatan terbitan ini mencangkupi fitur-fitur baru, sama pentingnya perubahan anda akan ingin sadari ketika meningkatkan dari Django 1.1 atau versi terlama.
zh_hans: 经过近一年的努力，Django 1.2 收录了令人印象深刻的一系列 :ref:`新特性 <whats-new-1.2>` 和大量的错误修复。这些发布说明涵盖了新特性，以及在从 Django 1.1 或更早版本升级时需要注意的重要更改。

source: Overview
id: Ikhtisar
zh_hans: 概况

source: Django 1.2 introduces several large, important new features, including:
id: Django 1.2 memperkenalkan beberapa besar, fitur baru penting, termasuk:
zh_hans: Django 1.2 引入了几个重要的大型新功能，包括：

source: Support for :ref:`multiple database connections <support-for-multiple-databases>` in a single Django instance.
zh_hans: 在单个 Django 实例中支持 :ref:`多个数据库连接 <support-for-multiple-databases>`。

source: `Model validation`_ inspired by Django's form validation.
id: `Model validation`_ diilhami oleh pemeriksaan formulir Django.
zh_hans: `模型验证`_ 受到了 Django 的表单验证的启发。

source: Vastly :ref:`improved protection against Cross-Site Request Forgery <improved-csrf-protection>` (CSRF).
zh_hans: 极大地 :ref:`改进了跨站点请求伪造 <improved-csrf-protection>` (CSRF) 的保护机制。

source: A new :ref:`user "messages" framework <messages-framework>` with support for cookie- and session-based message for both anonymous and authenticated users.
zh_hans: 一个新的支持匿名和已验证用户的 cookie 和会话消息的 :ref:`用户“消息”框架 <messages-framework>`。

source: Hooks for `object-level permissions`_, `permissions for anonymous users`_, and :ref:`more flexible username requirements <relaxed-requirements-for-usernames>`.
zh_hans: `对象级权限`_、`匿名用户的权限`_ 和 :ref:`更灵活的用户名要求 <relaxed-requirements-for-usernames>` 的挂钩。

source: Customization of email sending via `email backends`_.
id: Penyesuaian dari pengiriman surel melalui `email backends`_.
zh_hans: 通过 `电子邮件后端`_ 自定义电子邮件发送。

source: New :ref:`"smart" if template tag <new-in-1.2-smart-if>` which supports comparison operators.
id: Baru :ref:`"smart" if template tag <new-in-1.2-smart-if>` yang mendukung penghubung perbandingan.
zh_hans: 新的 :ref:`"智能" if 模板标签 <new-in-1.2-smart-if>` 支持比较运算符。

source: These are just the highlights; full details and a complete list of features :ref:`may be found below <whats-new-1.2>`.
zh_hans: 这仅仅是亮点；完整的细节和功能列表 :ref:`可能在下面找到 <whats-new-1.2>`。

source: `Django Advent`_ covered the release of Django 1.2 with a series of articles and tutorials that cover some of the new features in depth.
id: `Django Advent`_ melingkupi terbitan dari Django 1.2 dengan rangkaian dari artikel dan tutorial yang melingkupi beberapa dari fitur baru secara dalam.
zh_hans: `Django Advent`_ 用一系列的文章和教程详细介绍了 Django 1.2 版本的发布以及其中一些新功能。

source: Wherever possible these features have been introduced in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>` policy.
id: Dimana memungkinkan fitur-fitur ini telah diperkenalkan di sikap kesesuaian-kebelakang per kebijakan :doc:`our API stability policy </misc/api-stability>`.
zh_hans: 尽可能地，这些功能都是按照 :doc:`我们的 API 稳定性政策 </misc/api-stability>` 来引入的，以保持向后兼容性。

source: However, a handful of features *have* changed in ways that, for some users, will be backwards-incompatible. The big changes are:
id: Bagaimanapun, bantuan dari fitur *telah* berubah dalam cara-cara yang, untuk beberapa pengguna, akan bertentangan kebelakang. Perubahan besar adalah:
zh_hans: 然而，有一些功能以某种方式发生了变化，对某些用户来说将不向后兼容。主要的变化包括：

source: Support for Python 2.3 has been dropped. See the full notes below.
id: Dukungan untuk Python 2.3 telah dibuang. Lihat catatan penuh dibawah.
zh_hans: 已取消对 Python 2.3 的支持。请参阅下面的详细说明。

source: The new CSRF protection framework is not backwards-compatible with the old system. Users of the old system will not be affected until the old system is removed in Django 1.4.
id: Kerangka kerja perlindungan CSRF baru tidak kesesuaian-kebelakang dengan sistem lama. Pengguna dari sistem lama akan tidak terpengaruh sampai sistem lama dipindahkan di Django 1.4.
zh_hans: 新的 CSRF 保护框架与旧系统不向后兼容。在 Django 1.4 中移除旧系统之前，旧系统的用户不会受到影响。

source: However, upgrading to the new CSRF protection framework requires a few important backwards-incompatible changes, detailed in `CSRF Protection`_, below.
id: Bagaimanapun, meningkatkan kekerangka kerja perlindungan CSRF baru membutuhkan beberapa perubahan bertentangan kebelakang, rincian dalam `CSRF Protection`_, dibawah.
zh_hans: 然而，升级到新的 CSRF 保护框架需要进行一些重要的不向后兼容的更改，详细信息请参见下面的 `CSRF 保护`_。

source: Authors of custom :class:`~django.db.models.Field` subclasses should be aware that a number of methods have had a change in prototype, detailed under `get_db_prep_*() methods on Field`_, below.
id: Penulis dari subkelas :class:`~django.db.models.Field` penyesuaian harus menyadari bahwa sejumlah metode telah berubah di purwa rupa, rincian dibawah `get_db_prep_*() methods on Field`_, dibawah.
zh_hans: 自定义 :class:`~django.db.models.Field` 子类的作者应该注意，一些方法的原型发生了变化，详细信息请参见下面的 `Field 上的 get_db_prep_*() 方法`_。

source: The internals of template tags have changed somewhat; authors of custom template tags that need to store state (e.g. custom control flow tags) should ensure that their code follows the new rules for `stateful template tags`_
id: Internal dari etiket cetakan telah berubah sedikit; penulis dari etiket cetakan penyesuaian yang butuh untuk menyimpan keadaan (sebagai contoh penyesuaian pengendalian aliran etiket) harus memastikan bahwa kode mereka mengikuti aturan baru untuk `stateful template tags`_
zh_hans: 模板标签的内部发生了一些变化；需要存储状态的自定义模板标签的作者（例如，自定义控制流标签）应确保他们的代码遵循了新的 `有状态模板标签`_ 的规则。

source: The :func:`~django.contrib.auth.decorators.user_passes_test`, :func:`~django.contrib.auth.decorators.login_required`, and :func:`~django.contrib.auth.decorators.permission_required`, decorators from :mod:`django.contrib.auth` only apply to functions and no longer work on methods. There's a simple one-line fix :ref:`detailed below <user-passes-test-login-required-permission-required>`.
zh_hans: 来自 :mod:`django.contrib.auth` 的 :func:`~django.contrib.auth.decorators.user_passes_test`、:func:`~django.contrib.auth.decorators.login_required` 和 :func:`~django.contrib.auth.decorators.permission_required` 装饰器仅适用于函数，不再适用于方法。有一个简单的一行修复方法，详细信息请参见下面的 :ref:`详细说明 <user-passes-test-login-required-permission-required>`。
