Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Prevented a crash on Python 3 with query strings containing unencoded non-ASCII characters (:ticket:`22996`).
id: Dicegah sebuah kegagalan pada Python 3 dengan string permintaan mengandung karakter bukan-ASCII tidak tersandi (:ticket:`22996`).
zh_hans: 防止了在 Python 3 中出现包含未编码的非 ASCII 字符的查询字符串时的崩溃（:ticket:`22996`）。

source: Django 1.6.7 release notes
id: Catatan terbitan Django 1.6.7
zh_hans: Django 1.6.7 版本发行说明

source: Django 1.6.7 fixes several bugs in 1.6.6, including a regression related to a security fix in that release.
id: Django 1.6.7 memperbaiki beberapa kesalahan di 1.6.6, termasuk pemulihan terkait perbaikan keamanan di terbitan tersebut.
zh_hans: Django 1.6.7 修复了 1.6.6 中的几个错误，包括与该版本中的安全修复相关的一个回归问题。

source: Allowed inherited and m2m fields to be referenced in the admin (:ticket:`23329`).
id: Diizinkan bidang mewarisi dan m2m untuk diacukan di admin (:ticket:`23329`)
zh_hans: 允许在管理员中引用继承和多对多字段（:ticket:`23329`）。

source: Fixed a crash when using ``QuerySet.defer()`` with ``select_related()`` (:ticket:`23370`).
id: Diperbaiki sebuah kegagalan ketika menggunakan ``QuerySet.defer()`` dengan ``select_related()`` (:ticket:`23370`).
zh_hans: 修复了在使用 ``QuerySet.defer()`` 与 ``select_related()`` 时出现崩溃的问题（:ticket:`23370`）。

source: Django 1.6.8 release notes
id: Catatan terbitan Django 1.6.8
zh_hans: Django 1.6.8 版本发行说明

source: Django 1.6.8 fixes a couple regressions in the 1.6.6 security release.
id: Django 1.6.8 memperbaiki sepasang pemulihan di terbitan keamanan 1.6.6.
zh_hans: Django 1.6.8 修复了 1.6.6 安全发布中的几个回归问题。

source: Django 1.6.9 release notes
id: Catatan terbitan Django 1.6.9
zh_hans: Django 1.6.9 版本发行说明

source: Django 1.6.9 fixes a regression in the 1.6.6 security release.
id: Django 1.6.9 memperbaiki pemulihan di terbitan keamanan 1.6.6.
zh_hans: Django 1.6.9 修复了 1.6.6 安全发布中的一个回归问题。

source: Django 1.7 release notes
id: Catatan terbitan Django 1.7
zh_hans: Django 1.7 版本发行说明

source: Welcome to Django 1.7!
id: Selamat datang ke Django 1.7!
zh_hans: 欢迎使用 Django 1.7 ！

source: These release notes cover the :ref:`new features <whats-new-1.7>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.7>` you'll want to be aware of when upgrading from Django 1.6 or older versions. We've :ref:`begun the deprecation process for some features <deprecated-features-1.7>`, and some features have reached the end of their deprecation process and :ref:`have been removed <removed-features-1.7>`.
id: Catatan terbitan ini melingkupi :ref:`new features <whats-new-1.7>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.7>` anda ingin sadari dari ketika meningkatkan dari Django 1.6 atau versi terlama. Kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.7>`, dan beberapa fitur telah mencapai akhir dari pengolahan pengusangan mereka dan :ref:`have been removed <removed-features-1.7>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.7>`，以及在从 Django 1.6 或更旧版本升级时需要注意的一些 :ref:`不兼容的变更 <backwards-incompatible-1.7>`。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-1.7>`，并且一些功能已经完成了其弃用过程，已经 :ref:`被移除 <removed-features-1.7>`。

source: Django 1.7 requires Python 2.7, 3.2, 3.3, or 3.4. We **highly recommend** and only officially support the latest release of each series.
id: Django 1.7 membutuhkan Python 2.7, 3.2, 3.3 atau 3.4. Kami **sangat menganjurkan** dan hanya secara resmi mendukung terbitan terakhir dari setiap rangkaian.
zh_hans: Django 1.7 需要 Python 2.7、3.2、3.3 或 3.4。我们 **强烈建议** 并且只官方支持每个系列的最新版本。

source: The Django 1.6 series is the last to support Python 2.6. Django 1.7 is the first release to support Python 3.4.
id: Rangkaian Django 1.6 adalah dukungan terakhir Python 2.6 Django 1.7 adalah terbitan pertama untuk mendukung Python 3.4.
zh_hans: Django 1.6 系列是最后一个支持 Python 2.6 的版本。 Django 1.7 是第一个支持 Python 3.4 的版本。

source: This change should affect only a small number of Django users, as most operating-system vendors today are shipping Python 2.7 or newer as their default version. If you're still using Python 2.6, however, you'll need to stick to Django 1.6 until you can upgrade your Python version. Per :doc:`our support policy </internals/release-process>`, Django 1.6 will continue to receive security support until the release of Django 1.8.
id: Perubahan ini seharusnya berakibat hanya angka kecil dari pengguna Django, seperti kebanyakan penjaja sistem operasi hari ini yang membekali Phyton 2.7 atau terbaru sebagai versi awal mereka. Jika anda masih menggunakan Python 2.6, bagaimanapun, anda akan butuh melekat ke Django 1.6 sampai anda dapat meningkatkan; per :doc:`kebijakan dukungan kami </internals/release-process>`, Django 1.6 akan lanjut menerima dukungan keamanan sampai terbitan dari Django 1.8.
zh_hans: 这个改变应该只影响少数 Django 用户，因为大多数操作系统供应商现在都将 Python 2.7 或更新版本作为默认版本发布。然而，如果您仍在使用 Python 2.6，那么您需要继续使用 Django 1.6，直到您可以升级您的 Python 版本。根据 :doc:`我们的支持政策 </internals/release-process>`，Django 1.6 将继续获得安全支持，直到 Django 1.8 发布为止。

source: What's new in Django 1.7
id: Apa yang baru di Django 1.7
zh_hans: Django 1.7 的新特性包括：

source: Schema migrations
id: Skema perpindahan
zh_hans: 模式迁移

source: Django now has built-in support for schema migrations. It allows models to be updated, changed, and deleted by creating migration files that represent the model changes and which can be run on any development, staging or production database.
id: Django sekarang mempunyai dukungan siap-pakai untuk skema perpindahan. Itu mengizinkan untuk diperbaharui, dirubah, dan dihapus dengan membuat berkas-berkas perpindahan yang mewakili model perubahan dan yang dapat berjalan pada pengembangan, pementasan atau basisdata produk apapun.
zh_hans: Django 现在内置了对模式迁移的支持。它允许通过创建迁移文件来更新、修改和删除模型，这些迁移文件代表了模型的变更，可以在任何开发、暂存或生产数据库上运行。

source: Migrations are covered in :doc:`their own documentation</topics/migrations>`, but a few of the key features are:
id: Perpindahan tercakup di :doc:`their own documentation</topics/migrations>`, tetapi sedikit dari fitur kunci adalah:
zh_hans: 迁移在 :doc:`自己的文档中 </topics/migrations>` 中有详细的介绍，但其中一些关键特性包括：

source: ``syncdb`` has been deprecated and replaced by ``migrate``. Don't worry - calls to ``syncdb`` will still work as before.
id: ``syncdb`` telah diusangkan dan diganti oleh ``migrate``. Jangan khawatir - panggil ``syncdb`` akan masih dapat bekerja seperti sebelumnya.
zh_hans: ``syncdb`` 已经被弃用，被 ``migrate`` 取代。不用担心 - 对 ``syncdb`` 的调用仍然会像以前一样工作。

source: A new ``makemigrations`` command provides an easy way to autodetect changes to your models and make migrations for them.
id: Sebuah perintah ``makemigrations`` menyediakan sebuah cara mudah untuk menemukan otomatis perubahan ke model anda dan membuat perpindahan untuk mereka
zh_hans: 新的 ``makemigrations`` 命令提供了一种自动检测模型更改并为其创建迁移的简便方法。

source: ``django.db.models.signals.pre_syncdb`` and ``django.db.models.signals.post_syncdb`` have been deprecated, to be replaced by :data:`~django.db.models.signals.pre_migrate` and :data:`~django.db.models.signals.post_migrate` respectively. These new signals have slightly different arguments. Check the documentation for details.
id: ``django.db.models.signals.pre_syncdb`` dan ``django.db.models.signals.post_syncdb`` telah diusangkan, untuk diganti oleh :data:`~django.db.models.signals.pre_migrate` dan :data:`~django.db.models.signals.post_migrate` masing-masing. Sinyal baru ini sedikit berbeda argumen. Periksa dokumentasi untuk rincian.
zh_hans: ``django.db.models.signals.pre_syncdb`` 和 ``django.db.models.signals.post_syncdb`` 已经被弃用，分别由 :data:`~django.db.models.signals.pre_migrate` 和 :data:`~django.db.models.signals.post_migrate` 取代。这些新信号具有稍微不同的参数。请查阅文档以获取详细信息。

source: The ``allow_syncdb`` method on database routers is now called ``allow_migrate``, but still performs the same function. Routers with ``allow_syncdb`` methods will still work, but that method name is deprecated and you should change it as soon as possible (nothing more than renaming is required).
id: Metode ``allow_syncdb`` di perute basisdata sekarang dipanggil ``allow_migrate``, tetapi masih melakukan fungsi sama. Perute dengan metode ``allow_syncdb`` akan masih bekerja, tetapi nama metode itu diusangkan dan anda harus merubah itu secepatnya (tidak ada yang lebih dari menamai kembali adalah wajib).
zh_hans: 数据库路由器上的 ``allow_syncdb`` 方法现在被称为 ``allow_migrate``，但仍然执行相同的功能。具有 ``allow_syncdb`` 方法的路由器仍然可以工作，但该方法名称已被弃用，您应尽快更改它（只需要重命名即可）。

source: ``initial_data`` fixtures are no longer loaded for apps with migrations; if you want to load initial data for an app, we suggest you create a migration for your application and define a :class:`~django.db.migrations.operations.RunPython` or :class:`~django.db.migrations.operations.RunSQL` operation in the ``operations`` section of the migration.
id: Alat bantu ``initial_data`` tidak lagi dimuat untuk aplikasi dengan perpindahan; jika anda ingin memuat data inisial untuk sebuah aplikasi, kami menyarankan anda membuat sebuah perpindahan untuk aplikasi anda dan menentukan sebuah tindakan :class:`~django.db.migrations.operations.RunPython` atau :class:`~django.db.migrations.operations.RunSQL` di bagian ``operations`` dari perpindahan.
zh_hans: 不再为具有迁移的应用程序加载 ``initial_data`` fixture；如果您想为应用程序加载初始数据，建议您为应用程序创建一个迁移，并在迁移的 ``operations`` 部分中定义一个 :class:`~django.db.migrations.operations.RunPython` 或 :class:`~django.db.migrations.operations.RunSQL` 操作。

source: Test rollback behavior is different for apps with migrations; in particular, Django will no longer emulate rollbacks on non-transactional databases or inside ``TransactionTestCase`` :ref:`unless specifically requested <test-case-serialized-rollback>`.
id: Perilaku kembali percobaan adalah berbeda untuk aplikasi dengan perpindahan; khususnya, Django akan tidak lagi meniru kembali di basisdata bukan-transaksi atau didalam ``TransactionTestCase`` :ref:`unless specifically requested <test-case-serialized-rollback>`.
zh_hans: 对于具有迁移的应用程序，测试回滚行为会有所不同；特别是，Django 不再在非事务性数据库上或 ``TransactionTestCase`` 内模拟回滚，除非明确请求（:ref:`除非明确请求 <test-case-serialized-rollback>`）。

source: It is not advised to have apps without migrations depend on (have a :class:`~django.db.models.ForeignKey` or :class:`~django.db.models.ManyToManyField` to) apps with migrations.
id: Itu tidak disarankan untuk memiliki aplikasi tanpa perpindahan bergantung di (mempunyai sebuah :class:`~django.db.models.ForeignKey` atau :class:`~django.db.models.ManyToManyField` pada) aplikasi dengan perpindahan.
zh_hans: 不建议没有迁移的应用程序依赖于（具有 :class:`~django.db.models.ForeignKey` 或 :class:`~django.db.models.ManyToManyField` 的）具有迁移的应用程序。

source: App-loading refactor
id: Refaktor memuat-aplikasi
zh_hans: 应用加载重构

source: Historically, Django applications were tightly linked to models. A singleton known as the "app cache" dealt with both installed applications and models. The models module was used as an identifier for applications in many APIs.
id: Secara riwayat, aplikasi Django terkait erat ke model. Sebuah singleton dikenal sebagai "app cache" ditangani dengan kedia aplikasi terpasang dan model. Modul model digunakan sebagai sebuah penciri untuk aplikasi di banyak API.
zh_hans: 在过去，Django 应用与模型紧密耦合。一个名为 "应用缓存" 的单例处理已安装的应用和模型。许多 API 中使用模型模块作为应用的标识符。

source: As the concept of :doc:`Django applications </ref/applications>` matured, this code showed some shortcomings. It has been refactored into an "app registry" where models modules no longer have a central role and where it's possible to attach configuration data to applications.
id: Ketika konsep dari :doc:`Django applications </ref/applications>` jatuh tempo, kode ini menunjukkan beberapa kekurangan. Itu telah di refaktor kedalam sebuah "app registry" dimana modul model tidak lagi mempunyai peran utama dan dimana itu memungkinkan melampirkan data konfigurasi ke apliaksi.
zh_hans: 随着 :doc:`Django 应用程序 </ref/applications>` 概念的成熟，这段代码显示出了一些不足之处。它已经被重构为一个 "应用程序注册表"，在这里模型模块不再起到核心作用，同时可以将配置数据附加到应用程序。

source: Improvements thus far include:
id: Perbaikan sejauh ini termasuk:
zh_hans: 迄今为止的改进包括：

source: Applications can run code at startup, before Django does anything else, with the :meth:`~django.apps.AppConfig.ready` method of their configuration.
id: Aplikasi dapat menjalankan kode saat mulai, sebelum Django melakukan apapun lain, dengan metode :meth:`~django.apps.AppConfig.ready` dari konfigurasi mereka.
zh_hans: 应用程序可以在启动时运行代码，在 Django 执行任何其他操作之前，使用其配置的 :meth:`~django.apps.AppConfig.ready` 方法。

source: Application labels are assigned correctly to models even when they're defined outside of ``models.py``. You don't have to set :attr:`~django.db.models.Options.app_label` explicitly any more.
id: Label aplikasi diberikan secara benar pada model bahkan ketika mereka ditentukan diluar dari ``models.py``. Anda tidak harus menyetel :attr:`~django.db.models.Options.app_label` dengan jelas lagi.
zh_hans: 即使在 ``models.py`` 之外定义模型，应用程序标签也会被正确地分配给模型。您不再需要显式设置 :attr:`~django.db.models.Options.app_label`。

source: It is possible to omit ``models.py`` entirely if an application doesn't have any models.
id: Itu memungkinkan menghilangkan ``models.py`` sepenuhnya jika sebuah aplikasi tidak mempunyai model apapun.
zh_hans: 如果一个应用程序没有任何模型，完全可以省略 ``models.py``。

source: Applications can be relabeled with the :attr:`~django.apps.AppConfig.label` attribute of application configurations, to work around label conflicts.
id: Aplikasi dapat di label ulang dengan atribut :attr:`~django.apps.AppConfig.label` dari konfigurais aplikasi, untuk memecahkan bentrokan label.
zh_hans: 可以使用应用程序配置的 :attr:`~django.apps.AppConfig.label` 属性重新标记应用程序，以解决标签冲突。

source: The name of applications can be customized in the admin with the :attr:`~django.apps.AppConfig.verbose_name` of application configurations.
id: Nama dari aplikasi dapat disesuaikan di admin dengan :attr:`~django.apps.AppConfig.verbose_name` dari konfigurasi aplikasi.
zh_hans: 可以使用应用程序配置的 :attr:`~django.apps.AppConfig.verbose_name` 来自定义在管理员界面中的应用程序名称。

source: The admin automatically calls :func:`~django.contrib.admin.autodiscover()` when Django starts. You can consequently remove this line from your URLconf.
id: Admin secara otomatis memanggil :func:`~django.contrib.admin.autodiscover()` ketika Django mulai. Anda dapat oleh karena itu memindahkan baris ini dari URLconf anda.
zh_hans: 管理员界面在 Django 启动时会自动调用 :func:`~django.contrib.admin.autodiscover()`。因此，您可以从您的 URL 配置中删除这行代码。

source: Django imports all application configurations and models as soon as it starts, through a deterministic and straightforward process. This should make it easier to diagnose import issues such as import loops.
id: Django impor semua konfigurasi aplikasi dan model segera setelah itu mulai, melalui proses deterministik dan terus terang. Ini harus membuatnya lebih mudah untuk menentukan masalah import seperti perulangan impor.
zh_hans: Django 在启动时通过一种确定性且简单的过程导入所有应用程序配置和模型。这将使诊断导入问题（如导入循环）变得更容易。

source: New method on Field subclasses
id: Metode baru di subkelas Field
zh_hans: Field 子类的新方法

source: To help power both schema migrations and to enable easier addition of composite keys in future releases of Django, the :class:`~django.db.models.Field` API now has a new required method: ``deconstruct()``.
id: Untuk menggerakkan kedua skema perpindahan dan mengadakan penambahan lebih mudah dari kunci gabungan di fitur terbitan dari Django, API :class:`~django.db.models.Field` sekarang mempunyai metode wajib baru: ``deconstruct()``.
zh_hans: 为了支持模式迁移并使未来版本的 Django 更容易添加复合键，:class:`~django.db.models.Field` API 现在有一个新的必需方法：``deconstruct()``。

source: This method takes no arguments, and returns a tuple of four items:
id: Metode ini tidak mengambil argumen, dan mengembalikan sebuah tuple dari empat barang:
zh_hans: 该方法不接受任何参数，并返回一个包含四个元素的元组：

source: ``name``: The field's attribute name on its parent model, or ``None`` if it is not part of a model
zh_hans: ``name``：字段在其父模型上的属性名称，如果它不是模型的一部分，则为 ``None``。

source: ``path``: A dotted, Python path to the class of this field, including the class name.
id: ``path``: Sebuah bertitik, jalur Python pada kelas dari bidang ini, termasuk nama kelas.
zh_hans: ``path``：字段类的点分隔的 Python 路径，包括类名。

source: ``args``: Positional arguments, as a list
id: ``args``: Argumen penempatan, seperti sebuah daftar
zh_hans: ``args``：作为列表的位置参数。

source: ``kwargs``: Keyword arguments, as a dict
id: ``kwargs``: Argumen kata kuncu, seperti sebuah kamus
zh_hans: ``kwargs``：作为字典的关键字参数。

source: These four values allow any field to be serialized into a file, as well as allowing the field to be copied safely, both essential parts of these new features.
id: Empat nilai ini mengizinkan bidang apapun untuk di serialisasi kedalam sebuah berkas, sama halnya mengizinkan bidang untuk disalin secara aman, kedua bagian penting dari fitur baru ini.
zh_hans: 这四个值允许将任何字段序列化到文件中，并且允许字段进行安全复制，这是这些新功能的重要组成部分。

source: This change should not affect you unless you write custom Field subclasses; if you do, you may need to reimplement the ``deconstruct()`` method if your subclass changes the method signature of ``__init__`` in any way. If your field just inherits from a built-in Django field and doesn't override ``__init__``, no changes are necessary.
id: Perubahan ini tidak harus mempengaruhi anda meskipun anda menulis penyesuaian subkelas Bidang; jika anda melakukan, anda mungkin butuh menerapkan kembali metode ``deconstruct()`` jika subkelas anda merubah metode tandatangan dari ``__init__`` di cara apapun. Jika bidang anda hanya warisan dari bidang Django siap-pakai dan tidak menimpa ``__init__``, tidak ada perubahan diperlukan.
zh_hans: 这个变化不会影响您，除非您编写自定义的 Field 子类；如果您这样做，如果您的子类以任何方式更改了 ``__init__`` 的方法签名，您可能需要重新实现 ``deconstruct()`` 方法。如果您的字段只是继承自内置的 Django 字段，并且没有重写 ``__init__``，则无需进行任何更改。

source: If you do need to override ``deconstruct()``, a good place to start is the built-in Django fields (``django/db/models/fields/__init__.py``) as several fields, including ``DecimalField`` and ``DateField``, override it and show how to call the method on the superclass and simply add or remove extra arguments.
id: Jika anda perlu melakukan untuk menimpa ``deconstruct()``, sebuah tempat bagus untuk memulai adalah bidang Django siap-pakai (``django/db/models/fields/__init__.py``) sebagai beberapa bidang, termasuk ``DecimalField`` dan ``DateField``, kesampingkan itu dan tunjukkan bagaimana memanggil metode pada superkelas dan cukup tambah atau pindahkan argumen tambahan.
zh_hans: 如果您确实需要重写 ``deconstruct()``，一个好的起点是内置的 Django 字段（``django/db/models/fields/__init__.py``），因为其中一些字段，包括 ``DecimalField`` 和 ``DateField``，已经重写了它，并展示了如何在超类上调用该方法，只需添加或删除额外的参数。

source: This also means that all arguments to fields must themselves be serializable; to see what we consider serializable, and to find out how to make your own classes serializable, read the :ref:`migration serialization documentation <migration-serializing>`.
id: Ini juga berarti bahwa semua argumen pada bidang harus mereka sendiri diserialisasikan; untuk melihat apa kami anggap dapat serial, dan untuk menemukan bagaimana membuat kelas anda sendiri dapat serial, baca :ref:`migration serialization documentation <migration-serializing>`.
zh_hans: 这也意味着字段的所有参数本身必须是可序列化的；要了解我们认为什么是可序列化的，以及如何使您自己的类可序列化，请阅读 :ref:`迁移序列化文档 <migration-serializing>`。

source: Calling custom ``QuerySet`` methods from the ``Manager``
id: Memanggil metode ``QuerySet`` penyesuaian dari ``Manager``
zh_hans: 从 ``Manager`` 中调用自定义的 ``QuerySet`` 方法

source: Historically, the recommended way to make reusable model queries was to create methods on a custom ``Manager`` class. The problem with this approach was that after the first method call, you'd get back a ``QuerySet`` instance and couldn't call additional custom manager methods.
id: Secara riwayat, cara yang dianjurkan untuk membuat permintaan model yang digunakan kembali adalah membuat metode di kelas ``Manager`` penyesuaian. Masalah dengan pendekatan ini adalah setelah panggilan metode pertama, anda akan mendapatkan kembali instance ``QuerySet`` dan tidak dapat memanggil tambahan metode pengelola penyesuaian.
zh_hans: 历史上，制作可重用的模型查询的推荐方法是在自定义 ``Manager`` 类上创建方法。这种方法的问题在于，在第一次方法调用之后，您会得到一个 ``QuerySet`` 实例，无法调用其他自定义的管理器方法。

source: Though not documented, it was common to work around this issue by creating a custom ``QuerySet`` so that custom methods could be chained; but the solution had a number of drawbacks:
id: Meskipun tidak didokumentasikan, itu adalah umum untuk memecahkan masalah ini dengan membuat penyesuaian ``QuerySet`` sehingga metode penyesuaian dapat dirantai; tetapi pemecahan mempunyai sebuah angka dari pengembalian:
zh_hans: 尽管没有记录，但通常可以通过创建自定义的 ``QuerySet`` 来解决这个问题，以便可以链接自定义方法；但是这个解决方案有很多缺点：

source: The custom ``QuerySet`` and its custom methods were lost after the first call to ``values()`` or ``values_list()``.
id: Penyesuaian `QuerySet`` dan metode penyesuainnya telah hilang setelah panggilan pertama pada ``values()`` atau ``values_list()``.
zh_hans: 自定义的 ``QuerySet`` 和其自定义方法在第一次调用 ``values()`` 或 ``values_list()`` 后就丢失了。

source: Writing a custom ``Manager`` was still necessary to return the custom ``QuerySet`` class and all methods that were desired on the ``Manager`` had to be proxied to the ``QuerySet``. The whole process went against the DRY principle.
id: Menulis sebuah penyesuaian ``Manager`` masih dibutuhkan untuk mengembalikan kelas ``QuerySet`` penyesuaian dan semua metode yang diinginkan di ``Manager`` harus di proxykan ke ``QuerySet``. Pengolahan seluruhnya bertentangan dengan prinsip DRY.
zh_hans: 仍然需要编写自定义的 ``Manager`` 来返回自定义的 ``QuerySet`` 类，并且所有希望在 ``Manager`` 上使用的方法都必须被代理到 ``QuerySet`` 上。整个过程违反了 DRY 原则。

source: The :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` class method can now directly :ref:`create Manager with QuerySet methods <create-manager-with-queryset-methods>`::
id: Metode kelas :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` sekarang secara langsung :ref:`create Manager with QuerySet methods <create-manager-with-queryset-methods>`::
zh_hans: 现在可以直接使用 :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` 类方法来 :ref:`创建具有 QuerySet 方法的 Manager <create-manager-with-queryset-methods>`：

source: Using a custom manager when traversing reverse relations
id: Menggunakan penyesuaian pengelola ketika melintasi hubungan balikan
zh_hans: 在遍历反向关系时使用自定义管理器

source: It is now possible to :ref:`specify a custom manager <using-custom-reverse-manager>` when traversing a reverse relationship::
id: Itu sekarang memungkinkan untuk :ref:`specify a custom manager <using-custom-reverse-manager>` ketika melewati lintas hubungan::
zh_hans: 现在可以在遍历反向关系时 :ref:`指定自定义的管理器 <using-custom-reverse-manager>`：

source: New system check framework
id: Kerangka sistem pemeriksaan baru
zh_hans: 新的系统检查框架

source: We've added a new :doc:`System check framework </ref/checks>` for detecting common problems (like invalid models) and providing hints for resolving those problems. The framework is extensible so you can add your own checks for your own apps and libraries.
id: Kami telah menambahkan :doc:`System check framework </ref/checks>` baru untuk mengenali masalah-masalah umum (seperti model tidak sah) dan menyediakan petunjuk untuk menyelesaikan masalah-masalah tersebut. Kerangka dapat diperpanjang jadi anda dapat menambah pemeriksaan anda sendiri untuk aplikasi dan pustaka anda sendiri.
zh_hans: 我们新增了一个新的 :doc:`系统检查框架 </ref/checks>`，用于检测常见问题（比如无效的模型）并提供解决这些问题的提示。这个框架是可扩展的，因此您可以为自己的应用程序和库添加自定义检查。

source: To perform system checks, you use the :djadmin:`check` management command. This command replaces the older ``validate`` management command.
id: Untuk melakukan pemeriksaan sistem, anda menggunakan perintah pengelolaan :djadmin:`check`. Perintah ini menggantikan perintah pengelolaan ``validate`` lama.
zh_hans: 要执行系统检查，您可以使用 :djadmin:`check` 管理命令。这个命令替代了旧的 ``validate`` 管理命令。
