Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :class:`~django.core.validators.RegexValidator` now accepts the optional :attr:`~django.core.validators.RegexValidator.flags` and Boolean :attr:`~django.core.validators.RegexValidator.inverse_match` arguments. The :attr:`~django.core.validators.RegexValidator.inverse_match` attribute determines if the :exc:`~django.core.exceptions.ValidationError` should be raised when the regular expression pattern matches (``True``) or does not match (``False``, by default) the provided ``value``. The :attr:`~django.core.validators.RegexValidator.flags` attribute sets the flags used when compiling a regular expression string.
id: :class:`~django.core.validators.RegexValidator` sekarang menerima pilihan argumen :attr:`~django.core.validators.RegexValidator.flags` dan Boolean :attr:`~django.core.validators.RegexValidator.inverse_match`. Atribut :attr:`~django.core.validators.RegexValidator.inverse_match` menentukan jika :exc:`~django.core.exceptions.ValidationError` harus dimunculkan ketika pola regular expression cocok (``True``) atau tidak cocok (``False``, secara awalan) ``value`` disediakan. Atribut :attr:`~django.core.validators.RegexValidator.flags` menyetel bendera digunakan ketika menyusun deretan karakter regular expression.
zh_hans: :class:`~django.core.validators.RegexValidator` 现在接受可选的 :attr:`~django.core.validators.RegexValidator.flags` 和布尔型 :attr:`~django.core.validators.RegexValidator.inverse_match` 参数。:attr:`~django.core.validators.RegexValidator.inverse_match` 属性确定在正则表达式模式匹配（``True``）或不匹配（默认为 ``False``）提供的 ``value`` 时是否引发 :exc:`~django.core.exceptions.ValidationError`。:attr:`~django.core.validators.RegexValidator.flags` 属性设置编译正则表达式字符串时使用的标志。

source: :class:`~django.core.validators.URLValidator` now accepts an optional ``schemes`` argument which allows customization of the accepted URI schemes (instead of the defaults ``http(s)`` and ``ftp(s)``).
id: :class:`~django.core.validators.URLValidator` sekarang menerima sebuah pilhan argumen ``schemes`` yang mengizinkan penyesuaian dari skema URL diterima (sebagai gantinya ``http(s)`` dan ``ftp(s)``).
zh_hans: :class:`~django.core.validators.URLValidator` 现在接受一个可选的 ``schemes`` 参数，允许自定义接受的 URI 方案（而不是默认的 ``http(s)`` 和 ``ftp(s)``）。

source: :func:`~django.core.validators.validate_email` now accepts addresses with IPv6 literals, like ``example@[2001:db8::1]``, as specified in RFC 5321.
id: :func:`~django.core.validators.validate_email` sekarang menerima pengalamatan dengan harfiah IPv6, seperti ``example@[2001:db8::1]``, seperti ditentukan di RFC 5321.
zh_hans: :func:`~django.core.validators.validate_email` 现在接受包含 IPv6 字面量的地址，例如 ``example@[2001:db8::1]``，如 RFC 5321 中规定。

source: Backwards incompatible changes in 1.7
id: Perubahan bertentangan kebelakang di 1.7
zh_hans: 1.7 版中向后不兼容的变化

source: In addition to the changes outlined in this section, be sure to review the :ref:`deprecation plan <deprecation-removed-in-1.7>` for any features that have been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada perubahan diuraikan di bagian ini, pastikan untuk meninjau kembali :ref:`deprecation plan <deprecation-removed-in-1.7>` untuk setiap fitur yang telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur yang diberikan, perpindahannya mugkin muncul sebagai perubahan ketidaksesuaian kebelakang.
zh_hans: 除了本节中概述的更改之外，确保查看任何已删除功能的 :ref:`废弃计划 <deprecation-removed-in-1.7>`。如果您在给定功能的废弃时间段内未更新您的代码，其删除可能会被视为向后不兼容的更改。

source: While Django will still look at ``allow_syncdb`` methods even though they should be renamed to ``allow_migrate``, there is a subtle difference in which models get passed to these methods.
id: Selagi Django akan amsih mencari metode ``allow_syncdb`` meskipun mereka harus dinamai kembali ke ``allow_migrate``, ada sebuah perbedaan halus di model mana diloloskan ke metode ini.
zh_hans: 尽管 Django 仍然会查看 ``allow_syncdb`` 方法，尽管它们应该重命名为 ``allow_migrate``，但传递给这些方法的模型有一些微妙的区别。

source: For apps with migrations, ``allow_migrate`` will now get passed :ref:`historical models <historical-models>`, which are special versioned models without custom attributes, methods or managers. Make sure your ``allow_migrate`` methods are only referring to fields or other items in ``model._meta``.
id: Untuk aplikasi dengan perpindahan, ``allow_migrate`` akan sekarang melewatkan :ref:`historical models <historical-models>`, yang model versi khusus tanpa atribut penyesuaian, metode atau pengelola. Pastikan metode ``allow_migrate`` anda hanya mengacu ke bidang-bidang atau barang-barang lainnya di ``model._meta``.
zh_hans: 对于具有迁移的应用程序，``allow_migrate`` 现在将传递 :ref:`历史模型 <historical-models>`，这些模型是特殊的带有自定义属性、方法或管理器的版本模型。确保您的 ``allow_migrate`` 方法只引用了 ``model._meta`` 中的字段或其他项。

source: Apps with migrations will not load ``initial_data`` fixtures when they have finished migrating. Apps without migrations will continue to load these fixtures during the phase of ``migrate`` which emulates the old ``syncdb`` behavior, but any new apps will not have this support.
id: Aplikasi-aplikasi dengan perpindahan tidak akan memuat perlengkapan ``initial_data`` ketika mereka telah menyelesaikan perpindahan. Aplikasi-aplikasi tanpa perpindahan akan melanjutkan memuat perlengkapan ini selama fase dari ``migrate`` yang meniru perilaku ``syncdb`` lama, tetapi setiap apliaksi baru tidak mempunyai dukungan ini.
zh_hans: 具有迁移的应用程序在完成迁移后将不再加载 ``initial_data`` 修复程序。没有迁移的应用程序将在模拟旧的 ``syncdb`` 行为的 ``migrate`` 阶段继续加载这些修复程序，但任何新的应用程序将不再支持这一功能。

source: Instead, you are encouraged to load initial data in migrations if you need it (using the ``RunPython`` operation and your model classes); this has the added advantage that your initial data will not need updating every time you change the schema.
id: Malahan, anda didorong memuat data inisial di perpindahan jika anda butuh itu (menggunakan tindakan ``RunPython`` dan kelas-kelas model anda); ini mempunyai tambahan keuntungan yang data inisial anda tidak akan butuh diperbaharui setiap kali anda merubah skema.
zh_hans: 相反，我们鼓励您在需要时在迁移中加载初始数据（使用 ``RunPython`` 操作和您的模型类）；这有一个附加优势，即每次更改模式时都不需要更新初始数据。

source: Additionally, like the rest of Django's old ``syncdb`` code, ``initial_data`` has been started down the deprecation path and will be removed in Django 1.9.
id: Tambahannya, seperti kode ``syncdb`` lama Django lainnya, ``initial_data`` telah dimulai jalur pengusangan dan akan dipindahkan di Django 1.9.
zh_hans: 另外，就像 Django 的旧 ``syncdb`` 代码一样，``initial_data`` 也已经开始了弃用路径，并将在 Django 1.9 中移除。

source: ``deconstruct()`` and serializability
zh_hans: ``deconstruct()`` 和可序列化性

source: Django now requires all Field classes and all of their constructor arguments to be serializable. If you modify the constructor signature in your custom Field in any way, you'll need to implement a ``deconstruct()`` method; we've expanded the custom field documentation with :ref:`instructions on implementing this method <custom-field-deconstruct-method>`.
zh_hans: Django 现在要求所有 Field 类及其构造函数参数都必须可序列化。如果你以任何方式修改了自定义 Field 的构造函数签名，你需要实现一个 ``deconstruct()`` 方法；我们已经在自定义字段文档中扩展了 :ref:`关于实现这个方法的说明 <custom-field-deconstruct-method>`。

source: The requirement for all field arguments to be :ref:`serializable <migration-serializing>` means that any custom class instances being passed into Field constructors - things like custom Storage subclasses, for instance - need to have a :ref:`deconstruct method defined on them as well <custom-deconstruct-method>`, though Django provides a handy class decorator that will work for most applications.
id: Persyaratan untuk semua bidang argumen untuk menjadi :ref:`serializable <migration-serializing>` berarti bahwa setiap penyesuaian instance kelas sedang dilewatkan kedalam pembangun Field - hal-hal seperti penyesuaian subkelas Storage, sebagai contoh - butuh memiliki :ref:`deconstruct method defined on them as well <custom-deconstruct-method>`, meskipun Django menyediakan sebuah penghias kelas mudah yang akan bekerja untuk kebanyakan aplikasi.
zh_hans: 所有字段参数需要是可 :ref:`序列化的 <migration-serializing>` 要求意味着任何传递到 Field 构造函数中的自定义类实例，比如自定义的 Storage 子类，都需要在它们上面定义一个 :ref:`deconstruct 方法 <custom-deconstruct-method>`，尽管 Django 提供了一个方便的类装饰器，对大多数应用都适用。

source: App-loading changes
id: Perubahan memuat-aplikasi
zh_hans: 应用加载的变化

source: Start-up sequence
id: Urutan memulai
zh_hans: 启动序列

source: Django 1.7 loads application configurations and models as soon as it starts. While this behavior is more straightforward and is believed to be more robust, regressions cannot be ruled out. See :ref:`applications-troubleshooting` for solutions to some problems you may encounter.
id: Django 1.7 memuat konfigurasi aplikasi dan model ketika itu mulai. Selagi perilaku ini lebih terang-terangan dan dipercaya untuk menjadi lebih kuat, pemulihan tidak dapat dikesampingkan. Lihat :ref:`applications-troubleshooting` untuk pemecahan pada beberapa masalah anda mungkin hadapi.
zh_hans: Django 1.7 在启动时会立即加载应用程序配置和模型。虽然这种行为更为直接，被认为更加健壮，但不能完全排除回归问题。有关您可能遇到的一些问题的解决方案，请参阅 :ref:`applications-troubleshooting`。

source: Standalone scripts
id: Tulisan berdiri sendiri
zh_hans: 独一无二的脚本

source: If you're using Django in a plain Python script — rather than a management command — and you rely on the :envvar:`DJANGO_SETTINGS_MODULE` environment variable, you must now explicitly initialize Django at the beginning of your script with:
zh_hans: 如果你在一个普通的 Python 脚本中使用 Django，而不是管理命令，并且依赖于 :envvar:`DJANGO_SETTINGS_MODULE` 环境变量，现在你必须在脚本开头显式地初始化 Django，如下所示：

source: Otherwise, you will hit an ``AppRegistryNotReady`` exception.
id: Jika tidak, anda akan membentur sebuah pengecualian ``AppRegistryNotReady``.
zh_hans: 否则，你将遇到一个 ``AppRegistryNotReady`` 异常。

source: WSGI scripts
id: Tulisan WSGI
zh_hans: WSGI 脚本

source: Until Django 1.3, the recommended way to create a WSGI application was::
id: Sampai Django 1.3, cara dianjurkan untuk membuat aplikasi WSGI adalah::
zh_hans: 在 Django 1.3 之前，创建一个 WSGI 应用程序的推荐方法是：

source: In Django 1.4, support for WSGI was improved and the API changed to::
id: Di Django 1.4, dukungan untk WSGI telah ditingkarkan dan API berubah menjadi::
zh_hans: 在 Django 1.4 中，对 WSGI 的支持得到改进，并且 API 发生了变化：

source: If you're still using the former style in your WSGI script, you need to upgrade to the latter, or you will hit an ``AppRegistryNotReady`` exception.
id: Jika anda masih menggunakan gaya bekas di tulisan WSGI anda, anda butuh meningkatkan ke terakhir, atau anda akan mengenai sebuah pengecualian ``AppRegistryNotReady``.
zh_hans: 如果你的 WSGI 脚本仍在使用前一种风格，你需要升级到后一种风格，否则你将遇到一个 ``AppRegistryNotReady`` 异常。

source: App registry consistency
id: Kemantapan registrar aplikasi
zh_hans: 应用程序注册表的一致性

source: It is no longer possible to have multiple installed applications with the same label. In previous versions of Django, this didn't always work correctly, but didn't crash outright either.
id: Itu tidak lagi memungkinkan memiliki banyak aplikasi terpasang dengan label sama. Dalam versi sebelum dari Django, ini tidak selalu bekerja dengan benar, tetapi tidak gagal sekaligus juga.
zh_hans: 不再允许安装具有相同标签的多个应用程序。在 Django 的早期版本中，这种情况不总是正常工作，但也不会完全崩溃。

source: If you have two apps with the same label, you should create an :class:`~django.apps.AppConfig` for one of them and override its :class:`~django.apps.AppConfig.label` there. You should then adjust your code wherever it references this application or its models with the old label.
id: Jika anda mempunyai dua aplikasi dengan label sama, anad harus membuat sebuah :class:`~django.apps.AppConfig` untuk satu dari mereka dan menimpa :class:`~django.apps.AppConfig.label` nya disana. Anda harus kemudian menyesuaikan kode anda dimanapun itu mengacu aplikasi ini atau modelnya dengan label lama.
zh_hans: 如果你有两个具有相同标签的应用程序，你应该为其中一个创建一个 :class:`~django.apps.AppConfig`，并在其中覆盖其 :class:`~django.apps.AppConfig.label`。然后，你应该在引用该应用程序或其模型的任何代码中，将旧标签调整为新标签。

source: It isn't possible to import the same model twice through different paths any more. As of Django 1.6, this may happen only if you're manually putting a directory and a subdirectory on :envvar:`PYTHONPATH`. Refer to the section on the new project layout in the :doc:`1.4 release notes </releases/1.4>` for migration instructions.
id: Itu tidak mungkin mengimpor model yang sama dua kali melalui jalur berbeda lagi. Ketika Django 1.6, ini mungkin terjadi hanya jika anda sedang secara manual menaruh sebuah direktori dan sebuah subdirektori pada :envvar:`PYTHONPATH`. Mengacu pada bagian di tata letak proyek baru di :doc:`1.4 release notes </releases/1.4>` untuk pentunjuk perpindahan.
zh_hans: 不再允许通过不同路径两次导入同一模型。从 Django 1.6 开始，只有在手动将一个目录和一个子目录放在 :envvar:`PYTHONPATH` 上时，才会发生这种情况。有关迁移说明，请参阅 :doc:`1.4 发布说明中的新项目布局部分 </releases/1.4>`。

source: You should make sure that:
id: Anda harus pastikan itu:
zh_hans: 您应该确保：

source: All models are defined in applications that are listed in :setting:`INSTALLED_APPS` or have an explicit :attr:`~django.db.models.Options.app_label`.
id: Semua model ditentukan di aplikasi yang didaftarkan di :setting:`INSTALLED_APPS` atau mempunyai sebuah :attr:`~django.db.models.Options.app_label` yang jelas.
zh_hans: 所有模型都在列在 :setting:`INSTALLED_APPS` 中或具有明确 :attr:`~django.db.models.Options.app_label` 的应用程序中定义。

source: Models aren't imported as a side-effect of loading their application. Specifically, you shouldn't import models in the root module of an application nor in the module that define its configuration class.
id: Model tidak diimpor sebagai pengaruh-samping dari memuat aplikasi mereka. Khususnya, anda tidak harus mengimpor model di modul akar dari sebuah aplikasi maupun di modul yang menentukan kelas konfigurasinya.
zh_hans: 模型不会作为加载其应用程序的副作用而导入。具体而言，您不应该在应用程序的根模块或定义其配置类的模块中导入模型。

source: Django will enforce these requirements as of version 1.9, after a deprecation period.
id: Django akan memaksa persyaratan ini sebagai versi 1.9, setelah masa pengusangan.
zh_hans: 从版本 1.9 开始，Django 将强制执行这些要求，经过一段废弃期之后。

source: Subclassing AppCommand
id: Mensubkelaskan AppCommand
zh_hans: 继承 AppCommand 类

source: Subclasses of :class:`~django.core.management.AppCommand` must now implement a :meth:`~django.core.management.AppCommand.handle_app_config` method instead of ``handle_app()``. This method receives an :class:`~django.apps.AppConfig` instance instead of a models module.
id: Subkelas-subkelas dari :class:`~django.core.management.AppCommand` harus sekarang menerapkan sebuah metode :meth:`~django.core.management.AppCommand.handle_app_config` daripada ``handle_app()``. Metode ini menerima sebuah instance :class:`~django.apps.AppConfig` daripada modul model.
zh_hans: :class:`~django.core.management.AppCommand` 的子类现在必须实现 :meth:`~django.core.management.AppCommand.handle_app_config` 方法，而不是 ``handle_app()``。这个方法接收一个 :class:`~django.apps.AppConfig` 实例，而不是一个模型模块。

source: Introspecting applications
id: Menginterospeksi aplikasi
zh_hans: 检查应用程序信息

source: Since :setting:`INSTALLED_APPS` now supports application configuration classes in addition to application modules, you should review code that accesses this setting directly and use the app registry (:attr:`django.apps.apps`) instead.
id: Sejak :setting:`INSTALLED_APPS` sekarang mendukung kelas-kelas konfigurasi aplikasi sebagai tambahan pada modul aplikasi, anda harus meninjau kembali kode yang mengakses pengaturan ini secara langsung dan menggunakan registrar aplikasi (:attr:`django.apps.apps`) sebagai gantinya.
zh_hans: 由于 :setting:`INSTALLED_APPS` 现在支持应用程序配置类，而不仅仅是应用程序模块，因此你应该检查直接访问此设置的代码，并改为使用应用程序注册表 (:attr:`django.apps.apps`)。

source: The app registry has preserved some features of the old app cache. Even though the app cache was a private API, obsolete methods and arguments will be removed through a standard deprecation path, with the exception of the following changes that take effect immediately:
id: Registrar aplikasi telah melindungi beberapa fitur dari cache aplikasi lama. Meskipun cache aplikasi adalah API pribadi, metode dan argumen usang akan dipindahkan melalui sebuah jalur pengusangan standar, dengan pengecualian dari perubahan berikut yang mengambil pengaruh segera:
zh_hans: 应用程序注册表保留了一些旧的应用程序缓存的特性。尽管应用程序缓存是一个私有 API，但过时的方法和参数将通过标准的废弃路径逐步移除，但以下变更将立即生效：

source: ``get_model`` raises :exc:`LookupError` instead of returning ``None`` when no model is found.
id: ``get_model`` memunculkan :exc:`LookupError` daripada mengembalikan ``None`` ketika tidak ada model ditemukan.
zh_hans: 当找不到模型时，``get_model`` 现在会引发 :exc:`LookupError`，而不是返回 ``None``。

source: The ``only_installed`` argument of ``get_model`` and ``get_models`` no longer exists, nor does the ``seed_cache`` argument of ``get_model``.
id: Argumen ``only_installed`` dari ``get_model`` dan ``get_models`` tidak lagi ada, maupun argumen ``seed_cache`` dari ``get_model``.
zh_hans: ``get_model`` 和 ``get_models`` 的 ``only_installed`` 参数不再存在，``get_model`` 的 ``seed_cache`` 参数也不再存在。

source: Management commands and order of :setting:`INSTALLED_APPS`
id: Perintah pengelolaan dan urutan dari :setting:`INSTALLED_APPS`
zh_hans: 管理命令和 :setting:`INSTALLED_APPS` 的顺序

source: When several applications provide management commands with the same name, Django loads the command from the application that comes first in :setting:`INSTALLED_APPS`. Previous versions loaded the command from the application that came last.
id: Ketika beberapa aplikasi menyediakan perintah pengelolaan dengan nama sama, Django memuat perintah dari aplikasi yang datang pertama di :setting:`INSTALLED_APPS`. Versi sebelumnya memuat perintah dari aplikasi yang datang terakhir.
zh_hans: 当多个应用程序提供具有相同名称的管理命令时，Django 会从 :setting:`INSTALLED_APPS` 中排在前面的应用程序加载命令。之前的版本会从排在最后的应用程序加载命令。

source: This brings discovery of management commands in line with other parts of Django that rely on the order of :setting:`INSTALLED_APPS`, such as static files, templates, and translations.
id: Ini membawa penemuan dari perintah pengelolaan di baris dengan bagian lain dari Django yang bergantung di urutan dari :setting:`INSTALLED_APPS`, seperti berkas-berkas tetap, cetakan, dan terjemahan.
zh_hans: 这将管理命令的发现与 Django 的其他部分保持一致，这些部分依赖于 :setting:`INSTALLED_APPS` 的顺序，比如静态文件、模板和翻译。

source: ``ValidationError`` constructor and internal storage
id: Pembangun ``ValidationError`` dan penyimpanan internal
zh_hans: ``ValidationError`` 构造函数和内部存储

source: The behavior of the ``ValidationError`` constructor has changed when it receives a container of errors as an argument (e.g. a ``list`` or an ``ErrorList``):
id: Perilaku dari pembangun ``ValidationError`` telah berubah ketika itu menerima sebuah wadah kesalahan sebagai sebuah argumen (sebagai contoh sebuah ``list`` atau sebuah ``ErrorList``):
zh_hans: 当 ``ValidationError`` 构造函数接收到错误容器作为参数时（例如，一个 ``list`` 或一个 ``ErrorList``），其行为已经发生了变化：

source: It converts any strings it finds to instances of ``ValidationError`` before adding them to its internal storage.
id: Itu merubah string apapun pada instance dari ``ValidationError`` sebelum menambahkan mereka ke penyimpanan internal nya.
zh_hans: 它会在将字符串添加到其内部存储之前，将其转换为 ``ValidationError`` 的实例。

source: It doesn't store the given container but rather copies its content to its own internal storage; previously the container itself was added to the ``ValidationError`` instance and used as internal storage.
id: Itu tidak menyimpan wadah yang diberikan tetapi lebih baik menyalin isinya ke penyimpanan interal sendiri; sebelumnya wadah itu sendiri telah ditambahkan ke instance ``ValidationError`` dan digunakan sebagai penyimpanan internal.
zh_hans: 它不会存储给定的容器，而是将其内容复制到自己的内部存储中；以前容器本身被添加到 ``ValidationError`` 实例并用作内部存储。

source: This means that if you access the ``ValidationError`` internal storages, such as ``error_list``; ``error_dict``; or the return value of ``update_error_dict()`` you may find instances of ``ValidationError`` where you would have previously found strings.
id: Ini berarti bahwa jika anda mengakses penyimpan internal ``ValidationError``, seperti ``error_list``; ``error_dict``; atau mengembalikan nilai dari ``update_error_dict()`` anda mungkin menemukan instance dari ``ValidationError`` dimana anda akan sebelumnya menemukan string.
zh_hans: 这意味着如果你访问 ``ValidationError`` 的内部存储，比如 ``error_list``、``error_dict`` 或 ``update_error_dict()`` 的返回值，你可能会在以前找到字符串的地方找到 ``ValidationError`` 的实例。

source: Also if you directly assigned the return value of ``update_error_dict()`` to ``Form._errors`` you may inadvertently add ``list`` instances where ``ErrorList`` instances are expected. This is a problem because unlike a simple ``list``, an ``ErrorList`` knows how to handle instances of ``ValidationError``.
zh_hans: 此外，如果你直接将 ``update_error_dict()`` 的返回值赋给 ``Form._errors``，你可能会无意中添加 ``list`` 实例，而期望的是 ``ErrorList`` 实例。这是一个问题，因为与简单的 ``list`` 不同，``ErrorList`` 知道如何处理 ``ValidationError`` 的实例。

source: Most use-cases that warranted using these private APIs are now covered by the newly introduced :meth:`Form.add_error() <django.forms.Form.add_error()>` method::
id: Kebanyakan kasus-digunakan yang menjamin menggunakan API pribadi ini sekarang dicakupi oleh metode :meth:`Form.add_error() <django.forms.Form.add_error()>` yang baru diperkenalkan::
zh_hans: 现在，大多数需要使用这些私有 API 的用例都可以使用新引入的 :meth:`Form.add_error() <django.forms.Form.add_error()>` 方法来处理：

source: If you need both Django <= 1.6 and 1.7 compatibility you can't use :meth:`Form.add_error() <django.forms.Form.add_error()>` since it wasn't available before Django 1.7, but you can use the following workaround to convert any ``list`` into ``ErrorList``::
id: Jika anda butuh kesesuaian kedua Django <= 1.6 dan 1.7 anda tidak dapat menggunakan :meth:`Form.add_error() <django.forms.Form.add_error()>` sejak itu tidak tersedia sebelum Django 1.7, tetapi anda dapat menggunakan pemecahan berikut untuk merubah setiap ``list`` menjadi ``ErrorList``::
zh_hans: 如果你需要同时兼容 Django <= 1.6 和 1.7，由于在 Django 1.7 之前没有提供 :meth:`Form.add_error() <django.forms.Form.add_error()>` 方法，你可以使用以下解决方法将任何 ``list`` 转换为 ``ErrorList``：

source: Behavior of ``LocMemCache`` regarding pickle errors
id: Perilaku `` LocMemCache`` mengenai kesalahan pickle
zh_hans: 关于 ``LocMemCache`` 对 pickle 错误的行为

source: An inconsistency existed in previous versions of Django regarding how pickle errors are handled by different cache backends. ``django.core.cache.backends.locmem.LocMemCache`` used to fail silently when such an error occurs, which is inconsistent with other backends and leads to cache-specific errors. This has been fixed in Django 1.7, see :ticket:`21200` for more details.
id: Sebuah ketidakkonsistentan ada di versi sebelumnya dari Django perihal bagaimana kesulitan kesalahan ditangani oleh backend penyimpanan sementara yang berbeda. ``django.core.cache.backends.locmem.LocMemCache`` digunakan untuk gagal secara diam ketika kesalahan seperti itu muncul, yaitu ketidakkonsistenan dengan backend lain dan membawa pada kesalahan penyimpanan sementara-tertentu. Ini telah diperbaiki di Django 1.7, lihat :ticket:`21200` untuk lebih rinci.
zh_hans: 在以前的 Django 版本中存在一个不一致之处，关于不同缓存后端如何处理 pickle 错误。``django.core.cache.backends.locmem.LocMemCache`` 以前在发生这种错误时会静默失败，这与其他后端不一致，并导致了与缓存相关的错误。在 Django 1.7 中已经修复了这个问题，详情请参阅 :ticket:`21200`。

source: Cache keys are now generated from the request's absolute URL
id: Kunci cache sekarang dibangkitkan dari permintaan URL mutlak
zh_hans: 现在缓存键从请求的绝对 URL 生成
