Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Prevented the loss of ``null``/``not null`` column properties during field alteration of MySQL databases (:ticket:`24595`).
id: Dicegah kehilangan sifat kolom ``null``/``not null`` selama perubahan bidang dari basisdata MySQL (:ticket:`24595`).
zh_hans: 防止了在对 MySQL 数据库字段进行更改时丢失 ``null``/``not null`` 列属性 (:ticket:`24595`)。

source: Fixed JavaScript path of ``contrib.admin``’s related field widget when using alternate static file storages (:ticket:`24655`).
zh_hans: 修复了在使用替代静态文件存储时，``contrib.admin`` 的关联字段小部件的 JavaScript 路径的问题 (:ticket:`24655`)。

source: Fixed a migration crash when adding new relations to models (:ticket:`24573`).
id: Diperbaiki sebuah kegagalan perpindahan ketika menambahkan hubungan pada model (:ticket:`24573`).
zh_hans: 修复了在向模型添加新关系时发生迁移崩溃的问题 (:ticket:`24573`)。

source: Fixed a migration crash when applying migrations with model managers on Python 3 that were generated on Python 2 (:ticket:`24701`).
id: Diperbaiki sebuah kegagalan perpindahan ketika memberlakukan perpindahan dengan pengelola model pada Python 3 yang dibangkitkan pada Python 2 (:ticket:`24701`).
zh_hans: 修复了在 Python 3 上应用在 Python 2 上生成的具有模型管理器的迁移时发生的崩溃问题 (:ticket:`24701`)。

source: Restored the ability to use iterators as queryset filter arguments (:ticket:`24719`).
id: Disimpan kembali kemampuan menggunakan perulangan sebagai argumen penyaring queryset (:ticket:`24719`).
zh_hans: 恢复了将迭代器用作查询集过滤器参数的能力 (:ticket:`24719`)。

source: Fixed a migration crash when renaming the target model of a many-to-many relation (:ticket:`24725`).
id: Diperbaiki sebuah kegagalan perpindahan ketika menamai kembali sasaran model dari hubungan banyak-ke-banyak (:ticket:`24725`).
zh_hans: 修复了在重命名多对多关系的目标模型时发生迁移崩溃的问题 (:ticket:`24725`)。

source: Removed flushing of the test database with :option:`test --keepdb`, which prevented apps with data migrations from using the option (:ticket:`24729`).
id: Dipindahkan pembilasan dari basisdata percobaan dengan :option:`test --keepdb`, yang mencegah aplikasi dengan perpindahan data dari menggunakan pilihan (:ticket:`24729`).
zh_hans: 移除了使用 :option:`test --keepdb` 时清空测试数据库的操作，这样可以使具有数据迁移的应用程序使用该选项 (:ticket:`24729`)。

source: Fixed ``makemessages`` crash in some locales (:ticket:`23271`).
id: Diperbaiki kegagalan ``makemessages`` di beberapa lokal (:ticket:`23271`).
zh_hans: 修复了在某些区域设置下发生的 ``makemessages`` 崩溃问题 (:ticket:`23271`)。

source: Fixed help text positioning of ``contrib.admin`` fields that use the ``ModelAdmin.filter_horizontal`` and ``filter_vertical`` options (:ticket:`24676`).
id: Diperbaiki penempatan teks bantuan dari bidang ``contrib.admin`` yang menggunakan ``ModelAdmin.filter_horizontal`` dan ``filter_vertical`` options (:ticket:`24676`).
zh_hans: 修复了使用 ``ModelAdmin.filter_horizontal`` 和 ``filter_vertical`` 选项的 ``contrib.admin`` 字段的帮助文本位置问题 (:ticket:`24676`)。

source: Fixed ``AttributeError: function 'GDALAllRegister' not found`` error when initializing ``contrib.gis`` on Windows.
zh_hans: 修复了在 Windows 上初始化 ``contrib.gis`` 时出现的 ``AttributeError: function 'GDALAllRegister' not found`` 错误。

source: Optimizations
id: Optimalisasi
zh_hans: 优化

source: Changed ``ModelState`` to deepcopy fields instead of deconstructing and reconstructing (:ticket:`24591`). This speeds up the rendering of model states and reduces memory usage when running :djadmin:`manage.py migrate <migrate>` (although other changes in this release may negate any performance benefits).
id: Dirubah ``ModelState`` untuk bidang salin dalam daripada dekonstruksi dan rekonstruksi (:ticket:`24591`). Ini mempercepat membangun keadaan model dan mengurangi penggunaan memori ketika menjalankan :djadmin:`manage.py migrate <migrate>` (meskipun perubahan lain di terbitan ini mungkin meniadakan manfaat kinerja apapun).
zh_hans: 将 ``ModelState`` 更改为深拷贝字段，而不是拆解和重构字段 (:ticket:`24591`)。这加速了模型状态的渲染，并在运行 :djadmin:`manage.py migrate <migrate>` 时减少了内存使用（尽管此版本中的其他更改可能会抵消任何性能优势）。

source: Django 1.8.10 release notes
id: Catatan terbitan Django 1.8.10
zh_hans: Django 1.8.10 版本发行说明

source: *March 1, 2016*
id: *1 Maret 2016*
zh_hans: *2016 年 3 月 1 日*

source: Django 1.8.10 fixes two security issues and several bugs in 1.8.9.
id: Django 1.8.10 memperbaiki dua masalah keamanan dan beberapa kesalahan di 1.8.9.
zh_hans: Django 1.8.10 修复了 1.8.9 版本中的两个安全问题和一些错误。

source: CVE-2016-2512: Malicious redirect and possible XSS attack via user-supplied redirect URLs containing basic auth
id: CVE-2016-2512: Pengalihan berbahaya dan kemungkinan serangan XSS melalui URL pengalihan disediakan-pengguna mengandung autentifikasi dasar
zh_hans: CVE-2016-2512 ：通过包含基本身份验证的用户提供的重定向 URL，可能存在恶意重定向和 XSS 攻击。

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()`` and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security check for these redirects (namely ``django.utils.http.is_safe_url()``) considered some URLs with basic authentication credentials "safe" when they shouldn't be.
zh_hans: Django 在某些情况下（例如 ``django.contrib.auth.views.login()`` 和 :doc:`i18n </topics/i18n/index>``）依赖用户输入来将用户重定向到“成功” URL。用于这些重定向的安全检查（即 ``django.utils.http.is_safe_url()``）在考虑到某些具有基本身份验证凭据的 URL 时将其视为“安全”，但它们实际上不应该被视为安全。

source: For example, a URL like ``http://mysite.example.com\@attacker.com`` would be considered safe if the request's host is ``http://mysite.example.com``, but redirecting to this URL sends the user to ``attacker.com``.
id: Sebagai contoh, sebuah URL seperti ``http://mysite.example.com\@attacker.com`` akan dianggap aman jika rumah permintaan adalah ``http://mysite.example.com``, tetapi mengalihkan ke URL ini mengirim pengguna ke ``attacker.com``.
zh_hans: 例如，如果请求的主机是 ``http://mysite.example.com``，那么类似 ``http://mysite.example.com\@attacker.com`` 的 URL 将被视为安全，但重定向到此 URL 会将用户发送到 ``attacker.com``。这是一个潜在的安全风险。

source: CVE-2016-2513: User enumeration through timing difference on password hasher work factor upgrade
id: CVE-2016-2513: Pendaftaran pengguna melalui perbedaan pewaktuan pada peningkatan faktor pekerjaan pengacak sandi
zh_hans: CVE-2016-2513 ：通过密码哈希器工作因子升级的时间差异进行用户枚举。

source: In each major version of Django since 1.6, the default number of iterations for the ``PBKDF2PasswordHasher`` and its subclasses has increased. This improves the security of the password as the speed of hardware increases, however, it also creates a timing difference between a login request for a user with a password encoded in an older number of iterations and login request for a nonexistent user (which runs the default hasher's default number of iterations since Django 1.6).
id: Di setiap versi utama dari Django sejak 1.6, angka awal dari perputaran untuk ``PBKDF2PasswordHasher`` dan subkelasnya telah ditingkatkan. Ini memperbaiki keamanan dari sandi seperti kecepatan dari perangkat keras meningkat, bagaimanapun, itu juga membuat perbedaan pewaktu diantara sebuah permintaan masuk untuk pengguna dengan sandi dikodekan dalam angka terlama dari putaran dan permintaan masuk untuk pengguna yang tidak ada (yang menjalankan nomor default pengacak bawaan untuk putaran sejak Django 1.6).
zh_hans: 自从 Django 1.6 版本以来，``PBKDF2PasswordHasher`` 及其子类的默认迭代次数已经增加。这提高了密码的安全性，因为硬件的速度增加，但它也在登录请求中创建了一个时序差异，对于使用旧迭代次数编码的密码的用户和不存在用户的登录请求（从 Django 1.6 开始运行默认哈希的默认迭代次数）之间存在时序差异。这可能会对安全性产生一定的影响。

source: This only affects users who haven't logged in since the iterations were increased. The first time a user logs in after an iterations increase, their password is updated with the new iterations and there is no longer a timing difference.
id: Ini hanya mempengaruhi pengguna yang tidak masuk sejak perulangan ditingkatkan. Pertama kali pengguna masuk setelah sebuah perputaran meningkat, sandi mereka diperbaharui dengan perputaran baru dan tidak lagi sebuah perbedaan pewaktuan.
zh_hans: 这只影响那些自增加迭代次数以来尚未登录的用户。当用户在迭代次数增加后首次登录时，他们的密码将使用新的迭代次数进行更新，因此不再存在时间差异。

source: The new ``BasePasswordHasher.harden_runtime()`` method allows hashers to bridge the runtime gap between the work factor (e.g. iterations) supplied in existing encoded passwords and the default work factor of the hasher. This method is implemented for ``PBKDF2PasswordHasher`` and ``BCryptPasswordHasher``. The number of rounds for the latter hasher hasn't changed since Django 1.4, but some projects may subclass it and increase the work factor as needed.
id: Metode ``BasePasswordHasher.harden_runtime()`` baru mengizinkan pencampur menjembatani jarak waktu berjalan diantara faktor pekerjaan (sebagai contoh perputaran) disokong dalam sandi dikodekan yang ada dan faktor pekerjaan awal dari pencampur. Cara ini diterapkan untuk ``PBKDF2PasswordHasher`` dan ``BCryptPasswordHasher``. Sejumlah putaran untuk pencampur terakhir belum berubah sejak Django 1.4, tetapi beberapa proyek mungkin mensubkelaskannya dan meningkatkan faktor pekerjaan sesuai kebutuhan.
zh_hans: 新的 ``BasePasswordHasher.harden_runtime()`` 方法允许哈希算法在现有编码密码中提供的工作因素（例如迭代次数）和哈希算法的默认工作因素之间弥合运行时差距。这个方法已经在 ``PBKDF2PasswordHasher`` 和 ``BCryptPasswordHasher`` 中实现。后者的哈希算法自从 Django 1.4 以来并没有改变，但某些项目可能会对其进行子类化，并根据需要增加工作因素。

source: A warning will be emitted for any :ref:`third-party password hashers that don't implement <write-your-own-password-hasher>` a ``harden_runtime()`` method.
id: Sebuah peringatan akan dikeluarkan untuk tiap :ref:`third-party password hashers that don't implement <write-your-own-password-hasher>` sebuah metode ``harden_runtime()``.
zh_hans: 对于任何未实现 ``harden_runtime()`` 方法的 :ref:`第三方密码哈希算法 <write-your-own-password-hasher>`，将发出警告。

source: If you have different password hashes in your database (such as SHA1 hashes from users who haven't logged in since the default hasher switched to PBKDF2 in Django 1.4), the timing difference on a login request for these users may be even greater and this fix doesn't remedy that difference (or any difference when changing hashers). You may be able to :ref:`upgrade those hashes <wrapping-password-hashers>` to prevent a timing attack for that case.
id: Jika anda mempunyai pencampur sandi berbeda di basisdata anda (seperti pencampur SHA1 dari pengguna yang belum masuk sejak pengacak awal diganti ke PBKDF2 in Django 1.4), perbedaan pewaktu pada permintaan masuk untuk pengguna ini mungkin lebih hebat dan perbaikan ini tidak memperbaiki perbedaan itu (atau tiap perbedaan ketika merubah pencampur). Anda dapat :ref:`upgrade those hashes <wrapping-password-hashers>` untuk mencegah serangan pewaktu untuk kasus itu.
zh_hans: 如果在数据库中有不同的密码哈希值（例如，自从 Django 1.4 开始默认哈希算法切换到 PBKDF2 后从未登录过的用户的 SHA1 哈希值），则这些用户的登录请求中的时序差异可能会更大，而此修复不会解决这种差异（或在更改哈希算法时的任何差异）。您可以尝试 :ref:`升级这些哈希值 <wrapping-password-hashers>`，以防止这种情况下的时序攻击。

source: Fixed a crash on PostgreSQL that prevented using ``TIME_ZONE=None`` and ``USE_TZ=False`` (:ticket:`26177`).
id: Diperbaiki sebuah kegagalan pada PostgreSQL yang dicegah menggunakan ``TIME_ZONE=None`` dan ``USE_TZ=False`` (:ticket:`26177`).
zh_hans: 修复了在 PostgreSQL 上的崩溃问题，该问题阻止了使用 ``TIME_ZONE=None`` 和 ``USE_TZ=False`` (:ticket:`26177`)。

source: Added system checks for query name clashes of hidden relationships (:ticket:`26162`).
id: Ditambahkan sistem pemeriksaan untuk meminta tabrakan nama dari hubungan tersembunyi (:ticket:`26162`).
zh_hans: 添加了系统检查来检查隐藏关系的查询名称冲突 (:ticket:`26162`)。

source: Made ``forms.FileField`` and ``utils.translation.lazy_number()`` picklable (:ticket:`26212`).
id: Dibuat dapat di pickle ``forms.FileField`` dan ``utils.translation.lazy_number()`` (:ticket:`26212`).
zh_hans: 使 ``forms.FileField`` 和 ``utils.translation.lazy_number()`` 可以被序列化 (:ticket:`26212`)。

source: Fixed :class:`~django.contrib.postgres.fields.RangeField` and :class:`~django.contrib.postgres.fields.ArrayField` serialization with ``None`` values (:ticket:`26215`).
id: Diperbaiki serialisasi :class:`~django.contrib.postgres.fields.RangeField` dan :class:`~django.contrib.postgres.fields.ArrayField` dengan nilai ``None`` (:ticket:`26215`).
zh_hans: 修复了在使用 ``None`` 值时的 :class:`~django.contrib.postgres.fields.RangeField` 和 :class:`~django.contrib.postgres.fields.ArrayField` 序列化问题 (:ticket:`26215`)。

source: Reallowed dashes in top-level domain names of URLs checked by ``URLValidator`` to fix a regression in Django 1.8 (:ticket:`26204`).
id: Mengizinkan kembali tanda garis di nama ranah tingkat-atas dari URL diperiksa oleh ``URLValidator`` untuk memperbaiki sebuah pemulihan di Django 1.8 (:ticket:`26204`).
zh_hans: 允许了 ``URLValidator`` 检查的 URL 顶级域名中的连字符，以修复 Django 1.8 中的一个回归问题 (:ticket:`26204`)。

source: Fixed ``BoundField`` to reallow slices of subwidgets (:ticket:`26267`).
id: Diperbaiki ``BoundField`` untuk diizinkan kembali potongan-potongan dari subwidget (:ticket:`26267`).
zh_hans: 修复了 ``BoundField`` 以重新允许对子部件进行切片 (:ticket:`26267`)。

source: Prevented ``ContentTypeManager`` instances from sharing their cache (:ticket:`26286`).
id: Dicegah instance ``ContentTypeManager`` dari berbagi cache mereka (:ticket:`26286`).
zh_hans: 防止了 ``ContentTypeManager`` 实例共享其缓存 (:ticket:`26286`)。

source: Django 1.8.11 release notes
id: Catatan terbitan Django 1.8.11
zh_hans: Django 1.8.11 版本发行说明

source: *March 5, 2016*
id: *5 Maret 2016*
zh_hans: *2016 年 3 月 5 日*

source: Django 1.8.11 fixes a regression on Python 2 in the 1.8.10 security release where ``utils.http.is_safe_url()`` crashes on bytestring URLs (:ticket:`26308`).
id: Django 1.8.11 memperbaiki sebuah pemulihan pada Python 2 di terbitan keamanan 1.8.10 dimana ``utils.http.is_safe_url()`` gagal pada URL bytestring (:ticket:`26308`).
zh_hans: Django 1.8.11 修复了在 Python 2 中的 1.8.10 安全版本中的一个回归问题，即 ``utils.http.is_safe_url()`` 在字节串 URL 上崩溃 (:ticket:`26308`)。

source: Django 1.8.12 release notes
id: Catatan terbitan Django 1.8.12
zh_hans: Django 1.8.12 版本发行说明

source: *April 1, 2016*
id: *1 April 2016*
zh_hans: *2016 年 4 月 1 日*

source: Django 1.8.12 fixes several bugs in 1.8.11.
id: Django 1.8.12 memperbaiki beberapa kesalahan di 1.8.11.
zh_hans: Django 1.8.12 修复了 1.8.11 版本中的一些错误。

source: Made ``MultiPartParser`` ignore filenames that normalize to an empty string to fix crash in ``MemoryFileUploadHandler`` on specially crafted user input (:ticket:`26325`).
id: Dibuat ``MultiPartParser`` mengabaikan nama berkas yang menormalkan menjadi sebuah string kosong untuk memperbaiki kegagalan di ``MemoryFileUploadHandler`` di khusus dibuat masukan pengguna (:ticket:`26325`).
zh_hans: 使 ``MultiPartParser`` 忽略将规范化为空字符串的文件名，以修复在特殊构造的用户输入上导致 ``MemoryFileUploadHandler`` 崩溃的问题 (:ticket:`26325`)。

source: Fixed data loss on SQLite where ``DurationField`` values with fractional seconds could be saved as ``None`` (:ticket:`26324`).
id: Diperbaiki kehilangan data di SQLite dimana nilai ``DurationField`` dengan fraksional kedua dapat disimpan sebagai ``None`` (:ticket:`26324`).
zh_hans: 修复了在 SQLite 上的数据丢失问题，其中带有分数秒的 ``DurationField`` 值可能会保存为 ``None`` (:ticket:`26324`)。

source: Restored the functionality of the admin's ``raw_id_fields`` in ``list_editable`` (:ticket:`26387`).
id: Menyimpan kembali kegunaan dari ``raw_id_fields`` admin di ``list_editable`` (:ticket:`26387`).
zh_hans: 恢复了管理员中 ``list_editable`` 中 ``raw_id_fields`` 的功能 (:ticket:`26387`)。

source: Django 1.8.13 release notes
id: Catatan terbitan Django 1.8.13
zh_hans: Django 1.8.13 版本发行说明

source: *May 2, 2016*
id: *2 Mei 2016*
zh_hans: *2016 年 5 月 2 日*

source: Django 1.8.13 fixes several bugs in 1.8.12.
id: Django 1.8.13 memperbaiki beberapa kesalahan di 1.8.12.
zh_hans: Django 1.8.13 修复了 1.8.12 中的一些错误。

source: Fixed ``TimeField`` microseconds round-tripping on MySQL and SQLite (:ticket:`26498`).
id: Diperbaiki perjalanan mikrodetik ``TimeField`` di MySQL dan SQLite (:ticket:`26498`).
zh_hans: 修复了在 MySQL 和 SQLite 上的 ``TimeField`` 微秒往返问题 (:ticket:`26498`)。

source: Restored conversion of an empty string to null when saving values of ``GenericIPAddressField`` on SQLite and MySQL (:ticket:`26557`).
id: Dipulihkan perubahan dari sebuah string kosong menjadi null ketika menyimpan nilai dari ``GenericIPAddressField`` pada SQLite dan MySQL (:ticket:`26557`).
zh_hans: 恢复了在 SQLite 和 MySQL 上保存 ``GenericIPAddressField`` 值时将空字符串转换为 null 的功能 (:ticket:`26557`)。

source: Django 1.8.14 release notes
id: Catatan terbitan Django 1.8.14
zh_hans: Django 1.8.14 版本发行说明

source: *July 18, 2016*
id: *18 Juli 2016*
zh_hans: *2016 年 7 月 18 日*

source: Django 1.8.14 fixes a security issue and a bug in 1.8.13.
id: Django 1.8.14 memperbaiki masalah keamanan dan kesalahan di 1.8.13.
zh_hans: Django 1.8.14 修复了 1.8.13 版本中的一个安全问题和一个错误。

source: XSS in admin's add/change related popup
id: XSS di tambah/rubah admin popup terkait
zh_hans: 管理员的添加/更改相关弹出窗口中存在 XSS 漏洞。

source: Unsafe usage of JavaScript's ``Element.innerHTML`` could result in XSS in the admin's add/change related popup. ``Element.textContent`` is now used to prevent execution of the data.
id: Penggunaan tidak aman dari ``Element.innerHTML`` JavaScript dapat menghasilkan di XSS di tambah/rubah admin popup terkait. `Element.textContent`` adalah sekarang digunakan untuk mencegah pengerjaan dari data.
zh_hans: 不安全地使用 JavaScript 的 ``Element.innerHTML`` 可能会导致在管理员的添加/修改相关弹出窗口中发生 XSS。现在使用 ``Element.textContent`` 来防止数据的执行。

source: The debug view also used ``innerHTML``. Although a security issue wasn't identified there, out of an abundance of caution it's also updated to use ``textContent``.
id: Tampilan mencari kesalahan juga mengunakan ``innerHTML``. meskipu sebuah masalah keamanan belum dicirikan disana, diluar dari kelimpahan dari peringatan itu juga diperbaharui untuk menggunakan ``textContent``.
zh_hans: 调试视图也使用了 ``innerHTML``。尽管在那里没有识别出安全问题，但为了谨慎起见，它也被更新为使用 ``textContent``。

source: Fixed missing ``varchar/text_pattern_ops`` index on ``CharField`` and ``TextField`` respectively when using ``AddField`` on PostgreSQL (:ticket:`26889`).
id: Diperbaiki kehilangan indeks ``varchar/text_pattern_ops`` di ``CharField`` dan ``TextField`` masing-masing ketika menggunakan ``AddField`` di PostgreSQL (:ticket:`26889`).
zh_hans: 在 PostgreSQL 上使用 ``AddField`` 时，修复了 ``CharField`` 和 ``TextField`` 上缺少的 ``varchar/text_pattern_ops`` 索引 (:ticket:`26889`)。

source: Django 1.8.15 release notes
id: Catatan terbitan Django 1.8.15
zh_hans: Django 1.8.15 版本发行说明

source: *September 26, 2016*
id: *26 September 2016*
zh_hans: *2016 年 9 月 26 日*

source: Django 1.8.15 fixes a security issue in 1.8.14.
id: Django 1.8.15 memperbaiki masalah keamanan di 1.8.14.
zh_hans: Django 1.8.15 修复了 1.8.14 版本中的一个安全问题。

source: CSRF protection bypass on a site with Google Analytics
id: Perlindungan CSRF memotong pada sebuah situs dengan Google Analytics
zh_hans: 在使用 Google Analytics 的网站中存在跨站请求伪造（CSRF）保护绕过。

source: An interaction between Google Analytics and Django's cookie parsing could allow an attacker to set arbitrary cookies leading to a bypass of CSRF protection.
id: Sebuah interaksi diantara Google Analytics dan pengurai kue Django dapat mengizinkan seorang penyerang menyetel awalan kue berubah-ubah untuk memotong perlindungan CSRF.
zh_hans: Google Analytics 和 Django 的 cookie 解析之间的交互可能允许攻击者设置任意的 Cookie，从而绕过 CSRF 保护。

source: The parser for ``request.COOKIES`` is simplified to better match the behavior of browsers and to mitigate this attack. ``request.COOKIES`` may now contain cookies that are invalid according to :rfc:`6265` but are possible to set via ``document.cookie``.
id: Pengurai untuk ``request.COOKIES`` disederhanakan untuk lebih baik mencocokkan perilaku dari peramban dan untuk mengurangi serangan ini. ``request.COOKIES`` mungkin sekarang mengandung kue yang tidak sah menurut pada :rfc:`6265` tetapi dimungkinkan mensetel melalui ``document.cookie``.
zh_hans: ``request.COOKIES`` 的解析器被简化，以更好地匹配浏览器的行为并减轻此攻击。``request.COOKIES`` 现在可以包含根据 :rfc:`6265` 无效但可以通过 ``document.cookie`` 设置的 cookie。

source: Django 1.8.16 release notes
id: Catatan terbitan Django 1.8.16
zh_hans: Django 1.8.16 版本发行说明

source: Django 1.8.16 fixes two security issues in 1.8.15.
id: Django 1.8.16 memperbaiki dua masalah keamanan di 1.8.15.
zh_hans: Django 1.8.16 修复了 1.8.15 版本中的两个安全问题。

source: Django 1.8.17 release notes
id: Catatan terbitan Django 1.8.17
zh_hans: Django 1.8.17 版本发行说明

source: Django 1.8.17 fixes a regression in 1.8.16.
id: Django 1.8.17 memperbaiki sebuah pemulihan di 1.8.16.
zh_hans: Django 1.8.17 修复了 1.8.16 版本中的一个回归问题。

source: Django 1.8.18 release notes
id: Catatan terbitan Django 1.8.18
zh_hans: Django 1.8.18 版本发行说明

source: Django 1.8.18 fixes two security issues in 1.8.17.
id: Django 1.8.18 memperbaiki dua masalah keamanan di 1.8.17.
zh_hans: Django 1.8.18 修复了 1.8.17 版本中的两个安全问题。

source: Django 1.8.19 release notes
zh_hans: Django 1.8.19 版本发行说明

source: Django 1.8.19 fixes two security issues in 1.18.18.
zh_hans: Django 1.8.19 修复了 1.8.18 版本中的两个安全问题。

source: The ``django.utils.html.urlize()`` function was extremely slow to evaluate certain inputs due to a catastrophic backtracking vulnerability in a regular expression. The ``urlize()`` function is used to implement the ``urlize`` and ``urlizetrunc`` template filters, which were thus vulnerable.
zh_hans: 由于正则表达式中的灾难性回溯漏洞，``django.utils.html.urlize()`` 函数在评估某些输入时极其缓慢。``urlize()`` 函数用于实现 ``urlize`` 和 ``urlizetrunc`` 模板过滤器，因此它们也容易受到漏洞影响。

source: The problematic regular expression is replaced with parsing logic that behaves similarly.
zh_hans: 有问题的正则表达式被替换为行为类似的解析逻辑。

source: Django 1.8.2 release notes
id: Catatan terbitan Django 1.8.2
zh_hans: Django 1.8.2 版本发行说明

source: *May 20, 2015*
id: *20 Mei 2015*
zh_hans: *2015 年 5 月 20 日*

source: Django 1.8.2 fixes a security issue and several bugs in 1.8.1.
id: Django 1.8.2 memperbaiki masalah keamanan dan beberapa kesalahan di 1.8.1.
zh_hans: Django 1.8.2 修复了 1.8.1 中的一个安全问题和几个错误。

source: Fixed session flushing in the ``cached_db`` backend
id: Diperbaiki pembilasan sesi di backend ``cached_db``
zh_hans: 修复了 ``cached_db`` 后端中的会话刷新问题

source: A change to ``session.flush()`` in the ``cached_db`` session backend in Django 1.8 mistakenly sets the session key to an empty string rather than ``None``. An empty string is treated as a valid session key and the session cookie is set accordingly. Any users with an empty string in their session cookie will use the same session store. ``session.flush()`` is called by ``django.contrib.auth.logout()`` and, more seriously, by ``django.contrib.auth.login()`` when a user switches accounts. If a user is logged in and logs in again to a different account (without logging out) the session is flushed to avoid reuse. After the session is flushed (and its session key becomes ``''``) the account details are set on the session and the session is saved. Any users with an empty string in their session cookie will now be logged into that account.
id: Sebuah perubahan pada ``session.flush()`` di backend sesi ``cached_db`` di Django 1.8 salah menyetel kunci sesi ke sebuah string kosong daripada ``None``. Sebuah string kosong diperlakukan sebagai kunci sesi sah dan kue sesi disetel sesuai dengan itu. Pengguna aapapun dengan sebuah string kosong di kue sesi mereka akan menggunakan penyimpanan sesi sama. ``session.flush()`` dipanggil oleh ``django.contrib.auth.logout()`` dan, lebih serius, dengan ``django.contrib.auth.login()`` ketika seorang pengguna mengganti akun. Jika seorang pengguna masuk dan masuk kembali ke akun berbeda (tanpa keluar) sesi dibilas untuk menghindari penggunaan kembali. Setela sesi dibilas (dan kunci sesinya menjadi ``''``) rincian akun disetel pada sesi dan sesi disimpan. Pengguna apapun dengan sebuah string kosong di kue sesi mereka akan sekarang masuk ke akun itu.
zh_hans: Django 1.8 中对于 ``cached_db`` 会话后端中的 ``session.flush()`` 的更改错误地将会话键设置为空字符串而不是 ``None``。空字符串被视为有效的会话键，并且会相应地设置会话 cookie。任何在其会话 cookie 中具有空字符串的用户都将使用相同的会话存储。``session.flush()`` 被 ``django.contrib.auth.logout()`` 调用，并且更严重的是，当用户切换帐户时也会被 ``django.contrib.auth.login()`` 调用。如果用户已登录并且再次登录到不同的帐户（而不注销），则会刷新会话以避免重复使用。在会话被刷新后（其会话键变为 ``''``），帐户详细信息会设置在会话中，并且会话会被保存。任何在其会话 cookie 中具有空字符串的用户现在将登录到该帐户。
