Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The :class:`~django.forms.PasswordInput` form widget, intended for use with form fields which represent passwords, accepts a boolean keyword argument ``render_value`` indicating whether to send its data back to the browser when displaying a submitted form with errors. Prior to Django 1.3, this argument defaulted to ``True``, meaning that the submitted password would be sent back to the browser as part of the form. Developers who wished to add a bit of additional security by excluding that value from the redisplayed form could instantiate a :class:`~django.forms.PasswordInput` passing ``render_value=False`` .
id: Widget formulir :class:`~django.forms.PasswordInput`, dimaksudkan untuk digunakan dengan bidang formulir yang mewakili sandi, menerima argumen kata kunci boolean ``render_value`` menandakan apakah untuk mengirim datanya kembali ke peramban ketika menampilkan formulir yang diajukan dengan kesalahan. Sebelum pada Django 1.3, argumen ini diawalkan ke ``True``, berarti bahwa sandi diajukan harus dikirim kembali ke peramban sebagai bagian dari formulir. Pengembang yang berharap menambahkan sedikit keamanan tambahan dengan mengecualikan nilai itu dari formulir ditampilkan kembali dapat membuat instance :class:`~django.forms.PasswordInput`melewatkan ``render_value=False`` .+
zh_hans: :class:`~django.forms.PasswordInput` 表单小部件，用于表示密码的表单字段，接受一个布尔关键字参数 ``render_value``，指示在显示带有错误的提交表单时是否将其数据发送回浏览器。在 Django 1.3 之前，这个参数的默认值是 ``True``，这意味着提交的密码将作为表单的一部分发送回浏览器。希望通过将该值从重新显示的表单中排除以增加一些额外安全性的开发人员可以实例化一个 :class:`~django.forms.PasswordInput` 并传递 ``render_value=False``。

source: Due to the sensitive nature of passwords, however, Django 1.3 takes this step automatically; the default value of ``render_value`` is now ``False``, and developers who want the password value returned to the browser on a submission with errors (the previous behavior) must now explicitly indicate this. For example::
id: Dikarenakan sensitif alamiah dari sandi, bagaimanapun, Django 1.3 mengambil langkah ini secara otomatis; nilai awalan dari ``render_value`` sekarang ``False``, dan pengembang yang ingin nilai sandi dikembalikan ke peramban pada pengajuan dengan kesalahan (perilaku sebelumnya) harus secara tegas menunjukkan ini. Sebagai contoh::
zh_hans: 然而，由于密码的敏感性质，Django 1.3 现在会自动采取这一步骤；``render_value`` 的默认值现在为 ``False``，希望在出现错误的情况下将密码值返回到浏览器的开发人员（以前的行为）现在必须明确指出这一点。例如：

source: Clearable default widget for FileField
id: Dapat dibersihkan widget awalan untuk FileField
zh_hans: FileField 的可清除默认小部件

source: Django 1.3 now includes a :class:`~django.forms.ClearableFileInput` form widget in addition to :class:`~django.forms.FileInput`. ``ClearableFileInput`` renders with a checkbox to clear the field's value (if the field has a value and is not required); ``FileInput`` provided no means for clearing an existing file from a ``FileField``.
id: Django 1.3 sekarang menyertakan sebuah widget formulir :class:`~django.forms.ClearableFileInput` sebagai tambahan pada :class:`~django.forms.FileInput`. ``ClearableFileInput`` dibangun dengan kotak centang untuk membersihkan nilai bidang (jika bidang mempunyai nilai dan tidak wajib), menyediakan tidak ada arti untuk membersihkan berkas yang ada dari ``FileField``.
zh_hans: Django 1.3 现在除了 :class:`~django.forms.FileInput` 外还包括一个 :class:`~django.forms.ClearableFileInput` 表单小部件。``ClearableFileInput`` 渲染时包含一个清除字段值的复选框（如果字段有值且不是必需的）；而 ``FileInput`` 无法清除 ``FileField`` 中的现有文件。

source: ``ClearableFileInput`` is now the default widget for a ``FileField``, so existing forms including ``FileField`` without assigning a custom widget will need to account for the possible extra checkbox in the rendered form output.
id: ``ClearableFileInput`` sekarang widget awalan untuk sebuah ``FileField``, jadi formulir yang ada termasuk ``FileField`` tanpa memberikan widget penyesuaian akan butuh dipertanggungjawabkan untuk kemungkinan kotan centang tambahan di formulir keluaran yang dibangun.
zh_hans: ``ClearableFileInput`` 现在是 ``FileField`` 的默认小部件，因此包含 ``FileField`` 的现有表单如果没有分配自定义小部件，需要考虑在渲染的表单输出中可能会出现额外的复选框。

source: To return to the previous rendering (without the ability to clear the ``FileField``), use the ``FileInput`` widget in place of ``ClearableFileInput``. For instance, in a ``ModelForm`` for a hypothetical ``Document`` model with a ``FileField`` named ``document``::
id: Untuk kembali ke pembangunan sebelumnya (tanpa kemampuan membersihkan ``FileField``), gunakan widget ``FileInput`` di tempat dari ``ClearableFileInput``. Sebagai contoh, di ``ModelForm`` untuk hipotesis model ``Document`` dengan sebuah ``FileField`` bernama ``document``::
zh_hans: 要返回到以前的渲染方式（不具备清除 ``FileField`` 的能力），可以在 ``ClearableFileInput`` 的位置使用 ``FileInput`` 小部件。例如，在假设有一个名为 ``document`` 的 ``FileField`` 的假设 ``Document`` 模型的 ``ModelForm`` 中：

source: New index on database session table
id: Indeks baru pada tabel sesi basisdata
zh_hans: 数据库会话表上的新索引

source: Prior to Django 1.3, the database table used by the database backend for the :doc:`sessions </topics/http/sessions>` app had no index on the ``expire_date`` column. As a result, date-based queries on the session table -- such as the query that is needed to purge old sessions -- would be very slow if there were lots of sessions.
id: Sebelum pada Django 1.3, tabel basisdata digunakan oleh backend basisdata untuk :doc:`sessions </topics/http/sessions>` aplikasi tidak mempunyai indeks pada kolom ``expire_date``. Sebagai hasil, permintaan berdasarkan-tanggal pada tabel sesi -- seperti permintaan yang dibutuhkan untuk membersihkan sesi lama- akan menjadi sangat lambat jika ada banyak sesi.
zh_hans: 在 Django 1.3 之前，数据库后端用于 :doc:`sessions </topics/http/sessions>` 应用的数据库表上没有对 ``expire_date`` 列创建索引。因此，如果有大量会话，对会话表的日期查询（例如清除旧会话所需的查询）会非常慢。

source: If you have an existing project that is using the database session backend, you don't have to do anything to accommodate this change. However, you may get a significant performance boost if you manually add the new index to the session table. The SQL that will add the index can be found by running the ``sqlindexes`` admin command:
zh_hans: 如果您有一个已经在使用数据库会话后端的现有项目，您无需采取任何措施来适应此更改。但是，如果您手动将新索引添加到会话表中，可能会显著提高性能。可以通过运行 ``sqlindexes`` 管理命令来找到添加索引的 SQL：

source: No more naughty words
id: Tidak ada lagi kata nakal
zh_hans: 不再有不雅词汇

source: Django has historically provided (and enforced) a list of profanities. The comments app has enforced this list of profanities, preventing people from submitting comments that contained one of those profanities.
id: Django mempunyai riwayat disediakan (dan dipaksakan) daftar dari kata-kata kotor. Aplikasi komentar mempunyai daftar memaksa daftar ini dari kata-kata kotor, mencegah orang dari mengajukan komentar yang mengandung satu dari kata-kata kotor tersebut.
zh_hans: Django 历史上提供了（并执行了）一份不雅词汇列表。评论应用程序已经执行了这个不雅词汇列表，防止人们提交包含这些不雅词汇之一的评论。

source: Unfortunately, the technique used to implement this profanities list was woefully naive, and prone to the `Scunthorpe problem`_. Improving the built-in filter to fix this problem would require significant effort, and since natural language processing isn't the normal domain of a web framework, we have "fixed" the problem by making the list of prohibited words an empty list.
id: Sayangnya, teknik digunakan untuk menerapkan daftar carut marut ini menyedihkan dibuat-buat, dan cenderung pada `Scunthorpe problem`_. Meningkatkan saringan siap-pakai untuk memperbaiki masalah ini akan membutuhkan usaha yang signifikan, dan sejak bahasa alam mengolah bukan ranah biasa dari kerangka kerja jaringan, kami telah "memperbaiki" masalah dengan membuat daftar dari daftar kosong kata-kata terlarang.
zh_hans: 不幸的是，用于实现这个粗话列表的技术非常天真，并容易受到 `斯肯索普问题`_ 的影响。要改进内置的过滤器以解决这个问题需要很大的努力，而且由于自然语言处理不是一个 Web 框架的正常领域，我们通过将禁止使用的单词列表设置为空来“解决”了这个问题。

source: If you want to restore the old behavior, simply put a ``PROFANITIES_LIST`` setting in your settings file that includes the words that you want to prohibit (see the :commit:`commit that implemented this change <edd767d2612d891a906268cf590571f541dd164f>` if you want to see the list of words that was historically prohibited). However, if avoiding profanities is important to you, you would be well advised to seek out a better, less naive approach to the problem.
zh_hans: 如果您想恢复旧的行为，只需在您的设置文件中设置一个包含您要禁止的单词的 ``PROFANITIES_LIST`` 设置（如果您想查看历史上被禁止的单词列表，请参考 :commit:`实施这个更改的提交 <edd767d2612d891a906268cf590571f541dd164f>`）。然而，如果避免粗话对您很重要，建议您寻找一个更好、不那么天真的解决方法来解决这个问题。

source: Localflavor changes
id: Perubahan rasa lokal
zh_hans: Localflavor 更改

source: Django 1.3 introduces the following backwards-incompatible changes to local flavors:
id: Django 1.3 memperkenalkan perubahan bertentangan kebelakang berikut ke rasa lokal:
zh_hans: Django 1.3 引入了以下对本地风格的向后不兼容的更改：

source: Canada (ca) -- The province "Newfoundland and Labrador" has had its province code updated to "NL", rather than the older "NF". In addition, the Yukon Territory has had its province code corrected to "YT", instead of "YK".
id: Canada (ca) -- Propinsi "Newfoundland and Labrador" telah mempunyai kode propinsinya diperbaharui menjadi "NL", daripada yang lama "NF". Sebagai tambahan, Yukon Territory telah mempunyai kode propinsinya diralat menjadi "YT", daripada "YK".
zh_hans: 加拿大（ca）- 省份“纽芬兰与拉布拉多”已将其省份代码更新为“NL”，而不是较旧的“NF”。此外，育空地区的省份代码已更正为“YT”，而不是“YK”。

source: Indonesia (id) -- The province "Nanggroe Aceh Darussalam (NAD)" has been removed from the province list in favor of the new official designation "Aceh (ACE)".
id: Indonesia (id) -- Propinsi "Nanggroe Aceh Darussalam (NAD)" telah dipindahkan dari daftar propinsi dalam mendukung dari penyebutan resmi baru "Aceh (ACE)".
zh_hans: 印度尼西亚（id）- 省份“ Nanggroe Aceh Darussalam (NAD)”已从省份列表中移除，转而使用新的官方名称“ Aceh (ACE)”。

source: United States of America (us) -- The list of "states" used by ``USStateField`` has expanded to include Armed Forces postal codes. This is backwards-incompatible if you were relying on ``USStateField`` not including them.
id: United States of America (us) -- Daftar dari "states" digunakan oleh ``USStateField`` telah diperluas untuk menyertakan kode pos Pasukan Bersenjata. Ini adakah bertentangan kebelakang jika anda bergantung pada ``USStateField`` tidak menyertakan mereka.
zh_hans: 美利坚合众国（us）-- 由 ``USStateField`` 使用的“州”列表已扩展，包括了武装部队的邮政编码。如果您依赖于 ``USStateField`` 不包括它们，这将是不兼容的。

source: FormSet updates
id: Perbaharuan FormSet
zh_hans: FormSet 更新

source: In Django 1.3 ``FormSet`` creation behavior is modified slightly. Historically the class didn't make a distinction between not being passed data and being passed empty dictionary. This was inconsistent with behavior in other parts of the framework. Starting with 1.3 if you pass in empty dictionary the ``FormSet`` will raise a ``ValidationError``.
id: Di Django 1.3 perilaku pembuatan ``FormSet`` adalah merubah sedikit. Secara riwayat kelas tidak membuat perbedaan diantara data tidak sedang dilewatkan dan sedang dilewatkan kamus kosong. Ini adalah tidak konsisten dengan perilaku di bagian lain dari kerangka kerja. Dimulai dengan 1.3 jika anda melewatkan di kamus kosong ``FormSet`` akan memunculkan sebuah ``ValidationError``.
zh_hans: 在 Django 1.3 中，``FormSet`` 的创建行为略有修改。在历史上，该类没有区分未传递数据和传递空字典之间的区别。这与框架的其他部分的行为不一致。从1.3版本开始，如果传递空字典，``FormSet`` 将引发 ``ValidationError``。

source: For example with a ``FormSet``:
zh_hans: 例如，使用一个 ``FormSet``：

source: the following code will raise a ``ValidationError``:
zh_hans: 以下代码将引发 ``ValidationError``：

source: if you need to instantiate an empty ``FormSet``, don't pass in the data or use ``None``:
zh_hans: 如果需要实例化一个空的 ``FormSet``，不要传递数据或使用 ``None``：

source: Callables in templates
id: Callable di cetakan
zh_hans: 模板中的可调用对象

source: Previously, a callable in a template would only be called automatically as part of the variable resolution process if it was retrieved via attribute lookup. This was an inconsistency that could result in confusing and unhelpful behavior:
zh_hans: 以前，在模板中的可调用对象只有在通过属性查找检索时才会作为变量解析过程的一部分自动调用。这是一个不一致的地方，可能导致令人困惑和无益的行为：

source: This has been resolved in Django 1.3 - the result in both cases will be ``u'Joe Bloggs'``. Although the previous behavior was not useful for a template language designed for web designers, and was never deliberately supported, it is possible that some templates may be broken by this change.
id: Itu telah di selesaikan di Django 1.3 - hasil di kedua kasus akan menjadi ``u'Joe Bloggs'``. meskipun perilaku sebelumnya tidak berguna untuk bahasa cetakandirancang untuk perancang jaringan, dan tidak pernah sengaja didukung, itu memungkinkan bahwa beberapa cetakan mungkin rusak oleh perubahan ini.
zh_hans: 这在 Django 1.3 中已经解决了 - 在这两种情况下的结果都将是 ``u'Joe Bloggs'``。尽管先前的行为对于为网页设计师设计的模板语言来说并不实用，也从未有意支持，但有可能一些模板可能会因此更改而中断。

source: Changed priority of translation loading
id: Dirubah prioritas dari memuat terjemahan
zh_hans: 改变了翻译加载的优先级

source: Work has been done to simplify, rationalize and properly document the algorithm used by Django at runtime to build translations from the different translations found on disk, namely:
id: Pekerjaan telah diselesaikan untuk memudahkan, merasionalisasi dan algoritma dokumentasi yang sesuai digunakan oleh Django pada saat berjalan untuk membangun terjemahan dari terjemahan berbeda ditemukan di cakram, bernama:
zh_hans: 已经进行了工作，以简化、合理化并正确记录 Django 在运行时用于从磁盘上找到的不同翻译中构建翻译的算法，即：

source: For translatable literals found in Python code and templates (``'django'`` gettext domain):
id: Untuk harfiah dapat diterjemahkan ditemukan di kode Python dan cetakan (ranah gettext ``'django'``)
zh_hans: 对于在 Python 代码和模板中找到的可翻译字面值（``'django'`` gettext 域）：

source: Priorities of translations included with applications listed in the :setting:`INSTALLED_APPS` setting were changed. To provide a behavior consistent with other parts of Django that also use such setting (templates, etc.) now, when building the translation that will be made available, the apps listed first have higher precedence than the ones listed later.
id: Keutamaan dari terjemahan disertakan dengan aplikasi terdaftar di pengaturan :setting:`INSTALLED_APPS` telah berubah. Untuk menyediakan sebuah perilaku yang tetap dengan bagian lain dari Django yang juga menggunakan pengaturan seperti itu (cetakan, dll) sekarang, ketika membangun terjemahan yang akan dibuat tersedia, aplikasi terdaftar pertama mempunyai hak lebih tinggi daripada satu terdaftar kemudian.
zh_hans: 在 :setting:`INSTALLED_APPS` 设置中列出的应用程序包含的翻译的优先级发生了变化。为了与 Django 的其他部分（例如模板等）使用的类似设置行为保持一致，现在在构建将要提供的翻译时，首先列出的应用程序比后面列出的应用程序具有更高的优先级。

source: Now it is possible to override the translations shipped with applications by using the :setting:`LOCALE_PATHS` setting whose translations have now higher precedence than the translations of :setting:`INSTALLED_APPS` applications. The relative priority among the values listed in this setting has also been modified so the paths listed first have higher precedence than the ones listed later.
id: Sekarang itu dimungkinkan menimpa terjemahan dibekali dengan aplikasi dengan menggunakan pengaturan :setting:`LOCALE_PATHS` yang terjemahannya sekarang didahulukan lebih tinggi daripada terjemahan dari aplikasi :setting:`INSTALLED_APPS`. Prioritas relatif diantara nilai-nilai terdaftar di pengaturan ini juga telah dirubah jadi jalur terdaftar dahulu mempunyai didahulukan lebih tinggi dari satu didaftar kemudian.
zh_hans: 现在可以使用 :setting:`LOCALE_PATHS` 设置来覆盖应用程序中附带的翻译，这些翻译的优先级高于 :setting:`INSTALLED_APPS` 应用程序的翻译。此设置中列出的值之间的相对优先级也已经修改，因此首先列出的路径比后面列出的路径具有更高的优先级。

source: The ``locale`` subdirectory of the directory containing the settings, that usually coincides with and is known as the *project directory* is being deprecated in this release as a source of translations. (the precedence of these translations is intermediate between applications and :setting:`LOCALE_PATHS` translations). See the `corresponding deprecated features section`_ of this document.
id: Subdirektori ``locale`` dari direktori mengandung pengaturan, yang biasanya bertepatan dengan dan dikenal sebagai *direktori proyek* sedang diusangkan di terbitan ini sebagai sebuah sumber dari terjemahan. (Yang didahulukan dari terjemahan ini adalah pertengahan diantara aplikasi dan terjemahan :setting:`LOCALE_PATHS`). Lihat `corresponding deprecated features section`_dari dokumen ini.
zh_hans: 在这个版本中，包含设置的目录的 ``locale`` 子目录，通常与项目目录重合并被称为 *项目目录*，被弃用为翻译的来源。（这些翻译的优先级介于应用程序和 :setting:`LOCALE_PATHS` 翻译之间）。请参阅本文档的 `相应弃用功能部分`_。

source: For translatable literals found in JavaScript code (``'djangojs'`` gettext domain):
id: Untuk terjemahan harfiah ditemukan di kode JavaScript (ranah gettext ``'djangojs'``):
zh_hans: 对于在 JavaScript 代码中找到的可翻译字面值（``'djangojs'`` gettext 域）：

source: Similarly to the ``'django'`` domain translations: Overriding of translations shipped with applications by using the :setting:`LOCALE_PATHS` setting is now possible for this domain too. These translations have higher precedence than the translations of Python packages passed to the ``javascript_catalog()`` view. Paths listed first have higher precedence than the ones listed later.
id: Mirip pada terjemahan ranah ``'django'``: Menimpa terjemahan dikirim dengan aplikasi menggunakan pengaturan :setting:`LOCALE_PATHS` sekarang memungkinkan untuk ranah ini juga. Terjemahan-terjemahan ini memiliki hak lebih tinggi daripada terjemahan dari paket-paket Python dilewatkan ke tampilan ``javascript_catalog()``. Jalur-jalur ditampilkan mempunyai hak lebih tinggi daripada satu yang ditampilkan kemudian.
zh_hans: 与 ``'django'`` 域的翻译类似：现在也可以使用 :setting:`LOCALE_PATHS` 设置来覆盖应用程序中附带的 JavaScript 代码的翻译。这些翻译的优先级高于传递给 ``javascript_catalog()`` 视图的 Python 包的翻译。首先列出的路径比后面列出的路径具有更高的优先级。

source: Translations under the ``locale`` subdirectory of the *project directory* have never been taken in account for JavaScript translations and remain in the same situation considering the deprecation of such location.
id: Terjemahan dibawah subdirektori ``locale`` dari *direktori proyek* belum pernah diperhitungkan untuk terjemahan JavaScript dan tetap di keadaan sama mempertimbangkan pengusangan untuk tempat tersebut.
zh_hans: 位于 *项目目录* 的 ``locale`` 子目录下的 JavaScript 翻译从未被考虑过，考虑到这个位置的弃用，它们将保持不变。

source: Transaction management
id: Pengelolaan transaksi
zh_hans: 事务管理

source: When using managed transactions -- that is, anything but the default autocommit mode -- it is important when a transaction is marked as "dirty". Dirty transactions are committed by the ``commit_on_success`` decorator or the ``django.middleware.transaction.TransactionMiddleware``, and ``commit_manually`` forces them to be closed explicitly; clean transactions "get a pass", which means they are usually rolled back at the end of a request when the connection is closed.
id: Ketika menggunakan transaksi dapat dikelola -- yaitu, apapun tetapi suasana autocommit awalan -- adalah terpenting ketika transaksi ditandai sebagai "dirty". Transaksi dirty diperbaiki oleh penghias ``commit_on_success`` atau ``django.middleware.transaction.TransactionMiddleware``, dan ``commit_manually`` memaksa mereka untuk ditutup secara eksplisit; membersihkan transaksi "get a pass", yang berarti mereka biasanya membatalkan transaksi pada akhir dari permintaan ketika hubungan ditutup.
zh_hans: 在使用托管事务时 -- 也就是说，除了默认的自动提交模式之外的任何情况 -- 当一个事务被标记为“脏”时非常重要。脏事务将由 ``commit_on_success`` 装饰器或 ``django.middleware.transaction.TransactionMiddleware`` 提交，并且 ``commit_manually`` 强制将它们明确关闭；干净的事务“得到允许”，这意味着它们通常在请求结束时在连接关闭时回滚。

source: Until Django 1.3, transactions were only marked dirty when Django was aware of a modifying operation performed in them; that is, either some model was saved, some bulk update or delete was performed, or the user explicitly called ``transaction.set_dirty()``. In Django 1.3, a transaction is marked dirty when *any* database operation is performed.
id: Sampai Django 1.3, transaksi hanya ditandai dengan kotor ketika Django telah menyadari dari merubah tindakan yang dilakukan di mereka; yaitu baik beberapa model telah disimpan, beberapa perbaharuan dalam jumlah besar atau hapus telah dilakukan, atau pengguna secara eksplisit memanggil ``transaction.set_dirty()``. Di Django 1.3, sebuah transaksi ditandai kotor ketika *tiap* tindakan basisdata dilakukan.
zh_hans: 在 Django 1.3 之前，只有在 Django 察觉到在事务中执行了修改操作时，事务才会被标记为脏事务；也就是说，要么保存了某个模型，要么执行了某个批量更新或删除操作，要么用户显式调用了 ``transaction.set_dirty()``。在 Django 1.3 中，只要执行了 *任何* 数据库操作，事务就会被标记为脏事务。

source: As a result of this change, you no longer need to set a transaction dirty explicitly when you execute raw SQL or use a data-modifying ``SELECT``. However, you *do* need to explicitly close any read-only transactions that are being managed using ``commit_manually()``. For example::
id: Sebagai hasil dari perubahan ini, anda tidak lagi butuh menyetel transaksi kotor secara eksplisit ketika anda menjalankan SQL mentah atau menggunakan data-merubah ``SELECT``. Bagaimanapun, anda *lakukan* perlu secara eksplisit menutup tiap transaksi hanya-baca yang sedang diatur menggunakan ``commit_manually()``. Sebagai contoh::
zh_hans: 由于这个改变，当执行原始 SQL 或使用修改数据的 ``SELECT`` 时，您不再需要显式设置事务为脏事务。然而，您需要显式关闭任何使用 ``commit_manually()`` 管理的只读事务。例如：

source: Prior to Django 1.3, this would work without error. However, under Django 1.3, this will raise a :class:`~django.db.transaction.TransactionManagementError` because the read operation that retrieves the ``MyObject`` instance leaves the transaction in a dirty state.
id: Sebelum Django 1.3, ini akan bekerja tanpa kesalahan. Bagaimanapun, dibawah Django 1.3, ini akan memunculkan sebuah :class:`~django.db.transaction.TransactionManagementError` karena tindakan membaca yang mengambil instance ``MyObject`` meninggalkan transaksi dalam keadaan kotor.
zh_hans: 在 Django 1.3 之前，这将不会出错。然而，在 Django 1.3 下，这将引发一个 :class:`~django.db.transaction.TransactionManagementError`，因为检索 ``MyObject`` 实例的读操作将事务留在了脏状态。

source: No password reset for inactive users
id: Tidak ada penyetelan kembali sandi untuk pengguna tidak aktif
zh_hans: 不允许非活跃用户重置密码

source: Prior to Django 1.3, inactive users were able to request a password reset email and reset their password. In Django 1.3 inactive users will receive the same message as a nonexistent account.
id: Sebelum Django 1.3, pengguna tidak aktif dapat meminta surel setel kembali sandi dan menyetel kembali sandi mereka. Di Django 1.3 pengguna tidak aktif akan menerima pesan sama sebagai sebuah akun yang tdak ada.
zh_hans: 在 Django 1.3 之前，非活跃用户可以请求发送密码重置邮件并重置密码。而在 Django 1.3 中，非活跃用户将收到与不存在的帐户相同的消息。

source: Password reset view now accepts ``from_email``
id: Tampilan penyetelan ulang sandi sekarang menerima ``from_email``
zh_hans: 密码重置视图现在接受 ``from_email`` 参数。

source: The ``django.contrib.auth.views.password_reset()`` view now accepts a ``from_email`` parameter, which is passed to the ``password_reset_form``’s ``save()`` method as a keyword argument. If you are using this view with a custom password reset form, then you will need to ensure your form's ``save()`` method accepts this keyword argument.
zh_hans: ``django.contrib.auth.views.password_reset()`` 视图现在接受一个 ``from_email`` 参数，该参数将作为关键字参数传递给 ``password_reset_form`` 的 ``save()`` 方法。如果您正在使用自定义密码重置表单与此视图，则需要确保您表单的 ``save()`` 方法接受这个关键字参数。

source: Features deprecated in 1.3
id: Fitur usang di 1.3
zh_hans: 在 1.3 中被废弃的功能

source: Django 1.3 deprecates some features from earlier releases. These features are still supported, but will be gradually phased out over the next few release cycles.
id: Django 1.3 mengusangkan beberapa fitur dari terbitan lebih awal. Fitur-fitur ini masih didukung, tetapi akan bertahapdihapus terhadap siklus terbitan selanjutnya.
zh_hans: Django 1.3 弃用了一些早期版本的功能。这些功能仍然受支持，但将在接下来的几个发布周期内逐步淘汰。
