Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Reverse foreign keys from proxy models are now propagated to their concrete class. The reverse relation attached by a :class:`~django.db.models.ForeignKey` pointing to a proxy model is now accessible as a descriptor on the proxied model class and may be referenced in queryset filtering.
id: Membalikkan foreign key dari model proxy sekarang diperbanyak ke wujud kelas mereka. Membalikkan hubungan dilampirkan oleh :class:`~django.db.models.ForeignKey` menunjuk ke model proxy sekarang tersedia sebagai penjelasan pada kelas model yang di proxy kan dan mungkin diacukan di penyaring queryset.
zh_hans: 来自代理模型的反向外键现在会传播到它们的具体类。指向代理模型的 :class:`~django.db.models.ForeignKey` 所附加的反向关系现在可以作为描述符在代理模型类上访问，并且可以在查询集过滤中引用。

source: The new :meth:`Field.rel_db_type() <django.db.models.Field.rel_db_type>` method returns the database column data type for fields such as ``ForeignKey`` and ``OneToOneField`` that point to another field.
id: Metode :meth:`Field.rel_db_type() <django.db.models.Field.rel_db_type>` baru mengembalikan jenis data basisdata untuk bidang seperti ``ForeignKey`` dan ``OneToOneField`` yang menunjuk ke bidang lain.
zh_hans: 新的 :meth:`Field.rel_db_type() <django.db.models.Field.rel_db_type>` 方法返回了诸如 ``ForeignKey`` 和 ``OneToOneField`` 这样指向另一个字段的字段的数据库列数据类型。

source: The :attr:`~django.db.models.Func.arity` class attribute is added to :class:`~django.db.models.Func`. This attribute can be used to set the number of arguments the function accepts.
id: Atribut kelas :attr:`~django.db.models.Func.arity` ditambahkan ke :class:`~django.db.models.Func`. Atribut ini dapat digunakan untuk menyetel sejumlah argumen fungis penerimaan.
zh_hans: :class:`~django.db.models.Func` 添加了 :attr:`~django.db.models.Func.arity` 类属性。此属性可用于设置函数接受的参数数量。

source: Added :class:`~django.db.models.BigAutoField` which acts much like an :class:`~django.db.models.AutoField` except that it is guaranteed to fit numbers from ``1`` to ``9223372036854775807``.
id: Ditambahkan :class:`~django.db.models.BigAutoField` yang bertindak seperti sebuah pengecualian :class:`~django.db.models.AutoField` yang di jaminkan untuk mencocokkan angka dari ``1`` sampai ``9223372036854775807``.
zh_hans: 新增了 :class:`~django.db.models.BigAutoField`，它的行为类似于 :class:`~django.db.models.AutoField`，但它保证适合于范围从 ``1`` 到 ``9223372036854775807`` 的数字。

source: :meth:`QuerySet.in_bulk() <django.db.models.query.QuerySet.in_bulk>` may be called without any arguments to return all objects in the queryset.
id: :meth:`QuerySet.in_bulk() <django.db.models.query.QuerySet.in_bulk>` mungkin dipanggil tanpa argumen apapun untuk mengembalikan semua obyek di queryset.
zh_hans: 可以不带任何参数调用 :meth:`QuerySet.in_bulk() <django.db.models.query.QuerySet.in_bulk>`，以返回查询集中的所有对象。

source: :attr:`~django.db.models.ForeignKey.related_query_name` now supports app label and class interpolation using the ``'%(app_label)s'`` and ``'%(class)s'`` strings.
id: :attr:`~django.db.models.ForeignKey.related_query_name` sekarang mendukung label aplikasi dan penyisipan kelas menggunakan deretan karakter ``'%(app_label)s'`` dan ``'%(class)s'``.
zh_hans: :attr:`~django.db.models.ForeignKey.related_query_name` 现在支持使用 ``'%(app_label)s'`` 和 ``'%(class)s'`` 字符串进行应用标签和类的插值。

source: Allowed overriding model fields inherited from abstract base classes.
id: Diizinkan mengutamakan bidang model diwariskan dari kelas-kelas berdasarkan abstrak.
zh_hans: 允许覆盖从抽象基类继承的模型字段。

source: The :func:`~django.db.models.prefetch_related_objects` function is now a public API.
id: Fungsi :func:`~django.db.models.prefetch_related_objects` sekarang APU umum.
zh_hans: :func:`~django.db.models.prefetch_related_objects` 函数现在是一个公共 API。

source: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` sets the primary key on objects when using PostgreSQL.
id: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` menyetel primary key pada obyek ketika menggunakan PostgreSQL.
zh_hans: :meth:`QuerySet.bulk_create() <django.db.models.query.QuerySet.bulk_create>` 在使用 PostgreSQL 时会设置对象的主键。

source: Added the :class:`~django.db.models.functions.Cast` database function.
id: Ditambahkan fungsi basisdata :class:`~django.db.models.functions.Cast`.
zh_hans: 新增了 :class:`~django.db.models.functions.Cast` 数据库函数。

source: A proxy model may now inherit multiple proxy models that share a common non-abstract parent class.
id: Sebuah model proxy mungkin sekarang mewarisi banyak model proxy yang berbagi kelas induk bukan-abstrak umum.
zh_hans: 现在，代理模型可以继承多个共享非抽象父类的代理模型。

source: Added :class:`~django.db.models.functions.Extract` functions to extract datetime components as integers, such as year and hour.
id: Ditambahkan fungsi-fungsi :class:`~django.db.models.functions.Extract` untuk mengambil komponen-komponen datetime sebagai integer, seperti tahun dan jam.
zh_hans: 新增了 :class:`~django.db.models.functions.Extract` 函数，用于提取日期时间组件作为整数，例如年份和小时。

source: Added :class:`~django.db.models.functions.Trunc` functions to truncate a date or datetime to a significant component. They enable queries like sales-per-day or sales-per-hour.
id: Ditambahkan fungsi-fungsi :class:`~django.db.models.functions.Trunc` untuk memotong tanggal atau datetime pada komponen penting. Mereka mengadakan permintaan seperti penjualan-per-hari atau penjualan-per-jam.
zh_hans: 新增了 :class:`~django.db.models.functions.Trunc` 函数，用于将日期或日期时间截断到一个重要的组件。它们使得可以执行类似每天销售或每小时销售的查询。

source: ``Model.__init__()`` now sets values of virtual fields from its keyword arguments.
id: ``Model.__init__()`` sekarang menyetel nilai dari bidang maya dari argumen kata kuncinya.
zh_hans: ``Model.__init__()`` 现在会从关键字参数中设置虚拟字段的值。

source: The new :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>` and :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>` options allow controlling the :attr:`~django.db.models.Model._base_manager` and :attr:`~django.db.models.Model._default_manager`, respectively.
id: Pilihan :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>` dan :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>` baru mengizinkan mengendalikan :attr:`~django.db.models.Model._base_manager` dan :attr:`~django.db.models.Model._default_manager`, masing-masing.
zh_hans: 新的 :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>` 和 :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>` 选项允许分别控制 :attr:`~django.db.models.Model._base_manager` 和 :attr:`~django.db.models.Model._default_manager`。

source: Requests and Responses
id: Permintaan dan Tanggapan
zh_hans: 请求和响应

source: Added ``request.user`` to the debug view.
id: Ditambahkan ``request.user`` pada tampilan mencai kesalahan.
zh_hans: 在调试视图中添加了 ``request.user``。

source: Added :class:`~django.http.HttpResponse` methods :meth:`~django.http.HttpResponse.readable()` and :meth:`~django.http.HttpResponse.seekable()` to make an instance a stream-like object and allow wrapping it with :py:class:`io.TextIOWrapper`.
id: Ditambahkan metode :class:`~django.http.HttpResponse` :meth:`~django.http.HttpResponse.readable()` dan :meth:`~django.http.HttpResponse.seekable()` untuk membuat sebuah contoh obyek seperti-arus dan mengizinkan membungkusnya dengan :py:class:`io.TextIOWrapper`.
zh_hans: 添加了 :class:`~django.http.HttpResponse` 的方法 :meth:`~django.http.HttpResponse.readable()` 和 :meth:`~django.http.HttpResponse.seekable()`，以使实例成为类似流的对象，并允许将其包装在 :py:class:`io.TextIOWrapper` 中。

source: Added the :attr:`HttpRequest.content_type <django.http.HttpRequest.content_type>` and :attr:`~django.http.HttpRequest.content_params` attributes which are parsed from the ``CONTENT_TYPE`` header.
id: Ditambahkan atribut :attr:`HttpRequest.content_type <django.http.HttpRequest.content_type>` dan :attr:`~django.http.HttpRequest.content_params` yang diuraikan dari kepala ``CONTENT_TYPE``.
zh_hans: 添加了 :attr:`HttpRequest.content_type <django.http.HttpRequest.content_type>` 和 :attr:`~django.http.HttpRequest.content_params` 属性，这些属性从 ``CONTENT_TYPE`` 标头中解析而来。

source: The parser for ``request.COOKIES`` is simplified to better match the behavior of browsers. ``request.COOKIES`` may now contain cookies that are invalid according to :rfc:`6265` but are possible to set via ``document.cookie``.
id: Pengurai untuk ``request.COOKIES`` disederhanakan untuk perilaku pencocokan lebih baik dari peramban ``request.COOKIES`` sekarang mengandung kue yang tidak sah menurut :rfc:`6265` tetapi memunginkan menyetel melalui ``document.cookie``.
zh_hans: ``request.COOKIES`` 的解析器被简化，以更好地匹配浏览器的行为。``request.COOKIES`` 现在可以包含根据 :rfc:`6265` 无效但可以通过 ``document.cookie`` 设置的 cookie。

source: Serialization
id: Serialisasi
zh_hans: 序列化

source: The ``django.core.serializers.json.DjangoJSONEncoder`` now knows how to serialize lazy strings, typically used for translatable content.
id: ``django.core.serializers.json.DjangoJSONEncoder`` sekarang mengetahui bagaimana menserialisasikan deretan karakter lazy, khususnya digunakan untuk isi terjemahan.
zh_hans: ``django.core.serializers.json.DjangoJSONEncoder`` 现在知道如何序列化懒惰字符串，通常用于可翻译的内容。

source: Added the ``autoescape`` option to the :class:`~django.template.backends.django.DjangoTemplates` backend and the :class:`~django.template.Engine` class.
id: Ditambahkan pilihan ``autoescape`` pada backend :class:`~django.template.backends.django.DjangoTemplates` dan kelas :class:`~django.template.Engine`.
zh_hans: 在 :class:`~django.template.backends.django.DjangoTemplates` 后端和 :class:`~django.template.Engine` 类中添加了 ``autoescape`` 选项。

source: Added the ``is`` and ``is not`` comparison operators to the :ttag:`if` tag.
id: Ditambahkan penghubung perbandingan ``is`` dan ``is not`` pada etiket :ttag:`if`.
zh_hans: 在 :ttag:`if` 标签中添加了 ``is`` 和 ``is not`` 比较运算符。

source: Allowed :tfilter:`dictsort` to order a list of lists by an element at a specified index.
id: Diizinkan :tfilter:`dictsort` untuk mengurutkan daftar dari daftar oleh unsur pada indeks yang ditentukan.
zh_hans: 允许使用 :tfilter:`dictsort` 根据指定索引处的元素对列表中的列表进行排序。

source: The :func:`~django.template.context_processors.debug` context processor contains queries for all database aliases instead of only the default alias.
id: Pengolah konteks :func:`~django.template.context_processors.debug` mengandung permintaan untuk semua nama lain basisdata daripada hanya nama lain awalan.
zh_hans: :func:`~django.template.context_processors.debug` 上下文处理器包含了所有数据库别名的查询，而不仅仅是默认别名。

source: Added relative path support for string arguments of the :ttag:`extends` and :ttag:`include` template tags.
id: Ditambahkan dukungan jalur relatif untuk argumen deretan karakter dari etiket cetakan :ttag:`extends` dan :ttag:`include`.
zh_hans: 对 :ttag:`extends` 和 :ttag:`include` 模板标签的字符串参数添加了相对路径支持。

source: Tests
id: Pengujian
zh_hans: 测试

source: To better catch bugs, :class:`~django.test.TestCase` now checks deferrable database constraints at the end of each test.
id: Untuk penangkapan kesalahan lebih baik, :class:`~django.test.TestCase` sekarang memeriksa batasan basisdata dapat ditunda pada akhir setiap percobaan.
zh_hans: 为了更好地捕获错误，:class:`~django.test.TestCase` 现在在每个测试结束时检查可延迟的数据库约束。

source: Tests and test cases can be :ref:`marked with tags <topics-tagging-tests>` and run selectively with the new :option:`test --tag` and :option:`test --exclude-tag` options.
id: Percobaan dan kasus percobaan dapat di :ref:`marked with tags <topics-tagging-tests>` dan dijalankan dipilih-pilih dengan pilihan :option:`test --tag` dan :option:`test --exclude-tag` baru.
zh_hans: 测试和测试用例可以被 :ref:`标记为标签 <topics-tagging-tests>` 并可以使用新的 :option:`test --tag` 和 :option:`test --exclude-tag` 选项进行选择性运行。

source: You can now login and use sessions with the test client even if :mod:`django.contrib.sessions` is not in :setting:`INSTALLED_APPS`.
id: Anda sekarang dapat masuk dan menggunakan sesi dengan klien percobaan bahkan jika :mod:`django.contrib.sessions` tidak di :setting:`INSTALLED_APPS`.
zh_hans: 即使 :mod:`django.contrib.sessions` 不在 :setting:`INSTALLED_APPS` 中，您现在也可以使用测试客户端登录并使用会话。

source: An addition in :func:`django.setup()` allows URL resolving that happens outside of the request/response cycle (e.g. in management commands and standalone scripts) to take :setting:`FORCE_SCRIPT_NAME` into account when it is set.
id: Sebuah tambahan di :func:`django.setup()` mengizinkan URL menangani yang terjadi diluar dari siklus permintaan/tanggapan (sebagai contoh di perintah pengelolaan dan tulisan berdiri sendiri) untuk mengambil :setting:`FORCE_SCRIPT_NAME` kedalam akun ketiks dia disetel.
zh_hans: 在 :func:`django.setup()` 中的一个新添加允许在请求/响应周期之外发生的 URL 解析（例如在管理命令和独立脚本中）在设置 :setting:`FORCE_SCRIPT_NAME` 时考虑到它。

source: Validators
id: Pengesah
zh_hans: 验证器

source: :class:`~django.core.validators.URLValidator` now limits the length of domain name labels to 63 characters and the total length of domain names to 253 characters per :rfc:`1034`.
id: :class:`~django.core.validators.URLValidator` sekarang membatasi panjang dari label nama ranah sampai 63 karakter dan jumlah panjang dari nama ranah sampai 253 karakter per :rfc:`1034`.
zh_hans: :class:`~django.core.validators.URLValidator` 现在将域名标签的长度限制为 63 个字符，域名的总长度限制为 253 个字符，符合 :rfc:`1034` 的规定。

source: :func:`~django.core.validators.int_list_validator` now accepts an optional ``allow_negative`` boolean parameter, defaulting to ``False``, to allow negative integers.
id: :func:`~django.core.validators.int_list_validator` sekarang menerima sebuah pilihan ``allow_negative`` parameter boolean, nilai awal ke ``False``, untuk mengizinkan integer negatif.
zh_hans: :func:`~django.core.validators.int_list_validator` 现在接受一个可选的布尔参数 ``allow_negative``，默认为 ``False``，以允许负整数。

source: Backwards incompatible changes in 1.10
id: Perubahan bertentangan kebelakang di 1.10
zh_hans: 1.10 中的不向后兼容的变更

source: In addition to the changes outlined in this section, be sure to review the :ref:`removed-features-1.10` for the features that have reached the end of their deprecation cycle and therefore been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada uraian berubah di bagian ini, pastikan meninjau :ref:`removed-features-1.10` untuk fitur yang telah mencapai akhir dari siklus pengusangan mereka dan karena itu telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur diberikan, perpindahan ini mungkin muncul sebagai perubahan ketidaksesuaian kebelakang.
zh_hans: 除了本节中概述的更改之外，请务必查看 :ref:`removed-features-1.10`，了解已经到达了弃用周期终点并因此被移除的功能。如果您没有在给定功能的弃用时间表内更新您的代码，它的移除可能会被视为不兼容的更改。

source: Database backend API
id: API backend basisdata
zh_hans: 数据库后端 API

source: GIS's ``AreaField`` uses an unspecified underlying numeric type that could in practice be any numeric Python type. ``decimal.Decimal`` values retrieved from the database are now converted to ``float`` to make it easier to combine them with values used by the GIS libraries.
id: ``AreaField`` GIS menggunakan jenis numerik dasar tidak ditentukan yang dapat dalam praktiknya menjadi jenis Python numerik apapun. Nilai ``decimal.Decimal`` diambil dari basisdata sekarang dirubah menjadi ``float`` untuk membuatnya lebih mudah memadukan mereka dengan nilai-nilai digunakan oleh pustaka GIS.
zh_hans: GIS 的 ``AreaField`` 使用一个未指定的底层数字类型，实际上可以是任何 Python 数值类型。从数据库中检索到的 ``decimal.Decimal`` 值现在被转换为 ``float``，以便更容易将它们与 GIS 库使用的值结合在一起。

source: In order to enable temporal subtraction you must set the ``supports_temporal_subtraction`` database feature flag to ``True`` and implement the ``DatabaseOperations.subtract_temporals()`` method. This method should return the SQL and parameters required to compute the difference in microseconds between the ``lhs`` and ``rhs`` arguments in the datatype used to store :class:`~django.db.models.DurationField`.
id: Untuk mengadakan pengurangan sementara anda harus menyetel bendera fitur basisdata ``supports_temporal_subtraction`` menjadi ``True`` dan menerapkan metode ``DatabaseOperations.subtract_temporals()``. Cara ini harus mengembalikan SQL dan parameter yang dibutuhkan untuk menghitung perbedaan dalam mikrodetik diantara argumen ``lhs`` dan ``rhs`` di jenis data digunakan untuk menyimpan :class:`~django.db.models.DurationField`.
zh_hans: 为了启用时间减法，您必须将数据库功能标志 ``supports_temporal_subtraction`` 设置为 ``True``，并实现 ``DatabaseOperations.subtract_temporals()`` 方法。该方法应返回计算``lhs`` 和 ``rhs`` 参数之间差异的微秒数所需的 SQL 和参数，其数据类型用于存储 :class:`~django.db.models.DurationField`。

source: ``select_related()`` prohibits non-relational fields for nested relations
id: ``select_related()`` melarang bidang bukan-berhubungan untuk hubungan bersarang
zh_hans: ``select_related()`` 禁止嵌套关系的非关系字段。

source: Django 1.8 added validation for non-relational fields in ``select_related()``:
zh_hans: Django 1.8 添加了 ``select_related()`` 中非关系字段的验证：

source: But it didn't prohibit nested non-relation fields as it does now:
zh_hans: 但是现在它禁止了嵌套的非关系字段，而之前没有禁止。

source: ``_meta.get_fields()`` returns consistent reverse fields for proxy models
id: ``_meta.get_fields()`` mengembalikan kesesuaian bidang membalikkan untuk model proxy
zh_hans: ``_meta.get_fields()`` 为代理模型返回一致的反向字段。

source: Before Django 1.10, the :meth:`~django.db.models.options.Options.get_fields` method returned different reverse fields when called on a proxy model compared to its proxied concrete class. This inconsistency was fixed by returning the full set of fields pointing to a concrete class or one of its proxies in both cases.
id: Sebelum Django 1.10, metode :meth:`~django.db.models.options.Options.get_fields` mengembalikan bidang membalikkan yang berbeda ketika dipanggil pada model dibandingkan pada wujud kelas yang diwakilkan. Ketidaksesuaian telah diperbaiki dengan mengembalikan sekumpulan penuh dari bidang-bidang menunjuk ke kelas berwujud atau satu dari wakilnya di kedua kasus.
zh_hans: 在 Django 1.10 之前，当在代理模型上调用 :meth:`~django.db.models.options.Options.get_fields` 方法时，返回的反向字段与其代理的具体类相比是不同的。这种不一致性已经通过在两种情况下都返回指向具体类或其代理之一的字段的完整集合来修复。

source: :attr:`AbstractUser.username <django.contrib.auth.models.User.username>` ``max_length`` increased to 150
id: :attr:`AbstractUser.username <django.contrib.auth.models.User.username>` ``max_length`` ditingkatkan sampai 150
zh_hans: :attr:`AbstractUser.username <django.contrib.auth.models.User.username>` 的 ``max_length`` 增加到了 150。

source: A migration for :attr:`django.contrib.auth.models.User.username` is included. If you have a custom user model inheriting from ``AbstractUser``, you'll need to generate and apply a database migration for your user model.
id: Sebuah perpindahan :attr:`django.contrib.auth.models.User.username` disertakan. Jika anda mempunyai model pengguna penyesuaian diwariskan dari ``AbstractUser``, anda akan butuh membangkitkan dan berlakukan perpindahan basisdata untuk model pengguna anda.
zh_hans: 包括了一个针对 :attr:`django.contrib.auth.models.User.username` 的迁移。如果您有一个继承自 ``AbstractUser`` 的自定义用户模型，您需要为您的用户模型生成并应用一个数据库迁移。

source: We considered an increase to 254 characters to more easily allow the use of email addresses (which are limited to 254 characters) as usernames but rejected it due to a MySQL limitation. When using the ``utf8mb4`` encoding (recommended for proper Unicode support), MySQL can only create unique indexes with 191 characters by default. Therefore, if you need a longer length, please use a custom user model.
id: Kami mempertimbangkan peningkatan sampai 254 karakter untuk lebih mudah mengizinkan penggunaan alamat surel (yang terbatas sampai 254 karakter) sebagai nama pengguna tetapi ditolak karena batasan MySQL. Ketika menggunakan penyandian ``utf8mb4`` (dianjurkan untuk dukungan Unicode sesuai), MySQL dapat hanya membuat indeks unik dengan 191 karakter secara awal. Karena itu, jika anda butuh panjang lebih, harap gunakan model pengguna penyesuaian.
zh_hans: 我们考虑将用户名的最大长度增加到 254 个字符，以更容易允许使用电子邮件地址（限制为 254 个字符）作为用户名，但由于 MySQL 的限制而拒绝了这个提案。当使用 ``utf8mb4`` 编码（推荐用于正确支持 Unicode）时，默认情况下，MySQL 只能创建包含 191 个字符的唯一索引。因此，如果您需要更长的长度，请使用自定义用户模型。

source: If you want to preserve the 30 character limit for usernames, use a custom form when creating a user or changing usernames::
id: Jika anda ingin menyediakan batas 30 karakter untuk nama pengguna, gunakan formulir penyesuaian ketika membuat pengguna atau merubah nama pengguna::
zh_hans: 如果您想保留用户名的 30 个字符限制，请在创建用户或更改用户名时使用自定义表单：

source: If you wish to keep this restriction in the admin, set ``UserAdmin.add_form`` to use this form::
id: Jika anda berharap menjaga batasan ini di admin, setel ``UserAdmin.add_form`` untuk menggunakan formulir ini::
zh_hans: 如果您希望在管理员中保留这个限制，可以将 ``UserAdmin.add_form`` 设置为使用以下表单：

source: Dropped support for PostgreSQL 9.1
id: Dibuang dukungan untuk PostgreSQL 9.1
zh_hans: 停止支持 PostgreSQL 9.1

source: Upstream support for PostgreSQL 9.1 ends in September 2016. As a consequence, Django 1.10 sets PostgreSQL 9.2 as the minimum version it officially supports.
id: Dukungan hulu untuk PostgreSQL 9.1 berakhir di September 2016. Sebagai konsekuensinya, Django 1.10 menyetel PostgreSQL 9.2 sebagai versi minimal dia secara resmi dukung.
zh_hans: PostgreSQL 9.1 的上游支持将在 2016 年 9 月结束。因此，Django 1.10 将 PostgreSQL 9.2 设置为其正式支持的最低版本。

source: ``runserver`` output goes through logging
id: Keluaran ``runserver`` melewati pencatatan
zh_hans: ``runserver`` 输出经过日志记录

source: Request and response handling of the ``runserver`` command is sent to the :ref:`django-server-logger` logger instead of to ``sys.stderr``. If you disable Django's logging configuration or override it with your own, you'll need to add the appropriate logging configuration if you want to see that output::
id: Menangani permintaan dan tanggapan dari perintah ``runserver`` dikirim ke pencatat :ref:`django-server-logger` sebagai gantinya pada ``sys.stderr``. Jika anda meniadakan konfigurasi pencatatan Django atau menimpa dengan anda sendiri, anda akan butuh menambahkan konfigurasi pencatatan yang sesuai jika anda ingin melihat keluaran itu::
zh_hans: ``runserver`` 命令的请求和响应处理发送到 :ref:`django-server-logger` 日志记录器，而不是发送到 ``sys.stderr``。如果您禁用了 Django 的日志配置或使用自己的配置覆盖了它，如果您想看到该输出，您需要添加适当的日志配置：

source: ``auth.CustomUser`` and ``auth.ExtensionUser`` test models were removed
id: Model percobaan ``auth.CustomUser`` dan ``auth.ExtensionUser`` dipindahkan.
zh_hans: ``auth.CustomUser`` 和 ``auth.ExtensionUser`` 测试模型已被移除。

source: Since the introduction of migrations for the contrib apps in Django 1.8, the tables of these custom user test models were not created anymore making them unusable in a testing context.
id: Sejak perkenalan dari perpindahan untuk bantuan aplikasi di Django 1.8, tabel dari model percobaan pengguna penyesuaian ini tidak dibuat lagi membuat mereka tidak berguna dalam konteks percobaan.
zh_hans: 自 Django 1.8 开始为 contrib 应用程序引入迁移以来，这些自定义用户测试模型的表不再创建，使它们无法在测试环境中使用。

source: Apps registry is no longer auto-populated when unpickling models outside of Django
id: Registrar aplikasi tidak lagi otomatis dikumpulkan ketika membongkar model diluar Django
zh_hans: 在 Django 之外反序列化模型时，应用程序注册表不再自动填充。

source: The apps registry is no longer auto-populated when unpickling models. This was added in Django 1.7.2 as an attempt to allow unpickling models outside of Django, such as in an RQ worker, without calling ``django.setup()``, but it creates the possibility of a deadlock. To adapt your code in the case of RQ, you can `provide your own worker script <https://python-rq.org/docs/workers/>`_ that calls ``django.setup()``.
zh_hans: 在反序列化模型时，不再自动填充应用程序注册表。这在 Django 1.7.2 中添加，是为了允许在 Django 之外反序列化模型，比如在 RQ worker 中，而不需要调用 ``django.setup()``，但这会导致死锁的可能性。在 RQ 的情况下，为了适应您的代码，您可以 `提供自己的工作脚本 <https://python-rq.org/docs/workers/>`_，其中调用 ``django.setup()``。
