Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Calls to ``WizardView.done()`` now include a ``form_dict`` to allow easier access to forms by their step name.
id: Panggilan pada ``WizardView.done()``sekarang menyertakan ``form_dict`` untuk mengizinkan pengaksesan lebih mudah pda formulir berdasarkan nama langkah mereka.
zh_hans: 对 ``WizardView.done()`` 的调用现在包括一个 ``form_dict``，以便更容易按步骤名称访问表单。

source: The default OpenLayers library version included in widgets has been updated from 2.11 to 2.13.
id: Versi pustaka OpenLayer awalan disertakan di widget telah diperbaharui dari 2.11 menjadi 2.13.
zh_hans: 默认包含在小部件中的 OpenLayers 库版本已从 2.11 更新为 2.13 。

source: Prepared geometries now also support the ``crosses``, ``disjoint``, ``overlaps``, ``touches`` and ``within`` predicates, if GEOS 3.3 or later is installed.
id: Gemoteri dipersiapkan sekarang juga mendukung sebutan ``crosses``, ``disjoint``, ``overlaps``, ``touches`` dan ``within``, jika GEOS 3.3 atau terakhir terpasang.
zh_hans: 如果安装了 GEOS 3.3 或更高版本，预处理的几何图形现在还支持 ``crosses``、``disjoint``、``overlaps``、``touches`` 和 ``within`` 谓词。

source: The backends for :mod:`django.contrib.messages` that use cookies, will now follow the :setting:`SESSION_COOKIE_SECURE` and :setting:`SESSION_COOKIE_HTTPONLY` settings.
id: Backend untuk :mod:`django.contrib.messages` yang menggunakan kue, sekarang akan mengikuti pengaturan :setting:`SESSION_COOKIE_SECURE` dan :setting:`SESSION_COOKIE_HTTPONLY`.
zh_hans: 使用 Cookie 的 :mod:`django.contrib.messages` 后端现在将遵循 :setting:`SESSION_COOKIE_SECURE` 和 :setting:`SESSION_COOKIE_HTTPONLY` 设置。

source: The :ref:`messages context processor <message-displaying>` now adds a dictionary of default levels under the name ``DEFAULT_MESSAGE_LEVELS``.
id: :ref:`messages context processor <message-displaying>` sekarang menambahkan sebuah kamus dari tingkat awalan dibawah nama ``DEFAULT_MESSAGE_LEVELS``.
zh_hans: :ref:`消息上下文处理器 <message-displaying>` 现在会添加一个名为 ``DEFAULT_MESSAGE_LEVELS`` 的默认级别字典。

source: :class:`~django.contrib.messages.Message` objects now have a ``level_tag`` attribute that contains the string representation of the message level.
zh_hans: 现在 :class:`~django.contrib.messages.Message` 对象具有一个 ``level_tag`` 属性，其中包含消息级别的字符串表示。

source: :class:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware` has two new attributes (:attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_gone_class` and :attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_redirect_class`) that specify the types of :class:`~django.http.HttpResponse` instances the middleware returns.
id: :class:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware` mempunyai dua atribut baru (:attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_gone_class` dan :attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_redirect_class`) yang menentukan jenis-jenis dari instance :class:`~django.http.HttpResponse` kembalian middleware.
zh_hans: :class:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware` 具有两个新属性 (:attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_gone_class` 和 :attr:`~django.contrib.redirects.middleware.RedirectFallbackMiddleware.response_redirect_class`)，用于指定中间件返回的 :class:`~django.http.HttpResponse` 实例的类型。

source: The ``"django.contrib.sessions.backends.cached_db"`` session backend now respects :setting:`SESSION_CACHE_ALIAS`. In previous versions, it always used the ``default`` cache.
zh_hans: ``"django.contrib.sessions.backends.cached_db"`` 会话后端现在尊重 :setting:`SESSION_CACHE_ALIAS`。在之前的版本中，它总是使用 ``default`` 缓存。

source: The :mod:`sitemap framework<django.contrib.sitemaps>` now makes use of :attr:`~django.contrib.sitemaps.Sitemap.lastmod` to set a ``Last-Modified`` header in the response. This makes it possible for the :class:`~django.middleware.http.ConditionalGetMiddleware` to handle conditional ``GET`` requests for sitemaps which set ``lastmod``.
id: :mod:`sitemap framework<django.contrib.sitemaps>` sekarang memanfaatkan :attr:`~django.contrib.sitemaps.Sitemap.lastmod` untuk menyetel kepala ``Last-Modified`` di tanggapan. Ini membuatnya memungkinkan untuk :class:`~django.middleware.http.ConditionalGetMiddleware` untuk menangani permintaan ``GET`` bersyarat untuk peta situs yang menyetel ``lastmod``.
zh_hans: :mod:`sitemap framework<django.contrib.sitemaps>` 现在使用 :attr:`~django.contrib.sitemaps.Sitemap.lastmod` 来设置响应中的 ``Last-Modified`` 标头。这使得 :class:`~django.middleware.http.ConditionalGetMiddleware` 可以处理对设置了 ``lastmod`` 的站点地图的条件 ``GET`` 请求。

source: The new :class:`django.contrib.sites.middleware.CurrentSiteMiddleware` allows setting the current site on each request.
id: :class:`django.contrib.sites.middleware.CurrentSiteMiddleware` baru mengizinkan mengatur situs saat ini di setiap permintaan
zh_hans: 新的 :class:`django.contrib.sites.middleware.CurrentSiteMiddleware` 允许在每个请求上设置当前站点。

source: The :ref:`static files storage classes <staticfiles-storages>` may be subclassed to override the permissions that collected static files and directories receive by setting the :attr:`~django.core.files.storage.FileSystemStorage.file_permissions_mode` and :attr:`~django.core.files.storage.FileSystemStorage.directory_permissions_mode` parameters. See :djadmin:`collectstatic` for example usage.
id: :ref:`static files storage classes <staticfiles-storages>` mungkin di subkelaskan untuk menimpa perizinan yang mengumpulkan berkas-berkas tetap dan direktori menerima dengan mengatur parameter :attr:`~django.core.files.storage.FileSystemStorage.file_permissions_mode` dan :attr:`~django.core.files.storage.FileSystemStorage.directory_permissions_mode`. Lihat :djadmin:`collectstatic` untuk contoh penggunaan.
zh_hans: 可以通过子类化 :ref:`静态文件存储类 <staticfiles-storages>` 来覆盖收集的静态文件和目录的权限，方法是设置 :attr:`~django.core.files.storage.FileSystemStorage.file_permissions_mode` 和 :attr:`~django.core.files.storage.FileSystemStorage.directory_permissions_mode` 参数。请参阅 :djadmin:`collectstatic` 以查看示例用法。

source: The ``CachedStaticFilesStorage`` backend gets a sibling class called :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` that doesn't use the cache system at all but instead a JSON file called ``staticfiles.json`` for storing the mapping between the original file name (e.g. ``css/styles.css``) and the hashed file name (e.g. ``css/styles.55e7cbb9ba48.css``). The ``staticfiles.json`` file is created when running the :djadmin:`collectstatic` management command and should be a less expensive alternative for remote storages such as Amazon S3.
zh_hans: ``CachedStaticFilesStorage`` 后端有一个名为 :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 的兄弟类，它根本不使用缓存系统，而是使用一个名为 ``staticfiles.json`` 的 JSON 文件来存储原始文件名（例如 ``css/styles.css``）和散列文件名（例如 ``css/styles.55e7cbb9ba48.css``）之间的映射关系。当运行 :djadmin:`collectstatic` 管理命令时，会创建 ``staticfiles.json`` 文件，对于 Amazon S3 等远程存储来说，这应该是一个更经济的替代方案。

source: See the :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` docs for more information.
id: Lihat dokumentasi :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` untuk informasi lebih.
zh_hans: 有关更多信息，请参阅 :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 文档。

source: :djadmin:`findstatic` now accepts verbosity flag level 2, meaning it will show the relative paths of the directories it searched. See :djadmin:`findstatic` for example output.
id: :djadmin:`findstatic` sekarang menerima bendera terlalu banyak kata tingkat 2, berarti itu akan menunjukkan jalur relatif dari direktori itu cari. Lihat :djadmin:`findstatic` untuk contoh keluaran.
zh_hans: :djadmin:`findstatic` 现在接受详细程度为 2 的 verbosity 标志，这意味着它将显示搜索的目录的相对路径。请参阅 :djadmin:`findstatic` 以查看示例输出。

source: The :class:`~django.utils.feedgenerator.Atom1Feed` syndication feed's ``updated`` element now utilizes ``updateddate`` instead of ``pubdate``, allowing the ``published`` element to be included in the feed (which relies on ``pubdate``).
id: Unsur ``updated``umpan perkongsian :class:`~django.utils.feedgenerator.Atom1Feed` sekarang memanfaatkan ``updateddate`` daripada ``pubdate``, mengizinkan unsur ``published`` untuk disertakan di umpan (yang bergantung pada ``pubdate``).
zh_hans: :class:`~django.utils.feedgenerator.Atom1Feed` 辅助工具中的 ``updated`` 元素现在使用 ``updateddate`` 而不是 ``pubdate``，允许在 feed 中包含 ``published`` 元素（该元素依赖于 ``pubdate``）。

source: Access to caches configured in :setting:`CACHES` is now available via :data:`django.core.cache.caches`. This dict-like object provides a different instance per thread. It supersedes ``django.core.cache.get_cache()`` which is now deprecated.
id: Akses ke cache dikonfigurasikan di :setting:`CACHES` sekarang tersedia melalui :data:`django.core.cache.caches`. Obyek seperti-kamus ini menyediakan instance berbeda per thread. Itu menggantikan ``django.core.cache.get_cache()`` yang sekarang diusangkan.
zh_hans: 现在可以通过 :data:`django.core.cache.caches` 访问在 :setting:`CACHES` 中配置的缓存。这个类似字典的对象为每个线程提供一个不同的实例。它取代了已被弃用的 ``django.core.cache.get_cache()``。

source: If you instantiate cache backends directly, be aware that they aren't thread-safe any more, as :data:`django.core.cache.caches` now yields different instances per thread.
id: Jika anda menginstasiasi backend cache secara langsung, waspada mereka tidak thread-safe lagi, ketika :data:`django.core.cache.caches` sekarang menghasilkan instance berbeda per thread.
zh_hans: 如果直接实例化缓存后端，请注意它们不再是线程安全的，因为 :data:`django.core.cache.caches` 现在为每个线程提供不同的实例。

source: Defining the :setting:`TIMEOUT <CACHES-TIMEOUT>` argument of the :setting:`CACHES` setting as ``None`` will set the cache keys as "non-expiring" by default. Previously, it was only possible to pass ``timeout=None`` to the cache backend's ``set()`` method.
id: Menentukan argumen :setting:`TIMEOUT <CACHES-TIMEOUT>` dari pengaturan :setting:`CACHES` sebagai ``None`` akan menyetel kunci cache sebagai "non-expiring" secara awalan. Sebelumnya, itu hanya memungkinkan melewatkan ``timeout=None`` ke metode ``set()`` backend cache.
zh_hans: 将 :setting:`CACHES` 设置的 :setting:`TIMEOUT <CACHES-TIMEOUT>` 参数定义为 ``None`` 将默认将缓存键设置为 "永不过期"。以前，只能将 ``timeout=None`` 传递给缓存后端的 ``set()`` 方法。

source: Cross Site Request Forgery
zh_hans: 跨站请求伪造（Cross Site Request Forgery，CSRF）

source: The :setting:`CSRF_COOKIE_AGE` setting facilitates the use of session-based CSRF cookies.
id: Pengaturan :setting:`CSRF_COOKIE_AGE` mempermudah penggunaan kue CSRF berbasis sesi.
zh_hans: :setting:`CSRF_COOKIE_AGE` 设置方便了使用基于会话的 CSRF Cookie。

source: :func:`~django.core.mail.send_mail` now accepts an ``html_message`` parameter for sending a multipart :mimetype:`text/plain` and :mimetype:`text/html` email.
zh_hans: :func:`~django.core.mail.send_mail` 现在接受一个 ``html_message`` 参数，用于发送多部分 :mimetype:`text/plain` 和 :mimetype:`text/html` 的电子邮件。

source: The SMTP :class:`~django.core.mail.backends.smtp.EmailBackend` now accepts a ``timeout`` parameter.
id: :class:`~django.core.mail.backends.smtp.EmailBackend` SMTP sekarang menerima parameter ``timeout``.
zh_hans: SMTP :class:`~django.core.mail.backends.smtp.EmailBackend` 现在接受一个 ``timeout`` 参数。

source: File locking on Windows previously depended on the PyWin32 package; if it wasn't installed, file locking failed silently. That dependency has been removed, and file locking is now implemented natively on both Windows and Unix.
id: Penguncian berkas di Windows sebelumnya terbantung di paket PyWin32; jika itu tidak dipasang, penguncian berkas gagal secara diam. Ketergantungan itu telah dipindahkan, dan penguncian berkas sekarang diterapkan asli di kedua Windows dan Unix.
zh_hans: 在 Windows 上，文件锁定以前依赖于 PyWin32 软件包；如果未安装该软件包，则文件锁定会默默失败。现在已经移除了这个依赖项，文件锁定在 Windows 和 Unix 上都使用本地实现。

source: File Uploads
id: Unggah Berkas
zh_hans: 文件上传

source: The new :attr:`UploadedFile.content_type_extra <django.core.files.uploadedfile.UploadedFile.content_type_extra>` attribute contains extra parameters passed to the ``content-type`` header on a file upload.
id: Atribut :attr:`UploadedFile.content_type_extra <django.core.files.uploadedfile.UploadedFile.content_type_extra>` baru mengandung parameter tambahan dilewatkan ke kepala ``content-type`` di sebuah unggah berkas.
zh_hans: 新的 :attr:`UploadedFile.content_type_extra <django.core.files.uploadedfile.UploadedFile.content_type_extra>` 属性包含在文件上传的 ``content-type`` 标头中传递的额外参数。

source: The new :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS` setting controls the file system permissions of directories created during file upload, like :setting:`FILE_UPLOAD_PERMISSIONS` does for the files themselves.
id: Pengaturan :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS` baru mengendalikan perizinan sistem berkas dari direktori dibuat selama unggah berkas, seperti :setting:`FILE_UPLOAD_PERMISSIONS` lakukan untuk berkas-berkas mereka sendiri.
zh_hans: 新的 :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS` 设置控制在文件上传期间创建的目录的文件系统权限，就像 :setting:`FILE_UPLOAD_PERMISSIONS` 一样控制文件本身的权限。

source: The :attr:`FileField.upload_to <django.db.models.FileField.upload_to>` attribute is now optional. If it is omitted or given ``None`` or an empty string, a subdirectory won't be used for storing the uploaded files.
id: Atribut :attr:`FileField.upload_to <django.db.models.FileField.upload_to>` sekarang pilihan. Jika itu dihilangkan atau diberikan ``None`` atau sebuah string kosong, sebuah subdirektori tidak akan digunakan untuk menyimpan berkas terunggah.
zh_hans: :attr:`FileField.upload_to <django.db.models.FileField.upload_to>` 属性现在是可选的。如果省略或给定 ``None`` 或空字符串，将不会使用子目录来存储上传的文件。

source: Uploaded files are now explicitly closed before the response is delivered to the client. Partially uploaded files are also closed as long as they are named ``file`` in the upload handler.
id: Berkas-berkas terunggah sekarang secara eksplisit tertutup sebelum tanggapan dikirimkan ke klien. Sebagian berkas terunggah juga ditutup selama mereka bernama ``file`` di penangan unggahan.
zh_hans: 上传的文件现在在响应交付给客户端之前明确关闭。只要在上传处理程序中的名称为 ``file``，部分上传的文件也会被关闭。

source: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` now appends an underscore plus a random 7 character alphanumeric string (e.g. ``"_x3a1gho"``), rather than iterating through an underscore followed by a number (e.g. ``"_1"``, ``"_2"``, etc.) to prevent a denial-of-service attack. This change was also made in the 1.6.6, 1.5.9, and 1.4.14 security releases.
id: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` sekarang menambah sebuah garis bawah ditambah 7 karakter alphanumerik string acak (sebagai contoh `"_x3a1gho"``), daripada mengulang melalui sebuah garis bawah diikuti oleh sebuah angka (sebagai contoh ``"_1"``, ``"_2"``, dll) untuk mencegah serangan denial-of-service. Perubahan ini juga dibuat di terbitan keamanan 1.6.6, 1.5.9, dan 1.4.14.
zh_hans: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` 现在追加一个下划线加上一个随机的 7 个字符的字母数字字符串（例如，``"_x3a1gho"``），而不是通过一个下划线后跟一个数字（例如，``"_1"``, ``"_2"`` 等）来进行迭代，以防止拒绝服务攻击。这个更改也在 1.6.6、1.5.9 和 1.4.14 安全发布版中进行了更改。

source: The ``<label>`` and ``<input>`` tags rendered by :class:`~django.forms.RadioSelect` and :class:`~django.forms.CheckboxSelectMultiple` when looping over the radio buttons or checkboxes now include ``for`` and ``id`` attributes, respectively. Each radio button or checkbox includes an ``id_for_label`` attribute to output the element's ID.
id: Etiket ``<label>`` dan ``<input>`` dibangun oleh :class:`~django.forms.RadioSelect` dan :class:`~django.forms.CheckboxSelectMultiple` ketika mengulang tombol radio atau kontak centang sekarang menyertakan atribut ``for`` dan ``id``, masing-masing. Setiap tombol radio atau kotak centang menyertakan sebuah atribut ``id_for_label`` untuk mengeluarkan unsur ID.
zh_hans: :class:`~django.forms.RadioSelect` 和 :class:`~django.forms.CheckboxSelectMultiple` 渲染的单选按钮或复选框的 ``<label>`` 和 ``<input>`` 标签现在分别包括 ``for`` 和 ``id`` 属性。每个单选按钮或复选框都包括一个 ``id_for_label`` 属性以输出元素的 ID。

source: The ``<textarea>`` tags rendered by :class:`~django.forms.Textarea` now include a ``maxlength`` attribute if the :class:`~django.db.models.TextField` model field has a ``max_length``.
id: Etiket ``<textarea>`` dibangun oleh :class:`~django.forms.Textarea` sekarang menyertakan sebuah atribut ``maxlength`` jika bidang model :class:`~django.db.models.TextField` mempunyai ``max_length``.
zh_hans: :class:`~django.forms.Textarea` 渲染的 ``<textarea>`` 标签现在如果 :class:`~django.db.models.TextField` 模型字段有 ``max_length``，则会包括一个 ``maxlength`` 属性。

source: :attr:`Field.choices<django.db.models.Field.choices>` now allows you to customize the "empty choice" label by including a tuple with an empty string or ``None`` for the key and the custom label as the value. The default blank option ``"----------"`` will be omitted in this case.
id: :attr:`Field.choices<django.db.models.Field.choices>` sekarang mengizinkan anda untuk menyesuaikan label "empty choice" dengan menyertakan sebuah tuple dengan string kosong atau ``None`` untuk kunci dan penyesuaian label sebagai nilai. Pilihan kosong awalan ``"----------"`` akan dihilangkan di kasus ini.
zh_hans: :attr:`Field.choices <django.db.models.Field.choices>` 现在允许您通过包含一个空字符串或 ``None`` 的元组作为键以及自定义标签作为值来自定义 "空选项" 标签。在这种情况下，默认的空选项 ``"----------"`` 将被省略。

source: :class:`~django.forms.MultiValueField` allows optional subfields by setting the ``require_all_fields`` argument to ``False``. The ``required`` attribute for each individual field will be respected, and a new ``incomplete`` validation error will be raised when any required fields are empty.
id: :class:`~django.forms.MultiValueField` mengizinkan pilihan subbidang dengan mengatur argumen ``require_all_fields`` menjadi ``False``. Atribut ``required`` untuk setiap bidang tersendiri akan dihormati, dan pengesahan kesalahan ``incomplete`` baru akan dimunculkan ketika setiap bidang yang diwajibkan adalah kosong.
zh_hans: :class:`~django.forms.MultiValueField` 允许通过将 ``require_all_fields`` 参数设置为 ``False`` 来添加可选子字段。将尊重每个单独字段的 ``required`` 属性，并且当任何必填字段为空时，将引发新的 ``incomplete`` 验证错误。

source: The :meth:`~django.forms.Form.clean` method on a form no longer needs to return ``self.cleaned_data``. If it does return a changed dictionary then that will still be used.
id: Metode :meth:`~django.forms.Form.clean` di sebuah formulir tidak lagi butuh mengembalikan ``self.cleaned_data``. Jika itu mengembalikan sebuah kamus dirubah meudian itu akan masih digunakan.
zh_hans: 表单上的 :meth:`~django.forms.Form.clean` 方法不再需要返回 ``self.cleaned_data``。如果它返回一个已更改的字典，那么仍将使用该字典。

source: After a temporary regression in Django 1.6, it's now possible again to make :class:`~django.forms.TypedChoiceField` ``coerce`` method return an arbitrary value.
id: Setelah pemulihan sementara di Django 1.6, itu sekarang memungkinkan kembali untuk membuat metode ``coerce`` :class:`~django.forms.TypedChoiceField` mengembalikan sebuah nilai yang berubah-ubah.
zh_hans: 在 Django 1.6 中的一个临时回归之后，现在可以再次使 :class:`~django.forms.TypedChoiceField` 的 ``coerce`` 方法返回任意值。

source: :attr:`SelectDateWidget.months <django.forms.SelectDateWidget.months>` can be used to customize the wording of the months displayed in the select widget.
id: :attr:`SelectDateWidget.months <django.forms.SelectDateWidget.months>` dapat digunakan untuk menyesuaikan rumus dari bulan ditampilkan di pilihan widget.
zh_hans: :attr:`SelectDateWidget.months <django.forms.SelectDateWidget.months>` 可以用于自定义在选择小部件中显示的月份的措辞。

source: The ``min_num`` and ``validate_min`` parameters were added to :func:`~django.forms.formsets.formset_factory` to allow validating a minimum number of submitted forms.
id: Parameter ``min_num`` dan ``validate_min`` telah ditambahkan pada :func:`~django.forms.formsets.formset_factory` untuk mengizinkan pengecekan angka minimal dari formulir yang diajukan.
zh_hans: 添加了 ``min_num`` 和 ``validate_min`` 参数到 :func:`~django.forms.formsets.formset_factory`，以允许验证提交的表单的最小数量。

source: The metaclasses used by ``Form`` and ``ModelForm`` have been reworked to support more inheritance scenarios. The previous limitation that prevented inheriting from both ``Form`` and ``ModelForm`` simultaneously have been removed as long as ``ModelForm`` appears first in the MRO.
id: Meta kelas digunakan oleh ``Form`` dan ``ModelForm`` telah dikerjakan kembali untuk mendukung skenario warisan lebih. Batasan sebelumnya yang mencegah pewarisan dari kedua ``Form`` dan ``ModelForm`` terus menerus telah dipindahkan asalkan ``ModelForm`` muncul pertama di MRO.
zh_hans: ``Form`` 和 ``ModelForm`` 使用的元类已经重新设计，以支持更多的继承情况。以前的限制，阻止同时继承 ``Form`` 和 ``ModelForm`` 已经被移除，只要 ``ModelForm`` 在方法解析顺序 (MRO) 中首先出现。

source: It's now possible to remove a field from a ``Form`` when subclassing by setting the name to ``None``.
id: Sekarang memungkinkan memindahkan sebuah bidang dari ``Form`` ketika mensubkelaskan dengan mengatur nama ke ``None``.
zh_hans: 现在可以通过将字段的名称设置为 ``None`` 来在子类中从 ``Form`` 中删除字段。

source: It's now possible to customize the error messages for ``ModelForm``’s ``unique``, ``unique_for_date``, and ``unique_together`` constraints. In order to support ``unique_together`` or any other ``NON_FIELD_ERROR``, ``ModelForm`` now looks for the ``NON_FIELD_ERROR`` key in the ``error_messages`` dictionary of the ``ModelForm``’s inner ``Meta`` class. See :ref:`considerations regarding model's error_messages <considerations-regarding-model-errormessages>` for more details.
zh_hans: 现在可以自定义 ``ModelForm`` 中的 ``unique``、``unique_for_date`` 和 ``unique_together`` 约束的错误消息。为了支持 ``unique_together`` 或任何其他 ``NON_FIELD_ERROR``，``ModelForm`` 现在会查找 ``ModelForm`` 内部 ``Meta`` 类的 ``error_messages`` 字典中的 ``NON_FIELD_ERROR`` 键。有关更多详细信息，请参阅 :ref:`关于模型的 error_messages 的考虑 <considerations-regarding-model-errormessages>`。

source: The :attr:`django.middleware.locale.LocaleMiddleware.response_redirect_class` attribute allows you to customize the redirects issued by the middleware.
id: Atribut :attr:`django.middleware.locale.LocaleMiddleware.response_redirect_class` mengizinkan anda menyesuaian masalah pengalihan oleh middleware.
zh_hans: :attr:`django.middleware.locale.LocaleMiddleware.response_redirect_class` 属性允许您自定义中间件发出的重定向。

source: The :class:`~django.middleware.locale.LocaleMiddleware` now stores the user's selected language with the session key ``_language``. This should only be accessed using the ``LANGUAGE_SESSION_KEY`` constant. Previously it was stored with the key ``django_language`` and the ``LANGUAGE_SESSION_KEY`` constant did not exist, but keys reserved for Django should start with an underscore. For backwards compatibility ``django_language`` is still read from in 1.7. Sessions will be migrated to the new key as they are written.
zh_hans: :class:`~django.middleware.locale.LocaleMiddleware` 现在将用户选择的语言存储在会话键 ``_language`` 中。这应该只使用 ``LANGUAGE_SESSION_KEY`` 常量来访问。以前它存储在键 ``django_language`` 中，而 ``LANGUAGE_SESSION_KEY`` 常量不存在，但为 Django 保留的键应该以下划线开头。为了向后兼容，在 1.7 中仍然从 ``django_language`` 读取。随着写入，会话将迁移到新的键。

source: The :ttag:`blocktrans` tag now supports a ``trimmed`` option. This option will remove newline characters from the beginning and the end of the content of the ``{% blocktrans %}`` tag, replace any whitespace at the beginning and end of a line and merge all lines into one using a space character to separate them. This is quite useful for indenting the content of a ``{% blocktrans %}`` tag without having the indentation characters end up in the corresponding entry in the ``.po`` file, which makes the translation process easier.
zh_hans: :ttag:`blocktrans` 标签现在支持一个 ``trimmed`` 选项。此选项将从 ``{% blocktrans %}`` 标签的内容的开头和结尾删除换行符，替换每行开头和结尾的任何空白，并使用空格字符将所有行合并为一行，以分隔它们。这对于缩进 ``{% blocktrans %}`` 标签的内容非常有用，而不会使缩进字符出现在 ``.po`` 文件中相应的条目中，从而使翻译过程更加容易。
