Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django now has much better support for :doc:`conditional view processing </topics/conditional-view-processing>` using the standard ``ETag`` and ``Last-Modified`` HTTP headers. This means you can now easily short-circuit view processing by testing less-expensive conditions. For many views this can lead to a serious improvement in speed and reduction in bandwidth.
id: Django sekarang mempunyai lebih baik dukungan untuk :doc:`conditional view processing </topics/conditional-view-processing>` menggunakan standar kepala HTTP ``ETag`` dan ``Last-Modified``. Ini berarti anda sekarang dapat dengan mudah mengolah tampilan arus-pendek dengan mencoba persyaratan lebih-murah. Untuk banyak tampilan ini dapat membawa ke perbaikan berat dalam kecepatan dan pengurangan di pita lebar.
zh_hans: Django 现在对使用标准的 ``ETag`` 和 ``Last-Modified`` HTTP 头部的 :doc:`条件视图处理 </topics/conditional-view-processing>` 提供了更好的支持。这意味着你现在可以通过测试成本较低的条件来轻松地中断视图处理。对于许多视图来说，这可以大大提高速度并减少带宽消耗。

source: URL namespaces
id: Namespace URL
zh_hans: URL 命名空间

source: Django 1.1 improves :ref:`named URL patterns <naming-url-patterns>` with the introduction of URL "namespaces."
id: Django 1.1 memperbaiki :ref:`named URL patterns <naming-url-patterns>` dengan perkenalan dari URL "namespaces."
zh_hans: Django 1.1 引入了 URL "命名空间"，提升了 :ref:`命名的 URL 模式 <naming-url-patterns>`。

source: In short, this feature allows the same group of URLs, from the same application, to be included in a Django URLConf multiple times, with varying (and potentially nested) named prefixes which will be used when performing reverse resolution. In other words, reusable applications like Django's admin interface may be registered multiple times without URL conflicts.
id: Pendeknya, fitur ini mengizinkan kelompok sama dari URL, dari aplikasi sama, untuk disertakan di Django URLConf beberapa kali, dengan beragam (dan kemungkinan bersarang) awalan bernama yang akan digunakan ketika melakukan membalikkan keputusan. Dengan kata lain, aplikasi digunakan kembali seperti antarmuka admin Django mungkin mendaftar beberapa kali tanpa pertentangan URL.
zh_hans: 简而言之，这个功能允许相同的应用程序中的同一组 URL 在 Django 的 URLConf 中多次包含，使用不同（且可能嵌套）的命名前缀进行反向解析。换句话说，像 Django 的管理界面这样的可重用应用程序可以多次注册而不会出现 URL 冲突。

source: For full details, see :ref:`the documentation on defining URL namespaces <topics-http-defining-url-namespaces>`.
id: Untuk rincian penuh, lihat :ref:`the documentation on defining URL namespaces <topics-http-defining-url-namespaces>`.
zh_hans: 详细信息，请参阅 :ref:`关于定义 URL 命名空间的文档 <topics-http-defining-url-namespaces>`。

source: In Django 1.1, :doc:`GeoDjango </ref/contrib/gis/index>` (i.e. ``django.contrib.gis``) has several new features:
zh_hans: 在 Django 1.1 中，:doc:`GeoDjango </ref/contrib/gis/index>` （即 ``django.contrib.gis``）引入了一些新功能：

source: Support for SpatiaLite_ -- a spatial database for SQLite -- as a spatial backend.
id: Dukungan untuk SpatiaLite_ -- basisdata spasial untuk SQLite -- sebagai backend spasial.
zh_hans: 支持将 SpatiaLite_ （SQLite 的空间数据库）作为空间后端。

source: Geographic aggregates (``Collect``, ``Extent``, ``MakeLine``, ``Union``) and ``F`` expressions.
id: Pengumpulan geografis pernyataan (``Collect``, ``Extent``, ``MakeLine``, ``Union``) dan ``F``.
zh_hans: 地理聚合函数（``Collect``、``Extent``、``MakeLine``、``Union``）和 ``F`` 表达式。

source: New ``GeoQuerySet`` methods: ``collect``, ``geojson``, and ``snap_to_grid``.
id: Metode ``GeoQuerySet`` baru: ``collect``, ``geojson``, dan ``snap_to_grid``.
zh_hans: 新的 ``GeoQuerySet`` 方法：``collect``、``geojson`` 和 ``snap_to_grid``。

source: A new list interface methods for ``GEOSGeometry`` objects.
id: Daftar antarmuka metode baru dari obyek ``GEOSGeometry``.
zh_hans: ``GEOSGeometry`` 对象的新列表接口方法。

source: For more details, see the GeoDjango documentation.
id: Untuk lebih rinci, lihat dokumentasi GeoDjango.
zh_hans: 要了解更多详细信息，请参阅 GeoDjango 文档。

source: Other improvements
id: Perbaikan lain
zh_hans: 其他改进

source: Other new features and changes introduced since Django 1.0 include:
id: Fitur baru dan perubahan diperkenalkan sejak Django 1.0 termasuk:
zh_hans: 自 Django 1.0 以来引入的其他新功能和更改包括：

source: The :doc:`CSRF protection middleware </ref/csrf>` has been split into two classes -- ``CsrfViewMiddleware`` checks incoming requests, and ``CsrfResponseMiddleware`` processes outgoing responses. The combined ``CsrfMiddleware`` class (which does both) remains for backwards-compatibility, but using the split classes is now recommended in order to allow fine-grained control of when and where the CSRF processing takes place.
id: :doc:`CSRF protection middleware </ref/csrf>` telah dipisah menjadi dua kelas -- ``CsrfViewMiddleware`` memeriksa permintaan datang, dan ``CsrfResponseMiddleware`` mengolah tanggapan keluar. Paduan kelas ``CsrfMiddleware`` (yang melakukan keduanya) tetap untuk kesesuaian-kebelakang, tetapi menggunakan kelas-kelas terpisah sekarang dianjurkan agar mengizinkan kendali jaringan-halus dari ketika dan dimana pengolahan CSRF mengambil tempat.+
zh_hans: :doc:`CSRF 保护中间件 </ref/csrf>` 现在分成了两个类 -- ``CsrfViewMiddleware`` 用于检查传入请求，而 ``CsrfResponseMiddleware`` 用于处理传出响应。合并的 ``CsrfMiddleware`` 类（同时处理两者）仍然存在以保持向后兼容性，但现在建议使用拆分的类来允许精细控制 CSRF 处理发生的时间和地点。

source: ``reverse()`` and code which uses it (e.g., the ``{% url %}`` template tag) now works with URLs in Django's administrative site, provided that the admin URLs are set up via ``include(admin.site.urls)`` (sending admin requests to the ``admin.site.root`` view still works, but URLs in the admin will not be "reversible" when configured this way).
id: `reverse()`` dan kode yang menggunakannya (sebagai contoh, etiket cetakan ``{% url %}``) sekarang bekerja dengan URL di situs administratif Django, asalkan URL admin disetel melalui ``include(admin.site.urls)`` (mengirim permintaan admin ke tampilan ``admin.site.root`` masih bekerja, tetapi URL di admin tidak akan "reversible" ketika mengkonfigurasi cara ini).
zh_hans: ``reverse()`` 和使用它的代码（例如，``{% url %}`` 模板标签）现在可以在 Django 的管理站点中使用，前提是通过 ``include(admin.site.urls)`` 设置了管理站点的 URL（仍然可以通过将管理请求发送到 ``admin.site.root`` 视图来工作，但以这种方式配置时，管理站点中的 URL 将无法“反向生成”）。

source: The ``include()`` function in Django URLconf modules can now accept sequences of URL patterns (generated by ``patterns()``) in addition to module names.
id: Fungsi ``include()`` di modul Django URLconf sekarang dapat menerima urutan dari pola URL (dibangkitkan oleh ``patterns()``) sebagai tambahan ke nama modul.
zh_hans: Django URLconf 模块中的 ``include()`` 函数现在可以接受 URL 模式的序列（由 ``patterns()`` 生成）以及模块名称。

source: Instances of Django forms (see :doc:`the forms overview </topics/forms/index>`) now have two additional methods, ``hidden_fields()`` and ``visible_fields()``, which return the list of hidden -- i.e., ``<input type="hidden">`` -- and visible fields on the form, respectively.
id: Contoh dari formulir Django (lihat :doc:`the forms overview </topics/forms/index>`) sekarang mempunyai dua metode tambahan, ``hidden_fields()`` dan ``visible_fields()``, yang mengembalikan daftar dari tersembunyi -- yaitu, ``<input type="hidden">`` -- dan bidang-bidang nampak pada formulir, masing-masing.
zh_hans: Django 表单的实例（参见 :doc:`表单概述 </topics/forms/index>`）现在具有两个额外的方法，``hidden_fields()`` 和 ``visible_fields()``，分别返回表单中隐藏字段（即 ``<input type="hidden">``）和可见字段的列表。

source: The ``redirect_to`` generic view now accepts an additional keyword argument ``permanent``. If ``permanent`` is ``True``, the view will emit an HTTP permanent redirect (status code 301). If ``False``, the view will emit an HTTP temporary redirect (status code 302).
id: Tampilan umum ``redirect_to`` sekarang menerima sebuah argumen kata kunci tambahan ``permanent``. Jika ``permanent`` adalah ``True``, tampilan akan mengeluarkan pengalihan tetap HTTP (kode keadaan 301). Jika ``False``, tampilan akan mengeluarkan pengalihan sementara HTTP (kode keadaan 302).
zh_hans: ``redirect_to`` 通用视图现在接受一个额外的关键字参数 ``permanent``。如果 ``permanent`` 为 ``True``，视图将发出 HTTP 永久重定向（状态码 301）。如果为 ``False``，视图将发出 HTTP 临时重定向（状态码 302）。

source: A new database lookup type -- ``week_day`` -- has been added for ``DateField`` and ``DateTimeField``. This type of lookup accepts a number between 1 (Sunday) and 7 (Saturday), and returns objects where the field value matches that day of the week. See :ref:`the full list of lookup types <field-lookups>` for details.
id: Jenis pencarian basisdata baru -- ``week_day`` -- telah ditambahkan untuk ``DateField`` dan ``DateTimeField``. Jenis ini dari pencarian menerima angka diantara 1 (Minggu) dan 7 (Sabtu), dan mengembalikan sebuah obyek dimana nilai bidang cocok hari itu dari minggu. Lihat :ref:`the full list of lookup types <field-lookups>` untuk rincian.
zh_hans: 已经为 ``DateField`` 和 ``DateTimeField`` 添加了一个新的数据库查找类型 -- ``week_day``。这种查找类型接受一个介于 1（星期日）和 7（星期六）之间的数字，并返回字段值匹配该周的对象。有关详细信息，请参阅 :ref:`查找类型的完整列表 <field-lookups>`。

source: The ``{% for %}`` tag in Django's template language now accepts an optional ``{% empty %}`` clause, to be displayed when ``{% for %}`` is asked to loop over an empty sequence. See :doc:`the list of built-in template tags </ref/templates/builtins>` for examples of this.
id: Etiket ``{% for %}`` di bahasa cetakan Django sekarang menerima sebuah pilihan klausa ``{% empty %}``, untuk ditampilkan ketika ``{% for %}`` diminta berputar terhadap urutan kosong. Lihat :doc:`the list of built-in template tags </ref/templates/builtins>` untuk contoh dari ini.
zh_hans: Django 模板语言中的 ``{% for %}`` 标签现在接受一个可选的 ``{% empty %}`` 子句，当 ``{% for %}`` 被要求循环遍历一个空序列时，可以显示该子句。有关示例，请参阅 :doc:`内置模板标签列表 </ref/templates/builtins>`。

source: The :djadmin:`dumpdata` management command now accepts individual model names as arguments, allowing you to export the data just from particular models.
id: Perintah pengelolaan :djadmin:`dumpdata` sekarang menerima nama model tersendiri sebagai argumen, mengizinkan anda untuk mengekspor data cukup dari model tertentu.
zh_hans: :djadmin:`dumpdata` 管理命令现在接受单个模型名称作为参数，允许你仅导出特定模型的数据。

source: There's a new :tfilter:`safeseq` template filter which works just like :tfilter:`safe` for lists, marking each item in the list as safe.
id: Ada cetakan penyaring :tfilter:`safeseq` baru yang bekerja seperti :tfilter:`safe` untuk daftar, menandai setiap barang di daftar sebagai safe.
zh_hans: 新增了一个 :tfilter:`safeseq` 模板过滤器，与 :tfilter:`safe` 类似，但用于列表，将列表中的每个项目标记为安全。

source: :doc:`Cache backends </topics/cache>` now support ``incr()`` and ``decr()`` commands to increment and decrement the value of a cache key. On cache backends that support atomic increment/decrement -- most notably, the memcached backend -- these operations will be atomic, and quite fast.
id: :doc:`Cache backends </topics/cache>` sekarang mendukung perintah ``incr()`` dan ``decr()`` untuk menaikkan dan menurunkan nilai dari kunci tembolok. Pada backend tembolok yang mendukung menaik/menurun kecil -- paling terutama, memcache backend -- tindakan ini akan menjadi kecil, dan sangat cepat.
zh_hans: :doc:`缓存后端 </topics/cache>` 现在支持 ``incr()`` 和 ``decr()`` 命令，用于增加和减少缓存键的值。在支持原子增加/减少的缓存后端上，尤其是 memcached 后端，这些操作将是原子的，而且非常快。

source: Django now can :doc:`easily delegate authentication to the web server </howto/auth-remote-user>` via a new authentication backend that supports the standard ``REMOTE_USER`` environment variable used for this purpose.
zh_hans: Django 现在可以通过一个新的身份验证后端轻松地将身份验证委托给 Web 服务器，该后端支持用于此目的的标准 ``REMOTE_USER`` 环境变量。请参阅 :doc:`如何将身份验证委托给 Web 服务器 </howto/auth-remote-user>` 以获取详细信息。

source: There's a new :func:`django.shortcuts.redirect` function that makes it easier to issue redirects given an object, a view name, or a URL.
id: Ada fungsi :func:`django.shortcuts.redirect` baru yang membuatnya lebih mudah mengeluarkan pengalihan yang diberikan sebuah obyek, nama tampilan, atau URL.
zh_hans: 新增了一个 :func:`django.shortcuts.redirect` 函数，使得根据对象、视图名称或 URL 发出重定向变得更加容易。

source: The ``postgresql_psycopg2`` backend now supports :ref:`native PostgreSQL autocommit <postgresql-notes>`. This is an advanced, PostgreSQL-specific feature, that can make certain read-heavy applications a good deal faster.
id: Backend ``postgresql_psycopg2`` sekarang mendukung :ref:`native PostgreSQL autocommit <postgresql-notes>`. Ini merupakan lanjutan, fitur khusus-PostgreSQL, yang dapat membuat aplikasi tertentu membaca-berat menjadi lebih cepat.
zh_hans: ``postgresql_psycopg2`` 后端现在支持 :ref:`本地 PostgreSQL 自动提交 <postgresql-notes>`。这是一个高级的、特定于 PostgreSQL 的功能，可以使某些读密集型应用程序变得更加快速。

source: What's next?
id: Apa Selanjutnya?
zh_hans: 接下来是什么?

source: We'll take a short break, and then work on Django 1.2 will begin -- no rest for the weary! If you'd like to help, discussion of Django development, including progress toward the 1.2 release, takes place daily on the |django-developers| mailing list and in the ``#django-dev`` IRC channel on ``irc.libera.chat``. Feel free to join the discussions!
zh_hans: 我们会休息一下，然后开始 Django 1.2 的工作 —— 休息是为了走更远！如果你想要帮助，关于 Django 开发的讨论，包括朝向 1.2 版本的进展，每天都在 |django-developers| 邮件列表和 ``#django-dev`` IRC 频道上进行。欢迎加入讨论！

source: Django's online documentation also includes pointers on how to contribute to Django:
id: Dokumentasi daring Django juga menyertakan petunjuk pada bagaimana membantu Django:
zh_hans: Django 的在线文档还包括如何为 Django 做出贡献的指南：

source: :doc:`How to contribute to Django </internals/contributing/index>`
zh_hans: :doc:`如何为 Django 做贡献 </internals/contributing/index>`

source: Contributions on any level -- developing code, writing documentation or simply triaging tickets and helping to test proposed bugfixes -- are always welcome and appreciated.
id: Bantuan pada tiap tingkatan -- mengembangkan kode, menulis dokumentasi atau hanya mendahulukan tiket dan membantu untuk mencoba perbaikan kesalahan yang diajukan -- selalu disambut dan dihargai.
zh_hans: 对于任何级别的贡献，无论是开发代码、撰写文档还是简单地对问题进行筛选并帮助测试提议的错误修复，我们都非常欢迎和感激。

source: And that's the way it is.
id: Dan itulah cara itu.
zh_hans: 就是这样。

source: Django 1.1.2 release notes
id: Catatan terbitan Django 1.1.2
zh_hans: Django 1.1.2 版本发行说明

source: Welcome to Django 1.1.2!
id: Selamat datang di Django 1.1.2!
zh_hans: 欢迎来到 Django 1.1.2 版本！

source: This is the second "bugfix" release in the Django 1.1 series, improving the stability and performance of the Django 1.1 codebase.
id: Ini adalah terbitan "bugfix" kedua di rangkaian Django 1.1, memperbaiki kestabilan dan penampilan dari basis kode Django 1.1.
zh_hans: 这是 Django 1.1 系列的第二个“错误修复”版本，改进了 Django 1.1 代码库的稳定性和性能。

source: Django 1.1.2 maintains backwards compatibility with Django 1.1.0, but contain a number of fixes and other improvements. Django 1.1.2 is a recommended upgrade for any development or deployment currently using or targeting Django 1.1.
id: Django 1.1.2 merawat kesesuaian kebelakang dengan Django 1.1.0, tetapi mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.1.2 adalah peningkatan yang dianjurkan untuk setiap pengembangan atau penyebaran saat ini menggunakan atau menyasar Django 1.1.
zh_hans: Django 1.1.2 保持与 Django 1.1.0 的向后兼容性，但包含了许多修复和其他改进。对于当前使用或针对 Django 1.1 的任何开发或部署，建议升级到 Django 1.1.2 。

source: For full details on the new features, backwards incompatibilities, and deprecated features in the 1.1 branch, see the :doc:`/releases/1.1`.
id: Untuk rincian penuh pada fitur baru, ketidaksesuaian kebelakang, dan fitur diusangkan di cabang 1.1, lihat :doc:`/releases/1.1`.
zh_hans: 有关 1.1 分支中新功能、向后不兼容性和已弃用功能的详细信息，请参阅 :doc:`/releases/1.1`。

source: Backwards-incompatible changes in 1.1.2
id: Perubahan bertentangan kebelakang di 1.1.2
zh_hans: 1.1.2 中的不向后兼容的变更

source: Test runner exit status code
id: Kode keadaan keluar penjalan percobaan
zh_hans: 测试运行器退出状态码

source: The exit status code of the test runners (``tests/runtests.py`` and ``python manage.py test``) no longer represents the number of failed tests, since a failure of 256 or more tests resulted in a wrong exit status code. The exit status code for the test runner is now 0 for success (no failing tests) and 1 for any number of test failures. If needed, the number of test failures can be found at the end of the test runner's output.
id: Kode keadaan keluar dari penjalan percobaan (``tests/runtests.py`` dan ``python manage.py test``) tidak lagi mewakili sejumlah percobaan gagal, sejak kegagalan dari 256 atu lebih percobaan dihasilkan di kode keadaan keluar salah. Kode keadaan keluar untuk penjalan percobaan sekarang 0 untuk berhasil (tidak ada kegagalan percobaan) dan 1 untuk tiap angka dari kegagalan percobaan. Jika dibutuhkan, sejumlah kegagalan percobaan dapat ditemukan di akhir dari keluaran penjalan percobaan.
zh_hans: 测试运行器（``tests/runtests.py`` 和 ``python manage.py test``）的退出状态代码不再表示失败的测试数量，因为失败 256 个或更多测试会导致错误的退出状态代码。现在测试运行器的退出状态代码为 0 表示成功（没有失败的测试），为 1 表示任何数量的测试失败。如果需要，可以在测试运行器的输出末尾找到测试失败的数量。

source: Cookie encoding
id: Menyandi kue
zh_hans: Cookie 编码

source: To fix bugs with cookies in Internet Explorer, Safari, and possibly other browsers, our encoding of cookie values was changed so that the characters comma and semi-colon are treated as non-safe characters, and are therefore encoded as ``\054`` and ``\073`` respectively. This could produce backwards incompatibilities, especially if you are storing comma or semi-colon in cookies and have JavaScript code that parses and manipulates cookie values client-side.
id: Untuk memperbaiki kesalahan dengan kue di Internet Explorer, Safari, dan kemungkinan peramban lain, penyandian kami dari nilai kue telah dirubah sehingga karakter koma dan titika koma diperlakukan sebagai karakter tidak-aman, dan karena itu di sandikan masing-masing sebagai ``\054`` dan ``\073``. Ini dapat menghasilkan ketidaksesuaian kebelakang, khususnya jika anda menyimpan koma atau titik koma di kue dan memiliki kode JavaScript dan merubah nilai kue di sisi klien.
zh_hans: 为了修复在 Internet Explorer、Safari 和可能其他浏览器中的 cookie 问题，我们更改了对 cookie 值的编码，使逗号和分号字符被视为非安全字符，因此编码为 ``\054`` 和 ``\073``。这可能会产生向后不兼容性，特别是如果您在 cookie 中存储逗号或分号，并且有客户端 JavaScript 代码解析和操作 cookie 值。

source: One new feature
id: Satu fitur baru
zh_hans: 一个新功能

source: Ordinarily, a point release would not include new features, but in the case of Django 1.1.2, we have made an exception to this rule. Django 1.2 (the next major release of Django) will contain a feature that will improve protection against Cross-Site Request Forgery (CSRF) attacks. This feature requires the use of a new :ttag:`csrf_token` template tag in all forms that Django renders.
id: Biasanya, titik terbitan akan tidak menyertakan fitur baru, tetapi di kasus Django 1.1.2, kami telah membuat sebuah pengecualian pada aturan ini. Django 1.2 (terbitan utama selanjutnya dari Django) akan mengandung sebuah fitur yang akan memperbaiki terhadap serangan Cross-Site Request Forgery (CSRF). Fitur ini membutuhkan penggunakaan etiket cetakan :ttag:`csrf_token` baru di semua formulir yang Django bangun.
zh_hans: 通常，小版本发布不会包括新功能，但在 Django 1.1.2 中，我们对这一规则做了一个例外。Django 1.2（Django 的下一个主要版本）将包含一个改进跨站请求伪造（CSRF）攻击防护的功能。这个功能要求在 Django 渲染的所有表单中使用新的 :ttag:`csrf_token` 模板标签。

source: To make it easier to support both 1.1.X and 1.2.X versions of Django with the same templates, we have decided to introduce the :ttag:`csrf_token` template tag to the 1.1.X branch. In the 1.1.X branch, :ttag:`csrf_token` does nothing - it has no effect on templates or form processing. However, it means that the same template will work with Django 1.2.
id: Untuk membuatnya lebih mudah untuk mendukung kedua versi 1.1.X dan 1.2.X dari Django dengan cetakan sama, kami telah memutuskan memperkenalkan etiket cetakan :ttag:`csrf_token` pada cabang 1.1.X. Di cabang 1.1.X, :ttag:`csrf_token` tidak melakukan apapun - itu tidak mempunyai pengaruh pada cetakan atau pengolahan formulir, itu berarti bahwa cetakan sama akan bekerja dengan Django 1.2.
zh_hans: 为了更容易支持相同的模板同时运行在 1.1.X 和 1.2.X 版本的 Django 上，我们决定将 :ttag:`csrf_token` 模板标签引入到 1.1.X 分支。在 1.1.X 分支中，:ttag:`csrf_token` 没有任何作用 - 它对模板或表单处理没有影响。然而，这意味着相同的模板将能够在 Django 1.2 上正常工作。

source: Django 1.1.3 release notes
id: Catatan terbitan Django 1.1.3
zh_hans: Django 1.1.3 版本发行说明

source: Welcome to Django 1.1.3!
id: Selamat datang di Django 1.1.3!
zh_hans: 欢迎来到 Django 1.1.3 版本！

source: This is the third "bugfix" release in the Django 1.1 series, improving the stability and performance of the Django 1.1 codebase.
id: Ini adalah terbitan "bugfix" ketiga di rangkaian Django 1.1, memperbaiki kestabilan dan penampilan dari kode dasar Django 1.1.
zh_hans: 这是 Django 1.1 系列的第三个“修复错误”版本，改进了 Django 1.1 代码库的稳定性和性能。

source: With one exception, Django 1.1.3 maintains backwards compatibility with Django 1.1.2. It also contains a number of fixes and other improvements. Django 1.1.2 is a recommended upgrade for any development or deployment currently using or targeting Django 1.1.
id: Dengan satu pengecualian, Django 1.1.3 merawat kesesuaian kebelakang dengan Django 1.1.2. Itu juga mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.1.2 adalah peningkatan dianjurkan untuk setiap pengembangan dan penyebaran saat ini menggunakan atau menyasar Django 1.1.
zh_hans: 除一个例外之外，Django 1.1.3 与 Django 1.1.2 保持向后兼容。它还包含了一些修复和其他改进。对于当前使用或针对 Django 1.1 的任何开发或部署，Django 1.1.2 是一个推荐的升级版本。

source: Backwards incompatible changes
id: Perubahan bertentangan kebelakang
zh_hans: 不向后兼容的变更

source: Restricted filters in admin interface
id: Batasan penyaring di antarmuka admin
zh_hans: 在管理界面中的受限过滤器

source: The Django administrative interface, ``django.contrib.admin``, supports filtering of displayed lists of objects by fields on the corresponding models, including across database-level relationships. This is implemented by passing lookup arguments in the querystring portion of the URL, and options on the ModelAdmin class allow developers to specify particular fields or relationships which will generate automatic links for filtering.
id: Antarmuka administratif Django, ``django.contrib.admin``, mendukung penyaringan dari daftar ditampilkan dari obyek-obyek oleh bidang-bidang pada model sesuai, termasuk hubungan lintas tingkat-basisdata. Ini diterapkan dengan melewatkan argumen pencarian di bagian querystring dari URL, dan pilihan pada kelas ModelAfmin mengizinkan pengembang untuk menentukan bidang-bidang atau hubungan khusus yang akan membangkitkan tautan otomatis untuk penyaringan.
zh_hans: Django 的管理界面，``django.contrib.admin``，支持通过对应模型上的字段对显示的对象列表进行筛选，包括跨数据库级别的关系。这是通过在 URL 的查询字符串部分传递查找参数来实现的，ModelAdmin 类上的选项允许开发人员指定特定字段或关系，这将生成自动链接用于筛选。

source: One historically-undocumented and -unofficially-supported feature has been the ability for a user with sufficient knowledge of a model's structure and the format of these lookup arguments to invent useful new filters on the fly by manipulating the querystring.
id: Satu riwayat tidak didokumetasi dan fitur -dukungan-tidak resmi telah mampu untuk pengguna dengan pengetahuan cukup dari struktur model dan bentuk dari argumen pencarian ini untuk membuat penyaring baru berguna dengan cepat dengan merubah permintaan deretan karakter.
zh_hans: 一个历史上未记录且非官方支持的功能是，用户如果对模型结构和查询参数的格式有足够的了解，可以通过操作查询字符串来动态创建有用的新过滤器。
