Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a regression where ``Model._state.adding`` wasn't set correctly on multi-table inheritance parent models after saving a child model (:ticket:`28210`).
id: Diperbaiki pemulihan dimana ``Model._state.adding`` tidak disetel dengan benar pada model induk warisan banyak-tabel setelah menyimpan model anak (:ticket:`28210`).
zh_hans: 修复了在保存子模型后，多表继承父模型上未正确设置 ``Model._state.adding`` 的退化问题 (:ticket:`28210`)。

source: Allowed ``DjangoJSONEncoder`` to serialize ``django.utils.deprecation.CallableBool`` (:ticket:`28230`).
id: Diizinkan ``DjangoJSONEncoder`` untuk menserialisasi ``django.utils.deprecation.CallableBool`` (:ticket:`28230`).
zh_hans: 允许 ``DjangoJSONEncoder`` 序列化 ``django.utils.deprecation.CallableBool`` (:ticket:`28230`)。

source: Relaxed the validation added in Django 1.11 of the fields in the ``defaults`` argument of ``QuerySet.get_or_create()`` and ``update_or_create()`` to reallow settable model properties (:ticket:`28222`).
id: Disantaikan pengesahan ditambahkan dalam Django 1.11 dalam argumen ``defaults`` dari ``QuerySet.get_or_create()`` dan ``update_or_create()`` untuk mengizinkan kembali sifat model dapat disetel (:ticket:`28222`).
zh_hans: 放宽了在 Django 1.11 中添加到 ``QuerySet.get_or_create()`` 和 ``update_or_create()`` 的 ``defaults`` 参数中字段的验证，以允许重新设置可设置的模型属性 (:ticket:`28222`)。

source: Fixed ``MultipleObjectMixin.paginate_queryset()`` crash on Python 2 if the ``InvalidPage`` message contains non-ASCII (:ticket:`28204`).
id: Diperbaiki kegagalan ``MultipleObjectMixin.paginate_queryset()`` pada Python 2 jika pesan ``InvalidPage`` mengandung bukan-ASCII (:ticket:`28204`).
zh_hans: 修复了在 Python 2 上，如果 ``InvalidPage`` 消息包含非 ASCII 字符，则导致 ``MultipleObjectMixin.paginate_queryset()`` 崩溃的问题 (:ticket:`28204`)。

source: Prevented ``Subquery`` from adding an unnecessary ``CAST`` which resulted in invalid SQL (:ticket:`28199`).
id: Dicegah ``Subquery`` dari menambahkan ``CAST`` tidak diperlukan yang dihasilkan dalam SQL tidak sah (:ticket:`28199`).
zh_hans: 防止 ``Subquery`` 添加不必要的 ``CAST``，导致生成无效的 SQL (:ticket:`28199`)。

source: Corrected detection of GDAL 2.1 on Windows (:ticket:`28181`).
id: Diperbaiki pengenalan dari GDAL 2.1 pada Windows (:ticket:`28181`).
zh_hans: 已更正在 Windows 上检测 GDAL 2.1 的问题 (:ticket:`28181`)。

source: Made date-based generic views return a 404 rather than crash when given an out of range date (:ticket:`28209`).
id: Dibuat tampilan umum berdasarkan-tanggal mengembalikan 404 daripada kegagalan ketika diberikan sebuah tanggal diluar jangkauan (:ticket:`28209`).
zh_hans: 使基于日期的通用视图在收到超出范围的日期时返回 404 而不是崩溃 (:ticket:`28209`)。

source: Fixed a regression where ``file_move_safe()`` crashed when moving files to a CIFS mount (:ticket:`28170`).
id: Diperbaiki pemulihan dimana ``file_move_safe()`` gagal ketika memindahkan berkas ke ikatan CIFS(:ticket:`28170`).
zh_hans: 修复了 ``file_move_safe()`` 在将文件移动到 CIFS 挂载点时崩溃的退化问题 (:ticket:`28170`)。

source: Moved the ``ImageField`` file extension validation added in Django 1.11 from the model field to the form field to reallow the use case of storing images without an extension (:ticket:`28242`).
id: Dipindahkan pengesahan tambahan berkas ``ImageField`` ditambahkan di Django 1.11 dari bidang model pada bidang formulir untuk mengizinkan kembali penggunaan kasus dari menyimpan gambar tanpa sebuah perpanjangan (:ticket:`28242`).
zh_hans: 将 Django 1.11 中添加的 ``ImageField`` 文件扩展名验证从模型字段移到表单字段，以允许存储没有扩展名的图像的用例 (:ticket:`28242`)。

source: Django 1.11.20 release notes
zh_hans: Django 1.11.20 版本发行说明

source: Django 1.11.20 fixes a packaging error in 1.11.19.
zh_hans: Django 1.11.20 修复了 1.11.19 中的一个打包错误。

source: Corrected packaging error from 1.11.19 (:ticket:`30175`).
zh_hans: 已纠正了来自 1.11.19 的打包错误 (:ticket:`30175`)。

source: Django 1.11.21 release notes
zh_hans: Django 1.11.21 版本发行说明

source: *June 3, 2019*
zh_hans: *2019 年 6 月 3 日*

source: Django 1.11.21 fixes a security issue in 1.11.20.
zh_hans: Django 1.11.21 修复了 1.11.20 中的一个安全问题。

source: CVE-2019-12308: AdminURLFieldWidget XSS
zh_hans: CVE-2019-12308 ： AdminURLFieldWidget 跨站脚本攻击（XSS）

source: The clickable "Current URL" link generated by ``AdminURLFieldWidget`` displayed the provided value without validating it as a safe URL. Thus, an unvalidated value stored in the database, or a value provided as a URL query parameter payload, could result in an clickable JavaScript link.
zh_hans: 由 ``AdminURLFieldWidget`` 生成的可点击的 "当前 URL" 链接显示了提供的值，而没有将其验证为安全的 URL。因此，存储在数据库中的未经验证的值，或者作为 URL 查询参数有效载荷提供的值，都可能导致可点击的 JavaScript 链接。

source: ``AdminURLFieldWidget`` now validates the provided value using :class:`~django.core.validators.URLValidator` before displaying the clickable link. You may customize the validator by passing a ``validator_class`` kwarg to ``AdminURLFieldWidget.__init__()``, e.g. when using :attr:`~django.contrib.admin.ModelAdmin.formfield_overrides`.
zh_hans: 现在，在显示可点击链接之前，``AdminURLFieldWidget`` 使用 :class:`~django.core.validators.URLValidator` 对提供的值进行验证。您可以通过将 ``validator_class`` 关键字参数传递给 ``AdminURLFieldWidget.__init__()`` 来自定义验证器，例如在使用 :attr:`~django.contrib.admin.ModelAdmin.formfield_overrides` 时。

source: Django 1.11.22 release notes
zh_hans: Django 1.11.22 版本发行说明

source: *July 1, 2019*
zh_hans: *2019 年 7 月 1 日*

source: Django 1.11.22 fixes a security issue in 1.11.21.
zh_hans: Django 1.11.22 修复了 1.11.21 中的一个安全问题。

source: CVE-2019-12781: Incorrect HTTP detection with reverse-proxy connecting via HTTPS
zh_hans: CVE-2019-12781 ：通过 HTTPS 连接的反向代理中，HTTP 检测不正确。

source: When deployed behind a reverse-proxy connecting to Django via HTTPS, :attr:`django.http.HttpRequest.scheme` would incorrectly detect client requests made via HTTP as using HTTPS. This entails incorrect results for :meth:`~django.http.HttpRequest.is_secure`, and :meth:`~django.http.HttpRequest.build_absolute_uri`, and that HTTP requests would not be redirected to HTTPS in accordance with :setting:`SECURE_SSL_REDIRECT`.
zh_hans: 当部署在反向代理后面，通过 HTTPS 连接到 Django 时，:attr:`django.http.HttpRequest.scheme` 会错误地将客户端通过 HTTP 发送的请求检测为使用 HTTPS。这导致了 :meth:`~django.http.HttpRequest.is_secure` 和 :meth:`~django.http.HttpRequest.build_absolute_uri` 的不正确结果，以及 HTTP 请求不会根据 :setting:`SECURE_SSL_REDIRECT` 进行重定向到 HTTPS。

source: ``HttpRequest.scheme`` now respects :setting:`SECURE_PROXY_SSL_HEADER`, if it is configured, and the appropriate header is set on the request, for both HTTP and HTTPS requests.
zh_hans: 现在，``HttpRequest.scheme`` 会根据配置的 :setting:`SECURE_PROXY_SSL_HEADER`，如果已配置，并且请求上设置了适当的标头，对于 HTTP 和 HTTPS 请求都会进行相应的处理。

source: If you deploy Django behind a reverse-proxy that forwards HTTP requests, and that connects to Django via HTTPS, be sure to verify that your application correctly handles code paths relying on ``scheme``, ``is_secure()``, ``build_absolute_uri()``, and ``SECURE_SSL_REDIRECT``.
zh_hans: 如果您在反向代理后面部署 Django，该代理转发 HTTP 请求并通过 HTTPS 连接到 Django，请确保验证您的应用程序正确处理依赖于 ``scheme``、``is_secure()``、``build_absolute_uri()`` 和 ``SECURE_SSL_REDIRECT`` 的代码路径。

source: Django 1.11.23 release notes
zh_hans: Django 1.11.23 版本发行说明

source: *August 1, 2019*
zh_hans: *2019 年 8 月 1 日*

source: Django 1.11.23 fixes security issues in 1.11.22.
zh_hans: Django 1.11.23 修复了 1.11.22 中的安全问题。

source: CVE-2019-14232: Denial-of-service possibility in ``django.utils.text.Truncator``
zh_hans: CVE-2019-14232: ``django.utils.text.Truncator`` 中存在拒绝服务可能性问题。

source: If ``django.utils.text.Truncator``'s ``chars()`` and ``words()`` methods were passed the ``html=True`` argument, they were extremely slow to evaluate certain inputs due to a catastrophic backtracking vulnerability in a regular expression. The ``chars()`` and ``words()`` methods are used to implement the :tfilter:`truncatechars_html` and :tfilter:`truncatewords_html` template filters, which were thus vulnerable.
zh_hans: 如果 ``django.utils.text.Truncator`` 的 ``chars()`` 和 ``words()`` 方法传递了 ``html=True`` 参数，它们在处理某些输入时非常慢，这是由于正则表达式中的灾难性回溯漏洞引起的。``chars()`` 和 ``words()`` 方法用于实现 :tfilter:`truncatechars_html` 和 :tfilter:`truncatewords_html` 模板过滤器，因此这两个过滤器也存在漏洞。

source: The regular expressions used by ``Truncator`` have been simplified in order to avoid potential backtracking issues. As a consequence, trailing punctuation may now at times be included in the truncated output.
zh_hans: 为了避免潜在的回溯问题，``Truncator`` 使用的正则表达式已经简化。因此，尾部的标点符号可能会有时包含在截断后的输出中。

source: CVE-2019-14233: Denial-of-service possibility in ``strip_tags()``
zh_hans: CVE-2019-14233: ``strip_tags()`` 中存在拒绝服务可能性问题。

source: Due to the behavior of the underlying ``HTMLParser``, :func:`django.utils.html.strip_tags` would be extremely slow to evaluate certain inputs containing large sequences of nested incomplete HTML entities. The ``strip_tags()`` method is used to implement the corresponding :tfilter:`striptags` template filter, which was thus also vulnerable.
zh_hans: 由于底层的 ``HTMLParser`` 的行为，:func:`django.utils.html.strip_tags` 在处理包含大量嵌套不完整 HTML 实体序列的某些输入时会变得非常慢。``strip_tags()`` 方法用于实现相应的 :tfilter:`striptags` 模板过滤器，因此这两个过滤器也存在漏洞。

source: ``strip_tags()`` now avoids recursive calls to ``HTMLParser`` when progress removing tags, but necessarily incomplete HTML entities, stops being made.
zh_hans: 现在，``strip_tags()`` 在删除标签时避免了对 ``HTMLParser`` 的递归调用，但当进度停止删除标签但仍存在不完整的 HTML 实体时，它会继续运行。

source: Remember that absolutely NO guarantee is provided about the results of ``strip_tags()`` being HTML safe. So NEVER mark safe the result of a ``strip_tags()`` call without escaping it first, for example with :func:`django.utils.html.escape`.
zh_hans: 请记住，``strip_tags()`` 的结果绝对不保证是安全的 HTML。因此，在将 ``strip_tags()`` 调用的结果标记为安全之前，绝对不要忘记首先进行转义，例如使用 :func:`django.utils.html.escape`。

source: CVE-2019-14234: SQL injection possibility in key and index lookups for ``JSONField``/``HStoreField``
zh_hans: CVE-2019-14234: 在 ``JSONField``/``HStoreField`` 的键和索引查找中存在 SQL 注入可能性。

source: :lookup:`Key and index lookups <jsonfield.key>` for ``django.contrib.postgres.fields.JSONField`` and :lookup:`key lookups <hstorefield.key>` for :class:`~django.contrib.postgres.fields.HStoreField` were subject to SQL injection, using a suitably crafted dictionary, with dictionary expansion, as the ``**kwargs`` passed to ``QuerySet.filter()``.
zh_hans: ``django.contrib.postgres.fields.JSONField`` 的 :lookup:`键和索引查找 <jsonfield.key>`，以及 :class:`~django.contrib.postgres.fields.HStoreField` 的 :lookup:`键查找 <hstorefield.key>`，都受到了 SQL 注入的影响，使用适当构造的字典，并将其作为传递给 ``QuerySet.filter()`` 的 ``**kwargs`` 进行字典扩展。

source: CVE-2019-14235: Potential memory exhaustion in ``django.utils.encoding.uri_to_iri()``
zh_hans: CVE-2019-14235: ``django.utils.encoding.uri_to_iri()`` 中存在潜在的内存耗尽问题。

source: If passed certain inputs, :func:`django.utils.encoding.uri_to_iri` could lead to significant memory usage due to excessive recursion when re-percent-encoding invalid UTF-8 octet sequences.
zh_hans: 如果传递了特定的输入，:func:`django.utils.encoding.uri_to_iri` 在重新百分号编码无效的 UTF-8 八位序列时可能会导致显着的内存使用，因为它会发生过多的递归。

source: ``uri_to_iri()`` now avoids recursion when re-percent-encoding invalid UTF-8 octet sequences.
zh_hans: 现在，``uri_to_iri()`` 在重新百分号编码无效的 UTF-8 八位序列时避免了递归。

source: Django 1.11.24 release notes
zh_hans: Django 1.11.24 版本发行说明

source: *September 2, 2019*
zh_hans: *2019 年 9 月 2 日*

source: Django 1.11.24 fixes a regression in 1.11.23.
zh_hans: Django 1.11.24 修复了 1.11.23 中的一个缺陷。

source: Fixed crash of ``KeyTransform()`` for ``django.contrib.postgres.fields.JSONField`` and :class:`~django.contrib.postgres.fields.HStoreField` when using on expressions with params (:ticket:`30672`).
zh_hans: 修复了在使用带参数的表达式时，``KeyTransform()`` 对于 ``django.contrib.postgres.fields.JSONField`` 和 :class:`~django.contrib.postgres.fields.HStoreField` 的崩溃问题 (:ticket:`30672`)。

source: Django 1.11.25 release notes
zh_hans: Django 1.11.25 版本发行说明

source: *October 1, 2019*
zh_hans: *2019 年 10 月 1 日*

source: Django 1.11.25 fixes a regression in 1.11.23.
zh_hans: Django 1.11.25 修复了 1.11.23 中的一个缺陷。

source: Fixed a crash when filtering with a ``Subquery()`` annotation of a queryset containing ``django.contrib.postgres.fields.JSONField`` or :class:`~django.contrib.postgres.fields.HStoreField` (:ticket:`30769`).
zh_hans: 修复了在使用包含 ``django.contrib.postgres.fields.JSONField`` 或 :class:`~django.contrib.postgres.fields.HStoreField` 的 queryset 的 ``Subquery()`` 注释进行筛选时的崩溃问题 (:ticket:`30769`)。

source: Django 1.11.26 release notes
zh_hans: Django 1.11.26 版本发行说明

source: *November 4, 2019*
zh_hans: *2019 年 11 月 4 日*

source: Django 1.11.26 fixes a regression in 1.11.25.
zh_hans: Django 1.11.26 修复了 1.11.25 中的一个缺陷。

source: Fixed a crash when using a ``contains``, ``contained_by``, ``has_key``, ``has_keys``, or ``has_any_keys`` lookup on ``django.contrib.postgres.fields.JSONField``, if the right or left hand side of an expression is a key transform (:ticket:`30826`).
zh_hans: 修复了在 ``django.contrib.postgres.fields.JSONField`` 上使用 ``contains``、``contained_by``、``has_key``、``has_keys`` 或 ``has_any_keys`` 查找时的崩溃问题，如果表达式的左侧或右侧是键转换 (:ticket:`30826`)。

source: Django 1.11.27 release notes
zh_hans: Django 1.11.27 版本发行说明

source: *December 18, 2019*
zh_hans: *2019 年 12 月 18 日*

source: Django 1.11.27 fixes a security issue and a data loss bug in 1.11.26.
zh_hans: Django 1.11.27 修复了 1.11.26 中的一个安全问题和一个数据丢失漏洞。

source: CVE-2019-19844: Potential account hijack via password reset form
zh_hans: CVE-2019-19844 ：通过密码重置表单可能导致账户劫持

source: By submitting a suitably crafted email address making use of Unicode characters, that compared equal to an existing user email when lower-cased for comparison, an attacker could be sent a password reset token for the matched account.
zh_hans: 通过提交一个精心设计的电子邮件地址，利用 Unicode 字符使其与现有用户电子邮件在进行比较时转换为小写后相等，攻击者可以为匹配的帐户发送密码重置令牌。

source: In order to avoid this vulnerability, password reset requests now compare the submitted email using the stricter, recommended algorithm for case-insensitive comparison of two identifiers from `Unicode Technical Report 36, section 2.11.2(B)(2)`__. Upon a match, the email containing the reset token will be sent to the email address on record rather than the submitted address.
zh_hans: 为了避免这个漏洞，密码重置请求现在使用更严格、推荐的算法来比较提交的电子邮件，用于不区分大小写比较两个标识符的算法来自 `Unicode Technical Report 36, section 2.11.2(B)(2)`__。如果匹配成功，包含重置令牌的电子邮件将发送到记录的电子邮件地址，而不是提交的地址。

source: Fixed a data loss possibility in :class:`~django.contrib.postgres.forms.SplitArrayField`. When using with ``ArrayField(BooleanField())``, all values after the first ``True`` value were marked as checked instead of preserving passed values (:ticket:`31073`).
zh_hans: 修复了 :class:`~django.contrib.postgres.forms.SplitArrayField` 中的数据丢失可能性。当与 ``ArrayField(BooleanField())`` 一起使用时，第一个 ``True`` 值后的所有值都被标记为已选中，而不是保留传递的值 (:ticket:`31073`)。

source: Django 1.11.28 release notes
zh_hans: Django 1.11.28 版本发行说明

source: *February 3, 2020*
zh_hans: *2020 年 2 月 3 日*

source: Django 1.11.28 fixes a security issue in 1.11.27.
zh_hans: Django 1.11.28 修复了 1.11.27 中的一个安全问题。

source: CVE-2020-7471: Potential SQL injection via ``StringAgg(delimiter)``
zh_hans: CVE-2020-7471: 通过 ``StringAgg(delimiter)`` 可能存在 SQL 注入风险。

source: :class:`~django.contrib.postgres.aggregates.StringAgg` aggregation function was subject to SQL injection, using a suitably crafted ``delimiter``.
zh_hans: :class:`~django.contrib.postgres.aggregates.StringAgg` 聚合函数存在 SQL 注入风险，使用适当构造的 ``delimiter``。

source: Django 1.11.29 release notes
zh_hans: Django 1.11.29 版本发行说明

source: *March 4, 2020*
zh_hans: *2020 年 3 月 4 日*

source: Django 1.11.29 fixes a security issue in 1.11.28.
zh_hans: Django 1.11.29 修复了 1.11.28 中的一个安全问题。

source: CVE-2020-9402: Potential SQL injection via ``tolerance`` parameter in GIS functions and aggregates on Oracle
zh_hans: CVE-2020-9402: 在 Oracle 上的 GIS 函数和聚合中，通过 ``tolerance`` 参数可能存在 SQL 注入风险。

source: GIS functions and aggregates on Oracle were subject to SQL injection, using a suitably crafted ``tolerance``.
zh_hans: 在 Oracle 上的 GIS 函数和聚合存在 SQL 注入风险，使用适当构造的 ``tolerance``。

source: Django 1.11.3 release notes
id: Catatan terbitan Django 1.11.3
zh_hans: Django 1.11.3 版本发行说明

source: *July 1, 2017*
id: *1 Juli 2017*
zh_hans: *2017 年 7 月 1 日*

source: Django 1.11.3 fixes several bugs in 1.11.2.
id: Django 1.11.3 memperbaiki beberapa kesalahan di 1.11.2.
zh_hans: Django 1.11.3 修复了 1.11.2 中的几个漏洞。

source: Removed an incorrect deprecation warning about a missing ``renderer`` argument if a ``Widget.render()`` method accepts ``**kwargs`` (:ticket:`28265`).
id: Dipindahkan peringatan pengusangan tidak benar tentang argumen ``renderer`` hilang jika sebuah metode ``Widget.render()``menerima ``**kwargs`` (:ticket:`28265`).
zh_hans: 移除了关于如果 ``Widget.render()`` 方法接受 ``**kwargs`` 则缺少 ``renderer`` 参数的不正确弃用警告 (:ticket:`28265`)。

source: Fixed a regression causing ``Model.__init__()`` to crash if a field has an instance only descriptor (:ticket:`28269`).
id: Diperbaiki pemulihan menyebabkan kegagalan ``Model.__init__()`` jika bidang mempunyai sebuah jarak hanya penjelas (:ticket:`28269`).
zh_hans: 修复了导致如果一个字段具有实例特定的描述符，则 ``Model.__init__()`` 崩溃的退化问题 (:ticket:`28269`)。

source: Fixed an incorrect ``DisallowedModelAdminLookup`` exception when using a nested reverse relation in ``list_filter`` (:ticket:`28262`).
id: Diperbaiki pengecualian ``DisallowedModelAdminLookup`` tidak benar ketika menggunakan hubungan membalikkan bersarang dalam ``list_filter`` (:ticket:`28262`).
zh_hans: 修复了在 ``list_filter`` 中使用嵌套的反向关系时出现的不正确的 ``DisallowedModelAdminLookup`` 异常 (:ticket:`28262`)。

source: Fixed admin's ``FieldListFilter.get_queryset()`` crash on invalid input (:ticket:`28202`).
id: Diperbaiki kegagalan ``FieldListFilter.get_queryset()`` admin pada masukan tidak sah (:ticket:`28202`).
zh_hans: 修复了在管理员的 ``FieldListFilter.get_queryset()`` 上输入无效数据时的崩溃问题 (:ticket:`28202`)。

source: Fixed invalid HTML for a required ``AdminFileWidget`` (:ticket:`28278`).
id: Diperbaiki HTML tidak sah untuk ``AdminFileWidget`` diwajibkan (:ticket:`28278`).
zh_hans: 修复了对于必填的 ``AdminFileWidget`` 生成的无效 HTML (:ticket:`28278`)。

source: Fixed model initialization to set the name of class-based model indexes for models that only inherit ``models.Model`` (:ticket:`28282`).
id: Diperbaiki model pengawalan untuk menyetel nama dari indeks model berdasarkan-kelas untuk model hanya mewarisi ``models.Model`` (:ticket:`28282`).
zh_hans: 修复了对于仅继承 ``models.Model`` 的模型，设置基于类的模型索引的名称的模型初始化问题 (:ticket:`28282`)。

source: Fixed crash in admin's inlines when a model has an inherited non-editable primary key (:ticket:`27967`).
id: Diperbaiki kegagalan dalam jejeran admin ketika model mempunyai primary key bukan-disunting warisan (:ticket:`27967`).
zh_hans: 修复了在模型具有继承的不可编辑主键时，管理员中的内联出现崩溃的问题 (:ticket:`27967`)。

source: Fixed ``QuerySet.union()``, ``intersection()``, and ``difference()`` when combining with an ``EmptyQuerySet`` (:ticket:`28293`).
id: Diperbaiki ``QuerySet.union()``, ``intersection()``, dan ``difference()`` ketika menggabungkan dengan ``EmptyQuerySet`` (:ticket:`28293`).
zh_hans: 修复了在与 ``EmptyQuerySet`` 结合使用时，``QuerySet.union()``, ``intersection()``, 和 ``difference()`` 的问题 (:ticket:`28293`)。

source: Prevented ``Paginator``’s unordered object list warning from evaluating a ``QuerySet`` (:ticket:`28284`).
zh_hans: 防止 ``Paginator`` 的无序对象列表警告评估 ``QuerySet`` (:ticket:`28284`)。

source: Fixed the value of ``redirect_field_name`` in ``LoginView``’s template context. It's now an empty string (as it is for the original function-based ``login()`` view) if the corresponding parameter isn't sent in a request (in particular, when the login page is accessed directly) (:ticket:`28229`).
zh_hans: 修复了在 ``LoginView`` 的模板上下文中 ``redirect_field_name`` 的值。现在，如果请求中没有发送相应的参数（特别是当直接访问登录页面时），它现在是一个空字符串（与原始的基于函数的 ``login()`` 视图一样） (:ticket:`28229`)。

source: Prevented attribute values in the ``django/forms/widgets/attrs.html`` template from being localized so that numeric attributes (e.g. ``max`` and ``min``) of ``NumberInput`` work correctly (:ticket:`28303`).
id: Dicegah nilai atribut dalam cetakan ``django/forms/widgets/attrs.html``dari menjadi dibatasi sehingga atribut numerik (sebagai contoh ``max`` dan ``min``) dari ``NumberInput`` bekerja dengan benar (:ticket:`28303`).
zh_hans: 防止在 ``django/forms/widgets/attrs.html`` 模板中本地化属性值，以便 ``NumberInput`` 的数字属性（例如 ``max`` 和 ``min``）可以正常工作 (:ticket:`28303`)。

source: Removed casting of the option value to a string in the template context of the ``CheckboxSelectMultiple``, ``NullBooleanSelect``, ``RadioSelect``, ``SelectMultiple``, and ``Select`` widgets (:ticket:`28176`). In Django 1.11.1, casting was added in Python to avoid localization of numeric values in Django templates, but this made some use cases more difficult. Casting is now done in the template using the ``|stringformat:'s'`` filter.
id: Dipindahkan pemilihan dari nilai pilihan pada string dalam konteks cetakan dari widget ``CheckboxSelectMultiple``, ``NullBooleanSelect``, ``RadioSelect``, ``SelectMultiple``, dan ``Select`` (:ticket:`28176`). Dalam Django 1.11.1, pemilihan telah ditambahkan dalam Python untuk menghindari lokalisasi dari nilai-nilai numerik dalam cetakan Django, tetapi ini membuat beberapa penggunaan kasus lebih sulit. Pemilihan sekarang selesai dalam cetakan menggunakan penyaring ``|stringformat:'s'``.
zh_hans: 在 ``CheckboxSelectMultiple``、``NullBooleanSelect``、``RadioSelect``、``SelectMultiple`` 和 ``Select`` 小部件的模板上下文中删除了选项值转换为字符串的操作 (:ticket:`28176`)。在 Django 1.11.1 中，Python 中添加了转换以避免 Django 模板中的数字值本地化，但这使某些用例变得更加困难。现在在模板中使用 ``|stringformat:'s'`` 过滤器进行转换。

source: Prevented a primary key alteration from adding a foreign key constraint if ``db_constraint=False`` (:ticket:`28298`).
id: Dicegah perubahan primary key dari menambahkan batasan primary key jika ``db_constraint=False`` (:ticket:`28298`).
zh_hans: 如果 ``db_constraint=False``，则防止主键更改添加外键约束 (:ticket:`28298`)。

source: Fixed ``UnboundLocalError`` crash in ``RenameField`` with nonexistent field (:ticket:`28350`).
id: Diperbaiki kegagalan ``UnboundLocalError``dalam ``RenameField`` dengan bidang tidak ada (:ticket:`28350`).
zh_hans: 修复了在不存在的字段上的 ``RenameField`` 中的 ``UnboundLocalError`` 崩溃问题 (:ticket:`28350`)。

source: Fixed a regression preventing a model field's ``limit_choices_to`` from being evaluated when a ``ModelForm`` is instantiated (:ticket:`28345`).
id: Diperbaiki pemulihan mencegah model bidang ``limit_choices_to`` dari menjadi dinilai ketika ``ModelForm`` diinstansiasi (:ticket:`28345`).
zh_hans: 修复了在实例化 ``ModelForm`` 时防止模型字段的 ``limit_choices_to`` 被评估的回归问题 (:ticket:`28345`)。

source: Django 1.11.4 release notes
id: Catatan terbitan Django 1.11.4
zh_hans: Django 1.11.4 版本发行说明

source: *August 1, 2017*
id: *1 Agustus 2017*
zh_hans: *2017 年 8 月 1 日*

source: Django 1.11.4 fixes several bugs in 1.11.3.
id: Django 1.11.4 memperbaiki beberapa kesalahan di 1.11.3.
zh_hans: Django 1.11.4 修复了 1.11.3 中的几个漏洞。

source: Fixed a regression in 1.11.3 on Python 2 where non-ASCII ``format`` values for date/time widgets results in an empty ``value`` in the widget's HTML (:ticket:`28355`).
id: Diperbaiki pemulihan di 1.11.3 pada Python 2 dimana nilai ``format`` bukan-ASCII untuk widget tanggal/waktu hasil dalam ``value`` kosong dalam HTML widget (:ticket:`28355`).
zh_hans: 修复了在 Python 2 上的 1.11.3 中的回归问题，其中对于日期/时间小部件的非 ASCII ``format`` 值导致小部件的 HTML 中出现空的 ``value`` (:ticket:`28355`)。

source: Fixed ``QuerySet.union()`` and ``difference()`` when combining with a queryset raising ``EmptyResultSet`` (:ticket:`28378`).
id: Diperbaiki ``QuerySet.union()`` dan ``difference()`` ketika memadukan dengan queryset memunculkan ``EmptyResultSet`` (:ticket:`28378`).
zh_hans: 修复了与引发 ``EmptyResultSet`` 的查询集组合时的 ``QuerySet.union()`` 和 ``difference()`` 的问题 (:ticket:`28378`)。
