Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``checked`` and ``selected`` attribute rendered by form widgets now uses HTML5 boolean syntax rather than XHTML's ``checked='checked'`` and ``selected='selected'``.
id: Atribut ``checked`` and ``selected`` dibangun dengan widget formulir sekarang menggunakan sintaksis boolean HTML5 daripada ``checked='checked'`` and ``selected='selected'`` XHTML.
zh_hans: 表单小部件渲染的 ``checked`` 和 ``selected`` 属性现在使用 HTML5 布尔语法，而不再使用 XHTML 的 ``checked='checked'`` 和 ``selected='selected'``。

source: :meth:`RelatedManager.add() <django.db.models.fields.related.RelatedManager.add>`, :meth:`~django.db.models.fields.related.RelatedManager.remove`, :meth:`~django.db.models.fields.related.RelatedManager.clear`, and :meth:`~django.db.models.fields.related.RelatedManager.set` now clear the ``prefetch_related()`` cache.
id: :meth:`RelatedManager.add() <django.db.models.fields.related.RelatedManager.add>`, :meth:`~django.db.models.fields.related.RelatedManager.remove`, :meth:`~django.db.models.fields.related.RelatedManager.clear`, dan :meth:`~django.db.models.fields.related.RelatedManager.set` sekarang membersihkan cache ``prefetch_related()``.
zh_hans: :meth:`RelatedManager.add() <django.db.models.fields.related.RelatedManager.add>`、:meth:`~django.db.models.fields.related.RelatedManager.remove`、:meth:`~django.db.models.fields.related.RelatedManager.clear` 和 :meth:`~django.db.models.fields.related.RelatedManager.set` 现在会清除 ``prefetch_related()`` 缓存。

source: To prevent possible loss of saved settings, :func:`~django.test.utils.setup_test_environment` now raises an exception if called a second time before calling :func:`~django.test.utils.teardown_test_environment`.
id: Untuk mencegah kemungkinan kehilangan dari pengaturan disimpan, :func:`~django.test.utils.setup_test_environment` sekarang memunculkan sebuah pengecualian jika dipanggil satu detik sebelum memanggil :func:`~django.test.utils.teardown_test_environment`.
zh_hans: 为防止可能丢失的保存设置，如果在调用 :func:`~django.test.utils.teardown_test_environment` 之前再次调用 :func:`~django.test.utils.setup_test_environment`，它现在会引发异常。

source: The undocumented ``DateTimeAwareJSONEncoder`` alias for :class:`~django.core.serializers.json.DjangoJSONEncoder` (renamed in Django 1.0) is removed.
id: Nama lain ``DateTimeAwareJSONEncoder`` tidak terdokumentasi untuk :class:`~django.core.serializers.json.DjangoJSONEncoder` (dinamai kembali dalam Django 1.0) dipindahkan.
zh_hans: 未记录的 ``DateTimeAwareJSONEncoder`` 别名（对于在 Django 1.0 中更名的 :class:`~django.core.serializers.json.DjangoJSONEncoder`）已被移除。

source: The :class:`cached template loader <django.template.loaders.cached.Loader>` is now enabled if :setting:`OPTIONS['loaders'] <TEMPLATES-OPTIONS>` isn't specified and :setting:`OPTIONS['debug'] <TEMPLATES-OPTIONS>` is ``False`` (the latter option defaults to the value of :setting:`DEBUG`). This could be backwards-incompatible if you have some :ref:`template tags that aren't thread safe <template_tag_thread_safety>`.
zh_hans: 如果没有指定 :setting:`OPTIONS['loaders'] <TEMPLATES-OPTIONS>` 并且 :setting:`OPTIONS['debug'] <TEMPLATES-OPTIONS>` 为 ``False`` （后者默认为 :setting:`DEBUG` 的值），则现在会启用 :class:`cached template loader <django.template.loaders.cached.Loader>`。如果您有一些不是线程安全的 :ref:`模板标签 <template_tag_thread_safety>`，这可能会导致不兼容。

source: The prompt for stale content type deletion no longer occurs after running the ``migrate`` command. Use the new :djadmin:`remove_stale_contenttypes` command instead.
id: Penunjukan untuk penghapusan jenis isi basi tidak lagi muncul setelah menjalankan perintah ``migrate``. Gunakan perintah :djadmin:`remove_stale_contenttypes` baru sebagai gantinya.
zh_hans: 过去在运行 ``migrate`` 命令之后不再提示删除陈旧的内容类型。现在请使用新的 :djadmin:`remove_stale_contenttypes` 命令。

source: The admin's widget for ``IntegerField`` uses ``type="number"`` rather than ``type="text"``.
id: Widget admin untuk ``IntegerField`` menggunakan ``type="number"`` daripada ``type="text"``.
zh_hans: 管理员界面中的 ``IntegerField`` 控件现在使用 ``type="number"`` 而不是 ``type="text"``。

source: Conditional HTTP headers are now parsed and compared according to the :rfc:`7232` Conditional Requests specification rather than the older :rfc:`2616`.
id: Kepala HTTP bersyarat sekarang diuraikan dan dibandingkan menurut rfc:`7232`spesifikasi Permintaan Bersyarat daripada yang lama :rfc:`2616`.
zh_hans: 现在，条件 HTTP 标头根据 :rfc:`7232` 的条件请求规范进行解析和比较，而不是较旧的 :rfc:`2616` 规范。

source: :func:`~django.utils.cache.patch_response_headers` no longer adds a ``Last-Modified`` header. According to the :rfc:`7234#section-4.2.2`, this header is useless alongside other caching headers that provide an explicit expiration time, e.g. ``Expires`` or ``Cache-Control``. :class:`~django.middleware.cache.UpdateCacheMiddleware` and :func:`~django.utils.cache.add_never_cache_headers` call ``patch_response_headers()`` and therefore are also affected by this change.
id: :func:`~django.utils.cache.patch_response_headers` tidak lagi menambah kepala ``Last-Modified``. Menurut :rfc:`7234#section-4.2.2`, kepala ini tidak berguna bersama kepala cache lain yang menyediakan sebuah waktu kadaluarsa yang jelas, sebagai contoh ``Expires`` atau ``Cache-Control``. :class:`~django.middleware.cache.UpdateCacheMiddleware` dan :func:`~django.utils.cache.add_never_cache_headers` call ``patch_response_headers()``dan maka dari itu juga dipengaruhi oleh perubahan ini.
zh_hans: :func:`~django.utils.cache.patch_response_headers` 不再添加 ``Last-Modified`` 标头。根据 :rfc:`7234#section-4.2.2`，在提供明确的过期时间的其他缓存标头旁边，例如 ``Expires`` 或 ``Cache-Control``，此标头是无用的。因此，:class:`~django.middleware.cache.UpdateCacheMiddleware` 和 :func:`~django.utils.cache.add_never_cache_headers` 调用 ``patch_response_headers()``，因此也受到此更改的影响。

source: In the admin templates, ``<p class="help">`` is replaced with a ``<div>`` tag to allow including lists inside help text.
id: Dalam cetakan admin, ``1`` diganti dengan etiket ``2`` untuk mengizinkan menyertakan daftar didalam teks bantuan.
zh_hans: 在管理模板中，``<p class="help">`` 被替换为 ``<div>`` 标签，以允许在帮助文本中包含列表。

source: :class:`~django.middleware.http.ConditionalGetMiddleware` no longer sets the ``Date`` header as web servers set that header. It also no longer sets the ``Content-Length`` header as this is now done by :class:`~django.middleware.common.CommonMiddleware`.
zh_hans: :class:`~django.middleware.http.ConditionalGetMiddleware` 不再设置 ``Date`` 头，因为 web 服务器会设置该头。它也不再设置 ``Content-Length`` 头，因为现在由 :class:`~django.middleware.common.CommonMiddleware` 完成此操作。

source: If you have a middleware that modifies a response's content and appears before ``CommonMiddleware`` in the ``MIDDLEWARE`` or ``MIDDLEWARE_CLASSES`` settings, you must reorder your middleware so that responses aren't modified after ``Content-Length`` is set, or have the response modifying middleware reset the ``Content-Length`` header.
id: Jika anda mempunyai middleware yang merubah isi tanggapan dan muncul sebelum ``CommonMiddleware`` dalam pengaturan ``MIDDLEWARE`` atau ``MIDDLEWARE_CLASSES``, anda harus mengurutkan kembali middleware anda sehingga tanggapan tidak dirubah setelah ``Content-Length`` disetel, atau memiliki tanggapan merubah middleware menyetel kembali kepala ``Content-Length``.
zh_hans: 如果您有一个中间件在 ``MIDDLEWARE`` 或 ``MIDDLEWARE_CLASSES`` 设置中出现在 ``CommonMiddleware`` 之前，并且修改响应的内容，那么您必须重新排列您的中间件，以确保在设置 ``Content-Length`` 后不会修改响应，或者让修改响应的中间件重置 ``Content-Length`` 头。

source: :meth:`~django.apps.AppConfig.get_model` and :meth:`~django.apps.AppConfig.get_models` now raise :exc:`~django.core.exceptions.AppRegistryNotReady` if they're called before models of all applications have been loaded. Previously they only required the target application's models to be loaded and thus could return models without all their relations set up. If you need the old behavior of ``get_model()``, set the ``require_ready`` argument to ``False``.
id: :meth:`~django.apps.AppConfig.get_model` dan :meth:`~django.apps.AppConfig.get_models` sekarang memunculkan :exc:`~django.core.exceptions.AppRegistryNotReady` jika mereka dipanggil sebelum model dari semua aplikasi telah dimuat. Sebelumnya mereka hanya membutuhkan sasaran model aplikasi untuk dimuat dan demikian dapat mengembalikan model tanpa semua hubungan mereka disetel. Jika anda butuh perilaku lama dari ``get_model()``, setel argumen ``require_ready`` menjadi ``False``.
zh_hans: :meth:`~django.apps.AppConfig.get_model` 和 :meth:`~django.apps.AppConfig.get_models` 现在在所有应用程序的模型加载之前调用时会引发 :exc:`~django.core.exceptions.AppRegistryNotReady` 异常。以前它们只需要目标应用程序的模型被加载，因此可能返回未完全设置其关系的模型。如果您需要 ``get_model()`` 的旧行为，请将 ``require_ready`` 参数设置为 ``False``。

source: The unused ``BaseCommand.can_import_settings`` attribute is removed.
id: Atribut ``BaseCommand.can_import_settings`` tidak digunakan dipindahkan.
zh_hans: 未使用的 ``BaseCommand.can_import_settings`` 属性已被删除。

source: The undocumented ``django.utils.functional.lazy_property`` is removed.
id: Internal ``django.utils.functional.lazy_property`` dipindahkan.
zh_hans: 未记录的 ``django.utils.functional.lazy_property`` 已被移除。

source: For consistency with non-multipart requests, ``MultiPartParser.parse()`` now leaves ``request.POST`` immutable. If you're modifying that ``QueryDict``, you must now first copy it, e.g. ``request.POST.copy()``.
id: Untuk ketetapan dengan permintaan bukan-banyak-bagian, ``MultiPartParser.parse()`` sekarang meninggalkan ``request.POST``kekal. Jika anda sedang merubah ``QueryDict`` itu, anda harus sekarang pertama menyalin, sebagai contoh ``request.POST.copy()``.
zh_hans: 为了与非多部分请求保持一致，``MultiPartParser.parse()`` 现在会使 ``request.POST`` 保持不可变性。如果你要修改那个 ``QueryDict``，你现在必须先复制它，例如 ``request.POST.copy()``。

source: Support for ``cx_Oracle`` < 5.2 is removed.
id: Dukungan untuk ``cx_Oracle`` < 5.2 telah dipindahkan.
zh_hans: 对于 ``cx_Oracle`` 版本小于 5.2 的支持已被移除。

source: Support for IPython < 1.0 is removed from the ``shell`` command.
id: Dukungan untuk IPython < 1.0 telah dipindahkan dari perintah ``shell``.
zh_hans: 对于 IPython 版本小于 1.0 的支持已从 ``shell`` 命令中移除。

source: The signature of private API ``Widget.build_attrs()`` changed from ``extra_attrs=None, **kwargs`` to ``base_attrs, extra_attrs=None``.
id: Tanda tangan dari API pribadi ``Widget.build_attrs()``berubah dari ``extra_attrs=None, **kwargs``menjadi ``base_attrs, extra_attrs=None``.
zh_hans: 私有 API ``Widget.build_attrs()`` 的签名已从 ``extra_attrs=None, **kwargs`` 更改为 ``base_attrs, extra_attrs=None``。

source: File-like objects (e.g., :class:`~io.StringIO` and :class:`~io.BytesIO`) uploaded to an :class:`~django.db.models.ImageField` using the test client now require a ``name`` attribute with a value that passes the :data:`~django.core.validators.validate_image_file_extension` validator. See the note in :meth:`.Client.post`.
id: Obyek seperti-berkas (sebagai contoh :class:`~io.StringIO` dan :class:`~io.BytesIO`) diunggah pada sebuah :class:`~django.db.models.ImageField` menggunakan klien percobaan sekarang membutuhkan sebuah atribut ``name`` dengan sebuah nilai yang melewatkan pengesah :data:`~django.core.validators.validate_image_file_extension`. Lihat catatan dalam :meth:`.Client.post`.
zh_hans: 通过测试客户端上传到一个 :class:`~django.db.models.ImageField` 的类似文件的对象（例如 :class:`~io.StringIO` 和 :class:`~io.BytesIO`）现在需要一个具有通过 :data:`~django.core.validators.validate_image_file_extension` 验证器的值的 ``name`` 属性。请参阅 :meth:`.Client.post` 中的注意事项。

source: :class:`~django.db.models.FileField` now moves rather than copies the file it receives. With the default file upload settings, files larger than :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE` now have the same permissions as temporary files (often ``0o600``) rather than the system's standard umask (often ``0o6644``). Set the :setting:`FILE_UPLOAD_PERMISSIONS` if you need the same permission regardless of file size.
zh_hans: :class:`~django.db.models.FileField` 现在会移动文件而不是复制它所接收的文件。使用默认的文件上传设置，文件大小超过 :setting:`FILE_UPLOAD_MAX_MEMORY_SIZE` 的文件现在具有与临时文件相同的权限（通常是 ``0o600``），而不是系统的标准掩码（通常是 ``0o644``）。如果您需要不考虑文件大小都具有相同权限，请设置 :setting:`FILE_UPLOAD_PERMISSIONS`。

source: Features deprecated in 1.11
id: Fitur-fitur diusangkan dalam 1.11
zh_hans: 在 1.11 中被废弃的功能

source: ``models.permalink()`` decorator
id: Penghias ``models.permalink()``
zh_hans: ``models.permalink()`` 装饰器

source: Use :func:`django.urls.reverse` instead. For example::
id: Gunakan :func:`django.urls.reverse` sebagai gantinya. Sebagai contoh::
zh_hans: 请使用 :func:`django.urls.reverse`。例如：

source: becomes::
id: menjadi::
zh_hans: 变成：

source: ``contrib.auth``’s ``login()`` and ``logout()`` function-based views are deprecated in favor of new class-based views :class:`~django.contrib.auth.views.LoginView` and :class:`~django.contrib.auth.views.LogoutView`.
zh_hans: ``contrib.auth`` 中的 ``login()`` 和 ``logout()`` 基于函数的视图已被弃用，推荐使用新的基于类的视图 :class:`~django.contrib.auth.views.LoginView` 和 :class:`~django.contrib.auth.views.LogoutView`。

source: The unused ``extra_context`` parameter of ``contrib.auth.views.logout_then_login()`` is deprecated.
id: Parameter ``extra_context`` tidak digunakan dari ``contrib.auth.views.logout_then_login()`` diusangkan.
zh_hans: ``contrib.auth.views.logout_then_login()`` 的未使用的 ``extra_context`` 参数已被弃用。

source: ``contrib.auth``’s ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, and ``password_reset_complete()`` function-based views are deprecated in favor of new class-based views :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, and :class:`~django.contrib.auth.views.PasswordResetCompleteView`.
zh_hans: ``contrib.auth`` 中的 ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, 和 ``password_reset_complete()`` 基于函数的视图已被弃用，推荐使用新的基于类的视图 :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, 和 :class:`~django.contrib.auth.views.PasswordResetCompleteView`。

source: ``django.test.runner.setup_databases()`` is moved to :func:`django.test.utils.setup_databases`. The old location is deprecated.
id: ``django.test.runner.setup_databases()`` dipindahkan ke :func:`django.test.utils.setup_databases`. Tempat lama diusangkan.
zh_hans: ``django.test.runner.setup_databases()`` 已移至 :func:`django.test.utils.setup_databases`。旧位置已被弃用。

source: ``django.utils.translation.string_concat()`` is deprecated in favor of :func:`django.utils.text.format_lazy`. ``string_concat(*strings)`` can be replaced by ``format_lazy('{}' * len(strings), *strings)``.
id: ``django.utils.translation.string_concat()`` diusangkan mendukung :func:`django.utils.text.format_lazy`. ``string_concat(*strings)`` dapat diganti oleh ``format_lazy('{}' * len(strings), *strings)``.
zh_hans: ``django.utils.translation.string_concat()`` 已被弃用，推荐使用 :func:`django.utils.text.format_lazy`。可以通过 ``format_lazy('{}' * len(strings), *strings)`` 来替代 ``string_concat(*strings)``。

source: For the ``PyLibMCCache`` cache backend, passing ``pylibmc`` behavior settings as top-level attributes of ``OPTIONS`` is deprecated. Set them under a ``behaviors`` key within ``OPTIONS`` instead.
id: Untuk backend cache ``PyLibMCCache``, lewatkan pengaturan perilaku ``pylibmc`` sebagai atribut tingkat-atas dari ``OPTIONS``diusangkan. Setel mereka dibawah kunci ``behaviors``dalam ``OPTIONS``sebagai gantinya.
zh_hans: 对于 ``PyLibMCCache`` 缓存后端，将 ``pylibmc`` 行为设置作为 ``OPTIONS`` 的顶级属性传递已被弃用。请将它们设置在 ``OPTIONS`` 内的 ``behaviors`` 键下。

source: The ``host`` parameter of ``django.utils.http.is_safe_url()`` is deprecated in favor of the new ``allowed_hosts`` parameter.
id: Parameter ``host`` dari ``django.utils.http.is_safe_url()`` diusangkan mendukung parameter ``allowed_hosts`` baru.
zh_hans: ``django.utils.http.is_safe_url()`` 的 ``host`` 参数已被弃用，推荐使用新的 ``allowed_hosts`` 参数。

source: Silencing exceptions raised while rendering the :ttag:`{% include %} <include>` template tag is deprecated as the behavior is often more confusing than helpful. In Django 2.1, the exception will be raised.
id: Mendiamkan pengecualian yang muncul selagi membangun etiket cetakan :ttag:`{% include %} 1` diusangkan sebagai perilaku sering lebih membingungkan daripada membantu. Dalam Django 2.1, pengecualian akan dimunculkan.
zh_hans: 在渲染 :ttag:`{% include %} <include>` 模板标签时抑制异常已被弃用，因为这种行为通常会比有帮助更令人困惑。在 Django 2.1 中，将会引发异常。

source: ``DatabaseIntrospection.get_indexes()`` is deprecated in favor of ``DatabaseIntrospection.get_constraints()``.
id: ``DatabaseIntrospection.get_indexes()`` diusangkan mendukung ``DatabaseIntrospection.get_constraints()``.
zh_hans: ``DatabaseIntrospection.get_indexes()`` 已被弃用，推荐使用 ``DatabaseIntrospection.get_constraints()``。

source: :func:`~django.contrib.auth.authenticate` now passes a ``request`` argument to the ``authenticate()`` method of authentication backends. Support for methods that don't accept ``request`` as the first positional argument will be removed in Django 2.1.
id: :func:`~django.contrib.auth.authenticate` sekarang melewatkan sebuah argumen ``request`` pada metode ``authenticate()`` dari backend autentifikasi. Dukungan untuk metode-metode yang tidak menerima ``request`` sebagai argumen penempatan pertama akan dipindahkan dalam Django 2.1.
zh_hans: :func:`~django.contrib.auth.authenticate` 现在向身份验证后端的 ``authenticate()`` 方法传递一个 ``request`` 参数。不接受 ``request`` 作为第一个位置参数的方法将在 Django 2.1 中被移除。

source: The ``USE_ETAGS`` setting is deprecated in favor of :class:`~django.middleware.http.ConditionalGetMiddleware` which now adds the ``ETag`` header to responses regardless of the setting. ``CommonMiddleware`` and ``django.utils.cache.patch_response_headers()`` will no longer set ETags when the deprecation ends.
id: Pengaturan ``USE_ETAGS`` diusangkan mendukung :class:`~django.middleware.http.ConditionalGetMiddleware` yang sekarang menambah kepala ``ETag`` pada tanggapan tanpa memperdulikan pengaturan. ``CommonMiddleware`` dan ``django.utils.cache.patch_response_headers()`` tidak akan lagi menyetel ETagsketika pengusangan berakhir.
zh_hans: ``USE_ETAGS`` 设置已被弃用，推荐使用 :class:`~django.middleware.http.ConditionalGetMiddleware`，它现在会在响应中添加 ``ETag`` 头，不受设置的影响。当弃用结束时，``CommonMiddleware`` 和 ``django.utils.cache.patch_response_headers()`` 将不再设置 ETags。

source: ``Model._meta.has_auto_field`` is deprecated in favor of checking if ``Model._meta.auto_field is not None``.
id: ``Model._meta.has_auto_field`` diusangkan mendukung dari pemeriksaan jika ``Model._meta.auto_field bukan None``.
zh_hans: ``Model._meta.has_auto_field`` 已被弃用，推荐检查 ``Model._meta.auto_field is not None``。

source: Using regular expression groups with ``iLmsu#`` in ``url()`` is deprecated. The only group that's useful is ``(?i)`` for case-insensitive URLs, however, case-insensitive URLs aren't a good practice because they create multiple entries for search engines, for example. An alternative solution could be to create a :data:`~django.conf.urls.handler404` that looks for uppercase characters in the URL and redirects to a lowercase equivalent.
id: Menggunakan kelompok regular expression dengan ``iLmsu#`` dalam ``url()``diusangkan. Hanya kelompok yang berguna adalah ``(?i)``untuk URL kasus-tidak-sensitif, bagaimanapun, URL kasus-tidak-sensitif bukan praktik bagus karena mereka membuat banyak masukan untuk setiap mesin pencari, sebagai contoh. Sebuah pemecahan lain dapat membuat :data:`~django.conf.urls.handler404` yang mencari karakter huruf besar dalam URL dan pengalihkan ke setara huruf kecil.
zh_hans: 在 ``url()`` 中使用带有 ``iLmsu#`` 的正则表达式组已被弃用。唯一有用的组是 ``(?i)`` 用于不区分大小写的 URL，但是不区分大小写的 URL 并不是一个好的实践，因为它们会为搜索引擎创建多个条目，例如。一个替代方案可能是创建一个 :data:`~django.conf.urls.handler404`，它查找 URL 中的大写字符并重定向到相应的小写字符。

source: The ``renderer`` argument is added to the :meth:`Widget.render() <django.forms.Widget.render>` method. Methods that don't accept that argument will work through a deprecation period.
id: Argumen ``renderer`` ditambahkan pada metode :meth:`Widget.render() <django.forms.Widget.render>`. Metode-metode yang tidak menerima bahwa argumen akan bekerja melalui masa pengusangan.
zh_hans: ``renderer`` 参数已添加到 :meth:`Widget.render() <django.forms.Widget.render>` 方法。不接受该参数的方法将在一个弃用期内继续工作。

source: Django 1.11.1 release notes
id: Catatan terbitan Django 1.11.1
zh_hans: Django 1.11.1 版本发行说明

source: *May 6, 2017*
id: *6 Mei 2017*
zh_hans: *2017 年 5 月 6 日*

source: Django 1.11.1 adds a minor feature and fixes several bugs in 1.11.
id: Django 1.11.1 menambahkan fitur kecil dan perbaikan beberapa kesalahan dalam 1.11.
zh_hans: Django 1.11.1 添加了一个小功能，并修复了 1.11 中的若干错误。

source: Allowed disabling server-side cursors on PostgreSQL
id: Diizinkan meniadakan kursor sisi-peladen pada PostgreSQL
zh_hans: 允许在 PostgreSQL 上禁用服务器端游标

source: The change in Django 1.11 to make :meth:`.QuerySet.iterator()` use server-side cursors on PostgreSQL prevents running Django with PgBouncer in transaction pooling mode. To reallow that, use the :setting:`DISABLE_SERVER_SIDE_CURSORS <DATABASE-DISABLE_SERVER_SIDE_CURSORS>` setting in :setting:`DATABASES`.
zh_hans: Django 1.11 中对 :meth:`.QuerySet.iterator()` 的更改使其在 PostgreSQL 上使用服务器端游标，这会阻止在事务池模式下使用 PgBouncer 运行 Django。要重新允许这个行为，请在 :setting:`DATABASES` 的设置中使用 :setting:`DISABLE_SERVER_SIDE_CURSORS <DATABASE-DISABLE_SERVER_SIDE_CURSORS>` 设置。

source: Made migrations respect ``Index``’s ``name`` argument. If you created a named index with Django 1.11, ``makemigrations`` will create a migration to recreate the index with the correct name (:ticket:`28051`).
zh_hans: 迁移现在会尊重 ``Index`` 的 ``name`` 参数。如果你在 Django 1.11 中创建了一个具有名称的索引，``makemigrations`` 将创建一个迁移来重新创建具有正确名称的索引 (:ticket:`28051`)。

source: Fixed a crash when using a ``__icontains`` lookup on a ``ArrayField`` (:ticket:`28038`).
id: Diperbaiki sebuah kegagalan ketika menggunakan sebuah pencarian ``__icontains`` pada sebuah ``ArrayField`` (:ticket:`28038`).
zh_hans: 修复了在 ``ArrayField`` 上使用 ``__icontains`` 查找时的崩溃问题 (:ticket:`28038`)。

source: Fixed a crash when using a 2-tuple in ``EmailMessage``’s ``attachments`` argument (:ticket:`28042`).
zh_hans: 修复了在 ``EmailMessage`` 的 ``attachments`` 参数中使用 2 元组时崩溃的问题 (:ticket:`28042`)。

source: Fixed ``QuerySet.filter()`` crash when it references the name of a ``OneToOneField`` primary key (:ticket:`28047`).
id: Diperbaiki kegagalan ``QuerySet.filter()`` ketika itu mengacu nama dari primary key ``OneToOneField``(:ticket:`28047`).
zh_hans: 修复了当 ``QuerySet.filter()`` 引用 ``OneToOneField`` 主键的名称时导致的崩溃 (:ticket:`28047`)。

source: Fixed empty POST data table appearing instead of "No POST data" in HTML debug page (:ticket:`28079`).
id: Diperbaiki tabel data POST kosong muncul daripada "No POST data"dalam halaman mencari kesalahan HTML (:ticket:`28079`).
zh_hans: 修复了在 HTML 调试页面中出现空的 POST 数据表格，而不是显示 "No POST data" (:ticket:`28079`)。

source: Restored ``BoundField``\s without any ``choices`` evaluating to ``True`` (:ticket:`28058`).
id: Disimpan kembali ``BoundField`` tanpa ``choices`` apapun menilai menjadi ``True`` (:ticket:`28058`).
zh_hans: 恢复了 ``BoundField`` 中没有任何 ``choices`` 的情况下被评估为 ``True`` (:ticket:`28058`)。

source: Prevented ``SessionBase.cycle_key()`` from losing session data if ``_session_cache`` isn't populated (:ticket:`28066`).
id: Dicegah ``SessionBase.cycle_key()`` dari kehilangan data sesi jika ``_session_cache`` tidak dikunpulkan (:ticket:`28066`).
zh_hans: 防止在 ``_session_cache`` 未填充的情况下使 ``SessionBase.cycle_key()`` 丢失会话数据 (:ticket:`28066`)。
