Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 4.2 :commit:`(patch) <3c9a2771cc80821e041b16eb36c1c37af5349d4a>`
zh_hans: Django 4.2 :commit:`(补丁) <3c9a2771cc80821e041b16eb36c1c37af5349d4a>`

source: Django 3.2 :commit:`(patch) <072963e4c4d0b3a7a8c5412bc0c7d27d1a9c3521>`
zh_hans: Django 3.2 :commit:`(补丁) <072963e4c4d0b3a7a8c5412bc0c7d27d1a9c3521>`

source: February 6, 2024 - :cve:`2024-24680`
zh_hans: 2024 年 2 月 6 日 - :cve:`2024-24680`

source: Potential denial-of-service in ``intcomma`` template filter. `Full description <https://www.djangoproject.com/weblog/2024/feb/06/security-releases/>`__
zh_hans: ``intcomma`` 模板过滤器存在潜在的拒绝服务漏洞。`完整描述 <https://www.djangoproject.com/weblog/2024/feb/06/security-releases/>`__

source: Django 5.0 :commit:`(patch) <16a8fe18a3b81250f4fa57e3f93f0599dc4895bc>`
zh_hans: Django 5.0 :commit:`(补丁) <16a8fe18a3b81250f4fa57e3f93f0599dc4895bc>`

source: Django 4.2 :commit:`(patch) <572ea07e84b38ea8de0551f4b4eda685d91d09d2>`
zh_hans: Django 4.2 :commit:`(补丁) <572ea07e84b38ea8de0551f4b4eda685d91d09d2>`

source: Django 3.2 :commit:`(patch) <c1171ffbd570db90ca206c30f8e2b9f691243820>`
zh_hans: Django 3.2 :commit:`(补丁) <c1171ffbd570db90ca206c30f8e2b9f691243820>`

source: November 1, 2023 - :cve:`2023-46695`
zh_hans: 2023 年 11 月 1 日 - :cve:`2023-46695`

source: Potential denial of service vulnerability in ``UsernameField`` on Windows. `Full description <https://www.djangoproject.com/weblog/2023/nov/01/security-releases/>`__
zh_hans: 关于 Windows 平台上的 ``UsernameField`` 存在潜在的拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/nov/01/security-releases/>`__

source: Django 4.2 :commit:`(patch) <048a9ebb6ea468426cb4e57c71572cbbd975517f>`
zh_hans: Django 4.2 :commit:`(补丁) <048a9ebb6ea468426cb4e57c71572cbbd975517f>`

source: Django 4.1 :commit:`(patch) <4965bfdde2e5a5c883685019e57d123a3368a75e>`
zh_hans: Django 4.1 :commit:`(补丁) <4965bfdde2e5a5c883685019e57d123a3368a75e>`

source: Django 3.2 :commit:`(patch) <f9a7fb8466a7ba4857eaf930099b5258f3eafb2b>`
zh_hans: Django 3.2 :commit:`(补丁) <f9a7fb8466a7ba4857eaf930099b5258f3eafb2b>`

source: October 4, 2023 - :cve:`2023-43665`
zh_hans: 2023 年 10 月 4 日 - :cve:`2023-43665`

source: Denial-of-service possibility in ``django.utils.text.Truncator``. `Full description <https://www.djangoproject.com/weblog/2023/oct/04/security-releases/>`__
zh_hans: ``django.utils.text.Truncator`` 中存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/oct/04/security-releases/>`__

source: Django 4.2 :commit:`(patch) <be9c27c4d18c2e6a5be8af4e53c0797440794473>`
zh_hans: Django 4.2 :commit:`(补丁) <be9c27c4d18c2e6a5be8af4e53c0797440794473>`

source: Django 4.1 :commit:`(patch) <c7b7024742250414e426ad49fb80db943e7ba4e8>`
zh_hans: Django 4.1 :commit:`(补丁) <c7b7024742250414e426ad49fb80db943e7ba4e8>`

source: Django 3.2 :commit:`(patch) <ccdade1a0262537868d7ca64374de3d957ca50c5>`
zh_hans: Django 3.2 :commit:`(补丁) <ccdade1a0262537868d7ca64374de3d957ca50c5>`

source: September 4, 2023 - :cve:`2023-41164`
zh_hans: 2023 年 9 月 4 日 - :cve:`2023-41164`

source: Potential denial of service vulnerability in ``django.utils.encoding.uri_to_iri()``. `Full description <https://www.djangoproject.com/weblog/2023/sep/04/security-releases/>`__
zh_hans: ``django.utils.encoding.uri_to_iri()`` 存在潜在的拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/sep/04/security-releases/>`__

source: Django 4.2 :commit:`(patch) <9c51b4dcfa0cefcb48231f4d71cafa80821f87b9>`
zh_hans: Django 4.2 :commit:`(补丁) <9c51b4dcfa0cefcb48231f4d71cafa80821f87b9>`

source: Django 4.1 :commit:`(patch) <ba00bc5ec6a7eff5e08be438f7b5b0e9574e8ff0>`
zh_hans: Django 4.1 :commit:`(补丁) <ba00bc5ec6a7eff5e08be438f7b5b0e9574e8ff0>`

source: Django 3.2 :commit:`(patch) <6f030b1149bd8fa4ba90452e77cb3edc095ce54e>`
zh_hans: Django 3.2 :commit:`(补丁) <6f030b1149bd8fa4ba90452e77cb3edc095ce54e>`

source: July 3, 2023 - :cve:`2023-36053`
zh_hans: 2023 年 7 月 3 日 - :cve:`2023-36053`

source: Potential regular expression denial of service vulnerability in ``EmailValidator``/``URLValidator``. `Full description <https://www.djangoproject.com/weblog/2023/jul/03/security-releases/>`__
zh_hans: ``EmailValidator`` 和 ``URLValidator`` 存在潜在的正则表达式拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/jul/03/security-releases/>`__

source: Django 4.2 :commit:`(patch) <b7c5feb35a31799de6e582ad6a5a91a9de74e0f9>`
zh_hans: Django 4.2 :commit:`(补丁) <b7c5feb35a31799de6e582ad6a5a91a9de74e0f9>`

source: Django 4.1 :commit:`(patch) <beb3f3d55940d9aa7198bf9d424ab74e873aec3d>`
zh_hans: Django 4.1 :commit:`(补丁) <beb3f3d55940d9aa7198bf9d424ab74e873aec3d>`

source: Django 3.2 :commit:`(patch) <454f2fb93437f98917283336201b4048293f7582>`
zh_hans: Django 3.2 :commit:`(补丁) <454f2fb93437f98917283336201b4048293f7582>`

source: May 3, 2023 - :cve:`2023-31047`
zh_hans: 2023 年 5 月 3 日 - :cve:`2023-31047`

source: Potential bypass of validation when uploading multiple files using one form field. `Full description <https://www.djangoproject.com/weblog/2023/may/03/security-releases/>`__
zh_hans: 上传多个文件使用一个表单字段时存在潜在的验证绕过漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/may/03/security-releases/>`__

source: Django 4.2 :commit:`(patch) <21b1b1fc03e5f9e9f8c977ee6e35618dd3b353dd>`
zh_hans: Django 4.2 :commit:`(补丁) <21b1b1fc03e5f9e9f8c977ee6e35618dd3b353dd>`

source: Django 4.1 :commit:`(patch) <e7c3a2ccc3a562328600be05068ed9149e12ce64>`
zh_hans: Django 4.1 :commit:`(补丁) <e7c3a2ccc3a562328600be05068ed9149e12ce64>`

source: Django 3.2 :commit:`(patch) <eed53d0011622e70b936e203005f0e6f4ac48965>`
zh_hans: Django 3.2 :commit:`(补丁) <eed53d0011622e70b936e203005f0e6f4ac48965>`

source: February 14, 2023 - :cve:`2023-24580`
zh_hans: 2023 年 2 月 14 日 - :cve:`2023-24580`

source: Potential denial-of-service vulnerability in file uploads. `Full description <https://www.djangoproject.com/weblog/2023/feb/14/security-releases/>`__
zh_hans: 文件上传中存在潜在的拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/feb/14/security-releases/>`__

source: Django 4.1 :commit:`(patch) <628b33a854a9c68ec8a0c51f382f304a0044ec92>`
zh_hans: Django 4.1 :commit:`(补丁) <628b33a854a9c68ec8a0c51f382f304a0044ec92>`

source: Django 4.0 :commit:`(patch) <83f1ea83e4553e211c1c5a0dfc197b66d4e50432>`
zh_hans: Django 4.0 :commit:`(补丁) <83f1ea83e4553e211c1c5a0dfc197b66d4e50432>`

source: Django 3.2 :commit:`(patch) <a665ed5179f5bbd3db95ce67286d0192eff041d8>`
zh_hans: Django 3.2 :commit:`(补丁) <a665ed5179f5bbd3db95ce67286d0192eff041d8>`

source: February 1, 2023 - :cve:`2023-23969`
zh_hans: 2023 年 2 月 1 日 - :cve:`2023-23969`

source: Potential denial-of-service via ``Accept-Language`` headers. `Full description <https://www.djangoproject.com/weblog/2023/feb/01/security-releases/>`__
zh_hans: 通过 ``Accept-Language`` 标头存在潜在的拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2023/feb/01/security-releases/>`__

source: Django 4.1 :commit:`(patch) <9d7bd5a56b1ce0576e8e07a8001373576d277942>`
zh_hans: Django 4.1 :commit:`(补丁) <9d7bd5a56b1ce0576e8e07a8001373576d277942>`

source: Django 4.0 :commit:`(patch) <4452642f193533e288a52c02efb5bbc766a68f95>`
zh_hans: Django 4.0 :commit:`(补丁) <4452642f193533e288a52c02efb5bbc766a68f95>`

source: Django 3.2 :commit:`(patch) <c7e0151fdf33e1b11d488b6f67b94fdf3a30614a>`
zh_hans: Django 3.2 :commit:`(补丁) <c7e0151fdf33e1b11d488b6f67b94fdf3a30614a>`

source: October 4, 2022 - :cve:`2022-41323`
zh_hans: 2022 年 10 月 4 日 - :cve:`2022-41323`

source: Potential denial-of-service vulnerability in internationalized URLs. `Full description <https://www.djangoproject.com/weblog/2022/oct/04/security-releases/>`__
zh_hans: 国际化 URL 存在潜在的拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/oct/04/security-releases/>`__

source: Django 4.1 :commit:`(patch) <9d656ea51d9ea7105c0c0785783ac29d426a7d25>`
zh_hans: Django 4.1 :commit:`(补丁) <9d656ea51d9ea7105c0c0785783ac29d426a7d25>`

source: Django 4.0 :commit:`(patch) <23f0093125ac2e553da6c1b2f9988eb6a3dd2ea1>`
zh_hans: Django 4.0 :commit:`(补丁) <23f0093125ac2e553da6c1b2f9988eb6a3dd2ea1>`

source: Django 3.2 :commit:`(patch) <5b6b257fa7ec37ff27965358800c67e2dd11c924>`
zh_hans: Django 3.2 :commit:`(补丁) <5b6b257fa7ec37ff27965358800c67e2dd11c924>`

source: August 3, 2022 - :cve:`2022-36359`
zh_hans: 2022 年 8 月 3 日 - :cve:`2022-36359`

source: Potential reflected file download vulnerability in FileResponse. `Full description <https://www.djangoproject.com/weblog/2022/aug/03/security-releases/>`__
zh_hans: FileResponse 中存在潜在的反射式文件下载漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/aug/03/security-releases/>`__

source: Django 4.0 :commit:`(patch) <b7d9529cbe0af4adabb6ea5d01ed8dcce3668fb3>`
zh_hans: Django 4.0 :commit:`(补丁) <b7d9529cbe0af4adabb6ea5d01ed8dcce3668fb3>`

source: Django 3.2 :commit:`(patch) <b3e4494d759202a3b6bf247fd34455bf13be5b80>`
zh_hans: Django 3.2 :commit:`(补丁) <b3e4494d759202a3b6bf247fd34455bf13be5b80>`

source: July 4, 2022 - :cve:`2022-34265`
zh_hans: 2022 年 7 月 4 日 - :cve:`2022-34265`

source: Potential SQL injection via ``Trunc(kind)`` and ``Extract(lookup_name)`` arguments. `Full description <https://www.djangoproject.com/weblog/2022/jul/04/security-releases/>`__
zh_hans: 通过 ``Trunc(kind)`` 和 ``Extract(lookup_name)`` 参数存在潜在的 SQL 注入漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/jul/04/security-releases/>`__

source: Django 4.0 :commit:`(patch) <0dc9c016fadb71a067e5a42be30164e3f96c0492>`
zh_hans: Django 4.0 :commit:`(补丁) <0dc9c016fadb71a067e5a42be30164e3f96c0492>`

source: Django 3.2 :commit:`(patch) <a9010fe5555e6086a9d9ae50069579400ef0685e>`
zh_hans: Django 3.2 :commit:`(补丁) <a9010fe5555e6086a9d9ae50069579400ef0685e>`

source: April 11, 2022 - :cve:`2022-28346`
zh_hans: 2022 年 4 月 11 日 - :cve:`2022-28346`

source: Potential SQL injection in ``QuerySet.annotate()``, ``aggregate()``, and ``extra()``. `Full description <https://www.djangoproject.com/weblog/2022/apr/11/security-releases/>`__
zh_hans: 在 ``QuerySet.annotate()``, ``aggregate()`` 和 ``extra()`` 中存在潜在的 SQL 注入漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/apr/11/security-releases/>`__

source: Django 4.0 :commit:`(patch) <800828887a0509ad1162d6d407e94d8de7eafc60>`
zh_hans: Django 4.0 :commit:`(补丁) <800828887a0509ad1162d6d407e94d8de7eafc60>`

source: Django 3.2 :commit:`(patch) <2044dac5c6968441be6f534c4139bcf48c5c7e48>`
zh_hans: Django 3.2 :commit:`(补丁) <2044dac5c6968441be6f534c4139bcf48c5c7e48>`

source: Django 2.2 :commit:`(patch) <2c09e68ec911919360d5f8502cefc312f9e03c5d>`
zh_hans: Django 2.2 :commit:`(补丁) <2c09e68ec911919360d5f8502cefc312f9e03c5d>`

source: April 11, 2022 - :cve:`2022-28347`
zh_hans: 2022 年 4 月 11 日 - :cve:`2022-28347`

source: Potential SQL injection via ``QuerySet.explain(**options)`` on PostgreSQL. `Full description <https://www.djangoproject.com/weblog/2022/apr/11/security-releases/>`__
zh_hans: 通过 PostgreSQL 上的 ``QuerySet.explain(**options)`` 存在潜在的 SQL 注入漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/apr/11/security-releases/>`__

source: Django 4.0 :commit:`(patch) <00b0fc50e1738c7174c495464a5ef069408a4402>`
zh_hans: Django 4.0 :commit:`(补丁) <00b0fc50e1738c7174c495464a5ef069408a4402>`

source: Django 3.2 :commit:`(patch) <9e19accb6e0a00ba77d5a95a91675bf18877c72d>`
zh_hans: Django 3.2 :commit:`(补丁) <9e19accb6e0a00ba77d5a95a91675bf18877c72d>`

source: Django 2.2 :commit:`(patch) <29a6c98b4c13af82064f993f0acc6e8fafa4d3f5>`
zh_hans: Django 2.2 :commit:`(补丁) <29a6c98b4c13af82064f993f0acc6e8fafa4d3f5>`

source: February 1, 2022 - :cve:`2022-22818`
zh_hans: 2022 年 2 月 1 日 - :cve:`2022-22818`

source: Possible XSS via ``{% debug %}`` template tag. `Full description <https://www.djangoproject.com/weblog/2022/feb/01/security-releases/>`__
zh_hans: 可能通过 ``{% debug %}`` 模板标签存在跨站脚本攻击（XSS）漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/feb/01/security-releases/>`__

source: Versions affected
id: Versi terpengaruh
zh_hans: 受影响的版本

source: Django 4.0 :commit:`(patch) <01422046065d2b51f8f613409cad2c81b39487e5>`
zh_hans: Django 4.0 :commit:`(补丁) <01422046065d2b51f8f613409cad2c81b39487e5>`

source: Django 3.2 :commit:`(patch) <1a1e8278c46418bde24c86a65443b0674bae65e2>`
zh_hans: Django 3.2 :commit:`(补丁) <1a1e8278c46418bde24c86a65443b0674bae65e2>`

source: Django 2.2 :commit:`(patch) <c27a7eb9f40b64990398978152e62b6ff839c2e6>`
zh_hans: Django 2.2 :commit:`(补丁) <c27a7eb9f40b64990398978152e62b6ff839c2e6>`

source: February 1, 2022 - :cve:`2022-23833`
zh_hans: 2022 年 2 月 1 日 - :cve:`2022-23833`

source: Denial-of-service possibility in file uploads. `Full description <https://www.djangoproject.com/weblog/2022/feb/01/security-releases/>`__
zh_hans: 文件上传中存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/feb/01/security-releases/>`__

source: Django 4.0 :commit:`(patch) <f9c7d48fdd6f198a6494a9202f90242f176e4fc9>`
zh_hans: Django 4.0 :commit:`(补丁) <f9c7d48fdd6f198a6494a9202f90242f176e4fc9>`

source: Django 3.2 :commit:`(patch) <d16133568ef9c9b42cb7a08bdf9ff3feec2e5468>`
zh_hans: Django 3.2 :commit:`(补丁) <d16133568ef9c9b42cb7a08bdf9ff3feec2e5468>`

source: Django 2.2 :commit:`(patch) <c477b761804984c932704554ad35f78a2e230c6a>`
zh_hans: Django 2.2 :commit:`(补丁) <c477b761804984c932704554ad35f78a2e230c6a>`

source: January 4, 2022 - :cve:`2021-45452`
zh_hans: 2022 年 1 月 4 日 - :cve:`2021-45452`

source: Potential directory-traversal via ``Storage.save()``. `Full description <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__
zh_hans: 通过 ``Storage.save()`` 存在潜在的目录遍历漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__

source: Django 4.0 :commit:`(patch) <e1592e0f26302e79856cc7f2218ae848ae19b0f6>`
zh_hans: Django 4.0 :commit:`(补丁) <e1592e0f26302e79856cc7f2218ae848ae19b0f6>`

source: Django 3.2 :commit:`(patch) <8d2f7cff76200cbd2337b2cf1707e383eb1fb54b>`
zh_hans: Django 3.2 :commit:`(补丁) <8d2f7cff76200cbd2337b2cf1707e383eb1fb54b>`

source: Django 2.2 :commit:`(patch) <4cb35b384ceef52123fc66411a73c36a706825e1>`
zh_hans: Django 2.2 :commit:`(补丁) <4cb35b384ceef52123fc66411a73c36a706825e1>`

source: January 4, 2022 - :cve:`2021-45116`
zh_hans: 2022 年 1 月 4 日 - :cve:`2021-45116`

source: Potential information disclosure in ``dictsort`` template filter. `Full description <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__
zh_hans: ``dictsort`` 模板过滤器存在潜在的信息泄露漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__

source: Django 4.0 :commit:`(patch) <2a8ec7f546d6d5806e221ec948c5146b55bd7489>`
zh_hans: Django 4.0 :commit:`(补丁) <2a8ec7f546d6d5806e221ec948c5146b55bd7489>`

source: Django 3.2 :commit:`(patch) <c7fe895bca06daf12cc1670b56eaf72a1ef27a16>`
zh_hans: Django 3.2 :commit:`(补丁) <c7fe895bca06daf12cc1670b56eaf72a1ef27a16>`

source: Django 2.2 :commit:`(patch) <c9f648ccfac5ab90fb2829a66da4f77e68c7f93a>`
zh_hans: Django 2.2 :commit:`(补丁) <c9f648ccfac5ab90fb2829a66da4f77e68c7f93a>`

source: January 4, 2022 - :cve:`2021-45115`
zh_hans: 2022 年 1 月 4 日 - :cve:`2021-45115`

source: Denial-of-service possibility in ``UserAttributeSimilarityValidator``. `Full description <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__
zh_hans: ``UserAttributeSimilarityValidator`` 存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2022/jan/04/security-releases/>`__

source: Django 4.0 :commit:`(patch) <df79ef03ac867c93caaa6be56bc69e66abfeef8f>`
zh_hans: Django 4.0 :commit:`(补丁) <df79ef03ac867c93caaa6be56bc69e66abfeef8f>`

source: Django 3.2 :commit:`(patch) <a8b32fe13bcaed1c0b772fdc53de84abc224fb20>`
zh_hans: Django 3.2 :commit:`(补丁) <a8b32fe13bcaed1c0b772fdc53de84abc224fb20>`

source: Django 2.2 :commit:`(patch) <2135637fdd5ce994de110affef9e67dffdf77277>`
zh_hans: Django 2.2 :commit:`(补丁) <2135637fdd5ce994de110affef9e67dffdf77277>`

source: December 7, 2021 - :cve:`2021-44420`
zh_hans: 2021 年 12 月 7 日 - :cve:`2021-44420`

source: Potential bypass of an upstream access control based on URL paths. `Full description <https://www.djangoproject.com/weblog/2021/dec/07/security-releases/>`__
zh_hans: 存在潜在的绕过基于 URL 路径的上游访问控制漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2021/dec/07/security-releases/>`__

source: Django 3.2 :commit:`(patch) <333c65603032c377e682cdbd7388657a5463a05a>`
zh_hans: Django 3.2 :commit:`(补丁) <333c65603032c377e682cdbd7388657a5463a05a>`

source: Django 3.1 :commit:`(patch) <22bd17488159601bf0741b70ae7932bffea8eced>`
zh_hans: Django 3.1 :commit:`(补丁) <22bd17488159601bf0741b70ae7932bffea8eced>`

source: Django 2.2 :commit:`(patch) <7cf7d74e8a754446eeb85cacf2fef1247e0cb6d7>`
zh_hans: Django 2.2 :commit:`(补丁) <7cf7d74e8a754446eeb85cacf2fef1247e0cb6d7>`

source: July 1, 2021 - :cve:`2021-35042`
zh_hans: 2021 年 7 月 1 日 - :cve:`2021-35042`

source: Potential SQL injection via unsanitized ``QuerySet.order_by()`` input. `Full description <https://www.djangoproject.com/weblog/2021/jul/01/security-releases/>`__
zh_hans: 潜在的 SQL 注入，通过未检验的 ``QuerySet.order_by()`` 输入。`完整描述 <https://www.djangoproject.com/weblog/2021/jul/01/security-releases/>`__

source: Django 3.2 :commit:`(patch) <a34a5f724c5d5adb2109374ba3989ebb7b11f81f>`
zh_hans: Django 3.2 :commit:`（补丁） <a34a5f724c5d5adb2109374ba3989ebb7b11f81f>`

source: Django 3.1 :commit:`(patch) <0bd57a879a0d54920bb9038a732645fb917040e9>`
zh_hans: Django 3.1 :commit:`（补丁） <0bd57a879a0d54920bb9038a732645fb917040e9>`

source: June 2, 2021 - :cve:`2021-33203`
zh_hans: 2021 年 6 月 2 日 - :cve:`2021-33203`

source: Potential directory traversal via ``admindocs``. `Full description <https://www.djangoproject.com/weblog/2021/jun/02/security-releases/>`__
zh_hans: 可能通过 ``admindocs`` 进行目录遍历。`完整描述 <https://www.djangoproject.com/weblog/2021/jun/02/security-releases/>`__

source: Django 3.2 :commit:`(patch) <dfaba12cda060b8b292ae1d271b44bf810b1c5b9>`
zh_hans: Django 3.2 :commit:`（补丁） <dfaba12cda060b8b292ae1d271b44bf810b1c5b9>`

source: Django 3.1 :commit:`(patch) <20c67a0693c4ede2b09af02574823485e82e4c8f>`
zh_hans: Django 3.1 :commit:`（补丁） <20c67a0693c4ede2b09af02574823485e82e4c8f>`

source: Django 2.2 :commit:`(patch) <053cc9534d174dc89daba36724ed2dcb36755b90>`
zh_hans: Django 2.2 :commit:`（补丁） <053cc9534d174dc89daba36724ed2dcb36755b90>`

source: June 2, 2021 - :cve:`2021-33571`
zh_hans: 2021 年 6 月 2 日 - :cve:`2021-33571`

source: Possible indeterminate SSRF, RFI, and LFI attacks since validators accepted leading zeros in IPv4 addresses. `Full description <https://www.djangoproject.com/weblog/2021/jun/02/security-releases/>`__
zh_hans: 由于验证器接受 IPv4 地址中的前导零，因此可能出现不确定的 SSRF、RFI 和 LFI 攻击。`完整描述 <https://www.djangoproject.com/weblog/2021/jun/02/security-releases/>`__

source: Django 3.2 :commit:`(patch) <9f75e2e562fa0c0482f3dde6fc7399a9070b4a3d>`
zh_hans: Django 3.2 :commit:`（补丁） <9f75e2e562fa0c0482f3dde6fc7399a9070b4a3d>`

source: Django 3.1 :commit:`(patch) <203d4ab9ebcd72fc4d6eb7398e66ed9e474e118e>`
zh_hans: Django 3.1 :commit:`（补丁） <203d4ab9ebcd72fc4d6eb7398e66ed9e474e118e>`

source: Django 2.2 :commit:`(patch) <f27c38ab5d90f68c9dd60cabef248a570c0be8fc>`
zh_hans: Django 2.2 :commit:`（补丁） <f27c38ab5d90f68c9dd60cabef248a570c0be8fc>`

source: May 6, 2021 - :cve:`2021-32052`
zh_hans: 2021 年 5 月 6 日 - :cve:`2021-32052`

source: Header injection possibility since ``URLValidator`` accepted newlines in input on Python 3.9.5+. `Full description <https://www.djangoproject.com/weblog/2021/may/06/security-releases/>`__
zh_hans: 由于 ``URLValidator`` 在 Python 3.9.5+ 上接受输入中的换行符，存在标头注入可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2021/may/06/security-releases/>`__

source: Django 3.2 :commit:`(patch) <2d2c1d0c97832860fbd6597977e2aae17dd7e5b2>`
zh_hans: Django 3.2 :commit:`(补丁) <2d2c1d0c97832860fbd6597977e2aae17dd7e5b2>`

source: Django 3.1 :commit:`(patch) <afb23f5929944a407e4990edef1c7806a94c9879>`
zh_hans: Django 3.1 :commit:`(补丁) <afb23f5929944a407e4990edef1c7806a94c9879>`

source: Django 2.2 :commit:`(patch) <d9594c4ea57b6309d93879805302cec9ae9f23ff>`
zh_hans: Django 2.2 :commit:`(补丁) <d9594c4ea57b6309d93879805302cec9ae9f23ff>`

source: May 4, 2021 - :cve:`2021-31542`
zh_hans: 2021 年 5 月 4 日 - :cve:`2021-31542`

source: Potential directory-traversal via uploaded files. `Full description <https://www.djangoproject.com/weblog/2021/may/04/security-releases/>`__
zh_hans: 通过上传的文件进行潜在的目录遍历。`完整描述 <https://www.djangoproject.com/weblog/2021/may/04/security-releases/>`__

source: Django 3.2 :commit:`(patch) <c98f446c188596d4ba6de71d1b77b4a6c5c2a007>`
zh_hans: Django 3.2 :commit:`（补丁） <c98f446c188596d4ba6de71d1b77b4a6c5c2a007>`

source: Django 3.1 :commit:`(patch) <25d84d64122c15050a0ee739e859f22ddab5ac48>`
zh_hans: Django 3.1 :commit:`（补丁） <25d84d64122c15050a0ee739e859f22ddab5ac48>`

source: Django 2.2 :commit:`(patch) <04ac1624bdc2fa737188401757cf95ced122d26d>`
zh_hans: Django 2.2 :commit:`（补丁） <04ac1624bdc2fa737188401757cf95ced122d26d>`

source: April 6, 2021 - :cve:`2021-28658`
zh_hans: 2021 年 4 月 6 日 - :cve:`2021-28658`

source: Potential directory-traversal via uploaded files. `Full description <https://www.djangoproject.com/weblog/2021/apr/06/security-releases/>`__
zh_hans: 通过上传的文件进行潜在的目录遍历。`完整描述 <https://www.djangoproject.com/weblog/2021/apr/06/security-releases/>`__

source: Django 3.2 :commit:`(patch) <2820fd1be5dfccbf1216c3845fad8580502473e1>`
zh_hans: Django 3.2 :commit:`（补丁） <2820fd1be5dfccbf1216c3845fad8580502473e1>`

source: Django 3.1 :commit:`(patch) <cca0d98118cccf9ae0c6dcf2d6c57fc50469fbf0>`
zh_hans: Django 3.1 :commit:`（补丁） <cca0d98118cccf9ae0c6dcf2d6c57fc50469fbf0>`

source: Django 3.0 :commit:`(patch) <e7fba62248f604c76da4f23dcf1db4a57b0808ea>`
zh_hans: Django 3.0 :commit:`（补丁） <e7fba62248f604c76da4f23dcf1db4a57b0808ea>`

source: Django 2.2 :commit:`(patch) <4036d62bda0e9e9f6172943794b744a454ca49c2>`
zh_hans: Django 2.2 :commit:`（补丁） <4036d62bda0e9e9f6172943794b744a454ca49c2>`

source: February 19, 2021 - :cve:`2021-23336`
zh_hans: 2021 年 2 月 19 日 - :cve:`2021-23336`

source: Web cache poisoning via ``django.utils.http.limited_parse_qsl()``. `Full description <https://www.djangoproject.com/weblog/2021/feb/19/security-releases/>`__
zh_hans: 通过 ``django.utils.http.limited_parse_qsl()`` 进行的网络缓存中毒。`完整描述 <https://www.djangoproject.com/weblog/2021/feb/19/security-releases/>`__。

source: Django 3.2 :commit:`(patch) <be8237c7cce24b06aabde0b97afce98ddabbe3b6>`
zh_hans: Django 3.2 :commit:`（补丁） <be8237c7cce24b06aabde0b97afce98ddabbe3b6>`

source: Django 3.1 :commit:`(patch) <8f6d431b08cbb418d9144b976e7b972546607851>`
zh_hans: Django 3.1 :commit:`（补丁） <8f6d431b08cbb418d9144b976e7b972546607851>`

source: Django 3.0 :commit:`(patch) <326a926beef869d3341bc9ef737887f0449b6b71>`
zh_hans: Django 3.0 :commit:`（补丁） <326a926beef869d3341bc9ef737887f0449b6b71>`

source: Django 2.2 :commit:`(patch) <fd6b6afd5959b638c62dbf4839ccff97e7f7dfda>`
zh_hans: Django 2.2 :commit:`（补丁） <fd6b6afd5959b638c62dbf4839ccff97e7f7dfda>`

source: February 1, 2021 - :cve:`2021-3281`
zh_hans: 2021 年 2 月 1 日 - :cve:`2021-3281`

source: Potential directory-traversal via ``archive.extract()``. `Full description <https://www.djangoproject.com/weblog/2021/feb/01/security-releases/>`__
zh_hans: 通过 ``archive.extract()`` 进行潜在的目录遍历。`完整说明 <https://www.djangoproject.com/weblog/2021/feb/01/security-releases/>`__

source: Django 3.1 :commit:`(patch) <02e6592835b4559909aa3aaaf67988fef435f624>`
zh_hans: Django 3.1 :commit:`（补丁） <02e6592835b4559909aa3aaaf67988fef435f624>`

source: Django 3.0 :commit:`(patch) <52e409ed17287e9aabda847b6afe58be2fa9f86a>`
zh_hans: Django 3.0 :commit:`（补丁） <52e409ed17287e9aabda847b6afe58be2fa9f86a>`

source: Django 2.2 :commit:`(patch) <21e7622dec1f8612c85c2fc37fe8efbfd3311e37>`
zh_hans: Django 2.2 :commit:`（补丁） <21e7622dec1f8612c85c2fc37fe8efbfd3311e37>`

source: September 1, 2020 - :cve:`2020-24584`
zh_hans: 2020 年 9 月 1 日 - :cve:`2020-24584`
