Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed check for template engine alias uniqueness (:ticket:`24685`).
id: Diperbaiki pemeriksaan untuk keunikan nama lain mesin cetakan (:ticket:`24685`).
zh_hans: 修复了对模板引擎别名唯一性的检查问题 (:ticket:`24685`)。

source: Fixed crash when reusing the same ``Case`` instance in a query (:ticket:`24752`).
id: Diperbaiki kegagalan ketika menggunakan kembali instance ``Case`` sama di sebuah permintaan (:ticket:`24752`).
zh_hans: 修复了在查询中重复使用相同的 ``Case`` 实例时发生崩溃的问题 (:ticket:`24752`)。

source: Corrected join promotion for ``Case`` expressions. For example, annotating a query with a ``Case`` expression could unexpectedly filter out results (:ticket:`24766`).
id: Diperbaiki promosi join untuk pernyataan ``Case``. Sebagai contoh, bubuhi keterangan sebuah permintaan dengan pernyataan ``Case`` dapat tidak diharapkan menyaring hasil (:ticket:`24766`).
zh_hans: 修正了 ``Case`` 表达式的联接升级。例如，使用 ``Case`` 表达式对查询进行注释可能会意外地过滤结果 (:ticket:`24766`)。

source: Fixed negated ``Q`` objects in expressions. Cases like ``Case(When(~Q(friends__age__lte=30)))`` tried to generate a subquery which resulted in a crash (:ticket:`24705`).
id: Diperbaiki meniadakan obyek ``Q`` dalam pernyataan. Kasus-kasus seperti ``Case(When(~Q(friends__age__lte=30)))`` mencoba membangkitkan sebuah sub permintaan yang menghasilkan sebuah kegagalan (:ticket:`24705`).
zh_hans: 修复了表达式中否定的 ``Q`` 对象。例如，像 ``Case(When(~Q(friends__age__lte=30)))`` 这样的情况试图生成一个子查询，导致崩溃 (:ticket:`24705`)。

source: Fixed incorrect GROUP BY clause generation on MySQL when the query's model has a self-referential foreign key (:ticket:`24748`).
id: Diperbaiki pembangkitan klausa GROUP BY tidak benar di MySQL ketika model permintaan mempunyai pengacuan-sendiri (:ticket:`24748`).
zh_hans: 修复了当查询的模型具有自引用外键时，在 MySQL 上生成不正确的 GROUP BY 子句的问题 (:ticket:`24748`)。

source: Implemented ``ForeignKey.get_db_prep_value()`` so that ``ForeignKey``\s pointing to :class:`~django.db.models.UUIDField` and inheritance on models with ``UUIDField`` primary keys work correctly (:ticket:`24698`, :ticket:`24712`).
id: Diterapkan ``ForeignKey.get_db_prep_value()`` sehingga ``ForeignKey`` itu menunjuk ke :class:`~django.db.models.UUIDField` dan mewarisi pada model dengan primary key ``UUIDField`` bekerja dengan benar (:ticket:`24698`, :ticket:`24712`).
zh_hans: 实现了 ``ForeignKey.get_db_prep_value()``，使得指向 :class:`~django.db.models.UUIDField` 的 ``ForeignKey`` 以及具有 ``UUIDField`` 字段主键的模型之间的继承可以正确工作（:ticket:`24698`,`:ticket:`24712`）。

source: Fixed ``isnull`` lookup for ``HStoreField`` (:ticket:`24751`).
id: Diperbaiki pencarian ``isnull`` untuk ``HStoreField`` (:ticket:`24751`).
zh_hans: 修复了 ``HStoreField`` 的 ``isnull`` 查询 (:ticket:`24751`)。

source: Fixed a MySQL crash when a migration removes a combined index ( ``unique_together`` or ``index_together``) containing a foreign key (:ticket:`24757`).
zh_hans: 修复了在迁移中删除包含外键的联合索引（``unique_together`` 或 ``index_together``）时在 MySQL 上发生崩溃的问题 (:ticket:`24757`)。

source: Fixed session cookie deletion when using :setting:`SESSION_COOKIE_DOMAIN` (:ticket:`24799`).
id: Diperbaiki penghapusan kue sesi ketika menggunakan :setting:`SESSION_COOKIE_DOMAIN` (:ticket:`24799`).
zh_hans: 修复了在使用 :setting:`SESSION_COOKIE_DOMAIN` 时删除会话 cookie 的问题 (:ticket:`24799`)。

source: On PostgreSQL, when no access is granted for the ``postgres`` database, Django now falls back to the default database when it normally requires a "no database" connection (:ticket:`24791`).
id: Pada PostgreSQL, ketika tidak ada akses diberikan untuk basisdata ``postgres``, Django sekarang jatuh kebelakang ke basisdata awalan ketika itu secara biasa membutuhkan hubungan "no database" (:ticket:`24791`).
zh_hans: 在 PostgreSQL 上，当未授予 ``postgres`` 数据库的访问权限时，Django 现在会在通常需要“无数据库”连接时回退到默认数据库 (:ticket:`24791`)。

source: Fixed display of ``contrib.admin``’s ``ForeignKey`` widget when it's used in a row with other fields (:ticket:`24784`).
zh_hans: 修复了在与其他字段一起使用时，``contrib.admin`` 的 ``ForeignKey`` 小部件的显示问题 (:ticket:`24784`)。

source: Django 1.8.3 release notes
id: Catatan terbitan Django 1.8.3
zh_hans: Django 1.8.3 版本发行说明

source: Django 1.8.3 fixes several security issues and bugs in 1.8.2.
id: Django 1.8.3 memperbaiki masalah keamanan dan kesalahan di 1.8.2.
zh_hans: Django 1.8.3 修复了 1.8.2 中的几个安全问题和错误。

source: Also, ``django.utils.deprecation.RemovedInDjango20Warning`` was renamed to ``RemovedInDjango110Warning`` as the version roadmap was revised to 1.9, 1.10, 1.11 (LTS), 2.0 (drops Python 2 support). For backwards compatibility, ``RemovedInDjango20Warning`` remains as an importable alias.
id: Juga, ``django.utils.deprecation.RemovedInDjango20Warning`` telah dinamai menjadi ``RemovedInDjango110Warning`` sebagai versi peta jalan telah diperbaiki menjadi 1.9, 1.10, 1.11 (LTS), 2.0 (dijatuhkan dukungan Python 2). Untuk kesesuaian kebelakang, ``RemovedInDjango20Warning`` tetap sebagai nama lain dapat diimpor.
zh_hans: 此外，``django.utils.deprecation.RemovedInDjango20Warning`` 已被重命名为 ``RemovedInDjango110Warning``，因为版本规划已经修订为 1.9、1.10、1.11（LTS）、2.0（不再支持 Python 2）。为了向后兼容，``RemovedInDjango20Warning`` 仍然可以作为可导入的别名使用。

source: Denial-of-service possibility in URL validation
id: kemungkinan denial-of-service di pengesahan URL
zh_hans: URL 验证中的拒绝服务漏洞可能性。

source: :class:`~django.core.validators.URLValidator` included a regular expression that was extremely slow to evaluate against certain invalid inputs. This regular expression has been simplified and optimized.
id: :class:`~django.core.validators.URLValidator` menyertakan sebuah regular expression yang sangat lambat menilai terhadap masukan tidak sah tertentu. Regular expression ini telah disederhanakan dan dioptimalkan.
zh_hans: :class:`~django.core.validators.URLValidator` 包含一个对某些无效输入极其缓慢的正则表达式进行评估的问题。现在已简化和优化了这个正则表达式。

source: Fixed ``BaseRangeField.prepare_value()`` to use each ``base_field``’s ``prepare_value()`` method (:ticket:`24841`).
zh_hans: 修复了 ``BaseRangeField.prepare_value()`` 以使用每个 ``base_field`` 的 ``prepare_value()`` 方法 (:ticket:`24841`)。

source: Fixed crash during :djadmin:`makemigrations` if a migrations module either is missing ``__init__.py`` or is a file (:ticket:`24848`).
id: Diperbaiki kegagalan selama :djadmin:`makemigrations` jika sebuah modul perpindahan antara hilang ``__init__.py`` atau adalah sebuah berkas (:ticket:`24848`).
zh_hans: 修复了在执行 :djadmin:`makemigrations` 时出现的崩溃问题，如果迁移模块缺少 ``__init__.py`` 或是一个文件 (:ticket:`24848`)。

source: Fixed ``QuerySet.exists()`` returning incorrect results after annotation with ``Count()`` (:ticket:`24835`).
id: Diperbaiki ``QuerySet.exists()`` mengembalikan hasil tidak benar setelah keterangan dengan ``Count()`` (:ticket:`24835`).
zh_hans: 修复了在使用 ``Count()`` 注释后，``QuerySet.exists()`` 返回不正确的结果 (:ticket:`24835`)。

source: Corrected ``HStoreField.has_changed()`` (:ticket:`24844`).
id: Diperbaiki ``HStoreField.has_changed()`` (:ticket:`24844`).
zh_hans: 修正了 ``HStoreField.has_changed()`` (:ticket:`24844`)。

source: Reverted an optimization to the CSRF template context processor which caused a regression (:ticket:`24836`).
id: Dikembalikan sebuah optimalisasi pada pengolah konteks cetakan CSRF yang menyebabkan sebuah pemulihan (:ticket:`24836`).
zh_hans: 撤销了 CSRF 模板上下文处理器的优化，因为它导致了一个回归问题 (:ticket:`24836`)。

source: Fixed a regression which caused template context processors to overwrite variables set on a ``RequestContext`` after it's created (:ticket:`24847`).
id: Diperbaiki sebuah pemulihan yang menyebabkan pengolah konteks cetakan untuk menulis kembali variabel disetel pada ``RequestContext`` setelah dia dibuat (:ticket:`24847`).
zh_hans: 修复了一个导致模板上下文处理器在 ``RequestContext`` 创建后覆盖设置的变量的回归问题 (:ticket:`24847`)。

source: Fixed a crash when using a reverse one-to-one relation in ``ModelAdmin.list_display`` (:ticket:`24851`).
id: Diperbaiki sebuah kegagalan ketika menggunakan balikan hubungan one-to-one di ``ModelAdmin.list_display`` (:ticket:`24851`).
zh_hans: 修复了在 ``ModelAdmin.list_display`` 中使用反向一对一关系时发生崩溃的问题 (:ticket:`24851`)。

source: Fixed quoting of SQL when renaming a field to ``AutoField`` in PostgreSQL (:ticket:`24892`).
id: Diperbaiki mengutip dari SQL ketika menamai kembali sebuah bidang pada ``AutoField`` di PostgreSQL (:ticket:`24892`).
zh_hans: 修复了在 PostgreSQL 中将字段重命名为 ``AutoField`` 时 SQL 引用的问题 (:ticket:`24892`)。

source: Fixed lack of unique constraint when changing a field from ``primary_key=True`` to ``unique=True`` (:ticket:`24893`).
id: Diperbaiki kekurangan dari batasan unik ketika merubah sebuah bidang dari ``primary_key=True`` menjadi ``unique=True`` (:ticket:`24893`).
zh_hans: 修复了从 ``primary_key=True`` 更改字段为 ``unique=True`` 时缺少唯一约束的问题 (:ticket:`24893`)。

source: Fixed queryset pickling when using ``prefetch_related()`` after deleting objects (:ticket:`24831`).
id: Diperbaiki kesulitan queryset ketika menggunakan ``prefetch_related()`` setelah menghapus obyek (:ticket:`24831`).
zh_hans: 修复了在删除对象后使用 ``prefetch_related()`` 时的查询集 pickling 问题 (:ticket:`24831`)。

source: Allowed using ``choices`` longer than 1 day with ``DurationField`` (:ticket:`24897`).
id: Diizinkan menggunakan ``choices`` lebih panjang dari 1 hari dengan ``DurationField`` (:ticket:`24897`).
zh_hans: 允许在 ``DurationField`` 中使用长于 1 天的 ``choices`` (:ticket:`24897`)。

source: Fixed a crash when loading squashed migrations from two apps with a dependency between them, where the dependent app's replaced migrations are partially applied (:ticket:`24895`).
id: Diperbaiki sebuah kegagalan ketika memuat perpindahan tergencet dari dua aplikasi dengan ketergantungan diantara mereka, dimana tergantung perpindahan diganti aplikasi sebagian diberlakukan (:ticket:`24895`).
zh_hans: 修复了在加载两个具有依赖关系的应用程序的压缩迁移时发生崩溃的问题，在这种情况下，受依赖应用程序替换的迁移部分被应用 (:ticket:`24895`)。

source: Fixed recording of applied status for squashed (replacement) migrations (:ticket:`24628`).
id: Diperbaiki rekaman dari keadaan yang diberlakukan untuk penindihan (penggantian) perpindahan (:ticket:`24628`).
zh_hans: 修复了对已应用状态的压缩（替代）迁移的记录问题 (:ticket:`24628`)。

source: Fixed queryset annotations when using ``Case`` expressions with ``exclude()`` (:ticket:`24833`).
id: Diperbaiki keterangan queryset ketika menggunakan pernyataan ``Case`` dengan ``exclude()`` (:ticket:`24833`).
zh_hans: 修复了在使用 ``Case`` 表达式与 ``exclude()`` 时的查询集注释问题 (:ticket:`24833`)。

source: Corrected join promotion for multiple ``Case`` expressions. Annotating a query with multiple ``Case`` expressions could unexpectedly filter out results (:ticket:`24924`).
id: Diperbaiki promosi join untuk banyak pernyataan ``Case``. Sebagai contoh, bubuhi keterangan sebuah permintaan dengan banyak pernyataan ``Case`` dapat tidak diharapkan menyaring hasil (:ticket:`24924`).
zh_hans: 修正了多个 ``Case`` 表达式的联接升级。在查询中使用多个 ``Case`` 表达式进行注释可能会意外地过滤掉结果 (:ticket:`24924`)。

source: Fixed usage of transforms in subqueries (:ticket:`24744`).
id: Diperbaiki penggunaan dari perubahan di sub permintaan (:ticket:`24744`).
zh_hans: 修复了在子查询中使用 transforms 的问题 (:ticket:`24744`)。

source: Provided better backwards compatibility for the ``verbosity`` argument in ``optparse`` management commands by casting it to an integer (:ticket:`24769`).
id: Disediakan kesesuaian kebelakang lebih baik untuk argumen ``verbosity`` di perintah pengelolaan ``optparse`` dengan menuangkan itu ke sebuah integer (:ticket:`24769`).
zh_hans: 通过将 ``optparse`` 管理命令中的 ``verbosity`` 参数转换为整数，提供了更好的向后兼容性 (:ticket:`24769`)。

source: Fixed ``prefetch_related()`` on databases other than PostgreSQL for models using UUID primary keys (:ticket:`24912`).
id: Diperbaiki ``prefetch_related()`` di basisdata selain dari PostgreSQL untuk model menggunakan primary key UUID (:ticket:`24912`).
zh_hans: 修复了在使用 UUID 主键的模型上，除了 PostgreSQL 数据库外的其他数据库上的 ``prefetch_related()`` 问题 (:ticket:`24912`)。

source: Fixed removing ``unique_together`` constraints on MySQL (:ticket:`24972`).
id: Diperbaiki memindahkan batasan ``unique_together`` di MySQL (:ticket:`24972`).
zh_hans: 修复了在 MySQL 上删除 ``unique_together`` 约束的问题 (:ticket:`24972`)。

source: Fixed crash when uploading images with MIME types that Pillow doesn't detect, such as bitmap, in ``forms.ImageField`` (:ticket:`24948`).
id: Diperbaiki kegagalan ketika mengunggah gambar dengan jenis MIME yang Pillow tidak mengetahui, seperti bitmap, di ``forms.ImageField`` (:ticket:`24948`).
zh_hans: 修复了在 ``forms.ImageField`` 中上传 Pillow 无法检测到的 MIME 类型的图像时的崩溃问题，例如位图 (:ticket:`24948`)。

source: Fixed a regression when deleting a model through the admin that has a ``GenericRelation`` with a ``related_query_name`` (:ticket:`24940`).
id: Diperbaiki sebuah pemulihan ketika menghapus sebuah model melalui admin yang mempunyai ``GenericRelation`` dengan ``related_query_name`` (:ticket:`24940`).
zh_hans: 修复了通过管理员删除具有 ``related_query_name`` 的 ``GenericRelation`` 的模型时发生的回归问题 (:ticket:`24940`)。

source: Reallowed non-ASCII values for ``ForeignKey.related_name`` on Python 3 by fixing the false positive system check (:ticket:`25016`).
id: Dizinkan kembali nilai-nilai bukan-ASCII untuk ``ForeignKey.related_name`` pada Python 3 dengan memperbaiki pemeriksaan sistem positif salah (:ticket:`25016`).
zh_hans: 通过修复虚假的系统检查，重新允许在 Python 3 上使用非 ASCII 值的 ``ForeignKey.related_name`` (:ticket:`25016`)。

source: Fixed inline forms that use a parent object that has a ``UUIDField`` primary key and a child object that has an ``AutoField`` primary key (:ticket:`24958`).
id: Diperbaiki formulir obyek yang menggunakan obyek induk yang mempunyai primary key ``UUIDField`` dan obyek anak yang mempunyai sebuah primary key ``AutoField`` (:ticket:`24958`).
zh_hans: 修复了使用具有 ``UUIDField`` 主键的父对象和具有 ``AutoField`` 主键的子对象的内联表单的问题 (:ticket:`24958`)。

source: Fixed a regression in the ``unordered_list`` template filter on certain inputs (:ticket:`25031`).
id: Diperbaiki sebuah pemulihan di penyaring cetakan ``unordered_list`` di masukan tertentu (:ticket:`25031`).
zh_hans: 修复了在某些输入上 ``unordered_list`` 模板过滤器中的回归问题 (:ticket:`25031`)。

source: Fixed a regression in ``URLValidator`` that invalidated Punycode TLDs (:ticket:`25059`).
id: Diperbaiki sebuah pemulihan di ``URLValidator`` yang mentidaksahkan Punycode TLDs (:ticket:`25059`).
zh_hans: 修复了 ``URLValidator`` 中的回归问题，该问题使 Punycode TLD 无效 (:ticket:`25059`)。

source: Improved ``pyinotify`` ``runserver`` polling (:ticket:`23882`).
zh_hans: 改进了 ``pyinotify`` 在 ``runserver`` 中的轮询功能 (:ticket:`23882`)。

source: Django 1.8.4 release notes
id: Catatan terbitan Django 1.8.4
zh_hans: Django 1.8.4 版本发行说明

source: Django 1.8.4 fixes a security issue and several bugs in 1.8.3.
id: Django 1.8.4 memperbaiki masalah keamanan dan beberapa kesalahan di 1.8.3.
zh_hans: Django 1.8.4 修复了 1.8.3 中的一个安全问题和几个错误。

source: Added the ability to serialize values from the newly added :class:`~django.db.models.UUIDField` (:ticket:`25019`).
id: Ditambahkan kemampuan untuk menserialisasikan nilai-nilai dari :class:`~django.db.models.UUIDField` ditambahkan baru (:ticket:`25019`).
zh_hans: 增加了对新添加的 :class:`~django.db.models.UUIDField` 的值进行序列化的能力 (:ticket:`25019`)。

source: Added a system check warning if the old ``TEMPLATE_*`` settings are defined in addition to the new ``TEMPLATES`` setting.
id: Ditambahkan sebuah peringatan pemeriksaan sistem jika pengaturan ``TEMPLATE_*`` lama ditentukan sebagai tambahan pada pengaturan ``TEMPLATES`` baru.
zh_hans: 如果在新的 ``TEMPLATES`` 设置之外定义了旧的 ``TEMPLATE_*`` 设置，将会添加一个系统检查警告。

source: Fixed ``QuerySet.raw()`` so ``InvalidQuery`` is not raised when using the ``db_column`` name of a ``ForeignKey`` field with ``primary_key=True`` (:ticket:`12768`).
id: Diperbaiki ``QuerySet.raw()`` sehingga ``InvalidQuery`` tidak dimunculkan ketika menggunakan nama ``db_column`` dari bidang ``ForeignKey`` dengan ``primary_key=True`` (:ticket:`12768`).
zh_hans: 修复了 ``QuerySet.raw()``，以便在使用具有 ``primary_key=True`` 的 ``ForeignKey`` 字段的 ``db_column`` 名称时不会引发 ``InvalidQuery`` 错误 (:ticket:`12768`)。

source: Prevented an exception in ``TestCase.setUpTestData()`` from leaking the transaction (:ticket:`25176`).
id: Dicegah sebuah pengecualian dalam ``TestCase.setUpTestData()`` dari membocorkan transaksi (:ticket:`25176`).
zh_hans: 在 ``TestCase.setUpTestData()`` 中防止异常泄漏事务（:ticket:`25176`）。

source: Fixed ``has_changed()`` method in ``contrib.postgres.forms.HStoreField`` (:ticket:`25215`, :ticket:`25233`).
id: Diperbaiki metode ``has_changed()`` di ``contrib.postgres.forms.HStoreField`` (:ticket:`25215`, :ticket:`25233`).
zh_hans: 修复了 ``contrib.postgres.forms.HStoreField`` 中的 ``has_changed()`` 方法（:ticket:`25215`，:ticket:`25233`）。

source: Fixed the recording of squashed migrations when running the ``migrate`` command (:ticket:`25231`).
id: Diperbaiki perekaman dari perpindahan penindihan ketika menjalankan perintah ``migrate`` (:ticket:`25231`).
zh_hans: 在运行 ``migrate`` 命令时修复了合并迁移记录的问题（:ticket:`25231`）。

source: Moved the :ref:`unsaved model instance assignment data loss check <unsaved-model-instance-check-18>` to ``Model.save()`` to allow easier usage of in-memory models (:ticket:`25160`).
id: Dipindahkan :ref:`unsaved model instance assignment data loss check <unsaved-model-instance-check-18>` pada ``Model.save()`` mengizinkan penggunaan lebih mudah dari model dalam-memori (:ticket:`25160`).
zh_hans: 将 :ref:`未保存的模型实例分配数据丢失检查 <unsaved-model-instance-check-18>` 移动到了 ``Model.save()`` 中，以便更容易使用内存中的模型（:ticket:`25160`）。

source: Prevented ``varchar_patterns_ops`` and ``text_patterns_ops`` indexes for ``ArrayField`` (:ticket:`25180`).
id: Dicegah indeks ``varchar_patterns_ops`` dan ``text_patterns_ops`` untuk ``ArrayField`` (:ticket:`25180`).
zh_hans: 防止了对 ``ArrayField`` 创建 ``varchar_patterns_ops`` 和 ``text_patterns_ops`` 索引（:ticket:`25180`）。

source: Django 1.8.5 release notes
id: Catatan terbitan Django 1.8.5
zh_hans: Django 1.8.5 版本发行说明

source: *October 3, 2015*
id: *Oktober 3, 2015*
zh_hans: *2015 年 10 月 3 日*

source: Django 1.8.5 fixes several bugs in 1.8.4.
id: Django 1.8.5 memperbaiki beberapa kesalahan di 1.8.4.
zh_hans: Django 1.8.5 修复了 1.8.4 中的几个错误。

source: Made the development server's autoreload more robust (:ticket:`24704`).
id: Dibuat pengembangan peladen otomatis dimuat kembali lebih kuat (:ticket:`24704`).
zh_hans: 改进了开发服务器的自动重新加载功能，使其更加健壮（:ticket:`24704`）。

source: Fixed ``AssertionError`` in some delete queries with a model containing a field that is both a foreign and primary key (:ticket:`24951`).
id: Diperbaiki ``AssertionError`` di beberapa permintaan hapus dengan sebuah model mengandung sebuah bidang yang keduanya foreign dan primary key (:ticket:`24951`).
zh_hans: 修复了包含既是外键又是主键的字段的模型中一些删除查询中的 ``AssertionError`` （:ticket:`24951`）。

source: Fixed ``AssertionError`` in some complex queries (:ticket:`24525`).
id: Diperbaiki ``AssertionError`` di beberapa permintaan rumit (:ticket:`24525`).
zh_hans: 修复了一些复杂查询中的 ``AssertionError`` （:ticket:`24525`）。

source: Fixed a migrations crash with ``GenericForeignKey`` (:ticket:`25040`).
id: Diperbaiki sebuah kegagalan perpindahan dengan ``GenericForeignKey`` (:ticket:`25040`).
zh_hans: 修复了使用 ``GenericForeignKey`` 时的迁移崩溃问题（:ticket:`25040`）。

source: Made ``translation.override()`` clear the overridden language when a translation isn't initially active (:ticket:`25295`).
id: Dibuat ``translation.override()`` membersihkan penimpaan bahasa ketika terjemahan tidak secara inisial aktif (:ticket:`25295`).
zh_hans: 在初始情况下未激活翻译时，使 ``translation.override()`` 清除被覆盖的语言（:ticket:`25295`）。

source: Fixed crash when using a value in ``ModelAdmin.list_display`` that clashed with a reverse field on the model (:ticket:`25299`).
id: Diperbaiki kegagalan ketika menggunakan sebuah nilai di ``ModelAdmin.list_display`` yang bertentangan dengan bidang balikan di model (:ticket:`25299`).
zh_hans: 修复了在使用 ``ModelAdmin.list_display`` 中的值与模型上的反向字段冲突时导致崩溃的问题（:ticket:`25299`）。

source: Fixed autocompletion for options of non-``argparse`` management commands (:ticket:`25372`).
id: Diperbaiki pelengkapan otomatis untuk pilihan dari perintah pengelolaan bukan-``argparse`` (:ticket:`25372`).
zh_hans: 修复了非 ``argparse`` 管理命令选项的自动补全问题（:ticket:`25372`）。

source: Alphabetized ordering of imports in ``from django.db import migrations, models`` statement in newly created migrations (:ticket:`25384`).
id: Pengurutan alphabet dari import di pernyataan ``from django.db import migrations, models`` di baru saja dibuat perpindahan (:ticket:`25384`).
zh_hans: 在新创建的迁移中，按字母顺序排列了 ``from django.db import migrations, models`` 语句中的导入项（:ticket:`25384`）。

source: Fixed migrations crash on MySQL when adding a text or a blob field with an unhashable default (:ticket:`25393`).
id: Diperbaiki kegagalan perpindahan pada MySQL ketika menambahkan sebuah teks atau bidang blob dengan awal tidak dapat diacak (:ticket:`25393`).
zh_hans: 修复了在 MySQL 上添加具有不可哈希默认值的文本或 blob 字段时导致迁移崩溃的问题（:ticket:`25393`）。

source: Changed ``Count`` queries to execute ``COUNT(*)`` instead of ``COUNT('*')`` as versions of Django before 1.8 did (:ticket:`25377`). This may fix a performance regression on some databases.
id: Dirubah permintaan ``Count`` untuk menjalankan ``COUNT(*)`` daripada ``COUNT('*')`` sebagai versi dari Django sebelum 1.8 lakukan (:ticket:`25377`). Ini mungkin memperbaiki pemulihan penampilan pada beberapa basisdata.
zh_hans: 将 ``Count`` 查询更改为执行 ``COUNT(*)``，而不是像 Django 1.8 之前的版本一样执行 ``COUNT('*')`` （:ticket:`25377`）。这可能会在某些数据库上修复性能回退问题。

source: Fixed custom queryset chaining with ``values()`` and ``values_list()`` (:ticket:`20625`).
id: Diperbaiki penyesuaian queryset mengikat dengan ``values()`` dan ``values_list()`` (:ticket:`20625`).
zh_hans: 修复了在使用 ``values()`` 和 ``values_list()`` 进行自定义查询集链的问题（:ticket:`20625`）。

source: Moved the :ref:`unsaved model instance assignment data loss check <unsaved-model-instance-check-18>` on reverse relations to ``Model.save()`` (:ticket:`25160`).
id: Dipindahkan :ref:`unsaved model instance assignment data loss check <unsaved-model-instance-check-18>` di membalikkan hubungan pada ``Model.save()`` (:ticket:`25160`).
zh_hans: 将对反向关系的 :ref:`未保存的模型实例分配数据丢失检查 <unsaved-model-instance-check-18>` 移动到了 ``Model.save()`` 中（:ticket:`25160`）。

source: Readded inline foreign keys to form instances when validating model formsets (:ticket:`25431`).
id: Ditambahkan kembali foreign key obyek ke instance formulir ketika mengesahkan model formset (:ticket:`25431`).
zh_hans: 在验证模型表单集时，重新将内联外键添加到表单实例中（:ticket:`25431`）。

source: Allowed using ORM write methods after disabling autocommit with :func:`set_autocommit(False) <django.db.transaction.set_autocommit>` (:ticket:`24921`).
id: Diizinkan menggunakan metode penulisan ORM setelah meniadakan otomatis perbaikan dengan :func:`set_autocommit(False) <django.db.transaction.set_autocommit>` (:ticket:`24921`).
zh_hans: 允许在使用 :func:`set_autocommit(False) <django.db.transaction.set_autocommit>` 禁用自动提交后使用 ORM 写入方法（:ticket:`24921`）。

source: Fixed the ``manage.py test --keepdb`` option on Oracle (:ticket:`25421`).
id: Diperbaiki pilihan ``manage.py test --keepdb`` di Oracle (:ticket:`25421`).
zh_hans: 修复了 Oracle 上的 ``manage.py test --keepdb`` 选项（:ticket:`25421`）。

source: Fixed incorrect queries with multiple many-to-many fields on a model with the same 'to' model and with ``related_name`` set to '+' (:ticket:`24505`, :ticket:`25486`).
id: Diperbaiki permintaan tidak benar dengan banyak bidang many-to-many di sebuah model dengan sama model 'to' dan dengan ``related_name`` disetel menjadi '+' (:ticket:`24505`, :ticket:`25486`).
zh_hans: 修复了在模型上具有相同“to”模型并且 ``related_name`` 设置为 '+' 时的多个多对多字段的不正确查询（:ticket:`24505`，:ticket:`25486`）。

source: Fixed pickling a ``SimpleLazyObject`` wrapping a model (:ticket:`25389`).
id: Diperbaiki kesulitan ``SimpleLazyObject`` membungkus sebuah model (:ticket:`25389`).
zh_hans: 修复了对包装模型的 ``SimpleLazyObject`` 进行序列化的问题（:ticket:`25389`）。

source: Django 1.8.6 release notes
id: Catatan terbitan Django 1.8.6
zh_hans: Django 1.8.6 版本发行说明

source: *November 4, 2015*
zh_hans: *2015 年 11 月 4 日*
