Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The end of upstream support periods was reached in January 2012 for MySQL 5.0 and December 2013 for MySQL 5.1. As a consequence, Django 1.8 sets 5.5 as the minimum MySQL version it officially supports.
id: Akhir dari masa dukungan hulu telah sampai di Januari 2012 untuk MySQL 5.0 dan Desember 2013 untuk MySQL 5.1. Sebagai konsekuensinya, Django 1.8 menyetel 5.5 sebagai versi MySQL minimal dia secara resmi dukung.
zh_hans: MySQL 5.0 的上游支持期限在 2012 年 1 月到期，MySQL 5.1 的上游支持期限在 2013 年 12 月到期。因此，Django 1.8 将 5.5 版本设置为其正式支持的最低 MySQL 版本。

source: Support for Oracle versions older than 11.1
id: Mendukung untuk Oracle versi lebih lama dari 11.1
zh_hans: 对于早于 11.1 版本的 Oracle 的支持

source: The end of upstream support periods was reached in July 2010 for Oracle 9.2, January 2012 for Oracle 10.1, and July 2013 for Oracle 10.2. As a consequence, Django 1.8 sets 11.1 as the minimum Oracle version it officially supports.
id: Akhir dari masa dukungan hulu telah sampai di Juli 2010 untuk Oracle 9.2, Januari 2012 untuk Oracle 10.1, dan Juli 2013 untuk Oracle 10.2. Sebagai konsekuensinya, Django 1.8 menyetel 11.1 sebagai versi Oracle minimal dia secara resmi dukung.
zh_hans: Oracle 9.2 的上游支持期限在 2010 年 7 月到期，Oracle 10.1 的上游支持期限在 2012 年 1 月到期，Oracle 10.2 的上游支持期限在 2013 年 7 月到期。因此，Django 1.8 将 11.1 版本设置为其正式支持的最低 Oracle 版本。

source: Specific privileges used instead of roles for tests on Oracle
id: Hak khusus digunakan daripada peran untuk percobaan di Oracle
zh_hans: 在 Oracle 上，测试中使用特定权限而不是角色。

source: Earlier versions of Django granted the CONNECT and RESOURCE roles to the test user on Oracle. These roles have been deprecated, so Django 1.8 uses the specific underlying privileges instead. This changes the privileges required of the main user for running tests (unless the project is configured to avoid creating a test user). The exact privileges required now are detailed in :ref:`Oracle notes <oracle-notes>`.
id: Versi awal dari Django memberikan peran CONNECT dan RESOURCE pada pengguna percobaan di Oracle. Peran-peran ini telah diusangkan, jadi Django 1.8 menggunakan hak pokok khusus. Perubahan dari hak memwajibkan pengguna utama untuk menjalankan percobaan (meskipun proyek dikonfigurasikan untuk menghindari membuat sebuah pengguna percobaan). Hak tepat mewajibkan sekarang dirinci dalam :ref:`Oracle notes <oracle-notes>`.
zh_hans: 早期版本的 Django 在 Oracle 上为测试用户授予 CONNECT 和 RESOURCE 角色。这些角色已被弃用，因此 Django 1.8 改为使用特定的底层权限。这改变了运行测试所需的主用户的权限（除非项目配置为避免创建测试用户）。现在所需的确切权限详见 :ref:`Oracle 注释 <oracle-notes>`。

source: ``AbstractUser.last_login`` allows null values
id: ``AbstractUser.last_login`` selalu bernilai null
zh_hans: ``AbstractUser.last_login`` 允许空值

source: The :attr:`AbstractUser.last_login <django.contrib.auth.models.User.last_login>` field now allows null values. Previously, it defaulted to the time when the user was created which was misleading if the user never logged in. If you are using the default user (:class:`django.contrib.auth.models.User`), run the database migration included in ``contrib.auth``.
id: Bidang :attr:`AbstractUser.last_login <django.contrib.auth.models.User.last_login>` sekarang mengizinkan nilai null. Sebelumnya, itu diawalkan pada waktu ketika pengguna membuat yang menyesatkan jika pengguna tidak pernah masuk. Jika anda sedang menggunakan pengguna awalan (:class:`django.contrib.auth.models.User`), jalankan perpindahan basisdata disertakan di ``contrib.auth``.
zh_hans: :attr:`AbstractUser.last_login <django.contrib.auth.models.User.last_login>` 字段现在允许空值。以前，它默认为用户创建时的时间，如果用户从未登录，这会产生误导。如果你使用的是默认用户（:class:`django.contrib.auth.models.User`），请运行 ``contrib.auth`` 中包含的数据库迁移。

source: If you are using a custom user model that inherits from ``AbstractUser``, you'll need to run :djadmin:`makemigrations` and generate a migration for your app that contains that model. Also, if wish to set ``last_login`` to ``NULL`` for users who haven't logged in, you can run this query::
id: Jika anda sedang menggunakan penyesuaian model pengguna yang mewarisi dari ``AbstractUser``, anda akan butuh menjalankan :djadmin:`makemigrations` dan membangkitkan sebuah perpindahan untuk aplikasi anda yang mengandung model itu. Juga, jika berharap menyetel ``last_login`` menjadi ``NULL`` untuk pengguna yang belum masuk, anda dapat menjalankan permintaan ini::
zh_hans: 如果你使用从 ``AbstractUser`` 继承的自定义用户模型，你需要运行 :djadmin:`makemigrations` 并为包含该模型的应用程序生成一个迁移。此外，如果希望将未登录的用户的 ``last_login`` 设置为 ``NULL``，你可以运行以下查询：

source: Support for GEOS 3.1 and GDAL 1.6 has been dropped.
id: Dukungan untuk GEOS 3.1 dan GDAL 1.6 telah dibuang.
zh_hans: 不再支持 GEOS 3.1 和 GDAL 1.6 版本。

source: Support for SpatiaLite < 2.4 has been dropped.
id: Dukungan untuk SpatiaLite < 2.4 telah dibuang.
zh_hans: 不再支持 SpatiaLite 版本低于 2.4 。

source: GIS-specific lookups have been refactored to use the :class:`django.db.models.Lookup` API.
id: Pencarian khusus-GIS telah direfaktorisasi untuk menggunakan API :class:`django.db.models.Lookup`.
zh_hans: GIS-specific lookups 已经重构以使用 :class:`django.db.models.Lookup` API。

source: The default ``str`` representation of :class:`~django.contrib.gis.geos.GEOSGeometry` objects has been changed from WKT to EWKT format (including the SRID). As this representation is used in the serialization framework, that means that ``dumpdata`` output will now contain the SRID value of geometry objects.
id: Objek ``str`` representation of :class:`~django.contrib.gis.geos.GEOSGeometry` awalan telah berubah dari bentuk WKT menjadi EWKT (termasuk SRID). Ketika perwakilan ini digunakan dalam kerangka kerja serialisasi, itu berarti bahwa keluaran ``dumpdata`` akan sekarang mengandung nilai SRID dari obyek geometri.
zh_hans: :class:`~django.contrib.gis.geos.GEOSGeometry` 对象的默认 ``str`` 表示已从 WKT 更改为 EWKT 格式（包括 SRID）。由于这个表示法在序列化框架中使用，这意味着 ``dumpdata`` 输出现在将包含几何对象的 SRID 值。

source: Priority of context processors for ``TemplateResponse`` brought in line with ``render``
id: Prioritas dari pengolah konteks untuk ``TemplateResponse`` membawa sebaris dengan ``render``
zh_hans: 对于 ``TemplateResponse``，上下文处理器的优先级已与 ``render`` 保持一致。

source: The :class:`~django.template.response.TemplateResponse` constructor is designed to be a drop-in replacement for the :func:`~django.shortcuts.render` function. However, it had a slight incompatibility, in that for ``TemplateResponse``, context data from the passed in context dictionary could be shadowed by context data returned from context processors, whereas for ``render`` it was the other way around. This was a bug, and the behavior of ``render`` is more appropriate, since it allows the globally defined context processors to be overridden locally in the view. If you were relying on the fact context data in a ``TemplateResponse`` could be overridden using a context processor, you will need to change your code.
id: Pembangun :class:`~django.template.response.TemplateResponse` dirancang menjadi pengganti singgah untuk fungsi :func:`~django.shortcuts.render`. Bagaimanapun, itu mempunyai sedikit ketidaksesuaian, bahwa untuk ``TemplateResponse``, data konteks dari melewatkan di kamus konteks dapat dibayangi oleh data konteks dikembalikan dari pengolah konteks, sedangkan untuk ``render`` itu adalah cara lain. Ini adalah sebuah kesalahan, dan perilaku dari ``render`` lebih sesuai, sejak itu mengizinkan secara global menentukan pengolah konteks untuk menjadi dikesampingkan secara lokal di tampilan. Jika anda mengandalkan pada kenyataan data konteks di ``TemplateResponse`` dapat dikesampingkan menggunakan pengolah konteks, anda akan butuh merubah kode anda.
zh_hans: :class:`~django.template.response.TemplateResponse` 构造函数旨在成为 :func:`~django.shortcuts.render` 函数的一个替代。然而，它存在一个轻微的不兼容性，即对于 ``TemplateResponse``，传递的上下文字典中的上下文数据可能会被上下文处理器返回的上下文数据覆盖，而对于 ``render`` 则相反。这是一个错误，而 ``render`` 的行为更为合适，因为它允许在视图中本地覆盖全局定义的上下文处理器。如果你依赖于在 ``TemplateResponse`` 中使用上下文处理器可以覆盖上下文数据的事实，那么你需要更改你的代码。

source: Overriding ``setUpClass`` / ``tearDownClass`` in test cases
id: Menimpa ``setUpClass`` / ``tearDownClass`` di kasus-kasus percobaan
zh_hans: 在测试用例中重写 ``setUpClass`` / ``tearDownClass``

source: The decorators :func:`~django.test.override_settings` and :func:`~django.test.modify_settings` now act at the class level when used as class decorators. As a consequence, when overriding ``setUpClass()`` or ``tearDownClass()``, the ``super`` implementation should always be called.
id: Penghias :func:`~django.test.override_settings` dan :func:`~django.test.modify_settings` sekarang bertindak pada tingkat kelas ketika digunakan sebagai penghias kelas. Sebagai konsekuensi, ketika menimpa ``setUpClass()`` atau ``tearDownClass()``, penerapan ``super`` harus selalu dipanggil.
zh_hans: 装饰器 :func:`~django.test.override_settings` 和 :func:`~django.test.modify_settings` 现在在作为类装饰器使用时以类级别的方式起作用。因此，在重写 ``setUpClass()`` 或 ``tearDownClass()`` 时，应始终调用 ``super`` 实现。

source: Removal of ``django.contrib.formtools``
id: Pemindahan ``django.contrib.formtools``
zh_hans: 移除了 ``django.contrib.formtools`` 模块

source: The formtools contrib app has been moved to a separate package and the relevant documentation pages have been updated or removed.
id: Aplikasi bantuan formtool telah dipindahkan untuk memisahkan paket dan halaman dokumentasi yang bersangkut-paut telah diperbaharui atau dipindahkan.
zh_hans: formtools contrib 应用已被移动到一个单独的包中，并相应的文档页面已被更新或删除。

source: The new package is available `on GitHub`_ and on PyPI.
id: Paket baru tersedia `di GitHub`_ dan di PyPI.
zh_hans: 新的包可以在 `GitHub`_ 和 PyPI 上获得。

source: Database connection reloading between tests
id: Memuat kembali hubungan basisdata diantara percobaan
zh_hans: 测试之间重新加载数据库连接。

source: Django previously closed database connections between each test within a ``TestCase``. This is no longer the case as Django now wraps the whole ``TestCase`` within a transaction. If some of your tests relied on the old behavior, you should have them inherit from ``TransactionTestCase`` instead.
id: Django sebelumnya menutup hubungan basisdata diantara setiap percobaan dalam sebuah ``TestCase``. Ini tidak lagi kasus sebagai Django sekarang membungkus keseluruhan ``TestCase`` dalam sebuah transaksi. Jika beberapa percobaan anda bergantung pada perilaku lama, anda harus memiliki mereka mewarisi dari ``TransactionTestCase`` sebagai gantinya.
zh_hans: 以前，在 ``TestCase`` 中的每个测试之间，Django 会关闭数据库连接。现在不再是这样了，因为 Django 现在会将整个 ``TestCase`` 包装在一个事务中。如果你的一些测试依赖于旧的行为，你应该让它们继承自 ``TransactionTestCase``。

source: Cleanup of the ``django.template`` namespace
id: Membersihkan namescpace ``django.template``
zh_hans: 对 ``django.template`` 命名空间进行了清理

source: If you've been relying on private APIs exposed in the ``django.template`` module, you may have to import them from ``django.template.base`` instead.
id: Jika anda telah mengandalkan pada API pribadi diungkap dalam modul ``django.template``, anda mungkin harus mengimpor mereka dari ``django.template.base`` sebagai gantinya.
zh_hans: 如果你一直依赖于在 ``django.template`` 模块中公开的私有 API，你可能需要从 ``django.template.base`` 中导入它们。

source: Also private APIs ``django.template.base.compile_string()``, ``django.template.loader.find_template()``, and ``django.template.loader.get_template_from_string()`` were removed.
id: Juga pribadi API ``django.template.base.compile_string()``, ``django.template.loader.find_template()``, dan ``django.template.loader.get_template_from_string()`` dipindahkan.
zh_hans: 另外，已删除了私有 API ``django.template.base.compile_string()``, ``django.template.loader.find_template()`` 和 ``django.template.loader.get_template_from_string()``。

source: ``model`` attribute on private model relations
id: Atribut ``model`` pada hubungan model pribadi
zh_hans: 私有模型关系上的 ``model`` 属性

source: In earlier versions of Django, on a model with a reverse foreign key relationship (for example), ``model._meta.get_all_related_objects()`` returned the relationship as a ``django.db.models.related.RelatedObject`` with the ``model`` attribute set to the source of the relationship. Now, this method returns the relationship as ``django.db.models.fields.related.ManyToOneRel`` (private API ``RelatedObject`` has been removed), and the ``model`` attribute is set to the target of the relationship instead of the source. The source model is accessible on the ``related_model`` attribute instead.
id: Di versi paling awal dari Django, pada model dengan hubungan lintas foreign key (sebagai contoh), ``model._meta.get_all_related_objects()`` mengembalikan hubungan sebagai sebuah ``django.db.models.related.RelatedObject`` dengan atribut ``model`` disetel ke sumber dari hubungan. Sekarang, metode ini mengembalikan hubungan sebagai ``django.db.models.fields.related.ManyToOneRel`` (API pribadi ``RelatedObject`` telah dipindahkan), dan atribut ``model`` distel ke sasaran dari hubungan daripada sumber. Sumber model adalah dapat diakses pada atribut ``related_model`` sebagai gantinya.
zh_hans: 在早期版本的 Django 中，对于具有反向外键关系的模型（例如），``model._meta.get_all_related_objects()`` 返回关系作为具有 ``model`` 属性设置为关系源的 ``django.db.models.related.RelatedObject``。现在，这个方法返回关系作为 ``django.db.models.fields.related.ManyToOneRel`` （私有 API ``RelatedObject`` 已被删除），并且 ``model`` 属性设置为关系目标而不是源。源模型可以在 ``related_model`` 属性上访问。

source: Consider this example from the tutorial in Django 1.8:
zh_hans: 考虑一下来自 Django 1.8 教程的这个例子：

source: and compare it to the behavior on older versions:
zh_hans: 将其与旧版本的行为进行比较：

source: To access the source model, you can use a pattern like this to write code that will work with both Django 1.8 and older versions::
id: Untuk mengakses model sumber, anda dapat menggunakan pola seperti ini untuk menulis kode yang akan bekerja dengan kedua Django 1.8 dan versi terlama::
zh_hans: 为了访问源模型，您可以使用以下模式的代码，该代码可以在 Django 1.8 和旧版本中都有效：

source: Also note that ``get_all_related_objects()`` is deprecated in 1.8.
zh_hans: 还请注意，``get_all_related_objects()`` 在 1.8 中已被弃用。

source: The following changes to the database backend API are documented to assist those writing third-party backends in updating their code:
id: Perubahan berikut pada API backend basisdata didokumentasikan untuk memandu penulisan backend pihak-ketiga tersebut dalam memperbaharui kode mereka.
zh_hans: 以下对数据库后端 API 的更改已记录，以帮助那些编写第三方后端的人更新其代码：

source: ``BaseDatabaseXXX`` classes have been moved to ``django.db.backends.base``. Please import them from the new locations::
id: Kelas-kelas ``BaseDatabaseXXX`` telah dipindahkan ke ``django.db.backends.base``. Harap mengimpor mereka dari tempat baru::
zh_hans: ``BaseDatabaseXXX`` 类已经移动到 ``django.db.backends.base``。请从新的位置导入它们：

source: The ``data_types``, ``data_types_suffix``, and ``data_type_check_constraints`` attributes have moved from the ``DatabaseCreation`` class to ``DatabaseWrapper``.
id: Atribut ``data_types``, ``data_types_suffix``, dan ``data_type_check_constraints`` telah dipindahkan dari kelas ``DatabaseCreation`` ke ``DatabaseWrapper``.
zh_hans: ``DatabaseCreation`` 类中的 ``data_types``、``data_types_suffix`` 和 ``data_type_check_constraints`` 属性已经移到了 ``DatabaseWrapper`` 中。

source: The ``SQLCompiler.as_sql()`` method now takes a ``subquery`` parameter (:ticket:`24164`).
id: Metode ``SQLCompiler.as_sql()`` sekarang mengambil sebuah parameter ``subquery`` (:ticket:`24164`).
zh_hans: ``SQLCompiler.as_sql()`` 方法现在接受一个 ``subquery`` 参数 (:ticket:`24164`)。

source: The ``BaseDatabaseOperations.date_interval_sql()`` method now only takes a ``timedelta`` parameter.
id: Metode ``BaseDatabaseOperations.date_interval_sql()`` sekarang hanya mengambil parameter ``timedelta``.
zh_hans: ``BaseDatabaseOperations.date_interval_sql()`` 方法现在只接受一个 ``timedelta`` 参数。

source: ``AdminSite`` no longer takes an ``app_name`` argument and its ``app_name`` attribute has been removed. The application name is always ``admin`` (as opposed to the instance name which you can still customize using ``AdminSite(name="...")``.
id: ``AdminSite`` tidak lagi mengambil sebuah argumen ``app_name`` dan atribut ``app_name`` nya telah dipindahkan. Nama Aplikasi selalu ``admin`` (sebagai lawan pada nama instance yang anda dapat masih sesuaikan menggunakan ``AdminSite(name="...")``.
zh_hans: ``AdminSite`` 不再接受一个 ``app_name`` 参数，并且它的 ``app_name`` 属性已被删除。应用程序名称始终为 ``admin`` （与实例名称不同，你仍然可以使用 ``AdminSite(name="...")`` 进行自定义）。

source: The ``ModelAdmin.get_object()`` method (private API) now takes a third argument named ``from_field`` in order to specify which field should match the provided ``object_id``.
id: Metode ``ModelAdmin.get_object()`` (API pribadi) sekarang mengambil argumen ketiga bernama ``from_field`` untuk menentukan bidang mana harus cocok dengan ``object_id`` yang disediakan.
zh_hans: ``ModelAdmin.get_object()`` 方法（私有 API）现在接受一个名为 ``from_field`` 的第三个参数，以指定应该与提供的 ``object_id`` 匹配的字段。

source: The :meth:`ModelAdmin.response_delete() <django.contrib.admin.ModelAdmin.response_delete>` method now takes a second argument named ``obj_id`` which is the serialized identifier used to retrieve the object before deletion.
id: Metode :meth:`ModelAdmin.response_delete() <django.contrib.admin.ModelAdmin.response_delete>` sekarang mengambil argumen kedua bernama ``obj_id`` yang merupakan penciri serialisasi digunakan untuk mengambil obyek sebelum penghapusan.
zh_hans: :meth:`ModelAdmin.response_delete() <django.contrib.admin.ModelAdmin.response_delete>` 方法现在接受一个名为 ``obj_id`` 的第二个参数，它是在删除之前用于检索对象的序列化标识符。

source: Default autoescaping of functions in ``django.template.defaultfilters``
id: Pelolosan otomatis awalan dari fungsi di ``django.template.defaultfilters``
zh_hans: 默认情况下，``django.template.defaultfilters`` 中的函数现在会自动进行自动转义。

source: In order to make built-in template filters that output HTML "safe by default" when calling them in Python code, the following functions in ``django.template.defaultfilters`` have been changed to automatically escape their input value:
id: Untuk membuat penyaring siap-pakai yang mengeluarkan HTML "safe by default" ketika memanggil mereka di kode Python, fungsi berikut di ``django.template.defaultfilters`` telah berubah menjadi pelolosan otomatis nilai masukan mereka:
zh_hans: 为了在 Python 代码中调用输出 HTML 的内置模板过滤器时使其 "默认安全"，已更改了 ``django.template.defaultfilters`` 中以下函数，以自动转义其输入值：

source: You can revert to the old behavior by specifying ``autoescape=False`` if you are passing trusted content. This change doesn't have any effect when using the corresponding filters in templates.
id: Anda dapat kembali ke perilaku lama dengan menentukan ``autoescape=False`` jika anda sedang melewatkan isi yang dipercaya. Perubahan ini tidak mempunyai pengaruh apapun ketika menggunakan penyaring sesuai di cetakan.
zh_hans: 如果您传递了可信内容，可以通过指定 ``autoescape=False`` 来恢复到旧的行为。在模板中使用相应的过滤器时，此更改不会产生任何效果。

source: ``connections.queries`` is now a read-only attribute.
id: ``connections.queries`` adalah sekarang sebuah atribut hanya-baca.
zh_hans: ``connections.queries`` 现在是一个只读属性。

source: Database connections are considered equal only if they're the same object. They aren't hashable any more.
id: Hubungan basisdata dipertimbangkan sama hanya jika mereka obyek yang sama. Mereka tidak dapat diacak lagi.
zh_hans: 现在只有当数据库连接是同一个对象时才被视为相等。它们不再是可哈希的。

source: :class:`~django.middleware.gzip.GZipMiddleware` used to disable compression for some content types when the request is from Internet Explorer, in order to work around a bug in IE6 and earlier. This behavior could affect performance on IE7 and later. It was removed.
id: :class:`~django.middleware.gzip.GZipMiddleware` digunakan untuk meniadakan pemampatan untuk beberapa jenis isi ketika permintaan dari Internet Explorer, agar memecahkan sebuah kesalahan di IE6 dan paling awal. Perilaku ini dapat mempengaruhi penampilan pada IE7 dan terakhir. Itu telah dipindahkan.
zh_hans: :class:`~django.middleware.gzip.GZipMiddleware` 用于在请求来自 Internet Explorer 时禁用某些内容类型的压缩，以解决 IE6 及更早版本中的一个错误。这种行为可能会影响 IE7 及更高版本的性能。已被移除。

source: ``URLField.to_python`` no longer adds a trailing slash to pathless URLs.
id: `URLField.to_python`` tidak lagi menambah sebuah buntutuan garis miring pada URL tidak berjalur.
zh_hans: ``URLField.to_python`` 不再在没有路径的 URL 中添加尾随斜杠。

source: The :tfilter:`length` template filter now returns ``0`` for an undefined variable, rather than an empty string.
id: Penyaring cetakan :tfilter:`length` sekarang mengembalikan ``0`` untuk sebuah variabel tidak ditentukan, daripada sebuah string kosong.
zh_hans: 模板过滤器 :tfilter:`length` 现在对未定义的变量返回 ``0``，而不是空字符串。

source: ``ForeignKey.default_error_message['invalid']`` has been changed from ``'%(model)s instance with pk %(pk)r does not exist.'`` to ``'%(model)s instance with %(field)s %(value)r does not exist.'`` If you are using this message in your own code, please update the list of interpolated parameters. Internally, Django will continue to provide the ``pk`` parameter in ``params`` for backwards compatibility.
id: ``ForeignKey.default_error_message['invalid']`` telah berubah dari ``'%(model)s instance with pk %(pk)r does not exist.'`` menjadi ``'%(model)s instance with %(field)s %(value)r does not exist.'`` Jika anda menggunakan pesan ini di kode anda sendiri, harap memperbaharui daftar dari parameter yang disisipkan. Secara internal, Django akan melanjutkan menyediakan parameter ``pk`` di ``params`` untuk kesesuaian kebelakang.
zh_hans: ``ForeignKey.default_error_message['invalid']`` 已从 ``'%(model)s instance with pk %(pk)r does not exist.'`` 更改为 ``'%(model)s instance with %(field)s %(value)r does not exist.'`` 如果您在自己的代码中使用此消息，请更新插入的参数列表。在内部，Django 将继续提供 ``params`` 中的 ``pk`` 参数以保持向后兼容性。

source: ``UserCreationForm.error_messages['duplicate_username']`` is no longer used. If you wish to customize that error message, :ref:`override it on the form <modelforms-overriding-default-fields>` using the ``'unique'`` key in ``Meta.error_messages['username']`` or, if you have a custom form field for ``'username'``, using the ``'unique'`` key in its :attr:`~django.forms.Field.error_messages` argument.
zh_hans: ``UserCreationForm.error_messages['duplicate_username']`` 不再使用。如果您希望自定义该错误消息，请在表单上使用 ``Meta.error_messages['username']`` 中的 ``'unique'`` 键 :ref:`覆盖它 <modelforms-overriding-default-fields>`，或者如果您有一个自定义的 ``'username'`` 字段，可以在其 :attr:`~django.forms.Field.error_messages` 参数中使用 ``'unique'`` 键。

source: The block ``usertools`` in the ``base.html`` template of :mod:`django.contrib.admin` now requires the ``has_permission`` context variable to be set. If you have any custom admin views that use this template, update them to pass :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` as this new variable's value or simply include :meth:`AdminSite.each_context(request) <django.contrib.admin.AdminSite.each_context>` in the context.
id: Blok ``usertools`` di cetakan ``base.html`` dari :mod:`django.contrib.admin` sekarang membutuhkan variabel konteks ``has_permission`` untuk disetel. Jika anda mempunyai tampilan admin penyesuaian apapun yang menggunakan cetakan ini, perbaharui mereka untuk melewatkan :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` ketika nilai variabel ini atau cukup menyertakan :meth:`AdminSite.each_context(request) <django.contrib.admin.AdminSite.each_context>` di konteks.
zh_hans: 在 :mod:`django.contrib.admin` 的 ``base.html`` 模板中，块 ``usertools`` 现在需要设置 ``has_permission`` 上下文变量。如果您有任何使用此模板的自定义管理视图，请更新它们以传递 :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` 作为这个新变量的值，或者简单地在上下文中包括 :meth:`AdminSite.each_context(request) <django.contrib.admin.AdminSite.each_context>`。
