Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``ENABLE_PSYCO`` setting no longer exists. If your settings file includes ``ENABLE_PSYCO`` it will have no effect; to use Psyco_, we recommend writing a middleware class to activate it.
id: Pengaturan ``ENABLE_PSYCO`` tidak lagi ada. Jika berkas pengaturan anda termasuk ``ENABLE_PSYCO`` itu tidak akan mempunyai efek; untuk menggunakan Psyco_, kami menganjurkan menulis kelas middleware untuk mengaktifkannya.
zh_hans: ``ENABLE_PSYCO`` 设定将不再存在。假如你的设定文件包括 ``ENABLE_PSYCO`` ，那么它将不再生效。为了使用 Psyco_，我们建议写一个中间件类来激活它。

source: What's new in 0.96?
id: Apa yang baru di 0.96?
zh_hans: 0.96 新特性

source: This revision represents over a thousand source commits and over four hundred bug fixes, so we can't possibly catalog all the changes. Here, we describe the most notable changes in this release.
id: Perbaikan ini mewakili lebih dari ribuan perbaikan dan lebih empat ratus perbaikan kesalahan, jadi kami tidak mungkin mengkatalogkan semua perubahan. Disini, kami menggambarkkan keterangan paling berubah di terbitan ini.
zh_hans: 本次版本号的更改代表有超过 1000 次代码提交和超过 400 次漏洞修复，所以我们不能详细罗列所有的变化。在这里我们将描述本次发布中最为重要的变化。

source: New forms library
id: Pustaka formulir baru
zh_hans: 新的表单库

source: ``django.newforms`` is Django's new form-handling library. It's a replacement for ``django.forms``, the old form/manipulator/validation framework. Both APIs are available in 0.96, but over the next two releases we plan to switch completely to the new forms system, and deprecate and remove the old system.
id: ``django.newforms`` adalah pustaka penanganan-formulir baru Django. Dia pengganti untuk ``django.forms``, kerangka kerja form/manipulator/validation lama. Kedua API tersedia dalam 0.96, tetapi diatas dua terbitan selanjutnya kami berencana mengganti seluruhnya ke sistem formulir baru, dan mengusangkan dan memindahkan sistem lama.
zh_hans: ``django.newforms`` 是 Django 新的表单处理库。它是 ``django.forms`` 这个旧的表单／操作器／验证框架的一个替代。这两个 API 在 0.96 版本中都可用，但在接下来的两个版本发布中，我们计划完全切换到新的表单系统，并标记失效和移除旧的系统。

source: There are three elements to this transition:
id: Ada tiga unsur ke peralihan ini:
zh_hans: 针对这个的过渡将分三步：

source: We've copied the current ``django.forms`` to ``django.oldforms``. This allows you to upgrade your code *now* rather than waiting for the backwards-incompatible change and rushing to fix your code after the fact. Just change your import statements like this::
id: Kami menyalin ``django.forms`` saat ini ke ``django.oldforms``. Ini mengizinkan anda meningkatkan kode anda *sekarang* daripada menunggu untuk perubahan ketidakcocokan-kebelakang dan buru-buru memperbaiki kode anda setelah fakta. Cukup rubah pernyataan impor anda seperti ini::
zh_hans: 我们已经将当前的 ``django.forms`` 复制到了 ``django.oldforms``。这将允许你 *现在* 升级你的代码而不是等待向后不兼容的改变，然后匆忙修复你的代码。只需要像下面这样更改你的 import 声明：

source: The next official release of Django will move the current ``django.newforms`` to ``django.forms``. This will be a backwards-incompatible change, and anyone still using the old version of ``django.forms`` at that time will need to change their import statements as described above.
id: Terbitan resmi selanjutnya dari Django akan memindahkan ``django.newforms`` saat ini ke ``django.forms``. Ini akan menjadi perubahan kecocokan-kebelakang, dan siapapun masih menggunakan versi lama dari ``django.forms`` pada waktu itu akan butuh merubah pernyataan impor mereka seperti digambarkan diatas.
zh_hans: Django 的下一个正式版本将把当前的 ``django.newforms`` 移到 ``django.forms``。这将是一个向后不兼容的变化，届时还在使用旧版 ``django.forms`` 的人将需要如上所述修改他们的导入语句。

source: The next release after that will completely remove ``django.oldforms``.
id: Terbitan selanjutnya setelahnya akan sepenuhnya memindahkan ``django.oldforms``.
zh_hans: 在那之后的下一个发布版本将完全移除 ``django.oldforms``。

source: Although the ``newforms`` library will continue to evolve, it's ready for use for most common cases. We recommend that anyone new to form handling skip the old forms system and start with the new.
id: Meskipun pustaka ``newforms`` akan lanjut berkembang, dia siap untuk digunakan untuk kebanyakan kasus umum. Kami menganjurkan bahwa seiapapun baru terhadap penanganan formulir lewati sistem formulir baru dan mulai dengan yang baru.
zh_hans: 尽管 ``newforms`` 将会继续演进，但它足以应付大多数场景。我们建议任何新接触表单处理的人员跳过旧的表单系统而直接使用新的表单系统。

source: For more information about ``django.newforms``, read the :doc:`newforms documentation </topics/forms/index>`.
id: Untuk info lebih lanjut mengenai ``django.newforms``, baca :doc:`newforms documentation </topics/forms/index>`.
zh_hans: 想了解更多关于 ``django.newforms`` 的信息，请阅读 :doc:`新表单 </topics/forms/index>`。

source: URLconf improvements
id: Perbaikan URLconf
zh_hans: URLconf 的改进

source: You can now use any callable as the callback in URLconfs (previously, only strings that referred to callables were allowed). This allows a much more natural use of URLconfs. For example, this URLconf::
id: Anda dapat sekarang menggunakan callable apapun sebagai callback dalam URLconf (sebelumnya, hanya deretan karakter yang mengacu pada dapat dipanggil yang diizinkan). Ini mengizinkan lebih banyak penggunaan alami dari URLconf. Sebagai contoh, ini URLconf::
zh_hans: 现在，你可以在 URLconfs 中使用任何可调用对象作为回调内容（以前，只允许使用引用可调用对象的字符串）。这使得 URLconfs 的使用更加自然。例如，这个 URLconf：

source: can now be rewritten as::
id: sekarang dapat ditulis kembali sebagai::
zh_hans: 可以被重写为：

source: One useful application of this can be seen when using decorators; this change allows you to apply decorators to views *in your URLconf*. Thus, you can make a generic view require login very easily::
id: Satu aplikasi berguna dari ini dapat dilihat ketika menggunakan decorator; perubahan ini mengizinkan anda memberlakukan decorator untuk melihat *dalam URLconf anda*. Dengan demikian, anda dapat membuat tampilan umum dibutuhkan masuk sangat mudah::
zh_hans: 一个有用的应用程序可以在使用装饰器时看到；这个变化允许你将装饰器应用到 *你的 URLconf* 中的视图。因此，你可以很容易地使一个通用的视图需要登录：

source: Note that both syntaxes (strings and callables) are valid, and will continue to be valid for the foreseeable future.
id: Catat bahwa kedua sintaksis (deretan karakter dan callable) adalah sah, dan akan tetap sah untuk masa akan datang.
zh_hans: 请注意，这两种语法（字符串和可调用对象）都是有效的，并且在可预见的未来将继续有效。

source: The test framework
id: Kerangka percobaan
zh_hans: 测试框架

source: Django now includes a test framework so you can start transmuting fear into boredom (with apologies to Kent Beck). You can write tests based on :mod:`doctest` or :mod:`unittest` and test your views with a simple test client.
id: Django sekarang menyertakan sebuah kerangka percobaan sehingga anda dapat memulai mengubah ketakutan dan kebosanan (dengan permintaan maaf kepada Kent Beck). Anda dapat menulis percobaan berdasaran pada :mod:`doctest` atau :mod:`unittest` dan ujikan tampilan anda dengan percobaan klien sederhana.
zh_hans: Django 现在包含了一个测试框架，所以你可以开始将恐惧转化为无聊（向 Kent Beck 道歉）。你可以基于 :mod:`doctest` 或 :mod:`unittest` 来编写测试，并用一个简单的测试客户端来测试你的视图。

source: There is also new support for "fixtures" -- initial data, stored in any of the supported :doc:`serialization formats </topics/serialization>`, that will be loaded into your database at the start of your tests. This makes testing with real data much easier.
id: Terdapat juga dukungan untuk "fixtures" -- data awal, disimpan pada :doc:`serialisasi bentuk </topics/serialization>` yang didukung, yang akan dimuat kedalam basisdata anda pada awal percobaan anda. Ini membuat percobaan dengan data sesungguhnya lebih mudah.
zh_hans: 还有对 “固定数据” 的新支持——初始数据，存储在任何支持的 :doc:`序列化格式 </topics/serialization>` 中，将在测试开始时加载到你的数据库中。这使得使用真实数据进行测试变得更加容易。

source: See :doc:`the testing documentation </topics/testing/index>` for the full details.
id: Lihat :doc:`dokumentasi percobaan </topics/testing/index>` untuk rincian penuh.
zh_hans: 详见 :doc:`测试文档 </topics/testing/index>`。

source: Improvements to the admin interface
id: Perbaikan terhadap antarmuka admin
zh_hans: 管理界面的改进

source: A small change, but a very nice one: dedicated views for adding and updating users have been added to the admin interface, so you no longer need to worry about working with hashed passwords in the admin.
id: Sebuah perubahan kecil, tetapi sangat bagus: tampilan ditujukan untuk menambahkan dan memperbaharui pengguna yang telah ditambahkan ke antarmuka admin, sehingga anda tidak lagi khawatir tentang bekerja dengan sandi diacak dalam admin.
zh_hans: 一个很小但是很不错的修改：在管理界面中增加了用于添加和更新用户的专用视图，所以你不再需要担心在管理中使用哈希密码的问题。

source: Thanks
id: Terima kasih
zh_hans: 谢谢

source: Since 0.95, a number of people have stepped forward and taken a major new role in Django's development. We'd like to thank these people for all their hard work:
id: Sejak 0,95, sejumlah orang telah melangkah maju dan mengambil peran baru utama dalam pengembangan Django. Kami ingin berterima kasih kepada orang-orang ini untuk semua kerja keras mereka:
zh_hans: 从版本 0.95 起，有许多人站了出来并在 Django 的项目发展中扮演了主要角色。我们想要向这些人的辛勤工作表达我们的谢意。

source: Russell Keith-Magee and Malcolm Tredinnick for their major code contributions. This release wouldn't have been possible without them.
id: Russell Keith-Magee dan Malcolm Tredinnick untuk sumbangan kode utama mereka. Terbitan ini tidak akan mungkin tanpa mereka.
zh_hans: Russell Keith-Magee 和 Malcolm Tredinnick 对代码的主要贡献。没有他们，这个版本是不可能的。

source: Our new release manager, James Bennett, for his work in getting out 0.95.1, 0.96, and (hopefully) future release.
id: Pengelola terbitan baru kami, James Bennett, untuk pekerjaannya dalam mengeluarkan 0.95.1, 0.96, dan (semoga) terbitan mendatang.
zh_hans: 我们的新发行版管理者 James Bennett，感谢他在发布 0.95.1、0.96 和（希望）未来版本方面所做的工作。

source: Our ticket managers Chris Beaven (aka SmileyChris), Simon Greenhill, Michael Radziej, and Gary Wilson. They agreed to take on the monumental task of wrangling our tickets into nicely cataloged submission. Figuring out what to work on is now about a million times easier; thanks again, guys.
id: Pengelola tiket kami Chris Beaven (dikenal sebagai SmileyChris), Simon Greenhill, Michael Radziej, dan Gary Wilson. Mereka setuju untuk mengambil tugas penting dari perselisihan tiket kami kedalam pengajuan katalog yang baik. Mencari tahu apa yang dikerjakan adalah sekarang tentang sejuta waktu lebih mudah; terima kasih kembali, teman-teman.
zh_hans: 我们的工单管理者 Chris Beaven（又名 SmileyChris）、Simon Greenhill、Michael Radziej 和 Gary Wilson。他们同意承担起将我们的工单整理成目录提交的艰巨任务。找出要做什么现在是一百万倍的容易；再次感谢，伙计们。

source: Everyone who submitted a bug report, patch or ticket comment. We can't possibly thank everyone by name -- over 200 developers submitted patches that went into 0.96 -- but everyone who's contributed to Django is listed in :source:`AUTHORS`.
zh_hans: 所有提交错误报告、补丁或工单评论的人。我们不可能对每个人的名字表示感谢——超过 200 个开发者提交了 0.96 版本的补丁——但每个为 Django 做出贡献的人都在 :source:`AUTHORS` 中列出。

source: Django 1.0 release notes
id: Catatan terbitan Django 1.0
zh_hans: Django 1.0 版本发行说明

source: Welcome to Django 1.0!
id: Selamat datang di Django 1.0!
zh_hans: 欢迎来到 Django 1.0 版本！

source: We've been looking forward to this moment for over three years, and it's finally here. Django 1.0 represents the largest milestone in Django's development to date: a web framework that a group of perfectionists can truly be proud of.
zh_hans: 我们期待这一刻已经三年多了，现在它终于来了。Django 1.0是Django开发过程中最大的一个里程碑:这是一个让一群完美主义者感到自豪的Web框架。

source: Django 1.0 represents over three years of community development as an Open Source project. Django's received contributions from hundreds of developers, been translated into fifty languages, and today is used by developers on every continent and in every kind of job.
id: Django 1.0 mewakili lebih 3 tahun dari pengembangan komunitas sebagai proyek Sumber Terbuka. Django menerima bantuan dari ribuan pengembang, telah diterjemahkan kedalam 50 bahasa, dan hari ini digunakan oleh pengembang pada setiap benua dan dalam setiap macam pekerjaan.
zh_hans: Django 1.0 作为一个开发了三年多的开源项目，得到了数百名开发人员的支持，并被翻译成50多种语言，现在仍广泛的被世界各地的开发人员用于各种工作中

source: An interesting historical note: when Django was first released in July 2005, the initial released version of Django came from an internal repository at revision number 8825. Django 1.0 represents revision 8961 of our public repository. It seems fitting that our 1.0 release comes at the moment where community contributions overtake those made privately.
id: Sebuah catatan riwayat menarik: ketika Django pertama kali terbit di Juli 2005, versi terbitan awal dari Django datang dari gudang internal pada angka perbaikan 8825. Django 1.0 mewakili perbaikan 8961 dari gudang umum kami. Dia kelihatannya sesuai bahwa terbitan 1.0 kami datang pada saat dimana bantuan komunitas mengambil alih yang dibuat secara pribadi.
zh_hans: 一个有趣的历史性注意事项：当Django于2005年7月第一次发布的时候，最初发布的Django版本来自互联网仓库，修订版本号是8825。Django 1.0 代表的是我们公开仓库里的修订版 8961。这看起来是符合我们当时1.0发布的到来，那个时候社区贡献者们都过度地私有化。

source: Stability and forwards-compatibility
id: Kestabilan dan kesesuaian kedepan
zh_hans: 稳定性和向前兼容性

source: The release of Django 1.0 comes with a promise of API stability and forwards-compatibility. In a nutshell, this means that code you develop against Django 1.0 will continue to work against 1.1 unchanged, and you should need to make only minor changes for any 1.X release.
id: Terbitan Django 1.0 dengan janji dari kestabilan API dan kesesuaian didepan. dalam kulit kacang, ini berarti bahwa kode anda kembangkan terhadap Django 1.0 akan berlanjut bekerja terhadap 1.1 tidak dirubah, dan anda harus butuh membuat hanya perubahan kecil untuk tiap terbitan 1.x.
zh_hans: 随着Django 1.0的发布，提供了承诺的API稳定性和向前兼容性。意思就是你针对Django 1.0所开发的代码能够用在1.1版本没有变化的地方，然后只需要你做少量的代码变更就可以适用 1.X 版本。

source: See the :doc:`API stability guide </misc/api-stability>` for full details.
id: Lihat :doc:`Panduan stabilitas API </misc/api-stability>` untuk rincian penuh.
zh_hans: 查阅 :doc:`API 稳定性指南 </misc/api-stability>` 了解详细信息

source: Django 1.0 has a number of backwards-incompatible changes from Django 0.96. If you have apps written against Django 0.96 that you need to port, see our detailed porting guide:
id: Django 1.0 mempunyai sejumlah perubahan bertentangan-kebelakang dari Django 0.96. Jika anda mempunyai aplikasi ditulis terhadap Django 0.96 yang anda butuh menautkannya, lihat panduan tautan rincian kami:
zh_hans: Django 1.0 有许多与 Django 0.96 不兼容的修改。如果您有Django 0.96 的应用需要移植，请查看我们的详细移植指南。

source: A complete list of backwards-incompatible changes can be found at https://code.djangoproject.com/wiki/BackwardsIncompatibleChanges.
id: Daftar lengkap dari perubahan bertentangan-kebelakang dapat ditemukan pada https://code.djangoproject.com/wiki/BackwardsIncompatibleChanges.
zh_hans: 查看不兼容的更改列表请移步：https://code.djangoproject.com/wiki/BackwardsIncompatibleChanges.

source: What's new in Django 1.0
id: Apa yang baru di Django 1.0
zh_hans: Django 1.0 新特性

source: A *lot*!
id: *banyak*!
zh_hans: 很多

source: Since Django 0.96, we've made over 4,000 code commits, fixed more than 2,000 bugs, and edited, added, or removed around 350,000 lines of code. We've also added 40,000 lines of new documentation, and greatly improved what was already there.
id: Sejak Django 0.96, kami telah membuat lebih 4,000 kode penyerahan, memperbaiki lebih dari 2,000 kesalahan, dan menyunting, menambahkan, atau memindahkan sekitar 350,000 baris kode. Kami juga telah menambahkan 40,000 baris dari dokumentasi baru, dan secara hebat meningkatkan apa yang telah ada disana.
zh_hans: 从 Django 0.96 开始，我们已经提交了 4000 多次的代码，修复了 2000 多个漏洞，并编辑了大约 350000 行的代码。我们还添加了 40000 行的新文档，极大的改进了现有的内容。

source: In fact, new documentation is one of our favorite features of Django 1.0, so we might as well start there. First, there's a new documentation site:
id: Sebenarnya, dokumentasi baru adalah satu dari fitur kesukaan kami dari Django 1.0, jadi kami mungkin juga mulai disana. Pertama, terdapat situs dokumentasi baru:
zh_hans: 事实上，新的文档就是Django 1.0中我们喜欢的特性之一，所以我们也会从新的文档作为起点。首先，新的文档网页是：

source: The documentation has been greatly improved, cleaned up, and generally made awesome. There's now dedicated search, indexes, and more.
id: Dokumentasi telah sangat ditingkatkan, dibersihkan, dan umumnya dibuat mengagumkan. Sekarang terdapat pencarian khusus, indeks, dan lebih.
zh_hans: 文档已经有了很大的提升，整洁，而且通常做的很好。目前专注在搜索、索引，以及等等功能上。

source: We can't possibly document everything that's new in 1.0, but the documentation will be your definitive guide. Anywhere you see something like:
id: Kami tidak dapat mungkin mendokumentasikan semuanya yang baru dalam 1.0, tetapi dokumentasi akan menjadi panduan pasti anda. Dimanapun anda melihat sesuatu seperti:
zh_hans: 在新的1.0版本中我们无法对每一件事做到文档化，但文档确实能作为你的开发指南。任何你所看到的，例如：

source: This feature is new in Django 1.0
id: Fitur ini baru di Django 1.0
zh_hans: 此功能是 Django 1.0 中的新功能

source: You'll know that you're looking at something new or changed.
id: Anda akan mengetahui bahwa anda mencari sesuatu baru atau berubah.
zh_hans: 你能知道你所要找的新内容，或者有哪些变化。

source: The other major highlights of Django 1.0 are:
id: Sorotan utama lain dari Django 1.0 adalah:
zh_hans: Django 1.0其它的主要亮点有：

source: Refactored admin application
zh_hans: 重构的管理应用程序

source: The Django administrative interface (``django.contrib.admin``) has been completely refactored; admin definitions are now completely decoupled from model definitions (no more ``class Admin`` declaration in models!), rewritten to use Django's new form-handling library (introduced in the 0.96 release as ``django.newforms``, and now available as simply ``django.forms``) and redesigned with extensibility and customization in mind. Full documentation for the admin application is available online in the official Django documentation:
id: Antarmuka administratif Django (``django.contrib.admin``) telah sepenuhnya di refaktor; antarmuka admin sekarang dipisahkan dari pengertian model (tidak ada lagi pernyataan ``class Admin`` dalam model!) penulisan kembali untuk menggunakan pustaka penanganan formulir baru Django (diperkenalkan di terbitan 0.96 sebagai ``django.newforms``, dan sekarang tersedia sebagai cukup ``django.forms``) dan merancang kembali dengan perpanjangan dan penyesuaian dalam pikiran. Dokumentasi penuh untuk aplikasi admin tersedia daring di dokumentasi Django resmi:
zh_hans: Django的管理接口 (``django.contrib.admin``) 已经完全重构了；管理员定义功能目前完全解构成模块定义形式 (不再是 ``class Admin`` 模块中的类形式！) ，重写代码来使用Django的新表单处理库 (曾在 0.96 版本中介绍成 ``django.newforms`` 内容，而此时直接可用成 ``django.forms`` 了) 以及重新设计成具有扩展能力和自定义能力。完整的管理员应用程序文档在官方Django文档网站上可以看到：

source: See the :doc:`admin reference </ref/contrib/admin/index>` for details
id: Lihat :doc:`acuan admin </ref/contrib/admin/index>` untuk rinci
zh_hans: 参考 :doc:`管理员指南 </ref/contrib/admin/index>` 了解细节

source: Improved Unicode handling
id: Penanganan perbaikan Unicode
zh_hans: 改进了 Unicode 的处理

source: Django's internals have been refactored to use Unicode throughout; this drastically simplifies the task of dealing with non-Western-European content and data in Django. Additionally, utility functions have been provided to ease interoperability with third-party libraries and systems which may or may not handle Unicode gracefully. Details are available in Django's Unicode-handling documentation.
id: Internal Django telah di refaktor untuk menggunakan Unicode di seluruhnya; ini secara drastis menyederhanakan tugas dari berhubungan dengan isi bukan Eropa Barat dan data di Django. Sebagai tambahan, fungsi kegunaan telah disediakan untuk memudahkan dapat digunakan dengan pustaka pihak ketiga dan sistem yang mungkin tidak menangani Unicode anggun. Rincian tersedia di dokumentasi penanganan Unicode Django.
zh_hans: Django内部机制已经重构成使用Unicode字符集；这回彻底让在Django中使用处理非西欧内容和数据的任务变得容易。另外，工具函数都提供成容易与第三方库协同工作的函数，甚至也能够与那些不能处理Unicode字符集的操作系统一起协同工作。细节都可以在Django的Unicode处理文档中找到可用的内容。

source: See :doc:`/ref/unicode`.
id: Lihat :doc:`/ref/unicode`.
zh_hans: 参见 :doc:`/ref/unicode`。

source: An improved ORM
id: ORM yang diperbaiki
zh_hans: 一项ORM提升

source: Django's object-relational mapper -- the component which provides the mapping between Django model classes and your database, and which mediates your database queries -- has been dramatically improved by a massive refactoring. For most users of Django this is backwards-compatible; the public-facing API for database querying underwent a few minor changes, but most of the updates took place in the ORM's internals. A guide to the changes, including backwards-incompatible modifications and mentions of new features opened up by this refactoring, is `available on the Django wiki`__.
id: Pemeta hubungan obyek Django -- komponen yang menyediakanpemetaan diantara kelas-kelas model Django dan basisdata anda, dan yang menengahi permintaan basisdata anda -- telah secara dramatis diperbaiki oleh refaktor besar-besaran. Untuk kebanyakan pengguna Django ini adakah kesesuaian kebelakangl API muka-umum untuk permintaan basisdata menjalani seikit kecil perubahan, tetapi kebanyakan dari perbaharuan mengambil tempat di internal ORM. Panduan pada perubahan berdasarkan refaktor ini, adalah `available on the Django wiki`__.
zh_hans: Django 的面向对象关系映射器——提供 Django 模型类与您的数据库之间的映射，并调解你的数据库查询的组件——通过大规模重构得到了显著改进。对于大多数使用 Django 的用户来说，这保持了向后兼容性；公开的数据库查询 API 经历了一些细微的变化，但大部分更新都发生在 ORM 的内部结构中。关于这些变化的指南，包括不向后兼容的修改和由这次重构开启的新功能提及，`在 Django 维基上可以获取`__ 。

source: Automatic escaping of template variables
id: Pelolosan otomatis dari variabel cetakan
zh_hans: 模版变量的自动转义

source: To provide improved security against cross-site scripting (XSS) vulnerabilities, Django's template system now automatically escapes the output of variables. This behavior is configurable, and allows both variables and larger template constructs to be marked as safe (requiring no escaping) or unsafe (requiring escaping). A full guide to this feature is in the documentation for the :ttag:`autoescape` tag.
id: Untuk menyediakan perbaikan keamanan terhadap kerentanan cross-site scripting (XSS), Sistem cetakan Django sekarang otomatis meloloskan keluaran dari variabel. Perilaku ini dapat dikonfigurasi, dan mengizinkan kedua variabel dan bangunan cetakan lebih besar untuk ditandai sebagai aman (tidak membutuhkan pelolosan) atau tidak aman (membutuhkan pelolosan). Panduan penuh pada fitur ini di dokumentasi untuk etiket :ttag:`autoescape`.
zh_hans: 要提供针对跨网页脚本（XSS）漏洞的安全提升，Django的模版系统现在会对变量结果进行自动转义。这种行为是可以进行配置的，而且既可以允许变量标记出安全，也可以对更大模版的建立标记成安全（即需要不执行转义）或标记成不安全（即需要执行转义）。自动转移这个特性的完整指南在文档中 :ttag:`autoescape` 标签位置上。

source: ``django.contrib.gis`` (GeoDjango)
zh_hans: ``django.contrib.gis`` (Django地理信息功能)

source: A project over a year in the making, this adds world-class GIS (`Geographic Information Systems`_) support to Django, in the form of a ``contrib`` application. Its documentation is currently being maintained externally, and will be merged into the main Django documentation shortly. Huge thanks go to Justin Bronn, Jeremy Dunck, Brett Hoerner and Travis Pinney for their efforts in creating and completing this feature.
id: Sebuah proyek lebih dari setahun dalam membuat, ini menambahkan dukungan GIS (`Geographic Information Systems`_) kelas dunia pada Django, dalam formulir dari sebuah aplikasi ``contrib``. Dokumentasinya saat ini sedang dirawat secara ekternal, dan akan digabungkan kedalam dokumentasi Django segera. Terima kasih sebesar-besarnya ditujukan ke Justin Bronn, Jeremy Dunck, Brett Hoerner dan Travis Pinney dalam membuat dan melengkapi fitur ini.
zh_hans: 一个为期超过一年以上的项目，就是世界级别类型的GIS (`地理信息系统`_) 支持了Django框架，是以一种 ``contrib`` 应用程序形式运作的。本身的文档目前由项目外团队进行维护，并且很快以后会合并到Django主文档中去。非常感谢 Justin Bronn, Jeremy Dunck, Brett Hoerner 和 Travis Pinney 为建立和完成本特性而做出的努力。

source: See :doc:`GeoDjango </ref/contrib/gis/index>` for details.
zh_hans: 详见 :doc:`GeoDjango </ref/contrib/gis/index>`。

source: Pluggable file storage
id: Penyimpanan berkas dapat ditanam
zh_hans: 移动文件存储
