Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Private :class:`~django.db.models.FileField` methods ``get_directory_name()`` and ``get_filename()`` are no longer called (and are now deprecated) which is a backwards incompatible change for users overriding those methods on custom fields. To adapt such code, override ``FileField.generate_filename()`` or :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` instead. It might be possible to use :attr:`~django.db.models.FileField.upload_to` also.
id: Metode :class:`~django.db.models.FileField` pribadi ``get_directory_name()`` dan ``get_filename()`` tidak lagi dipanggil (dan sekarang diusangkan) yaitu perubahan ketidaksesuaian kebelakang untuk pengguna mengutamakan metode-metode tersebut pada bidang penyesuaian. Untuk menyesuaikan kode seperti itu, timpa ``FileField.generate_filename()`` atau :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` sebagai gantinya. Itu dapat memungkinkan menggunakan :attr:`~django.db.models.FileField.upload_to` juga.
zh_hans: 私有的 :class:`~django.db.models.FileField` 方法 ``get_directory_name()`` 和 ``get_filename()`` 不再被调用（并且现在已被弃用），这对于在自定义字段上重写这些方法的用户来说是一个不兼容的变更。要适应这种代码，可以重写 ``FileField.generate_filename()`` 或 :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>`。也可能可以使用 :attr:`~django.db.models.FileField.upload_to`。

source: The subject of mail sent by ``AdminEmailHandler`` is no longer truncated at 989 characters. If you were counting on a limited length, truncate the subject yourself.
id: Subjek dari surel dikirim oleh ``AdminEmailHandler`` tidak lagi dipotong pada karakter 989. Jika anda menghitung pada batasan panjang, potong subjek anda sendiri.
zh_hans: 由 ``AdminEmailHandler`` 发送的邮件主题不再在 989 个字符处截断。如果你依赖于有限的长度，请自行截断主题。

source: Private expressions ``django.db.models.expressions.Date`` and ``DateTime`` are removed. The new :class:`~django.db.models.functions.Trunc` expressions provide the same functionality.
id: Pernyataan pribadi ``django.db.models.expressions.Date`` dan ``DateTime``dipindahkan. Pernyataan :class:`~django.db.models.functions.Trunc` baru menyediakan kegunaan sama.
zh_hans: 私有表达式 ``django.db.models.expressions.Date`` 和 ``DateTime`` 已被移除。新的 :class:`~django.db.models.functions.Trunc` 表达式提供了相同的功能。

source: The ``_base_manager`` and ``_default_manager`` attributes are removed from model instances. They remain accessible on the model class.
id: Atribut ``_base_manager`` dan ``_default_manager`` dipindahkan dari instance model. Mereka tetap dapat diakses pada kelas model.
zh_hans: 模型实例中的 ``_base_manager`` 和 ``_default_manager`` 属性已被移除。您仍然可以在模型类上访问它们。

source: Accessing a deleted field on a model instance, e.g. after ``del obj.field``, reloads the field's value instead of raising ``AttributeError``.
id: Mengakses bidang terhapus pada instance model, sebagai contoh setelah `del obj.field``, muat kembali nilai bidang daripada memunculkan ``AttributeError``.
zh_hans: 在模型实例上访问已删除的字段（例如，在执行 ``del obj.field`` 后）将重新加载字段的值，而不会引发 ``AttributeError``。

source: If you subclass ``AbstractBaseUser`` and override ``clean()``, be sure it calls ``super()``. :meth:`.AbstractBaseUser.normalize_username` is called in a new :meth:`.AbstractBaseUser.clean` method.
id: Jika anda subkelas ``AbstractBaseUser`` dan menimpa ``clean()``, pastikan itu memanggil ``super()``. :meth:`.AbstractBaseUser.normalize_username` dipanggil di metode :meth:`.AbstractBaseUser.clean` baru.
zh_hans: 如果您子类化了 ``AbstractBaseUser`` 并覆盖了 ``clean()`` 方法，请确保在其中调用 ``super()``。现在在新的 :meth:`.AbstractBaseUser.clean` 方法中调用了 :meth:`.AbstractBaseUser.normalize_username`。

source: Private API ``django.forms.models.model_to_dict()`` returns a queryset rather than a list of primary keys for ``ManyToManyField``\s.
id: API pribadi ``django.forms.models.model_to_dict()``mengembalikan sebuah queryset daripada sebuah daftar dari primary key untuk ``ManyToManyField``.
zh_hans: 私有 API ``django.forms.models.model_to_dict()`` 现在返回一个查询集而不是 ``ManyToManyField`` 的主键列表。

source: If ``django.contrib.staticfiles`` is installed, the :ttag:`static` template tag uses the ``staticfiles`` storage to construct the URL rather than simply joining the value with ``STATIC_ROOT``. The new approach encodes the URL, which could be backwards-incompatible in cases such as including a fragment in a path, e.g. ``{% static 'img.svg#fragment' %}``, since the ``#`` is encoded as ``%23``. To adapt, move the fragment outside the template tag: ``{% static 'img.svg' %}#fragment``.
id: Jika ``django.contrib.staticfiles`` dipasang, etiket cetakan :ttag:`static` menggunakan penyimpanan ``staticfiles`` untuk membangun URL daripada cukup menggabungkan nilai dengan ``STATIC_ROOT``. Pendekatan baru menyandi URL, yang mungkin ketidaksesuaian-kebelakang di kasus seperti menyertakan sebuah fragmen dalam sebuah jalur, sebagai contoh ``{% static 'img.svg#fragment' %}``, sejak ``#`` disandikan sebagai ``%23``. Untuk menyesuaikan, pindah fragmen diluar etiket cetakan: ``{% static 'img.svg' %}#fragment``.
zh_hans: 如果安装了 ``django.contrib.staticfiles``，那么 :ttag:`static` 模板标签将使用 ``staticfiles`` 存储来构建 URL，而不仅仅是与 ``STATIC_ROOT`` 连接。这种新方法对URL进行了编码，可能在包含路径中的片段的情况下存在向后不兼容性，例如 ``{% static 'img.svg#fragment' %}``，因为 ``#`` 被编码为 ``%23``。要进行适应，将片段移到模板标签之外：``{% static 'img.svg' %}#fragment``。

source: When ``USE_L10N`` is ``True``, localization is now applied for the :tfilter:`date` and :tfilter:`time` filters when no format string is specified. The ``DATE_FORMAT`` and ``TIME_FORMAT`` specifiers from the active locale are used instead of the settings of the same name.
zh_hans: 当 ``USE_L10N`` 为 ``True`` 时，如果没有指定格式字符串，则 :tfilter:`date` 和 :tfilter:`time` 过滤器现在会应用本地化。它们将使用活动区域设置中的 ``DATE_FORMAT`` 和 ``TIME_FORMAT`` 指示符，而不是同名的设置。

source: Features deprecated in 1.10
id: Fitur-fitur diusangkan di 1.10
zh_hans: 在 1.10 中被废弃的功能

source: Direct assignment to a reverse foreign key or many-to-many relation
id: Penugasan langsung untuk membalikkan foreign key atau hubungan many-to-many.
zh_hans: 直接分配给反向外键或多对多关系

source: Instead of assigning related objects using direct assignment:
zh_hans: 不要使用直接分配来分配相关对象：

source: Use the :meth:`~django.db.models.fields.related.RelatedManager.set` method added in Django 1.9:
zh_hans: 使用 Django 1.9 中添加的 :meth:`~django.db.models.fields.related.RelatedManager.set` 方法：

source: This prevents confusion about an assignment resulting in an implicit save.
id: Ini mencegah kebingungan tentang sebuah penugasan menghasilkan sebuah tersirat tersimpan.
zh_hans: 这可以避免因隐式保存导致的分配混淆。

source: Non-timezone-aware :class:`~django.core.files.storage.Storage` API
id: API :class:`~django.core.files.storage.Storage` bukan-sadar-zona waktu
zh_hans: 非时区感知的 :class:`~django.core.files.storage.Storage` API

source: The old, non-timezone-aware methods ``accessed_time()``, ``created_time()``, and ``modified_time()`` are deprecated in favor of the new ``get_*_time()`` methods.
id: Yang lama, metode bukan-sadar-zona waktu ``accessed_time()``, ``created_time()``, dan ``modified_time()`` diusangkan dalam mendukung dari metode ``get_*_time()`` baru.
zh_hans: 旧的、非时区感知的方法 ``accessed_time()``, ``created_time()``, 和 ``modified_time()`` 已被弃用，推荐使用新的 ``get_*_time()`` 方法。

source: Third-party storage backends should implement the new methods and mark the old ones as deprecated. Until then, the new ``get_*_time()`` methods on the base :class:`~django.core.files.storage.Storage` class convert ``datetime``\s from the old methods as required and emit a deprecation warning as they do so.
id: Backend penyimpanan pihak-ketiga harus menerapkan metode baru dan tandai satu yang lama sebagai diusangkan. Sampai kemudian, cara ``get_*_time()`` baru pada kelas :class:`~django.core.files.storage.Storage` dasar merubah ``datetime`` dari metode lama sebagai diwajibkan dan mengeluarkan peringatan pengusangan seperti mereka lakukan.
zh_hans: 第三方存储后端应该实现新的方法并将旧的方法标记为弃用。在此之前，基础的 :class:`~django.core.files.storage.Storage` 类上的新的 ``get_*_time()`` 方法将根据需要将来自旧方法的 ``datetime`` 转换并在这样做时发出弃用警告。

source: Third-party storage backends may retain the old methods as long as they wish to support earlier versions of Django.
id: Backend penyimpanan pihak ketiga mungkin mempertahankan metode lama selama mereka berharap mendukung versi sebelumnya dari Django.
zh_hans: 只要第三方存储后端希望支持早期版本的 Django，它们就可以保留旧方法。

source: The ``get_srid()`` and ``set_srid()`` methods of :class:`~django.contrib.gis.geos.GEOSGeometry` are deprecated in favor of the :attr:`~django.contrib.gis.geos.GEOSGeometry.srid` property.
id: Metode ``get_srid()`` dan ``set_srid()`` dari :class:`~django.contrib.gis.geos.GEOSGeometry` diusangkan dalam mendukung dari milik :attr:`~django.contrib.gis.geos.GEOSGeometry.srid`.
zh_hans: :class:`~django.contrib.gis.geos.GEOSGeometry` 的 ``get_srid()`` 和 ``set_srid()`` 方法已被弃用，推荐使用 :attr:`~django.contrib.gis.geos.GEOSGeometry.srid` 属性。

source: The ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, and ``set_z()`` methods of :class:`~django.contrib.gis.geos.Point` are deprecated in favor of the ``x``, ``y``, and ``z`` properties.
id: Metode ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, dan ``set_z()`` dari :class:`~django.contrib.gis.geos.Point` diusangkan dalam mendukung dari milik ``x``, ``y``, dan ``z``.
zh_hans: :class:`~django.contrib.gis.geos.Point` 的 ``get_x()``, ``set_x()``, ``get_y()``, ``set_y()``, ``get_z()``, 和 ``set_z()`` 方法已被弃用，推荐使用 ``x``, ``y``, 和 ``z`` 属性。

source: The ``get_coords()`` and ``set_coords()`` methods of :class:`~django.contrib.gis.geos.Point` are deprecated in favor of the ``tuple`` property.
id: Metode ``get_coords()`` dan ``set_coords()`` dari :class:`~django.contrib.gis.geos.Point` diusangkan dalam mendukung dari milik ``tuple``.
zh_hans: :class:`~django.contrib.gis.geos.Point` 的 ``get_coords()`` 和 ``set_coords()`` 方法已被弃用，推荐使用 ``tuple`` 属性。

source: The ``cascaded_union`` property of :class:`~django.contrib.gis.geos.MultiPolygon` is deprecated in favor of the :attr:`~django.contrib.gis.geos.GEOSGeometry.unary_union` property.
id: ``cascaded_union`` milik dari :class:`~django.contrib.gis.geos.MultiPolygon` diusangkan dalam mendukung dari milik :attr:`~django.contrib.gis.geos.GEOSGeometry.unary_union`.
zh_hans: :class:`~django.contrib.gis.geos.MultiPolygon` 的 ``cascaded_union`` 属性已被弃用，推荐使用 :attr:`~django.contrib.gis.geos.GEOSGeometry.unary_union` 属性。

source: The ``django.contrib.gis.utils.precision_wkt()`` function is deprecated in favor of :class:`~django.contrib.gis.geos.WKTWriter`.
id: Fungsi ``django.contrib.gis.utils.precision_wkt()`` diusangkan dalam mendukung dari :class:`~django.contrib.gis.geos.WKTWriter`.
zh_hans: ``django.contrib.gis.utils.precision_wkt()`` 函数已被弃用，推荐使用 :class:`~django.contrib.gis.geos.WKTWriter`。

source: ``CommaSeparatedIntegerField`` model field
id: Bidang model ``CommaSeparatedIntegerField``
zh_hans: ``CommaSeparatedIntegerField`` 模型字段

source: ``CommaSeparatedIntegerField`` is deprecated in favor of :class:`~django.db.models.CharField` with the :func:`~django.core.validators.validate_comma_separated_integer_list` validator::
id: ``CommaSeparatedIntegerField`` diusangkan dalam mendukung :class:`~django.db.models.CharField` dengan pengesah :func:`~django.core.validators.validate_comma_separated_integer_list`::
zh_hans: ``CommaSeparatedIntegerField`` 已被弃用，推荐使用 :class:`~django.db.models.CharField` 并配合 :func:`~django.core.validators.validate_comma_separated_integer_list` 验证器使用：

source: If you're using Oracle, ``CharField`` uses a different database field type (``NVARCHAR2``) than ``CommaSeparatedIntegerField`` (``VARCHAR2``). Depending on your database settings, this might imply a different encoding, and thus a different length (in bytes) for the same contents. If your stored values are longer than the 4000 byte limit of ``NVARCHAR2``, you should use ``TextField`` (``NCLOB``) instead. In this case, if you have any queries that group by the field (e.g. annotating the model with an aggregation or using ``distinct()``) you'll need to change them (to defer the field).
id: Jika anda menggunakan Oracle, ``CharField`` menggunakan jenis bidang basisdata berbeda (``NVARCHAR2``) daripada ``CommaSeparatedIntegerField`` (``VARCHAR2``). Tergantung pada pengaturan basisdata anda, ini mungkin berarti pengkodean berbeda, dan demikian panjang berbeda (dalam byte) untuk isi sama. Jika anda menyimpan nilai lebih panjang dari batasan 4000 byte dari ``NVARCHAR2``, anda harus menggunakan ``TextField`` (``NCLOB``) sebagai gantinya. Dalam kasus ini, jika anda mempunyai permintaan apapun yang dikelompokkan berdasarkan bidang (sebagai contoh keterangan model dengan kumpulan atau menggunakan ``distinct()``) anda akan butuh merubah mereka (untuk menunda bidang).
zh_hans: 如果您使用的是 Oracle 数据库，``CharField`` 使用不同的数据库字段类型（``NVARCHAR2``）而不是 ``CommaSeparatedIntegerField`` （``VARCHAR2``）。根据您的数据库设置，这可能意味着相同内容的不同编码，从而导致相同内容的不同字节长度。如果您存储的值长于 ``NVARCHAR2`` 的 4000 字节限制，您应该改用 ``TextField`` （``NCLOB``）。在这种情况下，如果您有任何按字段分组的查询（例如，使用聚合注释模型或使用 ``distinct()``），您需要更改它们（以延迟字段）。

source: Using a model name as a query lookup when ``default_related_name`` is set
id: Menggunakan sebuah nama model sebagai permintaan pencarian ketika ``default_related_name`` disetel
zh_hans: 当设置了 ``default_related_name`` 时，可以使用模型名称作为查询查找。

source: Assume the following models::
id: Menganggap model berikut:
zh_hans: 假设以下模型：

source: In older versions, :attr:`~django.db.models.Options.default_related_name` couldn't be used as a query lookup. This is fixed and support for the old lookup name is deprecated. For example, since ``default_related_name`` is set in model ``Bar``, instead of using the model name ``bar`` as the lookup:
zh_hans: 在较旧的版本中，不能将 :attr:`~django.db.models.Options.default_related_name` 用作查询查找。这已经得到修复，并且不再支持旧的查找名称。例如，由于在模型 ``Bar`` 中设置了 ``default_related_name``，所以不再使用模型名称 ``bar`` 作为查找：

source: use the default_related_name ``bars``:
zh_hans: 使用 ``default_related_name`` 中的 ``bars``：

source: ``__search`` query lookup
id: ``__search`` permintaan pencarian
zh_hans: ``__search`` 查询查找

source: The ``search`` lookup, which supports MySQL only and is extremely limited in features, is deprecated. Replace it with a custom lookup::
id: Pencarian ``search``, yang mendukung hanya MySQL dan sangat terbataas dalam fitur, diusangkan. Ganti itu dengan pencarian penyesuaian::
zh_hans: ``search`` 查询查找已被弃用，它仅支持 MySQL，并且功能非常有限。请将其替换为自定义查询查找：

source: Using ``User.is_authenticated()`` and ``User.is_anonymous()`` as methods
id: Menggunakan ``User.is_authenticated()`` dan ``User.is_anonymous()`` sebagai metode.
zh_hans: 使用 ``User.is_authenticated()`` 和 ``User.is_anonymous()`` 作为方法。

source: The ``is_authenticated()`` and ``is_anonymous()`` methods of :class:`~django.contrib.auth.models.AbstractBaseUser` and :class:`~django.contrib.auth.models.AnonymousUser` classes are now properties. They will still work as methods until Django 2.0, but all usage in Django now uses attribute access.
id: Metode ``is_authenticated()`` dan ``is_anonymous()`` dari kelas-kelas :class:`~django.contrib.auth.models.AbstractBaseUser` dan :class:`~django.contrib.auth.models.AnonymousUser` sekarang milik. Mereka akan masih bekerja sebagai cara sampai Django 2.0, tetapi semua penggunaan di Django sekarang menggunakan akses atribut.
zh_hans: :class:`~django.contrib.auth.models.AbstractBaseUser` 和 :class:`~django.contrib.auth.models.AnonymousUser` 类的 ``is_authenticated()`` 和 ``is_anonymous()`` 方法现在已经变成属性。它们在 Django 2.0 之前仍然作为方法使用，但在 Django 中的所有用法现在都使用属性访问。

source: For example, if you use :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` and want to know whether the user is currently logged-in you would use::
id: Sebagai contoh, jika anda menggunakan :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` dan ingin mengetahui apakah pengguna saat ini masuk anda akan menggunakan::
zh_hans: 例如，如果您使用 :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` 并想知道用户当前是否已登录，您可以使用以下方式：

source: instead of ``request.user.is_authenticated()``.
id: daripada ``request.user.is_authenticated()``.
zh_hans: 而不是 ``request.user.is_authenticated()``。

source: This change avoids accidental information leakage if you forget to call the method, e.g.::
id: Perubahan ini menghindari kecelakaan kebocoran informasi jika anda lupa memanggil metode, sebagai contoh::
zh_hans: 此更改可以避免在您忘记调用方法时意外泄露信息，例如：

source: If you override these methods in a custom user model, you must change them to properties or attributes.
id: Jika anda menimpa metode ini di penyesuaian model pengguna, anda harus merubah mereka menjadi milik atau atribut.
zh_hans: 如果你在自定义用户模型中重写了这些方法，你必须将它们更改为属性或特性。

source: Django uses a ``CallableBool`` object to allow these attributes to work as both a property and a method. Thus, until the deprecation period ends, you cannot compare these properties using the ``is`` operator. That is, the following won't work::
id: Django menggunakan sebuah obyek ``CallableBool`` untuk mengizinkan atribut ini bekerja sebagai kedua milik dan metode. Demikian, hingga periode pengusangan berakhir, dan anda tidak dapat membandingkan milik ini menggukan penghubung ``is``. Dengan kata lain, berikut tidak akan bekerja::
zh_hans: Django 使用一个 ``CallableBool`` 对象，以使这些属性同时可以作为属性和方法工作。因此，在弃用期结束之前，您不能使用 ``is`` 运算符比较这些属性。也就是说，以下操作不起作用：

source: Custom manager classes available through ``prefetch_related`` must define a ``_apply_rel_filters()`` method
id: Kelas-kelas penyesuaian pengelola tersedia melalui ``prefetch_related`` harus menentukan sebuah metode ``_apply_rel_filters()``.
zh_hans: 通过 ``prefetch_related`` 可用的自定义管理器类必须定义一个 ``_apply_rel_filters()`` 方法。

source: If you defined a custom manager class available through :meth:`~django.db.models.query.QuerySet.prefetch_related` you must make sure it defines a ``_apply_rel_filters()`` method.
id: Jika anda menentukan penyesuaian kelas pengelola tersedia melalui :meth:`~django.db.models.query.QuerySet.prefetch_related` anda harus memastikan itu menentukan sebuah metode ``_apply_rel_filters()``.
zh_hans: 如果您定义了一个通过 :meth:`~django.db.models.query.QuerySet.prefetch_related` 可用的自定义管理器类，您必须确保它定义了一个 ``_apply_rel_filters()`` 方法。

source: This method must accept a :class:`~django.db.models.query.QuerySet` instance as its single argument and return a filtered version of the queryset for the model instance the manager is bound to.
id: Metode ini harus menerima sebuah instance :class:`~django.db.models.query.QuerySet` sebagai arumen tunggalnya dan mengembalikan versi tersaring dari queryset untuk instance model terikat ke pengelola.
zh_hans: 这个方法必须接受一个 :class:`~django.db.models.query.QuerySet` 实例作为其唯一参数，并返回与管理器绑定的模型实例的经过筛选的查询集的版本。

source: The "escape" half of ``django.utils.safestring``
id: "escape" setengah dari ``django.utils.safestring``
zh_hans: ``django.utils.safestring`` 的 "escape" 部分

source: The ``mark_for_escaping()`` function and the classes it uses: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, and ``EscapeUnicode`` are deprecated.
id: Fungsi ``mark_for_escaping()`` dan kelas-kelas dia gunakan: ``EscapeData``, ``EscapeBytes``, ``EscapeText``, ``EscapeString``, dan ``EscapeUnicode`` diusangkan.
zh_hans: ``mark_for_escaping()`` 函数以及它使用的类：``EscapeData``、``EscapeBytes``、``EscapeText``、``EscapeString`` 和 ``EscapeUnicode`` 已被弃用。

source: As a result, the "lazy" behavior of the ``escape`` filter (where it would always be applied as the last filter no matter where in the filter chain it appeared) is deprecated. The filter will change to immediately apply :func:`~django.utils.html.conditional_escape` in Django 2.0.
id: Sebagai hasil, perilaku "lazy" dari penyaring ``escape`` (dimana dia akan selalu diberlakukan sebagai penyaring terakhir tidak penting dimana di rantai penyaring dia muncul) diusangkan. Penyaring akan berubah dengan segera memberlakukan :func:`~django.utils.html.conditional_escape` di Django 2.0.
zh_hans: 因此，``escape`` 过滤器的 "懒惰" 行为（无论在过滤器链的哪个位置，它始终作为最后一个过滤器应用）已被弃用。在 Django 2.0 中，该过滤器将立即应用 :func:`~django.utils.html.conditional_escape`。

source: ``Manager.use_for_related_fields`` and inheritance changes
id: Perubahan ``Manager.use_for_related_fields`` dan warisan
zh_hans: ``Manager.use_for_related_fields`` 和继承方面的变化

source: ``Manager.use_for_related_fields`` is deprecated in favor of setting :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>` on the model.
id: ``Manager.use_for_related_fields`` diusangkan dalam mendukung dari pengaturan :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>` pada model.
zh_hans: ``Manager.use_for_related_fields`` 已被弃用，推荐在模型上设置 :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>`。

source: Model ``Manager`` inheritance will follow MRO inheritance rules in Django 2.0, changing the current behavior where managers defined on non-abstract base classes aren't inherited by child classes. A deprecating warning with instructions on how to adapt your code is raised if you have any affected managers. You'll either redeclare a manager from an abstract model on the child class to override the manager from the concrete model, or you'll set the model's ``Meta.manager_inheritance_from_future=True`` option to opt-in to the new inheritance behavior.
id: Warisan model ``Manager`` akan mengikuti aturan warisan MRO di Django 2.0, merubah perilaku saat ini dimana pengelola ditentukan pada kelas-kelas dasar bukan-abstrak tidak diwariskan oleh kelas-kelas anak. Sebuah peringatan pengusangan dengan petunjuk pada bagaimana menyesuaikan kode anda dimunculkan jika anda mempunyai apapun pengelola terpengaruhi. Anda akan antara menyatakan kembali seorang pengelola dari sebuah model abstrak pada kelas anak untuk menimpa pengelola dari model berwujud, atau anda akan menyetel pilihan ``Meta.manager_inheritance_from_future=True`` model untuk dimasukkan ke perilaku warisan baru.
zh_hans: 在 Django 2.0 中，模型 ``Manager`` 的继承将遵循 MRO 继承规则，改变了当前的行为，其中在非抽象基类上定义的管理器不会被子类继承。如果您有任何受影响的管理器，将会引发一个带有关于如何调整代码的弃用警告。您可以在子类上重新声明来自抽象模型的管理器，以覆盖来自具体模型的管理器，或者您可以设置模型的 ``Meta.manager_inheritance_from_future=True`` 选项，以选择新的继承行为。

source: During the deprecation period, ``use_for_related_fields`` will be honored and raise a warning, even if a ``base_manager_name`` is set. This allows third-party code to preserve legacy behavior while transitioning to the new API. The warning can be silenced by setting ``silence_use_for_related_fields_deprecation=True`` on the manager.
id: Selama masa pengusangan, ``use_for_related_fields`` akan dihormati dan menampilkan sebuah peringatan, bahkan jika sebuah ``base_manager_name`` disetel. Ini mengizinkan kode pihak-ketiga untuk menjaga perilaku warisan selagi transisi ke API baru. Peringatan dapat didiamkan dengan mengatur ``silence_use_for_related_fields_deprecation=True`` pada pengelola.
zh_hans: 在弃用期间，即使设置了 ``base_manager_name``，也会尊重 ``use_for_related_fields`` 并引发警告。这允许第三方代码在过渡到新的 API 时保留传统行为。可以通过在管理器上设置 ``silence_use_for_related_fields_deprecation=True`` 来消除警告。

source: The ``makemigrations --exit`` option is deprecated in favor of the :option:`makemigrations --check` option.
id: Pilihan ``makemigrations --exit`` diusangkan dalam mendukung dari pilihan :option:`makemigrations --check`.
zh_hans: ``makemigrations --exit`` 选项已被弃用，推荐使用 :option:`makemigrations --check` 选项。

source: ``django.utils.functional.allow_lazy()`` is deprecated in favor of the new :func:`~django.utils.functional.keep_lazy` function which can be used with a more natural decorator syntax.
id: ``django.utils.functional.allow_lazy()`` diusangkan dalam mendukung dari fungsi :func:`~django.utils.functional.keep_lazy` baru yang dapat digunakan dengan sintaksis penghias alami.
zh_hans: ``django.utils.functional.allow_lazy()`` 已被弃用，推荐使用新的 :func:`~django.utils.functional.keep_lazy` 函数，它可以使用更自然的装饰器语法。
