Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 1.8 :commit:`(patch) <6118ab7d0676f0d622278e5be215f14fb5410b6a>`
zh_hans: Django 1.8 :commit:`（补丁） <6118ab7d0676f0d622278e5be215f14fb5410b6a>`

source: July 18, 2016 - :cve:`2016-6186`
id: 18 Juli 2016 - :cve:`2016-6186`
zh_hans: 2016 年 7 月 18 日 - :cve:`2016-6186`

source: XSS in admin's add/change related popup. `Full description <https://www.djangoproject.com/weblog/2016/jul/18/security-releases/>`__
id: XSS dalam popup terkait tambah/rubah admin. `Full description <https://www.djangoproject.com/weblog/2016/jul/18/security-releases/>`__
zh_hans: 管理员的添加／更改相关弹窗中的 XSS。`完整说明 <https://www.djangoproject.com/weblog/2016/jul/18/security-releases/>`__

source: Django 1.9 :commit:`(patch) <d03bf6fe4e9bf5b07de62c1a271c4b41a7d3d158>`
zh_hans: Django 1.9 :commit:`（补丁） <d03bf6fe4e9bf5b07de62c1a271c4b41a7d3d158>`

source: Django 1.8 :commit:`(patch) <f68e5a99164867ab0e071a936470958ed867479d>`
zh_hans: Django 1.8 :commit:`（补丁） <f68e5a99164867ab0e071a936470958ed867479d>`

source: March 1, 2016 - :cve:`2016-2513`
id: 1 Maret 2016 - :cve:`2016-2513`
zh_hans: 2016 年 3 月 1 日 - :cve:`2016-2513`

source: User enumeration through timing difference on password hasher work factor upgrade. `Full description <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__
id: Pendaftaran pengguna melalui perbedaan pewaktu pada peningkatan faktor pekerjaan pengacak sandi. `Full description <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__
zh_hans: 通过时间差对密码哈希工作因子升级进行用户枚举。`完整说明 <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__

source: Django 1.9 :commit:`(patch) <af7d09b0c5c6ab68e629fd9baf736f9dd203b18e>`
zh_hans: Django 1.9 :commit:`（补丁） <af7d09b0c5c6ab68e629fd9baf736f9dd203b18e>`

source: Django 1.8 :commit:`(patch) <f4e6e02f7713a6924d16540be279909ff4091eb6>`
zh_hans: Django 1.8 :commit:`（补丁） <f4e6e02f7713a6924d16540be279909ff4091eb6>`

source: March 1, 2016 - :cve:`2016-2512`
id: 1 Maret 2016 - :cve:`2016-2512`
zh_hans: 2016 年 3 月 1 日 - :cve:`2016-2512`

source: Malicious redirect and possible XSS attack via user-supplied redirect URLs containing basic auth. `Full description <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__
id: Pengalihan dan kemungkinsn serangan XSS jelek melalui URL pengalihan diberikan-pengguna mengandung autentifikasi dasar. `Full description <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__
zh_hans: 通过用户提供的包含基本认证的重定向 URL 进行恶意重定向和可能的 XSS 攻击。`完整说明 <https://www.djangoproject.com/weblog/2016/mar/01/security-releases/>`__

source: Django 1.9 :commit:`(patch) <fc6d147a63f89795dbcdecb0559256470fff4380>`
zh_hans: Django 1.9 :commit:`（补丁） <fc6d147a63f89795dbcdecb0559256470fff4380>`

source: Django 1.8 :commit:`(patch) <382ab137312961ad62feb8109d70a5a581fe8350>`
zh_hans: Django 1.8 :commit:`（补丁） <382ab137312961ad62feb8109d70a5a581fe8350>`

source: February 1, 2016 - :cve:`2016-2048`
id: 1 Februari 2016 - :cve:`2016-2048`
zh_hans: 2016 年 2 月 1 日 - :cve:`2016-2048`

source: User with "change" but not "add" permission can create objects for ``ModelAdmin``’s with ``save_as=True``. `Full description <https://www.djangoproject.com/weblog/2016/feb/01/releases-192-and-189/>`__
zh_hans: 拥有 “变更” 而非 “添加” 权限的用户可以用 “保存为 True” 为 ``ModelAdmin`` 创建对象。`完整说明 <https://www.djangoproject.com/weblog/2016/feb/01/releases-192-and-189/>`__

source: Django 1.9 :commit:`(patch) <adbca5e4db42542575734b8e5d26961c8ada7265>`
zh_hans: Django 1.9 :commit:`（补丁） <adbca5e4db42542575734b8e5d26961c8ada7265>`

source: November 24, 2015 - :cve:`2015-8213`
id: 24 November 2015 - :cve:`2015-8213`
zh_hans: 2015 年 11 月 24 日 - :cve:`2015-8213`

source: Settings leak possibility in ``date`` template filter. `Full description <https://www.djangoproject.com/weblog/2015/nov/24/security-releases-issued/>`__
id: Menyetel kemungkinan bocor di penyaring cetakan ``date``. `Full description <https://www.djangoproject.com/weblog/2015/nov/24/security-releases-issued/>`__
zh_hans: ``date`` 模板过滤器存在设置泄漏可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/nov/24/security-releases-issued/>`__

source: Django 1.8 :commit:`(patch) <9f83fc2f66f5a0bac7c291aec55df66050bb6991>`
zh_hans: Django 1.8 :commit:`（补丁） <9f83fc2f66f5a0bac7c291aec55df66050bb6991>`

source: Django 1.7 :commit:`(patch) <8a01c6b53169ee079cb21ac5919fdafcc8c5e172>`
zh_hans: Django 1.7 :commit:`（补丁） <8a01c6b53169ee079cb21ac5919fdafcc8c5e172>`

source: August 18, 2015 - :cve:`2015-5963` / :cve:`2015-5964`
id: 18 Agustus 2015 - :cve:`2015-5963` / :cve:`2015-5964`
zh_hans: 2015 年 8 月 18 日 - :cve:`2015-5963` / :cve:`2015-5964`

source: Denial-of-service possibility in ``logout()`` view by filling session store. `Full description <https://www.djangoproject.com/weblog/2015/aug/18/security-releases/>`__
id: Kemungkinan denial-of-service di tampilan ``logout()`` dengan mengisi toko sesi. `Full description <https://www.djangoproject.com/weblog/2015/aug/18/security-releases/>`__
zh_hans: 通过填充会话存储，存在 ``logout()`` 视图的拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/aug/18/security-releases/>`__

source: Django 1.8 :commit:`(patch) <2eb86b01d7b59be06076f6179a454d0fd0afaff6>`
zh_hans: Django 1.8 :commit:`（补丁） <2eb86b01d7b59be06076f6179a454d0fd0afaff6>`

source: Django 1.7 :commit:`(patch) <2f5485346ee6f84b4e52068c04e043092daf55f7>`
zh_hans: Django 1.7 :commit:`（补丁） <2f5485346ee6f84b4e52068c04e043092daf55f7>`

source: Django 1.4 :commit:`(patch) <575f59f9bc7c59a5e41a081d1f5f55fc859c5012>`
zh_hans: Django 1.4 :commit:`（补丁） <575f59f9bc7c59a5e41a081d1f5f55fc859c5012>`

source: July 8, 2015 - :cve:`2015-5145`
id: 8 Juli 2015 - :cve:`2015-5145`
zh_hans: 2015 年 7 月 8 日 - :cve:`2015-5145`

source: Denial-of-service possibility in URL validation. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
id: Kemungkinan denial-of-service di pengesahan URL. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
zh_hans: URL 验证中存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__

source: Django 1.8 :commit:`(patch) <8f9a4d3a2bc42f14bb437defd30c7315adbff22c>`
zh_hans: Django 1.8 :commit:`（补丁） <8f9a4d3a2bc42f14bb437defd30c7315adbff22c>`

source: July 8, 2015 - :cve:`2015-5144`
id: 8 Juli 2015 - :cve:`2015-5144`
zh_hans: 2015 年 7 月 8 日 - :cve:`2015-5144`

source: Header injection possibility since validators accept newlines in input. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
id: Kemungkinan suntikan kepala sejak pengesah menerima baris baru di masukan. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
zh_hans: 由于验证器接受输入中的换行符，存在标头注入可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__

source: Django 1.8 :commit:`(patch) <574dd5e0b0fbb877ae5827b1603d298edc9bb2a0>`
zh_hans: Django 1.8 :commit:`（补丁） <574dd5e0b0fbb877ae5827b1603d298edc9bb2a0>`

source: Django 1.7 :commit:`(patch) <ae49b4d994656bc037513dcd064cb9ce5bb85649>`
zh_hans: Django 1.7 :commit:`（补丁） <ae49b4d994656bc037513dcd064cb9ce5bb85649>`

source: Django 1.4 :commit:`(patch) <1ba1cdce7d58e6740fe51955d945b56ae51d072a>`
zh_hans: Django 1.4 :commit:`（补丁） <1ba1cdce7d58e6740fe51955d945b56ae51d072a>`

source: July 8, 2015 - :cve:`2015-5143`
id: 8 Juli 2015 - :cve:`2015-5143`
zh_hans: 2015 年 7 月 8 日 - :cve:`2015-5143`

source: Denial-of-service possibility by filling session store. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
id: Kemungkinan denial-of-service dengan mengisi toko sesi. `Full description <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__
zh_hans: 通过填充会话存储存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jul/08/security-releases/>`__

source: Django 1.8 :commit:`(patch) <66d12d1ababa8f062857ee5eb43276493720bf16>`
zh_hans: Django 1.8 :commit:`（补丁） <66d12d1ababa8f062857ee5eb43276493720bf16>`

source: Django 1.7 :commit:`(patch) <1828f4341ec53a8684112d24031b767eba557663>`
zh_hans: Django 1.7 :commit:`（补丁） <1828f4341ec53a8684112d24031b767eba557663>`

source: Django 1.4 :commit:`(patch) <2e47f3e401c29bc2ba5ab794d483cb0820855fb9>`
zh_hans: Django 1.4 :commit:`（补丁） <2e47f3e401c29bc2ba5ab794d483cb0820855fb9>`

source: May 20, 2015 - :cve:`2015-3982`
id: 20 Mei 2015 - :cve:`2015-3982`
zh_hans: 2015 年 5 月 20 日 - :cve:`2015-3982`

source: Fixed session flushing in the cached_db backend. `Full description <https://www.djangoproject.com/weblog/2015/may/20/security-release/>`__
id: Diperbaiki pembilasan sesi di backend cached_db. `Full description <https://www.djangoproject.com/weblog/2015/may/20/security-release/>`__
zh_hans: 修复了 cached_db 后端中的会话刷新问题。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/may/20/security-release/>`__

source: Django 1.8 :commit:`(patch) <31cb25adecba930bdeee4556709f5a1c42d88fd6>`
zh_hans: Django 1.8 :commit:`（补丁） <31cb25adecba930bdeee4556709f5a1c42d88fd6>`

source: March 18, 2015 - :cve:`2015-2317`
id: 18 Maret 2015 - :cve:`2015-2317`
zh_hans: 2015 年 3 月 18 日 - :cve:`2015-2317`

source: Mitigated possible XSS attack via user-supplied redirect URLs. `Full description <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__
id: Dikurangi kemungkinan serangan XSS melalui URL pengalihan diberikan-pengguna. `Full description <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__
zh_hans: 通过用户提供的重定向 URL 缓解了可能的跨站脚本（XSS）攻击。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__

source: Django 1.4 :commit:`(patch) <2342693b31f740a422abf7267c53b4e7bc487c1b>`
zh_hans: Django 1.4 :commit:`（补丁） <2342693b31f740a422abf7267c53b4e7bc487c1b>`

source: Django 1.6 :commit:`(patch) <5510f070711540aaa8d3707776cd77494e688ef9>`
zh_hans: Django 1.6 :commit:`（补丁） <5510f070711540aaa8d3707776cd77494e688ef9>`

source: Django 1.7 :commit:`(patch) <2a4113dbd532ce952308992633d802dc169a75f1>`
zh_hans: Django 1.7 :commit:`（补丁） <2a4113dbd532ce952308992633d802dc169a75f1>`

source: Django 1.8 :commit:`(patch) <770427c2896a078925abfca2317486b284d22f04>`
zh_hans: Django 1.8 :commit:`（补丁） <770427c2896a078925abfca2317486b284d22f04>`

source: March 18, 2015 - :cve:`2015-2316`
id: 18 Maret 2015 - :cve:`2015-2316`
zh_hans: 2015年 3 月 18 日 - :cve:`2015-2316`

source: Denial-of-service possibility with ``strip_tags()``. `Full description <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__
id: Kemungkinan denial-of-service dengan ``strip_tags()``. `Full description <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__
zh_hans: 使用 ``strip_tags()`` 存在拒绝服务可能性。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/mar/18/security-releases/>`__

source: Django 1.6 :commit:`(patch) <b6b3cb9899214a23ebb0f4ebf0e0b300b0ee524f>`
zh_hans: Django 1.6 :commit:`（补丁） <b6b3cb9899214a23ebb0f4ebf0e0b300b0ee524f>`

source: Django 1.7 :commit:`(patch) <e63363f8e075fa8d66326ad6a1cc3391cc95cd97>`
zh_hans: Django 1.7 :commit:`（补丁） <e63363f8e075fa8d66326ad6a1cc3391cc95cd97>`

source: Django 1.8 :commit:`(patch) <5447709a571cd5d95971f1d5d21d4a7edcf85bbd>`
zh_hans: Django 1.8 :commit:`（补丁） <5447709a571cd5d95971f1d5d21d4a7edcf85bbd>`

source: March 9, 2015 - :cve:`2015-2241`
id: 9 Maret 2015 - :cve:`2015-2241`
zh_hans: 2015 年 3 月9 日 - :cve:`2015-2241`

source: XSS attack via properties in ``ModelAdmin.readonly_fields``. `Full description <https://www.djangoproject.com/weblog/2015/mar/09/security-releases/>`__
id: Serangan XSS melalui sifat di ``ModelAdmin.readonly_fields``. `Full description <https://www.djangoproject.com/weblog/2015/mar/09/security-releases/>`__
zh_hans: 通过 ``ModelAdmin.readonly_fields`` 中的属性存在跨站脚本（XSS）攻击漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/mar/09/security-releases/>`__

source: Django 1.7 :commit:`(patch) <d16e4e1d6f95e6f46bff53cc4fd0ab398b8e5059>`
zh_hans: Django 1.7 :commit:`（补丁） <d16e4e1d6f95e6f46bff53cc4fd0ab398b8e5059>`

source: Django 1.8 :commit:`(patch) <2654e1b93923bac55f12b4e66c5e39b16695ace5>`
zh_hans: Django 1.8 :commit:`（补丁） <2654e1b93923bac55f12b4e66c5e39b16695ace5>`

source: January 13, 2015 - :cve:`2015-0222`
id: 13 januari 2015 - :cve:`2015-0222`
zh_hans: 2015 年 1 月 13 日 - :cve:`2015-0222`

source: Database denial-of-service with ``ModelMultipleChoiceField``. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
id: Denial-of-service basisdata dengan ``ModelMultipleChoiceField``. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
zh_hans: 使用 ``ModelMultipleChoiceField`` 存在数据库拒绝服务漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__

source: Django 1.6 :commit:`(patch) <d7a06ee7e571b6dad07c0f5b519b1db02e2a476c>`
zh_hans: Django 1.6 :commit:`（补丁） <d7a06ee7e571b6dad07c0f5b519b1db02e2a476c>`

source: Django 1.7 :commit:`(patch) <bcfb47780ce7caecb409a9e9c1c314266e41d392>`
zh_hans: Django 1.7 :commit:`（补丁） <bcfb47780ce7caecb409a9e9c1c314266e41d392>`

source: January 13, 2015 - :cve:`2015-0221`
id: 13 Januari 2015 - :cve:`2015-0221`
zh_hans: 2015 年 1 月 13 日 - :cve:`2015-0221`

source: Denial-of-service attack against ``django.views.static.serve()``. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
id: Serangan denial-of-service terhadap ``django.views.static.serve()``. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
zh_hans: 存在针对 ``django.views.static.serve()`` 的拒绝服务攻击漏洞。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__

source: Django 1.4 :commit:`(patch) <d020da6646c5142bc092247d218a3d1ce3e993f7>`
zh_hans: Django 1.4 :commit:`（补丁） <d020da6646c5142bc092247d218a3d1ce3e993f7>`

source: Django 1.6 :commit:`(patch) <553779c4055e8742cc832ed525b9ee34b174934f>`
zh_hans: Django 1.6 :commit:`（补丁） <553779c4055e8742cc832ed525b9ee34b174934f>`

source: Django 1.7 :commit:`(patch) <818e59a3f0fbadf6c447754d202d88df025f8f2a>`
zh_hans: Django 1.7 :commit:`（补丁） <818e59a3f0fbadf6c447754d202d88df025f8f2a>`

source: January 13, 2015 - :cve:`2015-0220`
id: 13 Januari 2015 - :cve:`2015-0220`
zh_hans: 2015 年 1 月 13 日 - :cve:`2015-0220`

source: Mitigated possible XSS attack via user-supplied redirect URLs. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
id: Dikurangi kemungkinan serangan XSS melalui URL pengalihan diberikan-pengguna. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
zh_hans: 通过用户提供的重定向 URL 缓解了可能的跨站脚本（XSS）攻击。详细信息请查看 `完整描述 <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__

source: Django 1.4 :commit:`(patch) <4c241f1b710da6419d9dca160e80b23b82db7758>`
zh_hans: Django 1.4 :commit:`（补丁） <4c241f1b710da6419d9dca160e80b23b82db7758>`

source: Django 1.6 :commit:`(patch) <72e0b033662faa11bb7f516f18a132728aa0ae28>`
zh_hans: Django 1.6 :commit:`（补丁） <72e0b033662faa11bb7f516f18a132728aa0ae28>`

source: Django 1.7 :commit:`(patch) <de67dedc771ad2edec15c1d00c083a1a084e1e89>`
zh_hans: Django 1.7 :commit:`（补丁） <de67dedc771ad2edec15c1d00c083a1a084e1e89>`

source: January 13, 2015 - :cve:`2015-0219`
id: 13 Januari 2015 - :cve:`2015-0219`
zh_hans: 2015 年 1 月 13 日 - :cve:`2015-0219`

source: WSGI header spoofing via underscore/dash conflation. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
id: Menipu kepala WSGI melalui garis bawah/penggabungan tanda garis. `Full description <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__
zh_hans: 通过下划线/短横线混合欺骗 WSGI 标头。`完整描述 <https://www.djangoproject.com/weblog/2015/jan/13/security/>`__

source: Django 1.4 :commit:`(patch) <4f6fffc1dc429f1ad428ecf8e6620739e8837450>`
zh_hans: Django 1.4 :commit:`（补丁） <4f6fffc1dc429f1ad428ecf8e6620739e8837450>`

source: Django 1.6 :commit:`(patch) <d7597b31d5c03106eeba4be14a33b32a5e25f4ee>`
zh_hans: Django 1.6 :commit:`（补丁） <d7597b31d5c03106eeba4be14a33b32a5e25f4ee>`

source: Django 1.7 :commit:`(patch) <41b4bc73ee0da7b2e09f4af47fc1fd21144c710f>`
zh_hans: Django 1.7 :commit:`（补丁） <41b4bc73ee0da7b2e09f4af47fc1fd21144c710f>`

source: August 20, 2014 - :cve:`2014-0483`
id: 20 Agustus 2014 - :cve:`2014-0483`
zh_hans: 2014 年 8 月 20 日 - :cve:`2014-0483`

source: Data leakage via querystring manipulation in admin. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
id: Kebocoran data melalui memanipulasi querystring di admin. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
zh_hans: 在管理员中通过查询字符串操纵导致数据泄漏。`完整描述 <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__

source: Django 1.4 :commit:`(patch) <027bd348642007617518379f8b02546abacaa6e0>`
zh_hans: Django 1.4 :commit:`（补丁） <027bd348642007617518379f8b02546abacaa6e0>`

source: Django 1.5 :commit:`(patch) <2a446c896e7c814661fb9c4f212b071b2a7fa446>`
zh_hans: Django 1.5 :commit:`（补丁） <2a446c896e7c814661fb9c4f212b071b2a7fa446>`

source: Django 1.6 :commit:`(patch) <f7c494f2506250b8cb5923714360a3642ed63e0f>`
zh_hans: Django 1.6 :commit:`（补丁） <f7c494f2506250b8cb5923714360a3642ed63e0f>`

source: Django 1.7 :commit:`(patch) <2b31342cdf14fc20e07c43d258f1e7334ad664a6>`
zh_hans: Django 1.7 :commit:`（补丁） <2b31342cdf14fc20e07c43d258f1e7334ad664a6>`

source: August 20, 2014 - :cve:`2014-0482`
id: 20 Agustus 2014 - :cve:`2014-0482`
zh_hans: 2014 年 8 月 20 日 - :cve:`2014-0482`

source: ``RemoteUserMiddleware`` session hijacking. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
id: Pembajakan sesi ``RemoteUserMiddleware``. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
zh_hans: ``RemoteUserMiddleware`` 会话劫持。`完整描述 <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__

source: Django 1.4 :commit:`(patch) <c9e3b9949cd55f090591fbdc4a114fcb8368b6d9>`
zh_hans: Django 1.4 :commit:`（补丁） <c9e3b9949cd55f090591fbdc4a114fcb8368b6d9>`

source: Django 1.5 :commit:`(patch) <dd68f319b365f6cb38c5a6c106faf4f6142d7d88>`
zh_hans: Django 1.5 :commit:`（补丁） <dd68f319b365f6cb38c5a6c106faf4f6142d7d88>`

source: Django 1.6 :commit:`(patch) <0268b855f9eab3377f2821164ef3e66037789e09>`
zh_hans: Django 1.6 :commit:`（补丁） <0268b855f9eab3377f2821164ef3e66037789e09>`

source: Django 1.7 :commit:`(patch) <1a45d059c70385fcd6f4a3955f3b4e4cc96d0150>`
zh_hans: Django 1.7 :commit:`（补丁） <1a45d059c70385fcd6f4a3955f3b4e4cc96d0150>`

source: August 20, 2014 - :cve:`2014-0481`
id: 20 Agustus 2014 - :cve:`2014-0481`
zh_hans: 2014 年 8 月 20 日 - :cve:`2014-0481`

source: File upload denial of service. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
id: Unggah berkas denial of service. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
zh_hans: 文件上传拒绝服务。`完整描述 <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__

source: Django 1.4 :commit:`(patch) <30042d475bf084c6723c6217a21598d9247a9c41>`
zh_hans: Django 1.4 :commit:`（补丁） <30042d475bf084c6723c6217a21598d9247a9c41>`

source: Django 1.5 :commit:`(patch) <26cd48e166ac4d84317c8ee6d63ac52a87e8da99>`
zh_hans: Django 1.5 :commit:`（补丁） <26cd48e166ac4d84317c8ee6d63ac52a87e8da99>`

source: Django 1.6 :commit:`(patch) <dd0c3f4ee1a30c1a1e6055061c6ba6e58c6b54d1>`
zh_hans: Django 1.6 :commit:`（补丁） <dd0c3f4ee1a30c1a1e6055061c6ba6e58c6b54d1>`

source: Django 1.7 :commit:`(patch) <3123f8452cf49071be9110e277eea60ba0032216>`
zh_hans: Django 1.7 :commit:`（补丁） <3123f8452cf49071be9110e277eea60ba0032216>`

source: August 20, 2014 - :cve:`2014-0480`
id: 20 Agustus 2014 - :cve:`2014-0480`
zh_hans: 2014 年 8 月 20 日 - :cve:`2014-0480`

source: ``reverse()`` can generate URLs pointing to other hosts. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
id: `reverse()`` dapat membangkitkan URL menunjuk ke rumah lain. `Full description <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__
zh_hans: ``reverse()`` 可以生成指向其他主机的 URL。`完整描述 <https://www.djangoproject.com/weblog/2014/aug/20/security/>`__

source: Django 1.4 :commit:`(patch) <c2fe73133b62a1d9e8f7a6b43966570b14618d7e>`
zh_hans: Django 1.4 :commit:`（补丁） <c2fe73133b62a1d9e8f7a6b43966570b14618d7e>`

source: Django 1.5 :commit:`(patch) <45ac9d4fb087d21902469fc22643f5201d41a0cd>`
zh_hans: Django 1.5 :commit:`（补丁） <45ac9d4fb087d21902469fc22643f5201d41a0cd>`

source: Django 1.6 :commit:`(patch) <da051da8df5e69944745072611351d4cfc6435d5>`
zh_hans: Django 1.6 :commit:`（补丁） <da051da8df5e69944745072611351d4cfc6435d5>`

source: Django 1.7 :commit:`(patch) <bf650a2ee78c6d1f4544a875dcc777cf27fe93e9>`
zh_hans: Django 1.7 :commit:`（补丁） <bf650a2ee78c6d1f4544a875dcc777cf27fe93e9>`

source: May 18, 2014 - :cve:`2014-3730`
id: 18 Mei 2014 - :cve:`2014-3730`
zh_hans: 2014 年 5 月 18 日 - :cve:`2014-3730`

source: Malformed URLs from user input incorrectly validated. `Full description <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__
id: URL jelek dari masukan pengguna tidak benar disahkan. `Full description <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__
zh_hans: 来自用户输入的格式不正确的 URL 被错误验证。`完整描述 <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__

source: Django 1.4 :commit:`(patch) <7feb54bbae3f637ab3c4dd4831d4385964f574df>`
zh_hans: Django 1.4 :commit:`（补丁） <7feb54bbae3f637ab3c4dd4831d4385964f574df>`

source: Django 1.5 :commit:`(patch) <ad32c218850ad40972dcef57beb460f8c979dd6d>`
zh_hans: Django 1.5 :commit:`（补丁） <ad32c218850ad40972dcef57beb460f8c979dd6d>`

source: Django 1.6 :commit:`(patch) <601107524523bca02376a0ddc1a06c6fdb8f22f3>`
zh_hans: Django 1.6 :commit:`（补丁） <601107524523bca02376a0ddc1a06c6fdb8f22f3>`

source: Django 1.7 :commit:`(patch) <e7b0cace455c2da24492660636bfd48c45a19cdf>`
zh_hans: Django 1.7 :commit:`（补丁） <e7b0cace455c2da24492660636bfd48c45a19cdf>`

source: May 18, 2014 - :cve:`2014-1418`
id: 18 Mei 2014 - :cve:`2014-1418`
zh_hans: 2014 年 5 月 18 日 - :cve:`2014-1418`

source: Caches may be allowed to store and serve private data. `Full description <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__
id: Tembolok mungkin diizinkan untuk menyimpan dan melayani data pribadi. `Full description <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__
zh_hans: 缓存可能允许存储和提供私人数据。`完整描述 <https://www.djangoproject.com/weblog/2014/may/14/security-releases-issued/>`__

source: Django 1.4 :commit:`(patch) <28e23306aa53bbbb8fb87db85f99d970b051026c>`
zh_hans: Django 1.4 :commit:`（补丁） <28e23306aa53bbbb8fb87db85f99d970b051026c>`

source: Django 1.5 :commit:`(patch) <4001ec8698f577b973c5a540801d8a0bbea1205b>`
zh_hans: Django 1.5 :commit:`（补丁） <4001ec8698f577b973c5a540801d8a0bbea1205b>`

source: Django 1.6 :commit:`(patch) <1abcf3a808b35abae5d425ed4d44cb6e886dc769>`
zh_hans: Django 1.6 :commit:`（补丁） <1abcf3a808b35abae5d425ed4d44cb6e886dc769>`

source: Django 1.7 :commit:`(patch) <7fef18ba9e5a8b47bc24b5bb259c8bf3d3879f2a>`
zh_hans: Django 1.7 :commit:`（补丁） <7fef18ba9e5a8b47bc24b5bb259c8bf3d3879f2a>`

source: April 21, 2014 - :cve:`2014-0474`
id: 21 April 2014 - :cve:`2014-0474`
zh_hans: 2014 年 4 月 21 日 - :cve:`2014-0474`

source: MySQL typecasting causes unexpected query results. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
id: Typecast MySQL menyebabkan hasil permintaan yang tidak diharapkan. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
zh_hans: MySQL 类型转换导致意外的查询结果。`完整描述 <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__

source: Django 1.4 :commit:`(patch) <aa80f498de6d687e613860933ac58433ab71ea4b>`
zh_hans: Django 1.4 :commit:`（补丁） <aa80f498de6d687e613860933ac58433ab71ea4b>`
