Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :class:`.MaxValueValidator`, :class:`.MinValueValidator`, :class:`.MinLengthValidator`, and :class:`.MaxLengthValidator` now accept a callable ``limit_value``.
zh_hans: :class:`.MaxValueValidator`、:class:`.MinValueValidator`、:class:`.MinLengthValidator` 和 :class:`.MaxLengthValidator` 现在接受可调用的 ``limit_value``。

source: Backwards incompatible changes in 2.2
zh_hans: 2.2 版本中的不向后兼容变更

source: Third-party database backends must implement support for table check constraints or set ``DatabaseFeatures.supports_table_check_constraints`` to ``False``.
zh_hans: 第三方数据库后端必须实现对表检查约束的支持，或将 ``DatabaseFeatures.supports_table_check_constraints`` 设置为 ``False``。

source: Third party database backends must implement support for ignoring constraints or uniqueness errors while inserting or set ``DatabaseFeatures.supports_ignore_conflicts`` to ``False``.
zh_hans: 第三方数据库后端必须实现在插入时忽略约束或唯一性错误的支持，或将 ``DatabaseFeatures.supports_ignore_conflicts`` 设置为 ``False``。

source: Third party database backends must implement introspection for ``DurationField`` or set ``DatabaseFeatures.can_introspect_duration_field`` to ``False``.
zh_hans: 第三方数据库后端必须实现对 ``DurationField`` 的内省，或将 ``DatabaseFeatures.can_introspect_duration_field`` 设置为 ``False``。

source: ``DatabaseFeatures.uses_savepoints`` now defaults to ``True``.
zh_hans: ``DatabaseFeatures.uses_savepoints`` 现在默认为 ``True``。

source: Third party database backends must implement support for partial indexes or set ``DatabaseFeatures.supports_partial_indexes`` to ``False``.
zh_hans: 第三方数据库后端必须实现对部分索引的支持，或将 ``DatabaseFeatures.supports_partial_indexes`` 设置为 ``False``。

source: ``DatabaseIntrospection.table_name_converter()`` and ``column_name_converter()`` are removed. Third party database backends may need to instead implement ``DatabaseIntrospection.identifier_converter()``. In that case, the constraint names that ``DatabaseIntrospection.get_constraints()`` returns must be normalized by ``identifier_converter()``.
zh_hans: 移除了 ``DatabaseIntrospection.table_name_converter()`` 和 ``column_name_converter()``。第三方数据库后端可能需要代替实现 ``DatabaseIntrospection.identifier_converter()``。在这种情况下，``DatabaseIntrospection.get_constraints()`` 返回的约束名称必须通过 ``identifier_converter()`` 进行规范化。

source: SQL generation for indexes is moved from :class:`~django.db.models.Index` to ``SchemaEditor`` and these ``SchemaEditor`` methods are added:
zh_hans: 索引的 SQL 生成从 :class:`~django.db.models.Index` 移动到 ``SchemaEditor``，并添加了以下 ``SchemaEditor`` 方法：

source: ``_create_primary_key_sql()`` and ``_delete_primary_key_sql()``
zh_hans: ``_create_primary_key_sql()`` 和 ``_delete_primary_key_sql()``

source: ``_delete_index_sql()`` (to pair with ``_create_index_sql()``)
zh_hans: ``_delete_index_sql()`` （与 ``_create_index_sql()`` 配对使用）

source: ``_delete_unique_sql`` (to pair with ``_create_unique_sql()``)
zh_hans: ``_delete_unique_sql`` （与 ``_create_unique_sql()`` 配对使用）

source: ``_delete_fk_sql()`` (to pair with ``_create_fk_sql()``)
zh_hans: ``_delete_fk_sql()`` （与 ``_create_fk_sql()`` 配对使用）

source: ``_create_check_sql()`` and ``_delete_check_sql()``
zh_hans: ``_create_check_sql()`` 和 ``_delete_check_sql()``

source: The third argument of ``DatabaseWrapper.__init__()``, ``allow_thread_sharing``, is removed.
zh_hans: 移除了 ``DatabaseWrapper.__init__()`` 的第三个参数 ``allow_thread_sharing``。

source: Admin actions are no longer collected from base ``ModelAdmin`` classes
zh_hans: 不再从基本的 ``ModelAdmin`` 类中收集管理操作

source: For example, in older versions of Django::
zh_hans: 例如，在较旧版本的 Django 中：

source: ``SubAdmin`` would have actions ``'a'`` and ``'b'``.
zh_hans: ``SubAdmin`` 将具有操作 ``'a'`` 和 ``'b'``。

source: Now ``actions`` follows standard Python inheritance. To get the same result as before::
zh_hans: 现在，``actions`` 遵循标准的 Python 继承。要获得与以前相同的结果：

source: Support for GDAL 1.9 and 1.10 is dropped.
zh_hans: 支持 GDAL 1.9 和 1.10 的功能已被移除。

source: ``TransactionTestCase`` serialized data loading
zh_hans: ``TransactionTestCase`` 序列化数据加载

source: Initial data migrations are now loaded in :class:`~django.test.TransactionTestCase` at the end of the test, after the database flush. In older versions, this data was loaded at the beginning of the test, but this prevents the :option:`test --keepdb` option from working properly (the database was empty at the end of the whole test suite). This change shouldn't have an impact on your tests unless you've customized :class:`~django.test.TransactionTestCase`'s internals.
zh_hans: 现在，在 :class:`~django.test.TransactionTestCase` 的测试结束后，即在数据库刷新之后加载初始数据迁移。在旧版本中，这些数据在测试开始时加载，但这会阻止 :option:`test --keepdb` 选项正常工作（整个测试套件结束后数据库为空）。除非您已自定义了 :class:`~django.test.TransactionTestCase` 的内部，否则这个变化不应影响您的测试。

source: ``sqlparse`` is required dependency
zh_hans: ``sqlparse`` 是必需的依赖项

source: To simplify a few parts of Django's database handling, :pypi:`sqlparse 0.2.2+ <sqlparse>` is now a required dependency. It's automatically installed along with Django.
zh_hans: 为了简化 Django 数据库处理的几个部分，现在 :pypi:`sqlparse 0.2.2+ <sqlparse>` 是一个必需的依赖项。它会随着 Django 自动安装。

source: ``cached_property`` aliases
zh_hans: ``cached_property`` 别名

source: In usage like::
zh_hans: 在以下用法中：

source: ``alias`` is not cached. Where the problem can be detected (Python 3.6 and later), such usage now raises ``TypeError: Cannot assign the same cached_property to two different names ('base' and 'alias').``
zh_hans: ``alias`` 不会被缓存。在可以检测到问题的情况下（Python 3.6 及更高版本），此类用法现在会引发 ``TypeError: Cannot assign the same cached_property to two different names ('base' and 'alias')``。

source: Use this instead::
zh_hans: 请改用以下方式：

source: Permissions for proxy models
zh_hans: 代理模型的权限

source: :ref:`Permissions for proxy models <proxy-models-permissions-topic>` are now created using the content type of the proxy model rather than the content type of the concrete model. A migration will update existing permissions when you run :djadmin:`migrate`.
zh_hans: :ref:`代理模型的权限 <proxy-models-permissions-topic>` 现在使用代理模型的内容类型而不是具体模型的内容类型来创建。在运行 :djadmin:`migrate` 时，迁移将更新现有的权限。

source: In the admin, the change is transparent for proxy models having the same ``app_label`` as their concrete model. However, in older versions, users with permissions for a proxy model with a *different* ``app_label`` than its concrete model couldn't access the model in the admin. That's now fixed, but you might want to audit the permissions assignments for such proxy models (``[add|view|change|delete]_myproxy``) prior to upgrading to ensure the new access is appropriate.
zh_hans: 在管理界面中，对于与其具体模型具有相同的 ``app_label`` 的代理模型，这个变化是透明的。然而，在旧版本中，对于具体模型具有不同 ``app_label`` 的代理模型的权限的用户不能访问管理中的模型。现在这个问题已经修复，但在升级之前，您可能希望审查这些代理模型的权限分配（``[add|view|change|delete]_myproxy``），以确保新的访问是合适的。

source: Finally, proxy model permission strings must be updated to use their own ``app_label``. For example, for ``app.MyProxyModel`` inheriting from ``other_app.ConcreteModel``, update ``user.has_perm('other_app.add_myproxymodel')`` to ``user.has_perm('app.add_myproxymodel')``.
zh_hans: 最后，代理模型的权限字符串必须更新以使用它们自己的 ``app_label``。例如，对于继承自 ``other_app.ConcreteModel`` 的 ``app.MyProxyModel``，请将 ``user.has_perm('other_app.add_myproxymodel')`` 更新为 ``user.has_perm('app.add_myproxymodel')``。

source: Merging of form ``Media`` assets
zh_hans: 合并表单 ``Media`` 资源

source: Form ``Media`` assets are now merged using a topological sort algorithm, as the old pairwise merging algorithm is insufficient for some cases. CSS and JavaScript files which don't include their dependencies may now be sorted incorrectly (where the old algorithm produced results correctly by coincidence).
zh_hans: 现在，表单 ``Media`` 资源使用拓扑排序算法进行合并，因为旧的成对合并算法对某些情况不足够。不包含其依赖项的 CSS 和 JavaScript 文件现在可能会被错误地排序（而旧算法恰好由于巧合而产生了正确的结果）。

source: Audit all ``Media`` classes for any missing dependencies. For example, widgets depending on ``django.jQuery`` must specify ``js=['admin/js/jquery.init.js', ...]`` when :ref:`declaring form media assets <assets-as-a-static-definition>`.
zh_hans: 请审查所有的 ``Media`` 类以查找任何缺失的依赖项。例如，依赖于 ``django.jQuery`` 的小部件在 :ref:`声明表单媒体资源 <assets-as-a-static-definition>` 时必须指定 ``js=['admin/js/jquery.init.js', ...]``。

source: To improve readability, the ``UUIDField`` form field now displays values with dashes, e.g. ``550e8400-e29b-41d4-a716-446655440000`` instead of ``550e8400e29b41d4a716446655440000``.
zh_hans: 为了提高可读性，``UUIDField`` 表单字段现在会显示带有破折号的值，例如 ``550e8400-e29b-41d4-a716-446655440000``，而不是 ``550e8400e29b41d4a716446655440000``。

source: On SQLite, ``PositiveIntegerField`` and ``PositiveSmallIntegerField`` now include a check constraint to prevent negative values in the database. If you have existing invalid data and run a migration that recreates a table, you'll see ``CHECK constraint failed``.
zh_hans: 在 SQLite 上，``PositiveIntegerField`` 和 ``PositiveSmallIntegerField`` 现在包含一个检查约束，以防止在数据库中出现负值。如果您有现有的无效数据并运行重新创建表的迁移，您将看到 ``CHECK constraint failed``。

source: For consistency with WSGI servers, the test client now sets the ``Content-Length`` header to a string rather than an integer.
zh_hans: 为了与 WSGI 服务器保持一致，测试客户端现在将 ``Content-Length`` 头设置为字符串而不是整数。

source: The return value of :func:`django.utils.text.slugify` is no longer marked as HTML safe.
zh_hans: :func:`django.utils.text.slugify` 的返回值不再标记为 HTML 安全。

source: The default truncation character used by the :tfilter:`urlizetrunc`, :tfilter:`truncatechars`, :tfilter:`truncatechars_html`, :tfilter:`truncatewords`, and :tfilter:`truncatewords_html` template filters is now the real ellipsis character (``…``) instead of 3 dots. You may have to adapt some test output comparisons.
zh_hans: :tfilter:`urlizetrunc`、:tfilter:`truncatechars`、:tfilter:`truncatechars_html`、:tfilter:`truncatewords` 和 :tfilter:`truncatewords_html` 模板过滤器使用的默认截断字符现在是真正的省略号字符（``…``）而不是 3 个点。您可能需要调整一些测试输出的比较。

source: Support for bytestring paths in the template filesystem loader is removed.
zh_hans: 不再支持在模板文件系统加载器中使用字节串路径。

source: :func:`django.utils.http.urlsafe_base64_encode` now returns a string instead of a bytestring, and :func:`django.utils.http.urlsafe_base64_decode` may no longer be passed a bytestring.
zh_hans: :func:`django.utils.http.urlsafe_base64_encode` 现在返回一个字符串而不是字节字符串，并且 :func:`django.utils.http.urlsafe_base64_decode` 可能不再接受字节字符串作为参数。

source: Support for ``cx_Oracle`` < 6.0 is removed.
zh_hans: 不再支持 ``cx_Oracle`` 版本低于 6.0。

source: The minimum supported version of ``mysqlclient`` is increased from 1.3.7 to 1.3.13.
zh_hans: ``mysqlclient`` 的最低支持版本从 1.3.7 增加到 1.3.13。

source: The minimum supported version of SQLite is increased from 3.7.15 to 3.8.3.
zh_hans: SQLite 的最低支持版本从 3.7.15 提高到 3.8.3 。

source: In an attempt to provide more semantic query data, ``NullBooleanSelect`` now renders ``<option>`` values of ``unknown``, ``true``, and ``false`` instead of ``1``, ``2``, and ``3``. For backwards compatibility, the old values are still accepted as data.
zh_hans: 为了提供更语义化的查询数据，``NullBooleanSelect`` 现在呈现 ``<option>`` 的值为 ``unknown``、``true`` 和 ``false``，而不是 ``1``、``2`` 和 ``3``。为了向后兼容，旧值仍然被接受为数据。

source: :attr:`Group.name <django.contrib.auth.models.Group.name>` ``max_length`` is increased from 80 to 150 characters.
zh_hans: :attr:`Group.name <django.contrib.auth.models.Group.name>` 的 ``max_length`` 从 80 增加到 150 个字符。

source: Tests that violate deferrable database constraints now error when run on SQLite 3.20+, just like on other backends that support such constraints.
zh_hans: 现在在运行于 SQLite 3.20+ 上的测试中，违反可延迟数据库约束的行为将报错，就像其他支持此类约束的后端一样。

source: To catch usage mistakes, the test :class:`~django.test.Client` and :func:`django.utils.http.urlencode` now raise ``TypeError`` if ``None`` is passed as a value to encode because ``None`` can't be encoded in GET and POST data. Either pass an empty string or omit the value.
zh_hans: 为了捕获使用错误，测试 :class:`~django.test.Client` 和 :func:`django.utils.http.urlencode` 现在如果传递 ``None`` 作为要编码的值会引发 ``TypeError``，因为 ``None`` 不能编码为 GET 和 POST 数据。要么传递空字符串，要么省略值。

source: The ``ping_google`` management command now defaults to ``https`` instead of ``http`` for the sitemap's URL. If your site uses http, use the new ``ping_google --sitemap-uses-http`` option. If you use the ``django.contrib.sitemaps.ping_google`` function, set the new ``sitemap_uses_https`` argument to ``False``.
zh_hans: 现在，``ping_google`` 管理命令默认使用 ``https`` 而不是 ``http`` 作为站点地图的 URL。如果你的站点使用 http，请使用新的 ``ping_google --sitemap-uses-http`` 选项。如果你使用 ``django.contrib.sitemaps.ping_google`` 函数，请将新的 ``sitemap_uses_https`` 参数设置为 ``False``。

source: :djadmin:`runserver` no longer supports ``pyinotify`` (replaced by Watchman).
zh_hans: :djadmin:`runserver` 不再支持 ``pyinotify`` （已被 Watchman 替代）。

source: The :class:`~django.db.models.Avg`, :class:`~django.db.models.StdDev`, and :class:`~django.db.models.Variance` aggregate functions now return a ``Decimal`` instead of a ``float`` when the input is ``Decimal``.
zh_hans: 当输入是 ``Decimal`` 时， :class:`~django.db.models.Avg`、:class:`~django.db.models.StdDev` 和 :class:`~django.db.models.Variance` 聚合函数现在返回 ``Decimal`` 而不是 ``float``。

source: Tests will fail on SQLite if apps without migrations have relations to apps with migrations. This has been a documented restriction since migrations were added in Django 1.7, but it fails more reliably now. You'll see tests failing with errors like ``no such table: <app_label>_<model>``. This was observed with several third-party apps that had models in tests without migrations. You must add migrations for such models.
zh_hans: 如果没有迁移的应用与具有迁移的应用有关系，那么在 SQLite 上的测试将失败。这自从 Django 1.7 添加迁移以来一直是一个已记录的限制，但现在它失败得更可靠。您将看到类似于 ``no such table: <app_label>_<model>`` 的错误导致测试失败。这在一些具有测试中没有迁移的模型的第三方应用中观察到。您必须为这些模型添加迁移。

source: Providing an integer in the ``key`` argument of the :meth:`.cache.delete` or :meth:`.cache.get` now raises :exc:`ValueError`.
zh_hans: 在 :meth:`.cache.delete` 或 :meth:`.cache.get` 的 ``key`` 参数中提供整数现在会引发 :exc:`ValueError`。

source: Plural equations for some languages are changed, because the latest versions from Transifex are incorporated.
zh_hans: 由于已纳入 Transifex 的最新版本，某些语言的复数规则方程式已被更改。

source: The ability to handle ``.po`` files containing different plural equations for the same language was added in Django 2.2.12.
zh_hans: 在 Django 2.2.12 中添加了处理同一语言的 ``.po`` 文件中包含不同复数方程的能力。

source: Features deprecated in 2.2
zh_hans: 在 2.2 中被废弃的功能

source: Model ``Meta.ordering`` will no longer affect ``GROUP BY`` queries
zh_hans: 模型的 ``Meta.ordering`` 将不再影响 ``GROUP BY`` 查询。

source: A model's ``Meta.ordering`` affecting ``GROUP BY`` queries (such as ``.annotate().values()``) is a common source of confusion. Such queries now issue a deprecation warning with the advice to add an ``order_by()`` to retain the current query. ``Meta.ordering`` will be ignored in such queries starting in Django 3.1.
zh_hans: 模型的 ``Meta.ordering`` 影响 ``GROUP BY`` 查询（例如 ``.annotate().values()``）是常见的引发混淆的原因。现在，这种查询会发出一个弃用警告，建议添加一个 ``order_by()`` 以保留当前查询。从 Django 3.1 开始，在这种查询中将忽略 ``Meta.ordering``。

source: ``django.utils.timezone.FixedOffset`` is deprecated in favor of :class:`datetime.timezone`.
zh_hans: ``django.utils.timezone.FixedOffset`` 已被弃用，建议使用 :class:`datetime.timezone`。

source: The undocumented ``QuerySetPaginator`` alias of ``django.core.paginator.Paginator`` is deprecated.
zh_hans: 未记录的 ``QuerySetPaginator`` 别名 ``django.core.paginator.Paginator`` 已被弃用。

source: The ``FloatRangeField`` model and form fields in ``django.contrib.postgres`` are deprecated in favor of a new name, ``DecimalRangeField``, to match the underlying ``numrange`` data type used in the database.
zh_hans: ``django.contrib.postgres`` 中的 ``FloatRangeField`` 模型和表单字段已被弃用，推荐使用新名称 ``DecimalRangeField``，以匹配数据库中使用的 ``numrange`` 数据类型。

source: The ``FILE_CHARSET`` setting is deprecated. Starting with Django 3.1, files read from disk must be UTF-8 encoded.
zh_hans: ``FILE_CHARSET`` 设置已被弃用。从 Django 3.1 开始，从磁盘读取的文件必须是 UTF-8 编码的。

source: ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` is deprecated due to the intractable problems that it has. Use :class:`.ManifestStaticFilesStorage` or a third-party cloud storage instead.
zh_hans: ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` 已被弃用，因为它存在无法解决的问题。请改用 :class:`.ManifestStaticFilesStorage` 或第三方云存储。

source: :meth:`.RemoteUserBackend.configure_user` is now passed ``request`` as the first positional argument, if it accepts it. Support for overrides that don't accept it will be removed in Django 3.1.
zh_hans: 现在，:meth:`.RemoteUserBackend.configure_user` 方法的第一个位置参数是 ``request``，如果该方法接受它的话。不支持不接受 ``request`` 参数的覆盖方法，将在 Django 3.1 中移除。

source: The ``SimpleTestCase.allow_database_queries``, ``TransactionTestCase.multi_db``, and ``TestCase.multi_db`` attributes are deprecated in favor of :attr:`.SimpleTestCase.databases`, :attr:`.TransactionTestCase.databases`, and :attr:`.TestCase.databases`. These new attributes allow databases dependencies to be declared in order to prevent unexpected queries against non-default databases to leak state between tests. The previous behavior of ``allow_database_queries=True`` and ``multi_db=True`` can be achieved by setting ``databases='__all__'``.
zh_hans: ``SimpleTestCase.allow_database_queries``、``TransactionTestCase.multi_db`` 和 ``TestCase.multi_db`` 属性已被弃用，推荐使用 :attr:`.SimpleTestCase.databases`、:attr:`.TransactionTestCase.databases` 和 :attr:`.TestCase.databases`。这些新属性允许声明数据库依赖关系，以防止非默认数据库的意外查询在测试之间泄漏状态。以前的行为可以通过设置 ``databases='__all__'`` 来实现，即 ``allow_database_queries=True`` 和 ``multi_db=True``。

source: Django 2.2.1 release notes
zh_hans: Django 2.2.1 版本发行说明

source: *May 1, 2019*
zh_hans: *2019 年 5 月 1 日*

source: Django 2.2.1 fixes several bugs in 2.2.
zh_hans: Django 2.2.1 修复了 2.2 版本中的一些错误。

source: Fixed a regression in Django 2.1 that caused the incorrect quoting of database user password when using :djadmin:`dbshell` on Oracle (:ticket:`30307`).
zh_hans: 修复了 Django 2.1 中的一个回归问题，当在 Oracle 上使用 :djadmin:`dbshell` 时，导致数据库用户密码引号不正确 (:ticket:`30307`)。

source: Added compatibility for ``psycopg2`` 2.8 (:ticket:`30331`).
zh_hans: 增加了对 ``psycopg2`` 2.8 的兼容性 (:ticket:`30331`)。

source: Fixed a regression in Django 2.2 that caused a crash when loading the template for the technical 500 debug page (:ticket:`30324`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，导致在加载技术性的 500 调试页面模板时崩溃 (:ticket:`30324`)。

source: Fixed crash of ``ordering`` argument in :class:`~django.contrib.postgres.aggregates.ArrayAgg` and :class:`~django.contrib.postgres.aggregates.StringAgg` when it contains an expression with params (:ticket:`30332`).
zh_hans: 修复了当 ``ordering`` 参数中包含具有参数的表达式时，导致 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg` 崩溃的问题 (:ticket:`30332`)。

source: Fixed a regression in Django 2.2 that caused a single instance fast-delete to not set the primary key to ``None`` (:ticket:`30330`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，导致单个实例的快速删除未将主键设置为 ``None`` (:ticket:`30330`)。

source: Prevented :djadmin:`makemigrations` from generating infinite migrations for check constraints and partial indexes when ``condition`` contains a :class:`~python:range` object (:ticket:`30350`).
zh_hans: 阻止了 :djadmin:`makemigrations` 在 ``condition`` 包含 :class:`~python:range` 对象时为检查约束和部分索引生成无限迁移 (:ticket:`30350`)。

source: Reverted an optimization in Django 2.2 (:ticket:`29725`) that caused the inconsistent behavior of ``count()`` and ``exists()`` on a reverse many-to-many relationship with a custom manager (:ticket:`30325`).
zh_hans: 撤销了 Django 2.2 中的一个优化 (:ticket:`29725`)，该优化导致在具有自定义管理器的反向多对多关系上的 ``count()`` 和 ``exists()`` 出现不一致的行为 (:ticket:`30325`)。

source: Fixed a regression in Django 2.2 where :class:`~django.core.paginator.Paginator` crashes if ``object_list`` is a queryset ordered or aggregated over a nested ``JSONField`` key transform (:ticket:`30335`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当 ``object_list`` 是在嵌套的 ``JSONField`` 键转换上排序或聚合的查询集时，导致 :class:`~django.core.paginator.Paginator` 崩溃的问题 (:ticket:`30335`)。

source: Fixed a regression in Django 2.2 where ``IntegerField`` validation of database limits crashes if ``limit_value`` attribute in a custom validator is callable (:ticket:`30328`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当自定义验证器的 ``limit_value`` 属性是可调用的时，导致数据库限制的 ``IntegerField`` 验证崩溃的问题 (:ticket:`30328`)。

source: Fixed a regression in Django 2.2 where :class:`~django.contrib.postgres.search.SearchVector` generates SQL that is not indexable (:ticket:`30385`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，其中 :class:`~django.contrib.postgres.search.SearchVector` 生成的 SQL 无法建立索引 (:ticket:`30385`)。

source: Fixed a regression in Django 2.2 that caused an exception to be raised when a custom error handler could not be imported (:ticket:`30318`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当无法导入自定义错误处理程序时，导致引发异常的问题 (:ticket:`30318`)。

source: Relaxed the system check added in Django 2.2 for the admin app's dependencies to reallow use of :class:`~django.contrib.sessions.middleware.SessionMiddleware` subclasses, rather than requiring :mod:`django.contrib.sessions` to be in :setting:`INSTALLED_APPS` (:ticket:`30312`).
zh_hans: 放宽了在 Django 2.2 中为管理应用程序的依赖项添加的系统检查，以允许再次使用 :class:`~django.contrib.sessions.middleware.SessionMiddleware` 的子类，而不需要将 :mod:`django.contrib.sessions` 添加到 :setting:`INSTALLED_APPS` 中 (:ticket:`30312`)。

source: Increased the default timeout when using ``Watchman`` to 5 seconds to prevent falling back to ``StatReloader`` on larger projects and made it customizable via the :envvar:`DJANGO_WATCHMAN_TIMEOUT` environment variable (:ticket:`30361`).
zh_hans: 将使用 ``Watchman`` 时的默认超时时间增加到 5 秒，以防止在较大的项目上回退到 ``StatReloader``，并通过 :envvar:`DJANGO_WATCHMAN_TIMEOUT` 环境变量进行自定义设置 (:ticket:`30361`)。

source: Fixed a regression in Django 2.2 that caused a crash when migrating permissions for proxy models if the target permissions already existed. For example, when a permission had been created manually or a model had been migrated from concrete to proxy (:ticket:`30351`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，如果目标权限已经存在，导致在迁移代理模型的权限时崩溃。例如，当权限已手动创建或模型已从具体模型迁移到代理模型时 (:ticket:`30351`)。

source: Fixed a regression in Django 2.2 that caused a crash of :djadmin:`runserver` when URLConf modules raised exceptions (:ticket:`30323`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，导致当 URLConf 模块引发异常时，:djadmin:`runserver` 崩溃的问题 (:ticket:`30323`)。

source: Fixed a regression in Django 2.2 where changes were not reliably detected by auto-reloader when using ``StatReloader`` (:ticket:`30323`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当使用 ``StatReloader`` 时，自动重新加载器无法可靠地检测到更改的问题 (:ticket:`30323`)。

source: Fixed a migration crash on Oracle and PostgreSQL when adding a check constraint with a ``contains``, ``startswith``, or ``endswith`` lookup (or their case-insensitive variant) (:ticket:`30408`).
zh_hans: 修复了在 Oracle 和 PostgreSQL 上添加具有 ``contains``、``startswith`` 或 ``endswith`` 查找（或其不区分大小写的变体）的检查约束时发生的迁移崩溃问题 (:ticket:`30408`)。

source: Fixed a migration crash on Oracle and SQLite when adding a check constraint with ``condition`` contains ``|`` (``OR``) operator (:ticket:`30412`).
zh_hans: 修复了在 Oracle 和 SQLite 上添加具有 ``condition`` 包含 ``|`` （``OR``）运算符的检查约束时发生的迁移崩溃问题 (:ticket:`30412`)。

source: Django 2.2.10 release notes
zh_hans: Django 2.2.10 版本发行说明

source: Django 2.2.10 fixes a security issue in 2.2.9.
zh_hans: Django 2.2.10 修复了 2.2.9 版本中的一个安全问题。

source: Django 2.2.11 release notes
zh_hans: Django 2.2.11 版本发行说明

source: Django 2.2.11 fixes a security issue and a data loss bug in 2.2.10.
zh_hans: Django 2.2.11 修复了 2.2.10 版本中的一个安全问题和一个数据丢失的错误。

source: Fixed a data loss possibility in the :meth:`~django.db.models.query.QuerySet.select_for_update`. When using related fields or parent link fields with :ref:`multi-table-inheritance` in the ``of`` argument, the corresponding models were not locked (:ticket:`31246`).
zh_hans: 修复了 :meth:`~django.db.models.query.QuerySet.select_for_update` 中的数据丢失可能性。当在 ``of`` 参数中使用相关字段或父链接字段与 :ref:`multi-table-inheritance` 结合使用时，相应的模型没有被锁定 (:ticket:`31246`)。
