Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: If you were using the old modules, see :doc:`Query Expressions </ref/models/expressions>` for instructions on rewriting custom aggregates using the new stable API.
id: Jika anda sedang menggunakan modul lama, lihat :doc:`Query Expressions </ref/models/expressions>` untuk petunjuk pada penulisan kembali pengumpulan penyesuaian menggunakan API stabil baru.
zh_hans: 如果您正在使用旧模块，请参阅 :doc:`查询表达式 </ref/models/expressions>`，以了解如何使用新的稳定 API 重写自定义聚合函数。

source: The following methods and properties of ``django.db.models.sql.query.Query`` have also been deprecated and the backwards compatibility shims will be removed in Django 1.10:
id: Metode berikut dan sifat dari ``django.db.models.sql.query.Query`` juga telah diusangkan dan shim kesesuaian kebelakang akan dipindahkan di Django 1.10:
zh_hans: 以下方法和属性已经被弃用，并且在 Django 1.10 中将移除与向后兼容的包装：

source: ``Query.aggregates``, replaced by ``annotations``.
id: ``Query.aggregates``, diganti oleh ``annotations``.
zh_hans: ``Query.aggregates``，已被替换为 ``annotations``。

source: ``Query.aggregate_select``, replaced by ``annotation_select``.
id: `Query.aggregate_select``, diganti oleh ``annotation_select``.
zh_hans: ``Query.aggregate_select``，已被替换为 ``annotation_select``。

source: ``Query.add_aggregate()``, replaced by ``add_annotation()``.
id: ``Query.add_aggregate()``, diganti oleh ``add_annotation()``.
zh_hans: ``Query.add_aggregate()``，已被替换为 ``add_annotation()``。

source: ``Query.set_aggregate_mask()``, replaced by ``set_annotation_mask()``.
id: ``Query.set_aggregate_mask()``, diganti oleh ``set_annotation_mask()``.
zh_hans: ``Query.set_aggregate_mask()``，已被替换为 ``set_annotation_mask()``。

source: ``Query.append_aggregate_mask()``, replaced by ``append_annotation_mask()``.
id: ``Query.append_aggregate_mask()``, diganti oleh ``append_annotation_mask()``.
zh_hans: ``Query.append_aggregate_mask()``，已被替换为 ``append_annotation_mask()``。

source: Extending management command arguments through ``Command.option_list``
id: Memperpanjang argumen perintah pengelolaan melalui ``Command.option_list``
zh_hans: 通过 ``Command.option_list`` 扩展管理命令参数

source: Management commands now use :py:mod:`argparse` instead of :py:mod:`optparse` to parse command-line arguments passed to commands. This also means that the way to add custom arguments to commands has changed: instead of extending the ``option_list`` class list, you should now override the :meth:`~django.core.management.BaseCommand.add_arguments` method and add arguments through ``argparse.add_argument()``. See :ref:`this example <custom-commands-options>` for more details.
id: Perintah pengelolaan sekarang menggunakan :py:mod:`argparse` sebagai gantinya :py:mod:`optparse` untuk mengurai argumen baris-perintah dilewatkan ke perintah. Ini juga berarti bahwa cara untuk menambah argumen penyesuaian pada perintah telah berubah: daripada memperpanjang daftar kelas ``option_list``, anda sekarang harus menimpa metode :meth:`~django.core.management.BaseCommand.add_arguments` dan menambah argumen melalui ``argparse.add_argument()``. Lihat :ref:`this example <custom-commands-options>` untuk lebih rinci.
zh_hans: 管理命令现在使用 :py:mod:`argparse` 而不是 :py:mod:`optparse` 来解析传递给命令的命令行参数。这也意味着添加自定义参数到命令的方式已经改变：不再扩展 ``option_list`` 类列表，而是现在应该覆盖 :meth:`~django.core.management.BaseCommand.add_arguments` 方法，并通过 ``argparse.add_argument()`` 添加参数。有关更多详细信息，请参阅 :ref:`此示例 <custom-commands-options>`。

source: The class ``NoArgsCommand`` is now deprecated and will be removed in Django 1.10. Use :class:`~django.core.management.BaseCommand` instead, which takes no arguments by default.
id: Kelas ``NoArgsCommand`` sekarang diusangkan dan akan dipindahkan di Django 1.10. Gunakan :class:`~django.core.management.BaseCommand` sebagai gantinya, yang mengambil tidak ada argumen secara awal.
zh_hans: 类 ``NoArgsCommand`` 现已被弃用，将在 Django 1.10 中移除。请改用 :class:`~django.core.management.BaseCommand`，默认情况下不接受参数。

source: Listing all migrations in a project
id: Mendaftarkan semua perpindahan di sebuah proyek
zh_hans: 列出项目中的所有迁移

source: The ``--list`` option of the :djadmin:`migrate` management command is deprecated and will be removed in Django 1.10. Use :djadmin:`showmigrations` instead.
id: Pilihan ``--list`` dari perintah pengelolaan :djadmin:`migrate` telah diusangkan dan akan dipindahkan di Django 1.10. Gunakan :djadmin:`showmigrations` sebagai gantinya.
zh_hans: :djadmin:`migrate` 管理命令的 ``--list`` 选项已被弃用，将在 Django 1.10 中移除。请改用 :djadmin:`showmigrations`。

source: ``cache_choices`` option of ``ModelChoiceField`` and ``ModelMultipleChoiceField``
id: Pilihan ``cache_choices`` dari ``ModelChoiceField`` dan ``ModelMultipleChoiceField``
zh_hans: ``ModelChoiceField`` 和 ``ModelMultipleChoiceField`` 的 ``cache_choices`` 选项

source: :class:`~django.forms.ModelChoiceField` and :class:`~django.forms.ModelMultipleChoiceField` took an undocumented, untested option ``cache_choices``. This cached querysets between multiple renderings of the same ``Form`` object. This option is subject to an accelerated deprecation and will be removed in Django 1.9.
id: :class:`~django.forms.ModelChoiceField` dan :class:`~django.forms.ModelMultipleChoiceField` mengambil sebuah tidak terdokumentasi, ``cache_choices`` pilihan tidak dicoba. Ini menyimpan queryset diantara pembangunan banyak dari obyek ``Form`` yang sama. Pilihan ini adalah subjek pada pengusangan yang dipercepat dan akan dipindahkan di Django 1.9.
zh_hans: :class:`~django.forms.ModelChoiceField` 和 :class:`~django.forms.ModelMultipleChoiceField` 接受了一个未记录和未经测试的选项 ``cache_choices``。该选项在同一 ``Form`` 对象的多次渲染之间缓存了查询集。该选项将加速弃用，并将在 Django 1.9 中移除。

source: The function has been informally marked as "Deprecated" for some time. Replace ``resolve_variable(path, context)`` with ``django.template.Variable(path).resolve(context)``.
id: Fungsi ini telah secara tidak resmi ditandai sebagai "Deprecated" untuk beberapa waktu. Ganti ``resolve_variable(path, context)`` dengan ``django.template.Variable(path).resolve(context)``.
zh_hans: 这个函数已经在一段时间内非正式地标记为 "弃用"。请使用 ``django.template.Variable(path).resolve(context)`` 替代 ``resolve_variable(path, context)``。

source: It provided the :ttag:`lorem` template tag which is now included in the built-in tags. Simply remove ``'django.contrib.webdesign'`` from :setting:`INSTALLED_APPS` and ``{% load webdesign %}`` from your templates.
id: Itu menyediakan etiket cetakan :ttag:`lorem` yang sekarang disertakan di etiket siap-pakai. Cukup pindahkan ``'django.contrib.webdesign'`` dari :setting:`INSTALLED_APPS` dan ``{% load webdesign %}`` dari cetakan anda.
zh_hans: 它提供了 :ttag:`lorem` 模板标签，现在已包含在内置标签中。只需从 :setting:`INSTALLED_APPS` 中移除 ``'django.contrib.webdesign'``，并从您的模板中移除 ``{% load webdesign %}``。

source: ``error_message`` argument to ``django.forms.RegexField``
id: ``error_message`` argumen ke ``django.forms.RegexField``
zh_hans: ``django.forms.RegexField`` 的 ``error_message`` 参数已被弃用

source: It provided backwards compatibility for pre-1.0 code, but its functionality is redundant. Use ``Field.error_messages['invalid']`` instead.
id: Itu menyediakan kesesuaian kebelakang untuk kode pra-1.0, tetapi fungsionalitasnya berulang. Gunakan ``Field.error_messages['invalid']`` sebagai gantinya.
zh_hans: 它提供了对 1.0 版本之前的代码的向后兼容性，但其功能是多余的。请改用 ``Field.error_messages['invalid']``。

source: Old :tfilter:`unordered_list` syntax
id: Sintaksis :tfilter:`unordered_list` lama
zh_hans: 旧的 :tfilter:`unordered_list` 语法

source: An older (pre-1.0), more restrictive and verbose input format for the :tfilter:`unordered_list` template filter has been deprecated::
id: Sebuah terlama (pra-1.0), lebih bentuk masukan terbatas dan bertele-tele untuk saringan cetakan :tfilter:`unordered_list` telah diusangkan::
zh_hans: 已弃用了 :tfilter:`unordered_list` 模板过滤器的旧输入格式，这是一个较旧（1.0 版本之前）的、更受限制和冗长的格式：

source: Using the new syntax, this becomes::
id: Menggunakan sintaksis baru, ini menjadi::
zh_hans: 使用新的语法，这将变为：

source: Rename this method to :meth:`~django.forms.Field.has_changed` by removing the leading underscore. The old name will still work until Django 1.10.
id: Namai kembali metode ini ke :meth:`~django.forms.Field.has_changed` dengan memindahkan garis bawah di depan. Nama lama akan masih bekerja sampai Django 1.10.
zh_hans: 将这个方法的名称更改为 :meth:`~django.forms.Field.has_changed`，删除前导的下划线。旧的名称将在 Django 1.10 之前仍然有效。

source: ``django.utils.html.remove_tags()`` and ``removetags`` template filter
id: Penyaring cetakan ``django.utils.html.remove_tags()`` dan ``removetags``
zh_hans: ``django.utils.html.remove_tags()`` 和 ``removetags`` 模板过滤器

source: ``django.utils.html.remove_tags()`` as well as the template filter ``removetags`` have been deprecated as they cannot guarantee safe output. Their existence is likely to lead to their use in security-sensitive contexts where they are not actually safe.
id: ``django.utils.html.remove_tags()`` sama halnya dengan saringan cetakan ``removetags`` telah diusangkan karena mereka tidak dapat menjamin keluaran aman.
zh_hans: ``django.utils.html.remove_tags()`` 以及模板过滤器 ``removetags`` 已被弃用，因为它们无法保证安全的输出。它们的存在可能会导致在安全敏感的上下文中使用它们，而实际上它们并不安全。

source: The unused and undocumented ``django.utils.html.strip_entities()`` function has also been deprecated.
id: Fungsi ``django.utils.html.strip_entities()`` tidak digunakan dan tidak terdokumentasikan juga telah diusangkan.
zh_hans: 未使用且未记录的 ``django.utils.html.strip_entities()`` 函数也已被弃用。

source: ``is_admin_site`` argument to ``django.contrib.auth.views.password_reset()``
id: ``is_admin_site`` argumen ke ``django.contrib.auth.views.password_reset()``
zh_hans: ``django.contrib.auth.views.password_reset()`` 的 ``is_admin_site`` 参数

source: It's a legacy option that should no longer be necessary.
id: Itu adalah pilihan warisan yang harus tidak lagi dibutuhkan.
zh_hans: 这是一个遗留选项，应该不再需要。

source: ``django.db.models.fields.subclassing.SubfieldBase`` has been deprecated and will be removed in Django 1.10. Historically, it was used to handle fields where type conversion was needed when loading from the database, but it was not used in ``.values()`` calls or in aggregates. It has been replaced with :meth:`~django.db.models.Field.from_db_value`.
id: ``django.db.models.fields.subclassing.SubfieldBase`` telah diusangkan dan akan dipindahkan di Django 1.10. Secara riwayat, itu telah digunakan untuk menangani bidang-bidang dimana perubahan jenis dibutuhkan ketika memuat dari basisdata, tetapi itu tidak digunakan di pemanggilan ``.values()`` atau di pengumpulan. Itu telah diganti dengan :meth:`~django.db.models.Field.from_db_value`.
zh_hans: ``django.db.models.fields.subclassing.SubfieldBase`` 已被弃用，并将在 Django 1.10 中删除。从历史上看，它用于处理需要在从数据库加载时进行类型转换的字段，但在 ``.values()`` 调用或聚合中不使用。它已被 :meth:`~django.db.models.Field.from_db_value` 替代。

source: The new approach doesn't call the :meth:`~django.db.models.Field.to_python` method on assignment as was the case with ``SubfieldBase``. If you need that behavior, reimplement the ``Creator`` class `from Django's source code <https://github.com/django/django/blob/stable/1.8.x/django/db/models/fields/subclassing.py#L31-L44>`_ in your project.
id: Pendekatan baru tidak memanggil metode :meth:`~django.db.models.Field.to_python` pada penugasan seperti dulu kasus dengan ``SubfieldBase``. Jika anda butuh perilaku itu, terapkan kembali kelas ``Creator`` `from Django's source code <https://github.com/django/django/blob/stable/1.8.x/django/db/models/fields/subclassing.py#L31-L44>`_ di proyek anda.
zh_hans: 新的方法在赋值时不会调用 :meth:`~django.db.models.Field.to_python` 方法，就像 ``SubfieldBase`` 的情况一样。如果你需要这个行为，请在你的项目中重新实现 ``Creator`` 类，可以从 Django 的源代码中获取 `链接 <https://github.com/django/django/blob/stable/1.8.x/django/db/models/fields/subclassing.py#L31-L44>`_。

source: The ``django.utils.checksums`` module has been deprecated and will be removed in Django 1.10. The functionality it provided (validating checksum using the Luhn algorithm) was undocumented and not used in Django. The module has been moved to the :pypi:`django-localflavor` package (version 1.1+).
zh_hans: ``django.utils.checksums`` 模块已被弃用，并将在 Django 1.10 中删除。它提供的功能（使用 Luhn 算法验证校验和）未经文档化，并且在 Django 中未被使用。该模块已被移动到 :pypi:`django-localflavor` 包中（版本 1.1+）。

source: The ``original_content_type_id`` attribute on ``InlineAdminForm`` has been deprecated and will be removed in Django 1.10. Historically, it was used to construct the "view on site" URL. This URL is now accessible using the ``absolute_url`` attribute of the form.
id: Atribut ``original_content_type_id`` pada ``InlineAdminForm`` telah diusangkan dan akan dipindahkan di Django 1.10. Secara riwayat, dia digunakan untuk membangun URL ``InlineAdminForm``. URL ini sekarang dapat diakses menggunakan atribut ``absolute_url`` pada formulir.
zh_hans: ``InlineAdminForm`` 上的 ``original_content_type_id`` 属性已被弃用，并将在 Django 1.10 中删除。从历史上看，它用于构建“查看网站上的内容” URL。现在可以使用表单的 ``absolute_url`` 属性访问此 URL。

source: ``django.views.generic.edit.FormMixin.get_form()``’s ``form_class`` argument
zh_hans: ``django.views.generic.edit.FormMixin.get_form()`` 方法的 ``form_class`` 参数

source: ``FormMixin`` subclasses that override the ``get_form()`` method should make sure to provide a default value for the ``form_class`` argument since it's now optional.
id: Subkelas ``FormMixin`` yang menimpa metode ``get_form()`` harus memastikan menyediakan nilai awal untuk argumen ``form_class`` sejak itu sekarang menjadi pilihan.
zh_hans: ``FormMixin`` 的子类在重写 ``get_form()`` 方法时，应确保为 ``form_class`` 参数提供默认值，因为它现在是可选的。

source: Rendering templates loaded by :func:`~django.template.loader.get_template()` with a :class:`~django.template.Context`
id: Membangun cetakan dimuat oleh :func:`~django.template.loader.get_template()` dengan :class:`~django.template.Context`
zh_hans: 使用 :func:`~django.template.loader.get_template()` 加载的模板进行渲染，需要使用 :class:`~django.template.Context`。

source: The return type of :func:`~django.template.loader.get_template()` has changed in Django 1.8: instead of a :class:`django.template.Template`, it returns a ``Template`` instance whose exact type depends on which backend loaded it.
id: Jenis kembalian dari :func:`~django.template.loader.get_template()` telah berubah di Django 1.8: sebagai gantinya :class:`django.template.Template`, itu mengembalikan instance ``Template`` yang jenis tepatnya bergantung pada backend mana itu dimuat.
zh_hans: 在 Django 1.8 中，:func:`~django.template.loader.get_template()` 的返回类型已更改：不再返回 :class:`django.template.Template`，而是返回一个 ``Template`` 实例，其确切类型取决于加载它的后端。

source: Both classes provide a ``render()`` method, however, the former takes a :class:`django.template.Context` as an argument while the latter expects a :class:`dict`. This change is enforced through a deprecation path for Django templates.
id: Kedua kelas menyediakan metode ``render()``, bagaimanapun, yang awal mengambil :class:`django.template.Context` sebagai sebuah argumen selagi yang terakhir mengharapkan :class:`dict`. Perubahan ini dipaksakan melalui jalur pengusangan untuk cetakan Django.
zh_hans: 这两个类都提供了一个 ``render()`` 方法，然而，前者接受一个 :class:`django.template.Context` 作为参数，而后者期望一个 :class:`dict`。这个更改是通过 Django 模板的弃用路径来强制执行的。

source: All this also applies to :func:`~django.template.loader.select_template()`.
id: Semua ini juga berlaku ke :func:`~django.template.loader.select_template()`.
zh_hans: 所有这些也适用于 :func:`~django.template.loader.select_template()`。

source: :class:`~django.template.Template` and :class:`~django.template.Context` classes in template responses
id: Kelas-kelas :class:`~django.template.Template` dan :class:`~django.template.Context` di cetakan tanggapan
zh_hans: 在模板响应中使用 :class:`~django.template.Template` 和 :class:`~django.template.Context` 类。

source: Some methods of :class:`~django.template.response.SimpleTemplateResponse` and :class:`~django.template.response.TemplateResponse` accepted :class:`django.template.Context` and :class:`django.template.Template` objects as arguments. They should now receive :class:`dict` and backend-dependent template objects respectively.
id: Beberapa metode dari :class:`~django.template.response.SimpleTemplateResponse` dan :class:`~django.template.response.TemplateResponse` diterima obyek :class:`django.template.Context` dan :class:`django.template.Template` sebagai argumen. Mereka seharusnya menerima :class:`dict` dan tergantung-backend obyek cetakan masing-masing.
zh_hans: :class:`~django.template.response.SimpleTemplateResponse` 和 :class:`~django.template.response.TemplateResponse` 的一些方法以前接受 :class:`django.template.Context` 和 :class:`django.template.Template` 对象作为参数。现在它们应该分别接收 :class:`dict` 和依赖于后端的模板对象。

source: This also applies to the return types if you have subclassed either template response class.
id: Ini juga berlaku pada jenis kembalian jika anda mempunyai subkelas antara cetakan kelas tanggapan.
zh_hans: 如果您已经对模板响应类进行了子类化，这也适用于返回类型。

source: Check the :doc:`template response API documentation </ref/template-response>` for details.
id: Periksa :doc:`template response API documentation </ref/template-response>` untuk rincian.
zh_hans: 请查看 :doc:`模板响应 API 文档 </ref/template-response>` 获取详细信息。

source: ``current_app`` argument of template-related APIs
id: Argumen ``current_app`` dari API cetakan-terkait
zh_hans: 与模板相关的 API 中的 ``current_app`` 参数

source: The following functions and classes will no longer accept a ``current_app`` parameter to set an URL namespace in Django 1.10:
id: Fungsi dan kelas berikut tidak akan lagi menerima parameter ``current_app`` untuk menyetel namespace URL di Django 1.10:
zh_hans: 以下函数和类将不再接受 ``current_app`` 参数来设置 Django 1.10 中的 URL 命名空间：

source: Set ``request.current_app`` instead, where ``request`` is the first argument to these functions or classes. If you're using a plain ``Context``, use a ``RequestContext`` instead.
id: Setel ``request.current_app`` sebagai gantinya, dimana ``request`` adalah argumen pertama ke fungsi atau kelas ini. Jika anda sedang menggunakan ``Context`` polos, gunakan ``RequestContext`` sebagai gantinya.
zh_hans: 请设置 ``request.current_app``，其中 ``request`` 是这些函数或类的第一个参数。如果你使用一个普通的 ``Context``，请改用 ``RequestContext``。

source: ``dictionary`` and ``context_instance`` arguments of rendering functions
id: Argumen ``dictionary`` dan ``context_instance`` dari fungsi membangun
zh_hans: 渲染函数的 ``dictionary`` 和 ``context_instance`` 参数

source: The following functions will no longer accept the ``dictionary`` and ``context_instance`` parameters in Django 1.10:
id: Fungsi berikut tidak lagi menerima parameter ``dictionary`` dan ``context_instance`` di Django 1.10:
zh_hans: 在 Django 1.10 中，以下函数将不再接受 ``dictionary`` 和 ``context_instance`` 参数：

source: Use the ``context`` parameter instead. When ``dictionary`` is passed as a positional argument, which is the most common idiom, no changes are needed.
id: Gunakan parameter ``context`` sebagai gantinya. Ketika ``dictionary`` dilewatkan sebagai argumen penempatan, yaitu dialek paling umum, tidak ada perubahan dibutuhkan.
zh_hans: 请改用 ``context`` 参数。当 ``dictionary`` 作为位置参数传递时，这是最常见的用法，无需进行更改。

source: If you're passing a :class:`~django.template.Context` in ``context_instance``, pass a :class:`dict` in the ``context`` parameter instead. If you're passing a :class:`~django.template.RequestContext`, pass the request separately in the ``request`` parameter.
id: Jika anda sedang melewatkan :class:`~django.template.Context` di ``context_instance``, lewatkan :class:`dict` di parameter ``context`` sebagai gantinya. Jika anda sedang melewatkan :class:`~django.template.RequestContext`, lewatkan permintaan secara terpisah di parameter ``request``.
zh_hans: 如果在 ``context_instance`` 中传递了 :class:`~django.template.Context`，请在 ``context`` 参数中传递一个 :class:`dict`。如果传递了 :class:`~django.template.RequestContext`，请在 ``request`` 参数中单独传递请求。

source: ``dirs`` argument of template-finding functions
id: Argumen ``dirs`` dari fungsi cetakan-pencarian
zh_hans: 模板查找函数的 ``dirs`` 参数

source: The following functions will no longer accept a ``dirs`` parameter to override ``TEMPLATE_DIRS`` in Django 1.10:
id: Fungsi berikut tidak lagi menerima parameter ``dirs`` untuk menimpa ``TEMPLATE_DIRS`` di Django 1.10:
zh_hans: 在 Django 1.10 中，以下函数将不再接受 ``dirs`` 参数来覆盖 ``TEMPLATE_DIRS``：

source: The parameter didn't work consistently across different template loaders and didn't work for included templates.
id: Parameter tidak bekerja secara tetap terhadap pemuat cetakan berbeda dan tidak bekerja untuk cetakan disertakan.
zh_hans: 该参数在不同的模板加载器之间不一致，并且在包含的模板中无法正常工作。

source: ``django.template.loader.BaseLoader`` was renamed to ``django.template.loaders.base.Loader``. If you've written a custom template loader that inherits ``BaseLoader``, you must inherit ``Loader`` instead.
id: ``django.template.loader.BaseLoader`` dinamai kembali menjadi ``django.template.loader.BaseLoader``. Jika anda sedang menulis pemuat cetakan penyesuaian yang mewarisi ``BaseLoader``, anda harus mewarisi ``Loader`` sebagai gantinya.
zh_hans: ``django.template.loader.BaseLoader`` 已更名为 ``django.template.loaders.base.Loader``。如果您编写了一个自定义的模板加载器，继承自 ``BaseLoader``，那么您必须改为继承 ``Loader``。

source: Private API ``django.test.utils.TestTemplateLoader`` is deprecated in favor of ``django.template.loaders.locmem.Loader`` and will be removed in Django 1.9.
id: API pribadi ``django.test.utils.TestTemplateLoader`` diusangkan mendukung ``django.template.loaders.locmem.Loader`` dan akan dipindahkan di Django 1.9.
zh_hans: 私有 API ``django.test.utils.TestTemplateLoader`` 已弃用，推荐使用 ``django.template.loaders.locmem.Loader``，将在 Django 1.9 中移除。

source: Support for the ``max_length`` argument on custom ``Storage`` classes
id: Mendukung untuk argumen ``max_length`` pada kelas-kelas ``Storage`` peyesuaian
zh_hans: 自定义 ``Storage`` 类上 ``max_length`` 参数的支持

source: ``Storage`` subclasses should add ``max_length=None`` as a parameter to :meth:`~django.core.files.storage.Storage.get_available_name` and/or :meth:`~django.core.files.storage.Storage.save` if they override either method. Support for storages that do not accept this argument will be removed in Django 1.10.
id: Subkelas ``Storage`` harus menambahkan ``max_length=None`` sebagai sebuah parameter pada :meth:`~django.core.files.storage.Storage.get_available_name` dan/atau :meth:`~django.core.files.storage.Storage.save` jika mereka menimpa baik metode. Dukungan untuk penyimpaan yang tidak menerima argumen ini akan dipindahkan di Django 1.10.
zh_hans: 如果自定义的 ``Storage`` 子类重写了 :meth:`~django.core.files.storage.Storage.get_available_name` 和/或 :meth:`~django.core.files.storage.Storage.save` 方法，应该将 ``max_length=None`` 添加为参数。不接受这个参数的存储支持将在 Django 1.10 中移除。

source: ``qn`` replaced by ``compiler``
id: ``qn`` diganti oleh ``compiler``
zh_hans: ``qn`` 被替换为 ``compiler``
