Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: In Django 1.9, this is fixed: if the template context has ``autoescape=True`` set (the default), then ``simple_tag`` will wrap the output of the tag function with :func:`~django.utils.html.conditional_escape`.
id: Di Django 1.9, ini diperbaiki: jika konteks cetakan mempunyai ``autoescape=True`` setel (awal) kemudian ``simple_tag`` akan membungkus keluaran dari fungsi etiket dengan :func:`~django.utils.html.conditional_escape`.
zh_hans: 在 Django 1.9 中，这个问题得到了修复：如果模板上下文设置了 ``autoescape=True`` （默认值），那么 ``simple_tag`` 将使用 :func:`~django.utils.html.conditional_escape` 包装标签函数的输出。

source: To fix your ``simple_tag``\s, it is best to apply the following practices:
id: Untuk memperbaiki ``simple_tag`` anda, itu adalah terbaik untuk memberlakukan praktik berikut:
zh_hans: 要修复您的 ``simple_tag``，最好遵循以下实践：

source: Any code that generates HTML should use either the template system or :func:`~django.utils.html.format_html`.
id: Kode apapun yang membangkitkan HTML harus menggunakan salah satu sistem cetakan atau :func:`~django.utils.html.format_html`.
zh_hans: 生成 HTML 的任何代码都应该使用模板系统或 :func:`~django.utils.html.format_html`。

source: If the output of a ``simple_tag`` needs escaping, use :func:`~django.utils.html.escape` or :func:`~django.utils.html.conditional_escape`.
id: Jika keluaran dari ``simple_tag`` butuh meloloskan, gunakan :func:`~django.utils.html.escape` atau :func:`~django.utils.html.conditional_escape`.
zh_hans: 如果 ``simple_tag`` 的输出需要转义，请使用 :func:`~django.utils.html.escape` 或 :func:`~django.utils.html.conditional_escape`。

source: If you are absolutely certain that you are outputting HTML from a trusted source (e.g. a CMS field that stores HTML entered by admins), you can mark it as such using :func:`~django.utils.safestring.mark_safe`.
id: Jika anda benar-benar yakin bahwa anda sedang mengeluarkan HTML dari sumber terpercaya (sebagai contoh bidang CMS yang menyimpan HTML dimasukkan oleh admin), anda dapat menandai itu saja menggunakan :func:`~django.utils.safestring.mark_safe`.
zh_hans: 如果您绝对确定您正在输出来自可信源的 HTML（例如，由管理员输入的 HTML 存储在 CMS 字段中），您可以使用 :func:`~django.utils.safestring.mark_safe` 来标记它。

source: Tags that follow these rules will be correct and safe whether they are run on Django 1.9+ or earlier.
id: Etiket yang mengikuti aturan ini akan benar dan aman apakah mereka mereka berjalan di Django 1.9+ atau paling awal.
zh_hans: 遵循这些规则的标签无论在 Django 1.9+ 还是之前的版本上运行，都将是正确和安全的。

source: :attr:`Paginator.page_range <django.core.paginator.Paginator.page_range>` is now an iterator instead of a list.
id: :attr:`Paginator.page_range <django.core.paginator.Paginator.page_range>` sekarang sebuah perulangan daripada sebuah daftar.
zh_hans: :attr:`Paginator.page_range <django.core.paginator.Paginator.page_range>` 现在是一个迭代器而不是一个列表。

source: In versions of Django previous to 1.8, ``Paginator.page_range`` returned a ``list`` in Python 2 and a ``range`` in Python 3. Django 1.8 consistently returned a list, but an iterator is more efficient.
id: Di versi dari Django sebelum 1.8, ``Paginator.page_range`` mengembalikan sebuah ``list`` di Python 2 dan ``range`` di Python 3. Django 1.8 terus-menerus mengembalikan sebuah daftar, tetapi sebuah perulang adalah lebih efesien.
zh_hans: 在 Django 1.8 之前的版本中，``Paginator.page_range`` 在 Python 2 中返回一个 ``list``，在 Python 3 中返回一个 ``range``。Django 1.8 一致返回一个列表，但迭代器更有效率。

source: Existing code that depends on ``list`` specific features, such as indexing, can be ported by converting the iterator into a ``list`` using ``list()``.
id: Kode yang ada yang bergantung pada fitus khusus ``list``, seperti pengindeksan, dapat dihubungkan dengan merubah perulang kedalam sebuah ``list`` menggunakan ``list()``.
zh_hans: 依赖于 ``list`` 特定功能（如索引）的现有代码可以通过使用 ``list()`` 将迭代器转换为 ``list`` 来迁移。

source: Implicit ``QuerySet`` ``__in`` lookup removed
id: ``QuerySet`` tersirat ``__in`` pencarian dipindahkan
zh_hans: 隐式的 ``QuerySet`` ``__in`` 查询已移除

source: In earlier versions, queries such as::
id: Di versi paling awal, permintaan seperti::
zh_hans: 在早期版本中，类似以下的查询：

source: would implicitly convert to::
id: akan tidak langsung berubah ke::
zh_hans: 会隐式转换为：

source: resulting in SQL like ``"related_id IN (SELECT id FROM ...)"``.
id: mengembalikan dalam SQL seperti ``"related_id IN (SELECT id FROM ...)"``.
zh_hans: 这将导致 SQL 查询类似于 ``"related_id IN (SELECT id FROM ...)"``。

source: This implicit ``__in`` no longer happens so the "IN" SQL is now "=", and if the subquery returns multiple results, at least some databases will throw an error.
id: Tersirat ``__in`` ini tidak lagi terjadi jadi "IN" SQL adalah sekarang "=", dan jika sub permintaan mengembalikan hasil banyak, setidaknya beberapa basisdata akan melempar sebuah kesalahan.
zh_hans: 这种隐式的 ``__in`` 不再发生，因此 "IN" SQL 现在变成了 "=", 如果子查询返回多个结果，至少某些数据库会抛出错误。

source: ``contrib.admin`` browser support
id: Dukungan perambah ``contrib.admin``
zh_hans: ``contrib.admin`` 浏览器支持

source: The admin no longer supports Internet Explorer 8 and below, as these browsers have reached end-of-life.
id: Admin tidak lagi mendukung Internet Explorer 8 dan dibawah, ketika peramban ini telah mencapai akhir-dari-hidup.
zh_hans: 管理员不再支持 Internet Explorer 8 及以下版本，因为这些浏览器已经到达生命周期终点。

source: CSS and images to support Internet Explorer 6 and 7 have been removed. PNG and GIF icons have been replaced with SVG icons, which are not supported by Internet Explorer 8 and earlier.
id: CSS dan gambar untuk mendukung Internet Explorer 6 dan 7 telah dipindahkan. Ikon PNG dan GIF telah diganti dengan ikon SVG, yang tidak didukung oleh Internet Explorer 8 dan sebelumnya.
zh_hans: 已删除支持 Internet Explorer 6 和 7 的 CSS 和图像。 PNG 和 GIF 图标已被替换为 SVG 图标，这些图标不受 Internet Explorer 8 及更早版本的支持。

source: The jQuery library embedded in the admin has been upgraded from version 1.11.2 to 2.1.4. jQuery 2.x has the same API as jQuery 1.x, but does not support Internet Explorer 6, 7, or 8, allowing for better performance and a smaller file size. If you need to support IE8 and must also use the latest version of Django, you can override the admin's copy of jQuery with your own by creating a Django application with this structure:
zh_hans: 嵌入在管理员中的 jQuery 库已从 1.11.2 版本升级到 2.1.4 版本。 jQuery 2.x 具有与 jQuery 1.x 相同的 API，但不支持 Internet Explorer 6 、 7 或 8，从而实现更好的性能和更小的文件大小。如果您需要支持 IE8 并且必须使用最新版本的 Django，您可以通过创建具有以下结构的 Django 应用程序来覆盖管理员的 jQuery 副本：

source: ``SyntaxError`` when installing Django ``setuptools`` 5.5.x
zh_hans: 在 ``setuptools`` 5.5.x 安装 Django 时出现 ``SyntaxError`` 错误

source: When installing Django 1.9 or 1.9.1 with ``setuptools`` 5.5.x, you'll see:
zh_hans: 当使用 ``setuptools`` 5.5.x 安装 Django 1.9 或 1.9.1 时，你会看到：

source: It's safe to ignore these errors (Django will still install just fine), but you can avoid them by upgrading ``setuptools`` to a more recent version. If you're using pip, you can upgrade pip using ``python -m pip install -U pip`` which will also upgrade ``setuptools``. This is resolved in later versions of Django as described in the :doc:`/releases/1.9.2`.
zh_hans: 你可以安全地忽略这些错误（Django 仍然会正常安装），但你可以通过升级 ``setuptools`` 到一个更近期的版本来避免它们。如果你使用 pip，你可以使用 ``python -m pip install -U pip`` 来升级 pip，这也会升级 ``setuptools``。这个问题在后续版本的 Django 中已经得到解决，如 :doc:`/releases/1.9.2` 中所描述的那样。

source: The jQuery static files in ``contrib.admin`` have been moved into a ``vendor/jquery`` subdirectory.
id: Berkas-berkas tetap jQuery di ``contrib.admin`` telah dipindahkan kedalam subdirektori ``vendor/jquery``.
zh_hans: ``contrib.admin`` 中的 jQuery 静态文件已经移动到一个名为 ``vendor/jquery`` 的子目录中。

source: The text displayed for null columns in the admin changelist ``list_display`` cells has changed from ``(None)`` (or its translated equivalent) to ``-`` (a dash).
id: Teks ditampilkan untuk kolom null di daftar rubah admin sel-sel ``list_display`` telah berubah dari ``(None)`` (atau terjemahannya setara) menjadi ``-`` (sebuah tanda garis).
zh_hans: 在管理 changelist 的 ``list_display`` 单元格中，空列的显示文本已经从 ``(None)`` （或其翻译等效）更改为 ``-`` （破折号）。

source: ``django.http.responses.REASON_PHRASES`` and ``django.core.handlers.wsgi.STATUS_CODE_TEXT`` have been removed. Use Python's Standard Library instead: :data:`http.client.responses` for Python 3 and `httplib.responses`_ for Python 2.
zh_hans: ``django.http.responses.REASON_PHRASES`` 和 ``django.core.handlers.wsgi.STATUS_CODE_TEXT`` 已被移除。请改为使用 Python 标准库：对于 Python 3，使用 :data:`http.client.responses`，对于 Python 2，使用 `httplib.responses`_。

source: ``ValuesQuerySet`` and ``ValuesListQuerySet`` have been removed.
id: ``ValuesQuerySet`` dan ``ValuesListQuerySet`` telah dipindahkan.
zh_hans: ``ValuesQuerySet`` 和 ``ValuesListQuerySet`` 已被移除。

source: The ``admin/base.html`` template no longer sets ``window.__admin_media_prefix__`` or ``window.__admin_utc_offset__``. Image references in JavaScript that used that value to construct absolute URLs have been moved to CSS for easier customization. The UTC offset is stored on a data attribute of the ``<body>`` tag.
id: Cetakan ``admin/base.html`` tidak lagi menyetel ``window.__admin_media_prefix__`` atau ``window.__admin_utc_offset__``. Acuan gambar di JavaScript yang menggunakan nilai itu untuk membangun URL mutlak telah dipindahkan ke CSS untuk penyesuaian yang lebih mudah. Perimbangan UTC disimpan pada sebuah atribut data dari etiket ``<body>``.
zh_hans: ``admin/base.html`` 模板不再设置 ``window.__admin_media_prefix__`` 或 ``window.__admin_utc_offset__``。在 JavaScript 中使用该值构建绝对 URL 的图像引用已经移动到 CSS 中，以便更容易进行自定义。UTC 偏移量存储在 ``<body>`` 标签的数据属性中。

source: ``CommaSeparatedIntegerField`` validation has been refined to forbid values like ``','``, ``',1'``, and ``'1,,2'``.
id: Pengesahan ``CommaSeparatedIntegerField`` telah diolah untuk melarang nilai-nilai seperti ``','``, ``',1'``, dan ``'1,,2'``.
zh_hans: ``CommaSeparatedIntegerField`` 的验证已经更加精细化，不再允许像 ``','``、``',1'`` 和 ``'1,,2'`` 这样的值。

source: Form initialization was moved from the :meth:`ProcessFormView.get() <django.views.generic.edit.ProcessFormView.get>` method to the new :meth:`FormMixin.get_context_data() <django.views.generic.edit.FormMixin.get_context_data>` method. This may be backwards incompatible if you have overridden the ``get_context_data()`` method without calling ``super()``.
id: Inisialisasi formulir telah dipindahkan dari metode :meth:`ProcessFormView.get() <django.views.generic.edit.ProcessFormView.get>` ke metode :meth:`FormMixin.get_context_data() <django.views.generic.edit.FormMixin.get_context_data>` baru. Ini mungkin ketidaksesuaian kebelakang jika anda telah menimpa metode ``get_context_data()`` tanpa memanggil ``super()``.
zh_hans: 表单的初始化已经从 :meth:`ProcessFormView.get() <django.views.generic.edit.ProcessFormView.get>` 方法移动到新的 :meth:`FormMixin.get_context_data() <django.views.generic.edit.FormMixin.get_context_data>` 方法。如果你曾经重写了 ``get_context_data()`` 方法而没有调用 ``super()``，这可能会造成不兼容。

source: Support for PostGIS 1.5 has been dropped.
id: Dukungan untuk PostGIS 1.5 telah dibuang.
zh_hans: 不再支持 PostGIS 1.5 版本。

source: The ``django.contrib.sites.models.Site.domain`` field was changed to be :attr:`~django.db.models.Field.unique`.
id: Bidang ``django.contrib.sites.models.Site.domain`` telah dirubah menjadi :attr:`~django.db.models.Field.unique`.
zh_hans: ``django.contrib.sites.models.Site.domain`` 字段已更改为 :attr:`~django.db.models.Field.unique`。

source: In order to enforce test isolation, database queries are not allowed by default in :class:`~django.test.SimpleTestCase` tests anymore. You can disable this behavior by setting the ``allow_database_queries`` class attribute to ``True`` on your test class.
zh_hans: 为了强制执行测试隔离，现在默认情况下在 :class:`~django.test.SimpleTestCase` 测试中不允许数据库查询。你可以通过在测试类上设置 ``allow_database_queries`` 类属性为 ``True`` 来禁用这个行为。

source: ``ResolverMatch.app_name`` was changed to contain the full namespace path in the case of nested namespaces. For consistency with ``ResolverMatch.namespace``, the empty value is now an empty string instead of ``None``.
id: ``ResolverMatch.app_name`` telah dirubah untuk mengandung jalur namespace penuh dalam aksus dari namespace bersarang. Untuk kemantapan dengan ``ResolverMatch.namespace``, nilai kosong adalah sekarang sebuah string kosong sebagai gantinya ``None``.
zh_hans: ``ResolverMatch.app_name`` 已更改，现在在嵌套命名空间的情况下包含完整的命名空间路径。为了与 ``ResolverMatch.namespace`` 保持一致，现在空值是一个空字符串而不是 ``None``。

source: For security hardening, session keys must be at least 8 characters.
id: Untuk memperkeras keamanan, kunci sesi harus setidaknya 8 karakter.
zh_hans: 为了增强安全性，会话密钥必须至少为 8 个字符。

source: Private function ``django.utils.functional.total_ordering()`` has been removed. It contained a workaround for a ``functools.total_ordering()`` bug in Python versions older than 2.7.3.
id: Fungsi pribadi ``django.utils.functional.total_ordering()`` telah dipindahkan. Itu mengandung sebuah pemecahan untuk kesalahan ``functools.total_ordering()`` di Python versi lebih lama dari 2.7.3.
zh_hans: 已移除私有函数 ``django.utils.functional.total_ordering()``。它包含了对于早于 Python 2.7.3 版本中 ``functools.total_ordering()`` bug 的一个解决方法。

source: XML serialization (either through :djadmin:`dumpdata` or the syndication framework) used to output any characters it received. Now if the content to be serialized contains any control characters not allowed in the XML 1.0 standard, the serialization will fail with a :exc:`ValueError`.
id: Serialisasi XML (antara melalui :djadmin:`dumpdata` atau the syndication framework) digunakan untuk mengeluarkan karakter apapun itu terima. Sekarang jika isi untuk diserialisasikan mengandung karakter kendali apapun tidak diizinkan di standar XML 1.0, serialisasi akan gagal dengan sebuah :exc:`ValueError`.
zh_hans: XML 序列化（通过 :djadmin:`dumpdata` 或 syndication 框架）曾经会输出它接收到的任何字符。现在，如果要序列化的内容包含 XML 1.0 标准不允许的控制字符，序列化将会失败并引发 :exc:`ValueError`。

source: :class:`~django.forms.CharField` now strips input of leading and trailing whitespace by default. This can be disabled by setting the new :attr:`~django.forms.CharField.strip` argument to ``False``.
id: :class:`~django.forms.CharField` sekarang mengupas masukan dari awalan dan buntutan ruang kosong secara awalan. Ini dapat ditiadakan dengan mengatur argumen :attr:`~django.forms.CharField.strip` baru menjadi ``False``.
zh_hans: 现在，默认情况下，:class:`~django.forms.CharField` 会自动去除输入的前导和尾随空白。你可以通过将新的 :attr:`~django.forms.CharField.strip` 参数设置为 ``False`` 来禁用这个功能。

source: Template text that is translated and uses two or more consecutive percent signs, e.g. ``"%%"``, may have a new ``msgid`` after ``makemessages`` is run (most likely the translation will be marked fuzzy). The new ``msgid`` will be marked ``"#, python-format"``.
zh_hans: 在翻译并使用两个或更多连续百分号的模板文本，例如 ``"%%"``，在运行 ``makemessages`` 后可能会有一个新的 ``msgid`` （很可能翻译会被标记为模糊）。新的 ``msgid`` 将被标记为 ``"#, python-format"``。

source: If neither :attr:`request.current_app <django.http.HttpRequest.current_app>` nor :class:`Context.current_app <django.template.Context>` are set, the :ttag:`url` template tag will now use the namespace of the current request. Set ``request.current_app`` to ``None`` if you don't want to use a namespace hint.
id: Jika tidak ada :attr:`request.current_app <django.http.HttpRequest.current_app>` maupun :class:`Context.current_app <django.template.Context>` disetel, etiket cetakan :ttag:`url` akan sekarang menggunakan namespace dari permintaan saat ini. Setel ``request.current_app`` menjadi ``None`` jika anda tidak ingin menggunakan petunjuk namespace.
zh_hans: 如果既没有设置 :attr:`request.current_app <django.http.HttpRequest.current_app>`，也没有设置 :class:`Context.current_app <django.template.Context>`，那么 :ttag:`url` 模板标签现在将使用当前请求的命名空间。如果不想使用命名空间提示，请将 ``request.current_app`` 设置为 ``None``。

source: The :setting:`SILENCED_SYSTEM_CHECKS` setting now silences messages of all levels. Previously, messages of ``ERROR`` level or higher were printed to the console.
id: Pengaturan :setting:`SILENCED_SYSTEM_CHECKS` sekarang pesan diam dari semua tingkatan. Sebelumnya, pesan dari tingkat ``ERROR`` atau lebih tinggi dicetak ke konsol.
zh_hans: :setting:`SILENCED_SYSTEM_CHECKS` 设置现在会禁止所有级别的消息。以前，``ERROR`` 级别或更高级别的消息会打印到控制台。

source: The ``FlatPage.enable_comments`` field is removed from the ``FlatPageAdmin`` as it's unused by the application. If your project or a third-party app makes use of it, :ref:`create a custom ModelAdmin <flatpages-admin>` to add it back.
id: Bidang ``FlatPage.enable_comments`` dipindahkan dari ``FlatPageAdmin`` ketika itu tidak digunakan oleh aplikasi. Jika proyek anda atau aplikasi pihak-ketiga menggunakannya, :ref:`create a custom ModelAdmin <flatpages-admin>` untuk menambahkan itu kembali.
zh_hans: ``FlatPage.enable_comments`` 字段已从 ``FlatPageAdmin`` 中移除，因为它未被应用程序使用。如果你的项目或第三方应用程序使用它，请 :ref:`创建一个自定义的 ModelAdmin <flatpages-admin>` 来将其添加回去。

source: The return value of :meth:`~django.test.runner.DiscoverRunner.setup_databases` and the first argument of :meth:`~django.test.runner.DiscoverRunner.teardown_databases` changed. They used to be ``(old_names, mirrors)`` tuples. Now they're just the first item, ``old_names``.
id: Nilai kembalian dari :meth:`~django.test.runner.DiscoverRunner.setup_databases` dan argumen pertama dari :meth:`~django.test.runner.DiscoverRunner.teardown_databases` berubah. Mereka dulu tuple ``(old_names, mirrors)``. Sekarang mereka hanya barang pertama, ``old_names``.
zh_hans: :meth:`~django.test.runner.DiscoverRunner.setup_databases` 的返回值和 :meth:`~django.test.runner.DiscoverRunner.teardown_databases` 的第一个参数已经改变。它们以前是 ``(old_names, mirrors)`` 元组，现在它们只是第一个项目，即 ``old_names``。

source: By default :class:`~django.test.LiveServerTestCase` attempts to find an available port in the 8081-8179 range instead of just trying port 8081.
id: Secara awalan :class:`~django.test.LiveServerTestCase` berusaha menemukan port tersedia di jangkauan 8081-8179 sebagai gantinya dari hanya mencoba port 8081.
zh_hans: 默认情况下，:class:`~django.test.LiveServerTestCase` 尝试在 8081-8179 范围内查找可用端口，而不仅仅是尝试端口 8081。

source: The system checks for :class:`~django.contrib.admin.ModelAdmin` now check instances rather than classes.
id: Sistem pemeriksaan untuk :class:`~django.contrib.admin.ModelAdmin` sekarang memeriksa instance daripada kelas-kelas.
zh_hans: 现在，对于 :class:`~django.contrib.admin.ModelAdmin` 的系统检查会检查实例而不是类。

source: The private API to apply mixed migration plans has been dropped for performance reasons. Mixed plans consist of a list of migrations where some are being applied and others are being unapplied.
id: API pribadi untuk memberlakukan rencana perpindahan campuran telah dibuang untuk alasan penampilan. Perpindahan campuran terdiri dari sebuah daftar perpindahan dimana beberapa sedang diberlakukan dan lainnya tidak diberlakukan.
zh_hans: 出于性能原因，已经移除了应用混合迁移计划的私有 API 。混合计划包括一系列迁移，其中一些正在应用，而其他一些正在取消应用。

source: The related model object descriptor classes in ``django.db.models.fields.related`` (private API) are moved from the ``related`` module to ``related_descriptors`` and renamed as follows:
id: Kelas-kelas penggambar obyek yang terkait di ``django.db.models.fields.related`` (API pribadi) dipindahkan dari modul ``related`` ke ``related_descriptors`` dan dinamai sebagai berikut:
zh_hans: 位于 ``django.db.models.fields.related`` （私有 API）中的相关模型对象描述符类已经从 ``related`` 模块移动到 ``related_descriptors``，并且被重命名如下：

source: ``ReverseSingleRelatedObjectDescriptor`` is ``ForwardManyToOneDescriptor``
id: `ReverseSingleRelatedObjectDescriptor`` adalah ``ForwardManyToOneDescriptor``
zh_hans: ``ReverseSingleRelatedObjectDescriptor`` 是 ``ForwardManyToOneDescriptor``

source: ``SingleRelatedObjectDescriptor`` is ``ReverseOneToOneDescriptor``
id: ``SingleRelatedObjectDescriptor`` adalah ``ReverseOneToOneDescriptor``
zh_hans: ``SingleRelatedObjectDescriptor`` 是 ``ReverseOneToOneDescriptor``

source: ``ForeignRelatedObjectsDescriptor`` is ``ReverseManyToOneDescriptor``
id: ``ForeignRelatedObjectsDescriptor`` adalah ``ReverseManyToOneDescriptor``
zh_hans: ``ForeignRelatedObjectsDescriptor`` 是 ``ReverseManyToOneDescriptor``

source: ``ManyRelatedObjectsDescriptor`` is ``ManyToManyDescriptor``
id: ``ManyRelatedObjectsDescriptor`` adalah ``ManyToManyDescriptor``
zh_hans: ``ManyRelatedObjectsDescriptor`` 是 ``ManyToManyDescriptor``

source: If you implement a custom :data:`~django.conf.urls.handler404` view, it must return a response with an HTTP 404 status code. Use :class:`~django.http.HttpResponseNotFound` or pass ``status=404`` to the :class:`~django.http.HttpResponse`. Otherwise, :setting:`APPEND_SLASH` won't work correctly with ``DEBUG=False``.
id: Jika anda menerapkan sebuah penyesuaian tampilan :data:`~django.conf.urls.handler404`, itu harus mengembalikan sebuah tanggapan dengan kode keadaan HTTP 404. Gunakan :class:`~django.http.HttpResponseNotFound` atau lewatkan ``status=404`` ke :class:`~django.http.HttpResponse`. Jika tidak :setting:`APPEND_SLASH` tidak akan bekerja dengan benar dengan ``DEBUG=False``.
zh_hans: 如果你实现了自定义的 :data:`~django.conf.urls.handler404` 视图，它必须返回一个带有 HTTP 404 状态代码的响应。使用 :class:`~django.http.HttpResponseNotFound` 或将 ``status=404`` 传递给 :class:`~django.http.HttpResponse`。否则，在 ``DEBUG=False`` 的情况下，:setting:`APPEND_SLASH` 不会正确工作。

source: Features deprecated in 1.9
id: Fitur usang di 1.9
zh_hans: 在 1.9 中被废弃的功能

source: Django 1.4 added the ``assignment_tag`` helper to ease the creation of template tags that store results in a template variable. The :meth:`~django.template.Library.simple_tag` helper has gained this same ability, making the ``assignment_tag`` obsolete. Tags that use ``assignment_tag`` should be updated to use ``simple_tag``.
id: Django 1.4 menambahkan pembantu ``assignment_tag`` untuk memudahkan pembuatan dari etiket cetakan tang menyimpan hasil di variabel cetakan. Pembantu :meth:`~django.template.Library.simple_tag` telah mendapatkan kemampuan sama ini, membuat ``assignment_tag`` usang. Etiket yang menggunakan ``assignment_tag`` harus diperbaharui untuk menggunakan ``simple_tag``.
zh_hans: Django 1.4 版本添加了 ``assignment_tag`` 辅助函数，以简化在模板变量中存储结果的模板标签的创建。:meth:`~django.template.Library.simple_tag` 辅助函数也具备了相同的功能，因此使得 ``assignment_tag`` 已经过时。使用 ``assignment_tag`` 的标签应该更新为使用 ``simple_tag``。

source: ``{% cycle %}`` syntax with comma-separated arguments
id: Sintaksis `{% cycle %}`` dengan argumen dipisah-koma
zh_hans: ``{% cycle %}`` 语法可以接受逗号分隔的参数

source: The :ttag:`cycle` tag supports an inferior old syntax from previous Django versions:
id: Etiket :ttag:`cycle` mendukung sintaksis lama rendah dari versi Django sebelumnya:
zh_hans: :ttag:`cycle` 标签支持来自先前 Django 版本的旧语法：

source: Its parsing caused bugs with the current syntax, so support for the old syntax will be removed in Django 1.10 following an accelerated deprecation.
id: Penguraiannya menyebabkan kesalahan dengan sintaksis saat ini, jadi dukungan untuk sintaksis lama akan dipindahkan di Django 1.10 mengikuti percepatan pengusangan.
zh_hans: 使用旧语法会导致解析错误，因此在加速弃用后，将在 Django 1.10 中删除对旧语法的支持。

source: ``ForeignKey`` and ``OneToOneField`` ``on_delete`` argument
id: Argumen ``ForeignKey`` dan ``OneToOneField`` ``on_delete``
zh_hans: ``ForeignKey`` 和 ``OneToOneField`` 的 ``on_delete`` 参数

source: In order to increase awareness about cascading model deletion, the ``on_delete`` argument of ``ForeignKey`` and ``OneToOneField`` will be required in Django 2.0.
id: Untuk meningkatkan kesadaran tentang penghapusan model ke bawah, argumen ``on_delete`` dari ``ForeignKey`` dan ``OneToOneField`` akan diwajibkan di Django 2.0.
zh_hans: 为了增加对级联模型删除的认知，在 Django 2.0 中将要求在 ``ForeignKey`` 和 ``OneToOneField`` 中使用 ``on_delete`` 参数。
