Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a race condition in ``BaseCache.get_or_set()`` (:ticket:`26332`). It now returns the ``default`` value instead of ``False`` if there's an error when trying to add the value to the cache.
id: Diperbaiki kondisi jarang di ``BaseCache.get_or_set()`` (:ticket:`26332`). Itu mengembalikan nilai ``default`` daripada ``False`` jika ada sebuah kesalahan ketika mencoba menambahkan nilai ke cache.
zh_hans: 修复了 ``BaseCache.get_or_set()`` 中的竞争条件（:ticket:`26332`）。如果尝试将值添加到缓存时出现错误，它现在返回 ``default`` 值而不是 ``False``。

source: The forms in ``contrib.auth`` no longer strip trailing and leading whitespace from the password fields (:ticket:`26334`). The change requires users who set their password to something with such whitespace after a site updated to Django 1.9 to reset their password. It provides backwards-compatibility for earlier versions of Django.
id: Formulir di ``contrib.auth`` tidak lagi melucuti ruang kosong buntutan dan terkemuka dari bidang sandi (:ticket:`26334`). Perubahan membutuhkan pengguna yang menyetel sandi mereka ke sesuatu dengan seperti ruang kosong setelah situs diperbaharui ke Django 1.9 untuk menyetel kembali sandi mereka. Itu menyediakan kesesuaian-kebelakang untuk versi paling awal dari Django.
zh_hans: 在 ``contrib.auth`` 中的表单不再从密码字段中去除尾部和开头的空格（:ticket:`26334`）。这个更改要求在站点升级到 Django 1.9 后，将密码设置为包含这种空格的用户重新设置密码。它提供了对早期版本的 Django 的向后兼容性。

source: Fixed a memory leak in the cached template loader (:ticket:`26306`).
id: Diperbaiki sebuah kebocoran memori di pemuat cetakan cached (:ticket:`126306`).
zh_hans: 修复了缓存模板加载器中的内存泄漏问题（:ticket:`26306`）。

source: Fixed a regression that caused ``collectstatic --clear`` to fail if the storage doesn't implement ``path()`` (:ticket:`26297`).
id: Diperbaiki sebuah pemulihan yang menyebabkan ``collectstatic --clear`` menjadi gagal jika penyimpanan tidak menerapkan ``path()`` (:ticket:`26297`).
zh_hans: 修复了一个导致 ``collectstatic --clear`` 失败的回归问题，如果存储没有实现 ``path()`` （:ticket:`26297`）。

source: Fixed a crash when using a reverse lookup with a subquery when a ``ForeignKey`` has a ``to_field`` set to something other than the primary key (:ticket:`26373`).
id: Diperbaiki sebuah kegagalan ketika menggunakan pencarian kebalik dengan sub permintaan ketika ``ForeignKey`` mempunyai sebuah ``to_field`` disetel menjadi sesuatu selain dari primary key (:ticket:`26373`).
zh_hans: 修复了使用子查询进行反向查找时，当 ``ForeignKey`` 的 ``to_field`` 设置为主键之外的其他值时崩溃的问题（:ticket:`26373`）。

source: Fixed a regression in ``CommonMiddleware`` that caused spurious warnings in logs on requests missing a trailing slash (:ticket:`26293`).
id: Diperbaiki sebuah pemulihan di ``CommonMiddleware`` yang menyebabkan peringatan palsu dalam catatan pada permintaan kehilangan terkemuka garis miring (:ticket:`26293`).
zh_hans: 修复了 ``CommonMiddleware`` 中的一个回归问题，导致在缺少尾部斜杠的请求上记录不必要的警告日志（:ticket:`26293`）。

source: Fixed a regression with abstract model inheritance and explicit parent links (:ticket:`26413`).
id: Diperbaiki sebuah pemulihan dengan abstrak model warisan dan tautan induk jelas (:ticket:`26413`).
zh_hans: 修复了抽象模型继承和显式父链接的一个回归问题（:ticket:`26413`）。

source: Fixed a migrations crash on SQLite when renaming the primary key of a model containing a ``ForeignKey`` to ``'self'`` (:ticket:`26384`).
id: Diperbaiki sebuah kegagalan perpindahan di SQLite ketika menamai kembali primary key dari sebuah model mengandung ``ForeignKey`` menjadi ``'self'`` (:ticket:`26384`).
zh_hans: 修复了在 SQLite 上重命名包含 ``ForeignKey`` 到 ``'self'`` 的模型的主键时引发迁移崩溃的问题（:ticket:`26384`）。

source: Fixed ``JSONField`` inadvertently escaping its contents when displaying values after failed form validation (:ticket:`25532`).
id: Diperbaiki ``JSONField`` tidak sengaja meloloskan isinya ketika menampilkan nilai-nilai setelah gagal pengesahan formulir (:ticket:`25532`).
zh_hans: 修复了在表单验证失败后显示 ``JSONField`` 值时不小心转义其内容的问题（:ticket:`25532`）。

source: Django 1.9.6 release notes
id: Catatan terbitan Django 1.9.6
zh_hans: Django 1.9.6 版本发行说明

source: Django 1.9.6 fixes several bugs in 1.9.5.
id: Django 1.9.6 memperbaiki beberapa kesalahan di 1.9.5.
zh_hans: Django 1.9.6 修复了 1.9.5 中的几个错误。

source: Added support for relative path redirects to the test client and to ``SimpleTestCase.assertRedirects()`` because Django 1.9 no longer converts redirects to absolute URIs (:ticket:`26428`).
id: Ditambahkan dukungan untuk pengalihan jalur relatif pada klien percobaan dan pada ``SimpleTestCase.assertRedirects()`` karena Django 1.9 tidak lagi merubah pengalihan menjadi URI mutlak (:ticket:`26428`).
zh_hans: 添加了对相对路径重定向的支持，以及对于 ``SimpleTestCase.assertRedirects()``，因为 Django 1.9 不再将重定向转换为绝对 URI（:ticket:`26428`）。

source: Prevented ``makemigrations`` from generating infinite migrations for a model field that references a ``functools.partial`` (:ticket:`26475`).
id: Dicegah ``makemigrations`` dari membangkitkan perpindahan taak terbatas untuk sebuah bidang model yang mengacu sebuah ``functools.partial`` (:ticket:`26475`).
zh_hans: 阻止 ``makemigrations`` 为引用了 ``functools.partial`` 的模型字段生成无限迁移 (:ticket:`26475`)。

source: Fixed a regression where ``SessionBase.pop()`` returned ``None`` rather than raising a ``KeyError`` for nonexistent values (:ticket:`26520`).
id: Diperbaiki sebuah pemulihan dimana ``SessionBase.pop()`` mengembalikan ``None`` daripada memunculkan sebuah ``KeyError`` untuk nilai yang tidak ada (:ticket:`26520`).
zh_hans: 修复了一个回归问题，即 ``SessionBase.pop()`` 对于不存在的值返回 ``None`` 而不是引发 ``KeyError`` (:ticket:`26520`)。

source: Fixed a regression causing the cached template loader to crash when using template names starting with a dash (:ticket:`26536`).
id: Diperbaiki sebuah pemulihan menyebabkan pemuat cetakan pemyimpanan sementara gagal ketika menggunakan nama-nama cetakan dimulai dengan tanda garis (:ticket:`26536`).
zh_hans: 修复了一个回归问题，当使用以连字符开头的模板名称时，导致缓存的模板加载器崩溃 (:ticket:`26536`)。

source: Fixed a ``makemessages`` regression where temporary ``.py`` extensions were leaked in source file paths (:ticket:`26341`).
id: Diperbaiki sebuah pemulihan ``makemessages`` dimana tambahan ``.py`` sementara bocor di jalur berkas sumber (:ticket:`26341`).
zh_hans: 修复了 ``makemessages`` 的一个回归问题，其中在源文件路径中泄漏了临时的 ``.py`` 扩展名 (:ticket:`26341`)。

source: Django 1.9.7 release notes
id: Catatan terbitan Django 1.9.7
zh_hans: Django 1.9.7 版本发行说明

source: *June 4, 2016*
id: *4 Juni 2016*
zh_hans: *2016 年 6 月 4 日*

source: Django 1.9.7 fixes several bugs in 1.9.6.
id: Django 1.9.7 memperbaiki beberapa kesalahan di 1.9.6.
zh_hans: Django 1.9.7 修复了 1.9.6 版本中的一些错误。

source: Removed the need for the ``request`` context processor on the admin login page to fix a regression in 1.9 (:ticket:`26558`).
id: Dipindahkan kebutuhan untuk pengolah konteks ``request`` pada halaman masuk admin untuk memperbaiki sebuah pemulihan di `1.9 (:ticket:`26558`).
zh_hans: 移除了在管理员登录页面上需要 ``request`` 上下文处理器的需求，以修复 1.9 版本中的一个回归问题 (:ticket:`26558`)。

source: Fixed translation of password validators' ``help_text`` in forms (:ticket:`26544`).
id: Diperbaiki terjemahan dari pengesahan sandi ``help_text`` in forms (:ticket:`26544`).
zh_hans: 修复了表单中密码验证器的 ``help_text`` 翻译问题 (:ticket:`26544`)。

source: Fixed a regression causing the cached template loader to crash when using lazy template names (:ticket:`26603`).
id: Diperbaiki sebuah pemulihan menyebabkan pemuat cetakan penyimpanan sementara gagal ketika menggunakan nama-nama cetakan lazy (:ticket:`26603`).
zh_hans: 修复了一个回归问题，当使用延迟模板名称时，导致缓存的模板加载器崩溃 (:ticket:`26603`)。

source: Fixed ``on_commit`` callbacks execution order when callbacks make transactions (:ticket:`26627`).
id: Diperbaiki urutan pengerjaan callback ``on_commit`` ketika callback membuat transaksi (:ticket:`26627`).
zh_hans: 修复了在回调函数执行事务时的 ``on_commit`` 回调执行顺序问题 (:ticket:`26627`)。

source: Fixed ``HStoreField`` to raise a ``ValidationError`` instead of crashing on non-dictionary JSON input (:ticket:`26672`).
id: Diperbaiki ``HStoreField`` untuk memunculkan sebuah ``ValidationError`` daripada gagal di masukan JSON bukan-kamus (:ticket:`26672`).
zh_hans: 修复了 ``HStoreField`` 在非字典 JSON 输入时引发错误而不是崩溃的问题，现在会引发 ``ValidationError`` (:ticket:`26672`)。

source: Fixed ``dbshell`` crash on PostgreSQL with an empty database name (:ticket:`26698`).
id: Diperbaiki kegagalan ``dbshell`` pada PostgreSQL dengan nama basis data kosong (:ticket:`26698`).
zh_hans: 修复了在 PostgreSQL 上使用空数据库名称时导致 ``dbshell`` 崩溃的问题 (:ticket:`26698`)。

source: Fixed a regression in queries on a ``OneToOneField`` that has ``to_field`` and ``primary_key=True`` (:ticket:`26667`).
id: Diperbaiki sebuah pemulihan di permintaan pada ``OneToOneField`` yang mempunyai ``to_field`` dan ``primary_key=True`` (:ticket:`26667`).
zh_hans: 修复了关于具有 ``to_field`` 和 ``primary_key=True`` 的 ``OneToOneField`` 查询的回归问题 (:ticket:`26667`)。

source: Django 1.9.8 release notes
id: Catatan terbitan Django 1.9.8
zh_hans: Django 1.9.8 版本发行说明

source: Django 1.9.8 fixes a security issue and several bugs in 1.9.7.
id: Django 1.9.8 memperbaiki masalah keamanan dan beberapa kesalahan di 1.9.7.
zh_hans: Django 1.9.8 修复了 1.9.7 版本中的一个安全问题和一些错误。

source: Fixed ``makemessages`` crash on Python 2 with non-ASCII file names (:ticket:`26897`).
id: Diperbaiki kegagalan ``makemessages`` pada Python 2 dengan nama berkas bukan-ASCII (:ticket:`26897`).
zh_hans: 修复了在 Python 2 上使用非 ASCII 文件名时导致 ``makemessages`` 崩溃的问题 (:ticket:`26897`)。

source: Django 1.9.9 release notes
id: Catatan terbitan Django 1.9.9
zh_hans: Django 1.9.9 版本发行说明

source: Django 1.9.9 fixes several bugs in 1.9.8.
id: Django 1.9.9 memperbaiki beberapa kesalahan di 1.9.8.
zh_hans: Django 1.9.9 修复了 1.9.8 版本中的一些错误。

source: Fixed invalid HTML in template postmortem on the debug page (:ticket:`26938`).
id: Diperbaiki HTML tidak sah di cetakan postmortem pada halaman mencari kesalahan (:ticket:`26938`).
zh_hans: 修复了在调试页面的模板事故中出现的无效 HTML (:ticket:`26938`)。

source: Fixed some GIS database function crashes on MySQL 5.7 (:ticket:`26657`).
id: Diperbaiki beberapa fungsi tabrakan basisdata GIS pada MySQL 5.7 (:ticket:`26657`).
zh_hans: 修复了在 MySQL 5.7 上的一些 GIS 数据库函数崩溃问题 (:ticket:`26657`)。

source: Django 2.0 release notes
id: Catatan terbitan Django 2.0
zh_hans: Django 2.0 版本发行说明

source: Welcome to Django 2.0!
id: Selamat datang di Django 2.0!
zh_hans: 欢迎来到 Django 2.0 版本!

source: These release notes cover the :ref:`new features <whats-new-2.0>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-2.0>` you'll want to be aware of when upgrading from Django 1.11 or earlier. We've :ref:`dropped some features<removed-features-2.0>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-2.0>`.
id: Catatan terbitan ini melingkupi :ref:`new features <whats-new-2.0>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-2.0>` anda ingin sadari dari ketika meningkatkan dari Django 1.11 atau versi terlama. Kami telah :ref:`dropped some features <removed-features-2.0>` yang telah mencapai akhir dari siklus pengusangan mereka, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-2.0>`.
zh_hans: 这些发布说明涵盖了 :ref:`新特性 <whats-new-2.0>`，以及从 Django 1.11 或更早版本升级时需要注意的一些 :ref:`不兼容的变更 <backwards-incompatible-2.0>`。我们已经 :ref:`删除了一些已经达到了弃用周期末尾的功能 <removed-features-2.0>`，并且我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-2.0>`。

source: This release starts Django's use of a :ref:`loose form of semantic versioning <internal-release-cadence>`, but there aren't any major backwards incompatible changes that might be expected of a 2.0 release. Upgrading should be a similar amount of effort as past feature releases.
id: Terbitan ini memulai Django menggunakan a :ref:`loose form of semantic versioning <internal-release-cadence>`, tetapi tidak ada perubahan utama ketidaksesuaian kebelakang yang mungkin diharapkan dari terbitan 2.0. Peningkatan harus berupa jumlah usaha sama seperti terbitan-terbitan fitur lampau.
zh_hans: 这个发布版本开始使用了 Django 的一种 :ref:`松散形式的语义版本 <internal-release-cadence>`，但并没有出现与 2.0 版本发布相符的重大不兼容变更。升级应该与过去的功能发布相似的努力。

source: Django 2.0 supports Python 3.4, 3.5, 3.6, and 3.7. We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 2.0 支持 Python 3.4、3.5、3.6 和 3.7。我们 **强烈建议** 并且只官方支持每个系列的最新版本。

source: The Django 1.11.x series is the last to support Python 2.7.
id: Urutan DJango 1.11.x adalah terakhir untuk mendukung Python 2.7.
zh_hans: Django 1.11.x 系列是支持 Python 2.7 版本的最后一个系列。

source: Django 2.0 will be the last release series to support Python 3.4. If you plan a deployment of Python 3.4 beyond the end-of-life for Django 2.0 (April 2019), stick with Django 1.11 LTS (supported until April 2020) instead. Note, however, that the end-of-life for Python 3.4 is March 2019.
id: Django 2.0 akan menjadi urutan terbitan terakhir untuk mendukung Python 3.4. Jika anda berencana sebuah pengembangan daru Python 3.4 diluar akhir-hidup untuk Django 2.0 (April 2019), tetap dengan Django 1.11 LTS (didukung sampai April 2020) sebagai gantinya. Catat, bagaimanapun, bahwa akhir-hidup untuk Python 3.4 adalah Maret 2019.
zh_hans: Django 2.0 将是最后一个支持 Python 3.4 的发布系列。如果您计划在 Django 2.0 的生命周期结束后（2019 年 4 月）继续使用 Python 3.4，请改用 Django 1.11 LTS（支持到 2020 年 4 月）代替。请注意，Python 3.4 的生命周期将于 2019 年 3 月结束。

source: Third-party library support for older version of Django
id: Dukungan pustaka pihak-ketiga untuk versi terlama dari Django
zh_hans: 对于较旧版本的 Django 的第三方库支持

source: Following the release of Django 2.0, we suggest that third-party app authors drop support for all versions of Django prior to 1.11. At that time, you should be able to run your package's tests using ``python -Wd`` so that deprecation warnings do appear. After making the deprecation warning fixes, your app should be compatible with Django 2.0.
id: Mengikuti terbitan dari Django 2.0, kami anjurkan bahwa penulis aplikasi pihak-ketiga menjatuhkan dukungan untuk semua versi Django sebelum 1.11. Pada saat itu, anda harus dapat menjalankan percobaan paket anda menggunakan ``python -Wd`` sehingga peringatan pengusangan akan muncul. Setelah membuat perbaikan peringatan pengusangan apliaksi anda harus sesuai dengan Django 2.0.
zh_hans: 在 Django 2.0 发布之后，我们建议第三方应用程序的作者停止支持 1.11 之前的所有 Django 版本。在那个时候，你应该能够使用 ``python -Wd`` 运行你包的测试，以便弃用警告会出现。在进行弃用警告修复后，你的应用程序应该与 Django 2.0 兼容。

source: What's new in Django 2.0
id: Apa yang baru di Django 2.0
zh_hans: Django 2.0 新特性

source: Simplified URL routing syntax
id: Sintaksis perutean URL disederhanakan
zh_hans: 简化 URL 路由语法

source: The new :func:`django.urls.path()` function allows a simpler, more readable URL routing syntax. For example, this example from previous Django releases::
id: Fungsi baru :func:`django.urls.path()` mengizinkan lebih mudah, sintaksis perutean URL lebih dibaca. Sebagai contoh, contoh ini dari terbitan Django sebelumnya::
zh_hans: 新版本 :func:`django.urls.path()` 函数使用更简单易读的 URL 路由语法。一个来自 Django 旧版本的例子：

source: could be written as::
id: dapat ditulis sebagai:
zh_hans: 可以写成：

source: The new syntax supports type coercion of URL parameters. In the example, the view will receive the ``year`` keyword argument as an integer rather than as a string. Also, the URLs that will match are slightly less constrained in the rewritten example. For example, the year 10000 will now match since the year integers aren't constrained to be exactly four digits long as they are in the regular expression.
id: Sintaksis baru mendukung jenis paksaan parameter URL. Dalam contoh, tampilan akan menerima argumen katakunci ``year`` sebagai sebuah integer daripada sebuah string. Juga, URL yang akan cocok sedikit kurang dibatasi dalam penulisan kembali contoh. Sebagai contoh, tahun 10000 akan sekarang cocok karena tahun integer tidak dibatasi untuk menjadi tepat panjang empat angka ketika mereka berada di regular expression.
zh_hans: 新版本语法支持对 URL 参数的强制类型转换。在这个例子中，视图将会以数字类型接收参数 ``year`` 而不是以字符串类型。而且 URLs 的匹配限制也减少了。例如，因为参数 year 并没有像正则表达式中那样明确限制为四位数，year 为 10000 也会匹配成功。

source: The ``django.conf.urls.url()`` function from previous versions is now available as :func:`django.urls.re_path`. The old location remains for backwards compatibility, without an imminent deprecation. The old ``django.conf.urls.include()`` function is now importable from ``django.urls`` so you can use ``from django.urls import include, path, re_path`` in your URLconfs.
id: Fungsi ``django.conf.urls.url()`` dari versi sebelumnya sekarang tersedia sebagai :func:`django.urls.re_path`. Tempat lama tetap untuk kesesuaian kebelakang, tanpa sebuah pengusangan dekat. Fungsi lama ``django.conf.urls.include()`` sekarang dapat diimpor dari ``django.urls`` sehingga anda dapat menggunakan ``from django.urls import include, path, re_path`` dalam URLconf and.
zh_hans: 旧版本中的 ``django.conf.urls.url()`` 函数现在可以在 :func:`django.urls.re_path` 中获取。前者依然保留，向后兼容，并没有立即弃用。旧版本中的 ``django.conf.urls.include()`` 函数现在可以从 ``django.urls`` 中导入，这样你就可以在 URLconfs 中使用 ``from django.urls import include, path, re_path`` 。

source: The :doc:`/topics/http/urls` document is rewritten to feature the new syntax and provide more details.
id: Dokumen :doc:`/topics/http/urls` ditulis kembali untuk ditampilkan sintaksis baru dan menyediakan lebih rinci.
zh_hans: 重新编写的文档 :doc:`/topics/http/urls` 涵盖了新的语法并且提供了更多的细节。

source: Mobile-friendly ``contrib.admin``
id: ``contrib.admin`` ramah seluler
zh_hans: ``contrib.admin`` 针对移动设备的优化改进

source: The admin is now responsive and supports all major mobile devices. Older browsers may experience varying levels of graceful degradation.
id: Admin sekarang bergantian dan mendukung semua perangkat seluler utama. Peramban lama mungkin mengalami tingkaran beragam dari pengurangan yang anggun.
zh_hans: 新版本的 admin 可以响应和支持所有主流移动设备。较旧的浏览器可能会遇到不同程度的功能降低。

source: Window expressions
id: Pernyataan Window
zh_hans: Window 表达式

source: The new :class:`~django.db.models.expressions.Window` expression allows adding an ``OVER`` clause to querysets. You can use :ref:`window functions <window-functions>` and :ref:`aggregate functions <aggregation-functions>` in the expression.
id: Pernyataan baru :class:`~django.db.models.expressions.Window` mengizinkan menambahkan sebuah klausa ``OVER`` pada queryset. Anda dapat menggunakan :ref:`window functions ` dan :ref:`aggregate functions ` dalam pernyataan.
zh_hans: 新的 :class:`~django.db.models.expressions.Window` 表达式允许在查询集上添加一个 ``OVER`` 子句。你可以在这个表达式中使用 :ref:`窗口函数 <window-functions>` 和 :ref:`聚合函数 <aggregation-functions>`。

source: The new :attr:`.ModelAdmin.autocomplete_fields` attribute and :meth:`.ModelAdmin.get_autocomplete_fields` method allow using a `Select2 <https://select2.org/>`_ search widget for ``ForeignKey`` and ``ManyToManyField``.
zh_hans: 新的 :attr:`.ModelAdmin.autocomplete_fields` 属性和 :meth:`.ModelAdmin.get_autocomplete_fields` 方法允许在 ``ForeignKey`` 和 ``ManyToManyField`` 上使用 `Select2 <https://select2.org/>`_ 搜索小部件。

source: The default iteration count for the PBKDF2 password hasher is increased from 36,000 to 100,000.
id: Hitungan perulangan awalan untuk pencampur sandi PBKDF2ditingkatkan dari 36.000 menjadi 100.000.
zh_hans: PBKDF2 密码散列器的默认迭代计数从 36,000 增加到 100,000。

source: Added MySQL support for the :class:`~django.contrib.gis.db.models.functions.AsGeoJSON` function, :class:`~django.contrib.gis.db.models.functions.GeoHash` function, :class:`~django.contrib.gis.db.models.functions.IsValid` function, :lookup:`isvalid` lookup, and :ref:`distance lookups <distance-lookups>`.
id: Ditambahkan dukungan MySQL untuk fungsi :class:`~django.contrib.gis.db.models.functions.AsGeoJSON`, fungsi :class:`~django.contrib.gis.db.models.functions.GeoHash`, fungsi :class:`~django.contrib.gis.db.models.functions.IsValid`, pencarian :lookup:`isvalid`, dan :ref:`distance lookups `.
zh_hans: 增加了 :class:`~django.contrib.gis.db.models.functions.AsGeoJSON` 函数、 :class:`~django.contrib.gis.db.models.functions.GeoHash` 函数、:class:`~django.contrib.gis.db.models.functions.IsValid` 函数、:lookup:`isvalid` 查找、以及 :ref:`distance lookups <distance-lookups>` 对 MySQL 的支持。

source: Added the :class:`~django.contrib.gis.db.models.functions.Azimuth` and :class:`~django.contrib.gis.db.models.functions.LineLocatePoint` functions, supported on PostGIS and SpatiaLite.
id: Ditambahkan fungsi :class:`~django.contrib.gis.db.models.functions.Azimuth` dan :class:`~django.contrib.gis.db.models.functions.LineLocatePoint`, didukung PostGIS dan SpatiaLite.
zh_hans: 添加了 PostGIS 和 SpatiaLite 支持的两个函数 :class:`~django.contrib.gis.db.models.functions.Azimuth` 和 :class:`~django.contrib.gis.db.models.functions.LineLocatePoint`。

source: Any :class:`~django.contrib.gis.geos.GEOSGeometry` imported from GeoJSON now has its SRID set.
id: :class:`~django.contrib.gis.geos.GEOSGeometry` apapun diimpor dari GeoJSON sekarang mempunyai kumpulan SRIDnya.
zh_hans: 现在所有从 GeoJSON 导入的 :class:`~django.contrib.gis.geos.GEOSGeometry` 都设置了其 SRID。

source: Added the :attr:`.OSMWidget.default_zoom` attribute to customize the map's default zoom level.
id: Ditambahkan atribut :attr:`.OSMWidget.default_zoom` untuk menyesuaikan tingkatan awalan perbesar peta.
zh_hans: 添加了 :attr:`.OSMWidget.default_zoom` 属性来自定义地图的默认缩放级别。

source: Made metadata readable and editable on rasters through the :attr:`~django.contrib.gis.gdal.GDALRaster.metadata`, :attr:`~django.contrib.gis.gdal.GDALRaster.info`, and :attr:`~django.contrib.gis.gdal.GDALBand.metadata` attributes.
id: Dibuat metadata dapat dibaca dan dirubah pada raster melalui atribut :attr:`~django.contrib.gis.gdal.GDALRaster.metadata`, :attr:`~django.contrib.gis.gdal.GDALRaster.info`, dan :attr:`~django.contrib.gis.gdal.GDALBand.metadata`.
zh_hans: 通过 :attr:`~django.contrib.gis.gdal.GDALRaster.metadata`、:attr:`~django.contrib.gis.gdal.GDALRaster.info` 和 :attr:`~django.contrib.gis.gdal.GDALBand.metadata` 属性，使栅格数据的元数据可读可编辑。

source: Allowed passing driver-specific creation options to :class:`~django.contrib.gis.gdal.GDALRaster` objects using ``papsz_options``.
id: Diizinkan melewatkan pilihan pembuatan kemudi-tertentu pada obyek :class:`~django.contrib.gis.gdal.GDALRaster`menggunakan ``papsz_options``.
zh_hans: 允许使用 ``papsz_options`` 将 driver-specific creation options 传递给 :class:`~django.contrib.gis.gdal.GDALRaster` 对象。

source: Allowed creating :class:`~django.contrib.gis.gdal.GDALRaster` objects in GDAL's internal virtual filesystem. Rasters can now be :ref:`created from and converted to binary data <gdal-raster-vsimem>` in-memory.
id: Diizinkan membuat obyek :class:`~django.contrib.gis.gdal.GDALRaster` dalam sistem berkas internal virtual. Raster sekarang dapat :ref:`created from and converted to binary data ` dalam-memori.
zh_hans: 允许在 GDAL 的内部虚拟文件系统中创建 :class:`~django.contrib.gis.gdal.GDALRaster` 对象。现在可以将栅格数据从内存中的二进制数据 :ref:`创建和转换 <gdal-raster-vsimem>`。

source: The new :meth:`GDALBand.color_interp() <django.contrib.gis.gdal.GDALBand.color_interp>` method returns the color interpretation for the band.
id: Metode baru :meth:`GDALBand.color_interp() <django.contrib.gis.gdal.GDALBand.color_interp>`mengembalikan penafsiran warna untuk pita.
zh_hans: 新的 :meth:`GDALBand.color_interp() <django.contrib.gis.gdal.GDALBand.color_interp>` 方法返回了该波段的颜色解释。

source: The new ``distinct`` argument for :class:`~django.contrib.postgres.aggregates.ArrayAgg` determines if concatenated values will be distinct.
id: Argumen baru ``distinct`` untuk :class:`~django.contrib.postgres.aggregates.ArrayAgg` menentukan jika nilai-nilai penggabungan akan dibedakan.
zh_hans: 对于 :class:`~django.contrib.postgres.aggregates.ArrayAgg`，新的 ``distinct`` 参数确定连接的值是否是不同的。
