Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: New ``Prefetch`` object for advanced ``prefetch_related`` operations.
id: Obyek ``Prefetch`` baru untuk tindakan ``prefetch_related`` lebih lanjut.
zh_hans: 新的 ``Prefetch`` 对象用于高级的 ``prefetch_related`` 操作。

source: The new :class:`~django.db.models.Prefetch` object allows customizing prefetch operations.
id: Obyek :class:`~django.db.models.Prefetch` baru mengizinkan penyesuaian tindakan prefetch.
zh_hans: 新的 :class:`~django.db.models.Prefetch` 对象允许自定义预取操作。

source: You can specify the ``QuerySet`` used to traverse a given relation or customize the storage location of prefetch results.
id: Anda dapat menentukan ``QuerySet`` digunakan untuk melintasi hubungan yang diberikan atau menyesuaikan tempat penyimpanan dari hasil prefetch.
zh_hans: 您可以指定用于遍历特定关系的 ``QuerySet``，或者自定义预取结果的存储位置。

source: This enables things like filtering prefetched relations, calling :meth:`~django.db.models.query.QuerySet.select_related()` from a prefetched relation, or prefetching the same relation multiple times with different querysets. See :meth:`~django.db.models.query.QuerySet.prefetch_related()` for more details.
id: Ini mengadakan hal-hal seperti menyaring hubungan pengambilan, memanggil :meth:`~django.db.models.query.QuerySet.select_related()` dari hubungan pengambilan, atau pengambilan hubungan sama banyak kali dengan queryset berbeda. Lihat :meth:`~django.db.models.query.QuerySet.prefetch_related()` untuk lebih rinci.
zh_hans: 这使得可以过滤预取的关系、从预取的关系中调用 :meth:`~django.db.models.query.QuerySet.select_related()`，或者多次使用不同的查询集预取相同的关系。有关更多详细信息，请参阅 :meth:`~django.db.models.query.QuerySet.prefetch_related()`。

source: Admin shortcuts support time zones
id: Jalan pintas admin mendukung zona waktu
zh_hans: 管理快捷方式支持时区

source: The "today" and "now" shortcuts next to date and time input widgets in the admin are now operating in the :ref:`current time zone <default-current-time-zone>`. Previously, they used the browser time zone, which could result in saving the wrong value when it didn't match the current time zone on the server.
id: Jalan pintas "today" dan "now" dekat dengan widget masukan tanggal dan waktu di admin sekarang beroperasi di :ref:`current time zone <default-current-time-zone>`. Sebelumnya, mereka menggunakan zona waktu peramban, yang dapat menghasilkan dalam menyimpan nilai salah ketika itu tidak cocok zona waktu saat ini di peladen.
zh_hans: 在管理员中日期和时间输入小部件旁边的 "today" 和 "now" 快捷方式现在在 :ref:`当前时区 <default-current-time-zone>` 中运行。以前，它们使用浏览器的时区，这可能导致在时区不匹配服务器的当前时区时保存错误的值。

source: In addition, the widgets now display a help message when the browser and server time zone are different, to clarify how the value inserted in the field will be interpreted.
id: Sebagai tambahan, widget sekarang menampilkan pesna bantuan ketika peramban dan zona waktu peladen berbeda, untuk menjelaskan bagaimana nilai dimasukkan di bidang akan ditafsirkan.
zh_hans: 此外，小部件现在在浏览器和服务器时区不同时显示帮助信息，以明确解释字段中插入的值将如何被解释。

source: Using database cursors as context managers
id: Menggunakan kursor basisdata sebagai pengelola konteks
zh_hans: 使用数据库游标作为上下文管理器

source: Prior to Python 2.7, database cursors could be used as a context manager. The specific backend's cursor defined the behavior of the context manager. The behavior of magic method lookups was changed with Python 2.7 and cursors were no longer usable as context managers.
id: Sebelum Python 2.7, kursor basisdata dapat digunakan sebagai pengelola konteks. Kursor backend khusus menentukan perilaku dari pengelola konteks. Perilaku ini dari pencarian metode ajaib telah berubah dengan Python 2.7 dan kursor tidak lagi digunakan sebagai pengelola konteks.
zh_hans: 在 Python 2.7 之前，数据库游标可以用作上下文管理器。具体的后端游标定义了上下文管理器的行为。但是，Python 2.7 改变了魔术方法查找的行为，游标不再能用作上下文管理器。

source: Django 1.7 allows a cursor to be used as a context manager. That is, the following can be used::
id: Django 1.7 mengizinkan sebuah kursor digunakan sebagai pengelola konteks. Yaitu, berikut dapat digunakan::
zh_hans: Django 1.7 允许将游标用作上下文管理器。也就是说，可以使用以下方式：

source: instead of::
id: dari pada::
zh_hans: 替换成：

source: Custom lookups
id: Penyesuaian Pencarian
zh_hans: 自定义查找

source: It is now possible to write custom lookups and transforms for the ORM. Custom lookups work just like Django's built-in lookups (e.g. ``lte``, ``icontains``) while transforms are a new concept.
id: Itu sekarang memungkinkan menulis pencarian penyesuaian dan merubah untuk ORM. Pencarian penyesuaian bekerja seperti pencarian siap-pakai Django (sebagai contoh ``lte``, ``icontains``) selagi perubahan adalah konsep baru.
zh_hans: 现在可以为 ORM 编写自定义查找和转换。自定义查找与 Django 内置的查找（例如 ``lte``、``icontains``）类似，而转换是一个新概念。

source: The :class:`django.db.models.Lookup` class provides a way to add lookup operators for model fields. As an example it is possible to add ``day_lte`` operator for ``DateFields``.
id: Kelas :class:`django.db.models.Lookup` menyediakan sebuah cara untuk menambah penghubung pencarian untuk bidang model. Ketika sebuah contoh itu memungkinkan untuk menambah penghubung ``day_lte`` untuk ``DateFields``.
zh_hans: :class:`django.db.models.Lookup` 类提供了一种为模型字段添加查找运算符的方式。例如，可以为 ``DateFields`` 添加 ``day_lte`` 运算符。

source: The :class:`django.db.models.Transform` class allows transformations of database values prior to the final lookup. For example it is possible to write a ``year`` transform that extracts year from the field's value. Transforms allow for chaining. After the ``year`` transform has been added to ``DateField`` it is possible to filter on the transformed value, for example ``qs.filter(author__birthdate__year__lte=1981)``.
id: Kelas :class:`django.db.models.Transform` megnizinkan perubahan dari nilai basisdata sebelum pencarian akhir. Sebagai contoh itu memungkinkan menulis sebuah perubahan ``year`` yang mengeluarkan tahun dari nilai bidang. Perubahan mengizinkan untuk mengikat. Setelah perubahan ``year`` telah ditambahkan ke ``DateField`` itu memungkinkan untuk menyaring di nilai berubah, sebagai contoh ``qs.filter(author__birthdate__year__lte=1981)``.
zh_hans: :class:`django.db.models.Transform` 类允许在最终查找之前对数据库值进行转换。例如，可以编写一个 ``year`` 转换，从字段的值中提取年份。转换允许进行链式操作。在将 ``year`` 转换添加到 ``DateField`` 后，可以对转换后的值进行筛选，例如 ``qs.filter(author__birthdate__year__lte=1981)``。

source: For more information about both custom lookups and transforms refer to the :doc:`custom lookups </howto/custom-lookups>` documentation.
id: Untuk informasi lebih mengenai kedua penyesuaian pencarian dan perubahan mengacu ke dokumentasi :doc:`custom lookups </howto/custom-lookups>`.
zh_hans: 有关自定义查找和转换的更多信息，请参阅 :doc:`自定义查找 </howto/custom-lookups>` 文档。

source: Improvements to ``Form`` error handling
id: Perbaikan pada penanganan kesalahan ``Form``
zh_hans: 改进了 ``Form`` 错误处理

source: Previously there were two main patterns for handling errors in forms:
id: Sebelumnya ada dua pola utama untuk menangani kesalahan di formulir:
zh_hans: 以前在处理表单错误方面有两种主要模式：

source: Raising a :exc:`~django.core.exceptions.ValidationError` from within certain functions (e.g. ``Field.clean()``, ``Form.clean_<fieldname>()``, or ``Form.clean()`` for non-field errors.)
id: Memunculkan sebuah :exc:`~django.core.exceptions.ValidationError` dari dalam fungsi tertentu (sebagai contoh `Field.clean()``, ``Form.clean_<fieldname>()``, atau ``Form.clean()`` untuk kesalahan-kesalahan bukan-bidang.)
zh_hans: 在某些函数（例如 ``Field.clean()``、``Form.clean_<fieldname>()`` 或 ``Form.clean()`` 用于非字段错误的情况）中引发 :exc:`~django.core.exceptions.ValidationError`。

source: Fiddling with ``Form._errors`` when targeting a specific field in ``Form.clean()`` or adding errors from outside of a "clean" method (e.g. directly from a view).
id: Meremehkan dengan ``Form._errors`` ketika menyasar sebuah bidang khusus di ``Form.clean()`` atau menambahkan kesalahan diluar dari metode "clean" (sebagai contoh langsung dari sebuah tampilan).
zh_hans: 在 ``Form.clean()`` 中针对特定字段或在“clean”方法之外（例如直接从视图中）添加错误时，会涉及到 ``Form._errors``。

source: Using the former pattern was straightforward since the form can guess from the context (i.e. which method raised the exception) where the errors belong and automatically process them. This remains the canonical way of adding errors when possible. However the latter was fiddly and error-prone, since the burden of handling edge cases fell on the user.
id: Menggunakan pola sebelumnya adalah mudah sejak formulir dapat menebak dari konteks (yaitu metode mana memunculkan pengecualian) dimana kesalahan milik dan secara otomatis mengolah mereka. Ini tetap cara resmi dari menambah kesalahan ketika memungkinkan. Bagaimanapun terakhir adalah tipuan dan cenderung-kesalahan, sejak tanggungan dari penanganan sisi kasus jatuh di pengguna.
zh_hans: 使用前一种模式是直接的，因为表单可以根据上下文（即引发异常的方法）猜测错误的归属，并自动处理它们。这仍然是可能时添加错误的规范方式。然而，后一种模式很繁琐且容易出错，因为处理边缘情况的负担落在用户身上。

source: The new :meth:`~django.forms.Form.add_error()` method allows adding errors to specific form fields from anywhere without having to worry about the details such as creating instances of ``django.forms.utils.ErrorList`` or dealing with ``Form.cleaned_data``. This new API replaces manipulating ``Form._errors`` which now becomes a private API.
id: Metode :meth:`~django.forms.Form.add_error()` baru mengizinkan menambahkan kesalahan ke bidang formulir khusus dari manapun tanpa khawatir tentang rincian seperti membuat instance dari ``django.forms.utils.ErrorList`` atau berurusan dengan ``Form.cleaned_data``. API baru ini mengganti merubah ``Form._errors`` yang sekarang menjadi API pribadi.
zh_hans: 新的 :meth:`~django.forms.Form.add_error()` 方法允许在任何地方将错误添加到特定的表单字段，无需担心诸如创建 ``django.forms.utils.ErrorList`` 实例或处理 ``Form.cleaned_data`` 等细节。这个新的 API 取代了操作 ``Form._errors``，后者现在变成了一个私有的 API。

source: See :ref:`validating-fields-with-clean` for an example using ``Form.add_error()``.
id: Lihat :ref:`validating-fields-with-clean` untuk sebuah contoh menggunakan ``Form.add_error()``.
zh_hans: 请参阅 :ref:`使用 Form.add_error() 进行字段验证`，以获取使用 ``Form.add_error()`` 的示例。

source: Error metadata
id: Kesalahan metadata
zh_hans: 错误元数据

source: The :exc:`~django.core.exceptions.ValidationError` constructor accepts metadata such as error ``code`` or ``params`` which are then available for interpolating into the error message (see :ref:`raising-validation-error` for more details); however, before Django 1.7 those metadata were discarded as soon as the errors were added to :attr:`Form.errors <django.forms.Form.errors>`.
id: Pembangun :exc:`~django.core.exceptions.ValidationError` menerima metadata seperti kesalahan ``code`` atau ``params`` yang kemudian tersedia untuk menambahkan kedalam pesan kesalahan (lihat :ref:`raising-validation-error` untuk lebih rinci); bagaimanapun, sebelum Django 1.7 metadata tersebut dibuang segera setelah kesalahan ditambahkan ke :attr:`Form.errors <django.forms.Form.errors>`.
zh_hans: :exc:`~django.core.exceptions.ValidationError` 构造函数接受元数据，如错误 ``code`` 或 ``params``，然后可以将其插入到错误消息中（有关更多详细信息，请参阅 :ref:`raising-validation-error`）；然而，在 Django 1.7 之前，这些元数据在错误添加到 :attr:`Form.errors <django.forms.Form.errors>` 后立即被丢弃。

source: :attr:`Form.errors <django.forms.Form.errors>` and ``django.forms.utils.ErrorList`` now store the ``ValidationError`` instances so these metadata can be retrieved at any time through the new :meth:`Form.errors.as_data <django.forms.Form.errors.as_data()>` method.
id: :attr:`Form.errors <django.forms.Form.errors>` dan ``django.forms.utils.ErrorList`` sekarang menyimpan instance ``ValidationError`` sehingga metadata ini dapat diambil kapanpun melalui metode :meth:`Form.errors.as_data <django.forms.Form.errors.as_data()>` baru.
zh_hans: :attr:`Form.errors <django.forms.Form.errors>` 和 ``django.forms.utils.ErrorList`` 现在存储了 ``ValidationError`` 实例，因此可以通过新的 :meth:`Form.errors.as_data <django.forms.Form.errors.as_data()>` 方法在任何时候检索这些元数据。

source: The retrieved ``ValidationError`` instances can then be identified thanks to their error ``code`` which enables things like rewriting the error's message or writing custom logic in a view when a given error is present. It can also be used to serialize the errors in a custom format such as XML.
id: Instance ``ValidationError`` yang diambil dapat kemudian dicirikan terima kasih ke ``code`` kesalahan mereka yang mengadakan hal-hal seperti menulis kembali pesan kesalahan atau menulis penyesuaian logika di sebuah tampilan ketika kesalahan yang diberikan hadir. Itu dapat juga digunakan untuk menserialkan kesalahan di penyesuaian bentuk seperti XML.
zh_hans: 检索到的 ``ValidationError`` 实例可以通过其错误 ``code`` 进行标识，从而可以进行诸如重写错误消息或在特定错误存在时编写视图中的自定义逻辑等操作。它还可以用于以自定义格式（例如 XML）序列化错误。

source: The new :meth:`Form.errors.as_json() <django.forms.Form.errors.as_json()>` method is a convenience method which returns error messages along with error codes serialized as JSON. ``as_json()`` uses ``as_data()`` and gives an idea of how the new system could be extended.
id: Metode :meth:`Form.errors.as_json() <django.forms.Form.errors.as_json()>` baru adalah sebuah metode nyaman yang mengembalikan pesan kesalahan bersama dengan kode kesalahan diserialkan sebagai JSON. ``as_json()`` menggunakan ``as_data()`` dan memberikan sebuah ide dari bagaimana sistem baru dapat diperpanjang.
zh_hans: 新的 :meth:`Form.errors.as_json() <django.forms.Form.errors.as_json()>` 方法是一个方便的方法，它返回以 JSON 格式序列化的错误消息以及错误代码。``as_json()`` 使用了 ``as_data()``，并展示了如何扩展新系统的思路。

source: Error containers and backward compatibility
id: Wadah kesalahan dan kesesuaian kebelakang
zh_hans: 错误容器和向后兼容性

source: Heavy changes to the various error containers were necessary in order to support the features above, specifically :attr:`Form.errors <django.forms.Form.errors>`, ``django.forms.utils.ErrorList``, and the internal storages of :exc:`~django.core.exceptions.ValidationError`. These containers which used to store error strings now store ``ValidationError`` instances and public APIs have been adapted to make this as transparent as possible, but if you've been using private APIs, some of the changes are backwards incompatible; see :ref:`validation-error-constructor-and-internal-storage` for more details.
id: Perubahan berat pada beragam wadah kesalahan dibutuhkan untuk mendukung fitur diatas, khususnya :attr:`Form.errors <django.forms.Form.errors>`, ``django.forms.utils.ErrorList``, dan pengimpanan internal dari :exc:`~django.core.exceptions.ValidationError`. Wadah ini yang digunakan untuk menyimpan string kesalahan sekarang menyimpan instance ``ValidationError`` dan API umum telah disesuaikan untuk membuat ini sejernih mungkin, tetapi jika anda telah menggunakan API pribadi, beberapa dari perubahan adalah ketidaksesuaian kebelakang; lihat :ref:`validation-error-constructor-and-internal-storage` untuk lebih rinci.
zh_hans: 为了支持上述功能，需要对各种错误容器进行重大更改，特别是 :attr:`Form.errors <django.forms.Form.errors>`、``django.forms.utils.ErrorList`` 和 :exc:`~django.core.exceptions.ValidationError` 的内部存储。这些容器曾经存储错误字符串，现在存储 ``ValidationError`` 实例，并且公共 API 已经进行了适应，使这些更改尽可能透明，但如果您曾经使用过私有 API，一些更改可能不兼容向后；有关更多详细信息，请参阅 :ref:`validation-error-constructor-and-internal-storage`。

source: You can now implement :attr:`~django.contrib.admin.AdminSite.site_header`, :attr:`~django.contrib.admin.AdminSite.site_title`, and :attr:`~django.contrib.admin.AdminSite.index_title` attributes on a custom :class:`~django.contrib.admin.AdminSite` in order to easily change the admin site's page title and header text. No more needing to override templates!
id: Anda sekarang dapat menerapkan atribut :attr:`~django.contrib.admin.AdminSite.site_header`, :attr:`~django.contrib.admin.AdminSite.site_title`, dan :attr:`~django.contrib.admin.AdminSite.index_title` pada :class:`~django.contrib.admin.AdminSite` penyesuaian agar dengan mudah merubah judul halaman situs admin dan teks kepala. Tidak perlu lagi menimpa cetakan!
zh_hans: 现在可以在自定义的 :class:`~django.contrib.admin.AdminSite` 上实现 :attr:`~django.contrib.admin.AdminSite.site_header`、:attr:`~django.contrib.admin.AdminSite.site_title` 和 :attr:`~django.contrib.admin.AdminSite.index_title` 属性，以便轻松更改管理站点的页面标题和页眉文本。不再需要覆盖模板！

source: Buttons in :mod:`django.contrib.admin` now use the ``border-radius`` CSS property for rounded corners rather than GIF background images.
id: Tombol di :mod:`django.contrib.admin` sekarang menggunakan sifat CSS ``border-radius`` untuk sudut melingkar daripada gambar latar belakang GIF.
zh_hans: 在 :mod:`django.contrib.admin` 中的按钮现在使用 ``border-radius`` CSS 属性来实现圆角，而不再使用 GIF 背景图像。

source: Some admin templates now have ``app-<app_name>`` and ``model-<model_name>`` classes in their ``<body>`` tag to allow customizing the CSS per app or per model.
id: Beberapa cetakan admin sekarang mempunyai kelas-kelas ``app-<app_name>`` dan ``model-<model_name>`` di etiket ``<body>`` mereka untuk mengizinkan menyesuaikan CSS per aplikasi atau per model.
zh_hans: 一些管理模板现在在其 ``<body>`` 标签中具有 ``app-<app_name>`` 和 ``model-<model_name>`` 类，以允许按应用程序或模型自定义 CSS 样式。

source: The admin changelist cells now have a ``field-<field_name>`` class in the HTML to enable style customizations.
id: Sel-sel daftar rubah admin sekarang mempunyai sebuah kelas ``field-<field_name>`` di THML untuk mengadakan gaya penyesuaian.
zh_hans: 管理员变更列表单元格现在在 HTML 中具有 ``field-<field_name>`` 类，以启用样式自定义。

source: The admin's search fields can now be customized per-request thanks to the new :meth:`django.contrib.admin.ModelAdmin.get_search_fields` method.
id: Bidang pencarian admin sekarang dapat disesuaikan per-permintaan terima kasih ke metode :meth:`django.contrib.admin.ModelAdmin.get_search_fields` baru.
zh_hans: 现在可以通过新的 :meth:`django.contrib.admin.ModelAdmin.get_search_fields` 方法，按请求自定义管理员的搜索字段。

source: The :meth:`ModelAdmin.get_fields() <django.contrib.admin.ModelAdmin.get_fields>` method may be overridden to customize the value of :attr:`ModelAdmin.fields <django.contrib.admin.ModelAdmin.fields>`.
id: Metode :meth:`ModelAdmin.get_fields() <django.contrib.admin.ModelAdmin.get_fields>` mungkin dikesampingkan untuk menyesuaikan nilai dari :attr:`ModelAdmin.fields <django.contrib.admin.ModelAdmin.fields>`.
zh_hans: 可以重写 :meth:`ModelAdmin.get_fields() <django.contrib.admin.ModelAdmin.get_fields>` 方法来自定义 :attr:`ModelAdmin.fields <django.contrib.admin.ModelAdmin.fields>` 的值。

source: In addition to the existing ``admin.site.register`` syntax, you can use the new :func:`~django.contrib.admin.register` decorator to register a :class:`~django.contrib.admin.ModelAdmin`.
id: Sebagai tambahan pada sintaksis ``admin.site.register`` yang ada, anda dapat menggunakan penghias :func:`~django.contrib.admin.register` baru untuk mendaftar sebuah :class:`~django.contrib.admin.ModelAdmin`.
zh_hans: 除了现有的 ``admin.site.register`` 语法之外，您还可以使用新的 :func:`~django.contrib.admin.register` 装饰器来注册一个 :class:`~django.contrib.admin.ModelAdmin`。

source: You may specify :meth:`ModelAdmin.list_display_links <django.contrib.admin.ModelAdmin.list_display_links>` ``= None`` to disable links on the change list page grid.
id: Anda dapat menentukan :meth:`ModelAdmin.list_display_links <django.contrib.admin.ModelAdmin.list_display_links>` ``= None`` untuk meniadakan tautan pada jaring halaman daftar perubahan.
zh_hans: 您可以指定 :meth:`ModelAdmin.list_display_links <django.contrib.admin.ModelAdmin.list_display_links>` ``= None`` 来禁用更改列表页面网格上的链接。

source: You may now specify :attr:`ModelAdmin.view_on_site <django.contrib.admin.ModelAdmin.view_on_site>` to control whether or not to display the "View on site" link.
id: Anda dapat sekarang menentukan :attr:`ModelAdmin.view_on_site <django.contrib.admin.ModelAdmin.view_on_site>` untuk mengendalikan apakah atau tidak untuk menampilkan tautan "Lihat pada situs".
zh_hans: 现在可以指定 :attr:`ModelAdmin.view_on_site <django.contrib.admin.ModelAdmin.view_on_site>` 来控制是否显示 "在站点上查看" 链接。

source: You can specify a descending ordering for a :attr:`ModelAdmin.list_display <django.contrib.admin.ModelAdmin.list_display>` value by prefixing the ``admin_order_field`` value with a hyphen.
id: Anda dapat menentukan urutan menurun untuk nilai :attr:`ModelAdmin.list_display <django.contrib.admin.ModelAdmin.list_display>` dengan mengawali nilai ``admin_order_field`` dengan tanda penghubung
zh_hans: 您可以通过在 ``admin_order_field`` 值前面加上连字符来指定 :attr:`ModelAdmin.list_display <django.contrib.admin.ModelAdmin.list_display>` 值的降序排序。

source: The :meth:`ModelAdmin.get_changeform_initial_data() <django.contrib.admin.ModelAdmin.get_changeform_initial_data>` method may be overridden to define custom behavior for setting initial change form data.
id: Metode :meth:`ModelAdmin.get_changeform_initial_data() <django.contrib.admin.ModelAdmin.get_changeform_initial_data>` mungkin dikesampingkan untuk menentukan penyesuaian perilaku untuk mengatur perubahan awalan data formulir.
zh_hans: 可以重写 :meth:`ModelAdmin.get_changeform_initial_data() <django.contrib.admin.ModelAdmin.get_changeform_initial_data>` 方法来定义设置更改表单初始数据的自定义行为。

source: Any ``**kwargs`` passed to :meth:`~django.contrib.auth.models.User.email_user()` are passed to the underlying :meth:`~django.core.mail.send_mail()` call.
id: Setiap ``**kwargs`` dilewatkan pada :meth:`~django.contrib.auth.models.User.email_user()` dilewatkan ke panggilan :meth:`~django.core.mail.send_mail()` pokok.
zh_hans: 传递给 :meth:`~django.contrib.auth.models.User.email_user()` 的任何 ``**kwargs`` 都会传递给底层的 :meth:`~django.core.mail.send_mail()` 调用。

source: The :func:`~django.contrib.auth.decorators.permission_required` decorator can take a list of permissions as well as a single permission.
id: Penghias :func:`~django.contrib.auth.decorators.permission_required` dapat mengambil sebuah daftar dari perizinan sama halnya perizinan tunggal.
zh_hans: :func:`~django.contrib.auth.decorators.permission_required` 装饰器可以接受一组权限，而不仅仅是单个权限。

source: You can override the new :meth:`AuthenticationForm.confirm_login_allowed() <django.contrib.auth.forms.AuthenticationForm.confirm_login_allowed>` method to more easily customize the login policy.
id: Anda dapat menimpa metode :meth:`AuthenticationForm.confirm_login_allowed() <django.contrib.auth.forms.AuthenticationForm.confirm_login_allowed>` baru untuk lebih mudah menyesuaikan kebijakan masuk.
zh_hans: 您可以重写新的 :meth:`AuthenticationForm.confirm_login_allowed() <django.contrib.auth.forms.AuthenticationForm.confirm_login_allowed>` 方法，以更轻松地自定义登录策略。

source: ``django.contrib.auth.views.password_reset()`` takes an optional ``html_email_template_name`` parameter used to send a multipart HTML email for password resets.
zh_hans: ``django.contrib.auth.views.password_reset()`` 接受一个可选的 ``html_email_template_name`` 参数，用于发送包含 HTML 的多部分电子邮件以进行密码重置。

source: The :meth:`AbstractBaseUser.get_session_auth_hash() <django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash>` method was added and if your :setting:`AUTH_USER_MODEL` inherits from :class:`~django.contrib.auth.models.AbstractBaseUser`, changing a user's password now invalidates old sessions if the ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` is enabled. See :ref:`session-invalidation-on-password-change` for more details.
id: Metode :meth:`AbstractBaseUser.get_session_auth_hash() <django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash>` telah ditambahkan dan jika warisan :setting:`AUTH_USER_MODEL` anda dari :class:`~django.contrib.auth.models.AbstractBaseUser`, merubah sandi pengguna sekarang membatalkan sesi lama jika ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` diadakan. Lihat :ref:`session-invalidation-on-password-change` untuk lebih rinci.
zh_hans: 添加了 :meth:`AbstractBaseUser.get_session_auth_hash() <django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash>` 方法，如果您的 :setting:`AUTH_USER_MODEL` 继承自 :class:`~django.contrib.auth.models.AbstractBaseUser`，那么现在在启用了 ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` 的情况下，更改用户密码会使旧的会话失效。有关更多详细信息，请参阅 :ref:`session-invalidation-on-password-change`。
