Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 2.2.12 release notes
zh_hans: Django 2.2.12 版本发行说明

source: *April 1, 2020*
zh_hans: *2020 年 4 月 1 日*

source: Django 2.2.12 fixes a bug in 2.2.11.
zh_hans: Django 2.2.12 修复了 2.2.11 版本中的一个错误。

source: Added the ability to handle ``.po`` files containing different plural equations for the same language (:ticket:`30439`).
zh_hans: 添加了处理包含同一语言的不同复数方程的 ``.po`` 文件的能力 (:ticket:`30439`)。

source: Django 2.2.13 release notes
zh_hans: Django 2.2.13 版本发行说明

source: *June 3, 2020*
zh_hans: *2020 年 6 月 3 日*

source: Django 2.2.13 fixes two security issues and a regression in 2.2.12.
zh_hans: Django 2.2.13 修复了 2.2.12 版本中的两个安全问题和一个回归错误。

source: CVE-2020-13254: Potential data leakage via malformed memcached keys
zh_hans: CVE-2020-13254 : 可能通过格式不正确的 memcached 键导致数据泄露

source: In cases where a memcached backend does not perform key validation, passing malformed cache keys could result in a key collision, and potential data leakage. In order to avoid this vulnerability, key validation is added to the memcached cache backends.
zh_hans: 在某些情况下，如果一个 memcached 后端没有执行键验证，传递格式不正确的缓存键可能会导致键碰撞和潜在的数据泄露。为了避免这个漏洞，将键验证添加到 memcached 缓存后端。

source: CVE-2020-13596: Possible XSS via admin ``ForeignKeyRawIdWidget``
zh_hans: CVE-2020-13596: 可能通过管理员 ``ForeignKeyRawIdWidget`` 进行跨站脚本攻击 (XSS) 攻击

source: Query parameters for the admin ``ForeignKeyRawIdWidget`` were not properly URL encoded, posing an XSS attack vector. ``ForeignKeyRawIdWidget`` now ensures query parameters are correctly URL encoded.
zh_hans: 管理员 ``ForeignKeyRawIdWidget`` 的查询参数未正确进行 URL 编码，存在跨站脚本攻击 (XSS) 风险。现在，``ForeignKeyRawIdWidget`` 确保查询参数正确进行了 URL 编码。

source: Fixed a regression in Django 2.2.12 that affected translation loading for apps providing translations for territorial language variants as well as a generic language, where the project has different plural equations for the language (:ticket:`31570`).
zh_hans: 修复了 Django 2.2.12 中的一个回归问题，影响了为领土语言变体和通用语言提供翻译的应用程序的翻译加载，在项目中为该语言使用了不同的复数方程 (:ticket:`31570`)。

source: Tracking a jQuery security release, upgraded the version of jQuery used by the admin from 3.3.1 to 3.5.1.
zh_hans: 追踪 jQuery 的安全发布，将管理界面使用的 jQuery 版本从 3.3.1 升级到 3.5.1 。

source: Django 2.2.14 release notes
zh_hans: Django 2.2.14 版本发行说明

source: *July 1, 2020*
zh_hans: *2020 年 7 月 1 日*

source: Django 2.2.14 fixes a bug in 2.2.13.
zh_hans: Django 2.2.14 修复了 2.2.13 中的一个错误。

source: Fixed messages of ``InvalidCacheKey`` exceptions and ``CacheKeyWarning`` warnings raised by cache key validation (:ticket:`31654`).
zh_hans: 修复了由缓存键验证引发的 ``InvalidCacheKey`` 异常和 ``CacheKeyWarning`` 警告的消息 (:ticket:`31654`)。

source: Django 2.2.15 release notes
zh_hans: Django 2.2.15 版本发行说明

source: *August 3, 2020*
zh_hans: *2020 年 8 月 3 日*

source: Django 2.2.15 fixes two bugs in 2.2.14.
zh_hans: Django 2.2.15 修复了 2.2.14 中的两个错误。

source: Allowed setting the ``SameSite`` cookie flag in :meth:`.HttpResponse.delete_cookie` (:ticket:`31790`).
zh_hans: 允许在 :meth:`.HttpResponse.delete_cookie` 中设置 ``SameSite`` Cookie 标志 (:ticket:`31790`)。

source: Fixed crash when sending emails to addresses with display names longer than 75 chars on Python 3.6.11+, 3.7.8+, and 3.8.4+ (:ticket:`31784`).
zh_hans: 修复了在 Python 3.6.11+、3.7.8+ 和 3.8.4+ 上发送电子邮件至显示名称超过 75 个字符的地址时的崩溃问题 (:ticket:`31784`)。

source: Django 2.2.16 release notes
zh_hans: Django 2.2.16 版本发行说明

source: *September 1, 2020*
zh_hans: *2020 年 9 月 1 日*

source: Django 2.2.16 fixes two security issues and two data loss bugs in 2.2.15.
zh_hans: Django 2.2.16 修复了 2.2.15 中的两个安全问题和两个数据丢失错误。

source: CVE-2020-24583: Incorrect permissions on intermediate-level directories on Python 3.7+
zh_hans: CVE-2020-24583：Python 3.7+ 上的中间层目录的权限不正确。

source: On Python 3.7+, :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS` mode was not applied to intermediate-level directories created in the process of uploading files and to intermediate-level collected static directories when using the :djadmin:`collectstatic` management command.
zh_hans: 在 Python 3.7+ 上，当使用 :djadmin:`collectstatic` 管理命令时， :setting:`FILE_UPLOAD_DIRECTORY_PERMISSIONS` 模式不能应用于上传文件过程中创建的中间级目录和中间级收集的静态目录。

source: You should review and manually fix permissions on existing intermediate-level directories.
zh_hans: 你应该检查并手动修正现有中间级目录的权限。

source: CVE-2020-24584: Permission escalation in intermediate-level directories of the file system cache on Python 3.7+
zh_hans: CVE-2020-24584：在 Python 3.7+ 上，文件系统缓存的中间级目录的权限升级。

source: On Python 3.7+, the intermediate-level directories of the file system cache had the system's standard umask rather than ``0o077`` (no group or others permissions).
zh_hans: 在 Python 3.7+ 上，文件系统缓存的中间级目录有系统的标准 umask，而不是 ``0o077`` （无组或其他权限）。

source: Fixed a data loss possibility in the :meth:`~django.db.models.query.QuerySet.select_for_update()`. When using related fields pointing to a proxy model in the ``of`` argument, the corresponding model was not locked (:ticket:`31866`).
zh_hans: 修正了 :meth:`~django.db.models.query.QuerySet.select_for_update()` 中数据丢失的可能性。当在 ``of`` 参数中使用指向代理模型的相关字段时，对应的模型没有被锁定（:ticket:`31866`）。

source: Fixed a data loss possibility, following a regression in Django 2.0, when copying model instances with a cached fields value (:ticket:`31863`).
zh_hans: 修正了 Django 2.0 中的缺陷，当复制带有缓存字段值（:ticket:`31863`）的模型实例时，可能会丢失数据。

source: Django 2.2.17 release notes
zh_hans: Django 2.2.17 版本发行说明

source: *November 2, 2020*
zh_hans: *2020 年 11 月 2 日*

source: Django 2.2.17 adds compatibility with Python 3.9.
zh_hans: Django 2.2.17 增加了与 Python 3.9 的兼容性。

source: Django 2.2.18 release notes
zh_hans: Django 2.2.18 版本发行说明

source: *February 1, 2021*
zh_hans: *2021 年 2 月 1 日*

source: Django 2.2.18 fixes a security issue with severity "low" in 2.2.17.
zh_hans: Django 2.2.18 修复了 2.2.17 版本中一个"低"严重性的安全问题。

source: CVE-2021-3281: Potential directory-traversal via ``archive.extract()``
zh_hans: CVE-2021-3281：通过 ``archive.extract()`` 进行潜在的目录遍历。

source: The ``django.utils.archive.extract()`` function, used by :option:`startapp --template` and :option:`startproject --template`, allowed directory-traversal via an archive with absolute paths or relative paths with dot segments.
zh_hans: 由 :option:`startapp --template` 和 :option:`startproject --template` 使用的 ``django.utils.archive.extract()`` 函数，允许通过带有绝对路径或带有点段的相对路径的存档进行目录遍历。

source: Django 2.2.19 release notes
zh_hans: Django 2.2.19 版本发行说明

source: *February 19, 2021*
zh_hans: *2021 年 2 月 19 日*

source: Django 2.2.19 fixes a security issue in 2.2.18.
zh_hans: Django 2.2.19 修复了 2.2.18 版本中的一个安全问题。

source: CVE-2021-23336: Web cache poisoning via ``django.utils.http.limited_parse_qsl()``
zh_hans: CVE-2021-23336：通过 ``django.utils.http.limited_parse_qsl()`` 造成网页缓存中毒

source: Django contains a copy of :func:`urllib.parse.parse_qsl` which was added to backport some security fixes. A further security fix has been issued recently such that ``parse_qsl()`` no longer allows using ``;`` as a query parameter separator by default. Django now includes this fix. See :bpo:`42967` for further details.
zh_hans: Django 包含一个 :func:`urllib.parse.parse_qsl` 的副本，该副本已添加以向后移植一些安全修复程序。最近发布了进一步的安全修复程序，使 ``parse_qsl()`` 不再被允许使用 ``;`` 作为默认的查询参数分隔符。Django 现在包含了这个修正。更多细节请参见 :bpo:`42967`。

source: Django 2.2.2 release notes
zh_hans: Django 2.2.2 版本发行说明

source: Django 2.2.2 fixes security issues and several bugs in 2.2.1.
zh_hans: Django 2.2.2 修复了 2.2.1 版本中的一些安全问题和多个 bug 。

source: Fixed a regression in Django 2.2 that stopped Show/Hide toggles working on dynamically added admin inlines (:ticket:`30459`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，导致在动态添加的管理内联中停止工作的“显示/隐藏”切换 (:ticket:`30459`)。

source: Fixed a regression in Django 2.2 where deprecation message crashes if ``Meta.ordering`` contains an expression (:ticket:`30463`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，其中如果 ``Meta.ordering`` 包含表达式，则废弃消息会导致崩溃 (:ticket:`30463`)。

source: Fixed a regression in Django 2.2.1 where :class:`~django.contrib.postgres.search.SearchVector` generates SQL with a redundant ``Coalesce`` call (:ticket:`30488`).
zh_hans: 修复了 Django 2.2.1 中的一个回归问题，其中 :class:`~django.contrib.postgres.search.SearchVector` 生成带有多余的 ``Coalesce`` 调用的 SQL (:ticket:`30488`)。

source: Fixed a regression in Django 2.2 where auto-reloader doesn't detect changes in ``manage.py`` file when using ``StatReloader`` (:ticket:`30479`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当使用 ``StatReloader`` 时，自动重新加载器无法检测到 ``manage.py`` 文件的更改 (:ticket:`30479`)。

source: Fixed crash of :class:`~django.contrib.postgres.aggregates.ArrayAgg` and :class:`~django.contrib.postgres.aggregates.StringAgg` with ``ordering`` argument when used in a ``Subquery`` (:ticket:`30315`).
zh_hans: 修复了在 ``Subquery`` 中使用时，带有 ``ordering`` 参数的 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg` 崩溃的问题 (:ticket:`30315`)。

source: Fixed a regression in Django 2.2 that caused a crash of auto-reloader when an exception with custom signature is raised (:ticket:`30516`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当引发具有自定义签名的异常时，自动重新加载器崩溃的问题 (:ticket:`30516`)。

source: Fixed a regression in Django 2.2.1 where auto-reloader unnecessarily reloads translation files multiple times when using ``StatReloader`` (:ticket:`30523`).
zh_hans: 修复了 Django 2.2.1 中的一个回归问题，当使用 ``StatReloader`` 时，自动重新加载器不必要地多次重新加载翻译文件的问题 (:ticket:`30523`)。

source: Django 2.2.20 release notes
zh_hans: Django 2.2.20 版本发行说明

source: *April 6, 2021*
zh_hans: *2021 年 4 月 6 日*

source: Django 2.2.20 fixes a security issue with severity "low" in 2.2.19.
zh_hans: Django 2.2.20 修复了 2.2.19 中一个严重性为 “低” 的安全问题。

source: CVE-2021-28658: Potential directory-traversal via uploaded files
zh_hans: CVE-2021-28658：通过上传的文件进行潜在的目录遍历

source: ``MultiPartParser`` allowed directory-traversal via uploaded files with suitably crafted file names.
zh_hans: ``MultiPartParser`` 允许通过上传某些文件名的文件进行目录遍历。

source: Built-in upload handlers were not affected by this vulnerability.
zh_hans: 内置的上传处理程序没有受到这个漏洞的影响。

source: Django 2.2.21 release notes
zh_hans: Django 2.2.21 版本发行说明

source: *May 4, 2021*
zh_hans: *2021 年 5 月 4 日*

source: Django 2.2.21 fixes a security issue in 2.2.20.
zh_hans: Django 2.2.21 修复了 2.2.20 中的一个安全问题。

source: CVE-2021-31542: Potential directory-traversal via uploaded files
zh_hans: CVE-2021-31542：通过上传的文件进行潜在的目录遍历

source: ``MultiPartParser``, ``UploadedFile``, and ``FieldFile`` allowed directory-traversal via uploaded files with suitably crafted file names.
zh_hans: ``MultiPartParser``、``UploadedFile`` 和 ``FieldFile`` 允许通过上传的文件和适当制作的文件名进行目录遍历。

source: In order to mitigate this risk, stricter basename and path sanitation is now applied.
zh_hans: 为了降低这种风险，现在应用了更严格的基名和路径预防。

source: Django 2.2.22 release notes
zh_hans: Django 2.2.22 版本发行说明

source: *May 6, 2021*
zh_hans: *2021 年 5 月 6 日*

source: Django 2.2.22 fixes a security issue in 2.2.21.
zh_hans: Django 2.2.22 修复了 2.2.21 版本中的一个安全问题。

source: CVE-2021-32052: Header injection possibility since ``URLValidator`` accepted newlines in input on Python 3.9.5+
zh_hans: CVE-2021-32052：在 Python 3.9.5 以上版本中，``URLValidator`` 接受了输入中的换行符，因此存在注入头的可能性

source: On Python 3.9.5+, :class:`~django.core.validators.URLValidator` didn't prohibit newlines and tabs. If you used values with newlines in HTTP response, you could suffer from header injection attacks. Django itself wasn't vulnerable because :class:`~django.http.HttpResponse` prohibits newlines in HTTP headers.
zh_hans: 在 Python 3.9.5+ 上，:class:`~django.core.validators.URLValidator` 没有禁止换行和制表符。如果你在 HTTP 响应中使用带换行符的值，你可能会遭受头注入攻击。Django 本身没有漏洞，因为 :class:`~django.http.HttpResponse` 禁止在 HTTP 头中使用换行符。

source: Moreover, the ``URLField`` form field which uses ``URLValidator`` silently removes newlines and tabs on Python 3.9.5+, so the possibility of newlines entering your data only existed if you are using this validator outside of the form fields.
zh_hans: 此外，使用 ``URLValidator`` 的 ``URLField`` 表单字段在 Python 3.9.5+ 上默默地删除了换行符和制表符，所以只有在你在表单字段之外使用这个验证器时才存在换行符进入你的数据的可能性。

source: This issue was introduced by the :bpo:`43882` fix.
zh_hans: 这个问题是由 :bpo:`43882` 修正所引入的。

source: Django 2.2.23 release notes
zh_hans: Django 2.2.23 版本发行说明

source: *May 13, 2021*
zh_hans: *2021 年 5 月 13 日*

source: Django 2.2.23 fixes a regression in 2.2.21.
zh_hans: Django 2.2.23 修复了 2.2.21 中的一个缺陷。

source: Fixed a regression in Django 2.2.21 where saving ``FileField`` would raise a ``SuspiciousFileOperation`` even when a custom :attr:`~django.db.models.FileField.upload_to` returns a valid file path (:ticket:`32718`).
zh_hans: 修正了 Django 2.2.21 中的一个缺陷，即保存 ``FileField`` 会引发 ``SuspiciousFileOperation``，即使自定义 :attr:`~django.db.models.FileField.upload_to` 返回了有效的文件路径（:ticket:`32718`）。

source: Django 2.2.24 release notes
zh_hans: Django 2.2.24 版本发行说明

source: *June 2, 2021*
zh_hans: *2021 年 6 月 2 日*

source: Django 2.2.24 fixes two security issues in 2.2.23.
zh_hans: Django 2.2.24 修复了 2.2.23 中的两个安全问题。

source: CVE-2021-33203: Potential directory traversal via ``admindocs``
zh_hans: CVE-2021-33203：通过 ``admindocs`` 进行潜在的目录遍历

source: Staff members could use the :mod:`~django.contrib.admindocs` ``TemplateDetailView`` view to check the existence of arbitrary files. Additionally, if (and only if) the default admindocs templates have been customized by the developers to also expose the file contents, then not only the existence but also the file contents would have been exposed.
zh_hans: 工作人员可以使用 :mod:`~django.contrib.admindocs` ``TemplateDetailView`` 视图来检查任意文件的存在。此外，如果（也只有在）默认的管理文档模板被开发者自定义为暴露文件内容，那么不仅是文件的存在，文件内容也会被暴露。

source: As a mitigation, path sanitation is now applied and only files within the template root directories can be loaded.
zh_hans: 作为一种缓解措施，现在应用了路径净化，只有模板根目录下的文件可以被加载。

source: CVE-2021-33571: Possible indeterminate SSRF, RFI, and LFI attacks since validators accepted leading zeros in IPv4 addresses
zh_hans: CVE-2021-33571：由于验证器接受 IPv4 地址中的前导零，可能会出现不确定的 SSRF、RFI 和 LFI 攻击

source: :class:`~django.core.validators.URLValidator`, :func:`~django.core.validators.validate_ipv4_address`, and :func:`~django.core.validators.validate_ipv46_address` didn't prohibit leading zeros in octal literals. If you used such values you could suffer from indeterminate SSRF, RFI, and LFI attacks.
zh_hans: :class:`~django.core.validators.URLValidator`、:func:`~django.core.validators.validate_ipv4_address` 和 :func:`~django.core.validators.validate_ipv46_address` 没有禁止八进制字的前导零。如果你使用这样的值，你可能遭受不确定的 SSRF、RFI 和 LFI 攻击。

source: :func:`~django.core.validators.validate_ipv4_address` and :func:`~django.core.validators.validate_ipv46_address` validators were not affected on Python 3.9.5+.
zh_hans: :func:`~django.core.validators.validate_ipv4_address` 和 :func:`~django.core.validators.validate_ipv46_address` 验证器在 Python 3.9.5+ 上不受影响。

source: Django 2.2.25 release notes
zh_hans: Django 2.2.25 版本发行说明

source: *December 7, 2021*
zh_hans: *2021 年 12 月 7 日*

source: Django 2.2.25 fixes a security issue with severity "low" in 2.2.24.
zh_hans: Django 2.2.25 修复了在 2.2.24 中的一个严重性为“低”的安全问题。

source: CVE-2021-44420: Potential bypass of an upstream access control based on URL paths
zh_hans: CVE-2021-44420 ：可能绕过基于 URL 路径的上游访问控制

source: HTTP requests for URLs with trailing newlines could bypass an upstream access control based on URL paths.
zh_hans: HTTP 请求中带有尾随换行符的 URL 可能会绕过基于 URL 路径的上游访问控制。

source: Django 2.2.26 release notes
zh_hans: Django 2.2.26 版本发行说明

source: *January 4, 2022*
zh_hans: *2022 年 1 月 4 日*

source: Django 2.2.26 fixes one security issue with severity "medium" and two security issues with severity "low" in 2.2.25.
zh_hans: Django 2.2.26 修复了 2.2.25 版本中一个“中等”严重性的安全问题和两个“低”严重性的安全问题。

source: CVE-2021-45115: Denial-of-service possibility in ``UserAttributeSimilarityValidator``
zh_hans: CVE-2021-45115: ``UserAttributeSimilarityValidator`` 中存在拒绝服务的可能性

source: :class:`.UserAttributeSimilarityValidator` incurred significant overhead evaluating submitted password that were artificially large in relative to the comparison values. On the assumption that access to user registration was unrestricted this provided a potential vector for a denial-of-service attack.
zh_hans: :class:`.UserAttributeSimilarityValidator` 在评估相对于比较值人工过大的提交密码时产生了显着的开销。在假设用户注册的访问是不受限制的情况下，这为拒绝服务攻击提供了潜在的攻击矢量。

source: In order to mitigate this issue, relatively long values are now ignored by ``UserAttributeSimilarityValidator``.
zh_hans: 为了缓解这个问题，``UserAttributeSimilarityValidator`` 现在会忽略相对较长的值。

source: This issue has severity "medium" according to the :ref:`Django security policy <security-disclosure>`.
zh_hans: 根据 :ref:`Django 安全政策 <security-disclosure>`，这个问题的严重性为“中等”。

source: CVE-2021-45116: Potential information disclosure in ``dictsort`` template filter
zh_hans: CVE-2021-45116: ``dictsort`` 模板过滤器中存在潜在的信息泄露漏洞

source: Due to leveraging the Django Template Language's variable resolution logic, the :tfilter:`dictsort` template filter was potentially vulnerable to information disclosure or unintended method calls, if passed a suitably crafted key.
zh_hans: 由于利用了 Django 模板语言的变量解析逻辑，如果传递了一个经过适当精心制作的键，:tfilter:`dictsort` 模板过滤器有潜在的信息泄露或意外的方法调用漏洞。

source: In order to avoid this possibility, ``dictsort`` now works with a restricted resolution logic, that will not call methods, nor allow indexing on dictionaries.
zh_hans: 为了避免这种可能性，``dictsort`` 现在使用了受限的解析逻辑，不会调用方法，也不允许在字典上进行索引。

source: As a reminder, all untrusted user input should be validated before use.
zh_hans: 提醒一下，所有不受信任的用户输入在使用前都应进行验证。

source: This issue has severity "low" according to the :ref:`Django security policy <security-disclosure>`.
zh_hans: 根据 :ref:`Django 安全政策 <security-disclosure>`，这个问题的严重性为“低”。

source: CVE-2021-45452: Potential directory-traversal via ``Storage.save()``
zh_hans: CVE-2021-45452: 通过 ``Storage.save()`` 可能存在目录遍历漏洞

source: ``Storage.save()`` allowed directory-traversal if directly passed suitably crafted file names.
zh_hans: 如果直接传递经过适当精心制作的文件名，``Storage.save()`` 允许目录遍历。

source: Django 2.2.27 release notes
zh_hans: Django 2.2.27 版本发行说明

source: *February 1, 2022*
zh_hans: *2022 年 2 月 1 日*

source: Django 2.2.27 fixes two security issues with severity "medium" in 2.2.26.
zh_hans: Django 2.2.27 修复了 2.2.26 中的两个严重程度为 "中等" 的安全问题。

source: CVE-2022-22818: Possible XSS via ``{% debug %}`` template tag
zh_hans: CVE-2022-22818: 可能通过 ``{% debug %}`` 模板标签进行跨站脚本攻击 (XSS) 攻击

source: The ``{% debug %}`` template tag didn't properly encode the current context, posing an XSS attack vector.
zh_hans: ``{% debug %}`` 模板标签没有正确编码当前上下文，存在跨站脚本攻击 (XSS) 攻击风险。

source: In order to avoid this vulnerability, ``{% debug %}`` no longer outputs information when the ``DEBUG`` setting is ``False``, and it ensures all context variables are correctly escaped when the ``DEBUG`` setting is ``True``.
zh_hans: 为了避免这个漏洞，当 ``DEBUG`` 设置为 ``False`` 时，``{% debug %}`` 不再输出信息，并且在 ``DEBUG`` 设置为 ``True`` 时，它确保所有上下文变量都正确地进行了转义。

source: CVE-2022-23833: Denial-of-service possibility in file uploads
zh_hans: CVE-2022-23833 : 文件上传中可能存在拒绝服务漏洞。

source: Passing certain inputs to multipart forms could result in an infinite loop when parsing files.
zh_hans: 传递特定的输入到多部分表单可能导致在解析文件时进入无限循环。

source: Django 2.2.28 release notes
zh_hans: Django 2.2.28 版本发行说明

source: *April 11, 2022*
zh_hans: *2022 年 4 月 11 日*

source: Django 2.2.28 fixes two security issues with severity "high" in 2.2.27.
zh_hans: Django 2.2.28 修复了 Django 2.2.27 中两个严重级别的安全问题。

source: CVE-2022-28346: Potential SQL injection in ``QuerySet.annotate()``, ``aggregate()``, and ``extra()``
zh_hans: CVE-2022-28346: ``QuerySet.annotate()``, ``aggregate()``, 和 ``extra()`` 存在潜在的 SQL 注入漏洞

source: :meth:`.QuerySet.annotate`, :meth:`~.QuerySet.aggregate`, and :meth:`~.QuerySet.extra` methods were subject to SQL injection in column aliases, using a suitably crafted dictionary, with dictionary expansion, as the ``**kwargs`` passed to these methods.
zh_hans: :meth:`.QuerySet.annotate`、:meth:`~.QuerySet.aggregate` 和 :meth:`~.QuerySet.extra` 方法在列别名中存在 SQL 注入风险，如果传递给这些方法的 ``**kwargs`` 中使用了经过适当精心制作的带有字典扩展的字典。

source: CVE-2022-28347: Potential SQL injection via ``QuerySet.explain(**options)`` on PostgreSQL
zh_hans: CVE-2022-28347: 在 PostgreSQL 上通过 ``QuerySet.explain(**options)`` 存在潜在的 SQL 注入漏洞

source: :meth:`.QuerySet.explain` method was subject to SQL injection in option names, using a suitably crafted dictionary, with dictionary expansion, as the ``**options`` argument.
zh_hans: :meth:`.QuerySet.explain` 方法在选项名称中存在 SQL 注入风险，如果将经过适当精心制作的字典与字典扩展作为 ``**options`` 参数传递。

source: Django 2.2.3 release notes
zh_hans: Django 2.2.3 版本发行说明

source: Django 2.2.3 fixes a security issue and several bugs in 2.2.2. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 2.2.3 修复了 Django 2.2.2 中的一个安全问题和若干个错误。此外，还整合了来自 Transifex 的最新字符串翻译。

source: Fixed a regression in Django 2.2 where :class:`~django.db.models.Avg`, :class:`~django.db.models.StdDev`, and :class:`~django.db.models.Variance` crash with ``filter`` argument (:ticket:`30542`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，其中 :class:`~django.db.models.Avg`、:class:`~django.db.models.StdDev` 和 :class:`~django.db.models.Variance` 在使用 ``filter`` 参数时崩溃 (:ticket:`30542`)。

source: Fixed a regression in Django 2.2.2 where auto-reloader crashes with ``AttributeError``, e.g. when using ``ipdb`` (:ticket:`30588`).
zh_hans: 修复了 Django 2.2.2 中的一个回归问题，其中自动重新加载器在出现 ``AttributeError`` 时崩溃，例如在使用 ``ipdb`` 时 (:ticket:`30588`)。

source: Django 2.2.4 release notes
zh_hans: Django 2.2.4 版本发行说明

source: Django 2.2.4 fixes security issues and several bugs in 2.2.3.
zh_hans: Django 2.2.4 修复了 Django 2.2.3 中的安全问题和若干个错误。

source: Fixed a regression in Django 2.2 when ordering a ``QuerySet.union()``, ``intersection()``, or ``difference()`` by a field type present more than once results in the wrong ordering being used (:ticket:`30628`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，当对一个包含多次出现的字段类型的 ``QuerySet.union()``, ``intersection()`` 或 ``difference()`` 进行排序时，会导致使用错误的排序方式 (:ticket:`30628`)。

source: Fixed a migration crash on PostgreSQL when adding a check constraint with a ``contains`` lookup on :class:`~django.contrib.postgres.fields.DateRangeField` or :class:`~django.contrib.postgres.fields.DateTimeRangeField`, if the right hand side of an expression is the same type (:ticket:`30621`).
zh_hans: 修复了在 PostgreSQL 上进行迁移时的崩溃问题，当在 :class:`~django.contrib.postgres.fields.DateRangeField` 或 :class:`~django.contrib.postgres.fields.DateTimeRangeField` 上添加具有 ``contains`` 查找的检查约束时，如果表达式的右侧是相同类型的话 (:ticket:`30621`)。

source: Fixed a regression in Django 2.2 where auto-reloader crashes if a file path contains null characters (``'\x00'``) (:ticket:`30506`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，如果文件路径包含空字符（``'\x00'``），自动重新加载器会崩溃的问题 (:ticket:`30506`)。

source: Fixed a regression in Django 2.2 where auto-reloader crashes if a translation directory cannot be resolved (:ticket:`30647`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，如果无法解析翻译目录，自动重新加载器会崩溃的问题 (:ticket:`30647`)。

source: Django 2.2.5 release notes
zh_hans: Django 2.2.5 版本发行说明

source: Django 2.2.5 fixes several bugs in 2.2.4.
zh_hans: Django 2.2.5 修复了 Django 2.2.4 中的若干个错误。

source: Relaxed the system check added in Django 2.2 for models to reallow use of the same ``db_table`` by multiple models when database routers are installed (:ticket:`30673`).
zh_hans: 放宽了在 Django 2.2 中为模型添加的系统检查，允许在安装了数据库路由器的情况下多个模型使用相同的 ``db_table`` (:ticket:`30673`)。

source: Fixed a regression in Django 2.2 where :attr:`ModelAdmin.list_filter <django.contrib.admin.ModelAdmin.list_filter>` choices to foreign objects don't respect a model's ``Meta.ordering`` (:ticket:`30449`).
zh_hans: 修复了 Django 2.2 中的一个回归问题，其中对外键对象的 :attr:`ModelAdmin.list_filter <django.contrib.admin.ModelAdmin.list_filter>` 选项不遵循模型的 ``Meta.ordering`` (:ticket:`30449`)。

source: Django 2.2.6 release notes
zh_hans: Django 2.2.6 版本发行说明

source: Django 2.2.6 fixes several bugs in 2.2.5.
zh_hans: Django 2.2.6 修复了 Django 2.2.5 中的若干个错误。
