Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The new :class:`~django.contrib.postgres.functions.RandomUUID` database function returns a version 4 UUID. It requires use of PostgreSQL's ``pgcrypto`` extension which can be activated using the new :class:`~django.contrib.postgres.operations.CryptoExtension` migration operation.
id: Fungsi basisdata baru :class:`~django.contrib.postgres.functions.RandomUUID` mengembalikan sebuah versi 4 UUID. Itu membutuhkan menggunakan tambahan ``pgcrypto`` PostgreSQL yang dapat diaktifkan menggunakan tindakan perpindahan baru :class:`~django.contrib.postgres.operations.CryptoExtension`.
zh_hans: 新的 :class:`~django.contrib.postgres.functions.RandomUUID` 数据库函数返回版本 4 的 UUID。它需要使用 PostgreSQL 的 ``pgcrypto`` 扩展，可以通过新的 :class:`~django.contrib.postgres.operations.CryptoExtension` 迁移操作来激活。

source: :class:`django.contrib.postgres.indexes.GinIndex` now supports the ``fastupdate`` and ``gin_pending_list_limit`` parameters.
id: :class:`django.contrib.postgres.indexes.GinIndex` sekarang mendukung parameter ``fastupdate`` dan ``gin_pending_list_limit``.
zh_hans: :class:`django.contrib.postgres.indexes.GinIndex` 现在支持 ``fastupdate`` 和 ``gin_pending_list_limit`` 参数。

source: The new :class:`~django.contrib.postgres.indexes.GistIndex` class allows creating ``GiST`` indexes in the database. The new :class:`~django.contrib.postgres.operations.BtreeGistExtension` migration operation installs the ``btree_gist`` extension to add support for operator classes that aren't built-in.
id: Kelas baru :class:`~django.contrib.postgres.indexes.GistIndex` mengizinkan pembuatan indeks-indeks ``GiST`` dalam basisdata. Tindakan perpindahan baru :class:`~django.contrib.postgres.operations.BtreeGistExtension`memasang tambahan ``btree_gist`` untuk menambah dukungan untuk kelas-kelas penghubung yang belum dibuat.
zh_hans: 新的 :class:`~django.contrib.postgres.indexes.GistIndex` 类允许在数据库中创建 ``GiST`` 索引。新的 :class:`~django.contrib.postgres.operations.BtreeGistExtension` 迁移操作安装了 ``btree_gist`` 扩展，以添加对不是内置的操作符类的支持。

source: :djadmin:`inspectdb` can now introspect ``JSONField`` and various ``RangeField``\s (``django.contrib.postgres`` must be in ``INSTALLED_APPS``).
zh_hans: :djadmin:`inspectdb` 现在可以内省 ``JSONField`` 和各种 ``RangeField`` （必须将 ``django.contrib.postgres`` 添加到 ``INSTALLED_APPS`` 中）。

source: Added the ``protocol`` keyword argument to the :class:`~django.contrib.sitemaps.GenericSitemap` constructor.
id: Ditambahkan argumen katakunci ``protocol`` ke pembangun :class:`~django.contrib.sitemaps.GenericSitemap`.
zh_hans: 在 :class:`~django.contrib.sitemaps.GenericSitemap` 构造函数中添加了 ``protocol`` 关键字参数。

source: ``cache.set_many()`` now returns a list of keys that failed to be inserted. For the built-in backends, failed inserts can only happen on memcached.
id: ``cache.set_many()`` sekarang mengembalikan daftar dari kunci yang gagal dimasukkan. Untuk backend siap-pakai, kegagalan masukan hanya dapat terjadi pada memcache.
zh_hans: ``cache.set_many()`` 现在返回一个未能插入的键的列表。对于内置的后端，失败的插入只会发生在 memcached 上。

source: :meth:`File.open() <django.core.files.File.open>` can be used as a context manager, e.g. ``with file.open() as f:``.
id: :meth:`File.open() <django.core.files.File.open>` dapat digunakan sebagai pengelola konteks, sebagai contoh ``with file.open() as f:``.
zh_hans: :meth:`File.open() <django.core.files.File.open>` 可以作为上下文管理器使用，例如 ``with file.open() as f:``。

source: The new ``date_attrs`` and ``time_attrs`` arguments for :class:`~django.forms.SplitDateTimeWidget` and :class:`~django.forms.SplitHiddenDateTimeWidget` allow specifying different HTML attributes for the ``DateInput`` and ``TimeInput`` (or hidden) subwidgets.
id: Argumen baru ``date_attrs`` dan ``time_attrs`` untuk :class:`~django.forms.SplitDateTimeWidget` dan :class:`~django.forms.SplitHiddenDateTimeWidget` mengizinkan menentukan atribut-atribut HTML berbeda untuk `subwidget `DateInput`` dan ``TimeInput`` (atau tersembunyi).
zh_hans: 对于 :class:`~django.forms.SplitDateTimeWidget` 和 :class:`~django.forms.SplitHiddenDateTimeWidget`，新的 ``date_attrs`` 和 ``time_attrs`` 参数允许指定不同的 HTML 属性用于 ``DateInput`` 和 ``TimeInput`` （或隐藏）子部件。

source: The new :meth:`Form.errors.get_json_data() <django.forms.Form.errors.get_json_data>` method returns form errors as a dictionary suitable for including in a JSON response.
id: Metode baru :meth:`Form.errors.get_json_data() <django.forms.Form.errors.get_json_data>` mengembalikan bentuk kesalahan sebagai dictionary sesuai untuk termasuk dalam tanggapan JSON.
zh_hans: 新的 :meth:`Form.errors.get_json_data() <django.forms.Form.errors.get_json_data>` 方法返回适用于包含在 JSON 响应中的表单错误的字典。

source: The new :attr:`.ContextMixin.extra_context` attribute allows adding context in ``View.as_view()``.
id: Atribut baru :attr:`.ContextMixin.extra_context` mengizinkan menambahkan konteks dalam ``View.as_view()``.
zh_hans: 新属性 :attr:`.ContextMixin.extra_context` 允许在 ``View.as_view()`` 添加上下文。

source: :djadmin:`inspectdb` now translates MySQL's unsigned integer columns to ``PositiveIntegerField`` or ``PositiveSmallIntegerField``.
id: :djadmin:`inspectdb` sekarang menterjemahkan kolom integer tidak bertanda MySQL menjadi ``PositiveIntegerField`` atau ``PositiveSmallIntegerField``.
zh_hans: :djadmin:`inspectdb` 现在将 MySQL 的无符号整数列翻译为 ``PositiveIntegerField`` 或 ``PositiveSmallIntegerField``。

source: The new :option:`makemessages --add-location` option controls the comment format in ``.po`` files.
zh_hans: 新的 :option:`makemessages --add-location` 选项控制 ``.po`` 文件中的注释格式。

source: :djadmin:`loaddata` can now :ref:`read from stdin <loading-fixtures-stdin>`.
id: :djadmin:`loaddata` sekarang dapat :ref:`read from stdin <loading-fixtures-stdin>`.
zh_hans: :djadmin:`loaddata` 现在可以从标准输入中 :ref:`读取数据 <loading-fixtures-stdin>`。

source: The new :option:`diffsettings --output` option allows formatting the output in a unified diff format.
id: Pilihan baru :option:`diffsettings --output` mengizinkan membentuk keluaran dalam sebuah bentuk berbeda yang bersatu.
zh_hans: 新的 :option:`diffsettings --output` 选项允许以统一的差异格式格式化输出。

source: On Oracle, :djadmin:`inspectdb` can now introspect ``AutoField`` if the column is created as an identity column.
id: Pada Oracle, :djadmin:`inspectdb` sekarang dapat menginterospeksi ``AutoField`` jika kolom dibuat sebagai sebuah kolom identitas.
zh_hans: 在 Oracle 上，:djadmin:`inspectdb` 现在可以内省 ``AutoField``，如果列被创建为标识列（identity column）。

source: On MySQL, :djadmin:`dbshell` now supports client-side TLS certificates.
id: Pada MySQL, :djadmin:`dbshell`sekarang mendukung sertifikat TLS sisi-klien.
zh_hans: 在 MySQL 上，:djadmin:`dbshell` 现在支持客户端端的 TLS 证书。

source: The new :option:`squashmigrations --squashed-name` option allows naming the squashed migration.
id: Pilihan baru :option:`squashmigrations --squashed-name` mengizinkan menamakan perpindahan yang dihentikan.
zh_hans: 新的 :option:`squashmigrations --squashed-name` 选项允许命名合并后的迁移。

source: The new :class:`~django.db.models.functions.StrIndex` database function finds the starting index of a string inside another string.
id: Fungsi basisdata baru :class:`~django.db.models.functions.StrIndex` menemukan permulaan indeks dari string didalam string lain.
zh_hans: 新的 :class:`~django.db.models.functions.StrIndex` 数据库函数用于查找一个字符串在另一个字符串中的起始索引。

source: On Oracle, ``AutoField`` and ``BigAutoField`` are now created as `identity columns <https://docs.oracle.com/en/database/oracle/oracle-database/21/drdaa/ intro-to-tools-and-products-supporting-migraiton.html#GUID-14E4817B-F3BC-4D99 -B471-A0ACDC303CC9>`__.
zh_hans: 在 Oracle 上，现在会将 ``AutoField`` 和 ``BigAutoField`` 创建为 `标识列 <https://docs.oracle.com/en/database/oracle/oracle-database/21/drdaa/ intro-to-tools-and-products-supporting-migraiton.html#GUID-14E4817B-F3BC-4D99 -B471-A0ACDC303CC9>`__。

source: The new ``chunk_size`` parameter of :meth:`.QuerySet.iterator` controls the number of rows fetched by the Python database client when streaming results from the database. For databases that don't support server-side cursors, it controls the number of results Django fetches from the database adapter.
id: Parameter baru ``chunk_size`` dari :meth:`.QuerySet.iterator` mengendalikan sejumlah baris diambil oleh klien basisdata Python ketika mengalirkan hasil dari basisdata. Untuk basisdata yang tidak mengukung kursos sisi-peladen, itu mengendalikan sejumlah hasil Django diambil dari penyadur basisdata.
zh_hans: :meth:`.QuerySet.iterator` 的新参数 ``chunk_size`` 控制在从数据库流式传输结果时由 Python 数据库客户端提取的行数。对于不支持服务器端游标的数据库，它控制 Django 从数据库适配器提取的结果数量。

source: :meth:`.QuerySet.earliest`, :meth:`.QuerySet.latest`, and :attr:`Meta.get_latest_by <django.db.models.Options.get_latest_by>` now allow ordering by several fields.
id: :meth:`.QuerySet.earliest`, :meth:`.QuerySet.latest`, dan :attr:`Meta.get_latest_by <django.db.models.Options.get_latest_by>` sekarang mengizinkan pengurutan berdasarkan beberapa bidang.
zh_hans: :meth:`.QuerySet.earliest`、:meth:`.QuerySet.latest` 和 :attr:`Meta.get_latest_by <django.db.models.Options.get_latest_by>` 现在允许按多个字段排序。

source: Added the :class:`~django.db.models.functions.ExtractQuarter` function to extract the quarter from :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField`, and exposed it through the :lookup:`quarter` lookup.
id: Ditambahkan fungsi :class:`~django.db.models.functions.ExtractQuarter` untuk mengambil perempat dari :class:`~django.db.models.DateField` dan :class:`~django.db.models.DateTimeField`,dan menampilkan itu melalui pencarian :lookup:`quarter`.
zh_hans: 新增了 :class:`~django.db.models.functions.ExtractQuarter` 函数，用于从 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 中提取季度，并通过 :lookup:`quarter` 查找公开。

source: Added the :class:`~django.db.models.functions.TruncQuarter` function to truncate :class:`~django.db.models.DateField` and :class:`~django.db.models.DateTimeField` to the first day of a quarter.
id: Ditambahkan fungsi :class:`~django.db.models.functions.TruncQuarter`untuk memotong :class:`~django.db.models.DateField` dan :class:`~django.db.models.DateTimeField` untuk hari pertama dari perempat.
zh_hans: 新增了 :class:`~django.db.models.functions.TruncQuarter` 函数，用于将 :class:`~django.db.models.DateField` 和 :class:`~django.db.models.DateTimeField` 截断到季度的第一天。

source: Added the :attr:`~django.db.models.Index.db_tablespace` parameter to class-based indexes.
id: Ditambahkan parameter :attr:`~django.db.models.Index.db_tablespace` pada pengindeksan berdasarkan-kelas.
zh_hans: 为基于类的索引添加了 :attr:`~django.db.models.Index.db_tablespace` 参数。

source: If the database supports a native duration field (Oracle and PostgreSQL), :class:`~django.db.models.functions.Extract` now works with :class:`~django.db.models.DurationField`.
id: Jika basisdata mendukung bidang lanma aslinya (Oracle dan PostgreSQL), :class:`~django.db.models.functions.Extract` sekarang bekerja dengan :class:`~django.db.models.DurationField`.
zh_hans: 如果数据库支持原生的持续时间字段（Oracle 和 PostgreSQL），:class:`~django.db.models.functions.Extract` 现在可以与 :class:`~django.db.models.DurationField` 一起使用。

source: Added the ``of`` argument to :meth:`.QuerySet.select_for_update()`, supported on PostgreSQL and Oracle, to lock only rows from specific tables rather than all selected tables. It may be helpful particularly when :meth:`~.QuerySet.select_for_update()` is used in conjunction with :meth:`~.QuerySet.select_related()`.
id: Ditambahkan argumen ``off`` pada :meth:`.QuerySet.select_for_update()`, didukung pada PostgreSQL dan Oracle, untuk mengunci hanya baris dari tabel-tabel tertentu daripada semua tabel terpilih. Itu mungkin berguna khususnya ketika :meth:`~.QuerySet.select_for_update()` digunakan di hubungan dengan :meth:`~.QuerySet.select_related()`.
zh_hans: 新增了 ``of`` 参数到 :meth:`.QuerySet.select_for_update()`，在 PostgreSQL 和 Oracle 上支持，可以锁定特定表中的行，而不是所有选定的表。这在特别是当 :meth:`~.QuerySet.select_for_update()` 与 :meth:`~.QuerySet.select_related()` 结合使用时可能会有所帮助。

source: The new ``field_name`` parameter of :meth:`.QuerySet.in_bulk` allows fetching results based on any unique model field.
id: Parameter baru ``field_name`` dari :meth:`.QuerySet.in_bulk` mengizinkan mengambil hasil berdasarkan pada bidang model unik.
zh_hans: :meth:`.QuerySet.in_bulk` 的新参数 ``field_name`` 允许根据任何唯一模型字段获取结果。

source: :meth:`.CursorWrapper.callproc()` now takes an optional dictionary of keyword parameters, if the backend supports this feature. Of Django's built-in backends, only Oracle supports it.
id: :meth:`.CursorWrapper.callproc()` sekarang mengambil sebuah pilihan dari parameter katakunci, jika backend mendukung fitur ini. Dari backend siap-pakai Django, hanya Oracle mendukung itu.
zh_hans: :meth:`.CursorWrapper.callproc()` 现在可以接受一个可选的关键字参数字典，如果后端支持此功能。Django 内置的后端中，只有 Oracle 支持这个功能。

source: The new :meth:`connection.execute_wrapper() <django.db.backends.base.DatabaseWrapper.execute_wrapper>` method allows :doc:`installing wrappers around execution of database queries </topics/db/instrumentation>`.
id: Metode baru :meth:`connection.execute_wrapper() <django.db.backends.base.DatabaseWrapper.execute_wrapper>`mengizinkan :doc:`installing wrappers around execution of database queries `.
zh_hans: 新的 :meth:`connection.execute_wrapper() <django.db.backends.base.DatabaseWrapper.execute_wrapper>` 方法允许 :doc:`在执行数据库查询时安装包装器 </topics/db/instrumentation>`。

source: The new ``filter`` argument for built-in aggregates allows :ref:`adding different conditionals <conditional-aggregation>` to multiple aggregations over the same fields or relations.
id: Argumen baru ``filter`` untuk kumpulan siap-pakai mengizinkan :ref:`adding different conditionals ` untuk banyak kumpulan terhadap bidang atau hubungan sama.
zh_hans: 内置聚合函数的新 ``filter`` 参数允许在同一字段或关系上的多个聚合中 :ref:`添加不同的条件 <conditional-aggregation>`。

source: Added support for expressions in :attr:`Meta.ordering <django.db.models.Options.ordering>`.
id: Ditambahkan dukungan untuk pernyataan dalam :attr:`Meta.ordering <django.db.models.Options.ordering>`.
zh_hans: 在 :attr:`Meta.ordering <django.db.models.Options.ordering>` 中添加了对表达式的支持。

source: The new ``named`` parameter of :meth:`.QuerySet.values_list` allows fetching results as named tuples.
id: Parameter baru ``named`` dari :meth:`.QuerySet.values_list`mengizinkan mengambil hasil sebagai tuple-tuple bernama.
zh_hans: :meth:`.QuerySet.values_list` 的新参数 ``named`` 允许将结果作为命名元组获取。

source: The new :class:`.FilteredRelation` class allows adding an ``ON`` clause to querysets.
id: Kelas baru :class:`.FilteredRelation`mengizinkan menambahkan sebuah klausa ``ON`` pada queryset.
zh_hans: 新的 :class:`.FilteredRelation` 类允许在查询集中添加一个 ``ON`` 子句。

source: Pagination
id: Penomoran halaman
zh_hans: 分页

source: Added :meth:`Paginator.get_page() <django.core.paginator.Paginator.get_page>` to provide the documented pattern of handling invalid page numbers.
id: Ditambahkan :meth:`Paginator.get_page() <django.core.paginator.Paginator.get_page>` untuk menyediakan pola terdokumentasi dari penanganan nomor halaman tidak sah.
zh_hans: 添加了 :meth:`Paginator.get_page() <django.core.paginator.Paginator.get_page>`，以提供处理无效页码的文档化模式。

source: The :djadmin:`runserver` web server supports HTTP 1.1.
zh_hans: :djadmin:`runserver` Web 服务器支持 HTTP 1.1。

source: To increase the usefulness of :meth:`.Engine.get_default` in third-party apps, it now returns the first engine if multiple ``DjangoTemplates`` engines are configured in ``TEMPLATES`` rather than raising ``ImproperlyConfigured``.
id: Untuk meningkatkan kegunaan dari :meth:`.Engine.get_default` dalam aplikasi pihak-ketiga, itu sekarang mengembalikan mesin pertama jika banyak mesin ``DjangoTemplates`` dikonfigurasikan dalam ``TEMPLATES`` daripada memunculkan ``ImproperlyConfigured``.
zh_hans: 为了增加第三方应用程序中 :meth:`.Engine.get_default` 的实用性，如果在 ``TEMPLATES`` 中配置了多个 ``DjangoTemplates`` 引擎，它现在将返回第一个引擎，而不是引发 ``ImproperlyConfigured`` 异常。

source: Custom template tags may now accept keyword-only arguments.
id: Menyesuaikan etiket cetakan mungkin sekarang menerima argumen hanya-katakunci.
zh_hans: 现在自定义模板标签可以接受仅限关键字的参数。

source: Added threading support to :class:`~django.test.LiveServerTestCase`.
id: Ditambahkan rangkaian dukungan pada :class:`~django.test.LiveServerTestCase`.
zh_hans: 向 :class:`~django.test.LiveServerTestCase` 添加了多线程支持。

source: Added settings that allow customizing the test tablespace parameters for Oracle: :setting:`DATAFILE_SIZE`, :setting:`DATAFILE_TMP_SIZE`, :setting:`DATAFILE_EXTSIZE`, and :setting:`DATAFILE_TMP_EXTSIZE`.
id: Ditambahkan pengaturan yang mengizinkan menyesuaikan parameter tablespace percobaan untuk Oracle: :setting:`DATAFILE_SIZE`, :setting:`DATAFILE_TMP_SIZE`, :setting:`DATAFILE_EXTSIZE`, dan :setting:`DATAFILE_TMP_EXTSIZE`.
zh_hans: 添加了允许自定义 Oracle 测试表空间参数的设置：:setting:`DATAFILE_SIZE`、:setting:`DATAFILE_TMP_SIZE`、:setting:`DATAFILE_EXTSIZE` 和 :setting:`DATAFILE_TMP_EXTSIZE`。

source: The new :class:`.ProhibitNullCharactersValidator` disallows the null character in the input of the :class:`~django.forms.CharField` form field and its subclasses. Null character input was observed from vulnerability scanning tools. Most databases silently discard null characters, but psycopg2 2.7+ raises an exception when trying to save a null character to a char/text field with PostgreSQL.
zh_hans: 新的 :class:`.ProhibitNullCharactersValidator` 在 :class:`~django.forms.CharField` 表单字段及其子类的输入中禁止使用空字符。空字符输入是由于漏洞扫描工具而观察到的。大多数数据库会悄悄地丢弃空字符，但是当尝试将空字符保存到 PostgreSQL 的 char/text 字段时，psycopg2 2.7+ 会引发异常。

source: Backwards incompatible changes in 2.0
id: Kesesuaian kebelakang berubah di 2.0
zh_hans: 2.0 版本的不向后兼容变更

source: Removed support for bytestrings in some places
id: Memindahkan dukungan untuk bytestring di beberapa tempat
zh_hans: 在某些地方移除了对字节字符串的支持

source: To support native Python 2 strings, older Django versions had to accept both bytestrings and Unicode strings. Now that Python 2 support is dropped, bytestrings should only be encountered around input/output boundaries (handling of binary fields or HTTP streams, for example). You might have to update your code to limit bytestring usage to a minimum, as Django no longer accepts bytestrings in certain code paths. Python's :option:`-b` option may help detect that mistake in your code.
zh_hans: 为了支持原生的 Python 2 字符串，旧版本的 Django 必须同时接受字节字符串和 Unicode 字符串。现在 Python 2 的支持已被移除，字节字符串应该只出现在输入/输出边界（例如处理二进制字段或 HTTP 流）附近。您可能需要更新您的代码，以将字节字符串的使用限制到最低，因为 Django 不再在某些代码路径中接受字节字符串。Python 的 :option:`-b` 选项可能有助于检测代码中的这种错误。

source: For example, ``reverse()`` now uses ``str()`` instead of ``force_text()`` to coerce the ``args`` and ``kwargs`` it receives, prior to their placement in the URL. For bytestrings, this creates a string with an undesired ``b`` prefix as well as additional quotes (``str(b'foo')`` is ``"b'foo'"``). To adapt, call ``decode()`` on the bytestring before passing it to ``reverse()``.
zh_hans: 例如，现在 ``reverse()`` 在将接收到的 ``args`` 和 ``kwargs`` 放置在 URL 之前，使用 ``str()`` 而不是 ``force_text()`` 来强制转换它们。对于字节字符串，这会创建一个带有不希望的 ``b`` 前缀以及额外引号的字符串（``str(b'foo')`` 是 ``"b'foo'"``）。为了适应这种变化，在将字节字符串传递给 ``reverse()`` 之前，请调用 ``decode()``。

source: The ``DatabaseOperations.datetime_cast_date_sql()``, ``datetime_cast_time_sql()``, ``datetime_trunc_sql()``, ``datetime_extract_sql()``, and ``date_interval_sql()`` methods now return only the SQL to perform the operation instead of SQL and a list of parameters.
id: Metode ``DatabaseOperations.datetime_cast_date_sql()``, ``datetime_cast_time_sql()``, ``datetime_trunc_sql()``, ``datetime_extract_sql()``, dan ``date_interval_sql()`` sekarang hanya mengembalikan SQL untuk melakukan tindakan daripada SQL dan daftar parameter.
zh_hans: 现在，``DatabaseOperations.datetime_cast_date_sql()``、``datetime_cast_time_sql()``、``datetime_trunc_sql()``、``datetime_extract_sql()`` 和 ``date_interval_sql()`` 方法仅返回执行操作的 SQL，而不再返回 SQL 和参数列表。

source: Third-party database backends should add a ``DatabaseWrapper.display_name`` attribute with the name of the database that your backend works with. Django may use it in various messages, such as in system checks.
id: Backend basisdata pihak-ketiga harus menambahkan atribut ``DatabaseWrapper.display_name``dengan nama dari basisdata dimana backend anda bekerja dengannya. Django menggunakan itu dalam beragam pesan, seperti di pemeriksaan sistem.
zh_hans: 第三方数据库后端应该添加一个名为 ``DatabaseWrapper.display_name`` 的属性，该属性包含您的后端适用于的数据库名称。Django 可能会在各种消息中使用它，例如系统检查中。

source: The first argument of ``SchemaEditor._alter_column_type_sql()`` is now ``model`` rather than ``table``.
id: Argumen pertama ``SchemaEditor._alter_column_type_sql()``sekarang ``model`` daripada ``table``.
zh_hans: ``SchemaEditor._alter_column_type_sql()`` 的第一个参数现在是 ``model``，而不再是 ``table``。

source: The first argument of ``SchemaEditor._create_index_name()`` is now ``table_name`` rather than ``model``.
id: Argumen pertama dari ``SchemaEditor._create_index_name()`` sekarang ``table_name`` daripada ``model``.
zh_hans: ``SchemaEditor._create_index_name()`` 的第一个参数现在是 ``table_name``，而不再是 ``model``。

source: To enable ``FOR UPDATE OF`` support, set ``DatabaseFeatures.has_select_for_update_of = True``. If the database requires that the arguments to ``OF`` be columns rather than tables, set ``DatabaseFeatures.select_for_update_of_column = True``.
id: Untuk mengadakan dukungan ``FOR UPDATE OF``, setel ``DatabaseFeatures.has_select_for_update_of = True``. jika basisdata membutuhkan bahwa argumen menjadi kolom ``OF`` daripada tabel, setel ``DatabaseFeatures.select_for_update_of_column = True``.
zh_hans: 要启用 ``FOR UPDATE OF`` 支持，请设置 ``DatabaseFeatures.has_select_for_update_of = True``。如果数据库要求 ``OF`` 的参数是列而不是表，请设置 ``DatabaseFeatures.select_for_update_of_column = True``。

source: To enable support for :class:`~django.db.models.expressions.Window` expressions, set ``DatabaseFeatures.supports_over_clause`` to ``True``. You may need to customize the ``DatabaseOperations.window_start_rows_start_end()`` and/or ``window_start_range_start_end()`` methods.
id: Untuk mengadakan dukungan untuk pernyataan :class:`~django.db.models.expressions.Window`, setel ``DatabaseFeatures.supports_over_clause`` menjadi ``True``. Anda mungkin butuh menyesuaikan metode ``DatabaseOperations.window_start_rows_start_end()`` dan/atau ``window_start_range_start_end()``.
zh_hans: 要启用对 :class:`~django.db.models.expressions.Window` 表达式的支持，请将 ``DatabaseFeatures.supports_over_clause`` 设置为 ``True``。您可能需要自定义 ``DatabaseOperations.window_start_rows_start_end()`` 和/或 ``window_start_range_start_end()`` 方法。

source: Third-party database backends should add a ``DatabaseOperations.cast_char_field_without_max_length`` attribute with the database data type that will be used in the :class:`~django.db.models.functions.Cast` function for a ``CharField`` if the ``max_length`` argument isn't provided.
id: Backend basisdata pihak-ketiga harus menambahkan sebuah atribut ``DatabaseOperations.cast_char_field_without_max_length`` dengan jenis data basisdata yang akan digunakan dalam fungsi :class:`~django.db.models.functions.Cast`untuk ``CharField`` jika argumen ``max_length`` tidak disediakan.
zh_hans: 第三方数据库后端应该添加一个名为 ``DatabaseOperations.cast_char_field_without_max_length`` 的属性，该属性指定在没有提供 ``max_length`` 参数的情况下，在 :class:`~django.db.models.functions.Cast` 函数中将用于 ``CharField`` 的数据库数据类型。

source: The first argument of ``DatabaseCreation._clone_test_db()`` and ``get_test_db_clone_settings()`` is now ``suffix`` rather than ``number`` (in case you want to rename the signatures in your backend for consistency). ``django.test`` also now passes those values as strings rather than as integers.
zh_hans: ``DatabaseCreation._clone_test_db()`` 和 ``get_test_db_clone_settings()`` 的第一个参数现在是 ``suffix``，而不再是 ``number``（如果您希望为了一致性而在您的后端中重命名签名）。``django.test`` 现在也将这些值作为字符串而不是整数传递。
