Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Due to new features in the :ttag:`if` template tag, it no longer accepts 'and', 'or' and 'not' as valid **variable** names. Previously, these strings could be used as variable names. Now, the keyword status is always enforced, and template code such as ``{% if not %}`` or ``{% if and %}`` will throw a ``TemplateSyntaxError``. Also, ``in`` is a new keyword and so is not a valid variable name in this tag.
id: Dikarenakan fitur baru di etiket cetakan :ttag:`if`, itu tidak lagi menerima 'and', 'or' dan 'not' sebagai nama-nama **variabel** yang sah. Sebelumnya, deretan karakter ini dapat digunakan sebagai nama-nama variabel. Sekarang, keadaan kata kunci selau dipaksakan, dan kode cetakan seperti ``{% if not %}`` atau ``{% if and %}`` akan melemparkan sebuah ``TemplateSyntaxError``. Juga, ``in`` adalah sebuah kata kunci baru dan jadi nama variabel tidak sah di etiket ini.
zh_hans: 由于 :ttag:`if` 模板标签中的新功能，它不再接受 'and'、'or' 和 'not' 作为有效的 **变量** 名称。以前，这些字符串可以用作变量名。现在，关键字状态始终受到强制执行，因此模板代码如 ``{% if not %}`` 或 ``{% if and %}`` 将引发 ``TemplateSyntaxError``。此外，``in`` 是一个新关键字，因此在此标签中不是有效的变量名。

source: ``LazyObject`` is an undocumented-but-often-used utility class used for lazily wrapping other objects of unknown type.
id: ``LazyObject`` adalah sebuah kelas kegunaan tidak-terdokumentasikan-tetapi-sering-digunakan digunakan untuk pembungkusan malas obyek lain dari jenis tidak dikenal.
zh_hans: ``LazyObject`` 是一个未记录但经常使用的实用类，用于懒惰地包装其他未知类型的对象。

source: In Django 1.1 and earlier, it handled introspection in a non-standard way, depending on wrapped objects implementing a public method named ``get_all_members()``. Since this could easily lead to name clashes, it has been changed to use the standard Python introspection method, involving ``__members__`` and ``__dir__()``.
id: Di Django 1.1 dan paling awal, itu menangani interspeksi di jalan bukan-standar, tergantung pada obyek dibungkus menerapkan metode umum dinamai ``get_all_members()``. Karena ini dapat dengan mudah membawa ke tabrakan nama, itu telah dirubah untuk menggunakan metode standar interospeksi Python, melibatkan ``__members__`` dan ``__dir__()``.
zh_hans: 在 Django 1.1 及更早版本中，它以一种非标准的方式处理内省，依赖于被包装的对象实现一个名为 ``get_all_members()`` 的公共方法。由于这可能会导致名称冲突，因此已更改为使用标准的 Python 内省方法，涉及 ``__members__`` 和 ``__dir__()``。

source: If you used ``LazyObject`` in your own code and implemented the ``get_all_members()`` method for wrapped objects, you'll need to make a couple of changes:
id: Jika anda menggunakan ``LazyObject`` di kode anda sendiri dan menerapkan metode ``get_all_members()`` untuk obyek dibungkus, anda akan butuh membuat sepasang perubahan:
zh_hans: 如果你在自己的代码中使用了 ``LazyObject`` 并为被包装的对象实现了 ``get_all_members()`` 方法，你需要进行一些更改：

source: First, if your class does not have special requirements for introspection (i.e., you have not implemented ``__getattr__()`` or other methods that allow for attributes not discoverable by normal mechanisms), you can simply remove the ``get_all_members()`` method. The default implementation on ``LazyObject`` will do the right thing.
id: Pertama, jika kelas anda tidak mempunyai persyaratan khusus untuk interospeksi (yaitu, anda belum menerapkan ``__getattr__()`` atau metode lainnya yang mengizinkan untuk atribut tidak dapat ditemukan oleh mekanisme biasa), anda dapat cukup memindahkan metode ``get_all_members()``. Penerapan awal pada ``LazyObject`` akan melakukan hal benar.
zh_hans: 首先，如果你的类对内省没有特殊要求（即，你没有实现 ``__getattr__()`` 或其他允许通过正常机制无法发现的属性的方法），你可以简单地删除 ``get_all_members()`` 方法。``LazyObject`` 上的默认实现会处理得当。

source: If you have more complex requirements for introspection, first rename the ``get_all_members()`` method to ``__dir__()``. This is the standard introspection method for Python 2.6 and above. If you require support for Python versions earlier than 2.6, add the following code to the class::
id: Jika anda mempunyai persyaratan lebih rumit untuk interospeksi, pertama namai kembali metode ``get_all_members()`` pada ``__dir__()``. Ini adalah metode interospeksi standar untuk Python 2.6 dan diatas. Jika anda membutuhkan dukungan untuk versi awal Python dari 2.6, tambah kode berikut pada kelas::
zh_hans: 如果你对内省有更复杂的要求，首先将 ``get_all_members()`` 方法重命名为 ``__dir__()``。这是 Python 2.6 及更高版本的标准内省方法。如果你需要支持早于 2.6 版本的 Python，请将以下代码添加到类中：

source: ``__dict__`` on model instances
id: ``__dict__`` pada instance model
zh_hans: 模型实例上的 ``__dict__``

source: Historically, the ``__dict__`` attribute of a model instance has only contained attributes corresponding to the fields on a model.
id: Secara riwayat, atribut ``__dict__`` dari sebuah instance model mempunyai hanya atribut mengandung hubungan ke bidang pada sebuah model.
zh_hans: 在历史上，模型实例的 ``__dict__`` 属性仅包含与模型上的字段对应的属性。

source: In order to support multiple database configurations, Django 1.2 has added a ``_state`` attribute to object instances. This attribute will appear in ``__dict__`` for a model instance. If your code relies on iterating over ``__dict__`` to obtain a list of fields, you must now be prepared to handle or filter out the ``_state`` attribute.
id: Untuk mendukung konfigurasi banyak basisdata, Django 1.2 telah menambahkan sebuah atribut ``_state`` pada instance obyek. Atribut ini akan muncul di ``__dict__`` untuk sebuah instance model. Jika kode anda bergantung pada perulangan terhadap ``__dict__`` untuk mengambil daftar dari bidang, anda harus sekarang bersiap untuk menangani atau menyaring atribut ``_state``.
zh_hans: 为了支持多个数据库配置，Django 1.2 添加了一个 ``_state`` 属性到对象实例中。这个属性将出现在模型实例的 ``__dict__`` 中。如果你的代码依赖于遍历 ``__dict__`` 来获取字段列表，现在必须准备好处理或过滤掉 ``_state`` 属性。

source: The exit status code of the test runners (``tests/runtests.py`` and ``python manage.py test``) no longer represents the number of failed tests, because a failure of 256 or more tests resulted in a wrong exit status code. The exit status code for the test runner is now 0 for success (no failing tests) and 1 for any number of test failures. If needed, the number of test failures can be found at the end of the test runner's output.
id: Kode keadaan keluar dari pejalan percobaan (``tests/runtests.py`` dan ``python manage.py test``) tidak lagi mewakili angka dari percobaan gagal, karena sebuah kegagalan dari 256 atau percobaan lebih dihasilkan di kode keadaan keluar yang salah. Kode keadaan keluar untuk pejalan percobaan sekarang 0 untuk berhasil (tidak ada kegagalan percobaan) dan 1 untuk angka apapun dari kegagalan percobaan. Jika dibutuhkan, angka kegagalan percobaan dapat ditemukan pada akhir dari keluaran pejalan percobaan.
zh_hans: 测试运行器（``tests/runtests.py`` 和 ``python manage.py test``）的退出状态码不再代表失败测试的数量，因为失败 256 个或更多测试会导致错误的退出状态码。现在测试运行器的退出状态码为 0 表示成功（没有失败测试），为 1 表示任何数量的测试失败。如果需要，可以在测试运行器的输出末尾找到测试失败的数量。

source: To fix bugs with cookies in Internet Explorer, Safari, and possibly other browsers, our encoding of cookie values was changed so that the comma and semicolon are treated as non-safe characters, and are therefore encoded as ``\054`` and ``\073`` respectively. This could produce backwards incompatibilities, especially if you are storing comma or semi-colon in cookies and have JavaScript code that parses and manipulates cookie values client-side.
id: Untuk memperbaiki kesalahan-kesalahan dengan kue di Internet Explorer, Safari, dan kemungkinan peramban lain, penyandian kami dari nilai kue telah berubah sehingga koma dan titik koma diperlakukan sebagai karakter bukan-aman, dan karena itu disandikan masing-masing sebagai ``\054`` dan ``\073``. Ini dapat menghasilkan ketidaksesuaian kebelakang, khususnya jika anda menyimpan koma atau titik-koma di kue dan mempunyai kode JavaScript yang mengurai dan merubah nilai kue di sisi-klien.
zh_hans: 为了修复 Internet Explorer、Safari 和可能其他浏览器中的 cookie 问题，我们更改了对 cookie 值的编码，以使逗号和分号被视为非安全字符，因此它们被编码为 ``\054`` 和 ``\073``。这可能会导致向后不兼容性，特别是如果你在 cookie 中存储逗号或分号，并且有客户端 JavaScript 代码解析和操作 cookie 值。

source: ``ModelForm.is_valid()`` and ``ModelForm.errors``
id: ``ModelForm.is_valid()`` dan ``ModelForm.errors``
zh_hans: ``ModelForm.is_valid()`` 和 ``ModelForm.errors``

source: Much of the validation work for ModelForms has been moved down to the model level. As a result, the first time you call ``ModelForm.is_valid()``, access ``ModelForm.errors`` or otherwise trigger form validation, your model will be cleaned in-place. This conversion used to happen when the model was saved. If you need an unmodified instance of your model, you should pass a copy to the ``ModelForm`` constructor.
id: Kebanyakan dari pengecekan bekerja untuk ModelForm telah diturunkan ke tingkat model. Sebagai hasilnya, pertama kali anda memanggil ``ModelForm.is_valid()``, akses ``ModelForm.errors`` atau jika tidak memicu pengecekan formulir, mode anda akan dibersihkan di-tempat. Perubahan ini biasanya terjadi ketika model telah disimpan. Jika anda butuh instance tidak dirubah dari model adan, anda harus melewati salinan pada pembangun ``ModelForm``.
zh_hans: ModelForms 的大部分验证工作已经移到了模型级别。因此，第一次调用 ``ModelForm.is_valid()``，访问 ``ModelForm.errors`` 或以其他方式触发表单验证时，你的模型将被原地清理。这个转换以前是在模型保存时发生的。如果你需要一个未修改的模型实例，你应该将一个副本传递给 ``ModelForm`` 构造函数。

source: ``BooleanField`` on MySQL
id: ``BooleanField`` pada MySQL
zh_hans: 在 MySQL 上的 ``BooleanField``

source: In previous versions of Django, a model's ``BooleanField`` under MySQL would return its value as either ``1`` or ``0``, instead of ``True`` or ``False``; for most people this wasn't a problem because ``bool`` is a subclass of ``int`` in Python. In Django 1.2, however, ``BooleanField`` on MySQL correctly returns a real ``bool``. The only time this should ever be an issue is if you were expecting the ``repr`` of a ``BooleanField`` to print ``1`` or ``0``.
id: Di versi sebelumnya dari Django, ``BooleanField`` model dibawah MySQL akan mengemblikan nilainya sebagai baik ``1`` atau ``0``, sebagai gantinya dari ``True`` atau ``False``; untuk kebanyakan orang ini bukanlah sebuah masalah karena ``bool`` adalah sebuah subkelas dari ``int`` di Python. Di Django 1.2, bagaimanapun, ``BooleanField`` pada MySQL dengan ebnar mengembalikan ``bool`` asli. Hanya waktu ini harus pernah menjadi masalah jika anda mengharapkan ``repr`` dari sebuah ``BooleanField`` untuk mencetak ``1`` atau ``0``.
zh_hans: 在之前的 Django 版本中，在 MySQL 下，模型的 ``BooleanField`` 会将其值返回为 ``1`` 或 ``0``，而不是 ``True`` 或 ``False``；对于大多数人来说，这不是问题，因为在 Python 中，``bool`` 是 ``int`` 的子类。然而，在 Django 1.2 中，MySQL 上的 ``BooleanField`` 正确地返回一个真正的 ``bool``。唯一可能会引发问题的情况是，如果你期望一个 ``BooleanField`` 的 ``repr`` 打印出 ``1`` 或 ``0``。

source: Changes to the interpretation of ``max_num`` in FormSets
id: Perubahan pada penafsiran dari ``max_num`` di FormSets
zh_hans: 对于 FormSets 中 ``max_num`` 的解释变更

source: As part of enhancements made to the handling of FormSets, the default value and interpretation of the ``max_num`` parameter to the :ref:`django.forms.formsets.formset_factory() <formsets-max-num>` and :ref:`django.forms.models.modelformset_factory() <model-formsets-max-num>` functions has changed slightly. This change also affects the way the :attr:`~django.contrib.admin.InlineModelAdmin.max_num` argument is used for inline admin objects.
id: Sebagai bagian dari peningkatan dibuat untuk menangani FormSet, nilai awal dan penafsiran dari parameter ``max_num`` ke fungsi :ref:`django.forms.formsets.formset_factory() <formsets-max-num>` dan :ref:`django.forms.models.modelformset_factory() <model-formsets-max-num>` telah dirubah sedikit. Perubahan ini juga mempengaruhi cara argumen :attr:`~django.contrib.admin.InlineModelAdmin.max_num` digunakan untuk obyek admin berderet.
zh_hans: 作为对 FormSets 处理的增强的一部分，``max_num`` 参数在 :ref:`django.forms.formsets.formset_factory() <formsets-max-num>` 和 :ref:`django.forms.models.modelformset_factory() <model-formsets-max-num>` 函数中的默认值和解释略有变化。这个变更也影响了内联管理对象的 :attr:`~django.contrib.admin.InlineModelAdmin.max_num` 参数的使用方式。

source: Previously, the default value for ``max_num`` was ``0`` (zero). FormSets then used the boolean value of ``max_num`` to determine if a limit was to be imposed on the number of generated forms. The default value of ``0`` meant that there was no default limit on the number of forms in a FormSet.
id: Sebelumnya, nilai awalan untuk ``max_num`` adalah ``0`` (nol). FormSet kemudian menggunakan nilai boolean dari ``max_num`` untuk menentukan jika sebuah batasan untuk dikenakan pada sejumlah formulir yang dibangkitkan. Nilai awalan dari ``0`` berarti bahwa tidak ada batasan awalan pada sejumlah formulir di FormSet.
zh_hans: 以前，``max_num`` 的默认值是 ``0`` （零）。FormSets 然后使用 ``max_num`` 的布尔值来确定是否要对生成的表单数量设置限制。默认值 ``0`` 意味着在 FormSet 中没有默认限制的表单数量。

source: Starting with 1.2, the default value for ``max_num`` has been changed to ``None``, and FormSets will differentiate between a value of ``None`` and a value of ``0``. A value of ``None`` indicates that no limit on the number of forms is to be imposed; a value of ``0`` indicates that a maximum of 0 forms should be imposed. This doesn't necessarily mean that no forms will be displayed -- see the :ref:`ModelFormSet documentation <model-formsets-max-num>` for more details.
id: Dimulai dengan 1.2, nilai awalan untuk ``max_num`` telah dirubah menjadi ``None``, dan FormSet akan berbeda diantara sebuah nilai ``None`` dan sebuah nilai ``0``. Sebuah nilai ``None`` mengindikasikan bahwa tidak ada batasan pada angka dari formulir yang akan dikenakan; sebuah nilai ``0`` mengindikasikan bahwa maksimum dari 0 formulir harus dikenakan. Ini tidak berarti bahwa tidak ada formulir akan ditampilkan -- lihat :ref:`ModelFormSet documentation <model-formsets-max-num>` untuk rincian lebih.
zh_hans: 从 1.2 版本开始，``max_num`` 的默认值已更改为 ``None``，并且 FormSets 将区分 ``None`` 和 ``0`` 之间的值。``None`` 表示不限制表单数量；``0`` 表示最多允许 0 个表单。这并不一定意味着不会显示任何表单 - 请参阅 :ref:`ModelFormSet 文档 <model-formsets-max-num>` 获取更多详细信息。

source: If you were manually specifying a value of ``0`` for ``max_num``, you will need to update your FormSet and/or admin definitions.
id: Jika anda secara manual menentukan sebuah nilai dari ``0`` untuk ``max_num``, anda akan butuh memperbaharui FormSet anda dan/atau pengertian admin.
zh_hans: 如果你手动指定了 ``0`` 作为 ``max_num`` 的值，你需要更新你的 FormSet 和/或管理定义。

source: An undocumented regular expression for validating email addresses has been moved from ``django.form.fields`` to ``django.core.validators``. You will need to update your imports if you are using it.
id: Regular expression tidak terdokumentasi untuk pengecekan alamat surel telah dipindahkan dari ``django.form.fields`` ke ``django.core.validators``. Anda akan butuh memperbaharui impor anda jika anda menggunakannya.
zh_hans: 一个未记录的用于验证电子邮件地址的正则表达式已从 ``django.form.fields`` 移动到了 ``django.core.validators``。如果你在使用它，你需要更新你的导入。

source: Features deprecated in 1.2
id: Fitur usang di 1.2
zh_hans: 在 1.2 中被废弃的功能

source: Finally, Django 1.2 deprecates some features from earlier releases. These features are still supported, but will be gradually phased out over the next few release cycles.
id: Akhirnya, Django 1.2 mengusangkan beberapa fitur dari terbitan paling awal. Fitur-fitur ini masih didukung, tetapi akan secara bertahap selama beberapa siklus terbitan selanjutnya.
zh_hans: 最后，Django 1.2 弃用了一些早期版本的功能。这些功能仍然受支持，但将在接下来的几个版本周期内逐步淘汰。

source: Code taking advantage of any of the features below will raise a ``PendingDeprecationWarning`` in Django 1.2. This warning will be silent by default, but may be turned on using Python's :mod:`warnings` module, or by running Python with a ``-Wd`` or ``-Wall`` flag.
id: Kode mengambil keuntungan dari fitur-fitur dibawah akan memunculkan sebuah ``PendingDeprecationWarning`` di Django 1.2. Peringatan ini akan diam secara awalan, tetapi mungkin menyala menggunakan modul :mod:`warnings` Python, atau dengan menjalankan Python dengan sebuah bendera ``-Wd`` atau ``-Wall``.
zh_hans: 使用以下任何功能的代码将在 Django 1.2 中引发 ``PendingDeprecationWarning``。这个警告默认情况下会被忽略，但可以使用 Python 的 :mod:`warnings` 模块来打开它，或者通过使用 ``-Wd`` 或 ``-Wall`` 标志来运行 Python 来启用它。

source: In Django 1.3, these warnings will become a ``DeprecationWarning``, which is *not* silent. In Django 1.4 support for these features will be removed entirely.
id: Di Django 1.3, peringatan ini akan menjadi sebuah ``DeprecationWarning``, yang *tidak* diam. Di Django 1.4 dukungan untuk fitur-fitur ini akan dipindahkan seluruhnya.
zh_hans: 在 Django 1.3 中，这些警告将变为 ``DeprecationWarning``，它不会被忽略。在 Django 1.4 中，对这些功能的支持将完全移除。

source: For more details, see the documentation :doc:`Django's release process </internals/release-process>` and our :doc:`deprecation timeline </internals/deprecation>`.`
id: Untuk lebih rinci, lihat dokumentasi :doc:`pengolahan terbitan Django </internals/release-process>` dan :doc:`linimasa bantahan </internals/deprecation>`.` kami
zh_hans: 有关更多详细信息，请参阅文档中的 :doc:`Django 发布过程 </internals/release-process>` 和 :doc:`弃用时间表 </internals/deprecation>`。

source: Specifying databases
id: Menentukan basisdata
zh_hans: 指定数据库

source: Prior to Django 1.2, Django used a number of settings to control access to a single database. Django 1.2 introduces support for multiple databases, and as a result the way you define database settings has changed.
id: Sebelumnya pada Django 1.2, Django menggunakan sejumlah pengaturan untuk mengendalikan akses ke basisdata tunggal. Django 1.2 memperkenalkan dukungan untuk basisdata banyak, dan sebagai sebuah hasil cara anda menentukan pengaturan basisdata telah berubah.
zh_hans: 在 Django 1.2 之前，Django 使用了许多设置来控制访问单个数据库。 Django 1.2 引入了对多数据库的支持，因此定义数据库设置的方式发生了变化。

source: Any existing Django settings file will continue to work as expected until Django 1.4. Until then, old-style database settings will be automatically translated to the new-style format.
id: Tiap pengaturan Django yang ada akan lanjut bekerja sesuai diharapkan sampai Django 1.4. Sampai kemudian pengaturan basisdata gaya-lama akan otomatis diterjemahkan ke bentuk gaya-baru.
zh_hans: 任何现有的 Django 设置文件将继续按预期工作，直到 Django 1.4 。在此之前，旧式数据库设置将自动转换为新式格式。

source: In the old-style (pre 1.2) format, you had a number of ``DATABASE_`` settings in your settings file. For example::
id: Di bentuk gaya-lama (pra 1.2), anda mempunyai sejumlah pengaturan ``DATABASE_`` di berkas pengaturan anda. Sebagai contoh::
zh_hans: 在旧式（1.2 版之前）的格式中，你的设置文件中有许多 ``DATABASE_`` 设置。例如：

source: These settings are now in a dictionary named :setting:`DATABASES`. Each item in the dictionary corresponds to a single database connection, with the name ``'default'`` describing the default database connection. The setting names have also been shortened. The previous sample settings would now look like this::
id: Pengaturan ini sekarang di kamus dinamai :setting:`DATABASES`. Setiap barang di kamus berhubungan ke hubungan basisdata tunggal, dengan nama ``'default'`` menggambarkan hubungan basisdata awalan. Nama pengaturan juga diperpendek. Contoh pengaturan sebelumnya akan terlihat seperti ini::
zh_hans: 这些设置现在在名为 :setting:`DATABASES` 的字典中。字典中的每个条目对应一个单独的数据库连接，名称为 ``'default'`` 描述了默认的数据库连接。设置的名称也已经缩短。之前的示例设置现在会像这样：

source: This affects the following settings:
id: Ini mempengaruhi pengaturan berikut:
zh_hans: 这影响了以下设置：

source: Old setting
id: Pengaturan lama
zh_hans: 旧设置

source: New Setting
id: Pengaturan Baru
zh_hans: 新设置

source: These changes are also required if you have manually created a database connection using ``DatabaseWrapper()`` from your database backend of choice.
id: Perubahan ini juga dibutuhkan jika anda manual membuat sambungan basisdata menggunakan ``DatabaseWrapper()`` dari pilihan backend basisdata anda.
zh_hans: 如果你使用所选择的数据库后端手动创建了数据库连接，这些更改也是必需的，可以使用 ``DatabaseWrapper()``。

source: In addition to the change in structure, Django 1.2 removes the special handling for the built-in database backends. All database backends must now be specified by a fully qualified module name (i.e., ``django.db.backends.postgresql_psycopg2``, rather than just ``postgresql_psycopg2``).
id: Sebagai tambahan pada perubahan di struktur, Django 1.2 memindahkan penanganan khusus untuk backend basisdata siap-pakai. Semua backend basisdata harus sekarang ditentukan oleh sepenuhnya nama modul berkualitas (yaitu, ``django.db.backends.postgresql_psycopg2``, daripada hanya ``postgresql_psycopg2``).
zh_hans: 除了结构的变更，Django 1.2 还移除了内置数据库后端的特殊处理。现在，所有的数据库后端都必须使用完全限定的模块名来指定（例如，``django.db.backends.postgresql_psycopg2``，而不仅仅是 ``postgresql_psycopg2``）。

source: ``postgresql`` database backend
id: Backend basisdata ``postgresql``
zh_hans: ``postgresql`` 数据库后端

source: The ``psycopg1`` library has not been updated since October 2005. As a result, the ``postgresql`` database backend, which uses this library, has been deprecated.
id: Pustaka ``psycopg1`` belum diperbaharui sejak Oktober 2005. Sebagai hasilnya, backend basisdata ``postgresql``, yang menggunakan pustaka ini, telah diusangkan.
zh_hans: ``psycopg1`` 库自 2005 年 10 月以来没有更新。因此，使用这个库的 ``postgresql`` 数据库后端已经被弃用。

source: If you are currently using the ``postgresql`` backend, you should migrate to using the ``postgresql_psycopg2`` backend. To update your code, install the ``psycopg2`` library and change the :setting:`ENGINE <DATABASE-ENGINE>` setting to use ``django.db.backends.postgresql_psycopg2``.
id: Jika anda saat ini menggunakan backend ``postgresql``, anda harus pindah menggunakan backend ``postgresql_psycopg2``. Untuk memperbaharui kode anda, pasang pustaka ``psycopg2`` dan rubah pengaturan :setting:`ENGINE <DATABASE-ENGINE>` untuk menggunakan ``django.db.backends.postgresql_psycopg2``.
zh_hans: 如果你目前正在使用 ``postgresql`` 后端，你应该迁移到使用 ``postgresql_psycopg2`` 后端。要更新你的代码，安装 ``psycopg2`` 库，并将 :setting:`ENGINE <DATABASE-ENGINE>` 设置更改为使用 ``django.db.backends.postgresql_psycopg2``。

source: CSRF response-rewriting middleware
id: Middleware menulis kembali-tanggapan CSRF
zh_hans: CSRF 响应重写中间件

source: ``CsrfResponseMiddleware``, the middleware that automatically inserted CSRF tokens into ``POST`` forms in outgoing pages, has been deprecated in favor of a template tag method (see above), and will be removed completely in Django 1.4. ``CsrfMiddleware``, which includes the functionality of ``CsrfResponseMiddleware`` and ``CsrfViewMiddleware``, has likewise been deprecated.
id: ``CsrfResponseMiddleware``, middleware yang secara otomatis memasukkan token CSRF kedalam formulir ``POST`` dalam halaman keluar, telah diusangkan mendukung dari sebuah metode etiket cetakan (lihat diatas), dan akan dipindahkan seluruhnya di Django 1.4. ``CsrfMiddleware``, yang menyertakan kegunaan dari ``CsrfResponseMiddleware`` dan ``CsrfViewMiddleware``, begitu juga telah diusangkan.
zh_hans: ``CsrfResponseMiddleware``，自动在传出页面的 ``POST`` 表单中插入 CSRF 令牌的中间件，已被弃用，推荐使用模板标签方法（见上文），并将在 Django 1.4 中完全移除。同样，包含了 ``CsrfResponseMiddleware`` 和 ``CsrfViewMiddleware`` 功能的 ``CsrfMiddleware`` 也已被弃用。

source: Also, the CSRF module has moved from contrib to core, and the old imports are deprecated, as described in the upgrading notes.
id: Juga, modul CSRF telah pindah dari bantuan ke inti, dan impor lama telah diusangkan, seperti dijabarkan di catatan peningkatan.
zh_hans: 此外，CSRF 模块已从 contrib 转移到核心，旧的导入已被弃用，如升级说明中所述。

source: The ``SMTPConnection`` class has been deprecated in favor of a generic email backend API. Old code that explicitly instantiated an instance of an SMTPConnection::
id: Kelas ``SMTPConnection`` telah diusangkan dalam mendukung dari API backend surel umum. Kode lama yang secara eksplisit sipakai sebuah instance dari sebuah SMTPConnection::
zh_hans: ``SMTPConnection`` 类已被弃用，以支持通用的电子邮件后端 API。旧代码中明确实例化 ``SMTPConnection`` 实例的方式已被弃用：

source: ...should now call :meth:`~django.core.mail.get_connection()` to instantiate a generic email connection::
id: ...harus sekarang memanggil :meth:`~django.core.mail.get_connection()` untuk mencontohkan hubungan surel umum::
zh_hans: ...现在应该调用 :meth:`~django.core.mail.get_connection()` 来实例化一个通用的电子邮件连接：
