Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django version 0.95 release notes
id: Catatan terbitan Django versi 0.95
zh_hans: Django 0.95 版本发布说明

source: Welcome to the Django 0.95 release.
id: Selamat datang di terbitan Django 0.95.
zh_hans: 欢迎来到 Django 0.95 版本

source: This represents a significant advance in Django development since the 0.91 release in January 2006. The details of every change in this release would be too extensive to list in full, but a summary is presented below.
id: Ini mewakili peningkatan signifikan di pengembangan Django sejak terbitan 0.91 di Januari 2006. Rincian dari setiap perubahan di terbitan ini akan terlalu panjang untuk di daftarkan, tetapi ringkasan dihadirkan dibawah.
zh_hans: 这表明了一个从 2006 年 1 月发布 0.91 版本以来 Django 部署过程的一个显著的进步。将这次发版的每一个改动的细节都详细的罗列出来将会占用太多的版面，但是下面有一个简短的介绍总结。

source: Suitability and API stability
id: Kesesuaian dan Kestabilan API
zh_hans: 适用性和 API 的稳定性

source: This release is intended to provide a stable reference point for developers wanting to work on production-level applications that use Django.
id: Terbitan ini bermaksud untuk menyediakan titik acuan stabil untuk pemngembang ingin bekerja pada aplikasi tingkat-produksi yang menggunakan Django.
zh_hans: 这个发行版的目的是为想要在生产级应用中使用 Django 的开发者提供一个稳定的参考点。

source: However, it's not the 1.0 release, and we'll be introducing further changes before 1.0. For a clear look at which areas of the framework will change (and which ones will *not* change) before 1.0, see the ``api-stability.txt`` file, which lives in the docs/ directory of the distribution.
id: Bagaimanapun, ini bukan terbiatan 1.0, dan kami akan memperkenalkan perubahan lebih lanjut sebelum 1.0. Untuk tampilan bersih yang kawasan dari kerangka akan berubah (dan yang mana *tidak* akan berubah) sebelum 1.0, lihat berkas ``api-stability.txt``, yang berada di direktori docs/ dari penyebaran.
zh_hans: 然而，这并不是 1.0 版本，我们将在 1.0 之前引入更多变化。要想清楚地了解在 1.0 之前框架的哪些地方会发生变化（哪些地方不会发生变化），请看 ``api-stability.txt`` 文件，它位于发行版的 docs/ 目录中。

source: You may have a need to use some of the features that are marked as "subject to API change" in that document, but that's OK with us as long as it's OK with you, and as long as you understand APIs may change in the future.
id: Anda mungkin butuh menggunakan beberapa fitur yang ditandai sebagai "subyek ke perubahan API" di dokumen itu, tetapi tidak masalah dengan kami selama itu OKE dengan anda, dan selama anda memahami API mungkin berubah di masa depan.
zh_hans: 不可能需要使用一些在该文档中被标记为 “subject to API change” 的功能，但只要你觉得没问题，我们也没问题，只要你理解 API 将来可能会改变。

source: Fortunately, most of Django's core APIs won't be changing before version 1.0. There likely won't be as big of a change between 0.95 and 1.0 versions as there was between 0.91 and 0.95.
id: Untungnya, kebanyakan inti API Django tidak akan berubah sebelum versi 1.0. Ada kemungkinan tidak akan sebesar perubahan diantara versi 0.95 dan 1.0 seperti ada diantara 0.91 dan 0.95.
zh_hans: 幸运的是，在 1.0 版本之前，Django 的大部分核心 API 都不会发生变化。0.95 和 1.0版本之间可能不会像 0.91 和 0.95 之间有那么大的变化。

source: Changes and new features
id: Perubahan dan fitur baru
zh_hans: 改变及新特性

source: The major changes in this release (for developers currently using the 0.91 release) are a result of merging the 'magic-removal' branch of development. This branch removed a number of constraints in the way Django code had to be written that were a consequence of decisions made in the early days of Django, prior to its open-source release. It's now possible to write more natural, Pythonic code that works as expected, and there's less "black magic" happening behind the scenes.
id: Perubahan utama di terbitan ini (untuk pengembang saat ini menggunakan terbitan 0.91) adalah hasil penggabungan cabang 'magic-removal' dai pengembangan Cabang ini memindahkan sejumlah kendala di jalan kode Django harus ditulis yang merupakan konsekuensi dari keputusan yang dibuat hari sebelumnya dari Django, sebelumnya terbitan sumber terbukanya. DIa sekaran mungkin ditulis lebih alami, kode Python yang bekerja sesuai harapan, dan terdapat sedikit "black magic" terjadi dibelakang layar.
zh_hans: 这个版本的主要变化（对于目前使用 0.91 版本的开发者来说）是合并了 'magic-removal' 开发分支的结果。这个分支删除了 Django 代码编写方式中的一些限制因素，这些限制因素是 Django 在开源发布之前的早期决定的结果。现在，我们可以写出更自然、更符合预期的 Pythonic 代码，而且幕后发生的“黑魔法”也少了。

source: Aside from that, another main theme of this release is a dramatic increase in usability. We've made countless improvements in error messages, documentation, etc., to improve developers' quality of life.
id: Disamping dari itu, tema utama lain dai terbitan ini adalah peningkatan dramatis dalam penggunakan. Kami telah membuat perbaikan tidak terhitung di pesan kesalahan, dokumentasi, dll, untuk memperbaiki kualias kehidupan pengembang.
zh_hans: 除此之外，此版本的另一个主题是可用性的显着增加。 我们在错误消息、文档等方面做了无数改进，以提高开发人员的生活质量。

source: The new features and changes introduced in 0.95 include:
id: Fitur baru dan perubahan diperkenalkan di 0.95 termasuk:
zh_hans: 在 0.95 版本中引入的新特性和变更包括：

source: Django now uses a more consistent and natural filtering interface for retrieving objects from the database.
id: Django sekarang menggunakan antarmuka penyaringan lebih konsisten dan alami untuk mengambil obyek dari basisdata.
zh_hans: Django 现在使用更一致和自然的过滤接口来从数据库中检索对象。

source: User-defined models, functions and constants now appear in the module namespace they were defined in. (Previously everything was magically transferred to the ``django.models.*`` namespace.)
id: Model ditentukan-pengguna, fungsi dan konstanta sekarang muncul di namespace modul mereka telah tentukan. (Sebelumnya semuanya adalah secara ajaib dipindahkan ke namespace django.namespace.*)
zh_hans: 用户定义的模型、函数和常量现在出现在它们所定义的模块命名空间中。（以前所有的东西都被神奇地转移到 ``django.models.*`` 的命名空间。）

source: Some optional applications, such as the FlatPage, Sites and Redirects apps, have been decoupled and moved into ``django.contrib``. If you don't want to use these applications, you no longer have to install their database tables.
id: Beberapa pilihan aplikasi, seperti aplikasi FlatPage, Sites dan Redirects, telah dipisahkan dan dipindah kedalam ``django.contrib``. Jika anda tidak menggunakan aplikasi ini, anda tidak lagi harus memasang tabel-tabel basisdata mereka.
zh_hans: 一些可选的应用程序，如简单页面、站点和重定向应用，已经解耦并移入 ``django.contrib``。 如果您不想使用这些应用程序，则不必再安装其数据库表中。

source: Django now has support for managing database transactions.
id: Django sekarang telah mendukung untuk mengelola transaksi basisdata
zh_hans: Django 现在支持管理数据库事务

source: We've added the ability to write custom authentication and authorization backends for authenticating users against alternate systems, such as LDAP.
id: Kami telah menambahkan kemampuan untuk menulis backend pembuktian keaslian dan otorisasi penyesuaian untuk membuktikan keaslian pengguna terhadap sistem bergilir, seperti LDAP.
zh_hans: 我们添加了编写自定义身份验证和授权后端的功能，以便针对备用系统（如 LDAP）对用户进行身份验证。

source: We've made it easier to add custom table-level functions to models, through a new "Manager" API.
id: Kami telah membuatnya lebih mudah untuk menambahkan fungsi tingkatan-tabel penyesuaian untuk model, melalui sebuah API "Pengelola" baru.
zh_hans: 通过新的 “Manager” API，我们可以更轻松地将自定义表级功能添加到模型中。

source: It's now possible to use Django without a database. This simply means that the framework no longer requires you to have a working database set up just to serve dynamic pages. In other words, you can just use URLconfs/views on their own. Previously, the framework required that a database be configured, regardless of whether you actually used it.
id: Sekarang memungkinkan menggunakan Django tanpa basisdata. Mudah disini berarti bahwa kerangka kerja tidak lagi membutuhkan anda untuk memiliki setelan basisdata yang bekerja hanya untuk melayani halaman dinamis. Dengan kata lain, anda dapat hanya menggunakan URLconfs/views pada milik mereka sendiri. Sebelumnya, kerangka kerja mewajibkan bahwa sebuah basisdata untuk dikonfigurasi, tanpa memperhatikan apakah anda sebenarnya menggunakannya.
zh_hans: 现在可以在没有数据库的情况下使用 Django 了。这意味着框架不再需要你有一个工作的数据库来提供动态页面。换句话说，你可以只使用 URLconfs／views 本身。以前，该框架要求配置数据库，而不管你是否真的使用它。

source: It's now more explicit and natural to override ``save()`` and ``delete()`` methods on models, rather than needing to hook into the ``pre_save()`` and ``post_save()`` method hooks.
zh_hans: 现在，在模型上覆盖 save() 和 delete() 方法更加明确和自然，而不需要挂载 pre_save() 和 post_save() 方法的钩子。

source: Individual pieces of the framework now can be configured without requiring the setting of an environment variable. This permits use of, for example, the Django templating system inside other applications.
id: Potongan tersendiri dari kerangka sekarang dapat dikonfigurasi tanpa membutuhkan pengaturan dari sebuah variabel lingkungan. Ini mengizinkan penggunaan, sebagai contoh, sistem pencetakan Django di dalam aplikasi lain.
zh_hans: 现在，框架的各个部分可以在不需要设置环境变量的情况下进行配置。这允许在其他应用程序中使用 Django 模板系统。

source: More and more parts of the framework have been internationalized, as we've expanded internationalization (i18n) support. The Django codebase, including code and templates, has now been translated, at least in part, into 31 languages. From Arabic to Chinese to Hungarian to Welsh, it is now possible to use Django's admin site in your native language.
id: Lebih dan lebih bagian dari kerangka telah di internasionalisasikan, sesuai yang kami telah luaskan dukungan internasionalisasi (i18n). Basis kode Django, termasuk kode dan cetakan, telah diterjemahkan, setidaknya dalam bagian, kedalam 31 bahasa. Dari Arab ke China ke Hogoria ke Wales, sekarang memungkinkan menggunakan situs admin Django dalam bahasa asli anda.
zh_hans: 随着我们扩展国际化（i18n）支持，该框架的越来越多部分已经实现了国际化。 Django 代码库（包括代码和模板）现已完成翻译，至少支持部分语言，多达 31种。支持了阿拉伯语，中文，匈牙利语，以及威尔士语，现在以母语使用 Django 的管理站点。

source: The number of changes required to port from 0.91-compatible code to the 0.95 code base are significant in some cases. However, they are, for the most part, reasonably routine and only need to be done once. A list of the necessary changes is described in the `Removing The Magic`_ wiki page. There is also an easy checklist_ for reference when undertaking the porting operation.
id: Sejumlah perubahan wajib untuk menghubungkan dari kode sepadan -0.91 ke kode dasar 0.95 adalah penting dalam beberapa kasus. Bagaimanapun, mereka adalah, untuk kebanyakan bagian, cukup rutin dan hanya butuh dilakukan sekali. Sebuah daftar dari perubahan yang dibutuhkan digambarkan dalam halaman wiki `Removing The Magic`_ . Ada juga daftar centang mudah untuk acuan ketika berusaha melakukan tindakan penghubungan.
zh_hans: 在某些情况下，从 0.91 兼容代码移植到 0.95 代码库所需的改动数量很大。然而，在大多数情况下，这些改动都是合理的常规改动，只需要做一次。在 `Removing The Magic`_ wiki 页面中描述了一个必要的更改列表。还有一个简单的 checklist_ ，供进行移植操作时参考。

source: Problem reports and getting help
id: Laporan masalah dan mendapatkn bantuan
zh_hans: 报告问题以及获取帮助

source: Need help resolving a problem with Django? The documentation in the distribution is also available :doc:`online </index>` at the `Django website`_. The :doc:`FAQ </faq/index>` document is especially recommended, as it contains a number of issues that come up time and again.
id: Butuh bantuan menyelesaikan sebuah masalah dengan Django? Dokumentasi dalam sebaran juga tersedia :doc:`online </index>` pada `Django website`_. Dokumen :doc:`FAQ </faq/index>` khususnya dianjurkan, seperti mengandung sejumlah masalah yang datang dan kembali.
zh_hans: 需要帮助来解决 Django 相关的问题吗？在发行包中的文档也可以在 `Django 官网`_ 中的 :doc:`在线文档</index>` 处找到。其中 :doc:`FAQ </faq/index>` 文档尤为推荐，因为它包含那些针对时不时会出现问题的解决方法。

source: For more personalized help, the `django-users`_ mailing list is a very active list, with more than 2,000 subscribers who can help you solve any sort of Django problem. We recommend you search the archives first, though, because many common questions appear with some regularity, and any particular problem may already have been answered.
id: Untuk bantuan lebih pribadi, daftar penyuratan `django-users`_ adalah daftar sangat aktif, dengan lebih dari 2.000 pelanggan yang dapat membantu anda menyelesaikan semacam masalah Django. Kami menganjurkan anda mencari arsip terlebih dahulu, meskipun, karena banyak pertanyaan umum muncul dengan beberapa ketetapan, dan masalah tertentu apapun mungkin sudah telah dijawab.
zh_hans: 对于更个性化的帮助，`django-users`_ 邮件列表是一个活跃的邮件列表，它有超过 2000 个订阅者，他们可以帮助你解决 Django 的各类问题。我们推荐你首先搜索查看以前的存档，因为很多通用问题经常出现多次，而那些特定问题可能也已经被回答了。

source: Finally, for those who prefer the more immediate feedback offered by IRC, there's a ``#django`` channel on ``irc.libera.chat`` that is regularly populated by Django users and developers from around the world. Friendly people are usually available at any hour of the day -- to help, or just to chat.
zh_hans: 最后，对于那些愿意更快通过IRC提供反馈的人们，在 ``irc.libera.chat`` 上有一个 ``#django`` 频道，是由Django用户和全世界开发者们发起的。友善的人们常常在一天中可用的任何时间里去帮助频道里的人，或者就是聊一聊天。

source: Thanks for using Django!
id: Terima kasih untuk menggunakan Django!
zh_hans: 感谢使用 Django！

source: The Django Team July 2006
id: Tim Django Juli 2006
zh_hans: Django 项目始于 2006 年 7 月

source: Django version 0.96 release notes
id: Catatan terbitan Django versi 0.96
zh_hans: Django 0.96 版本发行说明

source: Welcome to Django 0.96!
id: Selamat datang di Django 0.96!
zh_hans: 欢迎来到 Django 0.96 版本！

source: The primary goal for 0.96 is a cleanup and stabilization of the features introduced in 0.95. There have been a few small `backwards-incompatible changes`_ since 0.95, but the upgrade process should be fairly simple and should not require major changes to existing applications.
id: Sasaran utama untuk 0.96 adalah pembersihan dan stabilitas dari fitur yang diperkenalkan dalam 0.95. Ada beberapa `backwards-incompatible changes`_ kecil sejak 0.95, tetapi proses peningkatan harus mudah dan harus tidak membutuhkan perubahan besar pada aplikasi yang ada.
zh_hans: Django 0.96 版本的主要目标是清理和稳定由 0.95 版本引入的特性。自从 0.95 过后，有很多小的 `向后兼容变化`_，但升级过程应该足够简单，且针对已有的应用不应该需要重大的更改。

source: However, we're also releasing 0.96 now because we have a set of backwards-incompatible changes scheduled for the near future. Once completed, they will involve some code changes for application developers, so we recommend that you stick with Django 0.96 until the next official release; then you'll be able to upgrade in one step instead of needing to make incremental changes to keep up with the development version of Django.
id: Bagaimanapun, kami juga menerbitkan 0.96 sekarang karena kami mempunyai kumpulan jadwal perubahan bertentangan-kebelakang untuk tidak lama lagi. Sekali lengkap, mereka akan melibatkan beberapa kode perubahan untuk pengembang aplikasi, sehingga kami menganjurkan bahwa anda menempel dengan Django 0.96 sampai terbitan resmi selanjutnya; kemudian anda akan dapat meningkatkan dalam satu langkah daripada membutuhkan untuk membuat peningkatan perubahan untuk menjaga dengan pengembangan versi Django.
zh_hans: 不过，我们现在发布 0.96 版本也是因为我们计划在不久的将来进行一系列向后不兼容的改动。一旦完成，它们将涉及到应用程序开发人员的一些代码变化，所以我们建议你坚持使用 Django 0.96，直到下一个正式发布；然后你就可以一步到位地升级，而不是需要做增量的变化来跟上 Django 的开发版本。

source: Backwards-incompatible changes
id: Perubahan bertentangan-kebelakang
zh_hans: 不向后兼容的变更

source: The following changes may require you to update your code when you switch from 0.95 to 0.96:
id: Perubahan berikut mungkin membutuhkan anda memperbaharui kode anda ketika anda mengganti dari 0.95 ke 0.96:
zh_hans: 当你从 0.95 切换到 0.96 时，以下更改可能需要你更新代码：

source: ``MySQLdb`` version requirement
id: Versi wajib `MySQLdb``
zh_hans: ``MySQLdb`` 版本需求

source: Due to a bug in older versions of the ``MySQLdb`` Python module (which Django uses to connect to MySQL databases), Django's MySQL backend now requires version 1.2.1p2 or higher of ``MySQLdb``, and will raise exceptions if you attempt to use an older version.
id: Dikarenakan kesalahan di versi terlama dari modul Python ``MySQLdb`` (dimana Django gunakan untuk menghubung ke basisdata MySQL), backend MySQL Django sekarang membutuhkan versi 1.2.1p2 atau lebih tinggi dari ``MySQLdb``, dan akan memunculkan pengecualian jika anda berusaha menggunakan sebuah versi terlama.
zh_hans: 由于 ``MySQLdb`` Python 模块（Django 用来连接 MySQL 数据库）旧版本的一个漏洞，Django 的 MySQL 后端现在需要 1.2.1p2 或更高版本的 ``MySQLdb``，如果你试图使用旧版本，会引发异常。

source: If you're currently unable to upgrade your copy of ``MySQLdb`` to meet this requirement, a separate, backwards-compatible backend, called "mysql_old", has been added to Django. To use this backend, change the ``DATABASE_ENGINE`` setting in your Django settings file from this::
id: Jika anda sedang saat ini tidak dapat meningkatkan salinan anda dari ``MySQLdb`` untuk memenuhi persyaratan ini, terpisah, backend kesesuaian-kebelakang, dipanggil "mysql_old", telah ditambahkan ke Django. Untuk menggunakan backend ini, rubah pengaturan ``DATABASE_ENGINE`` di berkas pengaturan Django anda dari ini::
zh_hans: 如果你目前无法升级你的 ``MySQLdb`` 来满足这个要求，一个单独的，向后兼容的后端，叫做 “mysql_old”，已经被添加到 Django 中。要使用这个后端，将 Django 配置文件中的 ``DATABASE_ENGINE`` 配置从这个：

source: to this::
id: untuk ini::
zh_hans: 改成这个：

source: However, we strongly encourage MySQL users to upgrade to a more recent version of ``MySQLdb`` as soon as possible, The "mysql_old" backend is provided only to ease this transition, and is considered deprecated; aside from any necessary security fixes, it will not be actively maintained, and it will be removed in a future release of Django.
id: Bagaimanapun, kami sangat mendorong pengguna MySQL untuk meningkatkan lebih versi saat ini dari ``MySQLdb`` secepat mungkin, backend "mysql_old" disediakan hanya untuk memudahkan perpindahan ini, dan dipertimbangkan diusangkan, disamping dari perbaikan keamanan yang diperlukan, itu tidak akan aktif dirawat, dan itu akan dipindahkan di terbitan akan datang dari Django.
zh_hans: 然而，我们强烈建议 MySQL 用户尽快升级到最新版本的 ``MySQLdb``，提供 “mysql_old” 后端只是为了方便过渡，并且被认为是废弃的；除了任何必要的安全修复，它将不会被积极维护，并将在未来的 Django 版本中删除。

source: Also, note that some features, like the new ``DATABASE_OPTIONS`` setting (see the :doc:`databases documentation </ref/databases>` for details), are only available on the "mysql" backend, and will not be made available for "mysql_old".
id: Juga, catat bahwa beberapa fitur, seperti pengaturan ``DATABASE_OPTIONS`` baru (lihat :doc:`databases documentation </ref/databases>` untuk rincian), hanya tersedia pada backend "mysql", dan tidak akan tersedia untuk "mysql_old".
zh_hans: 另外，需要注意的是，有些功能，比如新的 ``DATABASE_OPTIONS`` 配置（详见 :doc:`数据库文档 </ref/databases>` ），只在 “mysql” 后端可用，不会对 “mysql_old” 提供。

source: Database constraint names changed
id: Nama-nama pembatas basisdata berubah
zh_hans: 数据库约束名称已更改

source: The format of the constraint names Django generates for foreign key references have changed slightly. These names are generally only used when it is not possible to put the reference directly on the affected column, so they are not always visible.
id: Bentuk dari batasan nama Django dibangkitkan untuk acuan foreign key telah berubah sedikit. Nama-nama ini umumnya hanya digunakan ketika itu tidak memungkinkan menaruh acuan secara langsung pada kolom terpengaruh, jadi mereka tidak selalu nampak.
zh_hans: Django 为外键引用生成的约束名称的格式略有改变。这些名称一般只在无法将引用直接放在受影响的列上时才会使用，所以它们并不总是可见的。

source: The effect of this change is that running ``manage.py reset`` and similar commands against an existing database may generate SQL with the new form of constraint name, while the database itself contains constraints named in the old form; this will cause the database server to raise an error message about modifying nonexistent constraints.
id: Pengaruh dari perubahan ini bahwa menjalankan ``manage.py reset`` dan erintah-perintah mirip terhadap basisdata yang ada mungkin membangkitkan SQL dengan bentuk baru dari batasan nama, selagi basisdata itu sendiri mengandung batasan bernama dalam bentuk lama; ini akan menyebabkan peladen basisdata memunculkan sebuah pesan kesalahan tentang merubah batasan-batasan yang tidak ada.
zh_hans: 这一变化的影响是，对现有数据库运行 ``manage.py reset`` 和类似的命令，可能会生成新形式的约束名称的 SQL，而数据库本身却包含旧形式的约束；这将导致数据库服务器发出关于修改不存在的约束的错误信息。

source: If you need to work around this, there are two methods available:
id: Jika anda butuh memecahkan ini, terdapat dua metode tersedia:
zh_hans: 若你需要解决此问题，那将有两种方法可用：

source: Redirect the output of ``manage.py`` to a file, and edit the generated SQL to use the correct constraint names before executing it.
id: Alihkan keluaran dari ``manage.py`` ke berkas, dan rubah SQL dibangkitkan untuk menggunakan nama batasan yang benar sebelum menjalankannya.
zh_hans: 将 ``manage.py`` 的输出重定向到一个文件中，并编辑生成的 SQL，在执行前使用正确的约束名。

source: Examine the output of ``manage.py sqlall`` to see the new-style constraint names, and use that as a guide to rename existing constraints in your database.
id: Ujikan keluaran dari ``manage.py sqlall`` untuk melihat bnama batasan gaya-baru, dan gunakan itu sebagai panduan untuk menamai kembali batasan yang ada dalam basisdata anda.
zh_hans: 检查 ``manage.py sqlall`` 的输出，看看新样式的约束名称，并以此为指导重命名数据库中的现有约束。

source: Name changes in ``manage.py``
id: Perubahan nama di ``manage.py``
zh_hans: ``manage.py`` 中的名称改变

source: A few of the options to ``manage.py`` have changed with the addition of fixture support:
id: Sedikit pilihan pada ``manage.py`` telah berubah dengan penambahan dukungan perlengkapan tetap:
zh_hans: ``manage.py`` 的一些选项在增加了固定数据支持后有所改变。

source: There are new ``dumpdata`` and ``loaddata`` commands which, as you might expect, will dump and load data to/from the database. These commands can operate against any of Django's supported serialization formats.
id: Ada perintah ``dumpdata`` dan ``loaddata`` baru yang, mungkin anda harapkan, akan mengeluarkan dan memuat data ke/dari basisdata. Perintah ini dapat beroperasi terhadap bentuk serialisasi terdukung Django apapun.
zh_hans: 有新的 ``dumpdata`` 和 ``loaddata`` 命令，正如你所期望的那样，这些命令将用来从数据库中导出和导入数据。这些命令可以对任何 Django 支持的序列化格式进行操作。

source: The ``sqlinitialdata`` command has been renamed to ``sqlcustom`` to emphasize that ``loaddata`` should be used for data (and ``sqlcustom`` for other custom SQL -- views, stored procedures, etc.).
id: Perintah ``sqlinitialdata`` telah dinamai kembali menjadi ``sqlcustom`` untuk menegaskan bahwa ``loaddata`` harus digunakan untuk data (dan ``sqlcustom`` untuk SQL penyesuaian lain -- view, store procedure, dll.).
zh_hans: ``sqlinitialdata`` 命令已改名为 ``sqlcustom``，以强调 ``loaddata`` 应用于数据（``sqlcustom`` 用于其他自定义 SQL ——视图、存储过程等）。

source: The vestigial ``install`` command has been removed. Use ``syncdb``.
id: Vestigial perintah ``install`` telah dipindahkan. Gunakan ``syncdb``.
zh_hans: ``install`` 命令已被删除。使用 ``syncdb``。

source: Backslash escaping changed
id: Pelolosan backslash berubah
zh_hans: 反斜杠转义的改变

source: The Django database API now escapes backslashes given as query parameters. If you have any database API code that matches backslashes, and it was working before (despite the lack of escaping), you'll have to change your code to "unescape" the slashes one level.
id: API basisdata Django sekarang meloloskan garis miring kebelakang yang diberikan sebagai parameter permintaan. Jika anda mempunyai kode API basisdata apapun yang cocok dengan garis miring kebelakang, dan dia bekerja sebelumnya (meskipun kurang dari pelolosa), anda harus merubah kode anda ke "unescape" garis miring satu tingkat.
zh_hans: Django 数据库 API 现在可以转义作为查询参数的反斜线。如果你有任何匹配反斜线的数据库 API 代码，并且之前还能正常工作（尽管没有转义），你必须修改你的代码，将斜线“取消转义”一个级别。

source: For example, this used to work::
id: Sebagai contoh, ini berguna untuk bekerja::
zh_hans: 例如，下面的查询在以前可以生效：

source: The above is now incorrect, and should be rewritten as::
id: Diatas sekarang tidak benar, dan harus di tulis kembali sebagai::
zh_hans: 但在现在上面的命令不再正确了，并且应该重写为下面这样：

source: Removed ENABLE_PSYCO setting
id: Pindahkan pengaturan ENABLE_PSYCO
zh_hans: 被移除的 ENABLE_PSYCO 配置
