Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Until Django 1.3, :setting:`INSTALLED_APPS` accepted wildcards in application names, like ``django.contrib.*``. The expansion was performed by a filesystem-based implementation of ``from <package> import *``. Unfortunately, this can't be done reliably.
id: Sampai DJango 1.3, :setting:`INSTALLED_APPS` menerima wildcard di nama aplikasi, seperti ``django.contrib.*``. Perluasan telah dilakukan dengan penerapan berdasarkan-sistem berkas dari ``from <package> import *``. Sayangnya, ini tidak dapat dilakukan secara handal.
zh_hans: 在 Django 1.3 之前，:setting:`INSTALLED_APPS` 中接受应用程序名称中的通配符，例如 ``django.contrib.*``。扩展是通过基于文件系统的 ``from <package> import *`` 实现的。不幸的是，这种方法无法可靠地执行。

source: This behavior was never documented. Since it is unpythonic, it was removed in Django 1.4. If you relied on it, you must edit your settings file to list all your applications explicitly.
zh_hans: 这种行为从未被记录。由于它不符合 Python 的风格，所以在 Django 1.4 中被移除了。如果您依赖于它，您必须编辑设置文件，明确列出所有应用程序。

source: ``HttpRequest.raw_post_data`` renamed to ``HttpRequest.body``
id: ``HttpRequest.raw_post_data`` dinamai kembali menjadi ``HttpRequest.body``
zh_hans: ``HttpRequest.raw_post_data`` 已经重命名为 ``HttpRequest.body``

source: This attribute was confusingly named ``HttpRequest.raw_post_data``, but it actually provided the body of the HTTP request. It's been renamed to ``HttpRequest.body``, and ``HttpRequest.raw_post_data`` has been deprecated.
id: Atribut ini membingungkan bernama ``HttpRequest.raw_post_data``, tetapi itu sebenarnya disediakan badan dari permintaan HTTP. Itu telah dinamai menjadi ``HttpRequest.body``, dan ``HttpRequest.raw_post_data`` telah diusangkan.
zh_hans: 这个属性的命名有点混淆，虽然它被命名为 ``HttpRequest.raw_post_data``，但它实际上提供了 HTTP 请求的主体。它已被重命名为 ``HttpRequest.body``，而 ``HttpRequest.raw_post_data`` 已被弃用。

source: ``django.contrib.sitemaps`` bug fix with potential performance implications
id: Perbaikan kesalahan ``django.contrib.sitemaps`` dengan peluang keterlibatan penampilan
zh_hans: ``django.contrib.sitemaps`` 中的 bug 修复可能会影响性能

source: In previous versions, ``Paginator`` objects used in sitemap classes were cached, which could result in stale site maps. We've removed the caching, so each request to a site map now creates a new Paginator object and calls the :attr:`~django.contrib.sitemaps.Sitemap.items()` method of the :class:`~django.contrib.sitemaps.Sitemap` subclass. Depending on what your ``items()`` method is doing, this may have a negative performance impact. To mitigate the performance impact, consider using the :doc:`caching framework </topics/cache>` within your ``Sitemap`` subclass.
id: Di versi sebelumnya, obyek ``Paginator`` digunakan di kelas-kelas peta situs telah disembunyikan, yang dapat menghasilkan di peta situs basi. Kami telah memindahkan penyembunyian, jadi setiap permintaan pada sebuah peta situs sekarang membuat obyek Paginator baru dan memanggil metode :attr:`~django.contrib.sitemaps.Sitemap.items()` dari subkelas :class:`~django.contrib.sitemaps.Sitemap`. Tergantung pada apa metode ``items()``anda lakukan, ini mungkin mempunyai dampak penampilan negatif, pertimbangkan menggunakan :doc:`caching framework </topics/cache>` dalam subkelas ``Sitemap`` anda.
zh_hans: 在之前的版本中，用于站点地图类的 ``Paginator`` 对象被缓存，这可能导致站点地图过期。我们已经移除了缓存，所以现在每次请求站点地图都会创建一个新的 Paginator 对象，并调用 :class:`~django.contrib.sitemaps.Sitemap` 子类的 :attr:`~django.contrib.sitemaps.Sitemap.items()` 方法。根据你的 ``items()`` 方法的具体操作，这可能会对性能产生负面影响。为了缓解性能影响，考虑在你的 ``Sitemap`` 子类中使用 :doc:`缓存框架 </topics/cache>`。

source: Versions of Python-Markdown earlier than 2.1
id: Versi dari Python-Markdown lebih awal daripada 2.1
zh_hans: 早于 2.1 版本的 Python-Markdown

source: Versions of Python-Markdown earlier than 2.1 do not support the option to disable attributes. As a security issue, earlier versions of this library will not be supported by the markup contrib app in 1.5 under an accelerated deprecation timeline.
id: Versi dari Python-Markdown paling awal dari 2.1 tidak mendukung pilihan untuk meniadakan atribut. Seperti masalah keamanan, versi paling awal dari pustaka ini tidak akan didukung oleh aplikasi bantuan markah di 1.5 dibawah linimasa pengusangan dipercepat.
zh_hans: 早于 2.1 版本的 Python-Markdown 不支持禁用属性的选项。作为一个安全问题，在加速弃用时间表下，1.5 版本的 markup contrib 应用程序将不支持此库的早期版本。

source: Django 1.4.1 release notes
id: Catatan terbitan Django 1.4.1
zh_hans: Django 1.4.1 版本发行说明

source: This is the first security release in the Django 1.4 series, fixing several security issues in Django 1.4. Django 1.4.1 is a recommended upgrade for all users of Django 1.4.
id: Ini adalah terbitan keamanan pertama di rangkaian Django 1.4, memperbaiki beberapa masalah keamanan di Django 1.4. Django 1.4.1 adalah peningkatan dianjurkan untuk semua pengguna dari Django 1.4.
zh_hans: 这是 Django 1.4 系列中的第一个安全发布，修复了 Django 1.4 中的几个安全问题。对于所有 Django 1.4 用户，推荐升级到 Django 1.4.1 。

source: Django 1.4.10 release notes
id: Catatan terbitan Django 1.4.10
zh_hans: Django 1.4.10 版本发行说明

source: *November 6, 2013*
zh_hans: *2013 年 11 月 6 日*

source: Django 1.4.10 fixes a Python-compatibility bug in the 1.4 series.
id: Django 1.4.10 memperbaiki sebuah kesalahan kesesuaian-Python di rangkaian 1.4.
zh_hans: Django 1.4.10 修复了 1.4 系列中的一个 Python 兼容性错误。

source: Django 1.4.9 inadvertently introduced issues with Python 2.5 compatibility. Django 1.4.10 restores Python 2.5 compatibility. This was issue #21362 in Django's Trac.
id: Django 1.4.9 secara tidak sengaja memperkenalkan masalah-masalah dengan kesesuaian Python 2.5. Django 1.4.10 mengembalikan kesesuaian Python 2.5. Ini adalah masalah #21362 di Trac Django.
zh_hans: Django 1.4.9 无意中引入了与 Python 2.5 兼容性的问题。 Django 1.4.10 恢复了 Python 2.5 的兼容性。这是 Django Trac 中的问题 #21362 。

source: Django 1.4.11 release notes
id: Catatan terbitan Django 1.4.11
zh_hans: Django 1.4.11 版本发行说明

source: *April 21, 2014*
zh_hans: *2014 年 4 月 21 日*

source: Django 1.4.11 fixes three security issues in 1.4.10. Additionally, Django's vendored version of six, ``django.utils.six``, has been upgraded to the latest release (1.6.1).
id: Django 1.4.11 memperbaiki tiga masalah keamanan dalam 1.4.10. Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.6.1).
zh_hans: Django 1.4.11 修复了 1.4.10 中的三个安全问题。另外，Django 中内置的 six 版本，即 ``django.utils.six``，已经升级到最新版本 (1.6.1)。

source: Unexpected code execution using ``reverse()``
id: Mengerjakan kode tidak diharapkan menggunakan ``reverse()``
zh_hans: 使用 ``reverse()`` 时出现意外的代码执行

source: Django's URL handling is based on a mapping of regex patterns (representing the URLs) to callable views, and Django's own processing consists of matching a requested URL against those patterns to determine the appropriate view to invoke.
id: Penangangan URL Django berdasarkan pada pemetaan dari pola reggex (mewakili URL) pada tampilan callable, dan pengolahan sendiri Django terdiri dari mencocokkan URL diminta terhadap pola tersebut untuk menentukan tampilan sesuai untuk diminta.
zh_hans: Django 的 URL 处理基于正则表达式模式（表示 URL）到可调用视图的映射，而 Django 自身的处理包括将请求的 URL 与这些模式进行匹配，以确定要调用的适当视图。

source: Django also provides a convenience function -- ``reverse()`` -- which performs this process in the opposite direction. The ``reverse()`` function takes information about a view and returns a URL which would invoke that view. Use of ``reverse()`` is encouraged for application developers, as the output of ``reverse()`` is always based on the current URL patterns, meaning developers do not need to change other code when making changes to URLs.
id: Django juga menyediakan fungsi nyaman -- ``reverse()`` -- yang melakukan pengolahan ini di arah berlawanan. Fungsi ``reverse()`` mengambil informasi tentang sebuah tampilan dan mengembalikan sebuah URL yang akan memohon tampilan itu. Penggunaan ``reverse()`` adalah didorong untuk pengembang aplikasi, sebagai keluaran dari ``reverse()`` selalu berdasarkan pada pola URL saat ini, berarti pengembang tidak butuh merubah kode lain ketika membuat perubahan pada URL.
zh_hans: Django 还提供了一个方便的函数 -- ``reverse()`` -- 用于执行与之相反的过程。``reverse()`` 函数接收有关视图的信息，并返回调用该视图的 URL。鼓励应用程序开发人员使用 ``reverse()``，因为``reverse()`` 的输出总是基于当前的 URL 模式，这意味着开发人员在更改 URL 时不需要修改其他代码。

source: One argument signature for ``reverse()`` is to pass a dotted Python path to the desired view. In this situation, Django will import the module indicated by that dotted path as part of generating the resulting URL. If such a module has import-time side effects, those side effects will occur.
id: Satu tanda tangan argumen untuk ``reverse()`` adalah melewatkan jalur Python bertitik untuk tampilan yang diinginkan. Dalam keadaan ini, Django akan mengimpor modul yang diarahkan oleh jalur bertitik itu sebagai bagian dari membangkitkan URL dihasilkan. Jika modul tersebut mempunyai efek samping waktu-impor, efek samping tersebut akan muncul.
zh_hans: ``reverse()`` 的一个参数签名是传递所需视图的点分 Python 路径。在这种情况下，Django 将导入由该点分路径指示的模块，作为生成结果 URL 的一部分。如果这样的模块在导入时具有副作用，那么这些副作用将会发生。

source: Thus it is possible for an attacker to cause unexpected code execution, given the following conditions:
id: Dengan demikian itu sangat mungkin untuk seorang penyerang menyebabkan pengerjaan kode tidak diharapkan, memberikan kondisi berikut:
zh_hans: 因此，在满足以下条件时，攻击者可能导致意外的代码执行：

source: One or more views are present which construct a URL based on user input (commonly, a "next" parameter in a querystring indicating where to redirect upon successful completion of an action).
id: Satu atau lebih tampilan hadir yang membangun URL berdasarkan pada masukan pengguna (umumnya, parameter "next" dalam querystring mengindikasikan dimana untuk mengarahkan keberhasilan pelengkapan dari sebuah tindakan).
zh_hans: 存在一个或多个视图，它们根据用户输入构建 URL（通常是查询字符串中的“next”参数，指示在操作成功完成后重定向到哪里）。

source: One or more modules are known to an attacker to exist on the server's Python import path, which perform code execution with side effects on importing.
id: Satu atau lebih modul diketahui penyerang untuk ada di jalur impor Python peladen, yang melakukan pengerjaan kode dengan efek samping pada pengimporan.
zh_hans: 攻击者知道服务器的 Python 导入路径上存在一个或多个模块，在导入时执行具有副作用的代码。

source: To remedy this, ``reverse()`` will now only accept and import dotted paths based on the view-containing modules listed in the project's :doc:`URL pattern configuration </topics/http/urls>`, so as to ensure that only modules the developer intended to be imported in this fashion can or will be imported.
id: Untuk memperbaiki ini, ``reverse()`` sekarang akan hanya menerima dan mengimpor jalur bertitik berdasarkan pada tampilan mengandung modul terdaftar di :doc:`URL pattern configuration </topics/http/urls>` proyek, sehingga untuk memastikan hanya modul pengembang yang diharapkan untuk diimpor di gaya ini atau akan diimpor.
zh_hans: 为了解决这个问题，``reverse()`` 现在将只接受并导入基于项目的 :doc:`URL 模式配置 </topics/http/urls>` 中列出的包含视图的模块的点分路径，以确保只有开发人员打算以这种方式导入的模块才能被导入。

source: Caching of anonymous pages could reveal CSRF token
id: Menyimpan sementara dari halaman anonim dapat mengunggap token CSRF
zh_hans: 缓存匿名页面可能会泄露 CSRF 令牌

source: Django includes both a :doc:`caching framework </topics/cache>` and a system for :doc:`preventing cross-site request forgery (CSRF) attacks </ref/csrf/>`. The CSRF-protection system is based on a random nonce sent to the client in a cookie which must be sent by the client on future requests and, in forms, a hidden value which must be submitted back with the form.
id: Django menyertakan kedua :doc:`caching framework </topics/cache>` dan sistem untuk :doc:`preventing cross-site request forgery (CSRF) attacks </ref/csrf/>`. Sistem perlindungan-CSRF berdasarkan pada nonce acak dikirim ke klien di kue yang harus dikirim oleh klien di permintaan masa depan dan, di formulir, nilai tersembunyi yang harus diajukan kembali dengan formulir.
zh_hans: Django 包括了一个 :doc:`缓存框架 </topics/cache>` 和一个用于 :doc:`防止跨站点请求伪造 (CSRF) 攻击 </ref/csrf/>` 的系统。CSRF 保护系统基于一个随机的 nonce，它会在 cookie 中发送给客户端，在将来的请求中客户端必须发送该 nonce，同时在表单中还有一个隐藏值，必须与表单一起提交。

source: The caching framework includes an option to cache responses to anonymous (i.e., unauthenticated) clients.
id: Kerangka kerja penyimpanan sementara menyertkan sebuah pilihan untuk menyimpan sementara tanggapan pada anonim (yaitu, tidak sah) klien
zh_hans: 缓存框架包括一个选项，用于缓存对匿名（即未经认证的）客户端的响应。

source: When the first anonymous request to a given page is by a client which did not have a CSRF cookie, the cache framework will also cache the CSRF cookie and serve the same nonce to other anonymous clients who do not have a CSRF cookie. This can allow an attacker to obtain a valid CSRF cookie value and perform attacks which bypass the check for the cookie.
id: Ketika permintaan anonim pertama pada halaman yang diberikan adalah oleh seorang klien tidak mempunyai kue CSRF, kerangka kerja penyimpanan sementara akan juga menyimpan sementara kue CSRF dan melayani nonce sama pada klien anonim lain yang tidak mempunyai kue CSRF. Ini dapat mengizinkan seorang penyerang untuk mendapatkan nilai kue CSRF sah dan melakukan serangan yang melewatkan pemeriksaan untuk kue.
zh_hans: 当第一个对指定页面的匿名请求来自没有 CSRF cookie 的客户端时，缓存框架还会缓存 CSRF cookie，并为没有 CSRF cookie 的其他匿名客户端提供相同的随机数。这可能使攻击者获得有效的 CSRF cookie 值，并执行绕过 cookie 检查的攻击。

source: To remedy this, the caching framework will no longer cache such responses. The heuristic for this will be:
id: Untuk memperbaiki ini, kerangka kerja penyimpanan sementara tidak akan lagi menyimpan sementara tanggapan tersebut. Penyelidikan sendiri untuk ini menjadi:
zh_hans: 为了解决这个问题，缓存框架将不再缓存此类响应。启发式方法将是：

source: If the incoming request did not submit any cookies, and
id: Jika permintaan datang tidak mengajukan setiap kue, dan
zh_hans: 如果传入的请求没有提交任何 cookie，且

source: If the response did send one or more cookies, and
id: Jika tanggapan melakukan pengiriman satu atau lebih kue, dan
zh_hans: 如果响应发送了一个或多个 cookie，且

source: If the ``Vary: Cookie`` header is set on the response, then the response will not be cached.
id: Jika kepala ``Vary: Cookie`` disetel pada tanggapan, kemudian tanggapan tidak akan disimpan sementara.
zh_hans: 如果在响应中设置了 ``Vary: Cookie`` 头，那么该响应将不会被缓存。

source: MySQL typecasting
id: Typecast MySQL
zh_hans: MySQL 类型转换

source: The MySQL database is known to "typecast" on certain queries; for example, when querying a table which contains string values, but using a query which filters based on an integer value, MySQL will first silently coerce the strings to integers and return a result based on that.
id: Basisdata MySQL dikenal "typecast" pada permintaan tertentu; sebagai contoh, ketika meminta sebuah tabel yang mengandung nilai deretan karakter, tetapi menggunakan permintaan yang menyaring berdasarkan pada nilai integer, MySQL akan pertama diam memaksa deretan karakter menjadi integer dan mengembalikan hasil berdasarkan itu.
zh_hans: 众所周知，MySQL 数据库会对某些查询进行“类型转换”；例如，在查询包含字符串值的表时，但使用基于整数值进行过滤的查询，MySQL 首先会默默地将字符串强制转换为整数，然后返回基于该整数的结果。

source: If a query is performed without first converting values to the appropriate type, this can produce unexpected results, similar to what would occur if the query itself had been manipulated.
id: Jika sebuah permintaan dilakukan tanpa merubah nilai dahulu ke jenis yang sesuai, ini dapat menghasilkan nilai yang tidak diharapkan, mirip pada apa akan muncul jika permintaan itu sendiri telah dirubah.
zh_hans: 如果在未先将值转换为适当类型的情况下执行查询，这可能产生意外的结果，类似于查询本身被操作时会发生的情况。

source: Django's model field classes are aware of their own types and most such classes perform explicit conversion of query arguments to the correct database-level type before querying. However, three model field classes did not correctly convert their arguments:
id: Kelas-kelas bidang model Django menyadari jenis mereka sendiri dan kebanyakan kelas-kelas itu melakukan perubahan eksplisit dari permintaan argumen untuk memperbaiki kenis tingkat-basisdata sebelum meminta. Bagaimanapun, tiga kelas bidang model tidak dengan benar merubah argumen mereka:
zh_hans: Django 的模型字段类知道它们自己的类型，大多数此类字段在查询之前会将查询参数明确转换为正确的数据库级别类型。然而，有三个模型字段类没有正确地转换它们的参数：

source: These three fields have been updated to convert their arguments to the correct types before querying.
id: Ketiga bidang ini telah diperbaharui untuk merubah argumen mereka ke jenis yang benar sebelum meminta.
zh_hans: 在查询之前，这三个字段已经更新为将参数转换为正确的类型。

source: Additionally, developers of custom model fields are now warned via documentation to ensure their custom field classes will perform appropriate type conversions, and users of the :meth:`raw() <django.db.models.query.QuerySet.raw>` and :meth:`extra() <django.db.models.query.QuerySet.extra>` query methods -- which allow the developer to supply raw SQL or SQL fragments -- will be advised to ensure they perform appropriate manual type conversions prior to executing queries.
id: Selain itu, pengembang dari penyesuaian bidang model sekarang diperingati melalui dokumentasi untuk memastikan kelas-kelas penyesuaian bidang mereka akan melakukan perubahan jenis yang sesuai, dan pengguna dari metode permintaan :meth:`raw() <django.db.models.query.QuerySet.raw>` dan :meth:`extra() <django.db.models.query.QuerySet.extra>` -- yang mengizinkan pengembang untuk memasok SQL mentah atau fragmen SQL -- akan disarankan untuk memastikan mereka melakukan perubahan jenis manual sesuai sebelum menjalankan permintaan.
zh_hans: 此外，自定义模型字段的开发人员现在通过文档受到警告，需要确保他们的自定义字段类能够执行适当的类型转换，以及使用 :meth:`raw() <django.db.models.query.QuerySet.raw>` 和 :meth:`extra() <django.db.models.query.QuerySet.extra>` 查询方法的用户将被建议确保在执行查询之前进行适当的手动类型转换，因为这些方法允许开发人员提供原始 SQL 或 SQL 片段。

source: Django 1.4.12 release notes
id: Catatan terbitan Django 1.4.12
zh_hans: Django 1.4.12 版本发行说明

source: *April 28, 2014*
zh_hans: *2014 年 4 月 28 日*

source: Django 1.4.12 fixes a regression in the 1.4.11 security release.
id: Django 1.4.12 memperbaiki sebuah pemulihan di terbitan keamanan 1.4.11.
zh_hans: Django 1.4.12 修复了 1.4.11 安全发布中的一个回归问题。

source: Restored the ability to ``reverse()`` views created using :func:`functools.partial()` (:ticket:`22486`).
id: Menyimpan kembali kemampuan untuk ``reverse()`` tampilan dibuat menggunakan :func:`functools.partial()` (:ticket:`22486`).
zh_hans: 已恢复了使用 :func:`functools.partial()` 创建的视图的 ``reverse()`` 能力 (:ticket:`22486`)。

source: Django 1.4.13 release notes
id: Catatan terbitan Django 1.4.13
zh_hans: Django 1.4.13 版本发行说明

source: *May 14, 2014*
id: *14 Mei 2014*
zh_hans: *2014 年 5 月 14 日*

source: Django 1.4.13 fixes two security issues in 1.4.12.
id: Django 1.4.13 memperbaiki dua masalah keamanan di 1.4.12.
zh_hans: Django 1.4.13 修复了 1.4.12 中的两个安全问题。

source: Caches may incorrectly be allowed to store and serve private data
id: Tombolok mungkin tidak benar mengizinkan untuk menyimpan dan melayani data pribadi
zh_hans: 缓存可能会错误地允许存储和提供私有数据

source: In certain situations, Django may allow caches to store private data related to a particular session and then serve that data to requests with a different session, or no session at all. This can lead to information disclosure and can be a vector for cache poisoning.
id: Dalam situasi tertentu, Django mungkin mengizinkan tembolok menyimpan data pribadi terkait pada sesi tertentu dan kemudian melayani data itu untuk meminta dengan sesi berbeda, atau tidak ada sesi sama sekali. Ini dapat membawa ke penyingkapan informasi dan dapat menjadi menunjukan untuk peracunan tembolok.
zh_hans: 在某些情况下，Django 可能允许缓存存储与特定会话相关的私有数据，然后将该数据提供给具有不同会话或根本没有会话的请求。这可能导致信息泄露，并可能成为缓存中毒的途径。

source: When using Django sessions, Django will set a ``Vary: Cookie`` header to ensure caches do not serve cached data to requests from other sessions. However, older versions of Internet Explorer (most likely only Internet Explorer 6, and Internet Explorer 7 if run on Windows XP or Windows Server 2003) are unable to handle the ``Vary`` header in combination with many content types. Therefore, Django would remove the header if the request was made by Internet Explorer.
id: Ketiak menggunakan sesi Django, Django akan menyetel kepala ``Vary: Cookie`` untuk memastikan tembolok tidak melayani data tembolok untuk meminta dari sesi lainnya. Bagaimanapun, versi terlama dari Internet Explorer (kebanyakan hanya Internet Explorer 6, dan Internet Explorer 7 jika berjalan pada Windows XP atau Windows Server 2003) tidak dapat menangani kepala ``Vary`` di perpaduan dengan banyak jenis isi. Karena itu, Django akan memindahkan kepala jika permintaan telah dibuat oleh Internet Explorer.
zh_hans: 在使用 Django 会话时，Django 会设置一个 ``Vary: Cookie`` 头，以确保缓存不会向来自其他会话的请求提供缓存的数据。但是，较旧版本的 Internet Explorer（可能只有 Internet Explorer 6，以及如果在 Windows XP 或 Windows Server 2003 上运行的 Internet Explorer 7）无法处理 ``Vary`` 头与许多内容类型的组合。因此，如果请求是由 Internet Explorer 发出的，Django 会删除该头。

source: To remedy this, the special behavior for these older Internet Explorer versions has been removed, and the ``Vary`` header is no longer stripped from the response. In addition, modifications to the ``Cache-Control`` header for all Internet Explorer requests with a ``Content-Disposition`` header have also been removed as they were found to have similar issues.
id: Untuk memperbaiki ini, perilaku khusus untuk versi Internet Explorer terlama ini telah dipindahkan, dan kepala ``Vary`` tidak lagi dipilah dari tanggapan. Sebagai tambahan, perubahan pada kepala ``Cache-Control`` untuk semua permintaan Internet Explorer dengan kepala ``Content-Disposition`` telah dipindahkan ketika mereka telah menemukan untuk memiliki masalah yang sama.
zh_hans: 为了解决这个问题，已经移除了对这些较旧的 Internet Explorer 版本的特殊行为，并且不再从响应中删除 ``Vary`` 头。此外，对所有具有 ``Content-Disposition`` 头的 Internet Explorer 请求的 ``Cache-Control`` 头的修改也已被移除，因为发现它们具有类似的问题。

source: Malformed redirect URLs from user input not correctly validated
id: URL pengalihan yang jelek dari masukan pengguna tidak benar disahkan
zh_hans: 来自用户输入的格式错误的重定向 URL 未正确验证

source: The validation for redirects did not correctly validate some malformed URLs, which are accepted by some browsers. This allows a user to be redirected to an unsafe URL unexpectedly.
id: Pengesahan untuk pengalihan tidak dengan benar mengesahkan beberapa URL jelek, yang diterima oleh beberapa peramban. Ini mengizinkan pengguna untuk dialihkan pada UTL tidak aman tiba-tiba.
zh_hans: 重定向验证未正确验证某些格式错误的 URL，这些 URL 被某些浏览器接受。这使得用户可能意外地被重定向到不安全的 URL 。

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()``, ``django.contrib.comments``, and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security checks for these redirects (namely ``django.utils.http.is_safe_url()``) did not correctly validate some malformed URLs, such as ``http:\\\\\\djangoproject.com``, which are accepted by some browsers with more liberal URL parsing.
zh_hans: Django 在某些情况下（例如 ``django.contrib.auth.views.login()``、``django.contrib.comments`` 和 :doc:`i18n </topics/i18n/index>`）依赖于用户输入来将用户重定向到“成功”URL。对于这些重定向的安全性检查（即 ``django.utils.http.is_safe_url()``），未正确验证一些格式错误的 URL，例如 ``http:\\\\\\djangoproject.com``，这些 URL 可以被一些具有更自由 URL 解析的浏览器接受。

source: To remedy this, the validation in ``is_safe_url()`` has been tightened to be able to handle and correctly validate these malformed URLs.
id: Untuk memperbaiki ini, pengesahan di ``is_safe_url()`` telah diperketa utuk dapat menangani dan mengesahkan dengan benar URL jelek ini.
zh_hans: 为了解决这个问题，``is_safe_url()`` 中的验证已经加强，能够处理和正确验证这些格式错误的 URL。

source: Django 1.4.14 release notes
id: Catatan terbitan Django 1.4.14
zh_hans: Django 1.4.14 版本发行说明

source: *August 20, 2014*
id: *Agustus 20, 2014*
zh_hans: *2014 年 8 月 20 日*

source: Django 1.4.14 fixes several security issues in 1.4.13.
id: Django 1.4.14 memperbaiki beberapa masalah keamanan di 1.4.13.
zh_hans: Django 1.4.14 修复了 1.4.13 中的多个安全问题。

source: ``reverse()`` could generate URLs pointing to other hosts
id: ``reverse()`` dapat membangkitkan URL menunjuk ke rumah lain
zh_hans: ``reverse()`` 可能生成指向其他主机的 URL
