Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The new :attr:`SingleObjectMixin.query_pk_and_slug <django.views.generic.detail.SingleObjectMixin.query_pk_and_slug>` attribute allows changing the behavior of :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` so that it'll perform its lookup using both the primary key and the slug.
id: Atribut :attr:`SingleObjectMixin.query_pk_and_slug <django.views.generic.detail.SingleObjectMixin.query_pk_and_slug>` baru mengizinkan merubah perilaku dari :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` sehingga itu akan menampilkan pencariannya menggunakan kedua primary key dan keong.
zh_hans: 新的 :attr:`SingleObjectMixin.query_pk_and_slug <django.views.generic.detail.SingleObjectMixin.query_pk_and_slug>` 属性允许更改 :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` 的行为，使其使用主键和 slug 来执行查找。

source: The :meth:`~django.views.generic.edit.FormMixin.get_form()` method doesn't require a ``form_class`` to be provided anymore. If not provided ``form_class`` defaults to :meth:`~django.views.generic.edit.FormMixin.get_form_class()`.
id: Metode :meth:`~django.views.generic.edit.FormMixin.get_form()` tidak membutuhkan sebuah ``form_class`` untuk disediakan lagi. Jika tidak disediakan ``form_class`` awalan pada :meth:`~django.views.generic.edit.FormMixin.get_form_class()`.
zh_hans: :meth:`~django.views.generic.edit.FormMixin.get_form()` 方法不再需要提供 ``form_class``。如果没有提供 ``form_class``，则默认为 :meth:`~django.views.generic.edit.FormMixin.get_form_class()`。

source: Placeholders in :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` now support the Python :py:meth:`str.format()` syntax. The legacy ``%(<foo>)s`` syntax is still supported but will be removed in Django 1.10.
id: Placeholders di :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` sekarang mendukung sintaksis :py:meth:`str.format()` syntax. The legacy ``%(<foo>)s`` Python masih didukung tetapi akan dipindahkan di Django 1.10.
zh_hans: :attr:`ModelFormMixin.success_url <django.views.generic.edit.ModelFormMixin.success_url>` 中的占位符现在支持 Python 的 :py:meth:`str.format()` 语法。旧的 ``%(<foo>)s`` 语法仍然受支持，但将在 Django 1.10 中删除。

source: :setting:`FORMAT_MODULE_PATH` can now be a list of strings representing module paths. This allows importing several format modules from different reusable apps. It also allows overriding those custom formats in your main Django project.
id: :setting:`FORMAT_MODULE_PATH` sekarang dapat berupa sebuah daftar dari string mewakili jalur-jalur modul. Ini mengizinkan mengimpor beberapa bentuk modul dari aplikasi dapat digunakan yang berbeda. Itu juga mengizinkan menimpa bentuk penyesuaian tersebut di proyek Django utama anda.
zh_hans: :setting:`FORMAT_MODULE_PATH` 现在可以是表示模块路径的字符串列表。这允许从不同的可重用应用程序导入多个格式模块。它还允许在主要的 Django 项目中覆盖这些自定义格式。

source: The :class:`django.utils.log.AdminEmailHandler` class now has a :meth:`~django.utils.log.AdminEmailHandler.send_mail` method to make it more subclass friendly.
id: Kelas :class:`django.utils.log.AdminEmailHandler` sekarang mempunyai sebuah metode :meth:`~django.utils.log.AdminEmailHandler.send_mail` untuk membuatnya subkelas lebih ramah.
zh_hans: :class:`django.utils.log.AdminEmailHandler` 类现在具有 :meth:`~django.utils.log.AdminEmailHandler.send_mail` 方法，使其更容易进行子类化。

source: Database connections are now always closed after a management command called from the command line has finished doing its job.
id: Hubungan basisdata sekarang selalu ditutup setelah perintah pengelolaan dipanggil dari baris perintah telah selesai melakukan pekerjaannya.
zh_hans: 现在，从命令行调用的管理命令完成其工作后，数据库连接将始终关闭。

source: Commands from alternate package formats like eggs are now also discovered.
id: Perintah-perintah dari bentuk paket cara lain seperti eggs sekarang juga ditemukan.
zh_hans: 现在还可以发现来自诸如"eggs "之类的备用软件包格式的命令。

source: The new :option:`dumpdata --output` option allows specifying a file to which the serialized data is written.
id: Pilihan :option:`dumpdata --output` baru mengizinkan menentukan sebuah berkas yang data diserialisasi ditulis.
zh_hans: 新的 :option:`dumpdata --output` 选项允许指定将序列化数据写入的文件。

source: The new :option:`makemessages --exclude` and :option:`compilemessages --exclude` options allow excluding specific locales from processing.
id: Pilihan :option:`makemessages --exclude` dan :option:`compilemessages --exclude` baru mengizinkan mengeluarkan lokal tertentu dari pengolahan.
zh_hans: 新的 :option:`makemessages --exclude` 和 :option:`compilemessages --exclude` 选项允许排除特定的区域设置不进行处理。

source: :djadmin:`compilemessages` now has a ``--use-fuzzy`` or ``-f`` option which includes fuzzy translations into compiled files.
id: :djadmin:`compilemessages` sekarang mempunyai sebuah pilihan ``--use-fuzzy`` atau ``-f`` yang menyertakan terjemahan kabur kedalam berkas-berkas tersusun.
zh_hans: :djadmin:`compilemessages` 现在有一个 ``--use-fuzzy`` 或 ``-f`` 选项，它将模糊的翻译包括在编译后的文件中。

source: The :option:`loaddata --ignorenonexistent` option now ignores data for models that no longer exist.
id: Pilihan :option:`loaddata --ignorenonexistent` sekarang mengabaikan data untuk model yang tidak lagi ada.
zh_hans: :option:`loaddata --ignorenonexistent` 选项现在会忽略已不存在的模型的数据。

source: :djadmin:`runserver` now uses daemon threads for faster reloading.
id: :djadmin:`runserver` sekarang menggunakan thread daemon untuk memuat kembali lebih cepat.
zh_hans: :djadmin:`runserver` 现在使用守护线程以加快重新加载速度。

source: :djadmin:`inspectdb` now outputs ``Meta.unique_together``. It is also able to introspect :class:`~django.db.models.AutoField` for MySQL and PostgreSQL databases.
id: :djadmin:`inspectdb` sekarang mengeluarkan ``Meta.unique_together``. Itu juga dapat menginterospeksi :class:`~django.db.models.AutoField` untuk basisdata MySQL dan PostgreSQL.
zh_hans: :djadmin:`inspectdb` 现在输出 ``Meta.unique_together``。它还可以对 MySQL 和 PostgreSQL 数据库进行自省以获取 :class:`~django.db.models.AutoField`。

source: When calling management commands with options using :func:`~django.core.management.call_command`, the option name can match the command line option name (without the initial dashes) or the final option destination variable name, but in either case, the resulting option received by the command is now always the ``dest`` name specified in the command option definition (as long as the command uses the :mod:`argparse` module).
id: Ketika memanggil perintah pengelolaan dengan pilihan menggunakan :func:`~django.core.management.call_command`, nama pilihan dapat mencocokkan nama pilihan baris perintah (tanpa awalan tanda garis) atau nama variabel tujuan pilihan akhir, tetapi dalam kedua kasus, menghasilkan pilihan diterima oleh perintah sekarang selalu nama ``dest`` ditentukan dalam pengertian pilihan perintah (selama perintah menggunakan modul :mod:`argparse`).
zh_hans: 使用 :func:`~django.core.management.call_command` 调用带有选项的管理命令时，选项名称可以匹配命令行选项名称（去掉初始破折号）或最终选项目标变量名称，但无论哪种情况，命令接收到的结果选项现在始终是命令选项定义中指定的 ``dest`` 名称（只要命令使用 :mod:`argparse` 模块）。

source: The :djadmin:`dbshell` command now supports MySQL's optional SSL certificate authority setting (``--ssl-ca``).
id: Perintah :djadmin:`dbshell` sekarang mendukung pilihan pengaturan wewenang sertifikat SSL MySQL (``--ssl-ca``).
zh_hans: :djadmin:`dbshell` 命令现在支持 MySQL 的可选 SSL 证书颁发机构设置（``--ssl-ca``）。

source: The new :option:`makemigrations --name` allows giving the migration(s) a custom name instead of a generated one.
id: :option:`makemigrations --name` baru mengizinkan memberikan perpindahan sebuah penyesuaian nama daribada satu yang dibangkitkan.
zh_hans: 新的 :option:`makemigrations --name` 允许为迁移指定自定义名称，而不是生成的名称。

source: The :djadmin:`loaddata` command now prevents repeated fixture loading. If :setting:`FIXTURE_DIRS` contains duplicates or a default fixture directory path (``app_name/fixtures``), an exception is raised.
id: Perintah :djadmin:`loaddata` sekarang mencegah memuat alat bantu berulang. Jika :setting:`FIXTURE_DIRS` mengandung ganda atau jalur direktori alat bantu awalan (``app_name/fixtures``), sebuah pengecualian dimunculkan.
zh_hans: :djadmin:`loaddata` 命令现在防止了重复的夹具加载。如果 :setting:`FIXTURE_DIRS` 包含重复项或默认的夹具目录路径（``app_name/fixtures``），则会引发异常。

source: The new ``makemigrations --exit`` option allows exiting with an error code if no migrations are created.
id: Pilihan baru ``makemigrations --exit`` mengizinkan keluar dengan sebuah kode kesalahan jika tidak ada perpindahan dibuat.
zh_hans: 新的 ``makemigrations --exit`` 选项允许在没有创建迁移时退出并返回错误代码。

source: The new :djadmin:`showmigrations` command allows listing all migrations and their dependencies in a project.
id: Perintah :djadmin:`showmigrations` baru mengizinkan mendaftarkan semua perpindahan dan ketergantungan mereka dalam sebuah proyek.
zh_hans: 新的 :djadmin:`showmigrations` 命令允许列出项目中的所有迁移及其依赖关系。

source: Middleware
zh_hans: 中间件

source: The :attr:`CommonMiddleware.response_redirect_class <django.middleware.common.CommonMiddleware.response_redirect_class>` attribute allows you to customize the redirects issued by the middleware.
id: Atribut :attr:`CommonMiddleware.response_redirect_class <django.middleware.common.CommonMiddleware.response_redirect_class>` mengizinkan anda menyesuaikan pengalihan yang diterbitan oleh middleware.
zh_hans: :attr:`CommonMiddleware.response_redirect_class <django.middleware.common.CommonMiddleware.response_redirect_class>` 属性允许您自定义中间件发出的重定向。

source: A debug message will be logged to the ``django.request`` logger when a middleware raises a :exc:`~django.core.exceptions.MiddlewareNotUsed` exception in :setting:`DEBUG` mode.
id: Sebuah pesan pencari kesalahan akan dicatat pada pencatat ``django.request`` ketika middleware memunculkan sebuah pengecualian :exc:`~django.core.exceptions.MiddlewareNotUsed` di suasana :setting:`DEBUG`.
zh_hans: 在 :setting:`DEBUG` 模式下，当中间件引发 :exc:`~django.core.exceptions.MiddlewareNotUsed` 异常时，将会在 ``django.request`` 记录器中记录调试消息。

source: The :class:`~django.db.migrations.operations.RunSQL` operation can now handle parameters passed to the SQL statements.
id: Operasi :class:`~django.db.migrations.operations.RunSQL` sekarang dapat menangani parameter dilewatkan ke pernyataan SQL.
zh_hans: :class:`~django.db.migrations.operations.RunSQL` 操作现在可以处理传递给 SQL 语句的参数。

source: It is now possible to have migrations (most probably :ref:`data migrations <data-migrations>`) for applications without models.
id: Itu sekarang memungkinkan untuk berpindah (kebanyakan mungkin :ref:`data migrations <data-migrations>`) untuk aplikasi tanpa model.
zh_hans: 现在可以为没有模型的应用程序创建迁移（很可能是 :ref:`数据迁移 <data-migrations>`）。

source: Migrations can now :ref:`serialize model managers <using-managers-in-migrations>` as part of the model state.
id: Perpindahan sekarang dapat :ref:`serialize model managers <using-managers-in-migrations>` sebagai bagian dari keadaan model.
zh_hans: 迁移现在可以将模型管理器 :ref:`序列化为模型状态 <using-managers-in-migrations>` 的一部分。

source: A :ref:`generic mechanism to handle the deprecation of model fields <migrations-removing-model-fields>` was added.
id: Sebuah :ref:`generic mechanism to handle the deprecation of model fields <migrations-removing-model-fields>` telah ditambahkan.
zh_hans: 添加了一种 :ref:`处理模型字段弃用的通用机制 <migrations-removing-model-fields>`。

source: The :meth:`RunPython.noop() <django.db.migrations.operations.RunPython.noop>` and :attr:`RunSQL.noop <django.db.migrations.operations.RunSQL.noop>` class method/attribute were added to ease in making ``RunPython`` and ``RunSQL`` operations reversible.
id: Metode/atribut kelas :meth:`RunPython.noop() <django.db.migrations.operations.RunPython.noop>` dan :attr:`RunSQL.noop <django.db.migrations.operations.RunSQL.noop>` telah ditambahkan untuk memudahkan dalam pembuatan operasi ``RunPython`` dan ``RunSQL`` yang dapat dibatalkan.
zh_hans: 添加了 :meth:`RunPython.noop() <django.db.migrations.operations.RunPython.noop>` 和 :attr:`RunSQL.noop <django.db.migrations.operations.RunSQL.noop>` 类方法/属性，以便于使 ``RunPython`` 和 ``RunSQL`` 操作可逆。

source: The migration operations :class:`~django.db.migrations.operations.RunPython` and :class:`~django.db.migrations.operations.RunSQL` now call the :meth:`allow_migrate` method of database routers. The router can use the newly introduced ``app_label`` and ``hints`` arguments to make a routing decision. To take advantage of this feature you need to update the router to the new ``allow_migrate`` signature, see the :ref:`deprecation section <deprecated-signature-of-allow-migrate>` for more details.
id: Operasi perpindahan :class:`~django.db.migrations.operations.RunPython` dan :class:`~django.db.migrations.operations.RunSQL` sekarang memanggil metode :meth:`allow_migrate` dari perute basisdata. Perute dapat menggunakan yang baru diperkenalkan argumen ``app_label`` dan ``hints`` untuk membuatkeputusan perutean. Untuk mengambil keuntungan dari fitur ini anda butuh memperbaharui ke tanda tangan ``allow_migrate`` baru, lihat :ref:`deprecation section <deprecated-signature-of-allow-migrate>` untuk rincian lebih.
zh_hans: 现在，迁移操作 :class:`~django.db.migrations.operations.RunPython` 和 :class:`~django.db.migrations.operations.RunSQL` 会调用数据库路由器的 :meth:`allow_migrate` 方法。路由器可以使用新引入的 ``app_label`` 和 ``hints`` 参数来进行路由决策。要利用此功能，您需要将路由器更新到新的 ``allow_migrate`` 签名，有关详细信息，请参阅 :ref:`弃用部分 <deprecated-signature-of-allow-migrate>`。

source: Django now logs at most 9000 queries in ``connections.queries``, in order to prevent excessive memory usage in long-running processes in debug mode.
id: Django sekarang mencatat paling 9000 permintaan di ``connections.queries``, untuk mencegah penggunaan memori terlalu banyak di pengolahan berjalan-lama dalam suasana mencari kesalahan.
zh_hans: 现在，Django 最多记录 9000 条查询在 ``connections.queries`` 中，以防止在调试模式下的长时间运行过程中出现过多的内存使用。

source: There is now a model ``Meta`` option to define a :attr:`default related name <django.db.models.Options.default_related_name>` for all relational fields of a model.
id: Ada sekarang sebuah pilihan ``Meta`` model untuk menentukan sebuah :attr:`default related name <django.db.models.Options.default_related_name>` untuk semua bidang berhubungan dari sebuah model.
zh_hans: 现在有一个模型 ``Meta`` 选项，可以为模型的所有关联字段定义 :attr:`默认相关名称 <django.db.models.Options.default_related_name>`。

source: Pickling models and querysets across different versions of Django isn't officially supported (it may work, but there's no guarantee). An extra variable that specifies the current Django version is now added to the pickled state of models and querysets, and Django raises a ``RuntimeWarning`` when these objects are unpickled in a different version than the one in which they were pickled.
id: Model pickling dan queryset lintas versi berbeda dari Django tidak secara resmi didukung (itu mungkin bekerja, tetapi tidak ada jaminan). Sebuah variabel tambahan yang menentukan versi Django saat ini sekarang ditambahkan ke keadaan pickel dari model dan queryset, dan Django memunculkan sebuah ``RuntimeWarning`` ketika obyek-obyek ini tidak di pickle dalam versi berbeda daripada satu yang mereka telah di pickle.
zh_hans: 在不同版本的 Django 之间对模型和查询集进行 pickling 并不是官方支持的（它可能会工作，但没有保证）。现在，一个额外的变量被添加到模型和查询集的 pickled 状态中，用来指定当前的 Django 版本，当这些对象在与其被 pickled 的版本不同的版本中 unpickle 时，Django 会引发一个 ``RuntimeWarning``。

source: Added :meth:`Model.from_db() <django.db.models.Model.from_db()>` which Django uses whenever objects are loaded using the ORM. The method allows customizing model loading behavior.
id: Ditambahkan :meth:`Model.from_db() <django.db.models.Model.from_db()>` dimana pengguna Django menggunakan kapanpun obyek-obyek dimuat menggunakan ORM. Metode ini mengizinkan menyesuaikan perilaku memuat model.
zh_hans: 添加了 :meth:`Model.from_db() <django.db.models.Model.from_db()>`，Django 在使用 ORM 加载对象时会使用这个方法。该方法允许自定义模型的加载行为。

source: ``extra(select={...})`` now allows you to escape a literal ``%s`` sequence using ``%%s``.
id: ``extra(select={...})`` sekarang mengizinkan anda untuk meloloskan urutan ``%s`` harfiah menggunakan ``%%s``.
zh_hans: 现在，``extra(select={...})`` 允许您使用 ``%%s`` 来转义文本中的字面 ``%s`` 序列。

source: :doc:`Custom Lookups</howto/custom-lookups>` can now be registered using a decorator pattern.
id: :doc:`Custom Lookups</howto/custom-lookups>` sekarang dapat didaftarkan menggunakan pola penghias.
zh_hans: 现在可以使用装饰器模式注册 :doc:`自定义查找器 </howto/custom-lookups>`。

source: The new :attr:`Transform.bilateral <django.db.models.Transform.bilateral>` attribute allows creating bilateral transformations. These transformations are applied to both ``lhs`` and ``rhs`` when used in a lookup expression, providing opportunities for more sophisticated lookups.
id: Atribut :attr:`Transform.bilateral <django.db.models.Transform.bilateral>` baru mengizinkan membuat perubahan timbal balik. Terjemahan ini diberlakukan pada kedua ``lhs`` dan ``rhs`` ketika digunakan dalam pernyataan pencarian, menyediakan kesempatan untuk pencarian lebih mutakhir.
zh_hans: 新的 :attr:`Transform.bilateral <django.db.models.Transform.bilateral>` 属性允许创建双向变换。这些变换在查找表达式中同时应用于 ``lhs`` 和 ``rhs``，提供了更多复杂查找的机会。

source: SQL special characters (\, %, _) are now escaped properly when a pattern lookup (e.g. ``contains``, ``startswith``, etc.) is used with an ``F()`` expression as the right-hand side. In those cases, the escaping is performed by the database, which can lead to somewhat complex queries involving nested ``REPLACE`` function calls.
id: Karakter khusus SQL (\, %, _) sekarang diloloskan dengan benar ketika pencarian pola (sebagai contoh ``contains``, ``startswith``, dll.) digunakan dengan sebuah ungkapan ``F()`` sebagai sisi tangan-kanan. Di kasus-kasus tersebut, pelolosan dilakukan oleh basisdata, yang dapat membawa ke permintaan agak rumit melibatkan pemanggilan fungsi ``REPLACE`` bersarang.
zh_hans: 现在，当使用模式查找（例如 ``contains``、``startswith`` 等）与 ``F()`` 表达式作为右侧时，SQL 的特殊字符（\、%、_）会得到正确的转义。在这些情况下，转义是由数据库执行的，这可能导致涉及嵌套的 ``REPLACE`` 函数调用的相对复杂的查询。

source: You can now refresh model instances by using :meth:`Model.refresh_from_db() <django.db.models.Model.refresh_from_db>`.
id: Anda sekarang dapat menyegarkan instance model dengan menggunakan :meth:`Model.refresh_from_db() <django.db.models.Model.refresh_from_db>`.
zh_hans: 现在，您可以使用 :meth:`Model.refresh_from_db() <django.db.models.Model.refresh_from_db>` 来刷新模型实例。

source: You can now get the set of deferred fields for a model using :meth:`Model.get_deferred_fields() <django.db.models.Model.get_deferred_fields>`.
id: Anda sekarang dapat mendapatkan setelan dari bidang-bidang yang ditunda untuk sebuah model menggunakan :meth:`Model.get_deferred_fields() <django.db.models.Model.get_deferred_fields>`.
zh_hans: 现在，您可以使用 :meth:`Model.get_deferred_fields() <django.db.models.Model.get_deferred_fields>` 获取模型的延迟加载字段集合。

source: Model field ``default``’s are now used when primary key field's are set to ``None``.
zh_hans: 现在，当主键字段设置为 ``None`` 时，将使用模型字段的 ``default`` 值。

source: Exceptions from the ``(receiver, exception)`` tuples returned by :meth:`Signal.send_robust() <django.dispatch.Signal.send_robust>` now have their traceback attached as a ``__traceback__`` attribute.
id: Pengecualian dari tuple ``(receiver, exception)`` dikembalikan oleh :meth:`Signal.send_robust() <django.dispatch.Signal.send_robust>` sekarang mempunyai melacak kembali dilampirkan sebagai atribut `__traceback__``.
zh_hans: 通过 :meth:`Signal.send_robust() <django.dispatch.Signal.send_robust>` 返回的 ``(receiver, exception)`` 元组中的异常现在附带了其回溯信息作为 ``__traceback__`` 属性。

source: The ``environ`` argument, which contains the WSGI environment structure from the request, was added to the :data:`~django.core.signals.request_started` signal.
id: Argumen ``environ``, yang mengandung struktur lingkungan WSGI dari permintaan, telah ditambahkan ke sinyal :data:`~django.core.signals.request_started`.
zh_hans: 在 :data:`~django.core.signals.request_started` 信号中添加了 ``environ`` 参数，其中包含了来自请求的 WSGI 环境结构。

source: You can now import the :func:`~django.test.signals.setting_changed` signal from ``django.core.signals`` to avoid loading ``django.test`` in non-test situations. Django no longer does so itself.
id: Anda sekarang dapat mengimpor sinyal :func:`~django.test.signals.setting_changed` dari ``django.core.signals`` untuk menghindari memuat ``django.test`` di keadaan bukan-percobaan. Django tidak lagi melalukannya sendiri.
zh_hans: 现在可以从 ``django.core.signals`` 导入 :func:`~django.test.signals.setting_changed` 信号，以避免在非测试情况下加载 ``django.test``。 Django 不再自行加载它。

source: System Check Framework
id: Kerangka Sistem Pemeriksaan
zh_hans: 系统检查框架

source: :attr:`~django.core.checks.register` can now be used as a function.
id: :attr:`~django.core.checks.register` dapat sekarang digunakan sebagai sebuah fungsi.
zh_hans: :attr:`~django.core.checks.register` 现在可以作为一个函数使用。

source: :tfilter:`urlize` now supports domain-only links that include characters after the top-level domain (e.g. ``djangoproject.com/`` and ``djangoproject.com/download/``).
id: :tfilter:`urlize` sekarang mendukung tautan hanya-ranah yang menyertakan karakter setelah ranah tingkat-atas (sebagai contoh ``djangoproject.com/`` dan ``djangoproject.com/download/``).
zh_hans: :tfilter:`urlize` 现在支持包含顶级域名后面字符的域名链接（例如 ``djangoproject.com/`` 和 ``djangoproject.com/download/``）。

source: :tfilter:`urlize` doesn't treat exclamation marks at the end of a domain or its query string as part of the URL (the URL in e.g. ``'djangoproject.com!`` is ``djangoproject.com``)
id: :tfilter:`urlize` tidak memperlakukan tanda seruan pada akhir dari sebuah ranah atau string permintaannya sebagai bagian dari URL ( URL di sebagai contoh ``'djangoproject.com!`` adalah ``djangoproject.com``)
zh_hans: :tfilter:`urlize` 不将域名或其查询字符串末尾的感叹号视为 URL 的一部分（例如，``'djangoproject.com!`` 中的 URL 为 ``djangoproject.com``）。

source: Added a :class:`locmem.Loader <django.template.loaders.locmem.Loader>` class that loads Django templates from a Python dictionary.
id: Ditambahkan sebuah kelas :class:`locmem.Loader <django.template.loaders.locmem.Loader>` yang memuat cetakan Django dari sebuah kamus Python.
zh_hans: 添加了一个名为 :class:`locmem.Loader <django.template.loaders.locmem.Loader>` 的类，它可以从 Python 字典中加载 Django 模板。

source: The :ttag:`now` tag can now store its output in a context variable with the usual syntax: ``{% now 'j n Y' as varname %}``.
id: Etiket :ttag:`now` sekarang dapat menyimpan keluarannya di variabel konteks dengan sintaksis biasa: ``{% sekarang 'j n Y' sebagai varname %}``.
zh_hans: :ttag:`now` 标签现在可以使用常见的语法将其输出存储在上下文变量中，例如：``{% now 'j n Y' as varname %}``。

source: ``WSGIRequest`` now respects paths starting with ``//``.
id: ``WSGIRequest`` sekarang menghormati jalur dimulai dengan ``//``.
zh_hans: 现在，``WSGIRequest`` 将尊重以 ``//`` 开头的路径。

source: The :meth:`HttpRequest.build_absolute_uri() <django.http.HttpRequest.build_absolute_uri>` method now handles paths starting with ``//`` correctly.
id: Metode :meth:`HttpRequest.build_absolute_uri() <django.http.HttpRequest.build_absolute_uri>` sekarang menangani jalur dimulai dengan tepat ``//``.
zh_hans: 现在， :meth:`HttpRequest.build_absolute_uri() <django.http.HttpRequest.build_absolute_uri>` 方法能够正确处理以 ``//`` 开头的路径。

source: If :setting:`DEBUG` is ``True`` and a request raises a :exc:`~django.core.exceptions.SuspiciousOperation`, the response will be rendered with a detailed error page.
id: Jika :setting:`DEBUG` adalah ``True`` dan sebuah permintaan memunculkan sebuah :exc:`~django.core.exceptions.SuspiciousOperation`, tanggapan akan dibangun dengan halaman kesalahan rinci.
zh_hans: 如果 :setting:`DEBUG` 为 ``True``，并且请求引发了 :exc:`~django.core.exceptions.SuspiciousOperation` 异常，将会使用详细的错误页面呈现响应。
