Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: For convenience, Django 1.0 included an optional middleware class -- ``django.middleware.http.SetRemoteAddrFromForwardedFor`` -- which updated the value of ``REMOTE_ADDR`` based on the HTTP ``X-Forwarded-For`` header commonly set by some proxy configurations.
id: Untuk kenyamanan, Django 1.0 menyertakan sebuah kelas middleware pilihan -- ``django.middleware.http.SetRemoteAddrFromForwardedFor`` -- yang memperbaharui nilai dari ``REMOTE_ADDR`` berdasarkan pada kepala HTTP ``X-Forwarded-For`` umumnya disetel oleh beberapa konfigurasi proxy.
zh_hans: 为了方便，Django 1.0 包括了一个可选的中间件类 -- ``django.middleware.http.SetRemoteAddrFromForwardedFor`` -- 该类基于一些代理配置常常设置的 HTTP ``X-Forwarded-For`` 头部更新了 ``REMOTE_ADDR`` 的值。

source: It has been demonstrated that this mechanism cannot be made reliable enough for general-purpose use, and that (despite documentation to the contrary) its inclusion in Django may lead application developers to assume that the value of ``REMOTE_ADDR`` is "safe" or in some way reliable as a source of authentication.
id: Itu telah ditunjukkan bahwa mekanisme ini tidak dapat dibuat cukup handal untuk penggunaan tujuan tertentu, dan bahwa (meskipun dokumentasi ke kebalikan) penyertaannya di Django mungkin membawa pengembang aplikasi menganggap bahwa nilai dari ``REMOTE_ADDR`` adalah "safe" atau di beberapa jalan dapat dihandalkan sebagai sumber otentifikasi.
zh_hans: 已经证明这个机制不能够可靠到足以用于通用用途，并且（尽管文档中有不同的说明）它包含在 Django 中可能会导致应用程序开发者假设 ``REMOTE_ADDR`` 的值是“安全的”或以某种方式可靠作为身份验证的来源。

source: While not directly a security issue, we've decided to remove this middleware with the Django 1.1 release. It has been replaced with a class that does nothing other than raise a ``DeprecationWarning``.
id: Selagi tidak secara langsung masalah keamanan, kami telah memutuskan untuk memindahkan middleware ini dengan terbitan Django 1.1. Itu telah diganti dengan kelas yang tidak melakukan apapun selaiin menampilkan ``DeprecationWarning``.
zh_hans: 尽管这不是一个直接的安全问题，但我们决定在 Django 1.1 版本中删除这个中间件。它已被替换为一个什么都不做，只会引发 ``DeprecationWarning`` 的类。

source: If you've been relying on this middleware, the easiest upgrade path is:
id: Jika anda telah bergantung pada middleware ini, jalur peningkatan termudah adalah:
zh_hans: 如果你一直依赖这个中间件，最简单的升级路径是：

source: Examine `the code as it existed before it was removed`__.
id: Uji `the code as it existed before it was removed`__.
zh_hans: 检查 `在被移除之前的代码`__。

source: Verify that it works correctly with your upstream proxy, modifying it to support your particular proxy (if necessary).
id: Periksa bahwa itu bekerja dengan benar dengan proxy hulu anda, merubahnya untuk mendukung proxy tertentu anda (jika dibutuhkan).
zh_hans: 验证它是否与你的上游代理正确工作，并根据需要修改以支持你的特定代理。

source: Introduce your modified version of ``SetRemoteAddrFromForwardedFor`` as a piece of middleware in your own project.
id: Memperkenalkan versi dirubah anda dari ``SetRemoteAddrFromForwardedFor`` sebagai potongan dari middleware di proyek anda sendiri.
zh_hans: 在你自己的项目中将我修改过的版本的 ``SetRemoteAddrFromForwardedFor`` 作为中间件引入。

source: Names of uploaded files are available later
id: Nama dari berkas terunggah tersedia kemudian
zh_hans: 上传文件的名称稍后可用

source: In Django 1.0, files uploaded and stored in a model's :class:`FileField` were saved to disk before the model was saved to the database. This meant that the actual file name assigned to the file was available before saving. For example, it was available in a model's pre-save signal handler.
id: Di Django 1.0, berkas-berkas terunggah dan disimpan dalam sebuah :class:`FileField` model disimpan ke cakram sebelum model disimpan ke basisdata. Ini berarti bahwa nama berkas sebenarnya diberikan ke berkas telah tersedia sebelum disimpan. Sebagai contoh, itu telah tersedia dalam pengangan sinyal pra-simpan model.
zh_hans: 在 Django 1.0 中，上传并存储在模型的 :class:`FileField` 中的文件在模型保存到数据库之前会被保存到磁盘。这意味着在保存之前可以获取分配给文件的实际文件名。例如，在模型的预保存信号处理程序中可以获取到它。

source: In Django 1.1 the file is saved as part of saving the model in the database, so the actual file name used on disk cannot be relied on until *after* the model has been saved.
id: Di Django 1.1 berkas disimpan sebagai bagian dari menyimpan model di basisdata, jadi nama berkas sebenarnya digunakan pada cakram tidak dapat bergantung sampai *sesudah* model telah disimpan.
zh_hans: 在 Django 1.1 中，文件会作为保存模型到数据库的一部分而被保存，因此在模型被保存之前不能依赖于磁盘上使用的实际文件名。

source: Changes to how model formsets are saved
id: Perubahan pada bagaimana model formset disimpan
zh_hans: 模型表单集的保存方式的变更

source: In Django 1.1, :class:`~django.forms.models.BaseModelFormSet` now calls ``ModelForm.save()``.
id: Dalam Django 1.1, :class:`~django.forms.models.BaseModelFormSet` sekarang memanggil ``ModelForm.save()``.
zh_hans: 在Django 1.1中，:class:`~ Django .forms.models. `BaseModelFormSet`现在调用`ModelForm.save()`。

source: This is backwards-incompatible if you were modifying ``self.initial`` in a model formset's ``__init__``, or if you relied on the internal ``_total_form_count`` or ``_initial_form_count`` attributes of BaseFormSet. Those attributes are now public methods.
id: Ini adalah bertentangan-kebelakang jika anda sedang merubah ``self.initial`` dalam model ``__init__`` formset, atau jika anda bergantung pada atribut internal ``_total_form_count`` atau ``_initial_form_count`` dari BaseFormSet. Atribut tersebut sekarang adalah metode umum.
zh_hans: 如果你在模型表单集的 ``__init__`` 中修改了 ``self.initial``，或者依赖于 BaseFormSet 的内部属性 ``_total_form_count`` 或 ``_initial_form_count``，这是不兼容的。现在这些属性已经变成了公共方法。

source: Fixed the ``join`` filter's escaping behavior
id: Diperbaiki perilaku pelolosan saringan ``join``
zh_hans: 修复了"join"过滤器的转义行为

source: The :tfilter:`join` filter no longer escapes the literal value that is passed in for the connector.
id: Penyaring :tfilter:`join` tidak lagi meloloskan nilai harfiah yang dilewatkan untuk penghubung.
zh_hans: :tfilter:`join` 过滤器不再转义传递给连接器的字面量。

source: This is backwards incompatible for the special situation of the literal string containing one of the five special HTML characters. Thus, if you were writing ``{{ foo|join:"&" }}``, you now have to write ``{{ foo|join:"&amp;" }}``.
id: Bertentangan kebelakang ini untuk keadaan khusus dari deretan karakter harfiah mengandung satu dari lima karakter HTML khusus. Jadi, jika anda sedang menulis ``{{ foo|join:"&" }}``, anda sekarang harus menulis ``{{ foo|join:"&amp;" }}``.
zh_hans: 这对于包含五个特殊 HTML 字符之一的文字字符串的特殊情况是不兼容的。因此，如果你之前写的是 ``{{ foo|join:"&" }}``，现在你必须写成 ``{{ foo|join:"&amp;" }}``。

source: The previous behavior was a bug and contrary to what was documented and expected.
id: Perilaku sebelumnya adalah sebuah kesalahan dan kebalikan ke apa yang telah didokumentasikan dan diharapkan.
zh_hans: 先前的行为是一个错误，并且与所记录和预期的不符。

source: Permanent redirects and the ``redirect_to()`` generic view
id: Pengalihan tetap dan tampilan umum ``redirect_to()``
zh_hans: 永久重定向和`redirect_to()`通用视图

source: Django 1.1 adds a ``permanent`` argument to the ``django.views.generic.simple.redirect_to()`` view. This is technically backwards-incompatible if you were using the ``redirect_to`` view with a format-string key called 'permanent', which is highly unlikely.
id: Django 1.1 menambahkan argumen ``permanent`` ke tampilan ``django.views.generic.simple.redirect_to()``. Ini secara teknis bertentangan kebelakang jika anda menggunakan tampilan ``redirect_to`` dengan kunci bentuk-deretan karakter disebut 'permanent', yang sangat tidak mungkin.
zh_hans: Django 1.1 在 ``django.views.generic.simple.redirect_to()`` 视图中添加了一个 ``permanent`` 参数。如果你使用 ``redirect_to`` 视图并将格式字符串键命名为 'permanent'，这在技术上是向后不兼容的，这是极不可能的。

source: Features deprecated in 1.1
id: Fitur usang di 1.1
zh_hans: 在 1.1 中被废弃的功能

source: One feature has been marked as deprecated in Django 1.1:
id: Satu fitur telah ditandai sebagai usang di Django 1.1:
zh_hans: 在 Django 1.1 中，一个功能已被标记为废弃。

source: You should no longer use ``AdminSite.root()`` to register that admin views. That is, if your URLconf contains the line::
id: Anda jangan lagi menggunakan ``AdminSite.root()`` untuk mendaftar tampilan admin itu. Yaitu, jika URLconf anda mengandung baris::
zh_hans: 你不应再使用 ``AdminSite.root()`` 来注册管理员视图。也就是说，如果你的 URL 配置包含以下行：

source: You should change it to read::
id: Anda harus merubahnya untuk membaca::
zh_hans: 你应该将其修改为如下所示：

source: You should begin to remove use of this feature from your code immediately.
id: Anda harus mulai memindahkan penggunaan fitur ini dari kode anda segera.
zh_hans: 你应立即开始从你的代码中移除对该功能的使用。

source: ``AdminSite.root`` will raise a ``PendingDeprecationWarning`` if used in Django 1.1. This warning is hidden by default. In Django 1.2, this warning will be upgraded to a ``DeprecationWarning``, which will be displayed loudly. Django 1.3 will remove ``AdminSite.root()`` entirely.
id: ``AdminSite.root`` akan menimbulkan ``PendingDeprecationWarning`` jika digunakan di Django 1.1. Peringatan ini disembunyikan secara awal. Di Django 1.2, peringatan ini akan ditingkatkan ke ``DeprecationWarning``, yang akan ditampilkan mencolok. Django 1.3 akan memindahkan ``AdminSite.root()`` sepenuhnya.
zh_hans: 在 Django 1.1 中，如果使用 ``AdminSite.root``，将会引发一个 ``PendingDeprecationWarning`` 警告，默认情况下这个警告是隐藏的。在 Django 1.2 中，这个警告将升级为 ``DeprecationWarning``，并且会被明显显示出来。在 Django 1.3 中，将完全删除 ``AdminSite.root()``。

source: For more details on our deprecation policies and strategy, see :doc:`/internals/release-process`.
id: Untuk rincian lebih pada kebijakan dan strategi pengusangan kami, lihat :doc:`/internals/release-process`.
zh_hans: 有关我们的废弃政策和策略的更多详细信息，请参阅 :doc:`/internals/release-process`。

source: What's new in Django 1.1
id: Apa yang baru di Django 1.1
zh_hans: Django 1.1 中的新功能有哪些？

source: Quite a bit: since Django 1.0, we've made 1,290 code commits, fixed 1,206 bugs, and added roughly 10,000 lines of documentation.
id: Cukup sedikit: sejak Django 1.0, kami telah membuat 1,290 kode perbaikan, memperbaiki 1,206 kesalahan, dan menambahkan kurang lebih 10,000 baris dokumentasi.
zh_hans: 相当多：自 Django 1.0 以来，我们进行了 1290 次代码提交，修复了 1206 个错误，并增加了大约 10000 行文档。

source: The major new features in Django 1.1 are:
id: Fitur baru utama di Django 1.1 adalah:
zh_hans: Django 1.1 的主要新功能有：

source: ORM improvements
id: Perbaikan ORM
zh_hans: ORM 改进

source: Two major enhancements have been added to Django's object-relational mapper (ORM): aggregate support, and query expressions.
id: Dua peningkatan utama telah ditambahkan pada object-relational mapper (ORM) Django: mengumpulkan dukungan, dan pernyatana permintaan.
zh_hans: Django 的对象关系映射器（ORM）已经增加了两个重要的增强功能：聚合支持和查询表达式。

source: Aggregate support
id: Pengumpulan dukungan
zh_hans: 聚合支持

source: It's now possible to run SQL aggregate queries (i.e. ``COUNT()``, ``MAX()``, ``MIN()``, etc.) from within Django's ORM. You can choose to either return the results of the aggregate directly, or else annotate the objects in a :class:`~django.db.models.query.QuerySet` with the results of the aggregate query.
id: Sekarang memungkinkan menjalankan permintaan kumpulan SQL (yaitu ``COUNT()``, ``MAX()``, ``MIN()``, dll.) dari dalam ORM Django. Anda dapat memilih ke antara mengembalikan hasil dari pengumpulan secara langsung, atau lainnya memberikan keterangan pbjek di :class:`~django.db.models.query.QuerySet` dengan hasil dari pengumpulan permintaan.
zh_hans: 现在可以从 Django 的 ORM 中运行 SQL 聚合查询（例如 ``COUNT()``、``MAX()``、``MIN()`` 等）。你可以选择直接返回聚合的结果，或者在 :class:`~django.db.models.query.QuerySet` 中使用聚合查询的结果来注释对象。

source: This feature is available as new :meth:`~django.db.models.query.QuerySet.aggregate` and :meth:`~django.db.models.query.QuerySet.annotate` methods, and is covered in detail in :doc:`the ORM aggregation documentation </topics/db/aggregation>`.
id: Fitur ini tersedia sebagai metode :meth:`~django.db.models.query.QuerySet.aggregate` dan :meth:`~django.db.models.query.QuerySet.annotate` baru, dan melingkupi rincian di :doc:`the ORM aggregation documentation </topics/db/aggregation>`.
zh_hans: 这个功能可以通过新的 :meth:`~django.db.models.query.QuerySet.aggregate` 和 :meth:`~django.db.models.query.QuerySet.annotate` 方法来使用，详细信息可以在 :doc:`ORM 聚合文档 </topics/db/aggregation>` 中找到。

source: Query expressions
id: Ungkapan permintaan
zh_hans: 查询表达式

source: Queries can now refer to another field on the query and can traverse relationships to refer to fields on related models. This is implemented in the new :class:`~django.db.models.F` object; for full details, including examples, consult the :class:`F expressions documentation <django.db.models.F>`.
id: Permintaan sekarang dapat mengacu pada bidang lain pada permintaan dan dapat melintasi hubungan untuk mengacu ke bidang-bidang pada model-model terkait. Ini diterapkan dalam obyek :class:`~django.db.models.F` batu; untuk rincian lengkap, termasuk contoh-contoh, periksa :class:`F expressions documentation <django.db.models.F>`.
zh_hans: 现在查询可以引用查询中的另一个字段，并且可以遍历关系引用相关模型上的字段。这是通过新的 :class:`~django.db.models.F` 对象实现的；有关完整的详细信息，包括示例，请查阅 :class:`F 表达式文档 <django.db.models.F>`。

source: Model improvements
id: Perbaikan model
zh_hans: 模型改进

source: A number of features have been added to Django's model layer:
id: Sejumlah fitur telah ditambahkan ke lapisan model Django:
zh_hans: Django 的模型层已添加了多项功能：

source: "Unmanaged" models
id: Model "Unmanaged"
zh_hans: "未管理"模型

source: You can now control whether or not Django manages the life-cycle of the database tables for a model using the :attr:`~Options.managed` model option. This defaults to ``True``, meaning that Django will create the appropriate database tables in ``syncdb`` and remove them as part of the ``reset`` command. That is, Django *manages* the database table's lifecycle.
id: Anda sekarang dapat mengendalikan apakah atau tidak Django mengelola siklus-hidup dari tabel-tabel basisdata untuk model menggunakan pilihan model :attr:`~Options.managed`. Ini awal pada ``True``, berarti bahwa Django akan membuat tabel-tabel basisdata sesuai di ``syncdb`` dan memindahkan mereka sebagai bagian dari perintah ``reset``. Yaitu, Django *mengelola* siklus hidup tabel-tabel basisdata.
zh_hans: 现在，你可以使用 :attr:`~Options.managed` 模型选项来控制 Django 是否管理模型的数据库表的生命周期。默认值是 ``True``，这意味着 Django 将在 ``syncdb`` 中创建相应的数据库表，并在 ``reset`` 命令中删除它们。换句话说，Django *管理* 数据库表的生命周期。

source: If you set this to ``False``, however, no database table creating or deletion will be automatically performed for this model. This is useful if the model represents an existing table or a database view that has been created by some other means.
id: Jika anda menyetel ini ke ``False``, bagaimanapun, tidak ada pembautan atau penghapusan tabel basisdata akan otomatis dilakukan untuk model ini. Ini berguna jika model mewakili sebuah tabel atau tampilan basisdata yang ada yang telah dibuat oleh beberapa cara lain.
zh_hans: 然而，如果将其设置为 ``False``，则不会自动执行该模型的数据库表创建或删除操作。如果该模型代表已存在的表格或者是由其他方式创建的数据库视图，这会很有用。

source: For more details, see the documentation for the :attr:`~Options.managed` option.
id: Untuk lebih rinci, lihat dokumentasi untuk pilihan :attr:`~Options.managed`.
zh_hans: 更多详细信息，请查看 :attr:`~Options.managed` 选项的文档。

source: Proxy models
id: Model proxy
zh_hans: 代理模型

source: You can now create :ref:`proxy models <proxy-models>`: subclasses of existing models that only add Python-level (rather than database-level) behavior and aren't represented by a new table. That is, the new model is a *proxy* for some underlying model, which stores all the real data.
id: Anda sekarang dapat membuat subkelas :ref:`proxy models <proxy-models>`: dari model yang ada yang hanya menambahkan tingkat-Python (daripada tingkat-basisdata) dan tidak diwakili oleh tabel baru. yaitu, model baru adalah sebuah *proxy* untuk beberapa model pokok, yang menyimpan semua data sungguhan.
zh_hans: 现在你可以创建 :ref:`代理模型 <proxy-models>`：这些是现有模型的子类，只添加 Python 级别（而不是数据库级别）的行为，并且不代表一个新的表格。也就是说，新模型是某个底层模型的 *代理*，而底层模型存储了所有真实数据。

source: All the details can be found in the :ref:`proxy models documentation <proxy-models>`. This feature is similar on the surface to unmanaged models, so the documentation has an explanation of :ref:`how proxy models differ from unmanaged models <proxy-vs-unmanaged-models>`.
id: Semua rincian dapat ditemukan di :ref:`dokumentasi model proxy <proxy-models>`. Fitur ini mirip pada permukaan model tidak dikendalikan, jadi dokumentasi punya penjelasan dari :ref:`bagaimana model proxy berbeda dari models tidak dikendalikan <proxy-vs-unmanaged-models>`.
zh_hans: 所有详细信息可以在 :ref:`代理模型文档 <proxy-models>` 中找到。这个功能在表面上与未管理的模型相似，因此文档中有一个解释 :ref:`代理模型与未管理模型的不同之处 <proxy-vs-unmanaged-models>`。

source: Deferred fields
id: Bidang ditangguhkan
zh_hans: 延迟字段

source: In some complex situations, your models might contain fields which could contain a lot of data (for example, large text fields), or require expensive processing to convert them to Python objects. If you know you don't need those particular fields, you can now tell Django not to retrieve them from the database.
id: Di beberapa keadaan rumit, model anda mungkin mengandung bidang yang dapat mengandung banyak data (sebagai contoh, bidang teks besar), atau membutuhkan pengolahan mahal untuk merubah mereka menjadi obyek Python. Jika anda mengetahui anda tidak butuh bidang khusus itu, anda sekarang dapat memberitahu Django tidak mengambil mereka dari basisdata.
zh_hans: 在某些复杂情况下，你的模型可能包含大量数据的字段（例如，大型文本字段），或者需要耗费大量计算资源将其转换为 Python 对象。如果你确定不需要这些特定字段，现在可以告诉 Django 不从数据库中检索它们。

source: You'll do this with the new queryset methods :meth:`~django.db.models.query.QuerySet.defer` and :meth:`~django.db.models.query.QuerySet.only`.
id: Anda akan melakukan ini dengan metode queryset :meth:`~django.db.models.query.QuerySet.defer` dan :meth:`~django.db.models.query.QuerySet.only`.
zh_hans: 你可以使用新的查询集方法 :meth:`~django.db.models.query.QuerySet.defer` 和 :meth:`~django.db.models.query.QuerySet.only` 来实现这一点。

source: Testing improvements
id: Mencoba perbaikan
zh_hans: 测试改进

source: A few notable improvements have been made to the :doc:`testing framework </topics/testing/index>`.
id: Sedikit perbaikan penting telah dibuat pada :doc:`testing framework </topics/testing/index>`.
zh_hans: :doc:`测试框架 </topics/testing/index>` 中已经进行了一些显著的改进。

source: Test performance improvements
id: Pengujian perbaikan penampilan
zh_hans: 测试性能改进

source: Tests written using Django's :doc:`testing framework </topics/testing/index>` now run dramatically faster (as much as 10 times faster in many cases).
id: Perobaan ditulis menggunakan :doc:`testing framework </topics/testing/index>` Django sekarang berjalan lebih cepat secara dramatis (sebanyak 10 kali lebih cepat di banyak kasus).
zh_hans: 使用 Django 的 :doc:`测试框架 </topics/testing/index>` 编写的测试现在运行速度大幅提高（在许多情况下提高了多达 10 倍）。

source: This was accomplished through the introduction of transaction-based tests: when using :class:`django.test.TestCase`, your tests will now be run in a transaction which is rolled back when finished, instead of by flushing and re-populating the database. This results in an immense speedup for most types of unit tests. See the documentation for :class:`TestCase` and :class:`TransactionTestCase` for a full description, and some important notes on database support.
id: Ini telah diselesaikan melalui pengenalan dari percobaan berdasar transaksi: ketika menggunakan :class:`django.test.TestCase`, percobaan anda akan berjalan sekarang di transaksi yang digulung kembali ketika selesai, daripada membilas dan mengumpulkan kembali basisdata. Hasil ini dalam percepatan besar untuk kebanyakan jenis dari satuan percobaan. Lihat dokumentasi untuk :class:`TestCase` dan :class:`TransactionTestCase` untuk gambaran penuh, dan beberapa catatan penting pada dukungan basisdata.
zh_hans: 通过引入基于事务的测试来实现的：当使用 :class:`django.test.TestCase` 时，你的测试现在将在一个事务中运行，测试结束后将回滚事务，而不是刷新和重新填充数据库。这对于大多数类型的单元测试来说会极大地提速。请查看 :class:`TestCase` 和 :class:`TransactionTestCase` 的文档以获取完整的描述，以及关于数据库支持的一些重要说明。

source: Test client improvements
id: Pengujian perbaikan klien
zh_hans: 测试客户端改进

source: A couple of small -- but highly useful -- improvements have been made to the test client:
id: Beberapa kecil -- tetapi sangat berguna -- perbaikan telah dibuat pada klien percobaan:
zh_hans: 测试客户端进行了几项小而非常有用的改进：

source: The test :class:`Client` now can automatically follow redirects with the ``follow`` argument to :meth:`Client.get` and :meth:`Client.post`. This makes testing views that issue redirects simpler.
id: Percobaan :class:`Client` sekarang dapat otomatis mengikuti pengalihan dengan argumen ``follow`` pada :meth:`Client.get` and :meth:`Client.post`. Ini membuat tampilan percobaan yang menerbitkan pengalihan lebih sederhana.
zh_hans: 测试中的 :class:`Client` 现在可以通过 :meth:`Client.get` 和 :meth:`Client.post` 的 ``follow`` 参数自动跟随重定向。这使得测试发出重定向的视图更加简单。

source: It's now easier to get at the template context in the response returned the test client: you'll simply access the context as ``request.context[key]``. The old way, which treats ``request.context`` as a list of contexts, one for each rendered template in the inheritance chain, is still available if you need it.
id: Sekarang lebih mudah mendapatkan cetakan konteks di tanggapan mengembalikan percobaan klien: anda akan cukup mengakses konteks sebagai ``request.context[key]``. Cara lama, yang memperlakukan ``request.context`` sebagai dafar konteks, satu untuk setiap cetakan dibangun di rantai warisan, masih tersedia jika anda membutuhkannya.
zh_hans: 现在更容易获取测试客户端返回的响应中的模板上下文：你只需将上下文作为 ``request.context[key]`` 来访问。如果需要，仍然可以使用旧方式，该方式将 ``request.context`` 视为继承链中每个渲染模板的上下文列表。

source: New admin features
id: Fitur admin baru
zh_hans: 新的管理功能

source: Django 1.1 adds a couple of nifty new features to Django's admin interface:
id: Django 1.1 menambahkan beberapa fitur baru yang bagus pada antarmuka admin Django:
zh_hans: Django 1.1 在 Django 的管理界面中增加了几个很棒的新功能：

source: Editable fields on the change list
id: Bidang dapat dirubah pada daftar perubahan
zh_hans: 在更改列表上的可编辑字段

source: You can now make fields editable on the admin list views via the new :ref:`list_editable <admin-list-editable>` admin option. These fields will show up as form widgets on the list pages, and can be edited and saved in bulk.
id: Anda sekarang dapat membuat bidang disunting pada tampilan daftar admin melalui pilihan admin :ref:`list_editable <admin-list-editable>` baru. Bidang-bidang ini akan menampilkan widget formulir pada daftar halaman, dan dpat disunting dan disimpan dalam jumlah besar.
zh_hans: 现在你可以通过新的 :ref:`list_editable <admin-list-editable>` 管理选项在管理员列表视图上使字段可编辑。这些字段将显示为表单小部件在列表页面上，并可以批量编辑和保存。

source: Admin "actions"
zh_hans: 管理界面的"动作"

source: You can now define :doc:`admin actions </ref/contrib/admin/actions>` that can perform some action to a group of models in bulk. Users will be able to select objects on the change list page and then apply these bulk actions to all selected objects.
id: Anda sekarang dapat menentukan :doc:`admin actions </ref/contrib/admin/actions>` yang dapat melakukan beberapa tindakan pada sekelompok model dalam jumlah besar. Pengguna akan dapat memilih obyek pada perubahan daftar halaman dan kemudian memberlakukan tindakan dalam jumlah besar ini pada semua obyek terpilih.
zh_hans: 现在你可以定义可以批量对一组模型执行某些操作的 :doc:`管理员操作 </ref/contrib/admin/actions>`。用户将能够在更改列表页面上选择对象，然后将这些批量操作应用于所有选定的对象。

source: Django ships with one pre-defined admin action to delete a group of objects in one fell swoop.
id: Django dibekali dengan satu tindakan admin pra penentuan untuk menghapus sebuah kelompok dari obyek di sekali kejadian.
zh_hans: Django 默认提供了一个预定义的管理动作，可以一次性删除一组对象。

source: Conditional view processing
id: Pengolahan tampilan bersyarat
zh_hans: 条件视图处理
