Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Private APIs ``django.db.models.sql.where.WhereNode.make_atom()`` and ``django.db.models.sql.where.Constraint`` are deprecated in favor of the new :doc:`custom lookups API </ref/models/lookups>`.
id: API pribadi ``django.db.models.sql.where.WhereNode.make_atom()`` dan ``django.db.models.sql.where.Constraint`` diusangkan dalam mendukung dari :doc:`custom lookups API </ref/models/lookups>` baru.
zh_hans: 私有 API ``django.db.models.sql.where.WhereNode.make_atom()`` 和 ``django.db.models.sql.where.Constraint`` 已被弃用，推荐使用新的 :doc:`自定义查询 API </ref/models/lookups>`。

source: Features removed in 1.7
id: Fitur-fitur dipindahkan dalam 1.7
zh_hans: 在 1.7 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 1.7. See :ref:`deprecated-features-1.5` for details, including how to remove usage of these features.
id: Fitur-fitur ini telah mencapai akhir siklus pengusangan mereka dan dipindahkan di Django 1.7. Lihat :ref:`deprecated-features-1.5` untuk rincian, termasuk bagaimana memindahkan penggunaan fitur ini.
zh_hans: 这些功能已经完成了它们的弃用周期，并在 Django 1.7 中被移除。有关详细信息，包括如何删除对这些功能的使用，请参阅 :ref:`deprecated-features-1.5`。

source: ``django.utils.simplejson`` is removed.
id: ``django.utils.simplejson`` dipindahkan.
zh_hans: ``django.utils.simplejson`` 已被移除。

source: ``django.utils.itercompat.product`` is removed.
id: ``django.utils.itercompat.product`` dipindahkan.
zh_hans: ``django.utils.itercompat.product`` 已被移除。

source: INSTALLED_APPS and TEMPLATE_DIRS are no longer corrected from a plain string into a tuple.
id: INSTALLED_APPS dan TEMPLATE_DIRS tidak lagi diperbaiki dari deretan karakter polos kedalam sebuah tuple.
zh_hans: INSTALLED_APPS 和 TEMPLATE_DIRS 不再自动将纯字符串转换为元组。

source: :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, :class:`~django.template.response.TemplateResponse`, ``render_to_response()``, :func:`~django.contrib.sitemaps.views.index`, and :func:`~django.contrib.sitemaps.views.sitemap` no longer take a ``mimetype`` argument
id: :class:`~django.http.HttpResponse`, :class:`~django.template.response.SimpleTemplateResponse`, :class:`~django.template.response.TemplateResponse`, ``render_to_response()``, :func:`~django.contrib.sitemaps.views.index`, dan :func:`~django.contrib.sitemaps.views.sitemap` tidak lagi mengambil sebuah argumen ``mimetype``
zh_hans: :class:`~django.http.HttpResponse`、:class:`~django.template.response.SimpleTemplateResponse`、:class:`~django.template.response.TemplateResponse`、``render_to_response()``、:func:`~django.contrib.sitemaps.views.index` 和 :func:`~django.contrib.sitemaps.views.sitemap` 不再接受 ``mimetype`` 参数。

source: :class:`~django.http.HttpResponse` immediately consumes its content if it's an iterator.
id: :class:`~django.http.HttpResponse` segera memakan isinya jika itu adalah sebuah perulangan.
zh_hans: :class:`~django.http.HttpResponse` 如果其内容是一个迭代器，会立即消耗它。

source: The ``AUTH_PROFILE_MODULE`` setting, and the ``get_profile()`` method on the User model are removed.
id: Pengaturan ``AUTH_PROFILE_MODULE``, dan metode ``get_profile()`` pada model User dipindahkan.
zh_hans: ``AUTH_PROFILE_MODULE`` 设置以及用户模型上的 ``get_profile()`` 方法已被移除。

source: The ``cleanup`` management command is removed.
id: Perintah pengelolaan ``cleanup`` dipindahkan.
zh_hans: ``cleanup`` 管理命令已被移除。

source: The ``daily_cleanup.py`` script is removed.
id: Tulisan ``daily_cleanup.py`` dipindahkan.
zh_hans: ``daily_cleanup.py`` 脚本已被移除。

source: :meth:`~django.db.models.query.QuerySet.select_related` no longer has a ``depth`` keyword argument.
id: :meth:`~django.db.models.query.QuerySet.select_related` tidak lagi mempunyai argumen kata kunci ``depth``.
zh_hans: :meth:`~django.db.models.query.QuerySet.select_related` 不再具有 ``depth`` 关键字参数。

source: The ``get_warnings_state()``/``restore_warnings_state()`` functions from :mod:`django.test.utils` and the ``save_warnings_state()``/ ``restore_warnings_state()`` :ref:`django.test.*TestCase <django-testcase-subclasses>` are removed.
id: Fungsi ``get_warnings_state()``/``restore_warnings_state()`` dari :mod:`django.test.utils` dan the ``save_warnings_state()``/ ``restore_warnings_state()`` :ref:`django.test.*TestCase <django-testcase-subclasses>` dipindahkan.
zh_hans: 从 :mod:`django.test.utils` 中的 ``get_warnings_state()``/``restore_warnings_state()`` 函数以及 :ref:`django.test.*TestCase <django-testcase-subclasses>` 中的 ``save_warnings_state()``/ ``restore_warnings_state()`` 已被移除。

source: The ``check_for_test_cookie`` method in :class:`~django.contrib.auth.forms.AuthenticationForm` is removed.
id: Metode ``check_for_test_cookie`` di :class:`~django.contrib.auth.forms.AuthenticationForm` dipindahkan.
zh_hans: :class:`~django.contrib.auth.forms.AuthenticationForm` 中的 ``check_for_test_cookie`` 方法已被移除。

source: The version of ``django.contrib.auth.views.password_reset_confirm()`` that supports base36 encoded user IDs (``django.contrib.auth.views.password_reset_confirm_uidb36``) is removed.
zh_hans: 支持 base36 编码的用户 ID 的 ``django.contrib.auth.views.password_reset_confirm()`` 版本（``django.contrib.auth.views.password_reset_confirm_uidb36``）已被移除。

source: The ``django.utils.encoding.StrAndUnicode`` mix-in is removed.
id: Mix-in ``django.utils.encoding.StrAndUnicode`` dipindahkan.
zh_hans: ``django.utils.encoding.StrAndUnicode`` 混合类已被移除。

source: Django 1.7.1 release notes
id: Catatan terbitan Django 1.7.1
zh_hans: Django 1.7.1 版本发行说明

source: Django 1.7.1 fixes several bugs in 1.7.
id: Django 1.7.1 memperbaiki beberapa kesalahan di 1.7.
zh_hans: Django 1.7.1 修复了 1.7 版本中的一些错误。

source: Added a more helpful error message if you try to migrate an app without first creating the ``contenttypes`` table (:ticket:`22411`).
id: Ditambahkan pesan kesalahan lebih membantu jika anda mencoba memindahkan sebuah aplikasi tanpa pertama membuat tabel ``contenttypes`` (:ticket:`22411`).
zh_hans: 如果您尝试在未创建 ``contenttypes`` 表的情况下迁移应用程序，将会显示更加有帮助的错误消息（:ticket:`22411`）。

source: Modified migrations dependency algorithm to avoid possible infinite recursion.
id: Dirubah algoritma ketergantungan perpindahan untuk menghindari kemungkinan perulangan tidak terbatas.
zh_hans: 修改了迁移依赖算法，以避免可能的无限递归。

source: Fixed a ``UnicodeDecodeError`` when the ``flush`` error message contained Unicode characters (:ticket:`22882`).
id: Diperbaiki ``UnicodeDecodeError`` ketika pesan kesalahan ``flush`` mengandung karakter Unicode (:ticket:`22882`).
zh_hans: 修复了当 ``flush`` 错误消息包含 Unicode 字符时出现的 ``UnicodeDecodeError`` (:ticket:`22882`)。

source: Reinstated missing ``CHECK`` SQL clauses which were omitted on some backends when not using migrations (:ticket:`23416`).
id: Menginstansiasi kembali klausa SQL ``CHECK`` hilang yang telah dihilangkan pada beberapa backend ketika tidak menggunakan perpindahan (:ticket:`23416`).
zh_hans: 重新引入了缺失的 ``CHECK`` SQL 子句，这些子句在某些后端上在不使用迁移时被省略了 (:ticket:`23416`)。

source: Fixed serialization of ``type`` objects in migrations (:ticket:`22951`).
id: Diperbaiki serialisasi dari obyek ``type`` di perpindahan (:ticket:`22951`).
zh_hans: 修复了在迁移中对 ``type`` 对象的序列化 (:ticket:`22951`)。

source: The ``@deconstructible`` decorator now fails with a ``ValueError`` if the decorated object cannot automatically be imported (:ticket:`23418`).
id: Penghias ``@deconstructible`` sekarang gagal dengan ``ValueError`` jika obyek penghias tidak dapat secara otomatis diimpor (:ticket:`23418`).
zh_hans: 现在，如果被装饰的对象无法自动导入，``@deconstructible`` 装饰器将引发 ``ValueError`` (:ticket:`23418`)。

source: Fixed a typo in an ``inlineformset_factory()`` error message that caused a crash (:ticket:`23451`).
id: Diperbaiki kesalahan ketik di sebuah pesan kesalahan ``inlineformset_factory()`` yang menyebabkan kegagalan (:ticket:`23451`).
zh_hans: 修复了 ``inlineformset_factory()`` 错误消息中的拼写错误，导致崩溃 (:ticket:`23451`)。

source: Restored the ability to use :setting:`ABSOLUTE_URL_OVERRIDES` with the ``'auth.User'`` model (:ticket:`11775`). As a side effect, the setting now adds a ``get_absolute_url()`` method to any model that appears in ``ABSOLUTE_URL_OVERRIDES`` but doesn't define ``get_absolute_url()``.
id: Disimpan kembali kemampuan menggunakan :setting:`ABSOLUTE_URL_OVERRIDES` dengan model ``'auth.User'`` (:ticket:`11775`). Sebagai efek samping, pengaturan sekarang menambahkan sebuah metode ``get_absolute_url()`` ke setiap model yang muncul di ``ABSOLUTE_URL_OVERRIDES`` tetapi tidak menentukan ``get_absolute_url()``.
zh_hans: 恢复了使用 :setting:`ABSOLUTE_URL_OVERRIDES` 与 ``'auth.User'`` 模型的能力 (:ticket:`11775`)。作为副作用，该设置现在会为出现在 ``ABSOLUTE_URL_OVERRIDES`` 中但没有定义 ``get_absolute_url()`` 的任何模型添加一个 ``get_absolute_url()`` 方法。

source: Avoided masking some ``ImportError`` exceptions during application loading (:ticket:`22920`).
zh_hans: 避免了在应用程序加载过程中掩盖一些 ``ImportError`` 异常 (:ticket:`22920`)。

source: Empty ``index_together`` or ``unique_together`` model options no longer results in infinite migrations (:ticket:`23452`).
id: Kosongkan pilihan model ``index_together`` atau ``unique_together`` tidak lagi menghasilkan di perpindahan tak terbatas (:ticket:`23452`).
zh_hans: 空的 ``index_together`` 或 ``unique_together`` 模型选项不再导致无限迁移 (:ticket:`23452`)。

source: Fixed crash in ``contrib.sitemaps`` if ``lastmod`` returned a ``date`` rather than a ``datetime`` (:ticket:`23403`).
id: Diperbaiki kegagalan di ``contrib.sitemaps`` jika ``lastmod`` mengembalikan sebuah ``date`` daripada sebuah ``datetime`` (:ticket:`23403`).
zh_hans: 修复了在 ``contrib.sitemaps`` 中的崩溃，如果 ``lastmod`` 返回的是一个 ``date`` 而不是一个 ``datetime`` (:ticket:`23403`)。

source: Allowed migrations to work with ``app_label``\s that have the same last part (e.g. ``django.contrib.auth`` and ``vendor.auth``) (:ticket:`23483`).
id: Diizinkan perpindahan untuk bekerja dengan ``app_label`` yang mempunyai bagian terakhir sama (sebagai contoh ``django.contrib.auth`` dan ``vendor.auth``) (:ticket:`23483`).
zh_hans: 允许迁移与具有相同最后一部分的 ``app_label`` （例如 ``django.contrib.auth`` 和 ``vendor.auth``）一起工作 (:ticket:`23483`)。

source: Restored the ability to deepcopy ``F`` objects (:ticket:`23492`).
id: Disimpan kembali kemampuan untuk menyalin dalam obyek ``F`` (:ticket:`23492`).
zh_hans: 恢复了深度复制 ``F`` 对象的能力 (:ticket:`23492`)。

source: Formats for Welsh (``cy``) and several Chinese locales (``zh_CN``, ``zh_Hans``, ``zh_Hant`` and ``zh_TW``) have been added. Formats for Macedonian have been fixed (trailing dot removed, :ticket:`23532`).
id: Bentuk untuk Wales (``cy``) dan beberapa lokal China (``zh_CN``, ``zh_Hans``, ``zh_Hant`` dan ``zh_TW``) telah ditambahkan. Bentuk-bentuk untuk Macedonia telah diperbaiki (titik mengikuti dipindahkan, :ticket:`23532`).
zh_hans: 已添加威尔士语（``cy``）和多个中国区域（``zh_CN``、``zh_Hans``、``zh_Hant`` 和 ``zh_TW``）的格式。已修复马其顿语的格式（删除尾部点号，:ticket:`23532`）。

source: Added quoting of constraint names in the SQL generated by migrations to prevent crash with uppercase characters in the name (:ticket:`23065`).
id: Ditambahkan mengutip dari batasan nama di SQL dibangkitkan oleh perpindahan untuk mencegah kegagalan dengan karakter huruf besar di nama (:ticket:`23065`).
zh_hans: 在迁移生成的 SQL 中添加了对约束名称的引用，以防止在名称中使用大写字符时崩溃 (:ticket:`23065`)。

source: Fixed renaming of models with a self-referential many-to-many field (``ManyToManyField('self')``) (:ticket:`23503`).
id: Diperbaiki menamai kembali dari model dengan sebuah bidang self-referential many-to-many (``ManyToManyField('self')``) (:ticket:`23503`).
zh_hans: 修复了具有自引用多对多字段（``ManyToManyField('self')``）的模型重命名问题 (:ticket:`23503`)。

source: Added the :meth:`~django.contrib.admin.InlineModelAdmin.get_extra()`, :meth:`~django.contrib.admin.InlineModelAdmin.get_max_num()`, and :meth:`~django.contrib.admin.InlineModelAdmin.get_min_num()` hooks to :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin` (:ticket:`23539`).
id: Ditambahkan :meth:`~django.contrib.admin.InlineModelAdmin.get_extra()`, :meth:`~django.contrib.admin.InlineModelAdmin.get_max_num()`, dan :meth:`~django.contrib.admin.InlineModelAdmin.get_min_num()` dikaitkan ke :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin` (:ticket:`23539`).
zh_hans: 向 :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin` 添加了 :meth:`~django.contrib.admin.InlineModelAdmin.get_extra()`、:meth:`~django.contrib.admin.InlineModelAdmin.get_max_num()` 和 :meth:`~django.contrib.admin.InlineModelAdmin.get_min_num()` 钩子 (:ticket:`23539`)。

source: Made ``migrations.RunSQL`` no longer require percent sign escaping. This is now consistent with ``cursor.execute()`` (:ticket:`23426`).
id: Membuat ``migrations.RunSQL`` tidak lagi membutuhkan pelolosan tanda persen. Ini sekarang tetap dengan ``cursor.execute()`` (:ticket:`23426`).
zh_hans: 使 ``migrations.RunSQL`` 不再需要百分号转义。现在与 ``cursor.execute()`` 保持一致 (:ticket:`23426`)。

source: Made the ``SERIALIZE`` entry in the :setting:`TEST <DATABASE-TEST>` dictionary usable (:ticket:`23421`).
zh_hans: 使 :setting:`TEST <DATABASE-TEST>` 字典中的 ``SERIALIZE`` 条目可用 (:ticket:`23421`)。

source: Fixed bug in migrations that prevented foreign key constraints to unmanaged models with a custom primary key (:ticket:`23415`).
id: Diperbaiki kesalahan di perpindahan yang mencegah batasan primary key pada model tidak dikelola dengan primary key yang disesuaian (:ticket:`23415`).
zh_hans: 修复了迁移中的错误，该错误阻止了对具有自定义主键的未管理模型的外键约束 (:ticket:`23415`)。

source: Added ``SchemaEditor`` for MySQL GIS backend so that spatial indexes will be created for apps with migrations (:ticket:`23538`).
id: Ditambahkan ``SchemaEditor`` untuk backend GIS MySQL sehingga indeks spasial akan dibuat untuk aplikasi dengan perpindahan (:ticket:`23538`).
zh_hans: 为 MySQL GIS 后端添加了 ``SchemaEditor``，以便在具有迁移的应用程序中创建空间索引 (:ticket:`23538`)。

source: Added ``SchemaEditor`` for Oracle GIS backend so that spatial metadata and indexes will be created for apps with migrations (:ticket:`23537`).
id: Ditambahkan ``SchemaEditor`` untuk backend GIS Oracle sehingga metadata spasial dan indeks akan dibuat untuk aplikasi dengan perpindahan (:ticket:`23537`).
zh_hans: 为 Oracle GIS 后端添加了 ``SchemaEditor``，以便在具有迁移的应用程序中创建空间元数据和索引 (:ticket:`23537`)。

source: Coerced the ``related_name`` model field option to Unicode during migration generation to generate migrations that work with both Python 2 and 3 (:ticket:`23455`).
zh_hans: 在生成迁移时将 ``related_name`` 模型字段选项强制转换为 Unicode，以生成在 Python 2 和 3 中都可用的迁移 (:ticket:`23455`)。

source: Fixed ``MigrationWriter`` to handle builtin types without imports (:ticket:`23560`).
id: Diperbaiki ``MigrationWriter`` untuk menangani jenis siap-pakai tanpa impor (:ticket:`23560`).
zh_hans: 修复了 ``MigrationWriter`` 以处理没有导入的内置类型 (:ticket:`23560`)。

source: Fixed ``deepcopy`` on ``ErrorList`` (:ticket:`23594`).
id: Diperbaiki ``deepcopy`` pada ``ErrorList`` (:tiket:`23594`).
zh_hans: 修复了 ``ErrorList`` 上的 ``deepcopy`` (:ticket:`23594`)。

source: Made the :mod:`~django.contrib.admindocs` view to browse view details check if the view specified in the URL exists in the URLconf. Previously it was possible to import arbitrary packages from the Python path. This was not considered a security issue because ``admindocs`` is only accessible to staff users (:ticket:`23601`).
id: Dibuat tampilan :mod:`~django.contrib.admindocs` untuk menjelajah pemeriksaan rincian tampilan jika tampilan yang ditentukan di URL yang ada di URLconf. Sebelumnya itu memungkinkan untuk mengimpor paket yang berubah-ubah dari jalur Python. Ini bukan dipertimbangkan sebagai masalah keamanan karena ``admindocs`` hanya dapat diakses ke pengguna staf (:ticket:`23601`).
zh_hans: 使 :mod:`~django.contrib.admindocs` 中的浏览视图详细信息的视图检查 URL 中指定的视图是否存在于 URL 配置中。以前，可以从 Python 路径中导入任意包。这不被认为是一个安全问题，因为 ``admindocs`` 只对工作人员用户可访问 (:ticket:`23601`)。

source: Fixed ``UnicodeDecodeError`` crash in ``AdminEmailHandler`` with non-ASCII characters in the request (:ticket:`23593`).
id: Diperbaiki kegagalan ``UnicodeDecodeError`` di ``AdminEmailHandler`` dengan karakter bukan-ASCII di permintaan (:ticket:`23593`).
zh_hans: 修复了在请求中包含非 ASCII 字符时，``AdminEmailHandler`` 中的 ``UnicodeDecodeError`` 崩溃 (:ticket:`23593`)。

source: Fixed missing ``get_or_create`` and ``update_or_create`` on related managers causing ``IntegrityError`` (:ticket:`23611`).
id: Diperbaiki kehilangan ``get_or_create`` dan ``update_or_create`` pada pengelola terkait menyebabkan ``IntegrityError`` (:ticket:`23611`).
zh_hans: 修复了相关管理器上缺失 ``get_or_create`` 和 ``update_or_create`` 导致 ``IntegrityError`` 的问题 (:ticket:`23611`)。

source: Made :func:`~django.utils.http.urlsafe_base64_decode` return the proper type (bytestring) on Python 3 (:ticket:`23333`).
zh_hans: 在 Python 3 上，使 :func:`~django.utils.http.urlsafe_base64_decode` 返回正确的类型（字节字符串） (:ticket:`23333`)。

source: :djadmin:`makemigrations` can now serialize timezone-aware values (:ticket:`23365`).
id: :djadmin:`makemigrations` sekarang dapat menserialisasikan nilai sadar-zona waktu (:ticket:`23365`).
zh_hans: :djadmin:`makemigrations` 现在可以序列化带有时区信息的值 (:ticket:`23365`)。

source: Added a prompt to the migrations questioner when removing the null constraint from a field to prevent an IntegrityError on existing NULL rows (:ticket:`23609`).
id: Ditambahkan penunjukan ke pertanyaan perpindahan ketika memindahkan batasan null dari sebuah bidang untuk mencegah sebuah IntegrityErrorpada baris NULL yang ada (:ticket:`23609`).
zh_hans: 在从字段中移除空约束以防止现有 NULL 行上的 IntegrityError 时，为迁移问题添加了提示 (:ticket:`23609`)。

source: Fixed generic relations in ``ModelAdmin.list_filter`` (:ticket:`23616`).
id: Diperbaiki hubungan umum di ``ModelAdmin.list_filter`` (:ticket:`23616`).
zh_hans: 修复了 ``ModelAdmin.list_filter`` 中的通用关联问题 (:ticket:`23616`)。

source: Restored RFC compliance for the SMTP backend on Python 3 (:ticket:`23063`).
id: Disimpan kembali pemenuhan RFC untuk backend SMTP pada Python 3 (:ticket:`23063`).
zh_hans: 恢复了 Python 3 上 SMTP 后端的 RFC 兼容性 (:ticket:`23063`)。

source: Fixed a crash while parsing cookies containing invalid content (:ticket:`23638`).
id: Diperbaiki sebuah kegagalan selagi mengurai kue-kue mengandung isi tidak sah (:ticket:`23638`).
zh_hans: 修复了解析包含无效内容的 Cookie 时崩溃的问题 (:ticket:`23638`)。

source: The system check framework now raises error **models.E020** when the class method ``Model.check()`` is unreachable (:ticket:`23615`).
id: Kerangka sistem pemeriksaan sekarang menampilkan kesalahan **models.E020** ketika kelas metode ``Model.check()`` tidak dijangkau(:ticket:`23615`).
zh_hans: 系统检查框架现在在类方法 ``Model.check()`` 不可达时引发错误 **models.E020** (:ticket:`23615`)。

source: Made the Oracle test database creation drop the test user in the event of an unclean exit of a previous test run (:ticket:`23649`).
id: Dibuat pembuatan basisdata percobaan Oracle menajtuhkan pengguna dalam acara dari sebuah keluar yang tidak bersih dari pejalan percobaan sebelumnya (:ticket:`23649`).
zh_hans: 在前一个测试运行的不干净退出事件中，Oracle 测试数据库创建现在会删除测试用户 (:ticket:`23649`)。

source: Fixed :djadmin:`makemigrations` to detect changes to :attr:`Meta.db_table <django.db.models.Options.db_table>` (:ticket:`23629`).
id: Diperbaiki :djadmin:`makemigrations` untuk mengenali perubahan pada :attr:`Meta.db_table <django.db.models.Options.db_table>` (:ticket:`23629`).
zh_hans: 修复了 :djadmin:`makemigrations` 以检测对 :attr:`Meta.db_table <django.db.models.Options.db_table>` 的更改 (:ticket:`23629`)。

source: Fixed a regression when feeding the Django test client with an empty data string (:ticket:`21740`).
id: Diperbaiki sebuah pemulihan ketika mengumpan klien percobaan Django dengan string data kosong (:ticket:`21740`).
zh_hans: 修复了在向 Django 测试客户端提供空数据字符串时的回归问题 (:ticket:`21740`)。

source: Fixed a regression in :djadmin:`makemessages` where static files were unexpectedly ignored (:ticket:`23583`).
id: Diperbaiki sebuah pemulihan di :djadmin:`makemessages` dimana berkas-berkas tetap mendadak diabaikan (:ticket:`23583`).
zh_hans: 修复了 :djadmin:`makemessages` 中的回归问题，其中静态文件意外被忽略 (:ticket:`23583`)。

source: Django 1.7.10 release notes
id: Catatan terbitan Django 1.7.10
zh_hans: Django 1.7.10 版本发行说明

source: Django 1.7.10 fixes a security issue in 1.7.9.
id: Django 1.7.10 memperbaiki masalah keamanan di 1.7.9.
zh_hans: Django 1.7.10 修复了 1.7.9 中的一个安全问题。

source: Django 1.7.11 release notes
id: Catatan terbitan Django 1.7.11
zh_hans: Django 1.7.11 版本发行说明

source: *November 24, 2015*
zh_hans: *2015 年 11 月 24 日*

source: Django 1.7.11 fixes a security issue and a data loss bug in 1.7.10.
id: Django 1.7.11 memperbaiki masalah kesalahan dan kesalahan kehilangan data di 1.7.10.
zh_hans: Django 1.7.11 修复了 1.7.10 中的一个安全问题和一个数据丢失的错误。

source: Fixed settings leak possibility in ``date`` template filter
id: Diperbaiki mengatur kemungkinan kebocoran di penyaring cetakan ``date``
zh_hans: 修复了模板过滤器 ``date`` 中的设置泄漏可能性

source: If an application allows users to specify an unvalidated format for dates and passes this format to the :tfilter:`date` filter, e.g. ``{{ last_updated|date:user_date_format }}``, then a malicious user could obtain any secret in the application's settings by specifying a settings key instead of a date format. e.g. ``"SECRET_KEY"`` instead of ``"j/m/Y"``.
id: Jika sebuah aplikasi mengizinkan pengguna menentukan bentuk tidak sah untuk tanggal dan melewatkan bentuk ini ke :tfilter:`date` filter, sebagai contoh ``{{ last_updated|date:user_date_format }}``, kemudian seorang pengguna berbahaya dapat mengambil setiap rahasia pengaturan aplikasi dengan menentukan sebuah kunci pengaturan daripada bentuk tanggal sebagai contoh ``"SECRET_KEY"`` daripada ``"j/m/Y"``.
zh_hans: 如果一个应用程序允许用户指定未经验证的日期格式，并将此格式传递给 :tfilter:`date` 过滤器，例如 ``{{ last_updated|date:user_date_format }}``，那么一个恶意用户可以通过指定设置键而不是日期格式来获取应用程序设置中的任何密钥，例如 ``"SECRET_KEY"`` 而不是 ``"j/m/Y"``。

source: To remedy this, the underlying function used by the ``date`` template filter, ``django.utils.formats.get_format()``, now only allows accessing the date/time formatting settings.
id: Untuk memperbaiki ini, fungsi pokok digunakan oleh penyaring cetakan ``date``, ``django.utils.formats.get_format()``, sekarang hanya mengizinkan mengakses pengaturan berbentuk date/time.
zh_hans: 为了解决这个问题，被 ``date`` 模板过滤器使用的底层函数 ``django.utils.formats.get_format()`` 现在只允许访问日期/时间格式设置。

source: Fixed a data loss possibility with :class:`~django.db.models.Prefetch` if ``to_attr`` is set to a ``ManyToManyField`` (:ticket:`25693`).
id: Diperbaiki kemungkinan kehilangan data dengan :class:`~django.db.models.Prefetch` jika ``to_attr`` disetel menjadi ``ManyToManyField`` (:ticket:`25693`).
zh_hans: 修复了使用 :class:`~django.db.models.Prefetch` 时，如果将 ``to_attr`` 设置为 ``ManyToManyField``，可能会导致数据丢失的问题 (:ticket:`25693`)。

source: Django 1.7.2 release notes
id: Catatan terbitan Django 1.7.2
zh_hans: Django 1.7.2 版本发行说明

source: Django 1.7.2 fixes several bugs in 1.7.1.
id: Django 1.7.2 memperbaiki beberapa kesalahan di 1.7.1.
zh_hans: Django 1.7.2 修复了 1.7.1 中的几个错误。

source: Fixed migration's renaming of auto-created many-to-many tables when changing :attr:`Meta.db_table <django.db.models.Options.db_table>` (:ticket:`23630`).
id: Diperbaiki menamai kembali perpindahan dari dibuat-otomatis tabel many-to-many ketika merubah :attr:`Meta.db_table <django.db.models.Options.db_table>` (:ticket:`23630`).
zh_hans: 修复了在更改 :attr:`Meta.db_table <django.db.models.Options.db_table>` 时迁移对自动创建的多对多表的重命名问题 (:ticket:`23630`)。

source: Fixed a migration crash when adding an explicit ``id`` field to a model on SQLite (:ticket:`23702`).
id: Diperbaiki sebah perpindahan kegagalan ketika menambahkan bidang ``id`` gamblang pada sebuah model di SQLite (:ticket:`23702`).
zh_hans: 修复了在 SQLite 上向模型添加显式 ``id`` 字段时迁移崩溃的问题 (:ticket:`23702`)。
