Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: In certain situations, URL reversing could generate scheme-relative URLs (URLs starting with two slashes), which could unexpectedly redirect a user to a different host. An attacker could exploit this, for example, by redirecting users to a phishing site designed to ask for user's passwords.
id: Di keadaan tertentu, membalikkan URL dapat membangkitkan URL relatif-skema (URL mulai dengan dua garis miring), yang dapat tiba-tiba mengalihkan pengguna ke rumah berbeda. Seorang penyerang dapat memanfaatkan ini, sebagai contoh, dengan mengalihkan pengguna ke situs phishing dirancang meminta untuk sandi pengguna.
zh_hans: 在某些情况下，URL 反转可能生成方案相对的 URL（以两个斜杠开头的 URL），这可能会使用户意外地被重定向到另一个主机。攻击者可以利用这一点，例如，通过将用户重定向到一个专门设计用来索取用户密码的钓鱼网站。

source: To remedy this, URL reversing now ensures that no URL starts with two slashes (//), replacing the second slash with its URL encoded counterpart (%2F). This approach ensures that semantics stay the same, while making the URL relative to the domain and not to the scheme.
id: Untuk memperbaiki ini, membalikkan URL sekarang memastikan bahwa tidak ada URL mlai dengan dua garis miring (//), mengganti garis miring kedua dengan URL disandikan pasangan (%2F). Pendekatan ini memastikan bahwa arti kata masih sama, selagi membuat relatif URL ke ranah dan tidak ke skema.
zh_hans: 为了解决这个问题，URL 反查现在确保没有 URL 以两个斜杠（//）开头，用其 URL 编码的对应项（ %2F ）替换第二个斜杠。这种方法确保语义保持不变，同时使 URL 相对于域而不是协议。

source: File upload denial-of-service
id: Unggah berkas denial-of-service
zh_hans: 文件上传拒绝服务攻击

source: Before this release, Django's file upload handing in its default configuration may degrade to producing a huge number of ``os.stat()`` system calls when a duplicate filename is uploaded. Since ``stat()`` may invoke IO, this may produce a huge data-dependent slowdown that slowly worsens over time. The net result is that given enough time, a user with the ability to upload files can cause poor performance in the upload handler, eventually causing it to become very slow simply by uploading 0-byte files. At this point, even a slow network connection and few HTTP requests would be all that is necessary to make a site unavailable.
id: Sebelum terbitan ini, penanganan unggah berkas Django di konfigurasi awalannya mungkin menurun untuk menghasilkan sejumlah besar dari panggilan sistem ``os.stat()`` ketika nama berkas ganda diunggah. Sejak ``stat()`` mungkin meminta IO, ini mungkin menghasilkan perlambatan ketergantungan-data besar yang perlahan memburuk terhadap waktu. Hasil bersih adalah yang diberikan waktu cukup, seorang pengguna dengan kemampuan mengunggah berkas-berkas dapat menyebabkan penampilan buruk di penangan unggahan, akhirnya menyebabkan itu menjadi lebih lambat hanya dengan menggunggah berkas 0-byte. Pada titik ini, bahkan hubungan jaringan lambat dan sedikit permintaan HTTP akan semua yang diperlukan untuk membuat situs tidak tersedia.
zh_hans: 在此版本之前，在其默认配置下，Django 的文件上传处理在上传重复文件名时可能会退化为产生大量的 ``os.stat()`` 系统调用。由于 ``stat()`` 可能会引发 IO 操作，这可能会导致数据相关的巨大性能下降，随着时间的推移逐渐恶化。最终结果是，给定足够的时间，具有上传文件权限的用户可以通过上传 0 字节文件来导致上传处理程序性能下降，最终导致它变得非常慢。在这一点上，即使是较慢的网络连接和少量的 HTTP 请求也足以使站点不可用。

source: We've remedied the issue by changing the algorithm for generating file names if a file with the uploaded name already exists. :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` now appends an underscore plus a random 7 character alphanumeric string (e.g. ``"_x3a1gho"``), rather than iterating through an underscore followed by a number (e.g. ``"_1"``, ``"_2"``, etc.).
id: Kami telah memperbaiki masalah ini dengan merubah algoritma untuk membangkitkan nama berkas jika sebuah berkas dengan nama terunggah sudah ada. :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` sekarang menambah garis bawah ditambah 7 karakter alfanumerik acak (sebagai contoh ``"_x3a1gho"``), daripada mengulang melalui garis bawah diikuti oleh angka (sebagai contoh ``"_1"``, ``"_2"``, etc.).
zh_hans: 我们通过更改生成文件名的算法来解决了这个问题，如果已经存在具有上传名称的文件，那么 :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` 现在会附加一个下划线和一个随机的 7 位字母数字字符串（例如 ``"_x3a1gho"``），而不是通过迭代下划线后面跟着一个数字（例如 ``"_1"``，``"_2"`` 等）。

source: ``RemoteUserMiddleware`` session hijacking
id: Pembajakan sesi ``RemoteUserMiddleware``
zh_hans: ``RemoteUserMiddleware`` 会话劫持

source: When using the :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` and the ``RemoteUserBackend``, a change to the ``REMOTE_USER`` header between requests without an intervening logout could result in the prior user's session being co-opted by the subsequent user. The middleware now logs the user out on a failed login attempt.
id: Ketika menggunakan :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` dan ``RemoteUserBackend``, sebuah perubahan pada kepala ``REMOTE_USER`` diantara permintaan tanpa campur tangan keluar dapat dihasilkan sebelum sesi pengguna sedang ditunjuk oleh pengguna kemudian. Middleware sekarang mencatat pengguna keluar pada usaha masuk gagal.
zh_hans: 在使用 :class:`~django.contrib.auth.middleware.RemoteUserMiddleware` 和 ``RemoteUserBackend`` 时，在没有中断注销的情况下，在请求之间更改 ``REMOTE_USER`` 标头可能会导致后续用户接管之前用户的会话。现在，在登录尝试失败时，中间件会注销用户。

source: Data leakage via query string manipulation in ``contrib.admin``
id: Kebocoran data melalui permintaan pengubahan deretan krakter di ``contrib.admin``
zh_hans: 通过查询字符串操纵在 ``contrib.admin`` 中的数据泄露

source: In older versions of Django it was possible to reveal any field's data by modifying the "popup" and "to_field" parameters of the query string on an admin change form page. For example, requesting a URL like ``/admin/auth/user/?pop=1&t=password`` and viewing the page's HTML allowed viewing the password hash of each user. While the admin requires users to have permissions to view the change form pages in the first place, this could leak data if you rely on users having access to view only certain fields on a model.
id: Di versi terlama dari Django dia memungkinkan untuk mengungkapkan tiap data bidang dengan merubah parameter "popup" dan "to_field" dari permintaan deretan karakter pada halaman formulir perubahan admin. Sebagai contoh, meminta URL seperti ``/admin/auth/user/?pop=1&t=password`` dan melihat halaman HTML diizinkan melihat acakan sandi dari tiap pengguna. Selagi admin membutuhkan pengguna untuk memiliki perizinan untuk melihat halaman formulir perubahan di tempat pertama, ini dapat menyebabkan data bocor jika anda bergantung pada pengguna mempunyai akses untuk melihat hanya bidang tertentu pada model.
zh_hans: 在旧版本的 Django 中，通过修改查询字符串上的 "popup" 和 "to_field" 参数，可以揭示任何字段的数据。例如，请求像 ``/admin/auth/user/?pop=1&t=password`` 这样的 URL 并查看页面的 HTML 允许查看每个用户的密码哈希。尽管管理员要求用户首先具有查看更改表单页面的权限，但如果你依赖于用户只能访问模型上的特定字段，这可能会泄漏数据。

source: To address the issue, an exception will now be raised if a ``to_field`` value that isn't a related field to a model that has been registered with the admin is specified.
id: Untuk mengalamatkan masalah, sebuah pengecualian sekarang akan dimunculkan jika sebuah nilai ``to_field`` yang tidak terkait bidang ke model yang telah didaftarkan dengan admin telah ditentukan.
zh_hans: 为了解决这个问题，现在如果指定了一个不是与已在管理员中注册的模型相关的字段的 ``to_field`` 值，将引发异常。

source: Django 1.4.15 release notes
id: Catatan terbitan Django 1.4.15
zh_hans: Django 1.4.15 版本发行说明

source: *September 2, 2014*
zh_hans: *2014 年 9 月 2 日*

source: Django 1.4.15 fixes a regression in the 1.4.14 security release.
id: Django 1.4.15 memperbaiki sebuah pemulihan di terbitan keamanan 1.4.14.
zh_hans: Django 1.4.15 修复了 1.4.14 安全发布中的一个回归问题。

source: Allowed inherited and m2m fields to be referenced in the admin (:ticket:`22486`)
id: Diizinkan bidang mewarisi dan m2m untuk diacukan di admin (:ticket:`22486`)
zh_hans: 允许引用继承和多对多字段在管理员中 (:ticket:`22486`)。

source: Django 1.4.16 release notes
id: Catatan terbitan Django 1.4.16
zh_hans: Django 1.4.16 版本发行说明

source: *October 22, 2014*
id: *Oktober 22, 2014*
zh_hans: *2014 年 10 月 22日*

source: Django 1.4.16 fixes a couple regressions in the 1.4.14 security release and a bug preventing the use of some GEOS versions with GeoDjango.
id: Django 1.4.16 memperbaiki sepasang pemulihan di terbitan keamanan 1.4.14 dan sebuah kesalahan mencegah penggunaan dari beberapa versi GEOS dengan GeoDjango.
zh_hans: Django 1.4.16 修复了 1.4.14 安全版本中的一些回归问题，以及阻止使用某些 GEOS 版本与 GeoDjango 一起使用的错误。

source: Allowed related many-to-many fields to be referenced in the admin (:ticket:`23604`).
id: Diizinkan bidang many-to-many terkait untuk diacukan di admin (:ticket:`23604`).
zh_hans: 允许引用相关的多对多字段在管理员中 (:ticket:`23604`)。

source: Allowed inline and hidden references to admin fields (:ticket:`23431`).
id: Diizinkan acuan berderet dan acuan tersembunyi pada bidang admin (:ticket:`23431`).
zh_hans: 允许内联和隐藏引用管理员字段 (:ticket:`23431`)。

source: Fixed parsing of the GEOS version string (:ticket:`20036`).
id: Diperbaiki mengurai dari deretan karakter versi GEOS (:ticket:`20036`).
zh_hans: 修复了 GEOS 版本字符串的解析问题 (:ticket:`20036`)。

source: Django 1.4.17 release notes
id: Catatan terbitan Django 1.4.17
zh_hans: Django 1.4.17 版本发行说明

source: *January 2, 2015*
id: *2 Januari 2015*
zh_hans: *2015 年 1 月 2 日*

source: Django 1.4.17 fixes a regression in the 1.4.14 security release.
id: Django 1.4.17 memperbaiki sebuah pemulihan di terbitan keamanan 1.4.14.
zh_hans: Django 1.4.17 修复了 1.4.14 安全版本中的一个回归问题。

source: Additionally, Django's vendored version of six, ``django.utils.six``, has been upgraded to the latest release (1.9.0).
id: Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.9.0).
zh_hans: 此外，Django 内置的 six 版本，即 ``django.utils.six``，已经升级到最新版本 (1.9.0)。

source: Fixed a regression with dynamically generated inlines and allowed field references in the admin (:ticket:`23754`).
id: Diperbaiki sebuah pemulihan dengan secara dinamis dibangkitkan berderet dan bidang diizinkan mengacu di admin (:ticket:`23754`).
zh_hans: 修复了动态生成的内联和允许在管理员中引用字段的回归问题 (:ticket:`23754`)。

source: Django 1.4.18 release notes
id: Catatan terbitan Django 1.4.18
zh_hans: Django 1.4.18 版本发行说明

source: *January 13, 2015*
id: *13 Januari 2015*
zh_hans: *2015 年 1 月 13 日*

source: Django 1.4.18 fixes several security issues in 1.4.17 as well as a regression on Python 2.5 in the 1.4.17 release.
id: Django 1.4.18 memperbaiki beberapa masalah keamanan di 1.4.17 maupun pemulihan pada Python 2.5 di terbitan 1.4.17.
zh_hans: Django 1.4.18 修复了 1.4.17 中的几个安全问题，以及 1.4.17 版本中出现的 Python 2.5 的回归问题。

source: WSGI header spoofing via underscore/dash conflation
id: Kepala WSGI menipu melalui garis bawah atau penggabungan tanda garis
zh_hans: 通过下划线/破折号混淆进行 WSGI 头欺骗

source: When HTTP headers are placed into the WSGI environ, they are normalized by converting to uppercase, converting all dashes to underscores, and prepending ``HTTP_``. For instance, a header ``X-Auth-User`` would become ``HTTP_X_AUTH_USER`` in the WSGI environ (and thus also in Django's ``request.META`` dictionary).
zh_hans: 当将 HTTP 头放入 WSGI 环境时，它们会被规范化，即转换为大写，将所有破折号转换为下划线，并在前面添加 ``HTTP_``。例如，一个名为 ``X-Auth-User`` 的头部在 WSGI 环境中会变成 ``HTTP_X_AUTH_USER`` （因此也会出现在 Django 的 ``request.META`` 字典中）。

source: Unfortunately, this means that the WSGI environ cannot distinguish between headers containing dashes and headers containing underscores: ``X-Auth-User`` and ``X-Auth_User`` both become ``HTTP_X_AUTH_USER``. This means that if a header is used in a security-sensitive way (for instance, passing authentication information along from a front-end proxy), even if the proxy carefully strips any incoming value for ``X-Auth-User``, an attacker may be able to provide an ``X-Auth_User`` header (with underscore) and bypass this protection.
id: Sayangnya, ini berarti bahwa kepungan WSGI tidak dapat membedakan diantara kepala mengandung tanda garis dan kepala mengandung garis bawah: ``X-Auth-User`` dan ``X-Auth_User`` keduanya menjadi ``HTTP_X_AUTH_USER``. Ini berarti bahwa jika kepala digunakan dalam cara sensitif-keamanan (sebagai contoh, melewatkan informasi otentifikasi bersama dari proxy paling-depan), bahkan jika proxy secara hati-hati melucuti nilai apapun yang datang untuk ``X-Auth-User``, seorang penyerang mungkin dapat menyediakan kepala ``X-Auth_User`` (dengan garis bawah) dan melewatkan perlindungan ini.
zh_hans: 不幸的是，这意味着 WSGI 环境无法区分包含破折号和包含下划线的头部：``X-Auth-User`` 和 ``X-Auth_User`` 都会变成 ``HTTP_X_AUTH_USER``。这意味着如果一个头部以安全敏感的方式使用（例如，从前端代理传递身份验证信息），即使代理仔细删除了 ``X-Auth-User`` 的任何传入值，攻击者仍然可以提供一个带下划线的 ``X-Auth_User`` 头部，并绕过这种保护。

source: In order to prevent such attacks, both Nginx and Apache 2.4+ strip all headers containing underscores from incoming requests by default. Django's built-in development server now does the same. Django's development server is not recommended for production use, but matching the behavior of common production servers reduces the surface area for behavior changes during deployment.
id: Untuk mencegah serangan seperti itu, kedua Nginx dan Apache 2.4+ melucuti semua kepala mengandung garis bawah dari permintaan yang datang secara awalan. Peladen pengembangan siap-pakai Django sekarang melakukan hal sama. Peladen pengembangan Django tidak dianjurkan untuk penggunaan produksi, tetapi mencocokkan perilaku dari produksi umum peladen mengurangi kawasan permukaan untuk perubahan perilaku selama penyebaran.
zh_hans: 为了防止此类攻击，Nginx 和 Apache 2.4+ 默认会从传入的请求中剥离包含下划线的所有标头。 Django 的内置开发服务器现在也采用相同的做法。不建议将 Django 的开发服务器用于生产环境，但匹配常见生产服务器的行为可以减少部署过程中行为变化的可能性。

source: Mitigated possible XSS attack via user-supplied redirect URLs
id: Mengurangi kemungkinan serangan XSS melalui mengalihkan URL penyediaan-pengguna
zh_hans: 通过用户提供的重定向 URL 减轻了可能的 XSS 攻击风险。

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()`` and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security checks for these redirects (namely ``django.utils.http.is_safe_url()``) didn't strip leading whitespace on the tested URL and as such considered URLs like ``\njavascript:...`` safe. If a developer relied on ``is_safe_url()`` to provide safe redirect targets and put such a URL into a link, they could suffer from a XSS attack. This bug doesn't affect Django currently, since we only put this URL into the ``Location`` response header and browsers seem to ignore JavaScript there.
zh_hans: 在某些情况下，Django 依赖于用户输入（例如 ``django.contrib.auth.views.login()`` 和 :doc:`i18n </topics/i18n/index>`）来将用户重定向到“成功”URL。这些重定向的安全性检查（即 ``django.utils.http.is_safe_url()``）未删除在测试的 URL 上的前导空格，因此将类似于 ``\njavascript:...`` 的 URL 视为安全的。如果开发人员依赖于 ``is_safe_url()`` 提供安全的重定向目标，并将这样的 URL 放入链接中，他们可能会受到 XSS 攻击的影响。目前这个错误不会影响 Django，因为我们只将这个 URL 放入 ``Location`` 响应头中，而浏览器似乎会忽略那里的 JavaScript。

source: Denial-of-service attack against ``django.views.static.serve``
id: Serangan denial-of-service terhadap ``django.views.static.serve``
zh_hans: 对 ``django.views.static.serve`` 的拒绝服务攻击

source: In older versions of Django, the :func:`django.views.static.serve` view read the files it served one line at a time. Therefore, a big file with no newlines would result in memory usage equal to the size of that file. An attacker could exploit this and launch a denial-of-service attack by simultaneously requesting many large files. This view now reads the file in chunks to prevent large memory usage.
id: Di versi terlama dari Django, tampilan :func:`django.views.static.serve` membaca berkas-berkas itu dilayani satu baris pada satu waktu. Karena itu, berkas besar dengan tidak ada baris baru akan menghasilkan penggunaan memori sama pada ukuran berkas itu. Seorang penyerang dapat memanfaatkan ini dan meluncurkan serangan denial-of-service dengan permintaan banyak berkas besar secara bersama. Tampilan ini sekarang membaca berkas dalam potongan untuk mencegah penggunaan memori besar.
zh_hans: 在旧版本的 Django 中，:func:`django.views.static.serve` 视图逐行读取它提供的文件。因此，一个没有换行符的大文件将导致内存使用量等于该文件的大小。攻击者可以利用这一点，通过同时请求许多大文件来发动拒绝服务攻击。现在，这个视图会按块读取文件，以防止大量内存使用。

source: Note, however, that this view has always carried a warning that it is not hardened for production use and should be used only as a development aid. Now may be a good time to audit your project and serve your files in production using a real front-end web server if you are not doing so.
id: Catat, bagaimanapun bahwa tampilan ini selalu membawa peringatan yang itu tidak mengeras untuk penggunaan produksi dan harus digunakan hanya sebagai bantuan pengembangan. Sekarang mungkin waktu bagus untuk memeriksa peoyek anda dan melayani berkas anda di penggunaan produksi menggunakan peladen jaringan paling-depan sebenarnya jika anda tidak melakukannya.
zh_hans: 然而，请注意，这个视图一直带有一个警告，即它没有经过生产环境的强化，只应作为开发辅助工具使用。如果您还没有这样做，现在可能是一个好时机来审计您的项目，并在生产环境中使用真正的前端 Web 服务器提供文件。

source: To maintain compatibility with Python 2.5, Django's vendored version of six, ``django.utils.six``, has been downgraded to 1.8.0 which is the last version to support Python 2.5.
id: Untuk merawat kesesuaian dengan Python 2.5, versi penjaja Django dari enam, ``django.utils.six``, telah diturunkan ke 1.8.0 yang merupakan versi terakhir untuk mendukung Python 2.5.
zh_hans: 为了保持与 Python 2.5 的兼容性，Django 内置的 six 版本，即 ``django.utils.six``，已经降级到 1.8.0，这是最后一个支持 Python 2.5 的版本。

source: Django 1.4.19 release notes
id: Catatan terbitan Django 1.4.19
zh_hans: Django 1.4.19 版本发行说明

source: *January 27, 2015*
id: *27 Januari 2015*
zh_hans: *2015 年 1 月 27 日*

source: Django 1.4.19 fixes a regression in the 1.4.18 security release.
id: Django 1.4.19 memperbaiki sebuah pemulihan di terbitan keamanan 1.4.18.
zh_hans: Django 1.4.19 修复了 1.4.18 安全版本中的一个回归问题。

source: ``GZipMiddleware`` now supports streaming responses. As part of the 1.4.18 security release, the ``django.views.static.serve()`` function was altered to stream the files it serves. Unfortunately, the ``GZipMiddleware`` consumed the stream prematurely and prevented files from being served properly (:ticket:`24158`).
id: ``GZipMiddleware`` sekarang mendukung aliran tanggapan. Sebagai bagian dari terbitan keamanan 1.4.18, fungsi ``django.views.static.serve()`` telah diubah untuk aliran berkas-berkas itu peladen. Sayangnya, ``GZipMiddleware`` mengkonsumsi aliran sebelum waktunya dan mencegah berkas-berkas dari menjadi dilayani secara benar (:ticket:`24158`).
zh_hans: ``GZipMiddleware`` 现在支持流式响应。作为 1.4.18 安全更新的一部分，``django.views.static.serve()`` 函数已经被修改为流式传输它提供的文件。不幸的是，``GZipMiddleware`` 过早地消耗了流，并阻止了文件的正确传输 (:ticket:`24158`)。

source: Django 1.4.2 release notes
id: Catatan terbitan Django 1.4.2
zh_hans: Django 1.4.2 版本发行说明

source: This is the second security release in the Django 1.4 series.
id: Ini adalah terbitan keamanan ke dua di rangkaian Django 1.4.
zh_hans: 这是 Django 1.4 系列中的第二个安全版本。

source: The newly introduced :class:`~django.db.models.GenericIPAddressField` constructor arguments have been adapted to match those of all other model fields. The first two keyword arguments are now verbose_name and name.
id: Baru diperkenalkan argumen pembangun :class:`~django.db.models.GenericIPAddressField` telah dipakai untuk mencocokkan dari semua bidang model lainnya. Argumen kata kunci kedua pertama sekarang verbose_name dan name.
zh_hans: 新引入的 :class:`~django.db.models.GenericIPAddressField` 构造函数参数已经适应了所有其他模型字段的参数。现在的前两个关键字参数是 verbose_name 和 name。

source: Other bugfixes and changes
id: Perbaikan kesalahan dan perubahan lain
zh_hans: 其他错误修复和更改

source: Subclass HTMLParser only for appropriate Python versions (#18239).
id: Subkelas HTMLParser hanya untuk versi Python yang sesuai (#18239).
zh_hans: 仅对适用的 Python 版本子类化 HTMLParser（ #18239 ）。

source: Added batch_size argument to qs.bulk_create() (#17788).
id: Ditambahkan argumen batch_size ke qs.bulk_create() (#17788).
zh_hans: 为 qs.bulk_create() 添加 batch_size 参数（ #17788 ）。

source: Fixed a small regression in the admin filters where wrongly formatted dates passed as url parameters caused an unhandled ValidationError (#18530).
id: Diperbaiki sebuah pemulihan kecil di saringan admin dimana tanggal berbentuk salah dilewatkan sebagai parameter url menyebabkan sebuah ValidationError tidak tertangani (#18530).
zh_hans: 修复了管理员筛选器中的一个小回归问题，其中错误格式的日期作为 URL 参数传递，导致未处理的 ValidationError（ #18530 ）。

source: Fixed an endless loop bug when accessing permissions in templates (#18979)
id: Diperbaiki sebuah kesalahan perulangan tidak berakhir ketika mengakses perizinan di cetakan (#18979)
zh_hans: 修复了在模板中访问权限时出现的无限循环错误（ #18979 ）

source: Fixed some Python 2.5 compatibility issues
id: Diperbaiki beberapa masalah kesesuaian Python 2.5
zh_hans: 修复了一些与 Python 2.5 兼容性有关的问题。

source: Fixed an issue with quoted filenames in Content-Disposition header (#19006)
id: Diperbaiki sebuah masalah dengan nama berkas dikutip di kepala Content-Disposition (#19006)
zh_hans: 修复了 Content-Disposition 标头中带引号文件名的问题（ #19006 ）。

source: Made the context option in ``trans`` and ``blocktrans`` tags accept literals wrapped in single quotes (#18881).
id: DIbuat pilihan konteks di etiket ``trans`` dan ``blocktrans`` menerima harfiah dibungkus dalam kutipan tunggal (#18881).
zh_hans: 使 ``trans`` 和 ``blocktrans`` 标签中的上下文选项接受用单引号包裹的字面值 (#18881)。

source: Numerous documentation improvements and fixes.
id: Banyak sekali dokumentasi perbaikan dan pembetulan
zh_hans: 大量文档改进和修复。

source: Django 1.4.20 release notes
id: Catatan terbitan Django 1.4.20
zh_hans: Django 1.4.20 版本发行说明

source: *March 18, 2015*
id: *18 Maret 2015*
zh_hans: *2015 年 3 月 18 日*

source: Django 1.4.20 fixes one security issue in 1.4.19.
id: Django 1.4.20 memperbaiki masalah keamanan di 1.4.19.
zh_hans: Django 1.4.20 修复了 1.4.19 中的一个安全问题。

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()`` and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security checks for these redirects (namely ``django.utils.http.is_safe_url()``) accepted URLs with leading control characters and so considered URLs like ``\x08javascript:...`` safe. This issue doesn't affect Django currently, since we only put this URL into the ``Location`` response header and browsers seem to ignore JavaScript there. Browsers we tested also treat URLs prefixed with control characters such as ``%08//example.com`` as relative paths so redirection to an unsafe target isn't a problem either.
zh_hans: Django 在某些情况下依赖于用户输入（例如 ``django.contrib.auth.views.login()`` 和 :doc:`i18n </topics/i18n/index>`）来将用户重定向到“成功”URL。这些重定向的安全性检查（即 ``django.utils.http.is_safe_url()``）接受具有前导控制字符的 URL，因此将像 ``\x08javascript:...`` 这样的 URL 视为安全。目前这个问题不会影响 Django，因为我们只将这个 URL 放入 ``Location`` 响应头中，而浏览器似乎会忽略那里的 JavaScript。经过我们测试的浏览器还会将以控制字符前缀的 URL，如 ``%08//example.com``，视为相对路径，因此重定向到不安全的目标也不是一个问题。

source: However, if a developer relies on ``is_safe_url()`` to provide safe redirect targets and puts such a URL into a link, they could suffer from an XSS attack as some browsers such as Google Chrome ignore control characters at the start of a URL in an anchor ``href``.
id: Bagaimanapun, jika seorang pengembang bergantung pada ``is_safe_url()`` untuk menyediakan ssaran pengalihan aman dan menaruh URL itu kedalam sebuah tautan, mereka dapat menderita dari sebuah serangan XSS ketika beberapa peramban seperti Google Chrome mengabaikan kendali karakter pada awal dari URL di sebuah jangkar ``href``.
zh_hans: 然而，如果开发人员依赖于 ``is_safe_url()`` 来提供安全的重定向目标，并将这样的 URL 放入链接中，他们可能会受到 XSS 攻击的影响，因为一些浏览器，如 Google Chrome，会忽略在锚点的 ``href`` 中 URL 开头的控制字符。

source: Django 1.4.21 release notes
id: Catatan terbitan Django 1.4.21
zh_hans: Django 1.4.21 版本发行说明

source: *July 8, 2015*
id: *8 Juli 2015*
zh_hans: *2015 年 7 月 8 日*

source: Django 1.4.21 fixes several security issues in 1.4.20.
id: Django 1.4.21 memperbaiki beberapa masalah keamanan di 1.4.20.
zh_hans: Django 1.4.21 修复了 1.4.20 中的若干安全问题。
