Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Added support for the :class:`~django.contrib.gis.db.models.MakeLine` aggregate and :class:`~django.contrib.gis.db.models.functions.GeoHash` function on SpatiaLite.
id: Ditambahkan dukungan untuk pengumpulan fungsi :class:`~django.contrib.gis.db.models.MakeLine` dan :class:`~django.contrib.gis.db.models.functions.GeoHash` pada SpatiaLite.
zh_hans: 在 SpatiaLite 上新增了对 :class:`~django.contrib.gis.db.models.MakeLine` 聚合和 :class:`~django.contrib.gis.db.models.functions.GeoHash` 函数的支持。

source: Added support for the :class:`~django.contrib.gis.db.models.functions.Difference`, :class:`~django.contrib.gis.db.models.functions.Intersection`, and :class:`~django.contrib.gis.db.models.functions.SymDifference` functions on MySQL.
id: Ditambahkan dukungan untuk fungsi :class:`~django.contrib.gis.db.models.functions.Difference`, :class:`~django.contrib.gis.db.models.functions.Intersection`, dan :class:`~django.contrib.gis.db.models.functions.SymDifference` pada MySQL.
zh_hans: 在 MySQL 上新增了对 :class:`~django.contrib.gis.db.models.functions.Difference`、:class:`~django.contrib.gis.db.models.functions.Intersection` 和 :class:`~django.contrib.gis.db.models.functions.SymDifference` 函数的支持。

source: Added support for instantiating empty GEOS geometries.
id: Ditambahkan dukungan untuk instantisi geometri GEOS kosong.
zh_hans: 新增支持实例化空的 GEOS 几何对象。

source: The new :attr:`~django.contrib.gis.geos.WKTWriter.trim` and :attr:`~django.contrib.gis.geos.WKTWriter.precision` properties of :class:`~django.contrib.gis.geos.WKTWriter` allow controlling output of the fractional part of the coordinates in WKT.
id: Harta :attr:`~django.contrib.gis.geos.WKTWriter.trim` dan :attr:`~django.contrib.gis.geos.WKTWriter.precision` baru dari :class:`~django.contrib.gis.geos.WKTWriter` mengizinkan mengendalikan keluaran dari bagian pecahan dari kordinat di WKT.
zh_hans: :class:`~django.contrib.gis.geos.WKTWriter` 的新属性 :attr:`~django.contrib.gis.geos.WKTWriter.trim` 和 :attr:`~django.contrib.gis.geos.WKTWriter.precision` 允许控制 WKT 中坐标的小数部分的输出。

source: Added the :attr:`LineString.closed <django.contrib.gis.geos.LineString.closed>` and :attr:`MultiLineString.closed <django.contrib.gis.geos.MultiLineString.closed>` properties.
id: Ditambahkan harta :attr:`LineString.closed <django.contrib.gis.geos.LineString.closed>` dan :attr:`MultiLineString.closed <django.contrib.gis.geos.MultiLineString.closed>`.
zh_hans: 新增了 :attr:`LineString.closed <django.contrib.gis.geos.LineString.closed>` 和 :attr:`MultiLineString.closed <django.contrib.gis.geos.MultiLineString.closed>` 属性。

source: The :doc:`GeoJSON serializer </ref/contrib/gis/serializers>` now outputs the primary key of objects in the ``properties`` dictionary if specific fields aren't specified.
id: :doc:`GeoJSON serializer </ref/contrib/gis/serializers>` sekarang mengeluarkan primary key dari obyek di kamus ``properties`` jika bidang tertentu tidak ditetapkan.
zh_hans: 如果没有指定特定字段， :doc:`GeoJSON 序列化程序 </ref/contrib/gis/serializers>` 现在会在 ``properties`` 字典中输出对象的主键。

source: The ability to replicate input data on the :meth:`GDALBand.data() <django.contrib.gis.gdal.GDALBand.data>` method was added. Band data can now be updated with repeated values efficiently.
id: Kemampuan melipat data masukan pada metode :meth:`GDALBand.data() <django.contrib.gis.gdal.GDALBand.data>` telah ditambahkan. Pita data sekarang dapat diperbaharui dengan nilai berulang secara efisien.
zh_hans: 现在可以在 :meth:`GDALBand.data() <django.contrib.gis.gdal.GDALBand.data>` 方法上复制输入数据。可以高效地使用重复的值更新带数据。

source: Added database functions :class:`~django.contrib.gis.db.models.functions.IsValid` and :class:`~django.contrib.gis.db.models.functions.MakeValid`, as well as the :lookup:`isvalid` lookup, all for PostGIS. This allows filtering and repairing invalid geometries on the database side.
id: Ditambahkan fungsi basisdata :class:`~django.contrib.gis.db.models.functions.IsValid` dan :class:`~django.contrib.gis.db.models.functions.MakeValid`, sama halnya seperti pencarian :lookup:`isvalid`, semua untuk PostGIS. Ini mengizinkan menyaring dan memperbaiki geometri tidak sah pada sisi basisdata.
zh_hans: 新增了数据库函数 :class:`~django.contrib.gis.db.models.functions.IsValid` 和 :class:`~django.contrib.gis.db.models.functions.MakeValid`，以及 :lookup:`isvalid` 查找，都用于 PostGIS。这允许在数据库端对无效的几何对象进行过滤和修复。

source: Added raster support for all :doc:`spatial lookups </ref/contrib/gis/geoquerysets>`.
id: Ditambahkan dukungan raster untuk semua :doc:`spatial lookups </ref/contrib/gis/geoquerysets>`.
zh_hans: 新增了所有 :doc:`空间查找 </ref/contrib/gis/geoquerysets>` 的栅格支持。

source: For convenience, :class:`~django.contrib.postgres.fields.HStoreField` now casts its keys and values to strings.
id: Untuk meyakinkan, :class:`~django.contrib.postgres.fields.HStoreField` sekarang memberikan kunci dan nilainya ke deretan karakter.
zh_hans: 为了方便起见，:class:`~django.contrib.postgres.fields.HStoreField` 现在将其键和值转换为字符串。

source: The :djadmin:`clearsessions` management command now removes file-based sessions.
id: Perintah pengelolaan :djadmin:`clearsessions` sekarang memindahkan sesi berdasarkan-berkas.
zh_hans: :djadmin:`clearsessions` 管理命令现在会删除基于文件的会话。

source: The :class:`~django.contrib.sites.models.Site` model now supports :ref:`natural keys <topics-serialization-natural-keys>`.
id: Model :class:`~django.contrib.sites.models.Site` sekarang mendukung :ref:`natural keys <topics-serialization-natural-keys>`.
zh_hans: :class:`~django.contrib.sites.models.Site` 模型现在支持 :ref:`自然键 <topics-serialization-natural-keys>`。

source: The :ttag:`static` template tag now uses ``django.contrib.staticfiles`` if it's in ``INSTALLED_APPS``. This is especially useful for third-party apps which can now always use ``{% load static %}`` (instead of ``{% load staticfiles %}`` or ``{% load static from staticfiles %}``) and not worry about whether or not the ``staticfiles`` app is installed.
id: Etiket cetakan :ttag:`static` sekarang menggunakan ``django.contrib.staticfiles`` jika itu didalam ``INSTALLED_APPS``. Ini khususnya berguna untuk aplikasi pihak ketiga yang dapat sekarang selalu menggunakan ``{% load static %}`` (sebagai gantinya dari ``{% load staticfiles %}`` atau ``{% load static from staticfiles %}``) dan tidak khawatir tentang apakah atau tidak aplikasi ``staticfiles`` terpasang.
zh_hans: :ttag:`static` 模板标签现在如果在 ``INSTALLED_APPS`` 中，将使用 ``django.contrib.staticfiles``。这对于第三方应用程序特别有用，现在它们可以始终使用 ``{% load static %}``（而不是 ``{% load staticfiles %}`` 或 ``{% load static from staticfiles %}``），并且不必担心是否安装了 ``staticfiles`` 应用程序。

source: You can :ref:`more easily customize <customize-staticfiles-ignore-patterns>` the ``collectstatic --ignore`` option with a custom ``AppConfig``.
id: Anda dapat :ref:`more easily customize 1` pilihan ``collectstatic --ignore`` dengan ``AppConfig`` penyesuaian.
zh_hans: 您可以通过自定义 ``AppConfig`` 更容易地 :ref:`自定义 <customize-staticfiles-ignore-patterns>` ``collectstatic --ignore`` 选项。

source: Cache
id: Tembolok
zh_hans: 缓存

source: The file-based cache backend now uses the highest pickling protocol.
id: Backend tembolok berdasarkan-berkas sekarang menggunakan protokol pengasaman tertinggi.
zh_hans: 基于文件的缓存后端现在使用最高的 pickling 协议。

source: The default :setting:`CSRF_FAILURE_VIEW`, ``views.csrf.csrf_failure()`` now accepts an optional ``template_name`` parameter, defaulting to ``'403_csrf.html'``, to control the template used to render the page.
id: :setting:`CSRF_FAILURE_VIEW` awal, ``views.csrf.csrf_failure()`` sekarang menerima sebuah pilihan parameter ``template_name``, awal ke ``'403_csrf.html'``, untuk mengendalikan cetakan digunakan untuk membangun halaman.
zh_hans: 默认的 :setting:`CSRF_FAILURE_VIEW`，``views.csrf.csrf_failure()`` 现在接受一个可选的 ``template_name`` 参数，默认为 ``'403_csrf.html'``，用于控制渲染页面的模板。

source: To protect against `BREACH`_ attacks, the CSRF protection mechanism now changes the form token value on every request (while keeping an invariant secret which can be used to validate the different tokens).
id: Untuk melindungi terhadap serangan `BREACH`_, mekanisme perlindungan CSRF sekarang merubah nilai token formulir pada setiap permintaan (selagi menjaga sebuah rahasia tidak berubah yang dapat digunakan untuk mensahkan token berbeda).
zh_hans: 为了防止 `BREACH`_ 攻击，CSRF 保护机制现在会在每个请求中更改表单令牌的值（同时保持不变的秘密，可用于验证不同的令牌）。

source: Database backends
id: Backend basisdata
zh_hans: 数据库后端

source: Temporal data subtraction was unified on all backends.
id: Pengurangan data sementara telah digabungkan pada semua backend.
zh_hans: 临时数据减法在所有后端上得到了统一。

source: If the database supports it, backends can set ``DatabaseFeatures.can_return_ids_from_bulk_insert=True`` and implement ``DatabaseOperations.fetch_returned_insert_ids()`` to set primary keys on objects created using ``QuerySet.bulk_create()``.
id: Jika basisdata mendukungnya, backend dapat menyetel ``DatabaseFeatures.can_return_ids_from_bulk_insert=True`` dan menerapkan ``DatabaseOperations.fetch_returned_insert_ids()`` untuk menyetel primary key pada obyek dibuat menggunakan ``QuerySet.bulk_create()``.
zh_hans: 如果数据库支持，后端可以设置 ``DatabaseFeatures.can_return_ids_from_bulk_insert=True`` 并实现 ``DatabaseOperations.fetch_returned_insert_ids()``，以便在使用 ``QuerySet.bulk_create()`` 创建的对象上设置主键。

source: Added keyword arguments to the ``as_sql()`` methods of various expressions (``Func``, ``When``, ``Case``, and ``OrderBy``) to allow database backends to customize them without mutating ``self``, which isn't safe when using different database backends. See the ``arg_joiner`` and ``**extra_context`` parameters of :meth:`Func.as_sql() <django.db.models.Func.as_sql>` for an example.
id: Ditambahkan argumen kata kunci pada metode ``as_sql()`` dari beragam pernyataan (``Func``, ``When``, ``Case``, dan ``OrderBy``) untuk mengizinkan backend basisdata untuk menyesuaikan mereka tanpa mengubah ``self``, yang tidak aman menggunakan backend basisdata berbeda. Lihat parameter ``arg_joiner`` dan ``**extra_context`` dari :meth:`Func.as_sql() <django.db.models.Func.as_sql>` untuk sebuah contoh.
zh_hans: 为各种表达式（``Func``、``When``、``Case`` 和 ``OrderBy``）的 ``as_sql()`` 方法添加了关键字参数，允许数据库后端在不更改 ``self`` 的情况下自定义它们，这在使用不同的数据库后端时不安全。参见 :meth:`Func.as_sql() <django.db.models.Func.as_sql>` 的 ``arg_joiner`` 和 ``**extra_context`` 参数的示例。

source: File Storage
id: Penyimpanan Berkas
zh_hans: 文件存储

source: Storage backends now present a timezone-aware API with new methods :meth:`~django.core.files.storage.Storage.get_accessed_time`, :meth:`~django.core.files.storage.Storage.get_created_time`, and :meth:`~django.core.files.storage.Storage.get_modified_time`. They return a timezone-aware ``datetime`` if :setting:`USE_TZ` is ``True`` and a naive ``datetime`` in the local timezone otherwise.
id: Backend penyimpanan sekarang menghadirkan API sadar-zona waktu dengan metode baru :meth:`~django.core.files.storage.Storage.get_accessed_time`, :meth:`~django.core.files.storage.Storage.get_created_time`, dan :meth:`~django.core.files.storage.Storage.get_modified_time`. Mereka mengembalikan ``datetime`` waspada zona waktu jika :setting:`USE_TZ` adalah ``True`` dan ``datetime`` tidak dibuat-buat di zona waktu lokal jikalau tidak.
zh_hans: 存储后端现在提供一个时区感知的 API，具有新的方法 :meth:`~django.core.files.storage.Storage.get_accessed_time`、:meth:`~django.core.files.storage.Storage.get_created_time` 和 :meth:`~django.core.files.storage.Storage.get_modified_time`。如果 :setting:`USE_TZ` 为 ``True``，则它们返回一个时区感知的 ``datetime``，否则返回本地时区的非时区感知的 ``datetime``。

source: The new :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` method makes it easier to implement custom storages that don't use the ``os.path`` calls previously in :class:`~django.db.models.FileField`.
id: Metode :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` baru membuatnya semakin mudah untuk menerapkan penyimpanan penyesuaian yang tidak menggunakan ``os.path`` memanggil sebelumnya di :class:`~django.db.models.FileField`.
zh_hans: 新的 :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` 方法使得更容易实现不使用以前在 :class:`~django.db.models.FileField` 中的 ``os.path`` 调用的自定义存储。

source: Forms
id: Formulir
zh_hans: 表单

source: Form and widget ``Media`` is now served using :mod:`django.contrib.staticfiles` if installed.
id: Formulir dan widget ``Media`` sekarang dilayani menggunakan :mod:`django.contrib.staticfiles` jika terpasang.
zh_hans: 如果安装了 :mod:`django.contrib.staticfiles`，则现在会使用它来提供表单和小部件的 ``Media``。

source: The ``<input>`` tag rendered by :class:`~django.forms.CharField` now includes a ``minlength`` attribute if the field has a ``min_length``.
id: Etiket ``<input>`` dibangun oleh :class:`~django.forms.CharField` sekarang menyertakan atribut ``minlength`` jika bidang mempunyai ``min_length``.
zh_hans: 由 :class:`~django.forms.CharField` 渲染的 ``<input>`` 标签现在如果字段具有 ``min_length``，则会包含一个 ``minlength`` 属性。

source: Required form fields now have the ``required`` HTML attribute. Set the new :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` attribute to ``False`` to disable it. The ``required`` attribute isn't included on forms of formsets because the browser validation may not be correct when adding and deleting formsets.
id: Bidang formulir yang diwajibkan sekarang mempunyai atribut HTML ``required``. Setel atribut :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` baru menjadi ``False`` untuk meniadakannya. Atribut ``required`` tidak disertakan pada formulir dari formset karena pengesahan peramban mungkin tidak benar ketika menambahkan dan menghapus formset.
zh_hans: 现在，必填表单字段具有 ``required`` HTML 属性。将新的 :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` 属性设置为 ``False`` 可以禁用它。在表单集的表单上不包括 ``required`` 属性，因为在添加和删除表单集时，浏览器验证可能不正确。

source: Generic Views
id: Tampilan Umum
zh_hans: 通用视图

source: The :class:`~django.views.generic.base.View` class can now be imported from ``django.views``.
id: Kelas :class:`~django.views.generic.base.View` sekarang dapat diimpor dari ``django.views``.
zh_hans: :class:`~django.views.generic.base.View` 类现在可以从 ``django.views`` 中导入。

source: The :func:`~django.conf.urls.i18n.i18n_patterns` helper function can now be used in a root URLConf specified using :attr:`request.urlconf <django.http.HttpRequest.urlconf>`.
id: Fungsi pembantu :func:`~django.conf.urls.i18n.i18n_patterns` sekrang dapat digunakan di akar URLConf ditentukan menggunakan :attr:`request.urlconf <django.http.HttpRequest.urlconf>`.
zh_hans: :func:`~django.conf.urls.i18n.i18n_patterns` 辅助函数现在可以在使用 :attr:`request.urlconf <django.http.HttpRequest.urlconf>` 指定的根 URL 配置中使用。

source: By setting the new ``prefix_default_language`` parameter for :func:`~django.conf.urls.i18n.i18n_patterns` to ``False``, you can allow accessing the default language without a URL prefix.
id: Dengan menyetel parameter ``prefix_default_language`` baru untuk :func:`~django.conf.urls.i18n.i18n_patterns` menjadi ``False``, anda dapat mengizinkan mengakses bahasa awal tanpa awalan URL.
zh_hans: 通过将 :func:`~django.conf.urls.i18n.i18n_patterns` 的新参数 ``prefix_default_language`` 设置为 ``False``，您可以允许在没有 URL 前缀的情况下访问默认语言。

source: :func:`~django.views.i18n.set_language` now returns a 204 status code (No Content) for AJAX requests when there is no ``next`` parameter in ``POST`` or ``GET``.
id: :func:`~django.views.i18n.set_language` sekarang mengembalikan kode keadaan 204 (Tidak ada Isi) untuk permintaan AJAX ketika tidak ada parameter ``next`` di ``POST`` atau ``GET``.
zh_hans: 现在，当在 ``POST`` 或 ``GET`` 中没有 ``next`` 参数时，:func:`~django.views.i18n.set_language` 对于 AJAX 请求会返回 204 状态码（No Content）。

source: The :class:`~django.views.i18n.JavaScriptCatalog` and :class:`~django.views.i18n.JSONCatalog` class-based views supersede the deprecated ``javascript_catalog()`` and ``json_catalog()`` function-based views. The new views are almost equivalent to the old ones except that by default the new views collect all JavaScript strings in the ``djangojs`` translation domain from all installed apps rather than only the JavaScript strings from :setting:`LOCALE_PATHS`.
id: Tampilan berdasarkan kelas :class:`~django.views.i18n.JavaScriptCatalog` dan :class:`~django.views.i18n.JSONCatalog` menggantikan pengusangan tampilan berdasarkan fungsi ``javascript_catalog()`` dan ``json_catalog()``. Tampilan baru hampir sama ke yang lama kecuali itu oleh awal tampilan baru mengumpulkan semua deretan karakter JavaScript di ranag terjemahan ``djangojs`` dari semua aplikasi terpasang daripada hanya deretan karakter JavaScript dari :setting:`LOCALE_PATHS`.
zh_hans: :class:`~django.views.i18n.JavaScriptCatalog` 和 :class:`~django.views.i18n.JSONCatalog` 类视图取代了不推荐使用的 ``javascript_catalog()`` 和 ``json_catalog()`` 函数视图。新视图与旧视图几乎相同，唯一的区别是，默认情况下，新视图会从所有已安装的应用程序中收集 ``djangojs`` 翻译域中的所有 JavaScript 字符串，而不仅仅是来自 :setting:`LOCALE_PATHS` 的 JavaScript 字符串。

source: Management Commands
id: Pengelolaan perintah
zh_hans: 管理命令

source: :func:`~django.core.management.call_command` now returns the value returned from the ``command.handle()`` method.
id: :func:`~django.core.management.call_command` sekarang mengembalikan nilai dikembalikan dari metode ``command.handle()``.
zh_hans: 现在，:func:`~django.core.management.call_command` 会返回从 ``command.handle()`` 方法返回的值。

source: The new :option:`check --fail-level` option allows specifying the message level that will cause the command to exit with a non-zero status.
id: Pilihan :option:`check --fail-level` baru mengizinkan menentukan tingkatan pesan yang akan menyebabkan perintah keluar dengan keadaan bukan nol.
zh_hans: 新的 :option:`check --fail-level` 选项允许指定消息级别，该级别将导致命令以非零状态退出。

source: The new :option:`makemigrations --check` option makes the command exit with a non-zero status when model changes without migrations are detected.
id: Pilihan :option:`makemigrations --check` baru membuat perintah keluar dengan keadaan bukan nol ketika model berubah tanpa perpindahan dikenali.
zh_hans: 新的 :option:`makemigrations --check` 选项在检测到模型更改而没有迁移时，使命令以非零状态退出。

source: :djadmin:`makemigrations` now displays the path to the migration files that it generates.
id: :djadmin:`makemigrations` sekarang menampilkan jalur ke berkas perpindahan yang dia bangkitkan.
zh_hans: :djadmin:`makemigrations` 现在会显示生成的迁移文件的路径。

source: The :option:`shell --interface` option now accepts ``python`` to force use of the "plain" Python interpreter.
id: Pilihan :option:`shell --interface` sekarang menerima ``python`` untuk memaksa menggunakan penafsir Python ``plain``.
zh_hans: :option:`shell --interface` 选项现在接受 ``python``，以强制使用 "plain" Python 解释器。

source: The new :option:`shell --command` option lets you run a command as Django and exit, instead of opening the interactive shell.
id: Pilihan :option:`shell --command` baru membiarkan anda menjalankan perintah sebagai Django dan keluar, daripada membuka shell interaktif.
zh_hans: 新的 :option:`shell --command` 选项允许您以 Django 用户身份运行命令并退出，而不是打开交互式 shell。

source: Added a warning to :djadmin:`dumpdata` if a proxy model is specified (which results in no output) without its concrete parent.
id: Ditambahkan peringatan ke :djadmin:`dumpdata` jka model proxy ditentukan (yang menghasilkan tidak ada keluaran) tanpa wujud induknya.
zh_hans: 如果指定了代理模型（导致没有输出）而没有指定其具体的父模型，:djadmin:`dumpdata` 现在会显示警告。

source: The new :attr:`BaseCommand.requires_migrations_checks <django.core.management.BaseCommand.requires_migrations_checks>` attribute may be set to ``True`` if you want your command to print a warning, like :djadmin:`runserver` does, if the set of migrations on disk don't match the migrations in the database.
id: Atribut :attr:`BaseCommand.requires_migrations_checks <django.core.management.BaseCommand.requires_migrations_checks>` baru mungkin disetel menjadi ``True`` jika anda ingin perintah anda mencetak peringatan, seperti :djadmin:`runserver` lakukan, jika kumpulan dari perpindahan pada cakram tidak cocok perpindahan di basisdata.
zh_hans: 新的 :attr:`BaseCommand.requires_migrations_checks <django.core.management.BaseCommand.requires_migrations_checks>` 属性可以设置为 ``True``，如果您希望您的命令在磁盘上的迁移集与数据库中的迁移不匹配时打印警告，就像 :djadmin:`runserver` 一样。

source: To assist with testing, :func:`~django.core.management.call_command` now accepts a command object as the first argument.
id: Untuk memandu dengan percobaan, :func:`~django.core.management.call_command` sekarang menerima obyek perintah sebagai argumen pertama.
zh_hans: 为了辅助测试，:func:`~django.core.management.call_command` 现在接受一个命令对象作为第一个参数。

source: The :djadmin:`shell` command supports tab completion on systems using ``libedit``, e.g. macOS.
id: Perintah :djadmin:`shell` mendukung penyelesaian label pada sistem menggunakan ``libedit``, misalnya macOS.
zh_hans: :djadmin:`shell` 命令在使用 ``libedit`` 的系统上支持制表符自动完成，例如 macOS。

source: The :djadmin:`inspectdb` command lets you choose what tables should be inspected by specifying their names as arguments.
id: Perintah :djadmin:`inspectdb` membiarkan anda memilih tabel apa harus diperiksa dengan menentukan nama-nama mereka sebagai argumen.
zh_hans: :djadmin:`inspectdb` 命令允许您通过将表的名称指定为参数来选择应该进行检查的表。

source: Migrations
id: Perpindahan
zh_hans: 迁移

source: Added support for serialization of ``enum.Enum`` objects.
id: Ditambahkan dukungan untuk serialisasi dari obyek ``enum.Enum``.
zh_hans: 新增支持序列化 ``enum.Enum`` 对象。

source: Added the ``elidable`` argument to the :class:`~django.db.migrations.operations.RunSQL` and :class:`~django.db.migrations.operations.RunPython` operations to allow them to be removed when squashing migrations.
id: Ditambahkan argumen ``elidable`` pada tindakan :class:`~django.db.migrations.operations.RunSQL` dan :class:`~django.db.migrations.operations.RunPython` untuk mengizinkan mereka dipindahkan ketika melumat perpindahan.
zh_hans: 在 :class:`~django.db.migrations.operations.RunSQL` 和 :class:`~django.db.migrations.operations.RunPython` 操作中添加了 ``elidable`` 参数，以允许在压缩迁移时删除它们。

source: Added support for :ref:`non-atomic migrations <non-atomic-migrations>` by setting the ``atomic`` attribute on a ``Migration``.
id: Ditambahkan dukungan untuk :ref:`non-atomic migrations <non-atomic-migrations>` dengan mengatur atribut ``atomic`` pada ``Migration``.
zh_hans: 通过在 ``Migration`` 上设置 ``atomic`` 属性，添加了对 :ref:`非原子迁移 <non-atomic-migrations>` 的支持。

source: The ``migrate`` and ``makemigrations`` commands now :ref:`check for a consistent migration history <migration-history-consistency>`. If they find some unapplied dependencies of an applied migration, ``InconsistentMigrationHistory`` is raised.
id: Perintah ``migrate`` dan ``makemigrations`` sekarang :ref:`check for a consistent migration history <migration-history-consistency>`. Jika mereka menemukan beberapa ketergantungan yang tidak berlaku pada sebuah perpindahan yang dilakukan, ``InconsistentMigrationHistory`` muncul.
zh_hans: ``migrate`` 和 ``makemigrations`` 命令现在会 :ref:`检查一致的迁移历史 <migration-history-consistency>`。如果它们发现某些已应用的迁移存在未应用的依赖项，将会引发 ``InconsistentMigrationHistory`` 异常。

source: The :func:`~django.db.models.signals.pre_migrate` and :func:`~django.db.models.signals.post_migrate` signals now dispatch their migration ``plan`` and ``apps``.
id: Sinyal :func:`~django.db.models.signals.pre_migrate` dan :func:`~django.db.models.signals.post_migrate` sekarang mengirim perpindahan ``plan`` dan ``apps`` mereka.
zh_hans: :func:`~django.db.models.signals.pre_migrate` 和 :func:`~django.db.models.signals.post_migrate` 信号现在会分发它们的迁移 ``plan`` 和 ``apps``。
