Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``shell --plain`` option is deprecated in favor of ``-i python`` or ``--interface python``.
id: Pilihan ``shell --plain`` diusangkan dalam mendukung dari ``-i python`` atau ``--interface python``.
zh_hans: ``shell --plain`` 选项已被弃用，推荐使用 ``-i python`` 或 ``--interface python``。

source: Importing from the ``django.core.urlresolvers`` module is deprecated in favor of its new location, :mod:`django.urls`.
id: Mengimpor dari modul ``django.core.urlresolvers`` diusangkan dalam mendukung dari tempat barunya, :mod:`django.urls`.
zh_hans: 从 ``django.core.urlresolvers`` 模块导入已被弃用，推荐使用其新位置 :mod:`django.urls`。

source: The template ``Context.has_key()`` method is deprecated in favor of ``in``.
id: Metode ``Context.has_key()`` cetakan diusangkan dalam mendukung ``in``.
zh_hans: 模板中的 ``Context.has_key()`` 方法已被弃用，推荐使用 ``in``。

source: The private attribute ``virtual_fields`` of ``Model._meta`` is deprecated in favor of ``private_fields``.
id: Atribut pribadi ``virtual_fields`` dari ``Model._meta`` diusangkan dalam mendukung dari ``private_fields``.
zh_hans: ``Model._meta`` 的私有属性 ``virtual_fields`` 已被弃用，推荐使用 ``private_fields``。

source: The private keyword arguments ``virtual_only`` in ``Field.contribute_to_class()`` and ``virtual`` in ``Model._meta.add_field()`` are deprecated in favor of ``private_only`` and ``private``, respectively.
id: Argumen kata kunci pribadi ``virtual_only`` di ``Field.contribute_to_class()`` dan ``virtual`` di ``Model._meta.add_field()`` diusangkan dalam mendukung dari ``private_only`` dan ``private``, masing-masing.
zh_hans: ``Field.contribute_to_class()`` 中的私有关键字参数 ``virtual_only`` 和 ``Model._meta.add_field()`` 中的 ``virtual`` 已被弃用，分别推荐使用 ``private_only`` 和 ``private``。

source: The ``javascript_catalog()`` and ``json_catalog()`` views are deprecated in favor of class-based views :class:`~django.views.i18n.JavaScriptCatalog` and :class:`~django.views.i18n.JSONCatalog`.
id: Tampilan ``javascript_catalog()`` dan ``json_catalog()`` diusangkan dalam mendukung dari tampilan berdasarkan-kelas :class:`~django.views.i18n.JavaScriptCatalog` dan :class:`~django.views.i18n.JSONCatalog`.
zh_hans: ``javascript_catalog()`` 和 ``json_catalog()`` 视图已被弃用，推荐使用基于类的视图 :class:`~django.views.i18n.JavaScriptCatalog` 和 :class:`~django.views.i18n.JSONCatalog`。

source: In multi-table inheritance, implicit promotion of a ``OneToOneField`` to a ``parent_link`` is deprecated. Add ``parent_link=True`` to such fields.
id: Di warisan banyak-tabel, promosi tersirat dari ``OneToOneField`` ke ``parent_link`` diusangkan. Tambah ``parent_link=True`` untuk bidang tersebut.
zh_hans: 在多表继承中，将一个 ``OneToOneField`` 隐式提升为 ``parent_link`` 已被弃用。应该在这些字段上添加 ``parent_link=True``。

source: The private API ``Widget._format_value()`` is made public and renamed to :meth:`~django.forms.Widget.format_value`. The old name will work through a deprecation period.
id: API pribadi ``Widget._format_value()`` dibuat umum dan dinamai kembali menjadi :meth:`~django.forms.Widget.format_value`. Nama lama akan bekerja sampai masa pengusangan.
zh_hans: 私有 API ``Widget._format_value()`` 已被公开，并重命名为 :meth:`~django.forms.Widget.format_value`。旧名称将在弃用期间继续工作。

source: Private ``FileField`` methods ``get_directory_name()`` and ``get_filename()`` are deprecated in favor of performing this work in :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>`).
id: Metode ``FileField`` pribadi ``get_directory_name()`` dan ``get_filename()`` diusangkan dalam mendukung dari penampilan pekerjaan ini di :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>`).
zh_hans: 私有的 ``FileField`` 方法 ``get_directory_name()`` 和 ``get_filename()`` 已被弃用，推荐在 :meth:`Storage.generate_filename() <django.core.files.storage.Storage.generate_filename>` 中执行这项工作。

source: Old-style middleware that uses ``settings.MIDDLEWARE_CLASSES`` are deprecated. :ref:`Adapt old, custom middleware <upgrading-middleware>` and use the new :setting:`MIDDLEWARE` setting.
id: Middleware gaya-lama yang menggunakan ``settings.MIDDLEWARE_CLASSES`` diusangkan. :ref:`Adapt old, custom middleware <upgrading-middleware>` dan menggunakan pengaturan :setting:`MIDDLEWARE` baru.
zh_hans: 使用 ``settings.MIDDLEWARE_CLASSES`` 的旧式中间件已被弃用。请 :ref:`适应旧的自定义中间件 <upgrading-middleware>` 并使用新的 :setting:`MIDDLEWARE` 设置。

source: Features removed in 1.10
id: Fitur-fitur dipindahkan di 1.10
zh_hans: 在 1.10 中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 1.10. See :ref:`deprecated-features-1.8` for details, including how to remove usage of these features.
id: Fitur-fitur ini telah mencapai akhir dari siklus pengusangannya dan dipindahkan di Django 1.10. Lihat :ref:`deprecated-features-1.8` untuk rincian, termasuk bagaimana memindahkan penggunaan dari fitur-fitur ini.
zh_hans: 这些功能已经完成了弃用周期，并在 Django 1.10 中被移除。有关详细信息，包括如何移除这些功能的用法，请参阅 :ref:`deprecated-features-1.8`。

source: Support for calling a ``SQLCompiler`` directly as an alias for calling its ``quote_name_unless_alias`` method is removed.
id: Dukungan untuk memanggil ``SQLCompiler`` secara langsung sebagai sebuah nama lain untuk memanggil metode ``quote_name_unless_alias`` nya dipindahkan.
zh_hans: 不再支持直接调用 ``SQLCompiler`` 作为调用其 ``quote_name_unless_alias`` 方法的别名。

source: The ``cycle`` and ``firstof`` template tags are removed from the ``future`` template tag library.
id: Etiket cetakan ``cycle`` dan ``firstof`` dipindahkan dari pustaka etiket cetakan ``future``.
zh_hans: ``cycle`` 和 ``firstof`` 模板标签已从 ``future`` 模板标签库中移除。

source: ``django.conf.urls.patterns()`` is removed.
id: ``django.conf.urls.patterns()`` dipindahkan.
zh_hans: ``django.conf.urls.patterns()`` 已被移除。

source: Support for the ``prefix`` argument to ``django.conf.urls.i18n.i18n_patterns()`` is removed.
id: Dukungan untuk argumen ``prefix`` pada ``django.conf.urls.i18n.i18n_patterns()`` dipindahkan.
zh_hans: 不再支持 ``prefix`` 参数用于 ``django.conf.urls.i18n.i18n_patterns()``。

source: ``SimpleTestCase.urls`` is removed.
id: ``SimpleTestCase.urls`` dipindahkan.
zh_hans: ``SimpleTestCase.urls`` 已被移除。

source: Using an incorrect count of unpacked values in the ``for`` template tag raises an exception rather than failing silently.
id: Menggunakan perhitungan salah dari nilai dibuka di etiket cetakan ``for`` memunculkan sebuah pengecualian daripada gagal diam-diam.
zh_hans: 在模板标签 ``for`` 中使用不正确数量的解包值将引发异常，而不是默默失败。

source: The ability to :func:`~django.urls.reverse` URLs using a dotted Python path is removed.
id: Kemampuan untuk :func:`~django.urls.reverse` URL menggunakan jalur Python bertitik dipindahkan.
zh_hans: 使用点分隔的 Python 路径反向 :func:`~django.urls.reverse` URL 的能力已被移除。

source: The ability to use a dotted Python path for the ``LOGIN_URL`` and ``LOGIN_REDIRECT_URL`` settings is removed.
id: Kemampuan menggunakan jalur Python bertitik untuk pengaturan ``LOGIN_URL`` dan ``LOGIN_REDIRECT_URL`` dipindahkan.
zh_hans: 使用点分隔的 Python 路径设置 ``LOGIN_URL`` 和 ``LOGIN_REDIRECT_URL`` 的能力已被移除。

source: Support for ``optparse`` is dropped for custom management commands.
id: Dukungan untuk ``optparse`` dibuang untuk perintah pengelolaan penyesuaian.
zh_hans: 自定义管理命令不再支持 ``optparse``。

source: The class ``django.core.management.NoArgsCommand`` is removed.
id: Kelas ``django.core.management.NoArgsCommand`` dipindahkan.
zh_hans: 类 ``django.core.management.NoArgsCommand`` 已被移除。

source: ``django.core.context_processors`` module is removed.
id: Modul ``django.core.context_processors`` dipindahkan.
zh_hans: ``django.core.context_processors`` 模块已被移除。

source: ``django.db.models.sql.aggregates`` module is removed.
id: Modul ``django.db.models.sql.aggregates`` dipindahkan.
zh_hans: ``django.db.models.sql.aggregates`` 模块已被移除。

source: ``django.contrib.gis.db.models.sql.aggregates`` module is removed.
id: Modul ``django.contrib.gis.db.models.sql.aggregates`` dipindahkan.
zh_hans: ``django.contrib.gis.db.models.sql.aggregates`` 模块已被移除。

source: The following methods and properties of ``django.db.sql.query.Query`` are removed:
id: Metode dan milik berikut dari ``django.db.sql.query.Query`` dipindahkan:
zh_hans: 以下 ``django.db.sql.query.Query`` 的方法和属性已被移除：

source: Properties: ``aggregates`` and ``aggregate_select``
id: Milik: ``aggregates`` dan ``aggregate_select``
zh_hans: 属性：``aggregates`` 和 ``aggregate_select`` 将被移除。

source: Methods: ``add_aggregate``, ``set_aggregate_mask``, and ``append_aggregate_mask``.
id: Metode: ``add_aggregate``, ``set_aggregate_mask``, dan ``append_aggregate_mask``.
zh_hans: 方法：``add_aggregate``、``set_aggregate_mask`` 和 ``append_aggregate_mask`` 将被移除。

source: ``django.template.resolve_variable`` is removed.
id: ``django.template.resolve_variable`` dipindahkan.
zh_hans: ``django.template.resolve_variable`` 已被移除。

source: The following private APIs are removed from :class:`django.db.models.options.Options` (``Model._meta``):
id: API pribadi berikut dipindahkan dari :class:`django.db.models.options.Options` (``Model._meta``):
zh_hans: 以下私有 API 已从 :class:`django.db.models.options.Options` （``Model._meta``）中移除：

source: The ``error_message`` argument of ``django.forms.RegexField`` is removed.
id: Argumen ``error_message`` dari ``django.forms.RegexField`` dipindahkan.
zh_hans: ``django.forms.RegexField`` 的 ``error_message`` 参数已被移除。

source: The ``unordered_list`` filter no longer supports old style lists.
id: Penyaring ``unordered_list`` tidak mendukung lagi daftar gaya lama.
zh_hans: ``unordered_list`` 过滤器不再支持旧式列表。

source: Support for string ``view`` arguments to ``url()`` is removed.
id: Dukungan untuk deretan karakter argumen ``view`` pada ``url()`` dipindahkan.
zh_hans: 不再支持将字符串 ``view`` 参数传递给 ``url()``。

source: The backward compatible shim to rename ``django.forms.Form._has_changed()`` to ``has_changed()`` is removed.
id: Shim kesesuaian kebelakang untuk menamai kembali ``django.forms.Form._has_changed()`` pada ``has_changed()`` dipindahkan.
zh_hans: 将 ``django.forms.Form._has_changed()`` 重命名为 ``has_changed()`` 的向后兼容性修补程序已被移除。

source: The ``removetags`` template filter is removed.
id: Penyaring cetakan ``removetags`` dipindahkan.
zh_hans: ``removetags`` 模板过滤器已被移除。

source: The ``remove_tags()`` and ``strip_entities()`` functions in ``django.utils.html`` is removed.
id: Fungsi ``remove_tags()`` dan ``strip_entities()`` di ``django.utils.html`` dipindahkan.
zh_hans: ``django.utils.html`` 中的 ``remove_tags()`` 和 ``strip_entities()`` 函数已被移除。

source: The ``is_admin_site`` argument to ``django.contrib.auth.views.password_reset()`` is removed.
id: Argumen ``is_admin_site`` pada ``django.contrib.auth.views.password_reset()`` dipindahkan.
zh_hans: ``django.contrib.auth.views.password_reset()`` 中的 ``is_admin_site`` 参数已被移除。

source: ``django.db.models.field.subclassing.SubfieldBase`` is removed.
id: ``django.db.models.field.subclassing.SubfieldBase`` dipindahkan.
zh_hans: ``django.db.models.field.subclassing.SubfieldBase`` 已被移除。

source: ``django.utils.checksums`` is removed.
id: ``django.utils.checksums`` dipindahkan.
zh_hans: ``django.utils.checksums`` 已被移除。

source: The ``original_content_type_id`` attribute on ``django.contrib.admin.helpers.InlineAdminForm`` is removed.
id: Atribut ``original_content_type_id`` pada ``django.contrib.admin.helpers.InlineAdminForm`` dipindahkan.
zh_hans: ``django.contrib.admin.helpers.InlineAdminForm`` 上的 ``original_content_type_id`` 属性已被移除。

source: The backwards compatibility shim to allow ``FormMixin.get_form()`` to be defined with no default value for its ``form_class`` argument is removed.
id: Shim kesesuaian kebelakang mengizinkan ``FormMixin.get_form()`` untuk ditentukan dengan nilai tidak ada awalan untuk argumen ``form_class`` nya dipindahkan.
zh_hans: 允许不为其 ``form_class`` 参数定义默认值的 ``FormMixin.get_form()`` 的向后兼容性修复已被移除。

source: The following settings are removed, and you must upgrade to the :setting:`TEMPLATES` setting:
id: Pengaturan berikut telah dihapus, anda harus ubah menjadi pengaturan :setting:`TEMPLATES`:
zh_hans: 以下设置已被移除，您必须升级到 :setting:`TEMPLATES` 设置：

source: The backwards compatibility alias ``django.template.loader.BaseLoader`` is removed.
id: Nama lain kesesuaian kebelakang ``django.template.loader.BaseLoader`` dipindahkan.
zh_hans: 向后兼容的别名 ``django.template.loader.BaseLoader`` 已被移除。

source: Django template objects returned by :func:`~django.template.loader.get_template` and :func:`~django.template.loader.select_template` no longer accept a :class:`~django.template.Context` in their :meth:`~django.template.backends.base.Template.render()` method.
id: Obyek cetakan Django dikembalikan oleh :func:`~django.template.loader.get_template` dan :func:`~django.template.loader.select_template` tidak lagi menerima sebuah :class:`~django.template.Context` di metode :meth:`~django.template.backends.base.Template.render()` mereka.
zh_hans: 由 :func:`~django.template.loader.get_template` 和 :func:`~django.template.loader.select_template` 返回的 Django 模板对象不再在其 :meth:`~django.template.backends.base.Template.render()` 方法中接受 :class:`~django.template.Context`。

source: :doc:`Template response APIs </ref/template-response>` enforce the use of :class:`dict` and backend-dependent template objects instead of :class:`~django.template.Context` and :class:`~django.template.Template` respectively.
id: :doc:`Template response APIs </ref/template-response>` memaksa penggunaan dari :class:`dict` dan obyek cetakan tergantung-backend daripada masing-masing :class:`~django.template.Context` dan :class:`~django.template.Template`.
zh_hans: :doc:`Template response APIs </ref/template-response>` 强制使用 :class:`dict` 和依赖后端的模板对象，而不再使用 :class:`~django.template.Context` 和 :class:`~django.template.Template`。

source: The ``current_app`` parameter for the following function and classes is removed:
id: Parameter ``current_app`` untuk fungsi dan kelas-kelas berikut dipindahkan:
zh_hans: 以下函数和类的 ``current_app`` 参数已被移除：

source: The ``dictionary`` and ``context_instance`` parameters for the following functions are removed:
id: Parameter ``dictionary`` dan ``context_instance`` untuk fungsi berikut dipindahkan:
zh_hans: 以下函数的 ``dictionary`` 和 ``context_instance`` 参数已被移除：

source: The ``dirs`` parameter for the following functions is removed:
id: Parameter ``dirs`` untuk fungsi berikut dipindahkan:
zh_hans: 以下函数的 ``dirs`` 参数已被移除：

source: Session verification is enabled regardless of whether or not ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` is in ``MIDDLEWARE_CLASSES``. ``SessionAuthenticationMiddleware`` no longer has any purpose and can be removed from ``MIDDLEWARE_CLASSES``. It's kept as a stub until Django 2.0 as a courtesy for users who don't read this note.
id: Pengecekan sesi diadakan tanpa memperhatikan apakah atau tidak ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'`` di ``MIDDLEWARE_CLASSES``. ``SessionAuthenticationMiddleware`` tidak lagi mempunyai tujuan apapun dan dapat dipindahkan dari ``MIDDLEWARE_CLASSES``. Itu dijaga sebagai potongan sampai Django 2.0 sebagai basa-basi untuk pengguna yang tidak membaca catatan ini.
zh_hans: 会话验证现在已启用，无论是否在 ``MIDDLEWARE_CLASSES`` 中包含 ``'django.contrib.auth.middleware.SessionAuthenticationMiddleware'``。``SessionAuthenticationMiddleware`` 不再有任何用途，可以从 ``MIDDLEWARE_CLASSES`` 中删除。为了方便那些没有阅读此说明的用户，它被保留为一个存根，直到 Django 2.0。

source: Private attribute ``django.db.models.Field.related`` is removed.
id: Atribut pribadi ``django.db.models.Field.related`` dipindahkan.
zh_hans: 私有属性 ``django.db.models.Field.related`` 已被移除。

source: The ``--list`` option of the ``migrate`` management command is removed.
id: Pilihan ``--list`` dari perintah pengelolaan ``migrate`` dipindahkan.
zh_hans: ``migrate`` 管理命令的 ``--list`` 选项已被移除。

source: The ``ssi`` template tag is removed.
id: Etiket cetakan ``ssi`` dipindahkan.
zh_hans: ``ssi`` 模板标签已被移除。

source: Support for the ``=`` comparison operator in the ``if`` template tag is removed.
id: Mendukung untuk penghubung perbandingan ``=`` di etiket cetakan ``if`` dipindahkan.
zh_hans: 不再支持 ``if`` 模板标签中的 ``=`` 比较运算符。

source: The backwards compatibility shims to allow ``Storage.get_available_name()`` and ``Storage.save()`` to be defined without a ``max_length`` argument are removed.
id: Shim kesesuaian kebelakang mengizinkan ``Storage.get_available_name()`` dan ``Storage.save()`` untuk ditentukan tanpa sebuah argumen ``max_length`` dipindahkan.
zh_hans: 允许在不带 ``max_length`` 参数的情况下定义 ``Storage.get_available_name()`` 和 ``Storage.save()`` 的向后兼容性修复已被移除。

source: Support for the legacy ``%(<foo>)s`` syntax in ``ModelFormMixin.success_url`` is removed.
id: Dukungan untuk warisan sintaksis ``%(<foo>)s`` di ``ModelFormMixin.success_url`` dipindahkan.
zh_hans: 在 ``ModelFormMixin.success_url`` 中移除了对旧式 ``%(<foo>)s`` 语法的支持。

source: ``GeoQuerySet`` aggregate methods ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, and ``unionagg()`` are removed.
id: ``GeoQuerySet`` kumpulan metode ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, dan ``unionagg()`` dipindahkan.
zh_hans: 移除了``GeoQuerySet`` 聚合方法 ``collect()``, ``extent()``, ``extent3d()``, ``make_line()``, 和 ``unionagg()``。

source: The ability to specify ``ContentType.name`` when creating a content type instance is removed.
id: Kemampuan untuk menentukan ``ContentType.name`` ketika membuat instance jenis isi dipindahkan.
zh_hans: 在创建内容类型实例时不再支持指定 ``ContentType.name`` 的能力。

source: Support for the old signature of ``allow_migrate`` is removed.
id: Dukungan untuk tandatangan lama dari ``allow_migrate`` dipindahkan.
zh_hans: 不再支持旧的 ``allow_migrate`` 签名。

source: Support for the syntax of ``{% cycle %}`` that uses comma-separated arguments is removed.
id: Dukungan untuk sintaksis ``{% cycle %}`` yang menggunakan argumen dipisah-koma dipindahkan.
zh_hans: 移除了使用逗号分隔参数的 ``{% cycle %}`` 语法的支持。

source: The warning that :class:`~django.core.signing.Signer` issued when given an invalid separator is now a ``ValueError``.
id: Peringatan yang :class:`~django.core.signing.Signer` muncul ketika pemisah tidak sah yang diberikan sekarang menjadi sebuah pengecualian.
zh_hans: :class:`~django.core.signing.Signer` 在提供无效的分隔符时发出的警告现在是一个 ``ValueError``。

source: Django 1.10.1 release notes
id: Catatan terbitan Django 1.10.1
zh_hans: Django 1.10.1 版本发行说明

source: *September 1, 2016*
zh_hans: *2016 年 9 月 1 日*

source: Django 1.10.1 fixes several bugs in 1.10.
id: Django 1.10.1 memperbaiki beberapa kesalahan di 1.10.
zh_hans: Django 1.10.1 修复了 1.10 中的几个漏洞。

source: Bugfixes
id: Perbaikan kesalahan
zh_hans: 漏洞修复

source: Fixed a crash in MySQL connections where ``SELECT @@SQL_AUTO_IS_NULL`` doesn't return a result (:ticket:`26991`).
id: Diperbaiki sebuah kegagalan di hubungan MySQL dimana ``SELECT @@SQL_AUTO_IS_NULL`` tidak mengembalikan sebuah hasil (:ticket:`26991`).
zh_hans: 修复了 MySQL 连接中的一个崩溃问题，在该问题中 ``SELECT @@SQL_AUTO_IS_NULL`` 不返回结果 (:ticket:`26991`)。

source: Allowed ``User.is_authenticated`` and ``User.is_anonymous`` properties to be compared using ``==``, ``!=``, and ``|`` (:ticket:`26988`, :ticket:`27154`).
id: Diizinkan sifat ``User.is_authenticated`` dan ``User.is_anonymous`` untuk dibandingkan menggunakan ``==``, ``!=``, dan ``|`` (:ticket:`26988`, :ticket:`27154`).
zh_hans: 允许使用 ``==``、``!=`` 和 ``|`` 来比较 ``User.is_authenticated`` 和 ``User.is_anonymous`` 属性 (:ticket:`26988`, :ticket:`27154`)。

source: Removed the broken ``BaseCommand.usage()`` method which was for ``optparse`` support (:ticket:`27000`).
id: Dipindahkan metode ``BaseCommand.usage()`` rusak yang untuk dukungan ``optparse`` (:ticket:`27000`).
zh_hans: 移除了已损坏的 ``BaseCommand.usage()`` 方法，该方法用于 ``optparse`` 支持 (:ticket:`27000`)。

source: Fixed a checks framework crash with an empty ``Meta.default_permissions`` (:ticket:`26997`).
id: Diperbaiki sebuah pemeriksaan kegagalan kerangka kerja dengan sebuah ``Meta.default_permissions`` kosong (:ticket:`26997`).
zh_hans: 修复了一个检查框架在空的 ``Meta.default_permissions`` 时崩溃的问题 (:ticket:`26997`)。

source: Fixed a regression in the number of queries when using ``RadioSelect`` with a ``ModelChoiceField`` form field (:ticket:`27001`).
id: Diperbaiki sebuah pemulihan dalam angka dari permintaan ketika menggunakan ``RadioSelect`` dengan bidang formulir ``ModelChoiceField`` (:ticket:`27001`).
zh_hans: 修复了在使用 ``ModelChoiceField`` 表单字段时，使用 ``RadioSelect`` 时查询数量的回归问题 (:ticket:`27001`)。

source: Fixed a crash if ``request.META['CONTENT_LENGTH']`` is an empty string (:ticket:`27005`).
id: Diperbaiki sebuah kegagalan jika ``request.META['CONTENT_LENGTH']`` adalah deretan karakter kosong (:ticket:`27005`).
zh_hans: 如果 ``request.META['CONTENT_LENGTH']`` 是空字符串，修复了一个崩溃问题 (:ticket:`27005`)。

source: Fixed the ``isnull`` lookup on a ``ForeignKey`` with its ``to_field`` pointing to a ``CharField`` or pointing to a ``CharField`` defined with ``primary_key=True`` (:ticket:`26983`).
id: Diperbaiki pencarian ``isnull`` pada sebuah ``ForeignKey`` dengan ``to_field`` nya menunjuk ke sebuah ``CharField`` atau menunjuk ke sebuah ``CharField`` ditentukan dengan ``primary_key=True`` (:ticket:`26983`).
zh_hans: 修复了在 ``ForeignKey`` 上使用 ``isnull`` 查找，其中 ``to_field`` 指向一个 ``CharField`` 或指向一个使用 ``primary_key=True`` 定义的 ``CharField`` 时的问题 (:ticket:`26983`)。

source: Prevented the ``migrate`` command from raising ``InconsistentMigrationHistory`` in the presence of unapplied squashed migrations (:ticket:`27004`).
id: Dicegah perintah ``migrate`` dari memunculkan ``InconsistentMigrationHistory`` di kehadiran dari perpindahan lumatan tidak diberlakukan (:ticket:`27004`).
zh_hans: 在存在未应用的压缩迁移的情况下，防止 ``migrate`` 命令引发 ``InconsistentMigrationHistory`` 异常 (:ticket:`27004`)。

source: Fixed a regression in ``Client.force_login()`` which required specifying a ``backend`` rather than automatically using the first one if multiple backends are configured (:ticket:`27027`).
id: Diperbaiki sebuah pemulihan di ``Client.force_login()`` yang dibutuhkan menentukan sebuah ``backend`` daripada otomatis menggunakan satu yang pertama jika banyak backend dikonfigurasi (:ticket:`27027`).
zh_hans: 修复了 ``Client.force_login()`` 中的一个回归问题，该问题需要指定一个 ``backend``，而不是在配置了多个后端的情况下自动使用第一个后端 (:ticket:`27027`)。

source: Made ``QuerySet.bulk_create()`` properly initialize model instances on backends, such as PostgreSQL, that support returning the IDs of the created records so that many-to-many relationships can be used on the new objects (:ticket:`27026`).
id: Membuat ``QuerySet.bulk_create()`` secara benar menginisialisasi instance model pada backend, seperti PostgreSQL, yang mendukung mengembalikan ID dari rekaman dibuat sehingga hubungan many-to-many dapat digunakan pada obyek baru (:ticket:`27026`).
zh_hans: 在后端（例如 PostgreSQL）上使 ``QuerySet.bulk_create()`` 正确初始化模型实例，以便支持返回已创建记录的 ID，以便可以在新对象上使用多对多关系 (:ticket:`27026`)。

source: Fixed crash of ``django.views.static.serve()`` with ``show_indexes`` enabled (:ticket:`26973`).
id: Diperbaiki kegagalan dari ``django.views.static.serve()`` dengan ``show_indexes`` diadakan (:ticket:`26973`).
zh_hans: 修复了在启用 ``show_indexes`` 的情况下，``django.views.static.serve()`` 崩溃的问题 (:ticket:`26973`)。

source: Fixed ``ClearableFileInput`` to avoid the ``required`` HTML attribute when initial data exists (:ticket:`27037`).
id: Diperbaiki ``ClearableFileInput`` untuk menghindari atribut HTML ``required`` ketika data inisial ada (:ticket:`27037`).
zh_hans: 修复了 ``ClearableFileInput`` 在存在初始数据时避免生成 ``required`` HTML 属性的问题 (:ticket:`27037`)。

source: Fixed annotations with database functions when combined with lookups on PostGIS (:ticket:`27014`).
id: Diperbaiki keterangan dengan fungsi basisdata ketika dipadukan dengan pencarian pada PostGIS (:ticket:`27014`).
zh_hans: 修复了在与 PostGIS 结合使用时，带有数据库函数的注释问题 (:ticket:`27014`)。
