Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: A maliciously crafted URL to a Django site using the :func:`~django.views.static.serve` view could redirect to any other domain. The view no longer does any redirects as they don't provide any known, useful functionality.
id: URL yang dibuat berbahaya pada situs Django menggunakan tampilan :func:`~django.views.static.serve` dapat mengalihkan ke ranah lain. Tampilan tidak lagi melakukan pengalihan apapun ketika mereka tidak memberikan apapun yang diketahui, fungsionalitas berguna.
zh_hans: 一个恶意构建的 URL 到一个使用 :func:`~django.views.static.serve` 视图的 Django 站点可能会重定向到任何其他域。该视图不再进行任何重定向，因为它们不提供任何已知的有用功能。

source: Note, however, that this view has always carried a warning that it is not hardened for production use and should be used only as a development aid.
id: Catat, bagaimanapun bahwa tampilan ini selalu membawa peringatan yang itu tidak mengeras untuk penggunaan produksi dan harus digunakan hanya sebagai bantuan pengembangan.
zh_hans: 注意，然而，这个视图一直带有警告，即它没有经过生产环境的强化，只应作为开发辅助工具使用。

source: Made admin's ``RelatedFieldWidgetWrapper`` use the wrapped widget's ``value_omitted_from_data()`` method (:ticket:`27905`).
id: Dibuat ``RelatedFieldWidgetWrapper`` admin menggunakan dibungkus metode ``value_omitted_from_data()`` widget (:ticket:`27905`).
zh_hans: 使管理员的 ``RelatedFieldWidgetWrapper`` 使用被包装小部件的 ``value_omitted_from_data()`` 方法 (:ticket:`27905`)。

source: Fixed model form ``default`` fallback for ``SelectMultiple`` (:ticket:`27993`).
id: Diperbaiki fallback ``default`` formulir model untuk ``SelectMultiple`` (:ticket:`27993`).
zh_hans: 修复了模型表单中 ``SelectMultiple`` 的 ``default`` 回退 (:ticket:`27993`)。

source: Django 1.10.8 release notes
id: Catatan terbitan Django 1.10.8
zh_hans: Django 1.10.8 版本发行说明

source: *September 5, 2017*
id: *5 September 2017*
zh_hans: *2017 年 9 月 5 日*

source: Django 1.10.8 fixes a security issue in 1.10.7.
id: Django 1.10.8 memperbaiki masalah keamanan di 1..10.7.
zh_hans: Django 1.10.8 修复了 1.10.7 中的一个安全问题。

source: CVE-2017-12794: Possible XSS in traceback section of technical 500 debug page
id: CVE-2017-12794: Kemungkinan XSS dalam melacak kembali bagian dari halaman teknis mencari kesalahan 500
zh_hans: CVE-2017-12794 ：技术性 500 调试页面的追踪部分可能存在 XSS 漏洞

source: In older versions, HTML autoescaping was disabled in a portion of the template for the technical 500 debug page. Given the right circumstances, this allowed a cross-site scripting attack. This vulnerability shouldn't affect most production sites since you shouldn't run with ``DEBUG = True`` (which makes this page accessible) in your production settings.
id: Dalam versi terlama, pelolosan otomatis HTML ditiadakan dalam bagian dari cetakan untuk halaman teknis mencari kesalahan 500. Memberikan keadaan benar, ini mengizinkan serangan cross-site scripting. Kerentanan ini tidak harus mempengaruhi kebanyakan situs-situs produksi sejak anda tidak harus menjalankan dengan ``DEBUG = True``(yang membuat halaman ini dapat diakses) dalam pengaturan produksi anda.
zh_hans: 在旧版本中，在技术性的 500 调试页面模板的一部分中禁用了 HTML 自动转义。在正确的情况下，这可能导致跨站点脚本攻击。这个漏洞不应影响大多数生产站点，因为你不应该在生产设置中运行 ``DEBUG = True`` （这使得这个页面可访问）。

source: Django 1.11 release notes
id: Catatan terbitan Django 1.11
zh_hans: Django 1.11 版本发行说明

source: Welcome to Django 1.11!
id: Selamat datang di Django 1.11!
zh_hans: 欢迎来到 Django 1.11 版本！

source: These release notes cover the :ref:`new features <whats-new-1.11>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.11>` you'll want to be aware of when upgrading from Django 1.10 or older versions. We've :ref:`begun the deprecation process for some features <deprecated-features-1.11>`.
id: Catatan terbitan ini mencangkup :ref:`new features <whats-new-1.11>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.11>` anda akan ingin waspadai ketika meningkatkan dari Django 1.10 atau versi terlama. Kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.11>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.11>`，以及一些 :ref:`不兼容变更 <backwards-incompatible-1.11>`，当您从 Django 1.10 或更早版本升级时，您需要注意。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-1.11>`。

source: Django 1.11 is designated as a :term:`long-term support release <Long-term support release>`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 1.8, will end in April 2018.
zh_hans: Django 1.11 被指定为 :term:`长期支持版本 <Long-term support release>`。它将在发布后至少三年内接收安全更新。对于之前的 LTS 版本 Django 1.8，支持将于 2018 年 4 月结束。

source: Django 1.11 requires Python 2.7, 3.4, 3.5, 3.6, or 3.7 (as of 1.11.17). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 1.11 需要 Python 2.7、3.4、3.5、3.6 或 3.7（截止到 1.11.17 版本）。我们* *强烈建议** 并且只正式支持每个系列的最新版本。

source: The Django 1.11.x series is the last to support Python 2. The next major release, Django 2.0, will only support Python 3.4+.
id: Rangkaian Django 1.11.x adalah terakhir untuk mendukung Python 2. Terbitan utama selanjutnya, Django 2.0, hanya akan mendukung Python 3.4+.
zh_hans: Django 1.11.x 系列是支持 Python 2 的最后一个版本。下一个主要版本，Django 2.0，将仅支持 Python 3.4+。

source: Deprecating warnings are no longer loud by default
id: Peringatan pengusangan tidak lagi kencang secara awalan
zh_hans: 弃用警告默认不再大声发出

source: Unlike older versions of Django, Django's own deprecation warnings are no longer displayed by default. This is consistent with Python's default behavior.
id: Tidak seperti versi terlama dari Django, peringatan-peringatan pengusangan sendiri Django tidak lagi ditampilkan secara awalan. Ini tetap dengan perilaku awalan Python.
zh_hans: 与旧版本的 Django 不同，Django 自身的弃用警告默认不再显示。这与 Python 的默认行为一致。

source: This change allows third-party apps to support both Django 1.11 LTS and Django 1.8 LTS without having to add code to avoid deprecation warnings.
id: Perubahan ini mengizinkan aplikasi pihak-ketiga untuk mendukung kedua Django 1.11 LTS dan Django 1.8 LTS tanpa harus menghindari peringatan-peringatan pengusangan.
zh_hans: 此更改允许第三方应用在不添加用于避免弃用警告的代码的情况下同时支持 Django 1.11 LTS 和 Django 1.8 LTS 。

source: Following the release of Django 2.0, we suggest that third-party app authors drop support for all versions of Django prior to 1.11. At that time, you should be able run your package's tests using ``python -Wd`` so that deprecation warnings do appear. After making the deprecation warning fixes, your app should be compatible with Django 2.0.
id: Berikut terbitan dari Django 2.0, kami menyarankan bahwa penulis apikasi pihak-ketiga menjatuhkan dukungan untuk semua versi Django sebelum 1.11. Pada waktu itu, anda harus dapat menjalankan percobaan paket menggunakan ``python -Wd`` sehingga peringatan pengusangan muncul. Setelah membuat perbaikan peringatan pengusangan, aplikasi anda harus cocok dengan Django 2.0.
zh_hans: 在发布 Django 2.0 后，我们建议第三方应用的作者停止支持所有在 1.11 之前的 Django 版本。在那时，您应该能够使用 ``python -Wd`` 运行您包的测试，以确保弃用警告出现。在修复弃用警告后，您的应用应该与 Django 2.0 兼容。

source: What's new in Django 1.11
id: Apa yang baru di Django 1.11
zh_hans: Django 1.11 新特性

source: Class-based model indexes
id: Indeks model berdasarkan-kelas
zh_hans: 基于类的模型索引

source: The new :mod:`django.db.models.indexes` module contains classes which ease creating database indexes. Indexes are added to models using the :attr:`Meta.indexes <django.db.models.Options.indexes>` option.
id: Modul :mod:`django.db.models.indexes` baru mengandung kelas-kelas yang memudahkan membuat indeks basisdata. Indeks-indeks ditambahkan ke model-model menggunakan pilihan :attr:`Meta.indexes <django.db.models.Options.indexes>`.
zh_hans: 新的 :mod:`django.db.models.indexes` 模块包含了用于简化创建数据库索引的类。索引可以通过在模型中使用 :attr:`Meta.indexes <django.db.models.Options.indexes>` 选项来添加。

source: Template-based widget rendering
id: Membangun widget berdasarkan-cetakan
zh_hans: 基于模板的小部件渲染

source: To ease customizing widgets, form widget rendering is now done using the template system rather than in Python. See :doc:`/ref/forms/renderers`.
id: Untuk memudahkan menyesuaian widget, membangun widget formulir sekarang selesai menggunakan sistem cetakan daripada dalam Python. Lihat :doc:`/ref/forms/renderers`.
zh_hans: 为了方便定制小部件，现在表单小部件的渲染是使用模板系统而不是在 Python 中进行的。请参阅 :doc:`/ref/forms/renderers`。

source: You may need to adjust any custom widgets that you've written for a few :ref:`backwards incompatible changes <template-widget-incompatibilities-1-11>`.
id: Anda mungkin butuh menyesuaikan widget penyesuaian apapun yang anda telah tulis untuk sedikit :ref:`backwards incompatible changes <template-widget-incompatibilities-1-11>`.
zh_hans: 你可能需要调整你编写的任何自定义小部件，以适应一些 :ref:`不兼容变更 <template-widget-incompatibilities-1-11>`。

source: ``Subquery`` expressions
id: Ungkapan ``Subquery``
zh_hans: ``Subquery`` 表达式

source: The new :class:`~django.db.models.Subquery` and :class:`~django.db.models.Exists` database expressions allow creating explicit subqueries. Subqueries may refer to fields from the outer queryset using the :class:`~django.db.models.OuterRef` class.
id: Pernyataan basisdata :class:`~django.db.models.Subquery` and :class:`~django.db.models.Exists` baru mengizinkan membuat sub permintaan jelas. Sub permintaan mungkin mengacu ke bidang-bidang dari queryset terluar menggunakan kelas :class:`~django.db.models.OuterRef`.
zh_hans: 新的 :class:`~django.db.models.Subquery` 和 :class:`~django.db.models.Exists` 数据库表达式允许创建明确的子查询。子查询可以使用 :class:`~django.db.models.OuterRef` 类引用来自外部查询集的字段。

source: :attr:`.ModelAdmin.date_hierarchy` can now reference fields across relations.
id: :attr:`.ModelAdmin.date_hierarchy` sekarang dapat mengacu bidang-bidang terhadap hubungan.
zh_hans: :attr:`.ModelAdmin.date_hierarchy` 现在可以引用跨关联的字段。

source: The new :meth:`ModelAdmin.get_exclude() <django.contrib.admin.ModelAdmin.get_exclude>` hook allows specifying the exclude fields based on the request or model instance.
id: Kaitan :meth:`ModelAdmin.get_exclude() <django.contrib.admin.ModelAdmin.get_exclude>` baru mengizinkan menentukan bidang-bidang dikecualikan berdasarkan pada permintaan atau instance model.
zh_hans: 新的 :meth:`ModelAdmin.get_exclude() <django.contrib.admin.ModelAdmin.get_exclude>` 钩子允许根据请求或模型实例指定要排除的字段。

source: The ``popup_response.html`` template can now be overridden per app, per model, or by setting the :attr:`.ModelAdmin.popup_response_template` attribute.
id: Cetakan ``popup_response.html`` sekarang dapat ditimpa per aplikasi, per model, atau dengan mengatur atribut :attr:`.ModelAdmin.popup_response_template`.
zh_hans: ``popup_response.html`` 模板现在可以按照每个应用程序、每个模型或通过设置 :attr:`.ModelAdmin.popup_response_template` 属性来进行覆盖。

source: The default iteration count for the PBKDF2 password hasher is increased by 20%.
id: Hitungan perulangan awalan untuk pencampur sandi PBKDF2 meningkat sebesar 20%.
zh_hans: PBKDF2 密码哈希器的默认迭代次数增加了 20 %。

source: The :class:`~django.contrib.auth.views.LoginView` and :class:`~django.contrib.auth.views.LogoutView` class-based views supersede the deprecated ``login()`` and ``logout()`` function-based views.
id: Tampilan berdasarkan-kelas :class:`~django.contrib.auth.views.LoginView` and :class:`~django.contrib.auth.views.LogoutView` menggantikan tampilan berdasarkan-fungsi ``login()`` dan ``logout()`` yang diusangkan.
zh_hans: :class:`~django.contrib.auth.views.LoginView` 和 :class:`~django.contrib.auth.views.LogoutView` 基于类的视图替代了已弃用的 ``login()`` 和 ``logout()`` 基于函数的视图。

source: The :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, and :class:`~django.contrib.auth.views.PasswordResetCompleteView` class-based views supersede the deprecated ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, and ``password_reset_complete()`` function-based views.
id: Tampilan berdasarkan-kelas The :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, dan :class:`~django.contrib.auth.views.PasswordResetCompleteView` menggantikan tampilan berdasarkan-fungsi ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, dan ``password_reset_complete()`` yang diusangkan.
zh_hans: :class:`~django.contrib.auth.views.PasswordChangeView`、:class:`~django.contrib.auth.views.PasswordChangeDoneView`、:class:`~django.contrib.auth.views.PasswordResetView`、:class:`~django.contrib.auth.views.PasswordResetDoneView`、:class:`~django.contrib.auth.views.PasswordResetConfirmView` 和 :class:`~django.contrib.auth.views.PasswordResetCompleteView` 基于类的视图替代了已弃用的 ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, 和 ``password_reset_complete()`` 基于函数的视图。

source: The new ``post_reset_login`` attribute for :class:`~django.contrib.auth.views.PasswordResetConfirmView` allows automatically logging in a user after a successful password reset. If you have multiple ``AUTHENTICATION_BACKENDS`` configured, use the ``post_reset_login_backend`` attribute to choose which one to use.
id: Atribut ``post_reset_login`` baru untuk :class:`~django.contrib.auth.views.PasswordResetConfirmView` mengizinkan secara otomatis masuk seorang pengguna setelah berhasil menyetel kembali sandi. Jika anda mempunyai banyak ``AUTHENTICATION_BACKENDS`` dikonfigurasi, gunakan atribut ``post_reset_login_backend`` untuk memilih yang mana satu digunakan.
zh_hans: :class:`~django.contrib.auth.views.PasswordResetConfirmView` 的新属性 ``post_reset_login`` 允许在成功重置密码后自动登录用户。如果配置了多个 ``AUTHENTICATION_BACKENDS``，可以使用 ``post_reset_login_backend`` 属性选择要使用的后端。

source: To avoid the possibility of leaking a password reset token via the HTTP Referer header (for example, if the reset page includes a reference to CSS or JavaScript hosted on another domain), the :class:`~django.contrib.auth.views.PasswordResetConfirmView` (but not the deprecated ``password_reset_confirm()`` function-based view) stores the token in a session and redirects to itself to present the password change form to the user without the token in the URL.
id: Untuk menghindari kemungkinan kebocoran token menyetel kembali sandi melalui kepala HTTP Referer (sebagai contoh, jika halaman menyetel kembali menyertakan sebuah acuan pada CSS atau JavaScript disimpan pada ranah lain), :class:`~django.contrib.auth.views.PasswordResetConfirmView` (tetapi bukan tampilan berdasarkan-fungsi ``password_reset_confirm()`` yang diusangkan) menyimpan token dalam sebuah sesi dan mengalihkan ke itu sendiri untuk menghadirkan formulir rubah sandi ke pengguna tanpa token dalam URL.
zh_hans: 为了避免通过 HTTP Referer 标头泄露密码重置令牌的可能性（例如，如果重置页面包含对托管在另一个域上的 CSS 或 JavaScript 的引用），:class:`~django.contrib.auth.views.PasswordResetConfirmView` （但不是已弃用的 ``password_reset_confirm()`` 基于函数的视图）将令牌存储在会话中，并重定向到自身，以向用户呈现不带令牌的 URL 的密码更改表单。

source: :func:`~django.contrib.auth.update_session_auth_hash` now rotates the session key to allow a password change to invalidate stolen session cookies.
id: :func:`~django.contrib.auth.update_session_auth_hash` sekarang memutar kunci sesi untuk mengizinkan perubahan sandi untuk kue sesi dicuri tidak sah.
zh_hans: :func:`~django.contrib.auth.update_session_auth_hash` 现在会旋转会话密钥，以允许密码更改来使被窃取的会话 Cookie 失效。

source: The new ``success_url_allowed_hosts`` attribute for :class:`~django.contrib.auth.views.LoginView` and :class:`~django.contrib.auth.views.LogoutView` allows specifying a set of hosts that are safe for redirecting after login and logout.
id: Atribut ``success_url_allowed_hosts`` baru untuk :class:`~django.contrib.auth.views.LoginView` dan :class:`~django.contrib.auth.views.LogoutView` mengizinkan menentukan sekumpulan dari rumah yang aman untuk pengalihan setelah masuk dan keluar.
zh_hans: :class:`~django.contrib.auth.views.LoginView` 和 :class:`~django.contrib.auth.views.LogoutView` 的新属性 ``success_url_allowed_hosts`` 允许指定一组安全的主机，用于在登录和注销后进行重定向。

source: Added password validators ``help_text`` to :class:`~django.contrib.auth.forms.UserCreationForm`.
id: Ditambahkan pengesah sandi ``help_text`` pada :class:`~django.contrib.auth.forms.UserCreationForm`.
zh_hans: 已添加密码验证器的 ``help_text`` 到 :class:`~django.contrib.auth.forms.UserCreationForm`。

source: The ``HttpRequest`` is now passed to :func:`~django.contrib.auth.authenticate` which in turn passes it to the authentication backend if it accepts a ``request`` argument.
id: ``HttpRequest`` sekarang dilewatkan ke :func:`~django.contrib.auth.authenticate` yang gilirannya melewatkan itu ke backend autentifikasi jika itu menerima sebuah argumen ``request``.
zh_hans: ``HttpRequest`` 现在传递给 :func:`~django.contrib.auth.authenticate`，如果身份验证后端接受 ``request`` 参数，则它将传递给身份验证后端。

source: The :func:`~django.contrib.auth.signals.user_login_failed` signal now receives a ``request`` argument.
id: Sinyal :func:`~django.contrib.auth.signals.user_login_failed` sekarang menerima sebuah argumen ``request``.
zh_hans: :func:`~django.contrib.auth.signals.user_login_failed` 信号现在接收一个 ``request`` 参数。

source: :class:`~django.contrib.auth.forms.PasswordResetForm` supports custom user models that use an email field named something other than ``'email'``. Set :attr:`CustomUser.EMAIL_FIELD <django.contrib.auth.models.CustomUser.EMAIL_FIELD>` to the name of the field.
id: :class:`~django.contrib.auth.forms.PasswordResetForm` mendukung penyesuaian pengguna model-model yang menggunakan sebuah bidang surel bernama sesuatu selain ``'email'``. Setel :attr:`CustomUser.EMAIL_FIELD <django.contrib.auth.models.CustomUser.EMAIL_FIELD>` ke nama dari bidang.
zh_hans: :class:`~django.contrib.auth.forms.PasswordResetForm` 支持自定义用户模型，该模型使用名称不是 ``'email'`` 的电子邮件字段。将 :attr:`CustomUser.EMAIL_FIELD <django.contrib.auth.models.CustomUser.EMAIL_FIELD>` 设置为字段的名称。

source: :func:`~django.contrib.auth.get_user_model` can now be called at import time, even in modules that define models.
id: :func:`~django.contrib.auth.get_user_model` sekarang dapat dipanggil pada waktu impor, bahkan dalam modeul-modul yang menentukan model-model.
zh_hans: :func:`~django.contrib.auth.get_user_model` 现在可以在导入时调用，即使在定义模型的模块中也可以。

source: When stale content types are detected in the :djadmin:`remove_stale_contenttypes` command, there's now a list of related objects such as ``auth.Permission``\s that will also be deleted. Previously, only the content types were listed (and this prompt was after ``migrate`` rather than in a separate command).
id: Ketika jenis isi basi dikenali dalam perintah :djadmin:`remove_stale_contenttypes`, ada sekarang daftar dari obyek terkait seperti ``auth.Permission`` yang akan juga dihapus. Sebelumnya, hanya jenis isi yang ditampilkan (dan penunjukan ini setelah ``migrate`` daripada dalam perintah terpisah).
zh_hans: 在 :djadmin:`remove_stale_contenttypes` 命令中，当检测到陈旧的内容类型时，现在会列出一系列相关对象，如 ``auth.Permission``，这些对象也将被删除。之前，只列出了内容类型（而且此提示是在 ``migrate`` 之后，而不是在一个单独的命令中）。

source: The new :meth:`.GEOSGeometry.from_gml` and :meth:`.OGRGeometry.from_gml` methods allow creating geometries from GML.
id: Metode :meth:`.GEOSGeometry.from_gml` dan :meth:`.OGRGeometry.from_gml` baru mengizinkan membuat geometri dari GML.
zh_hans: 新的 :meth:`.GEOSGeometry.from_gml` 和 :meth:`.OGRGeometry.from_gml` 方法允许从 GML 创建几何图形。

source: Added support for the :lookup:`dwithin` lookup on SpatiaLite.
id: Ditambahkan dukungan untuk pencarian :lookup:`dwithin` pada SpatiaLite.
zh_hans: 在 SpatiaLite 上新增了对 :lookup:`dwithin` 查询的支持。

source: The :class:`~django.contrib.gis.db.models.functions.Area` function, :class:`~django.contrib.gis.db.models.functions.Distance` function, and distance lookups now work with geodetic coordinates on SpatiaLite.
id: Fungsi :class:`~django.contrib.gis.db.models.functions.Area`, :class:`~django.contrib.gis.db.models.functions.Distance` function, dan pencarian tujuan sekarang bekerja dengan kordinat geodetik pada SpatiaLite.
zh_hans: :class:`~django.contrib.gis.db.models.functions.Area` 函数、:class:`~django.contrib.gis.db.models.functions.Distance` 函数以及距离查询现在在 SpatiaLite 上支持大地坐标。

source: The OpenLayers-based form widgets now use ``OpenLayers.js`` from ``https://cdnjs.cloudflare.com`` which is more suitable for production use than the old ``https://openlayers.org/`` source. They are also updated to use OpenLayers 3.
zh_hans: 基于 OpenLayers 的表单小部件现在使用来自 ``https://cdnjs.cloudflare.com`` 的 ``OpenLayers.js``，这比旧的 ``https://openlayers.org/`` 源更适合生产使用。它们还更新为使用 OpenLayers 3。

source: PostGIS migrations can now change field dimensions.
id: Perpindahan PostGIS sekarang dapat merubah bidang dimensi.
zh_hans: PostGIS 迁移现在可以改变字段尺寸。

source: Added the ability to pass the ``size``, ``shape``, and ``offset`` parameters when creating :class:`~django.contrib.gis.gdal.GDALRaster` objects.
zh_hans: 现在可以在创建 :class:`~django.contrib.gis.gdal.GDALRaster` 对象时传递 ``size``、``shape`` 和 ``offset`` 参数。

source: Added SpatiaLite support for the :class:`~django.contrib.gis.db.models.functions.IsValid` function, :class:`~django.contrib.gis.db.models.functions.MakeValid` function, and :lookup:`isvalid` lookup.
id: Ditambahkan dukungan SpatiaLite untuk fungsi :class:`~django.contrib.gis.db.models.functions.IsValid`, fungsi :class:`~django.contrib.gis.db.models.functions.MakeValid`, dan pencarian :lookup:`isvalid`.
zh_hans: 新增了对 :class:`~django.contrib.gis.db.models.functions.IsValid` 函数、:class:`~django.contrib.gis.db.models.functions.MakeValid` 函数以及 :lookup:`isvalid` 查询的 SpatiaLite 支持。

source: Added Oracle support for the :class:`~django.contrib.gis.db.models.functions.AsGML` function, :class:`~django.contrib.gis.db.models.functions.BoundingCircle` function, :class:`~django.contrib.gis.db.models.functions.IsValid` function, and :lookup:`isvalid` lookup.
id: Ditambahkan dukungan Oracle untuk fungsi :class:`~django.contrib.gis.db.models.functions.AsGML`, fungsi :class:`~django.contrib.gis.db.models.functions.BoundingCircle`, fungsi :class:`~django.contrib.gis.db.models.functions.IsValid` function, dan pencarian :lookup:`isvalid`.
zh_hans: 新增了对 Oracle 数据库的支持，包括 :class:`~django.contrib.gis.db.models.functions.AsGML` 函数、:class:`~django.contrib.gis.db.models.functions.BoundingCircle` 函数、:class:`~django.contrib.gis.db.models.functions.IsValid` 函数以及 :lookup:`isvalid` 查询。

source: The new ``distinct`` argument for :class:`~django.contrib.postgres.aggregates.StringAgg` determines if concatenated values will be distinct.
id: Argumen ``distinct`` baru untuk :class:`~django.contrib.postgres.aggregates.StringAgg` ditentukan jika nilai-nilai gabungan akan dibedakan.
zh_hans: :class:`~django.contrib.postgres.aggregates.StringAgg` 的新参数 ``distinct`` 决定了连接的值是否要去重。

source: The new :class:`~django.contrib.postgres.indexes.GinIndex` and :class:`~django.contrib.postgres.indexes.BrinIndex` classes allow creating ``GIN`` and ``BRIN`` indexes in the database.
id: Kelas-kelas :class:`~django.contrib.postgres.indexes.GinIndex` dan :class:`~django.contrib.postgres.indexes.BrinIndex` baru mengizinkan membuat indeks-indeks ``GIN`` dan ``BRIN`` dalam basisdata.
zh_hans: 新的 :class:`~django.contrib.postgres.indexes.GinIndex` 和 :class:`~django.contrib.postgres.indexes.BrinIndex` 类允许在数据库中创建 ``GIN`` 和 ``BRIN`` 索引。

source: ``django.contrib.postgres.fields.JSONField`` accepts a new ``encoder`` parameter to specify a custom class to encode data types not supported by the standard encoder.
zh_hans: ``django.contrib.postgres.fields.JSONField`` 接受一个新的参数 ``encoder``，用于指定自定义类以编码不受标准编码器支持的数据类型。
