Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :class:`~django.contrib.admin.InlineModelAdmin` now has an attribute :attr:`~django.contrib.admin.InlineModelAdmin.show_change_link` that supports showing a link to an inline object's change form.
id: :class:`~django.contrib.admin.InlineModelAdmin` sekarang mempunyai sebuah atribut :attr:`~django.contrib.admin.InlineModelAdmin.show_change_link` yang mendukung menampilkan sebuah tautan ke berderet formulir rubah obyek.
zh_hans: :class:`~django.contrib.admin.InlineModelAdmin` 现在有一个属性 :attr:`~django.contrib.admin.InlineModelAdmin.show_change_link`，支持显示到内联对象的更改表单的链接。

source: Use the new ``django.contrib.admin.RelatedOnlyFieldListFilter`` in :attr:`ModelAdmin.list_filter <django.contrib.admin.ModelAdmin.list_filter>` to limit the ``list_filter`` choices to foreign objects which are attached to those from the ``ModelAdmin``.
id: Gunakan ``django.contrib.admin.RelatedOnlyFieldListFilter`` baru di :attr:`ModelAdmin.list_filter <django.contrib.admin.ModelAdmin.list_filter>` untuk membatasi pilihan ``list_filter`` pada obyek asing yang dilampirkan untuk mereka dari ``ModelAdmin``.
zh_hans: 在 :attr:`ModelAdmin.list_filter <django.contrib.admin.ModelAdmin.list_filter>` 中使用新的 ``django.contrib.admin.RelatedOnlyFieldListFilter``，以将 ``list_filter`` 选项限制为与 ``ModelAdmin`` 相关联的外部对象。

source: The :meth:`ModelAdmin.delete_view() <django.contrib.admin.ModelAdmin.delete_view>` displays a summary of objects to be deleted on the deletion confirmation page.
id: :meth:`ModelAdmin.delete_view() <django.contrib.admin.ModelAdmin.delete_view>` menampilkan ringkasan dari obyek untuk dihapus pada jalaman penegasan penghapusan.
zh_hans: :meth:`ModelAdmin.delete_view() <django.contrib.admin.ModelAdmin.delete_view>` 在删除确认页面上显示要删除的对象的摘要信息。

source: The jQuery library embedded in the admin has been upgraded to version 1.11.2.
id: Pustaka jQuery tertanam di admin telah ditingkatkan ke versi 1.11.2.
zh_hans: 嵌入在管理员中的 jQuery 库已升级到 1.11.2 版本。

source: You can now specify :attr:`AdminSite.site_url <django.contrib.admin.AdminSite.site_url>` in order to display a link to the front-end site.
id: Anda sekarang dapat menentukan :attr:`AdminSite.site_url <django.contrib.admin.AdminSite.site_url>` untuk menampilkan sebuah tautan ke situs front-end.+
zh_hans: 现在可以指定 :attr:`AdminSite.site_url <django.contrib.admin.AdminSite.site_url>`，以便在前端网站中显示一个链接。

source: You can now specify :attr:`ModelAdmin.show_full_result_count <django.contrib.admin.ModelAdmin.show_full_result_count>` to control whether or not the full count of objects should be displayed on a filtered admin page.
id: Anda sekarang dapat menentukan :attr:`ModelAdmin.show_full_result_count <django.contrib.admin.ModelAdmin.show_full_result_count>` untuk mengendalikan apakah atau tidak hitungan penuh obyek harus ditampilkan pada halaman admin tersaring.
zh_hans: 现在可以指定 :attr:`ModelAdmin.show_full_result_count <django.contrib.admin.ModelAdmin.show_full_result_count>`，以控制是否在筛选后的管理页面上显示对象的完整计数。

source: The ``AdminSite.password_change()`` method now has an ``extra_context`` parameter.
id: Metode ``AdminSite.password_change()`` sekarang mempunyai sebuah parameter ``extra_context``.
zh_hans: ``AdminSite.password_change()`` 方法现在有一个 ``extra_context`` 参数。

source: You can now control who may login to the admin site by overriding only :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` and :attr:`AdminSite.login_form <django.contrib.admin.AdminSite.login_form>`. The ``base.html`` template has a new block ``usertools`` which contains the user-specific header. A new context variable ``has_permission``, which gets its value from :meth:`~django.contrib.admin.AdminSite.has_permission`, indicates whether the user may access the site.
id: Anda sekarang dapat mengendalikan siapa yang dapat masuk ke situs admin dengan menimpa hanya :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` dan :attr:`AdminSite.login_form <django.contrib.admin.AdminSite.login_form>`. Cetakan ``base.html`` mempunyai blok baru ``usertools`` yang mengandung kepala khusus-pengguna. Sebuah variabel konteks baru ``has_permission``, yang mendapatkan nilainya dari :meth:`~django.contrib.admin.AdminSite.has_permission`, menandakan apakah pengguna dapat mengakses situs.
zh_hans: 现在可以通过覆盖 :meth:`AdminSite.has_permission() <django.contrib.admin.AdminSite.has_permission>` 和 :attr:`AdminSite.login_form <django.contrib.admin.AdminSite.login_form>` 来控制谁可以登录到管理站点。``base.html`` 模板有一个新的块 ``usertools``，其中包含用户特定的页眉。一个新的上下文变量 ``has_permission``，它的值来自于 :meth:`~django.contrib.admin.AdminSite.has_permission`，指示用户是否可以访问站点。

source: Foreign key dropdowns now have buttons for changing or deleting related objects using a popup.
id: Dropdown foreign key sekarang mempunyai tombol untuk merubah atau menghapus obyek terkait menggunakan sebuah popup.
zh_hans: 外键下拉菜单现在通过弹出窗口提供更改或删除相关对象的按钮。

source: reStructuredText is now parsed in model docstrings.
id: reStructuredText sekarang diuraikan di model docstring.
zh_hans: 现在在模型的文档字符串中解析 reStructuredText 。

source: Authorization backends can now raise :class:`~django.core.exceptions.PermissionDenied` in :meth:`~django.contrib.auth.models.User.has_perm` and :meth:`~django.contrib.auth.models.User.has_module_perms` to short-circuit permission checking.
id: Otorisasi backend sekarang dapat memunculkan :class:`~django.core.exceptions.PermissionDenied` di :meth:`~django.contrib.auth.models.User.has_perm` dan :meth:`~django.contrib.auth.models.User.has_module_perms` pada pemeriksaan perizinan sirkit-pendek.
zh_hans: 授权后端现在可以在 :meth:`~django.contrib.auth.models.User.has_perm` 和 :meth:`~django.contrib.auth.models.User.has_module_perms` 中引发 :class:`~django.core.exceptions.PermissionDenied` 以绕过权限检查。

source: :class:`~django.contrib.auth.forms.PasswordResetForm` now has a method :meth:`~django.contrib.auth.forms.PasswordResetForm.send_mail` that can be overridden to customize the mail to be sent.
id: :class:`~django.contrib.auth.forms.PasswordResetForm` sekarang mempunyai metode :meth:`~django.contrib.auth.forms.PasswordResetForm.send_mail` yang dapat ditimpa untuk menyesuaikan surat untuk dikirim.
zh_hans: :class:`~django.contrib.auth.forms.PasswordResetForm` 现在有一个可以被重写以自定义要发送的邮件的方法 :meth:`~django.contrib.auth.forms.PasswordResetForm.send_mail`。

source: The ``max_length`` of :attr:`Permission.name <django.contrib.auth.models.Permission.name>` has been increased from 50 to 255 characters. Please run the database migration.
id: ``max_length`` dari :attr:`Permission.name <django.contrib.auth.models.Permission.name>` telah ditingkatkan dari 50 menjadi 255 karakter. Harap jalankan perpindahan basisdata.
zh_hans: :attr:`Permission.name <django.contrib.auth.models.Permission.name>` 的 ``max_length`` 从 50 增加到 255 个字符。请运行数据库迁移。

source: :attr:`~django.contrib.auth.models.CustomUser.USERNAME_FIELD` and :attr:`~django.contrib.auth.models.CustomUser.REQUIRED_FIELDS` now supports :class:`~django.db.models.ForeignKey`\s.
id: :attr:`~django.contrib.auth.models.CustomUser.USERNAME_FIELD` dan :attr:`~django.contrib.auth.models.CustomUser.REQUIRED_FIELDS` sekarang mendukung :class:`~django.db.models.ForeignKey`
zh_hans: :attr:`~django.contrib.auth.models.CustomUser.USERNAME_FIELD` 和 :attr:`~django.contrib.auth.models.CustomUser.REQUIRED_FIELDS` 现在支持 :class:`~django.db.models.ForeignKey`。

source: The default iteration count for the PBKDF2 password hasher has been increased by 33%. This backwards compatible change will not affect users who have subclassed ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` to change the default value.
id: Perhitungan putaran awal untuk pengacak sandi PBKDF2 telah ditingkatkan oleh 33%. Perubahan kesesuaian kebelakang tidak akan mempengaruhi pengguna yang telah disubkelaskan ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` untuk merubah nilai awal.
zh_hans: PBKDF2 密码哈希器的默认迭代次数增加了 33%。这个向后兼容的变更不会影响那些已经子类化了 ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` 以更改默认值的用户。

source: A new :doc:`GeoJSON serializer </ref/contrib/gis/serializers>` is now available.
id: :doc:`GeoJSON serializer </ref/contrib/gis/serializers>` baru sekarang tersedia.
zh_hans: 现在有一个新的 :doc:`GeoJSON 序列化程序 </ref/contrib/gis/serializers>` 可供使用。

source: It is now allowed to include a subquery as a geographic lookup argument, for example ``City.objects.filter(point__within=Country.objects.filter(continent='Africa').values('mpoly'))``.
id: Itu sekarang diizinkan untuk menyertakan sebuah sub permintaan sebagai argumen pencarian geografi, sebagai contoh ``City.objects.filter(point__within=Country.objects.filter(continent='Africa').values('mpoly'))``.
zh_hans: 现在允许将子查询作为地理查找参数，例如 ``City.objects.filter(point__within=Country.objects.filter(continent='Africa').values('mpoly'))``。

source: The SpatiaLite backend now supports ``Collect`` and ``Extent`` aggregates when the database version is 3.0 or later.
id: Backend SpatiaLite sekarang mendukung pengumpulan ``Collect`` dan ``Extent`` ketika versi basisdata adalah 3.0 atay terakhir.
zh_hans: 当数据库版本为 3.0 或更高时，SpatiaLite 后端现在支持 ``Collect`` 和 ``Extent`` 聚合函数。

source: The PostGIS 2 ``CREATE EXTENSION postgis`` and the SpatiaLite ``SELECT InitSpatialMetaData`` initialization commands are now automatically run by :djadmin:`migrate`.
id: Perintah inisialisasi PostGIS 2 ``CREATE EXTENSION postgis`` dan the SpatiaLite ``SELECT InitSpatialMetaData`` sekarang secara otomatis dijalankan oleh :djadmin:`migrate`.
zh_hans: PostGIS 2 中的 ``CREATE EXTENSION postgis`` 和 SpatiaLite 中的 ``SELECT InitSpatialMetaData`` 初始化命令现在会被 :djadmin:`migrate` 自动执行。

source: The GDAL interface now supports retrieving properties of :ref:`raster (image) data file <raster-data-source-objects>`.
id: Antarmuka GDAL sekarang mendukung mengambil sifat dari :ref:`raster (image) data file <raster-data-source-objects>`.
zh_hans: GDAL 接口现在支持检索 :ref:`栅格（图像）数据文件 <raster-data-source-objects>` 的属性。

source: Compatibility shims for ``SpatialRefSys`` and ``GeometryColumns`` changed in Django 1.2 have been removed.
id: Shim kesesuaian untuk ``SpatialRefSys`` dan ``GeometryColumns`` berubah di Django 1.2 telah dipindahkan.
zh_hans: 已删除了 Django 1.2 中更改的 ``SpatialRefSys`` 和 ``GeometryColumns`` 的兼容性 shims。

source: All GDAL-related exceptions are now raised with ``GDALException``. The former ``OGRException`` has been kept for backwards compatibility but should not be used any longer.
id: Semua pengecualian terkait-GDAL sekarang dimunculkan dengan ``GDALException``. Pendahulu ``OGRException`` telah disimpan untuk kesesuaian kebelakang tetapi harus tidak digunakan lagi.
zh_hans: 现在所有与 GDAL 相关的异常都使用 ``GDALException`` 引发。以前的 ``OGRException`` 已保留以保持向后兼容性，但不应再使用。

source: Session cookie is now deleted after :meth:`~django.contrib.sessions.backends.base.SessionBase.flush()` is called.
id: Kue sesi sekarang dihapus setelah :meth:`~django.contrib.sessions.backends.base.SessionBase.flush()` dipanggil.
zh_hans: 在调用 :meth:`~django.contrib.sessions.backends.base.SessionBase.flush()` 后，会删除会话 cookie。

source: The new :attr:`Sitemap.i18n <django.contrib.sitemaps.Sitemap.i18n>` attribute allows you to generate a sitemap based on the :setting:`LANGUAGES` setting.
id: Atribut :attr:`Sitemap.i18n <django.contrib.sitemaps.Sitemap.i18n>` baru mengizinkan anda untuk membangkitkan sebuah peta situs berdasarkan pada pengaturan :setting:`LANGUAGES`.
zh_hans: 新的 :attr:`Sitemap.i18n <django.contrib.sitemaps.Sitemap.i18n>` 属性允许你基于 :setting:`LANGUAGES` 设置生成多语言站点地图。

source: :func:`~django.contrib.sites.shortcuts.get_current_site` will now lookup the current site based on :meth:`request.get_host() <django.http.HttpRequest.get_host>` if the :setting:`SITE_ID` setting is not defined.
id: :func:`~django.contrib.sites.shortcuts.get_current_site` akan sekarang mencari situs saat ini berdasarkan pada :meth:`request.get_host() <django.http.HttpRequest.get_host>` jika pengaturan :setting:`SITE_ID` tidak ditentukan.
zh_hans: 如果没有定义 :setting:`SITE_ID` 设置，:func:`~django.contrib.sites.shortcuts.get_current_site` 现在将基于 :meth:`request.get_host() <django.http.HttpRequest.get_host>` 查找当前站点。

source: The default :class:`~django.contrib.sites.models.Site` created when running ``migrate`` now respects the :setting:`SITE_ID` setting (instead of always using ``pk=1``).
id: Awalan :class:`~django.contrib.sites.models.Site` dibuat ketika menjalankan ``migrate`` sekarang menghormati pengaturan :setting:`SITE_ID` (sebagai gantinya dari selalu menggunakan ``pk=1``).
zh_hans: 在运行 ``migrate`` 时创建的默认 :class:`~django.contrib.sites.models.Site` 现在会遵循 :setting:`SITE_ID` 设置（而不是总是使用 ``pk=1``）。

source: The ``incr()`` method of the ``django.core.cache.backends.locmem.LocMemCache`` backend is now thread-safe.
id: Metode ``incr()`` dari backend ``django.core.cache.backends.locmem.LocMemCache`` sekarang thread-safe.
zh_hans: ``django.core.cache.backends.locmem.LocMemCache`` 后端的 ``incr()`` 方法现在是线程安全的。

source: Cryptography
id: Kriptografi
zh_hans: 密码学

source: The ``max_age`` parameter of the :meth:`django.core.signing.TimestampSigner.unsign` method now also accepts a :py:class:`datetime.timedelta` object.
id: Parameter ``max_age`` dari metode :meth:`django.core.signing.TimestampSigner.unsign` sekarang juga menerima sebuah obyek :py:class:`datetime.timedelta`.
zh_hans: :meth:`django.core.signing.TimestampSigner.unsign` 方法的 ``max_age`` 参数现在也接受 :py:class:`datetime.timedelta` 对象。

source: The MySQL backend no longer strips microseconds from ``datetime`` values as MySQL 5.6.4 and up supports fractional seconds depending on the declaration of the datetime field (when ``DATETIME`` includes fractional precision greater than 0). New datetime database columns created with Django 1.8 and MySQL 5.6.4 and up will support microseconds. See the :ref:`MySQL database notes <mysql-fractional-seconds>` for more details.
id: Backend MySQL tidak lagi melucuti mikrodetik dari nilai-nilai ``datetime`` sebagai MySQL 5.6.4 dan mendukung sampai pecahan detik tergantung pada pernyataan dari bidang datetime (ketika ``DATETIME`` menyertakan ketelitian pecahan lebih besar dari 0). Kolom basisdata datetime baru dibuat dengan Django 1.8 dan MySQL 5.6.4 dan sampai mendukung mikrodetik. Lihat :ref:`MySQL database notes <mysql-fractional-seconds>` untuk rincian lebih.
zh_hans: MySQL 后端不再从 ``datetime`` 值中去掉微秒，因为 MySQL 5.6.4 及更高版本根据 datetime 字段的声明支持分数秒（当 ``DATETIME`` 包含大于 0 的分数精度时）。使用 Django 1.8 和 MySQL 5.6.4 及更高版本创建的新 datetime 数据库列将支持微秒。有关更多详细信息，请参阅 :ref:`MySQL 数据库注释 <mysql-fractional-seconds>`。

source: The MySQL backend no longer creates explicit indexes for foreign keys when using the InnoDB storage engine, as MySQL already creates them automatically.
id: Backend MySQL tidak lagi dibuat membuat indeks jelas untuk foreign key ketika menggunakan mesin penyimpanan InnoDB. ketika MySQL sudah membuat mereka secara otomatis.
zh_hans: 在使用 InnoDB 存储引擎时，MySQL 后端不再为外键创建显式索引，因为 MySQL 已经自动创建了这些索引。

source: The Oracle backend no longer defines the ``connection_persists_old_columns`` feature as ``True``. Instead, Oracle will now include a cache busting clause when getting the description of a table.
id: Backend Oracle tidak lagi menentukan fitur ``connection_persists_old_columns`` sebagai ``True``. Sebagai gantinya, Oracle akan sekarang menyertakan sebuah klausa penghilang cache ketika mendapatkan gambaran.
zh_hans: Oracle 后端不再将 ``connection_persists_old_columns`` 特性定义为 ``True``。相反，Oracle 现在在获取表的描述时将包括一个缓存破坏子句。

source: :ref:`Email backends <topic-email-backends>` now support the context manager protocol for opening and closing connections.
id: :ref:`Email backends <topic-email-backends>` sekarang mendukung protokol pengelola konteks untuk membuka dan menutup hubungan.
zh_hans: :ref:`电子邮件后端 <topic-email-backends>` 现在支持上下文管理协议，用于打开和关闭连接。

source: The SMTP email backend now supports ``keyfile`` and ``certfile`` authentication with the :setting:`EMAIL_SSL_CERTFILE` and :setting:`EMAIL_SSL_KEYFILE` settings.
id: Backend surel SMTP sekarang mendukung otentifikasi ``keyfile`` dan ``certfile`` dengan pengaturan :setting:`EMAIL_SSL_CERTFILE` dan :setting:`EMAIL_SSL_KEYFILE`.
zh_hans: SMTP 电子邮件后端现在支持使用 :setting:`EMAIL_SSL_CERTFILE` 和 :setting:`EMAIL_SSL_KEYFILE` 设置进行 ``keyfile`` 和 ``certfile`` 身份验证。

source: The SMTP :class:`~django.core.mail.backends.smtp.EmailBackend` now supports setting the ``timeout`` parameter with the :setting:`EMAIL_TIMEOUT` setting.
id: SMTP :class:`~django.core.mail.backends.smtp.EmailBackend` sekarang mendukung pengaturan parameter ``timeout`` dengan pengaturan :setting:`EMAIL_TIMEOUT`.
zh_hans: SMTP :class:`~django.core.mail.backends.smtp.EmailBackend` 现在支持使用 :setting:`EMAIL_TIMEOUT` 设置来设置 ``timeout`` 参数。

source: :class:`~django.core.mail.EmailMessage` and ``EmailMultiAlternatives`` now support the ``reply_to`` parameter.
id: :class:`~django.core.mail.EmailMessage` dan ``EmailMultiAlternatives`` sekarang mendukung parameter ``reply_to``.
zh_hans: :class:`~django.core.mail.EmailMessage` 和 ``EmailMultiAlternatives`` 现在支持 ``reply_to`` 参数。

source: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` and :meth:`Storage.save() <django.core.files.storage.Storage.save>` now take a ``max_length`` argument to implement storage-level maximum filename length constraints. Filenames exceeding this argument will get truncated. This prevents a database error when appending a unique suffix to a long filename that already exists on the storage. See the :ref:`deprecation note <storage-max-length-update>` about adding this argument to your custom storage classes.
id: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` dan :meth:`Storage.save() <django.core.files.storage.Storage.save>` sekarang mengambil argumen ``max_length`` untuk menerapkan batasan panjang nama berkas maksimal tingkat-penyimpanan. Nama berkas melampaui argumen ini akan dipotong. Ini mencegah kesalahan basisdata ketika menambahkan sebuah akhiran unik pada sebuah nama berkas panjang yang sudah ada di penyimpanan. Lihat :ref:`deprecation note <storage-max-length-update>` tentang menambahkan argumen ini ke penyesuaian kelas penyimpanan anda.
zh_hans: :meth:`Storage.get_available_name() <django.core.files.storage.Storage.get_available_name>` 和 :meth:`Storage.save() <django.core.files.storage.Storage.save>` 现在接受一个 ``max_length`` 参数，以实现存储级别的最大文件名长度约束。超过此参数的文件名将被截断。这可以防止在长文件名上追加唯一后缀时出现数据库错误，而该文件名已存在于存储中。请查看关于在自定义存储类中添加此参数的 :ref:`弃用说明 <storage-max-length-update>`。

source: Form widgets now render attributes with a value of ``True`` or ``False`` as HTML5 boolean attributes.
id: Widget formulir sekarang membangun atribut dengan nilai dari ``True`` atau ``False`` sebagai atribut boolean HTML5.
zh_hans: 表单小部件现在将值为 ``True`` 或 ``False`` 的属性呈现为 HTML5 布尔属性。

source: The new :meth:`~django.forms.Form.has_error()` method allows checking if a specific error has happened.
id: Metode :meth:`~django.forms.Form.has_error()` barumengizinkan pemeriksaan jika kesalahan tertentu terjadi.
zh_hans: 新的 :meth:`~django.forms.Form.has_error()` 方法允许检查是否发生了特定错误。

source: If :attr:`~django.forms.Form.required_css_class` is defined on a form, then the ``<label>`` tags for required fields will have this class present in its attributes.
id: Jika :attr:`~django.forms.Form.required_css_class` ditentukan di sebuah formulir, kemudian etiket ``<label>`` untuk bidang wajib akan mempunyai kelas ini hadir di atributnya.
zh_hans: 如果在表单上定义了 :attr:`~django.forms.Form.required_css_class`，则必填字段的 ``<label>`` 标签将在其属性中包含此类。

source: The rendering of non-field errors in unordered lists (``<ul>``) now includes ``nonfield`` in its list of classes to distinguish them from field-specific errors.
id: Pembangunan dari kesalagan bukan-bidang dalam unordered lists (``<ul>``) sekarang menyertakan ``nonfield`` dalam daftarnya dari kelas-kelas untuk membedakan mereka dari kesalagan bidang-tertentu.
zh_hans: 无序列表（``<ul>``）中非字段错误的呈现现在在其类列表中包括 ``nonfield``，以区分它们和特定字段错误。

source: :class:`~django.forms.Field` now accepts a :attr:`~django.forms.Field.label_suffix` argument, which will override the form's :attr:`~django.forms.Form.label_suffix`. This enables customizing the suffix on a per-field basis — previously it wasn't possible to override a form's :attr:`~django.forms.Form.label_suffix` while using shortcuts such as ``{{ form.as_p }}`` in templates.
zh_hans: :class:`~django.forms.Field` 现在接受一个 :attr:`~django.forms.Field.label_suffix` 参数，该参数将覆盖表单的 :attr:`~django.forms.Form.label_suffix`。这使得可以在每个字段的基础上自定义后缀 — 以前在模板中使用 ``{{ form.as_p }}`` 等快捷方式时无法覆盖表单的 :attr:`~django.forms.Form.label_suffix`。

source: :class:`~django.forms.SelectDateWidget` now accepts an :attr:`~django.forms.SelectDateWidget.empty_label` argument, which will override the top list choice label when :class:`~django.forms.DateField` is not required.
id: :class:`~django.forms.SelectDateWidget` sekarang menerima sebuah argumen :attr:`~django.forms.SelectDateWidget.empty_label`, yang akan menimpa label pilihan daftar teratas ketika :class:`~django.forms.DateField` tidak wajib.
zh_hans: :class:`~django.forms.SelectDateWidget` 现在接受一个 :attr:`~django.forms.SelectDateWidget.empty_label` 参数，该参数将在 :class:`~django.forms.DateField` 不是必需时覆盖顶部列表选项的标签。

source: After an :class:`~django.forms.ImageField` has been cleaned and validated, the ``UploadedFile`` object will have an additional ``image`` attribute containing the Pillow ``Image`` instance used to check if the file was a valid image. It will also update ``UploadedFile.content_type`` with the image's content type as determined by Pillow.
id: Setelah sebuah :class:`~django.forms.ImageField` telah dibersihkan dan disahkan, obyek ``UploadedFile`` akan mempunyai sebuah tambahan atribut ``image`` mengandung instance ``Image`` Pillow digunakan untuk memeriksa jika berkas adalah nama sah. Itu juga akan memperbaharui ``UploadedFile.content_type`` dengan jenis isi gambar seperti yang ditentukan oleh Pillow.
zh_hans: 在对 :class:`~django.forms.ImageField` 进行清理和验证后，``UploadedFile`` 对象将具有额外的 ``image`` 属性，其中包含用于检查文件是否为有效图像的 Pillow ``Image`` 实例。它还会使用 Pillow 确定的图像内容类型来更新 ``UploadedFile.content_type``。

source: You can now pass a callable that returns an iterable of choices when instantiating a :class:`~django.forms.ChoiceField`.
id: Anda dapat sekarang melewatkan callable yang mengembalikan sebuah perulangan dari pilihan ketika membuat obyek :class:`~django.forms.ChoiceField`.
zh_hans: 现在在实例化 :class:`~django.forms.ChoiceField` 时可以传递一个可调用对象，该可调用对象返回一个选项的可迭代对象。

source: Generic views that use :class:`~django.views.generic.list.MultipleObjectMixin` may now specify the ordering applied to the :attr:`~django.views.generic.list.MultipleObjectMixin.queryset` by setting :attr:`~django.views.generic.list.MultipleObjectMixin.ordering` or overriding :meth:`~django.views.generic.list.MultipleObjectMixin.get_ordering()`.
id: Tampilan umum yang menggunakan :class:`~django.views.generic.list.MultipleObjectMixin` mungkin tidak menentukan urutan berlaku pada :attr:`~django.views.generic.list.MultipleObjectMixin.queryset` dengan mengatur :attr:`~django.views.generic.list.MultipleObjectMixin.ordering` atau menimpa :meth:`~django.views.generic.list.MultipleObjectMixin.get_ordering()`.
zh_hans: 使用 :class:`~django.views.generic.list.MultipleObjectMixin` 的通用视图现在可以通过设置 :attr:`~django.views.generic.list.MultipleObjectMixin.ordering` 或重写 :meth:`~django.views.generic.list.MultipleObjectMixin.get_ordering()` 来指定应用于 :attr:`~django.views.generic.list.MultipleObjectMixin.queryset` 的排序。
