Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The :source:`admin/delete_confirmation.html <django/contrib/admin/templates/admin/delete_confirmation.html>` template now has some additional blocks and scripting hooks to ease customization.
zh_hans: :source:`admin/delete_confirmation.html <django/contrib/admin/templates/admin/delete_confirmation.html>` 模板现在具有一些额外的块和脚本钩子，以便于定制。

source: The chosen options of :attr:`~django.contrib.admin.ModelAdmin.filter_horizontal` and :attr:`~django.contrib.admin.ModelAdmin.filter_vertical` widgets are now filterable.
zh_hans: :attr:`~django.contrib.admin.ModelAdmin.filter_horizontal` 和 :attr:`~django.contrib.admin.ModelAdmin.filter_vertical` 组件的选择选项现在是可过滤的。

source: The ``admin/base.html`` template now has a new block ``nav-breadcrumbs`` which contains the navigation landmark and the ``breadcrumbs`` block.
zh_hans: 模板 ``admin/base.html`` 现在具有一个新的块 ``nav-breadcrumbs``，其中包含导航标志和 ``breadcrumbs`` 块。

source: :attr:`.ModelAdmin.list_editable` now uses atomic transactions when making edits.
zh_hans: :attr:`.ModelAdmin.list_editable` 现在在进行编辑时使用原子事务。

source: jQuery is upgraded from version 3.6.0 to 3.6.4.
zh_hans: jQuery 的版本已从 3.6.0 升级到 3.6.4 。

source: The default iteration count for the PBKDF2 password hasher is increased from 390,000 to 600,000.
zh_hans: PBKDF2 密码哈希器的默认迭代次数从 390 , 000 增加到 600 , 000 。

source: :class:`~django.contrib.auth.forms.UserCreationForm` now saves many-to-many form fields for a custom user model.
zh_hans: :class:`~django.contrib.auth.forms.UserCreationForm` 现在保存了自定义用户模型的多对多表单字段。

source: The new :class:`~django.contrib.auth.forms.BaseUserCreationForm` is now the recommended base class for customizing the user creation form.
zh_hans: 新的 :class:`~django.contrib.auth.forms.BaseUserCreationForm` 现在是自定义用户创建表单的推荐基类。

source: The :doc:`GeoJSON serializer </ref/contrib/gis/serializers>` now outputs the ``id`` key for serialized features, which defaults to the primary key of objects.
zh_hans: :doc:`GeoJSON 序列化程序 </ref/contrib/gis/serializers>` 现在输出序列化要素的 ``id`` 键，默认为对象的主键。

source: The :class:`~django.contrib.gis.gdal.GDALRaster` class now supports :class:`pathlib.Path`.
zh_hans: :class:`~django.contrib.gis.gdal.GDALRaster` 类现在支持 :class:`pathlib.Path`。

source: The :class:`~django.contrib.gis.geoip2.GeoIP2` class now supports ``.mmdb`` files downloaded from DB-IP.
zh_hans: :class:`~django.contrib.gis.geoip2.GeoIP2` 类现在支持从 DB-IP 下载的 ``.mmdb`` 文件。

source: The OpenLayers template widget no longer includes inline CSS (which also removes the former ``map_css`` block) to better comply with a strict Content Security Policy.
zh_hans: OpenLayers 模板小部件不再包含内联 CSS（也删除了以前的 ``map_css`` 块），以更好地符合严格的内容安全策略。

source: :class:`~django.contrib.gis.forms.widgets.OpenLayersWidget` is now based on OpenLayers 7.2.2 (previously 4.6.5).
zh_hans: :class:`~django.contrib.gis.forms.widgets.OpenLayersWidget` 现在基于 OpenLayers 7.2.2（之前是 4.6.5）。

source: The new :lookup:`isempty` lookup and :class:`IsEmpty() <django.contrib.gis.db.models.functions.IsEmpty>` expression allow filtering empty geometries on PostGIS.
zh_hans: 新的 :lookup:`isempty` 查找和 :class:`IsEmpty() <django.contrib.gis.db.models.functions.IsEmpty>` 表达式允许在 PostGIS 上筛选空几何图形。

source: The new :class:`FromWKB() <django.contrib.gis.db.models.functions.FromWKB>` and :class:`FromWKT() <django.contrib.gis.db.models.functions.FromWKT>` functions allow creating geometries from Well-known binary (WKB) and Well-known text (WKT) representations.
zh_hans: 新的 :class:`FromWKB() <django.contrib.gis.db.models.functions.FromWKB>` 和 :class:`FromWKT() <django.contrib.gis.db.models.functions.FromWKT>` 函数允许从 Well-known binary (WKB) 和 Well-known text (WKT) 表示中创建几何图形。

source: The new :lookup:`trigram_strict_word_similar` lookup, and the :class:`TrigramStrictWordSimilarity() <django.contrib.postgres.search.TrigramStrictWordSimilarity>` and :class:`TrigramStrictWordDistance() <django.contrib.postgres.search.TrigramStrictWordDistance>` expressions allow using trigram strict word similarity.
zh_hans: 新的 :lookup:`trigram_strict_word_similar` 查找以及 :class:`TrigramStrictWordSimilarity() <django.contrib.postgres.search.TrigramStrictWordSimilarity>` 和 :class:`TrigramStrictWordDistance() <django.contrib.postgres.search.TrigramStrictWordDistance>` 表达式允许使用 trigram 严格单词相似性。

source: The :lookup:`arrayfield.overlap` lookup now supports ``QuerySet.values()`` and ``values_list()`` as a right-hand side.
zh_hans: :lookup:`arrayfield.overlap` 查找现在支持 ``QuerySet.values()`` 和 ``values_list()`` 作为右侧。

source: The new :meth:`.Sitemap.get_languages_for_item` method allows customizing the list of languages for which the item is displayed.
zh_hans: 新的 :meth:`.Sitemap.get_languages_for_item` 方法允许自定义显示项目的语言列表。

source: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` now has experimental support for replacing paths to JavaScript modules in ``import`` and ``export`` statements with their hashed counterparts. If you want to try it, subclass ``ManifestStaticFilesStorage`` and set the ``support_js_module_import_aggregation`` attribute to ``True``.
zh_hans: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 现在具有实验性支持，在 ``import`` 和 ``export`` 语句中用其哈希值替换 JavaScript 模块的路径。如果你想尝试它，可以子类化 ``ManifestStaticFilesStorage`` 并将 ``support_js_module_import_aggregation`` 属性设置为 ``True``。

source: The new :attr:`.ManifestStaticFilesStorage.manifest_hash` attribute provides a hash over all files in the manifest and changes whenever one of the files changes.
zh_hans: 新的 :attr:`.ManifestStaticFilesStorage.manifest_hash` 属性提供了对清单中所有文件的哈希，并在其中任何文件更改时更改。

source: The new ``"assume_role"`` option is now supported in :setting:`OPTIONS` on PostgreSQL to allow specifying the :ref:`session role <database-role>`.
zh_hans: 在 PostgreSQL 的 :setting:`OPTIONS` 中现在支持新的 ``"assume_role"`` 选项，允许指定 :ref:`会话角色 <database-role>`。

source: The new ``"server_side_binding"`` option is now supported in :setting:`OPTIONS` on PostgreSQL with ``psycopg`` 3.1.8+ to allow using :ref:`server-side binding cursors <database-server-side-parameters-binding>`.
zh_hans: 在 PostgreSQL 上，使用 ``psycopg`` 3.1.8+，现在支持 :setting:`OPTIONS` 中的新选项 ``"server_side_binding"``，允许使用 :ref:`服务器端绑定游标 <database-server-side-parameters-binding>`。

source: The debug page now shows :pep:`exception notes <678>` and :pep:`fine-grained error locations <657>` on Python 3.11+.
zh_hans: 在 Python 3.11+ 上，调试页面现在显示 :pep:`异常说明 <678>` 和 :pep:`细粒度错误位置 <657>`。

source: Session cookies are now treated as credentials and therefore hidden and replaced with stars (``**********``) in error reports.
zh_hans: 会话 cookie 现在被视为凭据，因此在错误报告中被隐藏并替换为星号（``**********``）。

source: :class:`~django.forms.ModelForm` now accepts the new ``Meta`` option ``formfield_callback`` to customize form fields.
zh_hans: :class:`~django.forms.ModelForm` 现在接受新的 ``Meta`` 选项 ``formfield_callback``，以自定义表单字段。

source: :func:`~django.forms.models.modelform_factory` now respects the ``formfield_callback`` attribute of the ``form``’s ``Meta``.
zh_hans: :func:`~django.forms.models.modelform_factory` 现在尊重表单的 ``Meta`` 中的 ``formfield_callback`` 属性。

source: Added support and translations for the Central Kurdish (Sorani) language.
zh_hans: 增加了对中央库尔德语（索拉尼方言）的支持和翻译。

source: The :ref:`django-db-logger` logger now logs transaction management queries (``BEGIN``, ``COMMIT``, and ``ROLLBACK``) at the ``DEBUG`` level.
zh_hans: :ref:`django-db-logger` 记录器现在以 ``DEBUG`` 级别记录事务管理查询（``BEGIN``、``COMMIT`` 和 ``ROLLBACK``）。

source: :djadmin:`makemessages` command now supports locales with private sub-tags such as ``nl_NL-x-informal``.
zh_hans: :djadmin:`makemessages` 命令现在支持具有私有子标记的区域设置，例如 ``nl_NL-x-informal``。

source: The new :option:`makemigrations --update` option merges model changes into the latest migration and optimizes the resulting operations.
zh_hans: 新的 :option:`makemigrations --update` 选项将模型更改合并到最新的迁移中，并优化生成的操作。

source: Migrations now support serialization of ``enum.Flag`` objects.
zh_hans: 迁移现在支持对 ``enum.Flag`` 对象的序列化。

source: ``QuerySet`` now extensively supports filtering against :ref:`window-functions` with the exception of disjunctive filter lookups against window functions when performing aggregation.
zh_hans: ``QuerySet`` 现在在除执行聚合时的窗口函数的析取过滤查询外，广泛支持与 :ref:`window-functions` 进行过滤。

source: :meth:`~.QuerySet.prefetch_related` now supports :class:`~django.db.models.Prefetch` objects with sliced querysets.
zh_hans: :meth:`~.QuerySet.prefetch_related` 现在支持带有切片查询集的 :class:`~django.db.models.Prefetch` 对象。

source: :ref:`Registering lookups <lookup-registration-api>` on :class:`~django.db.models.Field` instances is now supported.
zh_hans: 现在支持在 :class:`~django.db.models.Field` 实例上 :ref:`注册查找 <lookup-registration-api>`。

source: The new ``robust`` argument for :func:`~django.db.transaction.on_commit` allows performing actions that can fail after a database transaction is successfully committed.
zh_hans: 新的 ``robust`` 参数用于 :func:`~django.db.transaction.on_commit`，允许在数据库事务成功提交后执行可能失败的操作。

source: The new :class:`KT() <django.db.models.fields.json.KT>` expression represents the text value of a key, index, or path transform of :class:`~django.db.models.JSONField`.
zh_hans: 新的 :class:`KT() <django.db.models.fields.json.KT>` 表达式表示 :class:`~django.db.models.JSONField` 的键、索引或路径转换的文本值。

source: :class:`~django.db.models.functions.Now` now supports microsecond precision on MySQL and millisecond precision on SQLite.
zh_hans: :class:`~django.db.models.functions.Now` 现在在 MySQL 上支持微秒精度，在 SQLite 上支持毫秒精度。

source: :class:`F() <django.db.models.F>` expressions that output ``BooleanField`` can now be negated using ``~F()`` (inversion operator).
zh_hans: :class:`F() <django.db.models.F>` 表达式输出的 ``BooleanField`` 现在可以使用 ``~F()`` （取反操作符）进行取反。

source: ``Model`` now provides asynchronous versions of some methods that use the database, using an ``a`` prefix: :meth:`~.Model.adelete`, :meth:`~.Model.arefresh_from_db`, and :meth:`~.Model.asave`.
zh_hans: ``Model`` 现在提供了一些使用数据库的方法的异步版本，使用 ``a`` 前缀：:meth:`~.Model.adelete`、:meth:`~.Model.arefresh_from_db` 和 :meth:`~.Model.asave`。

source: Related managers now provide asynchronous versions of methods that change a set of related objects, using an ``a`` prefix: :meth:`~.RelatedManager.aadd`, :meth:`~.RelatedManager.aclear`, :meth:`~.RelatedManager.aremove`, and :meth:`~.RelatedManager.aset`.
zh_hans: Related 管理器现在提供了一些更改相关对象集合的异步方法，使用 ``a`` 前缀：:meth:`~.RelatedManager.aadd`、:meth:`~.RelatedManager.aclear`、:meth:`~.RelatedManager.aremove` 和 :meth:`~.RelatedManager.aset`。

source: :attr:`CharField.max_length <django.db.models.CharField.max_length>` is no longer required to be set on PostgreSQL, which supports unlimited ``VARCHAR`` columns.
zh_hans: :attr:`CharField.max_length <django.db.models.CharField.max_length>` 不再需要在 PostgreSQL 上设置，因为它支持无限长度的 ``VARCHAR`` 列。

source: :class:`~django.http.StreamingHttpResponse` now supports async iterators when Django is served via ASGI.
zh_hans: :class:`~django.http.StreamingHttpResponse` 现在在通过 ASGI 提供服务时支持异步迭代器。

source: The :option:`test --debug-sql` option now formats SQL queries with ``sqlparse``.
zh_hans: :option:`test --debug-sql` 选项现在使用 ``sqlparse`` 格式化 SQL 查询。

source: The :class:`~django.test.RequestFactory`, :class:`~django.test.AsyncRequestFactory`, :class:`~django.test.Client`, and :class:`~django.test.AsyncClient` classes now support the ``headers`` parameter, which accepts a dictionary of header names and values. This allows a more natural syntax for declaring headers.
zh_hans: :class:`~django.test.RequestFactory`、:class:`~django.test.AsyncRequestFactory`、:class:`~django.test.Client` 和 :class:`~django.test.AsyncClient` 类现在支持 ``headers`` 参数，它接受一个包含头部名称和值的字典。这允许更自然的语法来声明头部。

source: The new ``encoder`` parameter for :meth:`django.utils.html.json_script` function allows customizing a JSON encoder class.
zh_hans: :meth:`django.utils.html.json_script` 函数的新参数 ``encoder`` 允许自定义 JSON 编码器类。

source: The private internal vendored copy of ``urllib.parse.urlsplit()`` now strips ``'\r'``, ``'\n'``, and ``'\t'`` (see :cve:`2022-0391` and :bpo:`43882`). This is to protect projects that may be incorrectly using the internal ``url_has_allowed_host_and_scheme()`` function, instead of using one of the documented functions for handling URL redirects. The Django functions were not affected.
zh_hans: 私有的内部 vendored 版本的 ``urllib.parse.urlsplit()`` 现在会删除 ``'\r'``、``'\n'`` 和 ``'\t'`` （参见 :cve:`2022-0391` 和 :bpo:`43882`）。这是为了保护可能错误使用内部 ``url_has_allowed_host_and_scheme()`` 函数而不是使用文档中记录的处理 URL 重定向的函数的项目。Django 的函数没有受到影响。

source: The new :func:`django.utils.http.content_disposition_header` function returns a ``Content-Disposition`` HTTP header value as specified by :rfc:`6266`.
zh_hans: 新的 :func:`django.utils.http.content_disposition_header` 函数返回根据 :rfc:`6266` 规定的 ``Content-Disposition`` HTTP 标头值。

source: The list of common passwords used by ``CommonPasswordValidator`` is updated to the most recent version.
zh_hans: ``CommonPasswordValidator`` 使用的常见密码列表已更新为最新版本。

source: Backwards incompatible changes in 4.2
zh_hans: Django 4.2 中的不向后兼容的变更

source: ``DatabaseFeatures.allows_group_by_pk`` is removed as it only remained to accommodate a MySQL extension that has been supplanted by proper functional dependency detection in MySQL 5.7.15. Note that ``DatabaseFeatures.allows_group_by_selected_pks`` is still supported and should be enabled if your backend supports functional dependency detection in ``GROUP BY`` clauses as specified by the ``SQL:1999`` standard.
zh_hans: ``DatabaseFeatures.allows_group_by_pk`` 已被移除，因为它仅保留以适应一个已被 MySQL 5.7.15 中正确的功能依赖检测所取代的 MySQL 扩展。请注意，仍然支持 ``DatabaseFeatures.allows_group_by_selected_pks``，如果您的后端支持 ``GROUP BY`` 子句中的功能依赖检测，应该启用它，如 ``SQL:1999`` 标准所规定的。

source: :djadmin:`inspectdb` now uses ``display_size`` from ``DatabaseIntrospection.get_table_description()`` rather than ``internal_size`` for ``CharField``.
zh_hans: :djadmin:`inspectdb` 现在使用 ``DatabaseIntrospection.get_table_description()`` 中的 ``display_size``，而不是 ``internal_size`` 用于 ``CharField``。

source: Dropped support for MariaDB 10.3
zh_hans: 不再支持 MariaDB 10.3

source: Upstream support for MariaDB 10.3 ends in May 2023. Django 4.2 supports MariaDB 10.4 and higher.
zh_hans: MariaDB 10.3 的上游支持将于 2023 年 5 月结束。 Django 4.2 支持 MariaDB 10.4 及更高版本。

source: Dropped support for MySQL 5.7
zh_hans: 不再支持 MySQL 5.7

source: Upstream support for MySQL 5.7 ends in October 2023. Django 4.2 supports MySQL 8 and higher.
zh_hans: MySQL 5.7 的上游支持将于 2023 年 10 月结束。 Django 4.2 支持 MySQL 8 及更高版本。

source: Dropped support for PostgreSQL 11
zh_hans: 不再支持 PostgreSQL 11

source: Upstream support for PostgreSQL 11 ends in November 2023. Django 4.2 supports PostgreSQL 12 and higher.
zh_hans: PostgreSQL 11 的上游支持将于 2023 年 11 月结束。 Django 4.2 支持 PostgreSQL 12 及更高版本。

source: Setting ``update_fields`` in ``Model.save()`` may now be required
zh_hans: 在 ``Model.save()`` 中设置 ``update_fields`` 可能现在是必需的

source: In order to avoid updating unnecessary columns, :meth:`.QuerySet.update_or_create` now passes ``update_fields`` to the :meth:`Model.save() <django.db.models.Model.save>` calls. As a consequence, any fields modified in the custom ``save()`` methods should be added to the ``update_fields`` keyword argument before calling ``super()``. See :ref:`overriding-model-methods` for more details.
zh_hans: 为了避免更新不必要的列，:meth:`.QuerySet.update_or_create` 现在将 ``update_fields`` 传递给 :meth:`Model.save() <django.db.models.Model.save>` 调用。因此，在调用 ``super()`` 之前，应该将在自定义的 ``save()`` 方法中修改的任何字段添加到 ``update_fields`` 关键字参数中。详细信息请参阅 :ref:`overriding-model-methods`。

source: Dropped support for raw aggregations on MySQL
zh_hans: 在 MySQL 上取消了对原始聚合的支持

source: MySQL 8+ allows functional dependencies on ``GROUP BY`` columns, so the pre-Django 4.2 workaround of grouping by primary keys of the main table is removed. As a consequence, using ``RawSQL()`` aggregations is no longer supported on MySQL as there is no way to determine if such aggregations are needed or valid in the ``GROUP BY`` clause. Use :ref:`aggregation-functions` instead.
zh_hans: MySQL 8+ 允许在 ``GROUP BY`` 列上使用函数依赖，因此在 Django 4.2 之前的版本中通过对主表的主键进行分组的解决方法已被移除。因此，在 MySQL 上不再支持使用 ``RawSQL()`` 进行聚合，因为无法确定这些聚合是否在 ``GROUP BY`` 子句中需要或有效。请改用 :ref:`聚合函数`。

source: The undocumented ``django.http.multipartparser.parse_header()`` function is removed. Use ``django.utils.http.parse_header_parameters()`` instead.
zh_hans: 未记录的 ``django.http.multipartparser.parse_header()`` 函数已被移除。请改用 ``django.utils.http.parse_header_parameters()``。

source: :ttag:`{% blocktranslate asvar … %}<blocktranslate>` result is now marked as safe for (HTML) output purposes.
zh_hans: :ttag:`{% blocktranslate asvar … %}<blocktranslate>` 的结果现在被标记为适用于（HTML）输出目的的安全内容。

source: The ``autofocus`` HTML attribute in the admin search box is removed as it can be confusing for screen readers.
zh_hans: 在管理界面的搜索框中移除了 ``autofocus`` HTML 属性，因为它对屏幕阅读器可能会造成困惑。

source: The :option:`makemigrations --check` option no longer creates missing migration files.
zh_hans: :option:`makemigrations --check` 选项不再创建缺失的迁移文件。

source: The ``alias`` argument for :meth:`.Expression.get_group_by_cols` is removed.
zh_hans: :meth:`.Expression.get_group_by_cols` 的 ``alias`` 参数已被移除。

source: The minimum supported version of ``sqlparse`` is increased from 0.2.2 to 0.3.1.
zh_hans: ``sqlparse`` 的最低支持版本已从 0.2.2 增加到 0.3.1。

source: The undocumented ``negated`` parameter of the :class:`~django.db.models.Exists` expression is removed.
zh_hans: :class:`~django.db.models.Exists` 表达式的未记录的 ``negated`` 参数已被移除。

source: The ``is_summary`` argument of the undocumented ``Query.add_annotation()`` method is removed.
zh_hans: 未记录的 ``Query.add_annotation()`` 方法的 ``is_summary`` 参数已被移除。

source: The minimum supported version of SQLite is increased from 3.9.0 to 3.21.0.
zh_hans: 最低支持的 SQLite 版本从 3.9.0 提高到 3.21.0 。

source: The minimum supported version of ``asgiref`` is increased from 3.5.2 to 3.6.0.
zh_hans: ``asgiref`` 的最低支持版本已从 3.5.2 增加到 3.6.0。

source: :class:`~django.contrib.auth.forms.UserCreationForm` now rejects usernames that differ only in case. If you need the previous behavior, use :class:`~django.contrib.auth.forms.BaseUserCreationForm` instead.
zh_hans: :class:`~django.contrib.auth.forms.UserCreationForm` 现在拒绝仅在大小写上不同的用户名。如果需要之前的行为，请改用 :class:`~django.contrib.auth.forms.BaseUserCreationForm`。

source: The minimum supported version of ``mysqlclient`` is increased from 1.4.0 to 1.4.3.
zh_hans: ``mysqlclient`` 的最低支持版本从 1.4.0 增加到 1.4.3。

source: The minimum supported version of ``argon2-cffi`` is increased from 19.1.0 to 19.2.0.
zh_hans: ``argon2-cffi`` 的最低支持版本已从 19.1.0 增加到 19.2.0。

source: The minimum supported version of ``Pillow`` is increased from 6.2.0 to 6.2.1.
zh_hans: ``Pillow`` 的最低支持版本已从 6.2.0 增加到 6.2.1。

source: The minimum supported version of ``jinja2`` is increased from 2.9.2 to 2.11.0.
zh_hans: ``jinja2`` 的最低支持版本已从 2.9.2 增加到 2.11.0。

source: The minimum supported version of :pypi:`redis-py <redis>` is increased from 3.0.0 to 3.4.0.
zh_hans: :pypi:`redis-py <redis>` 的最低支持版本已从 3.0.0 增加到 3.4.0。

source: Manually instantiated ``WSGIRequest`` objects must be provided a file-like object for ``wsgi.input``. Previously, Django was more lax than the expected behavior as specified by the WSGI specification.
zh_hans: 手动实例化的 ``WSGIRequest`` 对象必须为 ``wsgi.input`` 提供一个类似文件的对象。之前，Django 对于 WSGI 规范中指定的预期行为更加宽松。

source: Support for ``PROJ`` < 5 is removed.
zh_hans: 已移除对 ``PROJ`` 版本低于 5 的支持。

source: :class:`~django.core.mail.backends.smtp.EmailBackend` now verifies a :py:attr:`hostname <ssl.SSLContext.check_hostname>` and :py:attr:`certificates <ssl.SSLContext.verify_mode>`. If you need the previous behavior that is less restrictive and not recommended, subclass ``EmailBackend`` and override the ``ssl_context`` property.
zh_hans: :class:`~django.core.mail.backends.smtp.EmailBackend` 现在验证 :py:attr:`hostname <ssl.SSLContext.check_hostname>` 和 :py:attr:`certificates <ssl.SSLContext.verify_mode>`。如果你需要以前不那么严格且不推荐的行为，可以子类化 ``EmailBackend`` 并重写 ``ssl_context`` 属性。

source: Features deprecated in 4.2
zh_hans: 在 4.2 版本中弃用的功能

source: ``index_together`` option is deprecated in favor of ``indexes``
zh_hans: ``index_together`` 选项已被弃用，推荐使用 ``indexes``

source: Migrating existing ``index_together`` should be handled as a migration. For example::
zh_hans: 迁移现有的 ``index_together`` 应该作为一个迁移来处理。例如：

source: Should become::
zh_hans: 应该变成：

source: Running the :djadmin:`makemigrations` command will generate a migration containing a :class:`~django.db.migrations.operations.RenameIndex` operation which will rename the existing index. Next, consider squashing migrations to remove ``index_together`` from historical migrations.
zh_hans: 运行 :djadmin:`makemigrations` 命令将生成一个迁移，其中包含一个 :class:`~django.db.migrations.operations.RenameIndex` 操作，用于重命名现有的索引。接下来，考虑合并迁移以从历史迁移中移除 ``index_together``。

source: The ``AlterIndexTogether`` migration operation is now officially supported only for pre-Django 4.2 migration files. For backward compatibility reasons, it's still part of the public API, and there's no plan to deprecate or remove it, but it should not be used for new migrations. Use :class:`~django.db.migrations.operations.AddIndex` and :class:`~django.db.migrations.operations.RemoveIndex` operations instead.
zh_hans: ``AlterIndexTogether`` 迁移操作现在官方上仅支持用于 Django 4.2 之前的迁移文件。出于向后兼容性的原因，它仍然是公共 API 的一部分，没有计划弃用或移除它，但不应该在新的迁移中使用。应该使用 :class:`~django.db.migrations.operations.AddIndex` 和 :class:`~django.db.migrations.operations.RemoveIndex` 操作代替。

source: Passing encoded JSON string literals to ``JSONField`` is deprecated
zh_hans: 传递编码的 JSON 字符串文字给 ``JSONField`` 已被弃用

source: ``JSONField`` and its associated lookups and aggregates used to allow passing JSON encoded string literals which caused ambiguity on whether string literals were already encoded from database backend's perspective.
zh_hans: ``JSONField`` 及其相关的查找和聚合操作曾允许传递 JSON 编码的字符串文字，这导致了在数据库后端的角度上对字符串文字是否已经编码的歧义。

source: During the deprecation period string literals will be attempted to be JSON decoded and a warning will be emitted on success that points at passing non-encoded forms instead.
zh_hans: 在弃用期间，将尝试对字符串字面值进行 JSON 解码，并在成功时发出警告，指出应传递非编码形式的内容。

source: Code that used to pass JSON encoded string literals::
zh_hans: 曾经用于传递 JSON 编码的字符串文字的代码：

source: From Django 5.1+ string literals will be implicitly interpreted as JSON string literals.
zh_hans: 从 Django 5.1+ 开始，字符串字面值将被隐式解释为 JSON 字符串字面值。

source: The ``BaseUserManager.make_random_password()`` method is deprecated. See `recipes and best practices <https://docs.python.org/3/library/secrets.html#recipes-and-best-practices>`_ for using Python's :py:mod:`secrets` module to generate passwords.
zh_hans: ``BaseUserManager.make_random_password()`` 方法已被弃用。请参阅 `Python 的 secrets 模块的文档 <https://docs.python.org/3/library/secrets.html#recipes-and-best-practices>`_ 了解如何使用 Python 的 :py:mod:`secrets` 模块生成密码的示例和最佳实践。

source: The ``length_is`` template filter is deprecated in favor of :tfilter:`length` and the ``==`` operator within an :ttag:`{% if %}<if>` tag. For example
zh_hans: ``length_is`` 模板过滤器已被弃用，推荐使用 :tfilter:`length` 和在 :ttag:`{% if %}<if>` 标签内使用 ``==`` 运算符。例如：

source: instead of:
zh_hans: 而不是：

source: ``django.contrib.auth.hashers.SHA1PasswordHasher``, ``django.contrib.auth.hashers.UnsaltedSHA1PasswordHasher``, and ``django.contrib.auth.hashers.UnsaltedMD5PasswordHasher`` are deprecated.
zh_hans: ``django.contrib.auth.hashers.SHA1PasswordHasher``、``django.contrib.auth.hashers.UnsaltedSHA1PasswordHasher`` 和 ``django.contrib.auth.hashers.UnsaltedMD5PasswordHasher`` 已被弃用。

source: ``django.contrib.postgres.fields.CICharField`` is deprecated in favor of ``CharField(db_collation="…")`` with a case-insensitive non-deterministic collation.
zh_hans: ``django.contrib.postgres.fields.CICharField`` 已被弃用，推荐使用 ``CharField(db_collation="…")``，并指定一个不区分大小写的非确定性排序规则(collation)。
