Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``yaml.load`` is able to construct any Python object, which may trigger arbitrary code execution if you process a YAML document that comes from an untrusted source. This feature isn't necessary for Django's YAML deserializer, whose primary use is to load fixtures consisting of simple objects. Even though fixtures are trusted data, the YAML deserializer now uses ``yaml.safe_load`` for additional security.
id: ``yaml.load`` dapat membangun obyek Python aapun, yang mungkin memicu pengerjaan kode berubah-ubah jika anda mengolah dokumen YAML yang datang dari sumber yang tidak dipercaya. Fitur ini tidak diperlukan untuk deserialisasi YAML Django, yang penggunaan utama adalah memuat perlengkapan terdiri dari obyek sederhana. Bahkan meskipun perlengkapan adalah data dipercaya, pendeserialisasi YAML sekarang menggunakan ``yaml.safe_load`` untuk keamanan tambahan.
zh_hans: ``yaml.load`` 能够构造任何 Python 对象，如果处理来自不受信任的源的 YAML 文档，可能触发任意代码执行。这个特性对于 Django 的 YAML 反序列化器并不必要，因为它的主要用途是加载由简单对象组成的 fixture。尽管 fixture 是可信数据，但 YAML 反序列化器现在使用 ``yaml.safe_load`` 来提供额外的安全性。

source: Session cookies now have the ``httponly`` flag by default
id: Kue sesi sekarang mempunyai bendera ``httponly`` secara awalan
zh_hans: 会话 cookie 现在默认情况下具有 ``httponly`` 标志

source: Session cookies now include the ``httponly`` attribute by default to help reduce the impact of potential XSS attacks. As a consequence of this change, session cookie data, including ``sessionid``, is no longer accessible from JavaScript in many browsers. For strict backwards compatibility, use ``SESSION_COOKIE_HTTPONLY = False`` in your settings file.
zh_hans: 为了减少潜在的 XSS 攻击影响，会话 cookie 现在默认包含 ``httponly`` 属性。由于这个改变，许多浏览器中的 JavaScript 不再可以访问会话 cookie 数据，包括 ``sessionid``。为了严格的向后兼容性，在您的设置文件中使用 ``SESSION_COOKIE_HTTPONLY = False``。

source: The :tfilter:`urlize` filter no longer escapes every URL
id: Penyaring :tfilter:`urlize` tidak lagi meloloskan setiap URL
zh_hans: :tfilter:`urlize` 过滤器不再对每个 URL 进行转义

source: When a URL contains a ``%xx`` sequence, where ``xx`` are two hexadecimal digits, :tfilter:`urlize` now assumes that the URL is already escaped and doesn't apply URL escaping again. This is wrong for URLs whose unquoted form contains a ``%xx`` sequence, but such URLs are very unlikely to happen in the wild, because they would confuse browsers too.
id: Ketika URL mengandung urutan ``%xx``, dimana ``xx`` adalah dua angka heksadesimal. :tfilter:`urlize` sekarang menganggap bahwa URL sudah lolos dan tidak memberlakukan pelolosan URL kembali. Ini adalah salah untuk URL yang formulir tidak dikutipnya mengandung urutan ``%xx``, tetapi URL tersebut sangat tidak mungkin terjadi di tidak teratur, karena mereka akan membingunkan peramban juga.
zh_hans: 当一个 URL 包含一个 ``%xx`` 序列，其中 ``xx`` 是两个十六进制数字时，:tfilter:`urlize` 现在假定该 URL 已经被转义，不会再次应用 URL 转义。这对于其未引用形式包含 ``%xx`` 序列的 URL 是不正确的，但这种情况在实际使用中非常罕见，因为它们也会混淆浏览器。

source: ``assertTemplateUsed`` and ``assertTemplateNotUsed`` as context manager
id: ``assertTemplateUsed`` dan ``assertTemplateNotUsed`` sebagai pengelola konteks
zh_hans: ``assertTemplateUsed`` 和 ``assertTemplateNotUsed`` 现在作为上下文管理器可用

source: It's now possible to check whether a template was used within a block of code with :meth:`~django.test.SimpleTestCase.assertTemplateUsed` and :meth:`~django.test.SimpleTestCase.assertTemplateNotUsed`. And they can be used as a context manager::
id: Sekarang memungkinkan memeriksa apakah cetakan telah digunakan dalam blok kode dengan :meth:`~django.test.SimpleTestCase.assertTemplateUsed` dan :meth:`~django.test.SimpleTestCase.assertTemplateNotUsed`. Dan mereka dapat digunakan sebagai pengelola konteks::
zh_hans: 现在可以使用 :meth:`~django.test.SimpleTestCase.assertTemplateUsed` 和 :meth:`~django.test.SimpleTestCase.assertTemplateNotUsed` 来检查模板是否在代码块中被使用，并且它们可以作为上下文管理器使用：

source: See the :ref:`assertion documentation<assertions>` for more.
id: Lihat :ref:`assertion documentation<assertions>` untuk lebih.
zh_hans: 更多信息请查看 :ref:`断言文档 <assertions>`。

source: Database connections after running the test suite
id: Sambungan absisdata setelah menjalankan rangkaian percobaan
zh_hans: 运行测试套件后的数据库连接

source: The default test runner no longer restores the database connections after tests' execution. This prevents the production database from being exposed to potential threads that would still be running and attempting to create new connections.
id: Penjalan percobaan awalan tidak lagi menyimpan kembali hubungan basisdata setelah pengerjaan percobaan. Ini mencegah basisdata produksi dari menjadi terbuka pada kemungkinan ancaman yang akan masih berjalan dan berusaha untuk membuat hubungan baru.
zh_hans: 默认的测试运行器在测试执行后不再恢复数据库连接。这可以防止生产数据库暴露给可能仍在运行并尝试创建新连接的潜在线程。

source: If your code relied on connections to the production database being created after tests' execution, then you can restore the previous behavior by subclassing ``DjangoTestRunner`` and overriding its ``teardown_databases()`` method.
id: Jika kode anda bergantung pada hubungan ke basisdata produksi sedang dibuat setelah pengerjaan percobaan, kemudian anda dapat menyimpan kembali perilaku sebelumnya dengan mensubkelaskan ``DjangoTestRunner`` dan menimpa metode ``teardown_databases()`` nya.
zh_hans: 如果您的代码依赖于在测试执行后创建到生产数据库的连接，那么您可以通过子类化 ``DjangoTestRunner`` 并重写其 ``teardown_databases()`` 方法来恢复以前的行为。

source: Output of :djadmin:`manage.py help <help>`
id: Keluaran dari :djadmin:`manage.py help <help>`
zh_hans: :djadmin:`manage.py help <help>` 的输出

source: :djadmin:`manage.py help <help>` now groups available commands by application. If you depended on the output of this command -- if you parsed it, for example -- then you'll need to update your code. To get a list of all available management commands in a script, use :djadmin:`manage.py help --commands <help>` instead.
id: :djadmin:`manage.py help <help>` sekarang mengelompokkan perintah tersedia oleh aplikasi. Jika anda bergantung pada keluaran dari perintah ini -- jika anda mengurainya -- kemudian anda akan butuh memperbaharui kode anda. Untuk mendapatkan daftar dari semua perintah pengelolaan yang tersedia di tulisan, gunakan :djadmin:`manage.py help --commands <help>` sebagai gantinya.
zh_hans: :djadmin:`manage.py help <help>` 现在按应用程序分组列出可用命令。如果你依赖于此命令的输出，例如进行解析，那么你需要更新你的代码。要在脚本中获取所有可用管理命令的列表，请改用 :djadmin:`manage.py help --commands <help>`。

source: ``extends`` template tag
id: Etiket cetakan ``extends``
zh_hans: ``extends`` 模板标签

source: Previously, the :ttag:`extends` tag used a buggy method of parsing arguments, which could lead to it erroneously considering an argument as a string literal when it wasn't. It now uses ``parser.compile_filter``, like other tags.
id: Sebelumnya, etiket :ttag:`extends` menggunakan metode penuh kesalahan dalam mengurai argumen, yang dapat membawa ke keliruan itu mengingat sebuah argumen sebagai harfiah deretan karakter ketika itu bukan. Itu sekarang menggunakan ``parser.compile_filter``, seperti etiket lainnya.
zh_hans: 以前，:ttag:`extends` 标签使用了一种有缺陷的参数解析方法，这可能会导致它错误地将一个参数视为字符串文字，当它实际上不是字符串文字时。现在它使用 ``parser.compile_filter``，与其他标签类似。

source: The internals of the tag aren't part of the official stable API, but in the interests of full disclosure, the ``ExtendsNode.__init__`` definition has changed, which may break any custom tags that use this class.
id: Internal dari etiket bukan bagian dari API stabil resmi, tetapi dalam kepentingan dari penyingkapan penuh, pengertian ``ExtendsNode.__init__`` telah berubah, yang mungkin merusak tiap etiket penyesuaian yang menggungkan kelas ini.
zh_hans: 标签的内部不是官方稳定 API 的一部分，但为了充分披露，``ExtendsNode.__init__`` 的定义已更改，这可能会破坏使用此类的自定义标签。

source: Loading some incomplete fixtures no longer works
id: Memuat beberapa alat bantu yang tidak lengkap yang tidak lagi bekerja
zh_hans: 加载某些不完整的固件将不再工作

source: Prior to 1.4, a default value was inserted for fixture objects that were missing a specific date or datetime value when auto_now or auto_now_add was set for the field. This was something that should not have worked, and in 1.4 loading such incomplete fixtures will fail. Because fixtures are a raw import, they should explicitly specify all field values, regardless of field options on the model.
id: Sebelum 1.4, nilai awalan telah dimasukkan untuk obyek alat bantu yang telah kehilangan tanggal khusus atau nilai datetime ketika auto_now_add telah disetel untuk bidang. Ini adalah sesuatu yang harus tidak dikerjakan, dan di 1.4 memuat alat bantu seperti itu akan gagal. Karena alat bantu adalah impor mentah, mereka harus secara eksplisit menentukan semua nilai bidang, tanpa memperhatikan pilihan bidang pada model.
zh_hans: 在 1.4 之前，当字段设置了 auto _ now 或 auto _ now _ add 时，如果固件对象缺少特定的日期或日期时间值，则会插入一个默认值。这是本不应该工作的，而在 1.4 中，加载这样的不完整固件将会失败。因为固件是原始导入，所以它们应该明确指定所有字段值，而不考虑模型上的字段选项。

source: Development Server Multithreading
zh_hans: 开发服务器多线程

source: The development server is now is multithreaded by default. Use the :option:`runserver --nothreading` option to disable the use of threading in the development server:
zh_hans: 开发服务器现在默认为多线程模式。使用 :option:`runserver --nothreading` 选项来禁用开发服务器中的多线程。

source: Attributes disabled in markdown when safe mode set
id: Peniadaan atribut diturunkan ketika mode aman disetel
zh_hans: 在设置安全模式时，markdown 中的属性被禁用

source: Prior to Django 1.4, attributes were included in any markdown output regardless of safe mode setting of the filter. With version > 2.1 of the Python-Markdown library, an enable_attributes option was added. When the safe argument is passed to the markdown filter, both the ``safe_mode=True`` and ``enable_attributes=False`` options are set. If using a version of the Python-Markdown library less than 2.1, a warning is issued that the output is insecure.
id: Sebelum Django 1.4, atribut disertakan di tiap keluaran penurunan tanpa memperhatikan dari pengaturan suasana aman dari penyaring. Dengan versi > 2.1 dari pustaka Python-Markdown, sebuah pilihan enable_attributes telah ditambahkan. Ketika argumen aman dilewatkan ke penyaring penurunan, kedua pilihan ``safe_mode=True`` dan ``enable_attributes=False`` disetel. Jika menggunakan versi dari pustaka Python-Markdown kurang dari 2.1, sebuah peringatan diterbitkan yang keluarannya tidak aman.
zh_hans: 在 Django 1.4 之前，无论过滤器的 safe 模式设置如何，属性都会包含在任何 markdown 输出中。在 Python-Markdown 库的版本 > 2.1 中，添加了一个 enable_attributes 选项。如果将 safe 参数传递给 markdown 过滤器，则同时设置 ``safe_mode=True`` 和 ``enable_attributes=False`` 选项。如果使用的是 Python-Markdown 库的版本小于 2.1，则会发出一个警告，指出输出不安全。

source: FormMixin get_initial returns an instance-specific dictionary
id: get_initial FormMixin mengembalikan sebuah kamus khusus-instance
zh_hans: FormMixin 的 get_initial 返回特定实例的字典

source: In Django 1.3, the ``get_initial`` method of the :class:`django.views.generic.edit.FormMixin` class was returning the class ``initial`` dictionary. This has been fixed to return a copy of this dictionary, so form instances can modify their initial data without messing with the class variable.
id: Di Django 1.3, metode ``get_initial`` dari kelas :class:`django.views.generic.edit.FormMixin` telah mengembalikan kelas `initial`` kamus. Ini telah diperbaiki untuk mengembalikan salinan dari kamus ini, jadi formulir instance dapat merubah data inisial mereka tanpa mengacaukan dengan variabel kelas.
zh_hans: 在 Django 1.3 中，:class:`django.views.generic.edit.FormMixin` 类的 ``get_initial`` 方法返回了类变量 ``initial`` 字典。现在已修复为返回该字典的副本，因此表单实例可以修改其初始数据，而不会影响类变量。

source: Features deprecated in 1.4
id: Fitur usang di 1.4
zh_hans: 在 1.4 中被废弃的功能

source: Old styles of calling ``cache_page`` decorator
id: Gaya lama dari memanggil penghias ``cache_page``
zh_hans: 调用 ``cache_page`` 装饰器的旧样式是：

source: Some legacy ways of calling :func:`~django.views.decorators.cache.cache_page` have been deprecated. Please see the documentation for the correct way to use this decorator.
id: Beberapa cara warisan dari memanggil :func:`~django.views.decorators.cache.cache_page` telah diusangkan. Harap lihat dokumentasi untuk cara benar untuk menggunakan penghias ini.
zh_hans: 已经弃用了一些旧的调用 :func:`~django.views.decorators.cache.cache_page` 的方式。请查阅文档以了解正确使用此装饰器的方法。

source: Support for PostgreSQL versions older than 8.2
id: Mendukung untuk PostgreSQL versi lebih lama dari 8.2
zh_hans: 支持早于 8.2 版本的 PostgreSQL

source: Django 1.3 dropped support for PostgreSQL versions older than 8.0, and we suggested using a more recent version because of performance improvements and, more importantly, the end of upstream support periods for 8.0 and 8.1 was near (November 2010).
id: Django 1.3 membuang dukungan untuk versi PostgreSQL lebih lama dari 8.0, dan kami menyarankan menggunakan versi paling akhir karena dari penampilan perbaikan dan, lebih penting, akhir dari masa dukungan hulu untuk 8.0 dan 8.1 telah dekat (November 2010).
zh_hans: Django 1.3 放弃了对早于 8.0 版本的 PostgreSQL 的支持，我们建议使用更新的版本，因为性能得到了改进，更重要的是，8.0 和 8.1 的上游支持期即将结束（2010 年 11 月）。

source: Django 1.4 takes that policy further and sets 8.2 as the minimum PostgreSQL version it officially supports.
id: Django 1.4 mengambil kebijakan itu lebih jauh dan menyetel 8.2 sebagai versi PostgreSQL minimal itu secara resmi dukung.
zh_hans: Django 1.4 进一步执行了该政策，并将 8.2 设置为官方支持的最低 PostgreSQL 版本。

source: Request exceptions are now always logged
id: Permintaan pengecualian sekarang selalu dicatat
zh_hans: 请求异常现在总是被记录

source: When we added :doc:`logging support </topics/logging/>` in Django in 1.3, the admin error email support was moved into the :class:`django.utils.log.AdminEmailHandler`, attached to the ``'django.request'`` logger. In order to maintain the established behavior of error emails, the ``'django.request'`` logger was called only when :setting:`DEBUG` was ``False``.
id: Ketika kami menambahkan :doc:`logging support </topics/logging/>` di Django di 1.3, dukungan surel kesalahan admin telah dipindahkan kedalam :class:`django.utils.log.AdminEmailHandler`, dilampirkan ke pencatat ``'django.request'``. Untuk merawat kebiasan yang terbangun dari surel kesalahan, pencatat ``'django.request'`` dipanggil hanya ketika :setting:`DEBUG` adalah ``False``.
zh_hans: 当我们在 Django 1.3 中添加了 :doc:`日志支持 </topics/logging/>` 时，管理后台错误电子邮件支持被移动到 :class:`django.utils.log.AdminEmailHandler`，并附加到 ``'django.request'`` 记录器上。为了保持错误电子邮件的已建立行为，只有在 :setting:`DEBUG` 为 ``False`` 时才会调用 ``'django.request'`` 记录器。

source: To increase the flexibility of error logging for requests, the ``'django.request'`` logger is now called regardless of the value of :setting:`DEBUG`, and the default settings file for new projects now includes a separate filter attached to :class:`django.utils.log.AdminEmailHandler` to prevent admin error emails in ``DEBUG`` mode::
id: Untuk meningkatkan fleksibilitas dari pencatatan kesalahan untuk permintaan, pencatat ``'django.request'`` sekarang dipanggil tanpa memperhatikan nilai dari :setting:`DEBUG`, dan berkas pengaturan awalan untuk proyek baru sekarang menyertakan penyaring terpisah terlampir pada :class:`django.utils.log.AdminEmailHandler` untuk mencegah surel kesalahan admin di suasana ``DEBUG``::
zh_hans: 为了增加请求的错误日志记录的灵活性，现在无论 :setting:`DEBUG` 的值如何，都会调用 ``'django.request'`` 记录器，并且新项目的默认设置文件现在包括一个附加到 :class:`django.utils.log.AdminEmailHandler` 的独立过滤器，以防止在 ``DEBUG`` 模式下发送管理错误电子邮件：

source: If your project was created prior to this change, your :setting:`LOGGING` setting will not include this new filter. In order to maintain backwards-compatibility, Django will detect that your ``'mail_admins'`` handler configuration includes no ``'filters'`` section and will automatically add this filter for you and issue a pending-deprecation warning. This will become a deprecation warning in Django 1.5, and in Django 1.6 the backwards-compatibility shim will be removed entirely.
id: Jika proyek anda telah dibuat sebelum perubahan ini, pengaturan :setting:`LOGGING` anda tidak akan menyertakan penyaring baru ini. Untuk merawat kesesuaian-kebelakang, Django akan mengetahui bahwa konfigurasi penangan ``'mail_admins'`` anda tidak menyertakan bagian ``'filters'`` dan akan secara otomatis menambah penyaring ini untuk anda dan masalah peringatan pengusangan-tertunda. Ini akan menjadi peringatan pengusangan di Django 1.5, dan di Django 1.6 shim kesesuaian-kebelakang akan dipindahkan sepenuhnya.
zh_hans: 如果您的项目在这个改变之前创建的，那么您的 :setting:`LOGGING` 设置将不包括这个新的过滤器。为了保持向后兼容性，Django 将检测到您的 ``'mail_admins'`` 处理程序配置不包括 ``'filters'`` 部分，并将自动为您添加这个过滤器并发出一个即将弃用的警告。在 Django 1.5 中，这将成为一个弃用警告，在 Django 1.6 中，向后兼容性的 shim 将被完全移除。

source: The existence of any ``'filters'`` key under the ``'mail_admins'`` handler will disable this backward-compatibility shim and deprecation warning.
id: Kehadiran dari kunci ``'filters'`` apapun dibawah penangan ``'mail_admins'`` akan meniadakan shim kesesuaian-kebelakang ini dan peringatan pengusangan.
zh_hans: 在 ``'mail_admins'`` 处理程序下存在任何 ``'filters'`` 键将禁用这个向后兼容性 shim 和弃用警告。

source: Until Django 1.3, the ``include()``, ``patterns()``, and ``url()`` functions, plus :data:`~django.conf.urls.handler404` and :data:`~django.conf.urls.handler500` were located in a ``django.conf.urls.defaults`` module.
id: Sampai Django 1.3, fungsi-fungsi ``include()``, ``patterns()``, dan ``url()`` ditambah :data:`~django.conf.urls.handler404` dan :data:`~django.conf.urls.handler500` ditempatkan dalam modul ``django.conf.urls.defaults``.
zh_hans: 在 Django 1.3 之前，``include()``, ``patterns()``, 和 ``url()`` 函数，以及 :data:`~django.conf.urls.handler404` 和 :data:`~django.conf.urls.handler500` 都位于一个名为 ``django.conf.urls.defaults`` 的模块中。

source: In Django 1.4, they live in :mod:`django.conf.urls`.
id: Di Django 1.4, mereka berada di :mod:`django.conf.urls`.
zh_hans: 在 Django 1.4 中，它们位于 :mod:`django.conf.urls` 模块中。

source: Databrowse has not seen active development for some time, and this does not show any sign of changing. There had been a suggestion for a `GSOC project`_ to integrate the functionality of databrowse into the admin, but no progress was made. While Databrowse has been deprecated, an enhancement of ``django.contrib.admin`` providing a similar feature set is still possible.
id: Databrowse belum kelihatan pengembangan aktif untuk beberapa waktu, dan ini tidak menampilkan tanda apapun dari perubahan. Ada sebuah saran untuk `GSOC project`_ untuk memadukan kegunaan dari databrowse kedalam admin, tetapi tidak ada kemajuan yang dibuat. Selagi Databrowse telah diusangkan, sebuah peningkatan dari ``django.contrib.admin`` menyediakan sekumpulan fitur yang mirip masih memungkinkan.
zh_hans: Databrowse 已经有一段时间没有进行积极开发了，而且目前看来也没有改变的迹象。曾经有一个关于将 Databrowse 的功能整合到管理员界面的 `GSOC 项目`_ 的建议，但没有取得进展。虽然 Databrowse 已经被弃用，但仍然有可能通过增强 ``django.contrib.admin`` 来提供类似的功能集。

source: The code that powers Databrowse is licensed under the same terms as Django itself, so it's available to be adopted by an individual or group as a third-party project.
id: Kode yang memberikan daya Databrowse berlisensi dibawah ketentuan sama seperti Django itu sendiri, jadi itu tersedia untuk di pungut oleh perorangan atau kelompok sebagai proyek pihak-ketiga.
zh_hans: 支持 Databrowse 的代码在与 Django 相同的条款下获得许可，因此个人或团队可以将其作为第三方项目采用。

source: This function temporarily modified ``sys.path`` in order to make the parent "project" directory importable under the old flat :djadmin:`startproject` layout. This function is now deprecated, as its path workarounds are no longer needed with the new ``manage.py`` and default project layout.
id: Fungsi ini sementara merubah ``sys.path`` untuk membuat direktori "proyek" induk dapat diimpor dibawah tata letak datar :djadmin:`startproject` yang lama. Fungsi ini sekarang diusangkan, ketika pemecahan jalurnya tidak lagi dibutuhkan dengan ``manage.py`` baru dan tata letak proyek awalan.
zh_hans: 这个函数在旧的扁平 :djadmin:`startproject` 布局下，为了使父级 "project" 目录可导入，临时修改了 ``sys.path``。由于新的 ``manage.py`` 和默认项目布局不再需要路径的解决办法，因此此函数现在已经弃用。

source: This function was never documented or part of the public API, but it was widely recommended for use in setting up a "Django environment" for a user script. These uses should be replaced by setting the :envvar:`DJANGO_SETTINGS_MODULE` environment variable or using :func:`django.conf.settings.configure`.
zh_hans: 这个函数从未被文档化或列为公共 API 的一部分，但它曾广泛推荐用于为用户脚本设置 "Django 环境"。这些用法应该通过设置 :envvar:`DJANGO_SETTINGS_MODULE` 环境变量或使用 :func:`django.conf.settings.configure` 来替代。

source: This function was previously used by ``manage.py`` to execute a management command. It is identical to ``django.core.management.execute_from_command_line``, except that it first calls ``setup_environ``, which is now deprecated. As such, ``execute_manager`` is also deprecated; ``execute_from_command_line`` can be used instead. Neither of these functions is documented as part of the public API, but a deprecation path is needed due to use in existing ``manage.py`` files.
id: Fungsi ini sebelumnya digunakan oleh ``manage.py`` untuk menjalankan perintah pengelolaan. Itu mirip pada ``django.core.management.execute_from_command_line``, kecuali bahwa itu pertama memanggil ``setup_environ``, yang sekarang diusangkan. Dengan demikian, ``execute_manager`` juga diusangkan; ``execute_from_command_line`` dapat digunakan sebagai gantinya. Tidak ada dari fungsi ini didokumentasikan sebagai bagian dari API umum, tetapi jalur pengusangan dibutuhkan karena untuk digunakan di berkas ``manage.py`` yang ada.
zh_hans: 这个函数以前被 ``manage.py`` 用于执行管理命令。它与 ``django.core.management.execute_from_command_line`` 完全相同，只是它首先调用了 ``setup_environ``，而这个函数现在已经弃用。因此，``execute_manager`` 也已经弃用；可以使用 ``execute_from_command_line`` 代替。虽然这两个函数都没有被文档化为公共 API 的一部分，但由于在现有的 ``manage.py`` 文件中的使用，需要一个弃用路径。

source: ``is_safe`` and ``needs_autoescape`` attributes of template filters
id: Atribut `is_safe`` dan ``needs_autoescape`` dari cetakan penyaring
zh_hans: 模板过滤器的 ``is_safe`` 和 ``needs_autoescape`` 属性：

source: Two flags, ``is_safe`` and ``needs_autoescape``, define how each template filter interacts with Django's auto-escaping behavior. They used to be attributes of the filter function::
id: Dua bendera, ``is_safe`` dan``needs_autoescape``, menentukan bagaimana setiap penyaring cetakan berinteraksi dengan perilaku pelolosan-otomatis Django. Mereka digunakan untuk menjadi atribut dari fungsi penyaring::
zh_hans: 两个标志，``is_safe`` 和 ``needs_autoescape``，定义了每个模板过滤器与 Django 的自动转义行为的交互方式。它们以前是过滤器函数的属性：

source: However, this technique caused some problems in combination with decorators, especially :func:`@stringfilter <django.template.defaultfilters.stringfilter>`. Now, the flags are keyword arguments of :meth:`@register.filter <django.template.Library.filter>`::
id: Bagaimanapun, teknik ini menyebabkan beberapa masalah di perpaduan dengan penghias, khususnya :func:`@stringfilter <django.template.defaultfilters.stringfilter>`. Sekarang, bendera adalah argumen kata kunci dari :meth:`@register.filter <django.template.Library.filter>`::
zh_hans: 然而，这种技术在与装饰器结合使用时会引发一些问题，特别是 :func:`@stringfilter <django.template.defaultfilters.stringfilter>`。现在，这些标志是 :meth:`@register.filter <django.template.Library.filter>` 的关键字参数：

source: See :ref:`filters and auto-escaping <filters-auto-escaping>` for more information.
id: Lihat :ref:`filters and auto-escaping <filters-auto-escaping>` untuk informasi lebih.
zh_hans: 请参阅 :ref:`过滤器和自动转义 <filters-auto-escaping>` 以获取更多信息。

source: Wildcard expansion of application names in ``INSTALLED_APPS``
zh_hans: 在 ``INSTALLED_APPS`` 中应用程序名称的通配符扩展
