Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Given a form that uses ``ModelMultipleChoiceField`` and ``show_hidden_initial=True`` (not a documented API), it was possible for a user to cause an unreasonable number of SQL queries by submitting duplicate values for the field's data. The validation logic in ``ModelMultipleChoiceField`` now deduplicates submitted values to address this issue.
id: Diberikan sebuah formulir yang menggunakan ``ModelMultipleChoiceField`` dan ``show_hidden_initial=True`` (bukan sebuah dokumentasi API), itu memungkinkan untuk pengguna untuk menyebabkan angka tidak beralasan dari permintaan SQL dengan mengajukan penggandaan nilai untuk data bidang. Logika pengesahan di ``ModelMultipleChoiceField`` sekarang menghapus penggandaan nilai diajukan ke alamat masalah ini.
zh_hans: 针对使用 ``ModelMultipleChoiceField`` 并且使用 ``show_hidden_initial=True`` 的表单（这不是文档化的 API）可能会导致用户通过提交字段数据的重复值来引发不合理数量的 SQL 查询。``ModelMultipleChoiceField`` 中的验证逻辑现在会去重提交的值，以解决这个问题。

source: Django 1.6.11 release notes
id: Catatan terbitan Django 1.6.11
zh_hans: Django 1.6.11 版本发行说明

source: Django 1.6.11 fixes two security issues in 1.6.10.
id: Django 1.6.11 memperbaiki dua masalah keamanan di 1.6.10.
zh_hans: Django 1.6.11 修复了 1.6.10 版本中的两个安全问题。

source: Denial-of-service possibility with ``strip_tags()``
id: Kemungkinan denial-of-service dengan ``strip_tags()``
zh_hans: ``strip_tags()`` 存在拒绝服务的可能性

source: Last year :func:`~django.utils.html.strip_tags` was changed to work iteratively. The problem is that the size of the input it's processing can increase on each iteration which results in an infinite loop in ``strip_tags()``. This issue only affects versions of Python that haven't received :bpo:`a bugfix in HTMLParser <20288>`; namely Python < 2.7.7 and 3.3.5. Some operating system vendors have also backported the fix for the Python bug into their packages of earlier versions.
zh_hans: 去年 :func:`~django.utils.html.strip_tags` 被更改为迭代工作。问题在于它处理的输入大小可能在每次迭代中增加，这导致了 ``strip_tags()`` 中的无限循环。这个问题只影响那些没有收到 :bpo:`HTMLParser 中的 bug 修复 <20288>` 的 Python 版本，具体来说是 Python < 2.7.7 和 3.3.5。一些操作系统供应商也已经将修复 Python bug 的补丁合并到了早期版本的软件包中。

source: To remedy this issue, ``strip_tags()`` will now return the original input if it detects the length of the string it's processing increases. Remember that absolutely NO guarantee is provided about the results of ``strip_tags()`` being HTML safe. So NEVER mark safe the result of a ``strip_tags()`` call without escaping it first, for example with :func:`~django.utils.html.escape`.
id: Untuk memperbaiki masalah ini, ``strip_tags()`` akan sekarang mengembalikan masukan asli jika itu mengetahui panjang dari string itu sedang oleh meningkat. Ingat bahwa mutlak TIDAK ada jaminan disediakan tentang hasil dari ``strip_tags()`` menjadi aman HTML. jadi JANGAN PERNAH menandai aman hasil dari panggilan ``strip_tags()`` tanpa meloloskan itu pertama, sebagai contoh dengan :func:`~django.utils.html.escape`.
zh_hans: 为了解决这个问题，如果 ``strip_tags()`` 检测到正在处理的字符串长度增加，它将返回原始输入。请记住，关于 ``strip_tags()`` 的结果是否安全的 HTML 没有提供任何保证。因此，在标记 ``strip_tags()`` 调用的结果为安全 HTML 之前，绝对不要忘记首先进行转义，例如使用 :func:`~django.utils.html.escape`。

source: Django 1.6.2 release notes
id: Catatan terbitan Django 1.6.2
zh_hans: Django 1.6.2 版本发行说明

source: *February 6, 2014*
id: *Februari 6, 2014*
zh_hans: *2014 年 2 月 6 日*

source: This is Django 1.6.2, a bugfix release for Django 1.6. Django 1.6.2 fixes several bugs in 1.6.1:
id: Ini adalah Django 1.6.2, sebuah terbitan perbaikan kesalahan untuk Django 1.6. Django 1.6.2 memperbaiki beberapa kesalahan dalam 1.6.1:
zh_hans: 这是 Django 1.6.2，是 Django 1.6 的修复版本。 Django 1.6.2 修复了 1.6.1 版本中的一些错误：

source: Prevented the base geometry object of a prepared geometry to be garbage collected, which could lead to crash Django (:ticket:`21662`).
id: Dicegah obyek geometri dasar dari geometri yang disiapkan pada kumpulan sampah, yang dapat membawa pada kegagalan Django (:ticket:`21662`).
zh_hans: 防止了准备好的几何对象的基础几何对象被垃圾回收，这可能导致 Django 崩溃（:ticket:`21662`）。

source: Fixed a crash when executing the :djadmin:`changepassword` command when the user object representation contained non-ASCII characters (:ticket:`21627`).
id: Diperbaiki sebuah kegagalan ketika menjalankan perintah :djadmin:`changepassword` ketika perwakilan obyek user mengandung karakter bukan-ASCII (:ticket:`21627`).
zh_hans: 修复了在执行 :djadmin:`changepassword` 命令时，当用户对象的表示包含非 ASCII 字符时导致崩溃的问题（:ticket:`21627`）。

source: The :djadmin:`collectstatic` command will raise an error rather than default to using the current working directory if :setting:`STATIC_ROOT` is not set. Combined with the ``--clear`` option, the previous behavior could wipe anything below the current working directory (:ticket:`21581`).
id: Perintah :djadmin:`collectstatic` akan memunculkan sebuah kesalahan daripada awalan untuk menggunakan direktori yang bekerja saat ini jika :setting:`STATIC_ROOT` tidak disetel. Digabung dengan pilihan ``--clear``, perilaku sebelumnya dapat menghapus apapun dibawah direktori sedang bekerja saat ini (:ticket:`21581`).
zh_hans: 如果未设置 :setting:`STATIC_ROOT`，:djadmin:`collectstatic` 命令将引发错误，而不是默认使用当前工作目录。与 ``--clear`` 选项结合使用时，之前的行为可能会删除当前工作目录下的任何内容（:ticket:`21581`）。

source: Fixed mail encoding on Python 3.3.3+ (:ticket:`21093`).
id: Diperbaiki penyandian surat pada Python 3.3.3+ (:tiket:`21093`).
zh_hans: 在 Python 3.3.3+ 中修复了邮件编码问题（:ticket:`21093`）。

source: Fixed an issue where when ``settings.DATABASES['default']['AUTOCOMMIT'] = False``, the connection wasn't in autocommit mode but Django pretended it was.
id: Diperbaiki sebuah masalah dimana ketika ``settings.DATABASES['default']['AUTOCOMMIT'] = False``, hubungan tidak dalam suasana perbaikan otomatis tetapi Django berpura-pura seperti itu.
zh_hans: 修复了一个问题，当 ``settings.DATABASES['default']['AUTOCOMMIT'] = False`` 时，连接不处于自动提交模式，但 Django 假装它是的问题。

source: Fixed a regression in multiple-table inheritance ``exclude()`` queries (:ticket:`21787`).
id: Diperbaiki sebuah pemulihan di warisan banyak-tabel permintaan ``exclude()`` (:ticket:`21787`).
zh_hans: 修复了多表继承中的 ``exclude()`` 查询的回归问题（:ticket:`21787`）。

source: Added missing items to ``django.utils.timezone.__all__`` (:ticket:`21880`).
id: Menambahkan barang hilang ke ``django.utils.timezone.__all__`` (:tiket:`21880`).
zh_hans: 向 ``django.utils.timezone.__all__`` 添加了缺失的项（:ticket:`21880`）。

source: Fixed a field misalignment issue with ``select_related()`` and model inheritance (:ticket:`21413`).
id: Diperbaiki sebuah masalah bidang tidak sejajar dengan ``select_related()`` dan model warisan (:ticket:`21413`).
zh_hans: 修复了 ``select_related()`` 和模型继承中的字段不对齐问题（:ticket:`21413`）。

source: Fixed join promotion for negated ``AND`` conditions (:ticket:`21748`).
id: Diperbaiki dorongan join untuk meniadakan kondisi ``AND`` (:ticket:`21748`).
zh_hans: 修复了对否定的 ``AND`` 条件的联接提升问题（:ticket:`21748`）。

source: Oracle database introspection now works with boolean and float fields (:ticket:`19884`).
id: Interospeksi basisdata Oracle sekarang bekerja dengan bidang boolean dan float (:ticket:`19884`).
zh_hans: Oracle数据库的内省现在可以正常处理布尔和浮点字段了（:ticket:`19884`）。

source: Fixed an issue where lazy objects weren't actually marked as safe when passed through :func:`~django.utils.safestring.mark_safe` and could end up being double-escaped (:ticket:`21882`).
id: Diperbaiki sebuah masalah dimana obyek lazy tidak sebenarnya ditandai sebagai aman ketika melewatkan melalui :func:`~django.utils.safestring.mark_safe` dan dapat berakhir menjadi pelolosan-ganda (:ticket:`21882`).
zh_hans: 修复了一种情况，其中通过 :func:`~django.utils.safestring.mark_safe` 传递的惰性对象实际上没有被标记为安全，可能最终会被双重转义（:ticket:`21882`）。

source: Additionally, Django's vendored version of six, ``django.utils.six`` has been upgraded to the latest release (1.5.2).
id: Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.5.2).
zh_hans: 此外，Django 内部的 six 版本，即 ``django.utils.six``，已升级到最新版本（1.5.2）。

source: Django 1.6.3 release notes
id: Catatan terbitan Django 1.6.3
zh_hans: Django 1.6.3 版本发行说明

source: Django 1.6.3 fixes several bugs in 1.6.2, including three security issues, and makes one backwards-incompatible change:
id: Django 1.6.3. memperbaiki beberapa kesalahan di 1.6.2, termasuk tiga masalah keamanan, dan membuat satu perubahan ketidaksesuaian-kebelakang.
zh_hans: Django 1.6.3 修复了 1.6.2 版本中的一些错误，包括三个安全问题，并进行了一个不兼容的变更：

source: ``select_for_update()`` requires a transaction
id: ``select_for_update()`` membutuhkan sebuah transaksi
zh_hans: ``select_for_update()`` 需要在事务中使用

source: Historically, queries that use :meth:`~django.db.models.query.QuerySet.select_for_update()` could be executed in autocommit mode, outside of a transaction. Before Django 1.6, Django's automatic transactions mode allowed this to be used to lock records until the next write operation. Django 1.6 introduced database-level autocommit; since then, execution in such a context voids the effect of ``select_for_update()``. It is, therefore, assumed now to be an error and raises an exception.
id: Secara riwayat, permintaan yang menggunakan :meth:`~django.db.models.query.QuerySet.select_for_update()` dapat dijalankan dalam suasana pembetulan otomatis, diluar sebuah transaksi. Sebelum DJango 1.6, suasana transaksi otomatis Django mengizinkan ini digunakan untuk mengunci rekaman sampai tindakan menulis selanjutnya. Django 1.6 memperkenalkan pembetulan otomatis tingkat-basisdata; sejak itu, pengerjaan seperti konteks membatalkan pengaruh dari ``select_for_update()``. Itu adalah, karena itu, menganggap sekarang menjadi sebuah kesalahan dan memunculkan sebuah pengecualian.
zh_hans: 在历史上，使用 :meth:`~django.db.models.query.QuerySet.select_for_update()` 的查询可以在自动提交模式下，在事务之外执行。在 Django 1.6 之前，Django 的自动事务模式允许使用这种方式锁定记录，直到下一次写操作。Django 1.6 引入了数据库级别的自动提交；自那时起，在这种上下文中执行将取消 ``select_for_update()`` 的效果。因此，现在假定这是一个错误并引发异常。

source: This change was made because such errors can be caused by including an app which expects global transactions (e.g. :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` set to ``True``), or Django's old autocommit behavior, in a project which runs without them; and further, such errors may manifest as data-corruption bugs.
id: Perubahan ini telah dibuat karena kesalatan tersebut dapat disebabkan oleh menyertakan sebuah aplikasi yang mengharapkan transaksi global (sebagai contoh :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` disetel menjadi ``True``), perilaku pembetulan otomatis lama Django, di sebuah proyek yang berjalan tanpa mereka; dan lebih lanjut, kesalahan tersebut dapat nyata sebagai kesalahan kerusakan-data.
zh_hans: 这个更改是因为这样的错误可能是因为在不需要全局事务（例如，:setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` 设置为 ``True``）或 Django 的旧的自动提交行为的项目中包含一个期望全局事务的应用程序引起的；而且，这样的错误可能会表现为数据损坏的错误。

source: This change may cause test failures if you use ``select_for_update()`` in a test class which is a subclass of :class:`~django.test.TransactionTestCase` rather than :class:`~django.test.TestCase`.
id: Perubahan ini mungkin menyebabkan kegagalan percobaan jika anda menggunakan ``select_for_update()`` di kelas percobaan yaitu subkelas dari :class:`~django.test.TransactionTestCase` daripada :class:`~django.test.TestCase`.
zh_hans: 如果您在测试类中使用 ``select_for_update()`` 并且该测试类是 :class:`~django.test.TransactionTestCase` 的子类而不是 :class:`~django.test.TestCase`，则此更改可能导致测试失败。

source: Content retrieved from the GeoIP library is now properly decoded from its default ``iso-8859-1`` encoding (:ticket:`21996`).
id: Isi diambil dari pustaka GeoIP sekarang dengan benar diterjemahkan dari awalan penyandiannya ``iso-8859-1`` (:ticket:`21996`).
zh_hans: 从 GeoIP 库检索的内容现在已经正确解码为其默认的 ``iso-8859-1`` 编码（:ticket:`21996`）。

source: Fixed ``AttributeError`` when using :meth:`~django.db.models.query.QuerySet.bulk_create` with ``ForeignObject`` (:ticket:`21566`).
id: Diperbaiki ``AttributeError`` ketika menggunakan :meth:`~django.db.models.query.QuerySet.bulk_create` dengan ``ForeignObject`` (:ticket:`21566`).
zh_hans: 在使用 :meth:`~django.db.models.query.QuerySet.bulk_create` 与 ``ForeignObject`` 时，修复了 ``AttributeError`` 错误（:ticket:`21566`）。

source: Fixed crash of ``QuerySet``\s that use ``F() + timedelta()`` when their query was compiled more once (:ticket:`21643`).
id: Diperbaiki kegagalan dari ``QuerySet`` yang menggunakan ``F() + timedelta()`` ketika permintaan mereka telah disusun lebih dari sekali (:ticket:`21643`).
zh_hans: 修复了在查询编译多次时，使用 ``F() + timedelta()`` 的 ``QuerySet`` 引发崩溃的问题（:ticket:`21643`）。

source: Prevented custom ``widget`` class attribute of :class:`~django.forms.IntegerField` subclasses from being overwritten by the code in their ``__init__`` method (:ticket:`22245`).
id: Dicegah penyesuaian atribut kelas ``widget`` dari subkelas :class:`~django.forms.IntegerField` dari menjadi ditimpa dengan kode di metode ``__init__`` mereka (:ticket:`22245`).
zh_hans: 防止了 :class:`~django.forms.IntegerField` 子类的自定义 ``widget`` 类属性被其 ``__init__`` 方法中的代码覆盖的问题（:ticket:`22245`）。

source: Improved :func:`~django.utils.html.strip_tags` accuracy (but it still cannot guarantee an HTML-safe result, as stated in the documentation).
id: Ditingkatkan keakuratan :func:`~django.utils.html.strip_tags` (tetapi itu masih tidak dapat menjamin sebuah hasil aman-HTML, seperti dinyatakan di dokumentasi).
zh_hans: 提高了 :func:`~django.utils.html.strip_tags` 的准确性（但如文档中所述，它仍然不能保证产生 HTML 安全的结果）。

source: Fixed a regression in the :mod:`django.contrib.gis` SQL compiler for non-concrete fields (:ticket:`22250`).
id: Diperbaiki sebuah pemulihan di :mod:`django.contrib.gis` penyusun SQL untuk bidang bukan-nyata (:ticket:`22250`).
zh_hans: 修复了 :mod:`django.contrib.gis` 中 SQL 编译器的回归问题，针对非具体字段（:ticket:`22250`）。

source: Fixed :attr:`ModelAdmin.preserve_filters <django.contrib.admin.ModelAdmin.preserve_filters>` when running a site with a URL prefix (:ticket:`21795`).
id: Diperbaiki Fixed :attr:`ModelAdmin.preserve_filters <django.contrib.admin.ModelAdmin.preserve_filters>` ketika menjalankan situs dengan awalan URL (:ticket:`21795`).
zh_hans: 在带有 URL 前缀的站点中运行时修复了 :attr:`ModelAdmin.preserve_filters <django.contrib.admin.ModelAdmin.preserve_filters>` （:ticket:`21795`）。

source: Fixed a crash in the ``find_command`` management utility when the ``PATH`` environment variable wasn't set (:ticket:`22256`).
id: Diperbaiki sebuah kegagalan di ``find_command`` pengelolaan kegunaan ketika variabel lingkungan ``PATH`` tidak disetel (:ticket:`22256`).
zh_hans: 修复了在没有设置 ``PATH`` 环境变量时管理实用程序中的 ``find_command`` 引发的崩溃（:ticket:`22256`）。

source: Fixed :djadmin:`changepassword` on Windows (:ticket:`22364`).
id: Diperbaiki :djadmin:`changepassword` pada Windows (:tiket:`22364`).
zh_hans: 在 Windows 上修复了 :djadmin:`changepassword` （:ticket:`22364`）。

source: Avoided shadowing deadlock exceptions on MySQL (:ticket:`22291`).
id: Dihindari pengintaian pengecualian buntu pada MySQL (:ticket:`22291`).
zh_hans: 避免在 MySQL 上遮蔽死锁异常（:ticket:`22291`）。

source: Wrapped database exceptions in ``_set_autocommit`` (:ticket:`22321`).
id: Membungkus pengecualian basisdata di ``_set_autocommit`` (:ticket:`22321`).
zh_hans: 在 ``_set_autocommit`` 中包装数据库异常（:ticket:`22321`）。

source: Fixed atomicity when closing a database connection or when the database server disconnects (:ticket:`21239` and :ticket:`21202`)
id: Diperbaiki atomic ketika menutup hubungan basisdata atau ketika peladen basisdata terputus (:ticket:`21239` dan :ticket:`21202`)
zh_hans: 修复了在关闭数据库连接或数据库服务器断开连接时的原子性问题（:ticket:`21239` 和 :ticket:`21202`）。

source: Fixed regression in ``prefetch_related`` that caused the related objects query to include an unnecessary join (:ticket:`21760`).
id: Diperbaiki pemulihan di ``prefetch_related`` yang menyebabkan permintaan obyek terkait untuk menyertakan sebuah join yang tidak diperlukan (:ticket:`21760`).
zh_hans: 修复了 ``prefetch_related`` 中的回归问题，导致相关对象查询包括不必要的连接（:ticket:`21760`）。

source: Additionally, Django's vendored version of six, ``django.utils.six`` has been upgraded to the latest release (1.6.1).
id: Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.6.1).
zh_hans: 此外，Django 内部的 six 版本，即 ``django.utils.six``，已升级到最新版本（1.6.1）。

source: Django 1.6.4 release notes
id: Catatan terbitan Django 1.6.4
zh_hans: Django 1.6.4 版本发行说明

source: Django 1.6.4 fixes several bugs in 1.6.3.
id: Django 1.6.4 memperbaiki beberapa kesalahan di 1.6.3.
zh_hans: Django 1.6.4 修复了 1.6.3 版本中的一些错误。

source: Added backwards compatibility support for the :mod:`django.contrib.messages` cookie format of Django 1.4 and earlier to facilitate upgrading to 1.6 from 1.4 (:ticket:`22426`).
id: Ditambahkan dukungan kesesuaian kebelakang untuk bentuk kue :mod:`django.contrib.messages` dari Django 1.4 dan lebih awal untuk memfasilitasi peningkatan pada 1.6 dari 1.4 (:ticket:`22426`).
zh_hans: 为了便于从 Django 1.4 升级到 1.6，添加了对 Django 1.4 及更早版本的 :mod:`django.contrib.messages` 的 cookie 格式的向后兼容支持（:ticket:`22426`）。

source: Fixed the ``object_id`` of the ``LogEntry`` that's created after a user password change in the admin (:ticket:`22515`).
id: Diperbaiki ``object_id`` dari ``LogEntry`` yaitu dibuat setelah sandi pengguna berubah di admin (:ticket:`22515`).
zh_hans: 修复了在管理员更改用户密码后创建的 ``LogEntry`` 的 ``object_id`` （:ticket:`22515`）。

source: Django 1.6.5 release notes
id: Catatan terbitan Django 1.6.5
zh_hans: Django 1.6.5 版本发行说明

source: Django 1.6.5 fixes two security issues and several bugs in 1.6.4.
id: Django 1.6.5 memperbaiki beberapa masalah keamanan di 1.6.4.
zh_hans: Django 1.6.5 修复了 1.6.4 版本中的两个安全问题和一些错误。

source: Issue: Caches may incorrectly be allowed to store and serve private data
id: Masalah: Tembolok mungkin secara tidak benar mengizinkan untuk menyimpan dan melayani data pribadi
zh_hans: 问题：缓存可能会错误地被允许存储和提供私密数据。

source: Issue: Malformed redirect URLs from user input not correctly validated
id: Masalah: URL pengalihan yang jelek dari masukan pengguna tidak benar disahkan
zh_hans: 问题：未正确验证来自用户输入的格式错误的重定向 URL 。

source: Made the ``year_lookup_bounds_for_datetime_field`` Oracle backend method Python 3 compatible (:ticket:`22551`).
id: Dibuat metode backend Oracle ``year_lookup_bounds_for_datetime_field`` kesesuaian Python 3 (:ticket:`22551`).
zh_hans: 使 Oracle 后端的 ``year_lookup_bounds_for_datetime_field`` 方法兼容 Python 3（:ticket:`22551`）。

source: Fixed ``pgettext_lazy`` crash when receiving bytestring content on Python 2 (:ticket:`22565`).
id: Diperbaiki kegagalan ``pgettext_lazy`` ketika menerima isi bytestring pada Python 2 (:ticket:`22565`).
zh_hans: 修复了在 Python 2 上接收字节串内容时导致 ``pgettext_lazy`` 崩溃的问题（:ticket:`22565`）。

source: Fixed the SQL generated when filtering by a negated ``Q`` object that contains a ``F`` object. (:ticket:`22429`).
id: Diperbaiki SQL dibangkitkan ketika menyaring dengan meniadakan obyek ``Q`` yang mengandung sebuah obyek ``F`` (:ticket:`22429`).
zh_hans: 修复了在筛选中包含一个 ``F`` 对象的否定 ``Q`` 对象时生成的 SQL（:ticket:`22429`）。

source: Avoided overwriting data fetched by ``select_related()`` in certain cases which could cause minor performance regressions (:ticket:`22508`).
id: Dihindari menimpa data diambil dari ``select_related()`` di beberapa kasus yang dapat menyebabkan pemulihan penampilan kecil (:ticket:`22508`).
zh_hans: 在某些情况下避免覆盖由 ``select_related()`` 获取的数据，这可能会导致轻微的性能回退（:ticket:`22508`）。

source: Django 1.6.6 release notes
id: Catatan terbitan Django 1.6.6
zh_hans: Django 1.6.6 版本发行说明

source: Django 1.6.6 fixes several security issues and bugs in 1.6.5.
id: Django 1.6.6 memperbaiki beberapa masalah keamanan di 1.6.5.
zh_hans: Django 1.6.6 修复了 1.6.5 中的几个安全问题和错误。

source: In older versions of Django it was possible to reveal any field's data by modifying the "popup" and "to_field" parameters of the query string on an admin change form page. For example, requesting a URL like ``/admin/auth/user/?_popup=1&t=password`` and viewing the page's HTML allowed viewing the password hash of each user. While the admin requires users to have permissions to view the change form pages in the first place, this could leak data if you rely on users having access to view only certain fields on a model.
id: Di versi terlama dari Django dia memungkinkan untuk mengungkapkan tiap data bidang dengan merubah parameter "popup" dan "to_field" dari permintaan deretan karakter pada halaman formulir perubahan admin. Sebagai contoh, meminta URL seperti ``/admin/auth/user/?pop=1&t=password`` dan melihat halaman HTML diizinkan melihat acakan sandi dari tiap pengguna. Selagi admin membutuhkan pengguna untuk memiliki perizinan untuk melihat halaman formulir perubahan di tempat pertama, ini dapat menyebabkan data bocor jika anda bergantung pada pengguna mempunyai akses untuk melihat hanya bidang tertentu pada model.
zh_hans: 在较早的 Django 版本中，可以通过修改查询字符串上的 "popup" 和 "to_field" 参数来显示任何字段的数据，这可以在管理界面的更改表单页面上完成。例如，请求类似于 ``/admin/auth/user/?_popup=1&t=password`` 的 URL 并查看页面的 HTML 允许查看每个用户的密码哈希。尽管管理员要求用户首先具有查看更改表单页面的权限，但如果您依赖用户只能访问模型上的某些字段，这可能会泄露数据。

source: Corrected email and URL validation to reject a trailing dash (:ticket:`22579`).
id: Diperbaiki surel dan pengecekan URL untuk menolak tanda garis (:ticket:`22579`).
zh_hans: 修正了电子邮件和 URL 验证，以拒绝结尾的连字符（:ticket:`22579`）。

source: Prevented indexes on PostgreSQL virtual fields (:ticket:`22514`).
id: Dicegah indeks di bidang maya PostgreSQL (:ticket:`22514`).
zh_hans: 阻止在 PostgreSQL 虚拟字段上创建索引（:ticket:`22514`）。

source: Prevented edge case where values of FK fields could be initialized with a wrong value when an inline model formset is created for a relationship defined to point to a field other than the PK (:ticket:`13794`).
id: Dicegah kasus tepi dimana nilai dari bidang FK dapat diinisialisasikan dengan nilai salah ketika sebuah formset model berderet dibuat untuk hubungan ditentukan ke titik ke bidang selain dari PK (:ticket:`13794`).
zh_hans: 防止在创建内联模型表单集时出现一个边缘情况，该情况下，FK 字段的值可能会被初始化为错误的值，当关系定义为指向非 PK 字段时（:ticket:`13794`）。

source: Restored ``pre_delete`` signals for ``GenericRelation`` cascade deletion (:ticket:`22998`).
id: Disimpan kembali sinyal ``pre_delete`` untuk penghapusan kebawah ``GenericRelation`` (:ticket:`22998`).
zh_hans: 恢复了 ``GenericRelation`` 级联删除的 ``pre_delete`` 信号（:ticket:`22998`）。

source: Fixed transaction handling when specifying non-default database in ``createcachetable`` and ``flush`` (:ticket:`23089`).
id: Diperbaiki penanganan transaksi ketika menentukan basisdata bukan-awalan di ``createcachetable`` dan ``flush`` (:ticket:`23089`).
zh_hans: 在指定非默认数据库时修复了在 ``createcachetable`` 和 ``flush`` 中的事务处理（:ticket:`23089`）。

source: Fixed the "ORA-01843: not a valid month" errors when using Unicode with older versions of Oracle server (:ticket:`20292`).
id: Diperbaiki kesalahan "ORA-01843: not a valid month" ketika menggunakan Unicode dengan versi terlama dari peladen Oracle (:ticket:`20292`).
zh_hans: 修复了在使用 Unicode 与旧版本的 Oracle 服务器时出现的 "ORA-01843: not a valid month" 错误（:ticket:`20292`）。

source: Restored bug fix for sending Unicode email with Python 2.6.5 and below (:ticket:`19107`).
zh_hans: 恢复了在 Python 2.6.5 及以下版本中发送 Unicode 电子邮件的错误修复（:ticket:`19107`）。

source: Prevented ``UnicodeDecodeError`` in ``runserver`` with non-UTF-8 and non-English locale (:ticket:`23265`).
id: Dicegah ``UnicodeDecodeError`` di ``runserver`` dengan bukan-UTF-8 dan loakl bukan-Inggris (:ticket:`23265`).
zh_hans: 防止了在非 UTF-8 和非英语区域设置中的 ``runserver`` 中发生 ``UnicodeDecodeError`` （:ticket:`23265`）。

source: Fixed JavaScript errors while editing multi-geometry objects in the OpenLayers widget (:ticket:`23137`, :ticket:`23293`).
id: Diperbaiki kesalahan JavaScript selagi menyunting obyek banyak-geometri di widget OpenLayers (:ticket:`23137`, :ticket:`23293`).
zh_hans: 修复了在 OpenLayers 小部件中编辑多几何对象时出现的 JavaScript 错误（:ticket:`23137`, :ticket:`23293`）。
