Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The admin change list now supports sorting on multiple columns. It respects all elements of the :attr:`~django.contrib.admin.ModelAdmin.ordering` attribute, and sorting on multiple columns by clicking on headers is designed to mimic the behavior of desktop GUIs. We also added a :meth:`~django.contrib.admin.ModelAdmin.get_ordering` method for specifying the ordering dynamically (i.e., depending on the request).
id: Daftar perubahan admin sekarang mendukung pengurutan pada banyak kolom. Itu menghargai semua unsur dari atribut :attr:`~django.contrib.admin.ModelAdmin.ordering`, dan mengurutkan pada banyak kolom dengan mengklik pada kepala dirancang pada tiruan perilaku dari GUI desktop. Kami juga menambahkan metode :meth:`~django.contrib.admin.ModelAdmin.get_ordering` untuk menentukan pengurutan secara dinamis (yaitu, tergantung pada permintaan).
zh_hans: 管理界面的更改列表现在支持在多个列上进行排序。它尊重 :attr:`~django.contrib.admin.ModelAdmin.ordering` 属性的所有元素，并且通过单击标题进行多列排序的行为设计得类似于桌面 GUI。我们还添加了一个 :meth:`~django.contrib.admin.ModelAdmin.get_ordering` 方法，用于动态指定排序顺序（即，根据请求的不同情况）。

source: New ``ModelAdmin`` methods
id: Metode ``ModelAdmin`` baru
zh_hans: 新的 ``ModelAdmin`` 方法

source: We added a :meth:`~django.contrib.admin.ModelAdmin.save_related` method to :mod:`~django.contrib.admin.ModelAdmin` to ease customization of how related objects are saved in the admin.
id: Kami menambahkan metode :meth:`~django.contrib.admin.ModelAdmin.save_related` pada :mod:`~django.contrib.admin.ModelAdmin` untuk penyesuaian mudah dari bagaimana obyek terkait disimpan di admin.
zh_hans: 我们在 :mod:`~django.contrib.admin.ModelAdmin` 中添加了一个 :meth:`~django.contrib.admin.ModelAdmin.save_related` 方法，以便更容易自定义在管理员中保存相关对象的方式。

source: Two other new :class:`~django.contrib.admin.ModelAdmin` methods, :meth:`~django.contrib.admin.ModelAdmin.get_list_display` and :meth:`~django.contrib.admin.ModelAdmin.get_list_display_links` enable dynamic customization of fields and links displayed on the admin change list.
id: Dua metode :class:`~django.contrib.admin.ModelAdmin` baru lain, :meth:`~django.contrib.admin.ModelAdmin.get_list_display` dan :meth:`~django.contrib.admin.ModelAdmin.get_list_display_links` mengadakan penyesuaian dinamis dari bidang dan tautan ditampilkan pada daftar perubahan admin.
zh_hans: 另外两个新的 :class:`~django.contrib.admin.ModelAdmin` 方法，:meth:`~django.contrib.admin.ModelAdmin.get_list_display` 和 :meth:`~django.contrib.admin.ModelAdmin.get_list_display_links`，允许动态自定义在管理员更改列表上显示的字段和链接。

source: Admin inlines respect user permissions
id: Deretan admin menghormati perizinan pengguna
zh_hans: 管理员内联遵循用户权限

source: Admin inlines now only allow those actions for which the user has permission. For ``ManyToMany`` relationships with an auto-created intermediate model (which does not have its own permissions), the change permission for the related model determines if the user has the permission to add, change or delete relationships.
id: Deretan admin sekarang hanya mengizinkan tindakan tersebut untuk dimana pengguna mempunyai perizinan. Untuk hubungan `ManyToMany`` dengan model menengah dibuat otomatis (yang tidak mempunyai perizinan itu sendiri), perubahan perizinan untuk model terkait menentukan jika pengguna mempunyai perizinan untuk menambahkan, merubah atau menghapus hubungan.
zh_hans: 管理员内联现在只允许用户具有权限的操作。对于具有自动创建的中间模型的 ``ManyToMany`` 关系（该模型没有自己的权限），相关模型的更改权限确定用户是否具有添加、更改或删除关系的权限。

source: Tools for cryptographic signing
id: Alat untuk penandatangan kriptografi
zh_hans: 加密签名工具

source: Django 1.4 adds both a low-level API for signing values and a high-level API for setting and reading signed cookies, one of the most common uses of signing in web applications.
zh_hans: Django 1.4 既添加了用于签名值的低级 API，也添加了用于设置和读取签名 Cookie 的高级 API，这是 Web 应用程序中签名的最常见用途之一。

source: See the :doc:`cryptographic signing </topics/signing>` docs for more information.
id: Lihat dokumen :doc:`cryptographic signing </topics/signing>` untuk informasi lebih.
zh_hans: 有关更多信息，请查看 :doc:`加密签名 </topics/signing>` 文档。

source: Cookie-based session backend
id: Backend sesi berdasarkan-kue
zh_hans: 基于 Cookie 的会话后端

source: Django 1.4 introduces a cookie-based session backend that uses the tools for :doc:`cryptographic signing </topics/signing>` to store the session data in the client's browser.
id: Django 1.4 memperkenalkan backend sesi berdasarkan-kue yang menggunakan alat-alat untuk :doc:`cryptographic signing </topics/signing>` untuk menyimpan data sesi di peramban klien.
zh_hans: Django 1.4 引入了一种基于 Cookie 的会话后端，它使用 :doc:`加密签名 </topics/signing>` 工具来将会话数据存储在客户端的浏览器中。

source: Session data is signed and validated by the server, but it's not encrypted. This means a user can view any data stored in the session but cannot change it. Please read the documentation for further clarification before using this backend.
id: Data sesi ditandatangani dan disahkan oleh peladen, tetapi itu tidak dienkripsi. Ini berarti pengguna dapat menampilkan data apapun disimpan di sesi tetapi tidak dapat merubahnya. Harap baca dokumentasi untuk penjelasan lebih jauh sebelum menggunakan backend ini.
zh_hans: 会话数据由服务器签名并验证，但不加密。这意味着用户可以查看存储在会话中的任何数据，但不能更改它。在使用此后端之前，请阅读文档以进一步了解。

source: See the :ref:`cookie-based session backend <cookie-session-backend>` docs for more information.
id: Likat dok :ref:`cookie-based session backend <cookie-session-backend>` untuk informasi lebih.
zh_hans: 有关更多信息，请查看 :ref:`基于 Cookie 的会话后端 <cookie-session-backend>` 文档。

source: New form wizard
id: Wizard formulir baru
zh_hans: 新的表单向导

source: The previous ``FormWizard`` from ``django.contrib.formtools`` has been replaced with a new implementation based on the class-based views introduced in Django 1.3. It features a pluggable storage API and doesn't require the wizard to pass around hidden fields for every previous step.
id: ``FormWizard`` sebelumnya dari ``django.contrib.formtools`` telah diganti dengan penerapan baru berdasarkan pada tampilan berdasarkan-kelas diperkenalkan di Django 1.3. Fitur itu API penyimpanan dapat tertanam dan tidak membutuhkan wizard untuk melewati sekeliling bidang tersembunyi untuk setiap langkah sebelumnya.
zh_hans: 以前的 ``FormWizard`` 从 ``django.contrib.formtools`` 已经被一个基于 Django 1.3 引入的基于类的视图的新实现替代。它具有可插拔的存储 API，并且不需要向前的每个步骤传递隐藏字段。

source: Django 1.4 ships with a session-based storage backend and a cookie-based storage backend. The latter uses the tools for :doc:`cryptographic signing </topics/signing>` also introduced in Django 1.4 to store the wizard's state in the user's cookies.
id: Django 1.4 dibekali dengan backend penyimpanan berdasarkan-sesi dan backend penyimpanan berdasarkan-kue. Terakhir menggunakan alat-alat untuk :doc:`cryptographic signing </topics/signing>` juga diperkenalkan di Django 1.4 untuk menyimpan keadaan wizard di kue pengguna.
zh_hans: Django 1.4 附带了一个基于会话的存储后端和一个基于 Cookie 的存储后端。后者还使用了在 Django 1.4 中引入的 :doc:`加密签名 </topics/signing>` 工具来将向导的状态存储在用户的 Cookie 中。

source: A lazily evaluated version of ``reverse()`` was added to allow using URL reversals before the project's URLconf gets loaded.
id: Versi lazy dinilai dari ``reverse()`` telah ditambahkan untuk mengizinkan pembalikan URL sebelum URLconf proyek akan dimuat.
zh_hans: 新增了一个惰性评估版本的 ``reverse()``，允许在项目的 URL 配置加载之前使用 URL 反转。

source: Translating URL patterns
id: Menterjemahkan pola URL
zh_hans: 翻译 URL 模式

source: Django can now look for a language prefix in the URLpattern when using the new :func:`~django.conf.urls.i18n.i18n_patterns` helper function. It's also now possible to define translatable URL patterns using ``django.utils.translation.ugettext_lazy()``. See :ref:`url-internationalization` for more information about the language prefix and how to internationalize URL patterns.
zh_hans: Django 现在可以在使用新的 :func:`~django.conf.urls.i18n.i18n_patterns` 辅助函数时在 URL 模式中查找语言前缀。还可以使用 ``django.utils.translation.ugettext_lazy()`` 定义可翻译的 URL 模式。有关语言前缀以及如何国际化 URL 模式的更多信息，请参阅 :ref:`url-internationalization`。

source: Contextual translation support for ``{% trans %}`` and ``{% blocktrans %}``
id: Terjemahan kontekstual mengukung untuk ``{% trans %}`` dan ``{% blocktrans %}``
zh_hans: 对于 ``{% trans %}`` 和 ``{% blocktrans %}``，现在支持上下文翻译。

source: The :ref:`contextual translation<contextual-markers>` support introduced in Django 1.3 via the ``pgettext`` function has been extended to the :ttag:`trans` and :ttag:`blocktrans` template tags using the new ``context`` keyword.
id: Dukungan :ref:`contextual translation<contextual-markers>` diperkenalkan di Django 1.3 melalui fungsi ``pgettext`` telah diperpanjang ke etiket cetakan :ttag:`trans` dan :ttag:`blocktrans` menggunakan katakunci ``context`` baru.
zh_hans: 在 Django 1.3 中通过 ``pgettext`` 函数引入的 :ref:`上下文翻译<contextual-markers>` 支持已经扩展到 :ttag:`trans` 和 :ttag:`blocktrans` 模板标签，使用了新的 ``context`` 关键字。

source: Customizable ``SingleObjectMixin`` URLConf kwargs
id: Disesuaikan ``SingleObjectMixin`` kwargs URLConf
zh_hans: 可自定义的 ``SingleObjectMixin`` URLConf kwargs

source: Two new attributes, :attr:`pk_url_kwarg<django.views.generic.detail.SingleObjectMixin.pk_url_kwarg>` and :attr:`slug_url_kwarg<django.views.generic.detail.SingleObjectMixin.slug_url_kwarg>`, have been added to :class:`~django.views.generic.detail.SingleObjectMixin` to enable the customization of URLconf keyword arguments used for single object generic views.
id: Dua atribut baru :attr:`pk_url_kwarg<django.views.generic.detail.SingleObjectMixin.pk_url_kwarg>` dan :attr:`slug_url_kwarg<django.views.generic.detail.SingleObjectMixin.slug_url_kwarg>`, telah ditambahkan ke :class:`~django.views.generic.detail.SingleObjectMixin` untuk mengadakan penyesuaian dari argumen kata kunci URLConf digunakan untuk tampilan umum obyek tunggal.
zh_hans: 为了允许自定义用于单个对象通用视图的 URLconf 关键字参数，新增了两个新属性：:attr:`pk_url_kwarg<django.views.generic.detail.SingleObjectMixin.pk_url_kwarg>` 和 :attr:`slug_url_kwarg<django.views.generic.detail.SingleObjectMixin.slug_url_kwarg>`，它们被添加到 :class:`~django.views.generic.detail.SingleObjectMixin` 中。

source: Assignment template tags
id: Menyerahkan etiket cetakan
zh_hans: 赋值模板标签

source: A new ``assignment_tag`` helper function was added to ``template.Library`` to ease the creation of template tags that store data in a specified context variable.
id: Fungsi pembantu ``assignment_tag`` baru telah ditambahkan ke ``template.Library`` untuk memudahkan pembuatan etiket cetakan yang menyimpan data di variabel konteks yang ditentukan.
zh_hans: 新增了一个名为 ``assignment_tag`` 的辅助函数到 ``template.Library``，用于简化创建模板标签并将数据存储在指定的上下文变量中。

source: ``*args`` and ``**kwargs`` support for template tag helper functions
id: Dukungan ``*args`` dan ``**kwargs`` untuk fungsi pembantu etiket cetakan
zh_hans: 模板标签辅助函数现在支持 ``*args`` 和 ``**kwargs``

source: The :ref:`simple_tag<howto-custom-template-tags-simple-tags>`, :ref:`inclusion_tag <howto-custom-template-tags-inclusion-tags>` and newly introduced ``assignment_tag`` template helper functions may now accept any number of positional or keyword arguments. For example::
id: :ref:`simple_tag<howto-custom-template-tags-simple-tags>`, :ref:`inclusion_tag <howto-custom-template-tags-inclusion-tags>` dan baru-baru diperkenalkan fungsi pembantu cetakan ``assignment_tag`` sekarang menerima angka apapun dari penempatan atau argumen kata kunci. Sebagai contoh::
zh_hans: :ref:`simple_tag <howto-custom-template-tags-simple-tags>`、:ref:`inclusion_tag <howto-custom-template-tags-inclusion-tags>` 和新引入的 ``assignment_tag`` 模板辅助函数现在可以接受任意数量的位置参数或关键字参数。例如：

source: Then, in the template, any number of arguments may be passed to the template tag. For example:
id: Kemudian, di cetakan, angka apapun dari argumen mungkin dilewatkan ke etiket cetakan. Sebagai contoh:
zh_hans: 然后，在模板中，可以将任意数量的参数传递给模板标签。例如：

source: No wrapping of exceptions in ``TEMPLATE_DEBUG`` mode
id: Tidak ada pembungkusan dari pengecualian di suasana ``TEMPLATE_DEBUG``
zh_hans: 在 ``TEMPLATE_DEBUG`` 模式下不会包装异常

source: In previous versions of Django, whenever the ``TEMPLATE_DEBUG`` setting was ``True``, any exception raised during template rendering (even exceptions unrelated to template syntax) were wrapped in ``TemplateSyntaxError`` and re-raised. This was done in order to provide detailed template source location information in the debug 500 page.
id: Di vesi sebelumnya dari Django, kapanpun pengaturan ``TEMPLATE_DEBUG`` adalah ``True``, tiap pengecualian dimunculkan selama membangun cetakan (bahkan pengecualian tidak terkait ke sintaksis cetakan) dibungkus di ``TemplateSyntaxError`` dan dimunculkan kembali. Ini diselesaikan untuk menyediakan informasi rincian tempat sumber cetakan di mencari kesalahan halaman 500.
zh_hans: 在以前的 Django 版本中，无论何时 ``TEMPLATE_DEBUG`` 设置为 ``True``，在模板渲染期间引发的任何异常（甚至与模板语法无关的异常）都会被包装在 ``TemplateSyntaxError`` 中并重新引发。这是为了在调试 500 页面中提供详细的模板源位置信息。

source: In Django 1.4, exceptions are no longer wrapped. Instead, the original exception is annotated with the source information. This means that catching exceptions from template rendering is now consistent regardless of the value of ``TEMPLATE_DEBUG``, and there's no need to catch and unwrap ``TemplateSyntaxError`` in order to catch other errors.
id: Di Django 1.4, pengecualian tidak lagi dibungkus. Sebagai gantinya pengecualian diberikan keterangan dengan informasi sumber. Ini berarti bahwa menangkap pengecualian dari membangun cetakan sekarang tetap tanpa memperhatikan nilai dari ``TEMPLATE_DEBUG``, dan tidak perlu menangkap dan membuka ``TemplateSyntaxError`` untuk menangkap kesalahan lain.
zh_hans: 在 Django 1.4 中，不再包装异常。相反，原始异常会带有源信息的注释。这意味着无论 ``TEMPLATE_DEBUG`` 的值如何，现在捕获模板渲染中的异常都是一致的，而且不需要捕获和解包 ``TemplateSyntaxError`` 以捕获其他错误。

source: ``truncatechars`` template filter
id: Penyaring cetakan ``truncatechars``
zh_hans: ``truncatechars`` 模板过滤器

source: This new filter truncates a string to be no longer than the specified number of characters. Truncated strings end with a translatable ellipsis sequence ("..."). See the documentation for :tfilter:`truncatechars` for more details.
id: Penyaring baru ini memotong deretan karakter untuk tidak lebih panjang dari angka yang ditentukan dari karakter. Deretan karakter diporong berakhir dengan urutan tanda pengganti dapat diartikan ("..."). Lihat dokumentasi untuk :tfilter:`truncatechars` untuk rincian lebih.
zh_hans: 这个新的过滤器将字符串截断，使其不超过指定的字符数。截断的字符串以可翻译的省略号序列（"..."）结尾。有关更多详细信息，请参阅 :tfilter:`truncatechars` 的文档。

source: ``static`` template tag
id: Etiket cetakan ``static``
zh_hans: ``static`` 模板标签

source: ``CachedStaticFilesStorage`` storage backend
id: Backend penyimpanan ``CachedStaticFilesStorage``
zh_hans: ``CachedStaticFilesStorage`` 存储后端

source: The :mod:`staticfiles<django.contrib.staticfiles>` contrib app now has a ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` backend that caches the files it saves (when running the :djadmin:`collectstatic` management command) by appending the MD5 hash of the file's content to the filename. For example, the file ``css/styles.css`` would also be saved as ``css/styles.55e7cbb9ba48.css``
zh_hans: 现在，:mod:`staticfiles<django.contrib.staticfiles>` 贡献应用程序具有一个 ``django.contrib.staticfiles.storage.CachedStaticFilesStorage`` 后端，通过将文件内容的 MD5 哈希附加到文件名中来缓存它保存的文件（在运行 :djadmin:`collectstatic` 管理命令时）。例如，文件 ``css/styles.css`` 也将保存为 ``css/styles.55e7cbb9ba48.css``。

source: Simple clickjacking protection
id: Perlindungan clickjacking sederhana
zh_hans: 简单的点击劫持保护

source: We've added a middleware to provide easy protection against `clickjacking <https://en.wikipedia.org/wiki/Clickjacking>`_ using the ``X-Frame-Options`` header. It's not enabled by default for backwards compatibility reasons, but you'll almost certainly want to :doc:`enable it </ref/clickjacking/>` to help plug that security hole for browsers that support the header.
id: Kami telah menambahkan middleware untuk menyediakan perlindungan mudah terhadap `clickjacking <https://en.wikipedia.org/wiki/Clickjacking>`_ menggunakan kepala ``X-Frame-Options`. Itu tidak diadakan secara awal untuk alasan kesesuaian kebelakang, tetapi anda akan hampir pasti ingin :doc:`enable it </ref/clickjacking/>` untuk membantu menanam lubang security untuk peramban yang mendukung kepala.
zh_hans: 我们添加了一个中间件，通过使用 ``X-Frame-Options`` 头提供了简单的防止 `clickjacking <https://en.wikipedia.org/wiki/Clickjacking>`_ 的保护。出于向后兼容性的原因，默认情况下未启用它，但您几乎肯定希望 :doc:`启用它 </ref/clickjacking/>` 以帮助修复支持该头的浏览器中的安全漏洞。

source: CSRF improvements
id: Perbaikan CSRF
zh_hans: CSRF 改进

source: We've made various improvements to our CSRF features, including the :func:`~django.views.decorators.csrf.ensure_csrf_cookie` decorator, which can help with AJAX-heavy sites; protection for PUT and DELETE requests; and the :setting:`CSRF_COOKIE_SECURE` and :setting:`CSRF_COOKIE_PATH` settings, which can improve the security and usefulness of CSRF protection. See the :doc:`CSRF docs </ref/csrf>` for more information.
id: Kami telah membuat beragam perbaikan untuk fitur CSRF kami, termasuk penghias :func:`~django.views.decorators.csrf.ensure_csrf_cookie`, yang dapat membantu dengan situs berat-AJAX; perlindungan untuk permintaan PUT dan DELETE; dan pengaturan :setting:`CSRF_COOKIE_SECURE` dan :setting:`CSRF_COOKIE_PATH`, yang dapat meningkatkan keamanan dan kegunaan dari perlindungan CSRF. Lihat :doc:`CSRF docs </ref/csrf>` untuk informasi lebih.
zh_hans: 我们对 CSRF 功能进行了各种改进，包括 :func:`~django.views.decorators.csrf.ensure_csrf_cookie` 装饰器，它可以帮助处理 AJAX 密集的站点；对 PUT 和 DELETE 请求的保护；以及 :setting:`CSRF_COOKIE_SECURE` 和 :setting:`CSRF_COOKIE_PATH` 设置，它们可以提高 CSRF 保护的安全性和实用性。有关更多信息，请参阅 :doc:`CSRF 文档 </ref/csrf>`。

source: Error report filtering
id: Menyaring laporan kesalahan
zh_hans: 错误报告过滤

source: We added two function decorators, :func:`~django.views.decorators.debug.sensitive_variables` and :func:`~django.views.decorators.debug.sensitive_post_parameters`, to allow designating the local variables and POST parameters that may contain sensitive information and should be filtered out of error reports.
id: Kami menambahkan dua fungsi penghias, :func:`~django.views.decorators.debug.sensitive_variables` dan :func:`~django.views.decorators.debug.sensitive_post_parameters`, untuk mengizinkan yang menunjuk variabel lokal dan parameter POST yang mungkin mengandung informasi sensitif dan harus disaring dari laporan kesalahan.
zh_hans: 我们添加了两个函数装饰器，:func:`~django.views.decorators.debug.sensitive_variables` 和 :func:`~django.views.decorators.debug.sensitive_post_parameters`，允许指定可能包含敏感信息并且应该从错误报告中过滤掉的本地变量和 POST 参数。

source: All POST parameters are now systematically filtered out of error reports for certain views (``login``, ``password_reset_confirm``, ``password_change`` and ``add_view`` in :mod:`django.contrib.auth.views`, as well as ``user_change_password`` in the admin app) to prevent the leaking of sensitive information such as user passwords.
id: Semua parameter POST adalah sekarang sistematis disaring keluar dari laporan kesalahan untuk tampilan (``login``, ``password_reset_confirm``, ``password_change`` dan ``add_view`` di :mod:`django.contrib.auth.views`, dan juga ``user_change_password`` di aplikasi admin) untuk mencegah kebocoran dari informasi sensitif seperti sandi pengguna.
zh_hans: 现在，对于某些视图（``login``、``password_reset_confirm``、``password_change`` 和 :mod:`django.contrib.auth.views` 中的 ``add_view``，以及管理员应用程序中的 ``user_change_password``），所有 POST 参数都会被系统地从错误报告中过滤掉，以防止敏感信息（如用户密码）的泄漏。

source: You can override or customize the default filtering by writing a :ref:`custom filter<custom-error-reports>`. For more information see the docs on :ref:`Filtering error reports<filtering-error-reports>`.
id: Anda dapat menimpa atau menyesuaikan penyaringan awalan dengan menulis sebuah :ref:`custom filter<custom-error-reports>`. Untuk informasi lebih lihat dokumen pada :ref:`Filtering error reports<filtering-error-reports>`.
zh_hans: 您可以通过编写 :ref:`自定义过滤器 <custom-error-reports>` 来覆盖或自定义默认的过滤方式。有关更多信息，请参阅 :ref:`过滤错误报告 <filtering-error-reports>` 文档。

source: Extended IPv6 support
id: Diperpanjang dukungan IPv6
zh_hans: 扩展的 IPv6 支持

source: Django 1.4 can now better handle IPv6 addresses with the new :class:`~django.db.models.GenericIPAddressField` model field, :class:`~django.forms.GenericIPAddressField` form field and the validators :data:`~django.core.validators.validate_ipv46_address` and :data:`~django.core.validators.validate_ipv6_address`.
id: Django 1.4 sekarang dapat lebih baik menangani alamat IPv6 dengan bidang model :class:`~django.db.models.GenericIPAddressField` baru, bidang formuilir :class:`~django.forms.GenericIPAddressField` dan pengesah :data:`~django.core.validators.validate_ipv46_address` dan :data:`~django.core.validators.validate_ipv6_address`.
zh_hans: Django 1.4 现在可以更好地处理 IPv6 地址，引入了新的 :class:`~django.db.models.GenericIPAddressField` 模型字段，:class:`~django.forms.GenericIPAddressField` 表单字段以及验证器 :data:`~django.core.validators.validate_ipv46_address` 和 :data:`~django.core.validators.validate_ipv6_address`。

source: HTML comparisons in tests
id: Perbandingan HTML di percobaan
zh_hans: 测试中的 HTML 比较

source: The base classes in :mod:`django.test` now have some helpers to compare HTML without tripping over irrelevant differences in whitespace, argument quoting/ordering and closing of self-closing tags. You can either compare HTML directly with the new :meth:`~django.test.SimpleTestCase.assertHTMLEqual` and :meth:`~django.test.SimpleTestCase.assertHTMLNotEqual` assertions, or use the ``html=True`` flag with :meth:`~django.test.SimpleTestCase.assertContains` and :meth:`~django.test.SimpleTestCase.assertNotContains` to test whether the client's response contains a given HTML fragment. See the :ref:`assertions documentation <assertions>` for more.
id: Kelas-kelas dasar di :mod:`django.test` sekarang mempunyai beberapa pembantu untuk membandingkan HTML tanpa bersalah terhadap perbedaan tidak bersangkut paut di ruang kosong, pengutipan/pengurutan argumen dan penutupan dari etiket menutup-sendiri. Anda dapat baik membandingkan HTML secara langsung dengan meth:`~django.test.SimpleTestCase.assertHTMLEqual` baru dan pernyataan :meth:`~django.test.SimpleTestCase.assertHTMLNotEqual`, atau gunakan bendera ``html=True`` dengan :meth:`~django.test.SimpleTestCase.assertContains` dan :meth:`~django.test.SimpleTestCase.assertNotContains` untuk mencoba apakah tanggapan klien mengandung potongan HTML yang diberikan. Lihat :ref:`assertions documentation <assertions>` untuk lebih.
zh_hans: 在 :mod:`django.test` 中的基类现在具有一些帮助程序，可以比较 HTML，而不会受到不相关的空格差异、参数引用/顺序以及自闭标签的关闭的干扰。您可以使用新的 :meth:`~django.test.SimpleTestCase.assertHTMLEqual` 和 :meth:`~django.test.SimpleTestCase.assertHTMLNotEqual` 断言直接比较 HTML，或者使用 ``html=True`` 标志与 :meth:`~django.test.SimpleTestCase.assertContains` 和 :meth:`~django.test.SimpleTestCase.assertNotContains` 来测试客户端的响应是否包含给定的 HTML 片段。有关更多信息，请参阅 :ref:`断言文档 <assertions>`。

source: Two new date format strings
id: Dua deretan karakter bentuk tanggal baru
zh_hans: 两个新的日期格式字符串

source: Two new :tfilter:`date` formats were added for use in template filters, template tags and :doc:`/topics/i18n/formatting`:
id: Dua bentuk :tfilter:`date` baru telah ditambahkan untuk digunakan di penyaring cetakan, etiket cetakan dan :doc:`/topics/i18n/formatting`:
zh_hans: 新增了两个 :tfilter:`date` 格式，可用于模板过滤器、模板标签和 :doc:`/topics/i18n/formatting`：

source: ``e`` -- the name of the timezone of the given datetime object
id: ``e`` -- nama dari zonawaktu dari obyek datetime yang diberikan
zh_hans: ``e`` -- 给定日期时间对象的时区名称

source: ``o`` -- the ISO 8601 year number
id: ``o`` -- Angka tahun ISO 8601
zh_hans: ``o`` -- ISO 8601 年份编号
