Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Under the hood the provided ``choices`` are normalized into a list of 2-tuples as the canonical form whenever the ``choices`` value is updated. For more information, please check the :ref:`model field reference on choices <field-choices>`.
zh_hans: 在内部，每当更新 ``choices`` 值时，提供的 ``choices`` 将被规范化为包含 2 元组的列表，作为规范形式。有关更多信息，请查看 :ref:`模型字段参考中的 choices <field-choices>`。

source: The new :meth:`.AdminSite.get_log_entries` method allows customizing the queryset for the site's listed log entries.
zh_hans: 新的 :meth:`.AdminSite.get_log_entries` 方法允许自定义站点列出的日志条目的查询集。

source: The ``django.contrib.admin.AllValuesFieldListFilter``, ``ChoicesFieldListFilter``, ``RelatedFieldListFilter``, and ``RelatedOnlyFieldListFilter`` admin filters now handle multi-valued query parameters.
zh_hans: ``django.contrib.admin.AllValuesFieldListFilter``、``ChoicesFieldListFilter``、``RelatedFieldListFilter`` 和 ``RelatedOnlyFieldListFilter`` 管理筛选器现在处理多值查询参数。

source: ``XRegExp`` is upgraded from version 3.2.0 to 5.1.1.
zh_hans: ``XRegExp`` 升级到版本 5.1.1，从之前的版本 3.2.0。

source: The new :meth:`.AdminSite.get_model_admin` method returns an admin class for the given model class.
zh_hans: 新的 :meth:`.AdminSite.get_model_admin` 方法返回给定模型类的管理类。

source: Properties in :attr:`.ModelAdmin.list_display` now support ``boolean`` attribute.
zh_hans: :attr:`.ModelAdmin.list_display` 中的属性现在支持 ``boolean`` 属性。

source: jQuery is upgraded from version 3.6.4 to 3.7.1.
zh_hans: jQuery 升级到版本 3.7.1，从之前的版本 3.6.4。

source: The default iteration count for the PBKDF2 password hasher is increased from 600,000 to 720,000.
zh_hans: PBKDF2 密码哈希器的默认迭代次数从 600,000 增加到 720,000。

source: The new asynchronous functions are now provided, using an ``a`` prefix: :func:`django.contrib.auth.aauthenticate`, :func:`~.django.contrib.auth.aget_user`, :func:`~.django.contrib.auth.alogin`, :func:`~.django.contrib.auth.alogout`, and :func:`~.django.contrib.auth.aupdate_session_auth_hash`.
zh_hans: 现在提供了新的异步函数，使用 ``a`` 前缀：:func:`django.contrib.auth.aauthenticate`、:func:`~.django.contrib.auth.aget_user`、:func:`~.django.contrib.auth.alogin`、:func:`~.django.contrib.auth.alogout` 和 :func:`~.django.contrib.auth.aupdate_session_auth_hash`。

source: ``AuthenticationMiddleware`` now adds an :meth:`.HttpRequest.auser` asynchronous method that returns the currently logged-in user.
zh_hans: ``AuthenticationMiddleware`` 现在添加了一个 :meth:`.HttpRequest.auser` 异步方法，用于返回当前已登录的用户。

source: The new :func:`django.contrib.auth.hashers.acheck_password` asynchronous function and :meth:`.AbstractBaseUser.acheck_password` method allow asynchronous checking of user passwords.
zh_hans: 新的 :func:`django.contrib.auth.hashers.acheck_password` 异步函数和 :meth:`.AbstractBaseUser.acheck_password` 方法允许异步检查用户密码。

source: :meth:`.QuerySet.prefetch_related` now supports prefetching :class:`~django.contrib.contenttypes.fields.GenericForeignKey` with non-homogeneous set of results.
zh_hans: :meth:`.QuerySet.prefetch_related` 现在支持在结果集中存在非同质的情况下预取 :class:`~django.contrib.contenttypes.fields.GenericForeignKey`。

source: The new :class:`ClosestPoint() <django.contrib.gis.db.models.functions.ClosestPoint>` function returns a 2-dimensional point on the geometry that is closest to another geometry.
zh_hans: 新的 :class:`ClosestPoint() <django.contrib.gis.db.models.functions.ClosestPoint>` 函数返回几何图形上距离另一个几何图形最近的二维点。

source: :ref:`GIS aggregates <gis-aggregation-functions>` now support the ``filter`` argument.
zh_hans: :ref:`GIS 聚合函数 <gis-aggregation-functions>` 现在支持 ``filter`` 参数。

source: Support for GDAL 3.7 and GEOS 3.12 is added.
zh_hans: 添加了对 GDAL 3.7 和 GEOS 3.12 的支持。

source: The new :meth:`.GEOSGeometry.equals_identical` method allows point-wise equivalence checking of geometries.
zh_hans: 新的 :meth:`.GEOSGeometry.equals_identical` 方法允许逐点等价检查几何图形。

source: The new :meth:`.MessagesTestMixin.assertMessages` assertion method allows testing :mod:`~django.contrib.messages` added to a :class:`response <django.http.HttpResponse>`.
zh_hans: 新的 :meth:`.MessagesTestMixin.assertMessages` 断言方法允许测试添加到 :class:`response <django.http.HttpResponse>` 的 :mod:`~django.contrib.messages`。

source: The new :attr:`~.ExclusionConstraint.violation_error_code` attribute of :class:`~django.contrib.postgres.constraints.ExclusionConstraint` allows customizing the ``code`` of ``ValidationError`` raised during :ref:`model validation <validating-objects>`.
zh_hans: :class:`~django.contrib.postgres.constraints.ExclusionConstraint` 的新属性 :attr:`~.ExclusionConstraint.violation_error_code` 允许在 :ref:`模型验证 <validating-objects>` 期间自定义 ``ValidationError`` 引发的 ``code``。

source: Asynchronous views
zh_hans: 异步视图

source: Under ASGI, ``http.disconnect`` events are now handled. This allows views to perform any necessary cleanup if a client disconnects before the response is generated. See :ref:`async-handling-disconnect` for more details.
zh_hans: 在 ASGI 下，现在可以处理 ``http.disconnect`` 事件。这允许视图在客户端在生成响应之前断开连接时执行任何必要的清理工作。有关更多详细信息，请参阅 :ref:`async-handling-disconnect`。

source: The following decorators now support wrapping asynchronous view functions:
zh_hans: 以下装饰器现在支持包装异步视图函数：

source: :func:`~django.views.decorators.debug.sensitive_variables` and :func:`~django.views.decorators.debug.sensitive_post_parameters` can now be used with asynchronous functions.
zh_hans: :func:`~django.views.decorators.debug.sensitive_variables` 和 :func:`~django.views.decorators.debug.sensitive_post_parameters` 现在可以与异步函数一起使用。

source: :meth:`.File.open` now passes all positional (``*args``) and keyword arguments (``**kwargs``) to Python's built-in :func:`python:open`.
zh_hans: :meth:`.File.open` 现在将所有位置参数（``*args``）和关键字参数（``**kwargs``）传递给 Python 内置的 :func:`python:open`。

source: The new :attr:`~django.forms.URLField.assume_scheme` argument for :class:`~django.forms.URLField` allows specifying a default URL scheme.
zh_hans: 新的 :attr:`~django.forms.URLField.assume_scheme` 参数用于 :class:`~django.forms.URLField`，允许指定默认的 URL 方案。

source: In order to improve accessibility, the following changes are made:
zh_hans: 为了提高可访问性，进行了以下更改：

source: Form fields now include the ``aria-describedby`` HTML attribute to enable screen readers to associate form fields with their help text.
zh_hans: 现在表单字段包括 ``aria-describedby`` HTML 属性，以使屏幕阅读器能够将表单字段与其帮助文本关联起来。

source: Invalid form fields now include the ``aria-invalid="true"`` HTML attribute.
zh_hans: 无效的表单字段现在包括 ``aria-invalid="true"`` HTML 属性。

source: Support and translations for the Uyghur language are now available.
zh_hans: 现在支持维吾尔语，并提供翻译。

source: Serialization of functions decorated with :func:`functools.cache` or :func:`functools.lru_cache` is now supported without the need to write a custom serializer.
zh_hans: 现在支持对使用 :func:`functools.cache` 或 :func:`functools.lru_cache` 装饰的函数进行序列化，无需编写自定义序列化器。

source: The new ``create_defaults`` argument of :meth:`.QuerySet.update_or_create` and :meth:`.QuerySet.aupdate_or_create` methods allows specifying a different field values for the create operation.
zh_hans: :meth:`.QuerySet.update_or_create` 和 :meth:`.QuerySet.aupdate_or_create` 方法的新 ``create_defaults`` 参数允许为创建操作指定不同的字段值。

source: The new ``violation_error_code`` attribute of :class:`~django.db.models.BaseConstraint`, :class:`~django.db.models.CheckConstraint`, and :class:`~django.db.models.UniqueConstraint` allows customizing the ``code`` of ``ValidationError`` raised during :ref:`model validation <validating-objects>`.
zh_hans: :class:`~django.db.models.BaseConstraint`、:class:`~django.db.models.CheckConstraint` 和 :class:`~django.db.models.UniqueConstraint` 的新 ``violation_error_code`` 属性允许自定义在 :ref:`模型验证 <validating-objects>` 过程中引发的 ``ValidationError`` 的 ``code``。

source: The :ref:`force_insert <ref-models-force-insert>` argument of :meth:`.Model.save` now allows specifying a tuple of parent classes that must be forced to be inserted.
zh_hans: :meth:`.Model.save` 的 :ref:`force_insert <ref-models-force-insert>` 参数现在允许指定必须强制插入的父类的元组。

source: :meth:`.QuerySet.bulk_create` and :meth:`.QuerySet.abulk_create` methods now set the primary key on each model instance when the ``update_conflicts`` parameter is enabled (if the database supports it).
zh_hans: 当启用 ``update_conflicts`` 参数时，:meth:`.QuerySet.bulk_create` 和 :meth:`.QuerySet.abulk_create` 方法现在会为每个模型实例设置主键（如果数据库支持的话）。

source: The new :attr:`.UniqueConstraint.nulls_distinct` attribute allows customizing the treatment of ``NULL`` values on PostgreSQL 15+.
zh_hans: 新的 :attr:`.UniqueConstraint.nulls_distinct` 属性允许自定义在 PostgreSQL 15+ 上对 ``NULL`` 值的处理方式。

source: The new :func:`~django.shortcuts.aget_object_or_404` and :func:`~django.shortcuts.aget_list_or_404` asynchronous shortcuts allow asynchronous getting objects.
zh_hans: 新的 :func:`~django.shortcuts.aget_object_or_404` 和 :func:`~django.shortcuts.aget_list_or_404` 异步快捷方式允许异步获取对象。

source: The new :func:`~django.db.models.aprefetch_related_objects` function allows asynchronous prefetching of model instances.
zh_hans: 新的 :func:`~django.db.models.aprefetch_related_objects` 函数允许异步预取模型实例。

source: :meth:`.QuerySet.aiterator` now supports previous calls to ``prefetch_related()``.
zh_hans: :meth:`.QuerySet.aiterator` 现在支持之前对 ``prefetch_related()`` 的调用。

source: On MariaDB 10.7+, ``UUIDField`` is now created as ``UUID`` column rather than ``CHAR(32)`` column. See the migration guide above for more details on :ref:`migrating-uuidfield`.
zh_hans: 在 MariaDB 10.7+ 上，``UUIDField`` 现在将创建为 ``UUID`` 列，而不是 ``CHAR(32)`` 列。有关 :ref:`migrating-uuidfield` 的更多详细信息，请参阅迁移指南。

source: Django now supports `oracledb`_ version 1.3.2 or higher. Support for ``cx_Oracle`` is deprecated as of this release and will be removed in Django 6.0.
zh_hans: Django 现在支持 `oracledb`_ 版本 1.3.2 或更高版本。从此版本开始，对 ``cx_Oracle`` 的支持已被弃用，并将在 Django 6.0 中移除。

source: The new :attr:`django.core.paginator.Paginator.error_messages` argument allows customizing the error messages raised by :meth:`.Paginator.page`.
zh_hans: 新的 :attr:`django.core.paginator.Paginator.error_messages` 参数允许自定义由 :meth:`.Paginator.page` 引发的错误消息。

source: The new :meth:`.Signal.asend` and :meth:`.Signal.asend_robust` methods allow asynchronous signal dispatch. Signal receivers may be synchronous or asynchronous, and will be automatically adapted to the correct calling style.
zh_hans: 新的 :meth:`.Signal.asend` 和 :meth:`.Signal.asend_robust` 方法允许异步信号分发。信号接收器可以是同步或异步的，将自动适应正确的调用方式。

source: The new :tfilter:`escapeseq` template filter applies :tfilter:`escape` to each element of a sequence.
zh_hans: 新的 :tfilter:`escapeseq` 模板过滤器将 :tfilter:`escape` 应用于序列的每个元素。

source: :class:`~django.test.Client` and :class:`~django.test.AsyncClient` now provide asynchronous methods, using an ``a`` prefix: :meth:`~django.test.Client.asession`, :meth:`~django.test.Client.alogin`, :meth:`~django.test.Client.aforce_login`, and :meth:`~django.test.Client.alogout`.
zh_hans: :class:`~django.test.Client` 和 :class:`~django.test.AsyncClient` 现在提供异步方法，使用 ``a`` 前缀：:meth:`~django.test.Client.asession`、:meth:`~django.test.Client.alogin`、:meth:`~django.test.Client.aforce_login` 和 :meth:`~django.test.Client.alogout`。

source: :class:`~django.test.AsyncClient` now supports the ``follow`` parameter.
zh_hans: :class:`~django.test.AsyncClient` 现在支持 ``follow`` 参数。

source: The new ``offset`` argument of :class:`~django.core.validators.StepValueValidator` allows specifying an offset for valid values.
zh_hans: :class:`~django.core.validators.StepValueValidator` 的新 ``offset`` 参数允许为有效值指定偏移量。

source: Backwards incompatible changes in 5.0
zh_hans: 5.0 版本中不向后兼容的变更

source: ``DatabaseFeatures.supports_expression_defaults`` should be set to ``False`` if the database doesn't support using database functions as defaults.
zh_hans: 如果数据库不支持将数据库函数用作默认值，则应将 ``DatabaseFeatures.supports_expression_defaults`` 设置为 ``False``。

source: ``DatabaseFeatures.supports_default_keyword_in_insert`` should be set to ``False`` if the database doesn't support the ``DEFAULT`` keyword in ``INSERT`` queries.
zh_hans: 如果数据库不支持在 ``INSERT`` 查询中使用 ``DEFAULT`` 关键字，应将 ``DatabaseFeatures.supports_default_keyword_in_insert`` 设置为 ``False``。

source: ``DatabaseFeatures.supports_default_keyword_in_bulk_insert`` should be set to ``False`` if the database doesn't support the ``DEFAULT`` keyword in bulk ``INSERT`` queries.
zh_hans: 如果数据库不支持在批量 ``INSERT`` 查询中使用 ``DEFAULT`` 关键字，应将 ``DatabaseFeatures.supports_default_keyword_in_bulk_insert`` 设置为 ``False``。

source: Support for GDAL 2.2 and 2.3 is removed.
zh_hans: 移除对 GDAL 2.2 和 2.3 的支持。

source: Support for GEOS 3.6 and 3.7 is removed.
zh_hans: 移除对 GEOS 3.6 和 3.7 的支持。

source: The ``django.contrib.sitemaps.ping_google()`` function and the ``ping_google`` management command are removed as the Google Sitemaps ping endpoint is deprecated and will be removed in January 2024.
zh_hans: 移除了 ``django.contrib.sitemaps.ping_google()`` 函数和 ``ping_google`` 管理命令，因为 Google Sitemaps 的 ping 端点已被弃用，并将于 2024 年 1 月被移除。

source: The ``django.contrib.sitemaps.SitemapNotFound`` exception class is removed.
zh_hans: 移除了 ``django.contrib.sitemaps.SitemapNotFound`` 异常类。

source: Dropped support for MySQL < 8.0.11
zh_hans: 不再支持 MySQL 版本低于 8.0.11。

source: Support for pre-releases of MySQL 8.0.x series is removed. Django 5.0 supports MySQL 8.0.11 and higher.
zh_hans: 不再支持 MySQL 8.0.x 系列的预发布版本。Django 5.0 支持 MySQL 8.0.11 及更高版本。

source: Using ``create_defaults__exact`` may now be required with ``QuerySet.update_or_create()``
zh_hans: 在使用 ``QuerySet.update_or_create()`` 时，可能现在需要使用 ``create_defaults__exact``。

source: :meth:`.QuerySet.update_or_create` now supports the parameter ``create_defaults``. As a consequence, any models that have a field named ``create_defaults`` that are used with an ``update_or_create()`` should specify the field in the lookup with ``create_defaults__exact``.
zh_hans: :meth:`.QuerySet.update_or_create` 现在支持参数 ``create_defaults``。因此，任何在 ``update_or_create()`` 中使用具有名为 ``create_defaults`` 的字段的模型应该在查找中使用 ``create_defaults__exact`` 指定该字段。

source: Migrating existing ``UUIDField`` on MariaDB 10.7+
zh_hans: 迁移现有的在 MariaDB 10.7+ 上的 ``UUIDField``

source: On MariaDB 10.7+, ``UUIDField`` is now created as ``UUID`` column rather than ``CHAR(32)`` column. As a consequence, any ``UUIDField`` created in Django < 5.0 should be replaced with a ``UUIDField`` subclass backed by ``CHAR(32)``::
zh_hans: 在 MariaDB 10.7+ 中，现在将 ``UUIDField`` 创建为 ``UUID`` 列，而不再是 ``CHAR(32)`` 列。因此，在 Django 版本小于 5.0 中创建的任何 ``UUIDField`` 都应该替换为由 ``CHAR(32)`` 支持的 ``UUIDField`` 子类::

source: Running the :djadmin:`makemigrations` command will generate a migration containing a no-op ``AlterField`` operation.
zh_hans: 运行 :djadmin:`makemigrations` 命令将生成一个包含无操作的 ``AlterField`` 操作的迁移。

source: The ``instance`` argument of the undocumented ``BaseModelFormSet.save_existing()`` method is renamed to ``obj``.
zh_hans: 未记录的 ``BaseModelFormSet.save_existing()`` 方法的 ``instance`` 参数已重命名为 ``obj``。

source: The undocumented ``django.contrib.admin.helpers.checkbox`` is removed.
zh_hans: 未记录的 ``django.contrib.admin.helpers.checkbox`` 已被移除。

source: Integer fields are now validated as 64-bit integers on SQLite to match the behavior of ``sqlite3``.
zh_hans: 在 SQLite 上，整数字段现在会被验证为 64 位整数，以匹配 ``sqlite3`` 的行为。

source: The undocumented ``Query.annotation_select_mask`` attribute is changed from a set of strings to an ordered list of strings.
zh_hans: 未记录的 ``Query.annotation_select_mask`` 属性已从字符串集更改为有序的字符串列表。

source: ``ImageField.update_dimension_fields()`` is no longer called on the ``post_init`` signal if ``width_field`` and ``height_field`` are not set.
zh_hans: 如果未设置 ``width_field`` 和 ``height_field``，则不再在 ``post_init`` 信号上调用 ``ImageField.update_dimension_fields()``。

source: :class:`~django.db.models.functions.Now` database function now uses ``LOCALTIMESTAMP`` instead of ``CURRENT_TIMESTAMP`` on Oracle.
zh_hans: 在 Oracle 上，:class:`~django.db.models.functions.Now` 数据库函数现在使用 ``LOCALTIMESTAMP`` 而不是 ``CURRENT_TIMESTAMP``。

source: :attr:`.AdminSite.site_header` is now rendered in a ``<div>`` tag instead of ``<h1>``. Screen reader users rely on heading elements for navigation within a page. Having two ``<h1>`` elements was confusing and the site header wasn't helpful as it is repeated on all pages.
zh_hans: :attr:`.AdminSite.site_header` 现在呈现在一个 ``<div>`` 标签中，而不是 ``<h1>``。屏幕阅读器用户依赖标题元素在页面内导航。拥有两个 ``<h1>`` 元素会引起混淆，而且站点标题在所有页面上都重复出现，没有帮助。

source: In order to improve accessibility, the admin's main content area and header content area are now rendered in a ``<main>`` and ``<header>`` tag instead of ``<div>``.
zh_hans: 为了提高可访问性，管理员的主要内容区域和页眉内容区域现在呈现在 ``<main>`` 和 ``<header>`` 标签中，而不是 ``<div>``。

source: On databases without native support for the SQL ``XOR`` operator, ``^`` as the exclusive or (``XOR``) operator now returns rows that are matched by an odd number of operands rather than exactly one operand. This is consistent with the behavior of MySQL, MariaDB, and Python.
zh_hans: 在没有原生支持 SQL ``XOR`` 运算符的数据库上，作为异或（``XOR``）运算符的 ``^`` 现在会返回被奇数个操作数匹配的行，而不是严格匹配一个操作数。这与 MySQL、MariaDB 和 Python 的行为一致。

source: The minimum supported version of ``asgiref`` is increased from 3.6.0 to 3.7.0.
zh_hans: ``asgiref`` 的最低支持版本已从 3.6.0 增加到 3.7.0。

source: The minimum supported version of ``selenium`` is increased from 3.8.0 to 4.8.0.
zh_hans: ``selenium`` 的最低支持版本已从 3.8.0 增加到 4.8.0。

source: The ``AlreadyRegistered`` and ``NotRegistered`` exceptions are moved from ``django.contrib.admin.sites`` to ``django.contrib.admin.exceptions``.
zh_hans: ``AlreadyRegistered`` 和 ``NotRegistered`` 异常已从 ``django.contrib.admin.sites`` 移动到 ``django.contrib.admin.exceptions``。

source: The minimum supported version of SQLite is increased from 3.21.0 to 3.27.0.
zh_hans: SQLite 的最低支持版本已从 3.21.0 增加到 3.27.0。

source: Support for ``cx_Oracle`` < 8.3 is removed.
zh_hans: 不再支持 ``cx_Oracle`` 版本小于 8.3。

source: Executing SQL queries before the app registry has been fully populated now raises :exc:`RuntimeWarning`.
zh_hans: 在应用程序注册表完全填充之前执行 SQL 查询现在会引发 :exc:`RuntimeWarning`。

source: :exc:`~django.core.exceptions.BadRequest` is raised for non-UTF-8 encoded requests with the :mimetype:`application/x-www-form-urlencoded` content type. See :rfc:`1866` for more details.
zh_hans: 对于非 UTF-8 编码的请求和 :mimetype:`application/x-www-form-urlencoded` 内容类型，将引发 :exc:`~django.core.exceptions.BadRequest` 异常。有关详细信息，请参阅 :rfc:`1866`。

source: The minimum supported version of ``colorama`` is increased to 0.4.6.
zh_hans: ``colorama`` 的最低支持版本已增加到 0.4.6。

source: The minimum supported version of ``docutils`` is increased to 0.19.
zh_hans: ``docutils`` 的最低支持版本已增加到 0.19。

source: Filtering querysets against overflowing integer values now always returns an empty queryset. As a consequence, you may need to use ``ExpressionWrapper()`` to :ref:`explicitly wrap <using-f-with-annotations>` arithmetic against integer fields in such cases.
zh_hans: 过滤查询集以防止整数溢出现在始终返回空查询集。因此，在这种情况下，你可能需要使用 ``ExpressionWrapper()`` 来对整数字段进行算术运算时进行 :ref:`显式包装 <using-f-with-annotations>`。

source: Features deprecated in 5.0
zh_hans: 在 5.0 版本中废弃的功能

source: The ``DjangoDivFormRenderer`` and ``Jinja2DivFormRenderer`` transitional form renderers are deprecated.
zh_hans: ``DjangoDivFormRenderer`` 和 ``Jinja2DivFormRenderer`` 过渡的表单渲染器已被弃用。

source: Passing positional arguments ``name`` and ``violation_error_message`` to :class:`~django.db.models.BaseConstraint` is deprecated in favor of keyword-only arguments.
zh_hans: 将位置参数 ``name`` 和 ``violation_error_message`` 传递给 :class:`~django.db.models.BaseConstraint` 已被弃用，建议使用关键字参数方式。

source: ``request`` is added to the signature of :meth:`.ModelAdmin.lookup_allowed`. Support for ``ModelAdmin`` subclasses that do not accept this argument is deprecated.
zh_hans: ``request`` 已添加到 :meth:`.ModelAdmin.lookup_allowed` 的签名中。不接受此参数的 ``ModelAdmin`` 子类的支持已被弃用。

source: The ``get_joining_columns()`` method of ``ForeignObject`` and ``ForeignObjectRel`` is deprecated. Starting with Django 6.0, ``django.db.models.sql.datastructures.Join`` will no longer fallback to ``get_joining_columns()``. Subclasses should implement ``get_joining_fields()`` instead.
zh_hans: ``ForeignObject`` 和 ``ForeignObjectRel`` 的 ``get_joining_columns()`` 方法已被弃用。从 Django 6.0 开始，``django.db.models.sql.datastructures.Join`` 将不再回退到 ``get_joining_columns()``。子类应该改为实现 ``get_joining_fields()``。

source: The ``ForeignObject.get_reverse_joining_columns()`` method is deprecated.
zh_hans: ``ForeignObject.get_reverse_joining_columns()`` 方法已被弃用。

source: The default scheme for ``forms.URLField`` will change from ``"http"`` to ``"https"`` in Django 6.0. Set :setting:`FORMS_URLFIELD_ASSUME_HTTPS` transitional setting to ``True`` to opt into assuming ``"https"`` during the Django 5.x release cycle.
zh_hans: 在 Django 6.0 中，``forms.URLField`` 的默认方案将从 ``"http"`` 更改为 ``"https"``。在 Django 5.x 发布周期中，将 :setting:`FORMS_URLFIELD_ASSUME_HTTPS` 过渡设置为 ``True`` 以选择假定 ``"https"``。

source: ``FORMS_URLFIELD_ASSUME_HTTPS`` transitional setting is deprecated.
zh_hans: ``FORMS_URLFIELD_ASSUME_HTTPS`` 过渡设置已被弃用。

source: Support for calling ``format_html()`` without passing args or kwargs will be removed.
zh_hans: 不再支持在不传递 args 或 kwargs 的情况下调用 ``format_html()``。

source: Support for ``cx_Oracle`` is deprecated in favor of `oracledb`_ 1.3.2+ Python driver.
zh_hans: 对 ``cx_Oracle`` 的支持已被弃用，建议使用 `oracledb`_ 1.3.2+ Python 驱动程序。

source: ``DatabaseOperations.field_cast_sql()`` is deprecated in favor of ``DatabaseOperations.lookup_cast()``. Starting with Django 6.0, ``BuiltinLookup.process_lhs()`` will no longer call ``field_cast_sql()``. Third-party database backends should implement ``lookup_cast()`` instead.
zh_hans: ``DatabaseOperations.field_cast_sql()`` 已被弃用，建议使用 ``DatabaseOperations.lookup_cast()``。从 Django 6.0 开始，``BuiltinLookup.process_lhs()`` 将不再调用 ``field_cast_sql()``。第三方数据库后端应该改为实现 ``lookup_cast()``。

source: The ``django.db.models.enums.ChoicesMeta`` metaclass is renamed to ``ChoicesType``.
zh_hans: ``django.db.models.enums.ChoicesMeta`` 元类已更名为 ``ChoicesType``。

source: The ``Prefetch.get_current_queryset()`` method is deprecated.
zh_hans: ``Prefetch.get_current_queryset()`` 方法已被弃用。

source: The ``get_prefetch_queryset()`` method of related managers and descriptors is deprecated. Starting with Django 6.0, ``get_prefetcher()`` and ``prefetch_related_objects()`` will no longer fallback to ``get_prefetch_queryset()``. Subclasses should implement ``get_prefetch_querysets()`` instead.
zh_hans: 相关管理器和描述符的 ``get_prefetch_queryset()`` 方法已被弃用。从 Django 6.0 开始，``get_prefetcher()`` 和 ``prefetch_related_objects()`` 将不再回退到 ``get_prefetch_queryset()``。子类应该改为实现 ``get_prefetch_querysets()``。

source: Features removed in 5.0
zh_hans: 在 5.0 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 5.0.
zh_hans: 这些功能已经完成了它们的弃用周期，并在 Django 5.0 中被移除。

source: See :ref:`deprecated-features-4.0` for details on these changes, including how to remove usage of these features.
zh_hans: 有关这些更改的详细信息，包括如何删除对这些功能的使用，请参阅 :ref:`deprecated-features-4.0`。

source: The ``SERIALIZE`` test setting is removed.
zh_hans: ``SERIALIZE`` 测试设置已被移除。

source: The undocumented ``django.utils.baseconv`` module is removed.
zh_hans: 未记录的 ``django.utils.baseconv`` 模块已被移除。

source: The undocumented ``django.utils.datetime_safe`` module is removed.
zh_hans: 未记录的 ``django.utils.datetime_safe`` 模块已被移除。

source: The default value of the ``USE_TZ`` setting is changed from ``False`` to ``True``.
zh_hans: ``USE_TZ`` 设置的默认值已从 ``False`` 更改为 ``True``。

source: The default sitemap protocol for sitemaps built outside the context of a request is changed from ``'http'`` to ``'https'``.
zh_hans: 在不在请求上下文之外构建的站点地图的默认协议已从 ``'http'`` 更改为 ``'https'``。

source: The ``extra_tests`` argument for ``DiscoverRunner.build_suite()`` and ``DiscoverRunner.run_tests()`` is removed.
zh_hans: ``DiscoverRunner.build_suite()`` 和 ``DiscoverRunner.run_tests()`` 的 ``extra_tests`` 参数已被移除。
