Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a data corruption bug with ``datetime_safe.datetime.combine`` (#21256).
id: Diperbaiki sebuah kesalahan rusak data dengan ``datetime_safe.datetime.combine`` (#21256).
zh_hans: 修复了 ``datetime_safe.datetime.combine`` 的数据损坏 Bug (#21256)。

source: Django 1.5 release notes
id: Catatan terbitan Django 1.5
zh_hans: Django 1.5 版本发行说明

source: *February 26, 2013*
id: *Februari 26, 2013*
zh_hans: *2013 年 2 月 26 日*

source: Welcome to Django 1.5!
id: Selamat datang di Django 1.5!
zh_hans: 欢迎来到 Django 1.5 ！

source: These release notes cover the :ref:`new features <whats-new-1.5>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.5>` you'll want to be aware of when upgrading from Django 1.4 or older versions. We've also dropped some features, which are detailed in :ref:`our deprecation plan <deprecation-removed-in-1.5>`, and we've :ref:`begun the deprecation process for some features <deprecated-features-1.5>`.
id: Catatan terbitan ini mencangkupi :ref:`new features <whats-new-1.5>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.5>` anda akan ingin menjadi waspada ketika meningkatkan dari Django 1.4 atau versi terlama. Kami telah membuang beberapa fitur, yang rinciannya di :ref:`our deprecation plan <deprecation-removed-in-1.5>`, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.5>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.5>`，以及从 Django 1.4 或更早版本升级时需要注意的一些 :ref:`不兼容的变化 <backwards-incompatible-1.5>`。我们还删除了一些功能，详细信息请参阅 :ref:`我们的弃用计划 <deprecation-removed-in-1.5>`，并且我们已经 :ref:`开始了某些功能的弃用过程 <deprecated-features-1.5>`。

source: The biggest new feature in Django 1.5 is the `configurable User model`_. Before Django 1.5, applications that wanted to use Django's auth framework (:mod:`django.contrib.auth`) were forced to use Django's definition of a "user". In Django 1.5, you can now swap out the ``User`` model for one that you write yourself. This could be a simple extension to the existing ``User`` model -- for example, you could add a Twitter or Facebook ID field -- or you could completely replace the ``User`` with one totally customized for your site.
id: Fitur baru terbesar di Django 1.5 adalah `configurable User model`_. Sebelum Django 1.5, aplikasi yang menginginkan menggunakan kerangka kerja otentifikasi Django (:mod:`django.contrib.auth`) dipaksa untuk menggunakan pengertian Django dari "user". Di DJango 1.5, anda sekarang dapat menukar model ``User`` untuk satu yang anda tulis sendiri. Ini dapat menjadi sebuah perpanjangan sederhana pada model ``User`` yang ada -- sebagai contoh, anda dapat menambah sebuah bidang ID Twitter atau Facebook -- atau anda dapat secara lengkap mengganti ``User`` dengan satu seluruhnya disesuaiakan untuk situs anda.
zh_hans: Django 1.5 中最重要的新功能是 `可配置的用户模型`_。在 Django 1.5 之前，希望使用 Django 的身份验证框架（:mod:`django.contrib.auth`）的应用程序被强制使用 Django 对 "用户" 的定义。在 Django 1.5 中，现在可以将 ``User`` 模型替换为自己编写的模型。这可以是对现有 ``User`` 模型的简单扩展，例如，您可以添加 Twitter 或 Facebook ID 字段，或者您可以完全替换 ``User``，使用完全为您的站点定制的模型。

source: Django 1.5 is also the first release with `Python 3 support`_! We're labeling this support "experimental" because we don't yet consider it production-ready, but everything's in place for you to start porting your apps to Python 3. Our next release, Django 1.6, will support Python 3 without reservations.
id: Django 1.5 juga terbitan pertama dengan `Python 3 support`_! Kami sedang melabelkan dukungan ini "experimental" karena kami belum mempertimbangkan itu siap-produksi, tetapi semuanya di tempat untuk anda memulai menghubungkan aplikasi anda ke Python 3. Terbitan kami selanjutnya, Django 1.6, akan mendukung Python 3 tanpa pemesanan.
zh_hans: Django 1.5 也是第一个支持 `Python 3`_ 的版本！我们将此支持标记为 "实验性"，因为我们还不认为它已经可以用于生产环境，但已经为您提供了开始将您的应用程序移植到 Python 3 的一切必要条件。我们的下一个发布版，Django 1.6，将完全支持 Python 3，没有任何限制。

source: Other notable new features in Django 1.5 include:
id: Fitur baru penting lainnya di Django 1.5 termasuk:
zh_hans: Django 1.5 中其他值得注意的新功能包括：

source: `Support for saving a subset of model's fields`_ - :meth:`Model.save() <django.db.models.Model.save()>` now accepts an ``update_fields`` argument, letting you specify which fields are written back to the database when you call ``save()``. This can help in high-concurrency operations, and can improve performance.
id: `Support for saving a subset of model's fields`_ - :meth:`Model.save() <django.db.models.Model.save()>` sekarang menerima sebuah argumen ``update_fields``, membiarkan anda menentukan bidang-bidang mana ditulis kembali ke basisdata ketika anda memanggil ``save()``. Ini dapat membantu di operasi tinggi-berbarengan, dan dapat memperbaiki penampilan.
zh_hans: `保存模型字段的子集支持`_ - :meth:`Model.save() <django.db.models.Model.save()>` 现在接受一个 ``update_fields`` 参数，允许您在调用 ``save()`` 时指定要写回数据库的字段。这对于高并发操作和性能优化非常有帮助。

source: Better `support for streaming responses <#explicit-streaming-responses>`_ via the new :class:`~django.http.StreamingHttpResponse` response class.
id: Lebih baik `support for streaming responses <#explicit-streaming-responses>`_ melalui kelas tanggapan :class:`~django.http.StreamingHttpResponse` baru.
zh_hans: 通过新的 :class:`~django.http.StreamingHttpResponse` 响应类，更好地支持 `流式响应 <#explicit-streaming-responses>`_。

source: `GeoDjango`_ now supports PostGIS 2.0.
id: `GeoDjango`_ sekarang mendukung PostGIS 2.0.
zh_hans: `GeoDjango`_ 现在支持 PostGIS 2.0。

source: ... and more; `see below <#what-s-new-in-django-1-5>`_.
id: ... dan lebih; ... and more; `see below <#what-s-new-in-django-1-5>`_.
zh_hans: ... 还有更多; `请参见下面 <#what-s-new-in-django-1-5>`_。

source: Wherever possible we try to introduce new features in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>`. However, as with previous releases, Django 1.5 ships with some minor :ref:`backwards incompatible changes <backwards-incompatible-1.5>`; people upgrading from previous versions of Django should read that list carefully.
id: Dimanapun memungkinkan kami mencoba memperkenalkan fitur baru di sikap bertentangan kebelakang per kebijakan :doc:`our API stability policy </misc/api-stability>`. Bagaimanapun, seperti dengan terbitan sebelumnya, Django 1.5 dibekali dengan beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.5>` kecil; orang meningkatkan dari versi sebelumnya dari Django harus membaca daftar itu hati-hati.
zh_hans: 我们尽量在符合 :doc:`API 稳定政策 </misc/api-stability>` 的情况下引入新功能。然而，与以前的版本一样，Django 1.5 也包含一些轻微的 :ref:`不兼容变更 <backwards-incompatible-1.5>`；从以前版本的 Django 升级的用户应该仔细阅读该列表。

source: One deprecated feature worth noting is the shift to "new-style" :ttag:`url` tag. Prior to Django 1.3, syntax like ``{% url myview %}`` was interpreted incorrectly (Django considered ``"myview"`` to be a literal name of a view, not a template variable named ``myview``). Django 1.3 and above introduced the ``{% load url from future %}`` syntax to bring in the corrected behavior where ``myview`` was seen as a variable.
id: Satu fitur diusangkan yang perlu dicatat adalah bergeser ke etiket "new-style" :ttag:`url`. Sebelum pada Django 1.3, sintaksis seperti ``{% url myview %}`` telah ditafsirkan tidak benar (Django menganggap ``"myview"`` menjadi nama harfiah dari sebuah tampilan, bukan sebuah variabel cetakan bernama ``myview``). Django 1.3 dan diatasnya memperkenalkan sintaksis ``{% load url from future %}`` untuk membawa perilaku diperbaiki ``myview`` telah dilihat sebagai sebuah variabel.
zh_hans: 一个已经弃用的特性值得注意的是转向“新风格” :ttag:`url` 标记。在 Django 1.3 之前，类似 ``{% url myview %}`` 的语法被错误地解释（Django 将 ``"myview"`` 视为一个视图的字面名称，而不是一个名为 ``myview`` 的模板变量）。Django 1.3 及以上版本引入了 ``{% load url from future %}`` 的语法，以引入已修正的行为，其中 ``myview`` 被视为一个变量。

source: The upshot of this is that if you are not using ``{% load url from future %}`` in your templates, you'll need to change tags like ``{% url myview %}`` to ``{% url "myview" %}``. If you *were* using ``{% load url from future %}`` you can simply remove that line under Django 1.5
id: Hasil dari ini adalah bahwa jika anda tidak menggunakan ``{% load url from future %}`` di cetakan anda, anda akan butuh merubah etiket seperti ``{% url myview %}`` menjadi ``{% url "myview" %}``. Jika anda *sedang* menggunakan ``{% load url from future %}`` anda dapat cukup memindahkan baris itu dibawah Django 1.5
zh_hans: 这个要点是，如果你的模板中没有使用 ``{% load url from future %}``，你需要将类似 ``{% url myview %}`` 这样的标记更改为 ``{% url "myview" %}``。如果你 *曾经* 使用了 ``{% load url from future %}``，在 Django 1.5 及以上版本中，你可以简单地删除那行代码。

source: Django 1.5 requires Python 2.6.5 or above, though we **highly recommend** Python 2.7.3 or above. Support for Python 2.5 and below has been dropped.
id: Django 1.5 membutuhkan Python 2.6.5 atau diatas, meskipun kami **sangat menganjurkan** Python 2.7.3 atau diatas. Dukungan untuk Python 2.5 dan dibawah telah dibuang.
zh_hans: Django 1.5 要求使用 Python 2.6.5 或更高版本，但我们 **强烈建议** 使用 Python 2.7.3 或更高版本。不再支持 Python 2.5 及以下版本。

source: This change should affect only a small number of Django users, as most operating-system vendors today are shipping Python 2.6 or newer as their default version. If you're still using Python 2.5, however, you'll need to stick to Django 1.4 until you can upgrade your Python version. Per :doc:`our support policy </internals/release-process>`, Django 1.4 will continue to receive security support until the release of Django 1.6.
id: Perubahan ini seharusnya berakibat hanya angka kecil dari pengguna Django, seperti kebanyakan penjaja sistem operasi hari ini yang membekali Python 2.6 atau terbaru sebagai versi awal mereka. Jika anda masih menggunakan Python 2.5, bagaimanapun, anda akan butuh melekat ke Django 1.4 sampai anda dapat meningkatkan; per :doc:`kebijakan dukungan kami </internals/release-process>`, Django 1.4 akan lanjut menerima dukungan keamanan sampai terbitan dari Django 1.6.
zh_hans: 这个变化应该只影响少数 Django 用户，因为今天大多数操作系统供应商默认安装 Python 2.6 或更新版本。然而，如果你仍在使用 Python 2.5，你需要继续使用 Django 1.4，直到你可以升级到支持的 Python 版本。根据 :doc:`我们的支持政策 </internals/release-process>`，Django 1.4 将在 Django 1.6 发布之前继续获得安全支持。

source: Django 1.5 does not run on a Jython final release, because Jython's latest release doesn't currently support Python 2.6. However, Jython currently does offer an alpha release featuring 2.7 support, and Django 1.5 supports that alpha release.
id: Django 1.5 tidak berjalan pada Jython terbitan akhir, karena terbitan terakhir Jython tidak saat ini mendukung Python 2.6. Bagaimanapun, Jython saat ini tidak menawarkan terbitan alpha menampilkan dukungan 2.7, dan Django 1.5 mendukung terbitan alpha tersebut.
zh_hans: Django 1.5 无法在 Jython 的最终版本上运行，因为 Jython 的最新版本目前不支持 Python 2.6 。然而，Jython 目前确实提供了一个具有 2.7 支持的 alpha 版本，而 Django 1.5 支持该 alpha 版本。

source: Python 3 support
id: Mendukung Python 3
zh_hans: Python 3 支持

source: Django 1.5 introduces support for Python 3 - specifically, Python 3.2 and above. This comes in the form of a **single** codebase; you don't need to install a different version of Django on Python 3. This means that you can write applications targeted for just Python 2, just Python 3, or single applications that support both platforms.
id: Django 1.5 memperkenalkan dukungan untuk Python 3 - secara khusus, Python 3.2 dan diatas. Ini datang di bentuk dasar kode **tunggal**; anda tidak butuh memasang versi berbeda dari Django di Python 3. Ini berarti bahwa anda dapat menulis aplikasi disasar untuk hanya Python 2, hanya Python 3, atau aplikasi tunggal yang mendukung kedua serambi.
zh_hans: Django 1.5 引入了对 Python 3 的支持 - 具体而言，是 Python 3.2 及以上版本。这以 **单一** 代码库的形式呈现；你不需要在 Python 3 上安装不同版本的 Django。这意味着你可以编写针对仅 Python 2、仅 Python 3 或同时支持两个平台的单一应用程序。

source: However, we're labeling this support "experimental" for now: although it's received extensive testing via our automated test suite, it's received very little real-world testing. We've done our best to eliminate bugs, but we can't be sure we covered all possible uses of Django.
id: Bagaimanapun, kami sedang melabelkan dukungan "experimental" ini untuk sekarang: meskipun itu menerima percobaan panjang melalui deretan percobaan otomatis kami, itu menerima sangat sedikit percobaan dunia-nyata. Kami telah melakukan yang terbaik untuk mengurangi kesalahan, tetapi kami tidak dapat memastikan kami mencangkupi semua kemungkinan penggunaan Django.
zh_hans: 然而，我们现在将这种支持标记为“实验性”的：尽管它通过我们的自动化测试套件接受了广泛的测试，但在现实世界中的测试非常少。我们已尽最大努力消除错误，但不能确保涵盖了 Django 的所有可能用途。

source: Some features of Django aren't available because they depend on third-party software that hasn't been ported to Python 3 yet, including:
id: Beberapa fitur dari Django tidak tersedia karena mereka tergantung pada perangkat lunak pihak-ketiga yang belum dihubungkan ke Pyhton 3, termasuk:
zh_hans: 由于某些功能依赖尚未移植到 Python 3 的第三方软件，因此 Django 的部分功能无法使用，包括：

source: the MySQL database backend (depends on MySQLdb)
id: Backend basisdata MySQL (tergantung pada MySQLdb)
zh_hans: MySQL 数据库后端（依赖于 MySQLdb）

source: :class:`~django.db.models.ImageField` (depends on PIL)
id: :class:`~django.db.models.ImageField` (tergantung pada PIL)
zh_hans: :class:`~django.db.models.ImageField` （依赖于 PIL）

source: :class:`~django.test.LiveServerTestCase` (depends on Selenium WebDriver)
id: :class:`~django.test.LiveServerTestCase` (tergantung pada Selenium WebDriver)
zh_hans: :class:`~django.test.LiveServerTestCase` （依赖于 Selenium WebDriver）

source: Further, Django's more than a web framework; it's an ecosystem of pluggable components. At this point, very few third-party applications have been ported to Python 3, so it's unlikely that a real-world application will have all its dependencies satisfied under Python 3.
id: Lebih jauh, Django lebih dari sekedar kerangka kerja jaringan; itu adalah sebuah ekosistem komponen dapat ditanam. Pada titik ini, sangat sedikit aplikasi pihak-ketiga telah dihubungkan ke Python 3, jadi itu tidak mungkin bahwa aplikasi dunia-nyata akan mempunyai semua ketergantungannya terpuaskan dibawah Python 3.
zh_hans: 此外，Django 不仅仅是一个 Web 框架；它还是一个可插拔组件的生态系统。目前，很少有第三方应用程序已移植到 Python 3，因此现实世界中的应用程序在 Python 3 下满足所有依赖关系的可能性很小。

source: Thus, we're recommending that Django 1.5 not be used in production under Python 3. Instead, use this opportunity to begin porting applications to Python 3. If you're an author of a pluggable component, we encourage you to start porting now.
id: Dengan demikian, kami menganjurkan bahwa Django 1.5 tidak digunakan dalam produksi dibawah Python 3. Sebagai gantinya, gunakan kesempatan ini untuk memulai penghubungan aplikasi-aplikasi ke Python 3. Jika anda seorang penulis dari sebuah komponen tertanam, kami mendorong anda memulai penghubungan sekarang.
zh_hans: 因此，我们建议不要在 Python 3 下使用 Django 1.5 进行生产。相反，借此机会开始将应用程序移植到 Python 3 。如果您是一个可插拔组件的作者，我们鼓励您现在开始移植。

source: We plan to offer first-class, production-ready support for Python 3 in our next release, Django 1.6.
id: Kami berencana untuk menawarkan kelas-pertama, dukunagn siap-produksi untuk Python 3 di terbitan kami selanjutnya, Django 1.6.
zh_hans: 我们计划在下一个版本 Django 1.6 中为 Python 3 提供一流的、生产就绪的支持。

source: What's new in Django 1.5
id: Apa yang baru di Django 1.5
zh_hans: Django 1.5 中的新功能

source: Configurable User model
id: Model User Dikonfigurasi
zh_hans: 可配置的用户模型

source: In Django 1.5, you can now use your own model as the store for user-related data. If your project needs a username with more than 30 characters, or if you want to store user's names in a format other than first name/last name, or you want to put custom profile information onto your User object, you can now do so.
id: Dalam Django 1.5, anda sekarang dapat menggunakan model anda sendiri sebagai penyimpanan untuk data terkait-pengguna. Jika proyek anda butuh nama pengguna lebih dari 30 karakter, atau jika anda ingin menyimpan nama pengguna dalam bentuk lainnya dari pada nama pertama/nama terakhir, atau anda ingin menaruh informasi profil penyesuaian kedalam obyek User anda, anda dapat sekarang melakukannya.
zh_hans: 在 Django 1.5 中，您现在可以使用自己的模型作为存储用户相关数据的存储。如果您的项目需要一个超过 30 个字符的用户名，或者您想要以除姓/名之外的格式存储用户的名字，或者您想要将自定义的个人资料信息添加到您的用户对象上，您现在可以这样做。

source: If you have a third-party reusable application that references the User model, you may need to make some changes to the way you reference User instances. You should also document any specific features of the User model that your application relies upon.
id: Jika anda mempunyai aplikasi dapat digunakan kembali pihak-ketiga yang mengacu model User, anda mungkin butuh membuat beberapa perubahan ke cara anda mengacu instance User. Anda harus juga mendokumentasikan fitur khusus apapun dari model User yang aplikasi anda bergantung.
zh_hans: 如果您有一个引用 User 模型的第三方可重用应用程序，您可能需要对引用 User 实例的方式进行一些更改。您还应记录您的应用程序所依赖的 User 模型的任何特定功能。

source: See the :ref:`documentation on custom user models <auth-custom-user>` for more details.
id: Lihat :ref:`documentation on custom user models <auth-custom-user>` untuk lebih rinci.
zh_hans: 请查看 :ref:`自定义用户模型的文档 <auth-custom-user>` 以获取更多详细信息。

source: Support for saving a subset of model's fields
id: Mendukung untuk menyimpan subset dari bidang model
zh_hans: 支持保存模型字段的子集

source: The method :meth:`Model.save() <django.db.models.Model.save()>` has a new keyword argument ``update_fields``. By using this argument it is possible to save only a select list of model's fields. This can be useful for performance reasons or when trying to avoid overwriting concurrent changes.
id: Cara :meth:`Model.save() <django.db.models.Model.save()>` mempunyai argumen kata kunci baru ``update_fields``. Dengan menggunakan argumen ini itu memungkinkan menyimpan hanya memilih daftar bidang model. Ini dapat berguna untuk alasan penampilan atau ketika mencoba menghindari perubahan penimpaan bersama-sama.
zh_hans: 方法 :meth:`Model.save() <django.db.models.Model.save()>` 现在有一个新的关键字参数 ``update_fields``。通过使用这个参数，可以仅保存模型字段的选择列表。这在性能方面或在尝试避免覆盖并发更改时可能很有用。

source: Deferred instances (those loaded by ``.only()`` or ``.defer()``) will automatically save just the loaded fields. If any field is set manually after load, that field will also get updated on save.
id: Instance yang ditunda (itu dimuat oleh ``.only()`` atau ``.defer()``) akan otomatis menyimpan hanya bidang yang dimuat. Jika bidang apapun disetel secara manual setelah dimuat, bidang itu akan juga mendapatkan terperbaharui pada penyimpanan.
zh_hans: 被延迟加载的实例（通过 ``.only()`` 或 ``.defer()`` 加载的实例）将自动保存仅加载的字段。如果在加载后手动设置了任何字段，这些字段在保存时也将得到更新。

source: See the :meth:`Model.save() <django.db.models.Model.save()>` documentation for more details.
id: Lihat dokumentasi :meth:`Model.save() <django.db.models.Model.save()>` untuk lebih rinci.
zh_hans: 请查看 :meth:`Model.save() <django.db.models.Model.save()>` 的文档以获取更多详细信息。

source: Caching of related model instances
id: Menyimpan sementara dari instance model terkait
zh_hans: 缓存相关模型实例

source: When traversing relations, the ORM will avoid re-fetching objects that were previously loaded. For example, with the tutorial's models:
zh_hans: 在遍历关系时，ORM 将避免重新获取之前已加载的对象。例如，使用教程中的模型：

source: In Django 1.5, the third line no longer triggers a new SQL query to fetch ``first_choice.poll``; it was set by the second line.
id: Di Django 1.5, baris ketiga tidak lagi membangkitkan permintaan SQL baru untuk mengambil ``first_choice.poll``; itu telah disetel oleh baris kedua.
zh_hans: 在 Django 1.5 中，第三行不再触发新的 SQL 查询来获取 ``first_choice.poll``；它已经由第二行设置了。

source: For one-to-one relationships, both sides can be cached. For many-to-one relationships, only the single side of the relationship can be cached. This is particularly helpful in combination with ``prefetch_related``.
id: Untuk hubungan one-to-one, kedua sisi dapat disimpan. Untuk hubungan many-to-one, hanya sisi tunggal dari hubungan dapat disimpan. Ini terutama sangat membantu di perpaduan dengan ``prefetch_related``.
zh_hans: 对于一对一关系，双方都可以被缓存。对于多对一关系，只能缓存关系的单一一方。这在与 ``prefetch_related`` 结合使用时特别有帮助。

source: Explicit support for streaming responses
id: Secara eksplisit mendukung tanggapan mengalir
zh_hans: 明确支持流式响应

source: Before Django 1.5, it was possible to create a streaming response by passing an iterator to :class:`~django.http.HttpResponse`. But this was unreliable: any middleware that accessed the :attr:`~django.http.HttpResponse.content` attribute would consume the iterator prematurely.
id: Sebelum Django 1.5, itu memungkinkan membuat tanggapan mengalir dengan melewatkan sebuah perulangan pada :class:`~django.http.HttpResponse`. Tetapi ini tidak handal: middleware apapun yang mengakses atribut :attr:`~django.http.HttpResponse.content` akan memakan perulangan secara dini.
zh_hans: 在 Django 1.5 之前，可以通过将迭代器传递给 :class:`~django.http.HttpResponse` 来创建流式响应。但这是不可靠的：任何访问 :attr:`~django.http.HttpResponse.content` 属性的中间件都会提前消耗迭代器。

source: You can now explicitly generate a streaming response with the new :class:`~django.http.StreamingHttpResponse` class. This class exposes a :class:`~django.http.StreamingHttpResponse.streaming_content` attribute which is an iterator.
id: Anda dapat secara eksplisit membangkitkan tanggapan mengalir dengan kelas :class:`~django.http.StreamingHttpResponse` baru. Kelas ini membuka atribut :class:`~django.http.StreamingHttpResponse.streaming_content` yang merupakan sebuah perulangan.
zh_hans: 现在，你可以使用新的 :class:`~django.http.StreamingHttpResponse` 类明确生成流式响应。这个类公开了一个 :class:`~django.http.StreamingHttpResponse.streaming_content` 属性，它是一个迭代器。

source: Since :class:`~django.http.StreamingHttpResponse` does not have a ``content`` attribute, middleware that needs access to the response content must test for streaming responses and behave accordingly.
id: Sejak :class:`~django.http.StreamingHttpResponse` tidak mempunyai atribut ``content``, middleware yang butuh mengakses ke isi tanggapan harus mencoba untuk tanggapan mengalir dan berperilaku sesuai.
zh_hans: 由于 :class:`~django.http.StreamingHttpResponse` 没有 ``content`` 属性，需要访问响应内容的中间件必须检测流式响应并相应地处理。

source: ``{% verbatim %}`` template tag
id: Etiket cetakan ``{% verbatim %}``
zh_hans: ``{% verbatim %}`` 模板标签

source: To make it easier to deal with JavaScript templates which collide with Django's syntax, you can now use the :ttag:`verbatim` block tag to avoid parsing the tag's content.
id: Untuk membuatnya lebih mudah berurusan dengan cetakan JavaScript yang bertabrakan dengan sintaksis Django, anda dapat sekarang menggunakan etiket blok :ttag:`verbatim` untuk menghindari mengurai isi etiket.
zh_hans: 为了更轻松地处理与 Django 语法冲突的 JavaScript 模板，你现在可以使用 :ttag:`verbatim` 块标签来避免解析标签的内容。

source: Retrieval of ``ContentType`` instances associated with proxy models
id: Pengambilan dari instance ``ContentType`` terkait dengan model proxy
zh_hans: 检索与代理模型相关联的 ``ContentType`` 实例

source: The methods :meth:`ContentTypeManager.get_for_model() <django.contrib.contenttypes.models.ContentTypeManager.get_for_model()>` and :meth:`ContentTypeManager.get_for_models() <django.contrib.contenttypes.models.ContentTypeManager.get_for_models()>` have a new keyword argument – respectively ``for_concrete_model`` and ``for_concrete_models``. By passing ``False`` using this argument it is now possible to retrieve the :class:`ContentType <django.contrib.contenttypes.models.ContentType>` associated with proxy models.
zh_hans: 方法 :meth:`ContentTypeManager.get_for_model() <django.contrib.contenttypes.models.ContentTypeManager.get_for_model()>` 和 :meth:`ContentTypeManager.get_for_models() <django.contrib.contenttypes.models.ContentTypeManager.get_for_models()>` 现在有一个新的关键字参数，分别是 ``for_concrete_model`` 和 ``for_concrete_models``。通过使用这个参数并传递 ``False``，现在可以检索与代理模型相关联的 :class:`ContentType <django.contrib.contenttypes.models.ContentType>`。

source: New ``view`` variable in class-based views context
id: Variabel ``view`` baru di konteks tampilan berdasarkan-kelas
zh_hans: 类基视图上下文中的新变量 ``view``
