Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Again, these are just the big features that will affect the most users. Users upgrading from previous versions of Django are heavily encouraged to consult the complete list of :ref:`backwards-incompatible changes <backwards-incompatible-changes-1.2>` and the list of :ref:`deprecated features <deprecated-features-1.2>`.
id: Kembali, ini hanya fitur besar yang akan mempengaruhi kebanyakan pengguna. Pengguna meningkatkan dari versi sebelumnya dari Django didorong untuk konsultasi daftar lengkap dari :ref:`backwards-incompatible changes <backwards-incompatible-changes-1.2>` dan daftar dari :ref:`deprecated features <deprecated-features-1.2>`.
zh_hans: 再次强调，这些只是会影响大多数用户的主要功能。从以前版本的 Django 升级的用户强烈建议查看完整的 :ref:`不向后兼容的更改列表 <backwards-incompatible-changes-1.2>` 和 :ref:`不建议使用的功能列表 <deprecated-features-1.2>`。

source: While not a new feature, it's important to note that Django 1.2 introduces the first shift in our Python compatibility policy since Django's initial public debut. Previous Django releases were tested and supported on 2.x Python versions from 2.3 up; Django 1.2, however, drops official support for Python 2.3. As such, the minimum Python version required for Django is now 2.4, and Django is tested and supported on Python 2.4, 2.5 and 2.6, and will be supported on the as-yet-unreleased Python 2.7.
id: Selama bukan fitur baru, adalah penting untuk dicatat bahwa Django 1.2 memperkenalkan perpindahan pertama dalam kesesuaian Python kami sejak permulaan tampil umum. Terbitan Django sebelumnya telah diuji dan didukung pada versi Python 2.x dari 2.3 keatas; Django 1.2, bagaimanapun, menjatuhkan dukungan resmi untuk Python 2.3. Dengan demikian, versi Python minimal dibutuhkan untuk Django sekarang adalah 2.4, dan Django diuji dan didukung pada Python 2.4, 2.5 dan 2.6, dan akan didukung pada yang belum pernah diterbitkan Python 2.7.
zh_hans: 虽然这不是一个新功能，但值得注意的是，自 Django 首次公开亮相以来，Django 1.2 首次改变了我们的 Python 兼容性政策。以前的 Django 版本已经过测试并支持从 2.3 开始的 2.x Python 版本；然而，Django 1.2 放弃了对 Python 2.3 的官方支持。因此，现在 Django 所需的最低 Python 版本为 2.4，Django 已经过测试并支持 Python 2.4 、 2.5 和 2.6，并将支持尚未发布的 Python 2.7 。

source: This change should affect only a small number of Django users, as most operating-system vendors today are shipping Python 2.4 or newer as their default version. If you're still using Python 2.3, however, you'll need to stick to Django 1.1 until you can upgrade; per :doc:`our support policy </internals/release-process>`, Django 1.1 will continue to receive security support until the release of Django 1.3.
id: Perubahan ini seharusnya berakibat hanya angka kecil dari pengguna Django, seperti kebanyakan penjaja sistem operasi hari ini yang membekali Python 2.4 atau memperbaharui versi awal mereka. Jika anda masih menggunakan Python 2.3, bagaimanapun, anda akan butuh melekat ke Django 1.1 sampai anda dapat meningkatkan; per :doc:`kebijakan dukungan kami </internals/release-process>`, Django 1.1 akan lanjut menerima dukungan keamanan sampai terbitan dari Django 1.3.
zh_hans: 这个变化应该只会影响少数 Django 用户，因为大多数操作系统供应商现在都默认安装 Python 2.4 或更新的版本。然而，如果你仍然在使用 Python 2.3，那么你需要继续使用 Django 1.1，直到你可以升级为止；根据 :doc:`我们的支持政策 </internals/release-process>`，Django 1.1 将在 Django 1.3 发布之前继续获得安全支持。

source: A roadmap for Django's overall 2.x Python support, and eventual transition to Python 3.x, is currently being developed, and will be announced prior to the release of Django 1.3.
id: Sebuah peta jalan untuk dukungan keseluruhan Python 2.x Django, dan akhirnya berpindah ke Python 3.x, saat ini sedang dikembangkan, dan akan diumumkan sebelum terbitan dari Django 1.3.
zh_hans: Django 针对整体 2.x Python 支持的发展路线图以及最终过渡到 Python 3.x 的计划目前正在制定中，并将在 Django 1.3 发布之前宣布。

source: What's new in Django 1.2
id: Apa yang baru di Django 1.2
zh_hans: Django 1.2 新特性

source: Support for multiple databases
id: Mendukung untuk banyak basisdata
zh_hans: 支持多数据库

source: Django 1.2 adds the ability to use :doc:`more than one database </topics/db/multi-db>` in your Django project. Queries can be issued at a specific database with the ``using()`` method on ``QuerySet`` objects. Individual objects can be saved to a specific database by providing a ``using`` argument when you call ``save()``.
id: Django 1.2 menambahkan kemampuan untuk menggunakan :doc:`lebih dari satu basisdata </topics/db/multi-db>` di proyek Django anda. Permintaan dapat diterbitkan pada basisdata khusus dengan menggunakan metode ``using()`` pada obyek ``QuerySet``. Obyek tersendiri dapat disimpan pada basisdata khusus dengan menyediakan argumen ``using`` ketika anda memanggil ``save()``.
zh_hans: Django 1.2 增加了在你的 Django 项目中使用 :doc:`多个数据库 </topics/db/multi-db>` 的能力。可以使用 ``QuerySet`` 对象上的 ``using()`` 方法在特定数据库上发出查询。在调用 ``save()`` 时，可以通过提供 ``using`` 参数将单个对象保存到特定的数据库。

source: Model validation
id: Validasi model
zh_hans: 模型验证

source: Model instances now have support for :ref:`validating their own data <validating-objects>`, and both model and form fields now accept configurable lists of :doc:`validators </ref/validators>` specifying reusable, encapsulated validation behavior. Note, however, that validation must still be performed explicitly. Simply invoking a model instance's ``save()`` method will not perform any validation of the instance's data.
id: Instance model sekarang telah mendukung untuk :ref:`validating their own data <validating-objects>`, dan kedua model bidang formulir sekarang menerima daftar dapat dikonfigurasi dari :doc:`validators </ref/validators>` menentukan dapat digunakan kembali, mengemas perilaku pengesahan. Catat, bagaimanapun, pengesahan itu harus masih dilakukan secara eksplisit. Cukup meminta sebuah metode ``save()`` instance model tidak akan melakukan pengesahan apapun dari data instance.
zh_hans: 模型实例现在支持 :ref:`验证自己的数据 <validating-objects>`，而且模型字段和表单字段现在都接受可配置的 :doc:`验证器列表 </ref/validators>`，指定了可重用的封装的验证行为。但是，请注意，验证仍然必须显式地执行。只是调用模型实例的 ``save()`` 方法不会对实例的数据执行任何验证。

source: Improved CSRF protection
id: Perbaikan perlindungan CSRF
zh_hans: 改进的 CSRF 保护

source: Django now has much improved protection against :doc:`Cross-Site Request Forgery (CSRF) attacks</ref/csrf>`. This type of attack occurs when a malicious website contains a link, a form button or some JavaScript that is intended to perform some action on your website, using the credentials of a logged-in user who visits the malicious site in their browser. A related type of attack, "login CSRF," where an attacking site tricks a user's browser into logging into a site with someone else's credentials, is also covered.
id: Django sekarang mempunyai banyak peningkatan perlindungan terhadap :doc:`Serangan Cross-Site Request Forgery (CSRF)</ref/csrf>`. Jenis serangan ini muncuk ketika situs jahat mengandung sebuah tautan, sebuah tombol formulir atau beberapa JavaScript yang berusaha melakukan beberapa tindakan pada situs jaringan anda, menggunakan mandat dari pengguna masuk yang mengunjungi situs jahat di peramban mereka. Jenis terkait dari serangan, "login CSRF," dimana sebuah situs penyerang mengelabui perambah pengguna kedalam pemasukan kedalam sebuah situs dengan mandat orang lain, juga dicakupi.
zh_hans: Django 现在在防范 :doc:`跨站请求伪造（CSRF）攻击 </ref/csrf>` 方面有了更加完善的保护。这种类型的攻击发生在恶意网站包含一个链接、一个表单按钮或一些 JavaScript，旨在使用已登录用户的凭据在其浏览器中访问恶意网站的用户来执行某些操作。相关的一种攻击类型是“登录 CSRF”，其中攻击站点欺骗用户的浏览器，使其使用别人的凭据登录到某个站点，这也得到了覆盖。

source: Messages framework
id: Kerangka pesan
zh_hans: 消息框架

source: Django now includes a robust and configurable :doc:`messages framework </ref/contrib/messages>` with built-in support for cookie- and session-based messaging, for both anonymous and authenticated clients. The messages framework replaces the deprecated user message API and allows you to temporarily store messages in one request and retrieve them for display in a subsequent request (usually the next one).
id: Django sekarang menyertakan :doc:`kerangka pesan </ref/contrib/messages>` yang kuat dan dapat dikonfigurasi dengan dukungan siap-pakai untuk berdasar pesan kue- dan sesi, untuk kedua anonim dan klien terperiksa keasliannya. Kerangka pesan menggantikan API pesan pengguna usang dan mengizinkan anda untuk sementara menyimpan pesan dalam satu permintaan dan menarik mereka untuk ditampilkan dalam permintaan berikut (biasanya selanjutnya).
zh_hans: Django 现在包括一个强大且可配置的 :doc:`消息框架 </ref/contrib/messages>`，内置支持基于 cookie 和会话的消息传递，适用于匿名和已验证的客户端。消息框架替代了不建议使用的用户消息 API，并允许你在一个请求中临时存储消息，然后在后续请求中检索它们以显示（通常是下一个请求）。

source: Object-level permissions
id: Tingkat-obyek perizinan
zh_hans: 对象级权限

source: A foundation for specifying permissions at the per-object level has been added. Although there is no implementation of this in core, a custom authentication backend can provide this implementation and it will be used by :class:`django.contrib.auth.models.User`. See the :doc:`authentication docs </topics/auth/index>` for more information.
id: Sebuah yayasan untuk menentukan perizinan pada tingkatan per obyek telah ditambahkan. Meskipun tidak ada penerapan dari ini dalam inti, backend pembuktian keaslian penyesuaian dapat menyediakan penerapan ini dan akan dipakai oleh :class:`django.contrib.auth.models.User`. Lihat :doc:`authentication docs </topics/auth/index>` untuk informasi lebih.
zh_hans: 已添加了在每个对象级别指定权限的基础。尽管核心中没有此功能的实现，但自定义身份验证后端可以提供此实现，并将被 :class:`django.contrib.auth.models.User` 使用。有关更多信息，请参阅 :doc:`身份验证文档 </topics/auth/index>`。

source: Permissions for anonymous users
id: Perizinan untuk pengguna anonim
zh_hans: 匿名用户的权限

source: If you provide a custom auth backend with ``supports_anonymous_user`` set to ``True``, AnonymousUser will check the backend for permissions, just like User already did. This is useful for centralizing permission handling - apps can always delegate the question of whether something is allowed or not to the authorization/authentication backend. See the :doc:`authentication docs </topics/auth/index>` for more details.
id: Jika anda menyediakan backend pembuktian keaslian penyesuaian dengan ``supports_anonymous_user`` disetel ke ``True``, AnonymousUser akan memeriksa backend untuk perizinan, sama seperti User telah lakukan. Ini sangan berguna untuk memusatkan penganganan perizinan - aplikasi dapat selalu menugaskan pertanyaan apakah sesuatu diizinkan atau tidak ke backend otorisasi/pembuktian keaslian. Lihat :doc:`dokumentasi pembuktian keaslian </topics/auth/index>` untuk lebih rinci.
zh_hans: 如果你提供一个自定义的身份验证后端，并将 ``supports_anonymous_user`` 设置为 ``True``，那么 AnonymousUser 将像 User 一样检查后端的权限。这对于集中处理权限非常有用 - 应用程序始终可以将是否允许某些操作的问题委托给授权/身份验证后端。有关更多详细信息，请参阅 :doc:`身份验证文档 </topics/auth/index>`。

source: Relaxed requirements for usernames
id: Persyaratan santai untuk nama pengguna
zh_hans: 放宽用户名要求

source: The built-in :class:`~django.contrib.auth.models.User` model's :attr:`~django.contrib.auth.models.User.username` field now allows a wider range of characters, including ``@``, ``+``, ``.`` and ``-`` characters.
id: Bidang :class:`~django.contrib.auth.models.User` siap-pakai :attr:`~django.contrib.auth.models.User.username` model sekarang mengizinkan jangkauan luas dari karakter, termasuk karakter ``@``, ``+``, ``.`` and ``-``.
zh_hans: 内置的 :class:`~django.contrib.auth.models.User` 模型的 :attr:`~django.contrib.auth.models.User.username` 字段现在允许更广泛范围的字符，包括 ``@``、``+``、``.`` 和 ``-`` 字符。

source: Email backends
id: Backend surel
zh_hans: 邮件后端

source: You can now :ref:`configure the way that Django sends email <topic-email-backends>`. Instead of using SMTP to send all email, you can now choose a configurable email backend to send messages. If your hosting provider uses a sandbox or some other non-SMTP technique for sending mail, you can now construct an email backend that will allow Django's standard :doc:`mail sending methods</topics/email>` to use those facilities.
id: Anda dapat sekarang :ref:`mengkonfigurasi cara Django mengirim surel <topic-email-backends>`. Daripada menggunakan SMTP untuk mengirim semua surel, anda dapat sekarang memilih backend surel dikonfigurasi untuk mengirim surel. Jika penyedia rumah anda menggunakan bak pasir atau beberapa lainnya teknik bukan-SMTP untuk mengirim surat, anda dapat sekarang membangun sebuah surel yang akan mengizinkan standar Django :doc:`mail sending methods</topics/email>` untuk menggunakan fasilitas tersebut.
zh_hans: 现在你可以 :ref:`配置 Django 发送电子邮件的方式 <topic-email-backends>`。不再使用 SMTP 来发送所有电子邮件，你现在可以选择一个可配置的电子邮件后端来发送消息。如果你的托管提供商使用沙盒或其他非-SMTP 发送邮件的技术，你现在可以构建一个电子邮件后端，使 Django 的标准 :doc:`邮件发送方法</topics/email>` 可以使用这些设施。

source: This also makes it easier to debug mail sending. Django ships with backend implementations that allow you to send email to a :ref:`file<topic-email-file-backend>`, to the :ref:`console<topic-email-console-backend>`, or to :ref:`memory<topic-email-memory-backend>`. You can even configure all email to be :ref:`thrown away<topic-email-dummy-backend>`.
id: Ini juga membuatnya mudah untuk mencari kesalahan pengiriman surat. Django mengirim dengan penerapan backend yang mengizinkan anda mengirim surat ke :ref:`file<topic-email-file-backend>`, ke :ref:`console<topic-email-console-backend>`, atau ke :ref:`memory<topic-email-memory-backend>`. Anda dapat bahkan mengkonfigurasi semua surel untuk menjadi :ref:`thrown away<topic-email-dummy-backend>`.
zh_hans: 这也使得调试邮件发送更加容易。Django 提供了后端实现，允许你将电子邮件发送到 :ref:`文件<topic-email-file-backend>`、:ref:`控制台<topic-email-console-backend>`，或 :ref:`内存<topic-email-memory-backend>`。你甚至可以配置所有的电子邮件都被 :ref:`丢弃<topic-email-dummy-backend>`。

source: "Smart" :ttag:`if` tag
id: Etiket "Smart" :ttag:`if`
zh_hans: "智能" :ttag:`if` 标签

source: The :ttag:`if` tag has been upgraded to be much more powerful. First, we've added support for comparison operators. No longer will you have to type:
id: Etiket :ttag:`if` telah ditingkatkan ke lebih kuat. Pertama, kami telah menambahkan dukungan untuk perbandingan penghubung. Tidak lagi akan anda ketik:
zh_hans: :ttag:`if` 标签已升级为更加强大。首先，我们增加了对比较运算符的支持。你不再需要输入如下内容：

source: You can now do this:
id: Anda dapat sekarang melakukan ini:
zh_hans: 现在你可以这样做：

source: There's really no reason to use ``{% ifequal %}`` or ``{% ifnotequal %}`` anymore, unless you're the nostalgic type.
id: Tidak ada alasan untuk menggunakan``{% ifequal %}`` atau ``{% ifnotequal %}`` lagi, meskipun anda adalah jenis yang rindu.
zh_hans: 除非你是怀旧型的，否则没有理由再使用 ``{% ifequal %}`` 或 ``{% ifnotequal %}``。

source: The operators supported are ``==``, ``!=``, ``<``, ``>``, ``<=``, ``>=``, ``in`` and ``not in``, all of which work like the Python operators, in addition to ``and``, ``or`` and ``not``, which were already supported.
id: Penghubung yang didukung adalah ``==``, ``!=``, ``<``, ``>``, ``<=``, ``>=``, ``in`` dan ``not in``, semua yang bekerja seperti penghubung Python, sebagai tambahan pada ``and``, ``or`` dan ``not``, yang sudah didukung.
zh_hans: 支持的运算符包括 ``==``、``!=``、``<``、``>``、``<=``、``>=``、``in`` 和 ``not in``，它们都像 Python 运算符一样工作，此外还支持 ``and``、``or`` 和 ``not``，这些已经被支持了。

source: Also, filters may now be used in the ``if`` expression. For example:
id: Juga, penyaring sekarang dapat digunakan dalam pernyataan ``if``. Sebagai contoh:
zh_hans: 此外，现在可以在 ``if`` 表达式中使用过滤器。例如：

source: Template caching
id: Cetakan penyembunyian
zh_hans: 模板缓存

source: In previous versions of Django, every time you rendered a template, it would be reloaded from disk. In Django 1.2, you can use a :ref:`cached template loader <template-loaders>` to load templates once, then cache the result for every subsequent render. This can lead to a significant performance improvement if your templates are broken into lots of smaller subtemplates (using the ``{% extends %}`` or ``{% include %}`` tags).
id: Di versi Django sebelumnya, setiap kali anda membangun sebuah cetakan, itu akan dimuat kembali dari cakram. Di Django 1.2, anda dapat menggunakan :ref:`cached template loader <template-loaders>` untuk memuat cetakan sekali, kemudian menembolok hasil untuk setiap pembangun berikutnya. Ini akan membawa ke perbaikan penampilan yang signifikan jika cetakan anda dipecah kedalam banyak sub cetakan kecil (menggunakan etiket ``{% extends %}`` atau ``{% include %}``).
zh_hans: 在之前的 Django 版本中，每次渲染模板时都会重新从磁盘加载。在 Django 1.2 中，你可以使用 :ref:`缓存模板加载器 <template-loaders>` 来加载模板一次，然后为每个后续的渲染缓存结果。如果你的模板被拆分成许多较小的子模板（使用 ``{% extends %}`` 或 ``{% include %}`` 标签），这可以导致显著的性能提升。

source: As a side effect, it is now much easier to support non-Django template languages.
id: Sebagai efek samping, itu sekarang lebih mudah mendukung bahasa cetakan bukan-Django.
zh_hans: 作为一个副作用，现在更容易支持非 Django 模板语言。

source: Class-based template loaders
id: Pemuat cetakan berdasarkan kelas
zh_hans: 基于类的模板加载器

source: As part of the changes made to introduce `Template caching`_ and following a general trend in Django, the template loaders API has been modified to use template loading mechanisms that are encapsulated in Python classes as opposed to functions, the only method available until Django 1.1.
id: Sebagai bagian dari perubahan dibuat untuk memperkenalkan `Template caching`_ dan mengikuti tren umum di Django, cetakan pemuat API telah dirubah untuk menggunakan mekanisme pemuat cetakan yang dibungkus dalam kelas-kelas Python sebagai lawan dari fungsi, hanya metode tersedia sampai Django 1.1.
zh_hans: 作为引入 `模板缓存`_ 所做的更改的一部分，并遵循 Django 中的一般趋势，模板加载器 API 已经被修改为使用封装在 Python 类中的模板加载机制，而不是像 Django 1.1 中只有函数可用。

source: All the template loaders :ref:`shipped with Django <template-loaders>` have been ported to the new API but they still implement the function-based API and the template core machinery still accepts function-based loaders (builtin or third party) so there is no immediate need to modify your ``TEMPLATE_LOADERS`` setting in existing projects, things will keep working if you leave it untouched up to and including the Django 1.3 release.
id: Semua pemuat cetakan :ref:`shipped with Django <template-loaders>` telah ditaruh pada API baru tetapi mereka masih menerapkan API berdasarkan-fungsi dan perlengkapan utama cetakan amsih menerima pemuat berdasarkan-fungsi (siap pakai atau pihak ketiga) jadi tidak ada kebutuhan segera untuk merubah pengaturan ``TEMPLATE_LOADERS`` anda dalam proyek yang ada, hal-hal akan tetap bekerja jika anda membiarkannya tidak tersentuh dan menyertakan terbitan Django 1.3.
zh_hans: 所有 :ref:`随 Django 一起提供的模板加载器 <template-loaders>` 都已经转换到新的 API，但它们仍然实现了基于函数的 API，而模板核心机制仍然接受基于函数的加载器（内置或第三方的），因此在现有项目中不需要立即修改你的 ``TEMPLATE_LOADERS`` 设置，如果你不更改它，事情将一直正常工作，直到 Django 1.3 版本为止。

source: If you have developed your own custom template loaders we suggest to consider porting them to a class-based implementation because the code for backwards compatibility with function-based loaders starts its deprecation process in Django 1.2 and will be removed in Django 1.4. There is a description of the API these loader classes must implement in the template API reference and you can also examine the source code of the loaders shipped with Django.
id: Jika anda telah mengembangkan pemuat cetakan penyesuaian anda kami menyarankan mempertimbangkan menautkan mereka ke penerapan berdasarkan-kelas karena kode untuk kesesuaian kebelakang dengan pemuat berdasarkan-fungsi memulai pengolahan pengusangannya di Django 1.2 dan akan dipindahkan di Django 1.4. Ada sebuah gambaran dari API kelas-kelas pemuat ini harus diterapkan di acuan cetakan API dan anda dapat juga menguji kode sumber dari pemuat yang dibekali dengan Django.
zh_hans: 如果你已经开发了自己的自定义模板加载器，我们建议考虑将它们移植到基于类的实现，因为在 Django 1.2 中，与基于函数的加载器向后兼容的代码开始被弃用，并将在 Django 1.4 中移除。在模板 API 参考中有关于这些加载器类必须实现的 API 的描述，你还可以查看随 Django 附带的加载器的源代码。

source: Natural keys in fixtures
id: Kunci alami di perlengkapan
zh_hans: 固定装置中的自然键

source: Fixtures can now refer to remote objects using :ref:`topics-serialization-natural-keys`. This lookup scheme is an alternative to the normal primary-key based object references in a fixture, improving readability and resolving problems referring to objects whose primary key value may not be predictable or known.
id: Alat bantu sekarang dapat mengacu pada obyek terpencil menggunakan :ref:`topics-serialization-natural-keys`. Skema pencarian ini adalah sebuah pilihan lain untuk primary-key biasa berdasarkan obyek acuan di alat bantu, meningkatkan kesiapan dan mengatasi masalah mengacu pada obyek yang nilai primary key mungkin tidak dapat diprediksi atau dikenal.
zh_hans: 现在，可以使用 :ref:`topics-serialization-natural-keys` 来引用远程对象的固定数据。这种查找方案是一种替代传统基于主键的对象引用的方式，可以提高可读性，并解决引用那些主键值可能不可预测或未知的对象的问题。

source: Fast failure for tests
id: Kegagalan cepat untuk percobaan
zh_hans: 测试的快速失败

source: Both the :djadmin:`test` subcommand of ``django-admin.py`` and the ``runtests.py`` script used to run Django's own test suite now support a ``--failfast`` option. When specified, this option causes the test runner to exit after encountering a failure instead of continuing with the test run. In addition, the handling of ``Ctrl-C`` during a test run has been improved to trigger a graceful exit from the test run that reports details of the tests that were run before the interruption.
id: Kedua sub perintah :djadmin:`test` dari ``django-admin.py`` dan tulisan ``runtests.py`` digunakan untuk menjalankan deretan percobaan sendiri Django sekarang mendukung -- pilihan ``--failfast``. Ketika menentukan, pilihan ini menyebabkan penjalan percobaan keluar setelah menghadapi kegagalan daripada melanjutkan dengan percobaan berjalan. Sebagai tambahan, penanganan dari ``Ctrl-C`` selama percobaan berjalan telah diperbaiki untuk memicu keluar yang anggun dari percobaan berjalan yang melaporkan rincian dari percobaan yang telah dijalankan sebelum gangguan.
zh_hans: ``django-admin.py`` 的 :djadmin:`test` 子命令和用于运行 Django 自己的测试套件的 ``runtests.py`` 脚本现在都支持 ``--failfast`` 选项。当指定此选项时，测试运行器在遇到失败后会退出，而不是继续运行测试。此外，在测试运行期间改进了对 ``Ctrl-C`` 的处理，触发了从测试运行中优雅退出，并报告中断前运行的测试的详细信息。

source: Models can now use a 64-bit :class:`~django.db.models.BigIntegerField` type.
id: Model dapat sekarang menggunakan jenis :class:`~django.db.models.BigIntegerField` 64-bit.
zh_hans: 现在，模型可以使用 64 位的 :class:`~django.db.models.BigIntegerField` 类型。

source: Improved localization
id: Perbaikan lokalisasi
zh_hans: 改善的本地化

source: Django's :doc:`internationalization framework </topics/i18n/index>` has been expanded with locale-aware formatting and form processing. That means, if enabled, dates and numbers on templates will be displayed using the format specified for the current locale. Django will also use localized formats when parsing data in forms. See :doc:`/topics/i18n/formatting` for more details.
id: :doc:`internationalization framework </topics/i18n/index>` Django telah diperluas dengan bentukan sadar-lokal dan pengolahan formulir. Itu berarti, jika diadakan, tanggal dan angka pada cetakan akan ditampilkan menggunakan bentuk ditentukan untuk lokal saat ini. Django akan juga menggunakan bentuk lokalisasi ketika mengurai data dalam formulir. Lihat :doc:`/topics/i18n/formatting` untuk rincian lebih.
zh_hans: Django 的 :doc:`国际化框架 </topics/i18n/index>` 已经扩展了，具备了区域感知的格式化和表单处理功能。这意味着，如果启用了国际化，模板中的日期和数字将使用当前区域设置指定的格式进行显示。Django 还会在解析表单中的数据时使用本地化格式。有关更多详细信息，请参阅 :doc:`/topics/i18n/formatting`。

source: ``readonly_fields`` in ``ModelAdmin``
id: ``readonly_fields`` di ``ModelAdmin``
zh_hans: ``ModelAdmin`` 中的 ``readonly_fields``

source: :attr:`django.contrib.admin.ModelAdmin.readonly_fields` has been added to enable non-editable fields in add/change pages for models and inlines. Field and calculated values can be displayed alongside editable fields.
id: :attr:`django.contrib.admin.ModelAdmin.readonly_fields` telah ditambahkan untuk mengadakan bidang tidak dapat disunting dalam halaman tambah/rubah untuk model dan berderet. Bidang dan nilai dihitung dapat ditampilkan bersama bidang dapat disunting.
zh_hans: :attr:`django.contrib.admin.ModelAdmin.readonly_fields` 已经被添加，用于在模型和内联的添加/更改页面上启用不可编辑的字段。字段和计算值可以显示在可编辑字段旁边。
