Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django used to send the :data:`~django.core.signals.request_finished` signal as soon as the view function returned a response. This interacted badly with :ref:`streaming responses <httpresponse-streaming>` that delay content generation.
id: Django terbiasa mengirim sinyal :data:`~django.core.signals.request_finished` segera setelah fungsi tampilan mengembalikan sebuah tanggapan. Ini berinteraksi buruk dengan :ref:`streaming responses <httpresponse-streaming>` yang menunda pembangkitan isi.
zh_hans: Django 曾经在视图函数返回响应后立即发送 :data:`~django.core.signals.request_finished` 信号。这与延迟内容生成的 :ref:`流式响应 <httpresponse-streaming>` 产生了不良互动。

source: This signal is now sent after the content is fully consumed by the WSGI gateway. This might be backwards incompatible if you rely on the signal being fired before sending the response content to the client. If you do, you should consider using :doc:`middleware </topics/http/middleware>` instead.
id: Sinyal ini sekarang terkirim setelah isi sepenuhnya dikonsumsi oleh pintu gerbang WSGI. Ini mungkin bertentangan kebelakang jika anda mengandalkan pada sinyal sedang dinyalakan sebelum mengirim isi tanggapan ke klien. Jika anda lakukan, anda harus mempertimbangkan menggunakan :doc:`middleware </topics/http/middleware>` sebagai gantinya.
zh_hans: 现在，该信号在内容被 WSGI 网关完全消耗后发送。如果您依赖于在将响应内容发送给客户端之前触发信号，这可能会导致不兼容。如果是这样，您应该考虑使用 :doc:`中间件 </topics/http/middleware>`。

source: Some WSGI servers and middleware do not always call ``close`` on the response object after handling a request, most notably uWSGI prior to 1.2.6 and Sentry's error reporting middleware up to 2.0.7. In those cases the ``request_finished`` signal isn't sent at all. This can result in idle connections to database and memcache servers.
id: Beberapa peladen WSGI dan middleware tidak selalu memanggil ``close`` pada obyek tanggapan setelah menangani sebuah permintaan, kebanyakan terutama uWSGI sebelum 1.2.6 dan middleware pelaporan kesalahan Sentry sampai 2.0.7. Di kasus tersebut sinyal ``request_finished`` tidak dikirim sama sekali. Ini dapat menghasilkan sebuah hubungan diam ke basisdata dan peladen memcache.
zh_hans: 一些 WSGI 服务器和中间件在处理请求后并不总是调用响应对象的 ``close`` 方法，特别是在 1.2.6 之前的 uWSGI 和 Sentry 的错误报告中间件在 2.0.7 之前的版本中存在这个问题。在这些情况下，``request_finished`` 信号根本不会被发送。这可能导致数据库和内存缓存服务器上的空闲连接。

source: OPTIONS, PUT and DELETE requests in the test client
id: Permintaan OPTIONS, PUT dan DELETE di klien percobaan
zh_hans: 测试客户端中的 OPTIONS 、 PUT 和 DELETE 请求

source: Unlike GET and POST, these HTTP methods aren't implemented by web browsers. Rather, they're used in APIs, which transfer data in various formats such as JSON or XML. Since such requests may contain arbitrary data, Django doesn't attempt to decode their body.
id: Tidak seperti GET dan POST, metode HTTP ini tidak diterapkan oleh peramban jaringan. Sebaliknya mereka digunakan dalam API, yang memindahkan data dalam beragam bentuk seperti JSON atau XML. Sejak permintaan itu mungkin mengandung data yang berubah-ubah, Django tidak berusaha menyandi badan mereka.
zh_hans: 与 GET 和 POST 不同，这些 HTTP 方法并不由 Web 浏览器实现。相反，它们在 API 中使用，用于以各种格式（如 JSON 或 XML）传输数据。由于此类请求可能包含任意数据，Django 不会尝试解码其主体。

source: However, the test client used to build a query string for OPTIONS and DELETE requests like for GET, and a request body for PUT requests like for POST. This encoding was arbitrary and inconsistent with Django's behavior when it receives the requests, so it was removed in Django 1.5.
id: Bagaimanapun, klien percobaan terbiasa membangun sebuah permintaan deretan karakter untuk permintaan OPTIONS dan DELETE seperti untuk GET, dan sebuah badan permintaan seperti untuk POST. Penyandian ini adalah berubah-ubah dan tidak tetap dengan perilaku Django ketika itu menerima permintaan, jadi itu telah dipindahkan di Django 1.5.
zh_hans: 然而，用于构建 OPTIONS 和 DELETE 请求的测试客户端与 GET 请求一样构建查询字符串，而用于构建 PUT 请求的测试客户端与 POST 请求一样构建请求体。这种编码方式是任意的，并且与 Django 接收请求时的行为不一致，因此在 Django 1.5 中已被移除。

source: If you were using the ``data`` parameter in an OPTIONS or a DELETE request, you must convert it to a query string and append it to the ``path`` parameter.
id: Jika anda sedang menggunakan parameter ``data`` dalam sebuah permintaan OPTION atau DELETE, anda harus merubahnya menjadi permintaan deretan karakter dan menambahkannya ke parameter ``path``.
zh_hans: 如果您在 OPTIONS 或 DELETE 请求中使用了 ``data`` 参数，您必须将其转换为查询字符串并附加到 ``path`` 参数中。

source: If you were using the ``data`` parameter in a PUT request without a ``content_type``, you must encode your data before passing it to the test client and set the ``content_type`` argument.
id: Jika anda sedang menggunakan parameter ``data`` dalam sebuah permintaan PUT tanpa ``content_type``, anda harus menyandi data anda sebelum melewatkannya ke klien percobaan dan menyetel argumen ``content_type``.
zh_hans: 如果您在没有 ``content_type`` 的情况下在 PUT 请求中使用了 ``data`` 参数，您必须在将其传递给测试客户端之前对数据进行编码，并设置 ``content_type`` 参数。

source: System version of ``simplejson`` no longer used
id: Versi sistem dari ``simplejson`` tidak lagi digunakan
zh_hans: 系统版本的 ``simplejson`` 不再使用

source: :ref:`As explained below <simplejson-deprecation>`, Django 1.5 deprecates ``django.utils.simplejson`` in favor of Python 2.6's built-in :mod:`json` module. In theory, this change is harmless. Unfortunately, because of incompatibilities between versions of ``simplejson``, it may trigger errors in some circumstances.
id: :ref:`As explained below <simplejson-deprecation>`, Django 1.5 mengusangkan ``django.utils.simplejson`` dalam mendukung modul :mod:`json` siap-pakai Python 2.6. Dalam teori, perubahan ini tidak berbahaya. Sayangnya, karena ketidaksesuaian diantara versi dari ``simplejson``, itu mungkin membangkitkan kesalahan di beberapa keadaan.
zh_hans: 正如下文所解释的那样，Django 1.5 弃用了 ``django.utils.simplejson``，而推荐使用 Python 2.6 内置的 :mod:`json` 模块。理论上，这个更改是无害的。不幸的是，由于不同版本的 ``simplejson`` 之间的不兼容性，它可能在某些情况下触发错误。

source: JSON-related features in Django 1.4 always used ``django.utils.simplejson``. This module was actually:
id: Fitur terkait-JSON di Django 1.4 selalu menggunakan ``django.utils.simplejson``. Modul ini adalah sebenarnya:
zh_hans: Django 1.4 中与 JSON 相关的功能始终使用了 ``django.utils.simplejson``。这个模块实际上是：

source: A system version of ``simplejson``, if one was available (i.e. ``import simplejson`` works), if it was more recent than Django's built-in copy or it had the C speedups, or
zh_hans: 如果有一个系统版本的 ``simplejson``，如果有的话（即 ``import simplejson`` 能正常工作），如果它比 Django 内置的版本更新，或者它具有 C 加速，或者

source: The :mod:`json` module from the standard library, if it was available (i.e. Python 2.6 or greater), or
zh_hans: 标准库中的 :mod:`json` 模块，如果可用（即 Python 2.6 或更高版本），或者

source: A built-in copy of version 2.0.7 of ``simplejson``.
id: Sebuah salinan siap-pakai dari versi 2.0.7 dari ``simplejson``.
zh_hans: 一个内置版本的 ``simplejson``，版本号为 2.0.7。

source: In Django 1.5, those features use Python's :mod:`json` module, which is based on version 2.0.9 of ``simplejson``.
id: Di Django 1.5, fitur itu menggunakan modul :mod:`json` Python, yang berdasarkan pada versi 2.0.9 dari ``simplejson``.
zh_hans: 在 Django 1.5 中，这些功能使用了 Python 的 :mod:`json` 模块，该模块基于 ``simplejson`` 版本 2.0.9。

source: There are no known incompatibilities between Django's copy of version 2.0.7 and Python's copy of version 2.0.9. However, there are some incompatibilities between other versions of ``simplejson``:
id: Ada ketidakkesesuaian tidak dikenal diantara salinan Django versi 2.0.7 dan salinan Python versi 2.0.9. Bagaimanapun, ada beberapa ketidak sesuaian diantara versi lain dari ``simplejson``:
zh_hans: 目前没有已知的 Django 内置版本 2.0.7 与 Python 版本 2.0.9 之间的不兼容性。但是，其他版本的 ``simplejson`` 存在一些不兼容性：

source: While the ``simplejson`` API is documented as always returning Unicode strings, the optional C implementation can return a bytestring. This was fixed in Python 2.7.
zh_hans: 虽然 ``simplejson`` 的 API 文档中始终说明返回 Unicode 字符串，但可选的 C 实现可以返回字节串。这个问题在 Python 2.7 中已经修复。

source: ``simplejson.JSONEncoder`` gained a ``namedtuple_as_object`` keyword argument in version 2.2.
id: ``simplejson.JSONEncoder`` mendapatkan sebuah argumen kata kunci ``namedtuple_as_object`` di versi 2.2.
zh_hans: ``simplejson.JSONEncoder`` 在版本 2.2 中新增了一个关键字参数 ``namedtuple_as_object``。

source: More information on these incompatibilities is available in :ticket:`ticket #18023 <18023#comment:10>`.
zh_hans: 有关这些不兼容性的更多信息可以在 :ticket:`ticket #18023 <18023#comment:10>` 中找到。

source: The net result is that, if you have installed ``simplejson`` and your code uses Django's serialization internals directly -- for instance ``django.core.serializers.json.DjangoJSONEncoder``, the switch from ``simplejson`` to :mod:`json` could break your code. (In general, changes to internals aren't documented; we're making an exception here.)
id: Hasil bersih adalah bahwa, jika anda telah memasang ``simplejson`` dan kode anda menggunakan serialisasi Django internal secara langsung -- sebagai contoh ``django.core.serializers.json.DjangoJSONEncoder``, pergantian dari ``simplejson`` ke :mod:`json` dapat merusak kode anda. (Pada umumnya, perubahan pada internal tidak didokumentasikan; kami sedang membuat sebuah pengecualian disini.)
zh_hans: 总的来说，如果你安装了 ``simplejson`` 并且你的代码直接使用了 Django 的序列化内部，例如 ``django.core.serializers.json.DjangoJSONEncoder``，从 ``simplejson`` 切换到 :mod:`json` 可能会破坏你的代码。（一般情况下，对内部的更改不会被记录在文档中；我们在这里做了一个例外。）

source: At this point, the maintainers of Django believe that using :mod:`json` from the standard library offers the strongest guarantee of backwards-compatibility. They recommend to use it from now on.
id: Pada titik ini, perawat Django percaya bahwa menggunakan :mod:`json` dari pustaka standar menawarkan jaminan paling kuat dari kesesuaian-kebelakang. Mereka mengajurkan menggunakannya dari sekarang.
zh_hans: 目前，Django 的维护者认为使用标准库中的 :mod:`json` 提供了最强的向后兼容性保证。他们建议从现在开始使用它。

source: String types of hasher method parameters
id: Jenis deretan karakter dari parameter metode pengacak
zh_hans: 哈希方法参数的字符串类型

source: If you have written a :ref:`custom password hasher <auth_password_storage>`, your ``encode()``, ``verify()`` or ``safe_summary()`` methods should accept Unicode parameters (``password``, ``salt`` or ``encoded``). If any of the hashing methods need bytestrings, you can use the :func:`~django.utils.encoding.force_bytes` utility to encode the strings.
zh_hans: 如果你编写了一个自定义的密码哈希器（:ref:`自定义密码哈希器 <auth_password_storage>`），你的 ``encode()``、``verify()`` 或 ``safe_summary()`` 方法应该接受 Unicode 参数（``password``、``salt`` 或 ``encoded``）。如果哈希方法中需要字节串，你可以使用 :func:`~django.utils.encoding.force_bytes` 实用程序来编码字符串。

source: Validation of previous_page_number and next_page_number
id: Pemeriksaan dari previous_page_number dan next_page_number
zh_hans: 验证 previous_page_number 和 next_page_number

source: When using :doc:`object pagination </topics/pagination>`, the ``previous_page_number()`` and ``next_page_number()`` methods of the :class:`~django.core.paginator.Page` object did not check if the returned number was inside the existing page range. It does check it now and raises an :exc:`~django.core.paginator.InvalidPage` exception when the number is either too low or too high.
id: Ketika menggunakan metode :doc:`object pagination </topics/pagination>`, ``previous_page_number()`` dan ``next_page_number()`` dari obyek :class:`~django.core.paginator.Page` tidak memeriksa jika nomor yang dikembalikan didalam jangkauan halaman yang ada. Itu melakukan pemeriksaan itu sekarang dan memunculkan pengecualian :exc:`~django.core.paginator.InvalidPage` ketika nomornya terlalu kecil atau terlalu tinggi.
zh_hans: 在使用 :doc:`对象分页 </topics/pagination>` 时，:class:`~django.core.paginator.Page` 对象的 ``previous_page_number()`` 和 ``next_page_number()`` 方法现在会检查返回的页码是否在现有的页面范围内。如果页码过低或过高，它们将引发 :exc:`~django.core.paginator.InvalidPage` 异常。

source: Behavior of autocommit database option on PostgreSQL changed
id: Perilaku pilihan basisdata perbaikan otomatis pada PostgreSQL berubah
zh_hans: PostgreSQL 中 autocommit 数据库选项的行为已更改

source: PostgreSQL's autocommit option didn't work as advertised previously. It did work for single transaction block, but after the first block was left the autocommit behavior was never restored. This bug is now fixed in 1.5. While this is only a bug fix, it is worth checking your applications behavior if you are using PostgreSQL together with the autocommit option.
id: Pilihan perbaikan otomatis PostgreSQL tidak bekerja seperti dinyatakan sebelumnya. Itu bekerja untuk blok transaksi tunggal, tetapi setelah blok pertama meninggalkan perilaku perbaikan otomatis tidak pernah disimpan kembali. Kesalahan ini sekarang diperbaiki di 1.5. Selagi ini hanya sebuah perbaikan kesalahan, itu adalah berharga memeriksa perilaku aplikasi anda jika anda sedang menggunakan PostgreSQL bersama-sama dengan pilihan perbaikan otomatis.
zh_hans: PostgreSQL 的自动提交选项在以前的广告中没有按照预期工作。对于单个事务块确实有效，但是在第一个块结束后，自动提交行为没有被恢复。这个错误在 1.5 版本中已经修复。虽然这只是一个错误修复，但如果你正在使用 PostgreSQL 与自动提交选项，值得检查你的应用程序的行为。

source: Session not saved on 500 responses
id: Sesi tidak menyimpan pada 500 tanggapan
zh_hans: 500 响应时会话未保存。

source: Django's session middleware will skip saving the session data if the response's status code is 500.
id: Sesi middleware Django akan melewati menyimpan sesi data jika kode keadaan tanggapan adalah 500.
zh_hans: 如果响应的状态码是 500，Django 的会话中间件将跳过保存会话数据。

source: Email checks on failed admin login
id: Pemeriksaan surel pada admin masuk gagal
zh_hans: 管理员登录失败时进行电子邮件检查。

source: Prior to Django 1.5, if you attempted to log into the admin interface and mistakenly used your email address instead of your username, the admin interface would provide a warning advising that your email address was not your username. In Django 1.5, the introduction of :ref:`custom user models <auth-custom-user>` has required the removal of this warning. This doesn't change the login behavior of the admin site; it only affects the warning message that is displayed under one particular mode of login failure.
id: Sebelum Django 1.5, jika anda berusaha masuk kedalam antarmuka admin dan salah menggunakan alamat surel anda daripada nama pengguna, antarmuka admin akan menyediakan sebuah peringatan menyarankan bahwa alamat surel anda bukan nama pengguna anda. Dalam Django 1.5, perkenalan dari :ref:`custom user models <auth-custom-user>` telah mewajibkan perpindahan peringatan ini. Ini tidak merubah perilaku masuk dari situs admin; itu hanya mempengaruhi pesan peringatan yang ditampilkan dibawah satu suasana tertentu dari kegagalan masuk.
zh_hans: 在 Django 1.5 之前，如果您尝试登录到管理员界面并错误地使用电子邮件地址而不是用户名，管理员界面会提供警告，建议您的电子邮件地址不是用户名。在 Django 1.5 中，引入了 :ref:`自定义用户模型 <auth-custom-user>`，需要删除此警告。这不会改变管理员站点的登录行为；它只影响在一种特定的登录失败模式下显示的警告消息。

source: Changes in tests execution
id: Perubahan di pengerjaan percobaan
zh_hans: 测试执行的变化

source: Some changes have been introduced in the execution of tests that might be backward-incompatible for some testing setups:
id: Beberapa perubahan telah diperkenalkan di pengerjaan dari percobaan yang mungkin ketidaksesuaian-kebelakang untuk beberapa penyetelan percobaan:
zh_hans: 一些关于测试执行的变化已经引入，这可能对某些测试设置不兼容。

source: Database flushing in ``django.test.TransactionTestCase``
id: Basisdata mengalir di ``django.test.TransactionTestCase``
zh_hans: 在 ``django.test.TransactionTestCase`` 中进行数据库刷新操作

source: Previously, the test database was truncated *before* each test run in a :class:`~django.test.TransactionTestCase`.
id: Sebelumnya, percobaan basisdata telah dipotong *sebelum* setiap percpbaan berjalan di :class:`~django.test.TransactionTestCase`.
zh_hans: 在 :class:`~django.test.TransactionTestCase` 中，在每次测试运行之前对测试数据库进行截断操作。

source: In order to be able to run unit tests in any order and to make sure they are always isolated from each other, :class:`~django.test.TransactionTestCase` will now reset the database *after* each test run instead.
id: Untuk dapat menjalankan unit percobaan di setiap urutan dan memastikan mereka selalu terpencil dari setiap lainnya. :class:`~django.test.TransactionTestCase` akan sekarang menyetel kembali basisdata *setelah* setiap percobaan berjalan.
zh_hans: 为了能够以任何顺序运行单元测试，并确保它们始终相互隔离，:class:`~django.test.TransactionTestCase` 现在会在每次测试运行之后重置数据库。

source: No more implicit DB sequences reset
id: Tidak ada lagi tersirat menyetel kembali urutan DB
zh_hans: 不再隐式重置数据库序列

source: :class:`~django.test.TransactionTestCase` tests used to reset primary key sequences automatically together with the database flushing actions described above.
id: Percobaan :class:`~django.test.TransactionTestCase` digunakan untuk menyetel kembali urutan primary key secara otomatis bersama-sama dengan tindakan membilas basisdata digambarkan diatas.
zh_hans: :class:`~django.test.TransactionTestCase` 测试过去会自动重置主键序列，以及上述描述的数据库刷新操作。

source: This has been changed so no sequences are implicitly reset. This can cause :class:`~django.test.TransactionTestCase` tests that depend on hard-coded primary key values to break.
id: Ini telah dirubah sehingga tidak ada urutan secara mutlak disetel kembali. Ini dapat menyebabkan percobaan :class:`~django.test.TransactionTestCase` yang tergantung pada nilai primay key kode-keras rusak.
zh_hans: 这已经改变，所以不会隐式重置任何序列。这可能导致依赖于硬编码主键值的 :class:`~django.test.TransactionTestCase` 测试出现问题。

source: The new :attr:`~django.test.TransactionTestCase.reset_sequences` attribute can be used to force the old behavior for :class:`~django.test.TransactionTestCase` that might need it.
id: Atribut :attr:`~django.test.TransactionTestCase.reset_sequences` baru dapat digunakan untuk memaksa perilaku lama untuk :class:`~django.test.TransactionTestCase` yang mungkin membutuhkannya.
zh_hans: 新的 :attr:`~django.test.TransactionTestCase.reset_sequences` 属性可以用于强制对可能需要的 :class:`~django.test.TransactionTestCase` 使用旧的行为。

source: Ordering of tests
id: Urutan dari percobaan
zh_hans: 测试的顺序

source: In order to make sure all ``TestCase`` code starts with a clean database, tests are now executed in the following order:
id: Untuk memastikan semua kode ``TestCase`` mulai dengan basisdata bersih, percobaan sekarang dijalankan di urutan berikut:
zh_hans: 为了确保所有的 ``TestCase`` 代码都从一个干净的数据库开始运行，测试现在按照以下顺序执行：

source: First, all unit tests (including :class:`unittest.TestCase`, :class:`~django.test.SimpleTestCase`, :class:`~django.test.TestCase` and :class:`~django.test.TransactionTestCase`) are run with no particular ordering guaranteed nor enforced among them.
zh_hans: 首先，运行所有单元测试（包括 :class:`unittest.TestCase`、:class:`~django.test.SimpleTestCase`、:class:`~django.test.TestCase` 和 :class:`~django.test.TransactionTestCase`），它们之间没有特定的顺序保证或强制执行。

source: Then any other tests (e.g. doctests) that may alter the database without restoring it to its original state are run.
id: Kemudian setiap percobaan lainnya (sebagai contoh doctests) yang mengubah basisdata tanpa menyimpan kembali dia ke keadaan aslinya berjalan.
zh_hans: 然后运行可能会更改数据库而不将其还原为原始状态的任何其他测试（例如 doctests）。

source: This should not cause any problems unless you have existing doctests which assume a :class:`~django.test.TransactionTestCase` executed earlier left some database state behind or unit tests that rely on some form of state being preserved after the execution of other tests. Such tests are already very fragile, and must now be changed to be able to run independently.
id: Ini seharusnya tidak menyebabkan masalah apapun meskipun anda mempunyai dokumen percobaan yang ada yang mengganggap :class:`~django.test.TransactionTestCase` dijalankan lebih awal meninggalkan beberapa keadaan basisdata dibelakang atau unit percobaan yang bergantung pada beberapa bentuk dari keadaan menjadi diawetkan setelah pengerjaan dari percobaan lain. Percobaan tersebut sudah sangat rapuh, dan hrus sekarang dirubah untuk dapat berjalan secara berdiri sendiri.
zh_hans: 这不应该导致任何问题，除非你有一些现有的 doctests 假设之前执行过一个 :class:`~django.test.TransactionTestCase` 留下了一些数据库状态，或者单元测试依赖于在其他测试执行后保留某种状态。这样的测试已经非常脆弱，现在必须进行更改以能够独立运行。

source: ``cleaned_data`` dictionary kept for invalid forms
zh_hans: 为无效表单保留的 ``cleaned_data`` 字典

source: The :attr:`~django.forms.Form.cleaned_data` dictionary is now always present after form validation. When the form doesn't validate, it contains only the fields that passed validation. You should test the success of the validation with the :meth:`~django.forms.Form.is_valid()` method and not with the presence or absence of the :attr:`~django.forms.Form.cleaned_data` attribute on the form.
id: Kamus :attr:`~django.forms.Form.cleaned_data` sekarang selalu hadir setelah pengesahan formulir. Ketika formulir tidak disahkan, itu hanya mengandung bidang yang melewatkan pengesahan. Anda harus mencoba keberhasilan dari pengesahan dengan metode :meth:`~django.forms.Form.is_valid()` dan bukan dengan kehadiran atau ketidakhadiran dari atribut :attr:`~django.forms.Form.cleaned_data` di formulir.
zh_hans: 现在，经过表单验证后，总是存在 :attr:`~django.forms.Form.cleaned_data` 字典。当表单未通过验证时，它仅包含通过验证的字段。您应该使用 :meth:`~django.forms.Form.is_valid()` 方法来测试验证的成功与否，而不是通过表单上的 :attr:`~django.forms.Form.cleaned_data` 属性的存在或缺失来判断。

source: Behavior of ``syncdb`` with multiple databases
id: Perilaku dari ``syncdb`` dengan banyak basisdata
zh_hans: 关于多个数据库的 ``syncdb`` 的行为

source: ``syncdb`` now queries the database routers to determine if content types (when :mod:`~django.contrib.contenttypes` is enabled) and permissions (when :mod:`~django.contrib.auth` is enabled) should be created in the target database. Previously, it created them in the default database, even when another database was specified with the ``--database`` option.
id: ``syncdb`` sekarang meminta perute basisdata untuk menentukan jika jenis isi (ketika :mod:`~django.contrib.contenttypes` adalah diadakan) dan perizinan (ketika :mod:`~django.contrib.auth` adalah diadakan) harus dibuat di basisdata sasaran. Sebelumnya, itu membuat mereka di basisdata awalan, bahkan ketika basisdata lain telah ditentukan dengan pilihan ``--database``.
zh_hans: 现在，``syncdb`` 会查询数据库路由器，以确定在目标数据库中是否应创建内容类型（当启用 :mod:`~django.contrib.contenttypes` 时）和权限（当启用 :mod:`~django.contrib.auth` 时）。以前，即使使用 ``--database`` 选项指定了另一个数据库，它也会在默认数据库中创建它们。

source: If you use ``syncdb`` on multiple databases, you should ensure that your routers allow synchronizing content types and permissions to only one of them. See the docs on the :ref:`behavior of contrib apps with multiple databases <contrib_app_multiple_databases>` for more information.
id: Jika anda menggunakan ``syncdb`` pada banyak basisdata, anda harus memastikan bahwa perute mengizinkan menyeimbangkan jenis isi dan perizinan untuk hanya satu dari mereka. Lihat dokumentasi di :ref:`behavior of contrib apps with multiple databases <contrib_app_multiple_databases>` untuk informasi lebih.
zh_hans: 如果您在多个数据库上使用 ``syncdb``，应确保您的路由器只允许将内容类型和权限同步到其中一个数据库。有关更多信息，请参阅 :ref:`多数据库中的 contrib 应用程序行为 <contrib_app_multiple_databases>` 的文档。

source: XML deserializer will not parse documents with a DTD
id: Deserial XML tidak akan mengurai dokumen dengan DTD
zh_hans: XML 反序列化器不会解析带有 DTD 的文档。
