Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: When you run :djadmin:`makemessages` from the root directory of your project, any extracted strings will now be automatically distributed to the proper app or project message file. See :ref:`how-to-create-language-files` for details.
id: Ketika anda menjalankan :djadmin:`makemessages` dari direktori akar dari proyek anda, setiap string yang diambil akan sekarang otomatis disebarkan ke aplikasi sesuai atau berkas pesan proyek. Lihat :ref:`how-to-create-language-files` untuk rincian.
zh_hans: 当你在项目的根目录运行 :djadmin:`makemessages` 时，任何提取出来的字符串现在将自动分发到正确的应用程序或项目消息文件中。详细信息请参见 :ref:`how-to-create-language-files`。

source: The :djadmin:`makemessages` command now always adds the ``--previous`` command line flag to the ``msgmerge`` command, keeping previously translated strings in ``.po`` files for fuzzy strings.
zh_hans: :djadmin:`makemessages` 命令现在总是会将 ``--previous`` 命令行标志添加到 ``msgmerge`` 命令中，以保留先前翻译的模糊字符串在 ``.po`` 文件中。

source: The following settings to adjust the language cookie options were introduced: :setting:`LANGUAGE_COOKIE_AGE`, :setting:`LANGUAGE_COOKIE_DOMAIN` and :setting:`LANGUAGE_COOKIE_PATH`.
id: Pengaturan berikut untuk menyesuaikan pilihan kue bahasa diperkenalkan :setting:`LANGUAGE_COOKIE_AGE`, :setting:`LANGUAGE_COOKIE_DOMAIN` dan :setting:`LANGUAGE_COOKIE_PATH`.
zh_hans: 引入了以下用于调整语言 cookie 选项的设置：:setting:`LANGUAGE_COOKIE_AGE`、:setting:`LANGUAGE_COOKIE_DOMAIN` 和 :setting:`LANGUAGE_COOKIE_PATH`。

source: Added :doc:`/topics/i18n/formatting` for Esperanto.
id: Ditambahkan :doc:`/topics/i18n/formatting` untuk Esperanto
zh_hans: 添加了用于 Esperanto 的 :doc:`/topics/i18n/formatting`。

source: The new :option:`--no-color` option for ``django-admin`` disables the colorization of management command output.
id: Pilihan :option:`--no-color` baru untuk ``django-admin`` meniadakan pewarnaan dari keluaran perintah pengelolaan.
zh_hans: 新的 :option:`--no-color` 选项用于 ``django-admin``，用于禁用管理命令输出的颜色标记。

source: The new :option:`dumpdata --natural-foreign` and :option:`dumpdata --natural-primary` options, and the new ``use_natural_foreign_keys`` and ``use_natural_primary_keys`` arguments for ``serializers.serialize()``, allow the use of natural primary keys when serializing.
id: Pilihan option:`dumpdata --natural-foreign` dan :option:`dumpdata --natural-primary` baru, dan argumen ``use_natural_foreign_keys`` dan ``use_natural_primary_keys`` baru untuk ``serializers.serialize()``, mengizinkan penggunaan primary key alami ketika serialisasi.
zh_hans: 新的 :option:`dumpdata --natural-foreign` 和 :option:`dumpdata --natural-primary` 选项，以及 ``serializers.serialize()`` 的新参数 ``use_natural_foreign_keys`` 和 ``use_natural_primary_keys`` 允许在序列化时使用自然主键。

source: It is no longer necessary to provide the cache table name or the ``--database`` option for the :djadmin:`createcachetable` command. Django takes this information from your settings file. If you have configured multiple caches or multiple databases, all cache tables are created.
id: Itu tidak butuh lagi menyediakan nama tabel cache atau pilihan ``--database`` untuk perintah :djadmin:`createcachetable`. Django mengambil informasi ini dari berkas pengaturan anda. Jika anda telah mengkonfigurasikan banyak cache atau banyak basisdata, semua tabel cache dibuat.
zh_hans: 不再需要为 :djadmin:`createcachetable` 命令提供缓存表名或 ``--database`` 选项。Django 会从你的设置文件中获取这些信息。如果你配置了多个缓存或多个数据库，所有缓存表都会被创建。

source: The :djadmin:`runserver` command received several improvements:
id: Perintah :djadmin:`runserver` menerima beberapa perbaikan:
zh_hans: :djadmin:`runserver` 命令进行了一些改进：

source: On Linux systems, if :pypi:`pyinotify` is installed, the development server will reload immediately when a file is changed. Previously, it polled the filesystem for changes every second. That caused a small delay before reloads and reduced battery life on laptops.
zh_hans: 在 Linux 系统上，如果安装了 :pypi:`pyinotify`，开发服务器将在文件更改时立即重新加载。以前，它每秒轮询文件系统以检测更改，这会导致重新加载前有一小段延迟，并降低笔记本电脑的电池寿命。

source: In addition, the development server automatically reloads when a translation file is updated, i.e. after running :djadmin:`compilemessages`.
id: Sebagai tambahan, peladen pengembangan secara otomatis memuat kembali kketika berkas terjemahan diperbaharui, yaitu setelah menjalankan :djadmin:`compilemessages`.
zh_hans: 此外，当翻译文件更新后，即在运行 :djadmin:`compilemessages` 后，开发服务器会自动重新加载。

source: All HTTP requests are logged to the console, including requests for static files or ``favicon.ico`` that used to be filtered out.
id: Semua permintaan HTTP masuk ke konsol, termasuk permintaan untuk berkas-berkas tetap atau ``favicon.ico`` yang biasa disaring.
zh_hans: 所有 HTTP 请求都会记录到控制台，包括以前被过滤掉的用于静态文件或 ``favicon.ico`` 的请求。

source: Management commands can now produce syntax colored output under Windows if the ANSICON third-party tool is installed and active.
id: Perintah pengelolaan sekarang dapat menghasilkan sintaksis keluaran bewarna dibawah Windows jika alat pihak-ketiga ANSICON terpasang dan aktif.
zh_hans: 如果安装并激活了第三方工具 ANSICON，Windows 下的管理命令现在可以生成带有语法着色的输出。

source: :djadmin:`collectstatic` command with symlink option is now supported on Windows NT 6 (Windows Vista and newer).
id: Perintah :djadmin:`collectstatic` dengan pilihan symlink sekarang didukung di Windows NT 6 (Windows Vista dan terbaru).
zh_hans: :djadmin:`collectstatic` 命令现在在 Windows NT 6 (Windows Vista 及更新版本) 上支持符号链接选项。

source: Initial SQL data now works better if the :pypi:`sqlparse` Python library is installed.
zh_hans: 如果安装了 :pypi:`sqlparse` Python 库，初始 SQL 数据现在将更好地工作。

source: Note that it's deprecated in favor of the :class:`~django.db.migrations.operations.RunSQL` operation of migrations, which benefits from the improved behavior.
id: Catat bahwa itu diusangkan dalam mendukung dari operasi :class:`~django.db.migrations.operations.RunSQL` dari perpindahan, yang manfaat dari perilaku yang ditingkatkan.
zh_hans: 请注意，它已被弃用，推荐使用迁移的 :class:`~django.db.migrations.operations.RunSQL` 操作，这样可以受益于改进后的行为。

source: The :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` method was added.
id: Metode :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` telah ditambahkan.
zh_hans: 新增了 :meth:`QuerySet.update_or_create() <django.db.models.query.QuerySet.update_or_create>` 方法。

source: The new :attr:`~django.db.models.Options.default_permissions` model ``Meta`` option allows you to customize (or disable) creation of the default add, change, and delete permissions.
id: Model :attr:`~django.db.models.Options.default_permissions` baru pilihan ``Meta`` mengizinkan anda menyesuaikan (atau meniadakan) pembuatan dari awalan perizinan tambah, berubah, dan hapus.
zh_hans: 新的 :attr:`~django.db.models.Options.default_permissions` 模型 ``Meta`` 选项允许你自定义（或禁用）默认添加、修改和删除权限的创建。

source: Explicit :class:`~django.db.models.OneToOneField` for :ref:`multi-table-inheritance` are now discovered in abstract classes.
id: :class:`~django.db.models.OneToOneField` eksplisit untuk :ref:`multi-table-inheritance` sekarang ditemukan di kelas-kelas abstrak.
zh_hans: 现在在抽象类中可以显式使用 :class:`~django.db.models.OneToOneField` 用于 :ref:`multi-table-inheritance`。

source: It is now possible to avoid creating a backward relation for :class:`~django.db.models.OneToOneField` by setting its :attr:`~django.db.models.ForeignKey.related_name` to ``'+'`` or ending it with ``'+'``.
id: Itu sekarang memungkinkan menghindari membuat hubungan kebelakang untuk :class:`~django.db.models.OneToOneField` dengan mengatur :attr:`~django.db.models.ForeignKey.related_name` nya menjadi ``'+'`` atau akhiri itu dengan ``'+'``.
zh_hans: 现在可以通过将 :class:`~django.db.models.OneToOneField` 的 :attr:`~django.db.models.ForeignKey.related_name` 设置为 ``'+'`` 或以 ``'+'`` 结尾来避免创建反向关系。

source: :class:`F expressions <django.db.models.F>` support the power operator (``**``).
id: :class:`F expressions <django.db.models.F>` mendukung kekuatan penghubung (``**``).
zh_hans: :class:`F 表达式 <django.db.models.F>` 支持幂运算符（``**``）。

source: The ``remove()`` and ``clear()`` methods of the related managers created by ``ForeignKey`` and ``GenericForeignKey`` now accept the ``bulk`` keyword argument to control whether or not to perform operations in bulk (i.e. using ``QuerySet.update()``). Defaults to ``True``.
id: Metode ``remove()`` dan ``clear()`` dari pengelola terkait dibuat oleh ``ForeignKey`` dan ``GenericForeignKey`` sekarang menerima argumen kata kunci ``bulk`` untuk mengendalikan apakah atau tidak melakukan tindakan dalam jumlah besar (yaitu menggunakan ``QuerySet.update()``). Awalan menjadi ``True``.
zh_hans: 由 ``ForeignKey`` 和 ``GenericForeignKey`` 创建的关联管理器的 ``remove()`` 和 ``clear()`` 方法现在接受 ``bulk`` 关键字参数，用于控制是否批量执行操作（即使用 ``QuerySet.update()``）。默认为 ``True``。

source: It is now possible to use ``None`` as a query value for the :lookup:`iexact` lookup.
id: Seakrang dimungkinkan menggunakan ``None`` sebagai sebuah nilai permintaan untuk pencarian :lookup:`iexact`.
zh_hans: 现在可以将 ``None`` 用作 :lookup:`iexact` 查找的查询值。

source: It is now possible to pass a callable as value for the attribute :attr:`~django.db.models.ForeignKey.limit_choices_to` when defining a ``ForeignKey`` or ``ManyToManyField``.
id: Itu sekarang memungkinkan melewatkan callable sebagai nilai untuk atribut :attr:`~django.db.models.ForeignKey.limit_choices_to` ketika menentukan ``ForeignKey`` atau ``ManyToManyField``.
zh_hans: 现在在定义 ``ForeignKey`` 或 ``ManyToManyField`` 时，可以将可调用对象作为属性 :attr:`~django.db.models.ForeignKey.limit_choices_to` 的值传递。

source: Calling :meth:`only() <django.db.models.query.QuerySet.only>` and :meth:`defer() <django.db.models.query.QuerySet.defer>` on the result of :meth:`QuerySet.values() <django.db.models.query.QuerySet.values>` now raises an error (before that, it would either result in a database error or incorrect data).
id: Memanggil :meth:`only() <django.db.models.query.QuerySet.only>` dan :meth:`defer() <django.db.models.query.QuerySet.defer>` di hasil dari :meth:`QuerySet.values() <django.db.models.query.QuerySet.values>` sekarang memunculkan sebuah kesalahan (sebelum itu, itu juga antara hasil di kesalahan basisdata atau data tidak benar).
zh_hans: 在 :meth:`QuerySet.values() <django.db.models.query.QuerySet.values>` 的结果上调用 :meth:`only() <django.db.models.query.QuerySet.only>` 和 :meth:`defer() <django.db.models.query.QuerySet.defer>` 现在会引发错误（之前会导致数据库错误或不正确的数据）。

source: Custom intermediate models having more than one foreign key to any of the models participating in a many-to-many relationship are now permitted, provided you explicitly specify which foreign keys should be used by setting the new :attr:`ManyToManyField.through_fields <django.db.models.ManyToManyField.through_fields>` argument.
id: Penyesuaian model menengah memiliki lebih dari satu foreign key pada setiap dari model yang mengikuti di hubungan many-to-many adalah sekarang diizinkan, disediakan anda secara eksplisit menentukan foreign key mana harus digunakan dengan mengatur argumen :attr:`ManyToManyField.through_fields <django.db.models.ManyToManyField.through_fields>` baru.
zh_hans: 现在允许自定义中间模型具有多个外键与参与多对多关系的任何模型相关联，前提是你通过设置新的 :attr:`ManyToManyField.through_fields <django.db.models.ManyToManyField.through_fields>` 参数来明确指定应该使用哪些外键。

source: Assigning a model instance to a non-relation field will now throw an error. Previously this used to work if the field accepted integers as input as it took the primary key.
id: Menetapkan sebuah instance model pada bidang bukan-hubungan akan sekarang melempar sebuah kesalahan. Sebelumnya ini digunakan untuk bekerja jika bidang menerima integer sebagai masukan ketika itu mengambil primary key.
zh_hans: 现在，将模型实例分配给非关联字段将会抛出错误。之前，如果字段接受整数作为输入并将其作为主键，这样的操作是有效的。

source: Integer fields are now validated against database backend specific min and max values based on their :meth:`internal_type <django.db.models.Field.get_internal_type>`. Previously model field validation didn't prevent values out of their associated column data type range from being saved resulting in an integrity error.
id: Bidang integer sekarang disahkan terhadap backend basisdata khusus nilai min dan maks berdasarkan pada :meth:`internal_type <django.db.models.Field.get_internal_type>` mereka. Sebelumnya pengesahan bidang model tidak mencegah nilai dari jangkauan jenis data kolom terkait mereka dari menjadi disimpan menghasilkan di sebuah kesalahan keutuhan.
zh_hans: 整数字段现在会根据它们的 :meth:`internal_type <django.db.models.Field.get_internal_type>` 验证数据库后端特定的最小值和最大值。以前，模型字段的验证不会阻止保存超出其关联列数据类型范围的值，从而导致完整性错误。

source: It is now possible to explicitly :meth:`~django.db.models.query.QuerySet.order_by` a relation ``_id`` field by using its attribute name.
id: Sekarang dimungkinkan secara eksplisit :meth:`~django.db.models.query.QuerySet.order_by` sebuah hubungan bidang ``_id`` dengan menggunakan nama atributnya.
zh_hans: 现在可以通过使用关联字段的属性名称来显式 :meth:`~django.db.models.query.QuerySet.order_by` 一个关系的 ``_id`` 字段。

source: The ``enter`` argument was added to the :data:`~django.test.signals.setting_changed` signal.
id: Argumen ``enter`` telah ditambahkan ke sinyal :data:`~django.test.signals.setting_changed`.
zh_hans: 在 :data:`~django.test.signals.setting_changed` 信号中添加了 ``enter`` 参数。

source: The model signals can be now be connected to using a ``str`` of the ``'app_label.ModelName'`` form – just like related fields – to lazily reference their senders.
zh_hans: 现在可以使用 ``'app_label.ModelName'`` 形式的 ``str`` 来连接模型信号，就像相关字段一样，以惰性引用它们的发送者。

source: The :meth:`Context.push() <django.template.Context.push>` method now returns a context manager which automatically calls :meth:`pop() <django.template.Context.pop>` upon exiting the ``with`` statement. Additionally, :meth:`push() <django.template.Context.push>` now accepts parameters that are passed to the ``dict`` constructor used to build the new context level.
id: Metode :meth:`Context.push() <django.template.Context.push>` sekarang mengembalikan pengelola konteks yang secara otomatis memanggil :meth:`pop() <django.template.Context.pop>` diatas mengeluarkan pernyataan ``with``. Sebagai tambahan, :meth:`push() <django.template.Context.push>` sekarang menerima parameter yang dilewatkan ke pembangun ``dict`` digunakan untuk membangun tingkatak konteks baru.
zh_hans: :meth:`Context.push() <django.template.Context.push>` 方法现在返回一个上下文管理器，在退出 ``with`` 语句时会自动调用 :meth:`pop() <django.template.Context.pop>`。此外，:meth:`push() <django.template.Context.push>` 现在接受参数，这些参数将传递给用于构建新上下文级别的 ``dict`` 构造函数。

source: The new :meth:`Context.flatten() <django.template.Context.flatten>` method returns a ``Context``'s stack as one flat dictionary.
id: Metode :meth:`Context.flatten() <django.template.Context.flatten>` baru mengembalikan sebuah tumpukan ``Context`` sebagai satu kamus datar.
zh_hans: 新的 :meth:`Context.flatten() <django.template.Context.flatten>` 方法将一个 ``Context`` 的堆栈返回为一个扁平的字典。

source: ``Context`` objects can now be compared for equality (internally, this uses :meth:`Context.flatten() <django.template.Context.flatten>` so the internal structure of each ``Context``'s stack doesn't matter as long as their flattened version is identical).
id: Obyek ``Context`` sekarang dapat dibandingkan untuk kesetaraan (secara internal, ini menggunakan :meth:`Context.flatten() <django.template.Context.flatten>` jadi struktur internal dari setiap tumpukan ``Context`` tidak masalah selama versi diluruskan mereka mirip).
zh_hans: ``Context`` 对象现在可以进行相等性比较（内部使用 :meth:`Context.flatten() <django.template.Context.flatten>` 进行比较，因此只要它们的扁平化版本相同，每个 ``Context`` 的堆栈的内部结构就不重要）。

source: The :ttag:`widthratio` template tag now accepts an ``"as"`` parameter to capture the result in a variable.
id: Etiket cetakan :ttag:`widthratio` sekarang menerima sebuah parameter ``"as"`` untuk mengambil hasil di sebuah variabel.
zh_hans: :ttag:`widthratio` 模板标签现在接受一个 ``"as"`` 参数，以将结果存储在一个变量中。

source: The :ttag:`include` template tag will now also accept anything with a ``render()`` method (such as a ``Template``) as an argument. String arguments will be looked up using :func:`~django.template.loader.get_template` as always.
id: Etiket cetakan :ttag:`include` akan sekarang juga menerima apapun dengan metode ``render()`` (seperti ``Template``) sebagai sebuah argumen. Argumen deretan karakter akan dicari menggunakan :func:`~django.template.loader.get_template` seperti biasanya.
zh_hans: :ttag:`include` 模板标签现在还接受任何具有 ``render()`` 方法的对象（例如 ``Template``）作为参数。字符串参数将如常使用 :func:`~django.template.loader.get_template` 进行查找。

source: It is now possible to :ttag:`include` templates recursively.
id: Sekarang memungkinkan untuk :ttag:`include` cetakan secara berulang.
zh_hans: 现在可以递归地使用 :ttag:`include` 模板。

source: Template objects now have an origin attribute set when ``TEMPLATE_DEBUG`` is ``True``. This allows template origins to be inspected and logged outside of the ``django.template`` infrastructure.
id: Obyek cetakan sekarang mempunyai atribut asli disetel ketika ``TEMPLATE_DEBUG`` adalah ``True``. Ini mengizinkan cetakan asli untuk diperiksa dan masuk diluar dari infrastruktur ``django.template``.
zh_hans: 当 ``TEMPLATE_DEBUG`` 为 ``True`` 时，模板对象现在具有一个设置的 origin 属性。这允许在 ``django.template`` 基础结构之外检查和记录模板的来源。

source: ``TypeError`` exceptions are no longer silenced when raised during the rendering of a template.
id: Pengecualian ``TypeError`` tidak lagi didiamkan ketika dimunculkan selama membangun sebuah cetakan.
zh_hans: 在模板渲染过程中引发的 ``TypeError`` 异常不再被消除声音。

source: The following functions now accept a ``dirs`` parameter which is a list or tuple to override ``TEMPLATE_DIRS``:
id: Fungsi berikut sekarang menerima sebuah parameter ``dirs`` yaitu sebuah daftar atau tuple untuk menimpa ``TEMPLATE_DIRS``:
zh_hans: 以下函数现在接受一个 ``dirs`` 参数，这是一个列表或元组，用于覆盖 ``TEMPLATE_DIRS``：

source: The :tfilter:`time` filter now accepts timezone-related :ref:`format specifiers <date-and-time-formatting-specifiers>` ``'e'``, ``'O'`` , ``'T'`` and ``'Z'`` and is able to digest :ref:`time-zone-aware <naive_vs_aware_datetimes>` ``datetime`` instances performing the expected rendering.
id: Penyaring :tfilter:`time` sekarang menerima terkait-zona waktu ref:`format specifiers <date-and-time-formatting-specifiers>` ``'e'``, ``'O'`` , ``'T'`` dan ``'Z'`` dan dapat mencerna instance :ref:`time-zone-aware <naive_vs_aware_datetimes>` ``datetime`` melakukan pembangunan yang diharapkan.
zh_hans: :tfilter:`time` 过滤器现在接受与时区相关的 :ref:`格式说明符 <date-and-time-formatting-specifiers>` ``'e'``, ``'O'``, ``'T'`` 和 ``'Z'``，并且能够处理 :ref:`时区感知的 <naive_vs_aware_datetimes>` ``datetime`` 实例，执行预期的渲染。

source: The :ttag:`cache` tag will now try to use the cache called "template_fragments" if it exists and fall back to using the default cache otherwise. It also now accepts an optional ``using`` keyword argument to control which cache it uses.
id: Etiket :ttag:`cache` sekarang akan mencoba menggunakan cache dipanggil "template_fragments" jika itu ada dan sebaliknya jatuh kembali menggunakan cache awalan. Itu juga sekarang menerima sebuah pilihan argumen kata kunci ``using`` untuk mengendalikan cache mana yang itu gunakan.
zh_hans: :ttag:`cache` 标签现在会尝试使用名为 "template_fragments" 的缓存（如果存在），否则会回退使用默认缓存。它还现在接受一个可选的 ``using`` 关键字参数，以控制使用哪个缓存。

source: The new :tfilter:`truncatechars_html` filter truncates a string to be no longer than the specified number of characters, taking HTML into account.
id: Penyaring :tfilter:`truncatechars_html` baru memotong sebuah deretan karakter untuk jadi tidak panjang dari angka yang ditentukan dari karakter, mengambil HTML kedalam akun.
zh_hans: 新的 :tfilter:`truncatechars_html` 过滤器根据指定的字符数截断字符串，考虑到 HTML。

source: The new :attr:`HttpRequest.scheme <django.http.HttpRequest.scheme>` attribute specifies the scheme of the request (``http`` or ``https`` normally).
id: Atribut :attr:`HttpRequest.scheme <django.http.HttpRequest.scheme>` baru menentukan skema dari permintaan (``http`` atau ``https`` secara umum).
zh_hans: 新的 :attr:`HttpRequest.scheme <django.http.HttpRequest.scheme>` 属性指定请求的协议（通常是 ``http`` 或 ``https``）。

source: The shortcut :func:`redirect() <django.shortcuts.redirect>` now supports relative URLs.
id: Jalan pintas :func:`redirect() <django.shortcuts.redirect>` sekarang mendukung URL relatif.
zh_hans: 快捷方式 :func:`redirect() <django.shortcuts.redirect>` 现在支持相对 URL。

source: The new :class:`~django.http.JsonResponse` subclass of :class:`~django.http.HttpResponse` helps easily create JSON-encoded responses.
id: Subkelas :class:`~django.http.JsonResponse` baru dari :class:`~django.http.HttpResponse` membantu dengan mudah membuat tanggapan JSON-disandikan.
zh_hans: :class:`~django.http.JsonResponse` 是 :class:`~django.http.HttpResponse` 的一个子类，它可以轻松创建 JSON 编码的响应。

source: :class:`~django.test.runner.DiscoverRunner` has two new attributes, :attr:`~django.test.runner.DiscoverRunner.test_suite` and :attr:`~django.test.runner.DiscoverRunner.test_runner`, which facilitate overriding the way tests are collected and run.
id: :class:`~django.test.runner.DiscoverRunner` mempunyai dua atribut baru, :attr:`~django.test.runner.DiscoverRunner.test_suite` dan :attr:`~django.test.runner.DiscoverRunner.test_runner`, yang memfasilitasi menimpa cara percobaan dikumpulkan dan berjalan.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 新增了两个属性，:attr:`~django.test.runner.DiscoverRunner.test_suite` 和 :attr:`~django.test.runner.DiscoverRunner.test_runner`，它们有助于重写测试的收集和运行方式。

source: The ``fetch_redirect_response`` argument was added to :meth:`~django.test.SimpleTestCase.assertRedirects`. Since the test client can't fetch externals URLs, this allows you to use ``assertRedirects`` with redirects that aren't part of your Django app.
id: Argumen ``fetch_redirect_response`` telah ditambahkan ke :meth:`~django.test.SimpleTestCase.assertRedirects`. Sejak percobaan klien tidak dapat mengambil URL luar, ini mengizinkan anda menggunakan ``assertRedirects`` dengan mengalihkan dimana bukan bagian dari aplikasi Django anda.
zh_hans: :meth:`~django.test.SimpleTestCase.assertRedirects` 添加了 ``fetch_redirect_response`` 参数。由于测试客户端无法获取外部 URL，这使您可以在不属于您的 Django 应用程序的重定向上使用 ``assertRedirects``。

source: Correct handling of scheme when making comparisons in :meth:`~django.test.SimpleTestCase.assertRedirects`.
id: Perbaiki penanganan dari skema ketika membuat perbandingan di :meth:`~django.test.SimpleTestCase.assertRedirects`.
zh_hans: 在 :meth:`~django.test.SimpleTestCase.assertRedirects` 中进行比较时，现在可以正确处理协议。

source: The ``secure`` argument was added to all the request methods of :class:`~django.test.Client`. If ``True``, the request will be made through HTTPS.
id: Argumen ``secure`` telah ditambahkan ke semua metode permintaan dari :class:`~django.test.Client`. Jika ``True``, permintaan akan dibuat melalui HTTPS.
zh_hans: :class:`~django.test.Client` 的所有请求方法现在都添加了 ``secure`` 参数。如果设置为 ``True``，请求将通过 HTTPS 发送。

source: :meth:`~django.test.TransactionTestCase.assertNumQueries` now prints out the list of executed queries if the assertion fails.
id: :meth:`~django.test.TransactionTestCase.assertNumQueries` sekarang mencetak daftar dari permintaan dijalankan jika tuntutan gagal.
zh_hans: 如果断言失败，:meth:`~django.test.TransactionTestCase.assertNumQueries` 现在会打印出已执行查询的列表。

source: The ``WSGIRequest`` instance generated by the test handler is now attached to the :attr:`django.test.Response.wsgi_request` attribute.
id: Instance ``WSGIRequest`` dibangkitkan oleh penangan percobaan sekarang dilampirkan ke atribut :attr:`django.test.Response.wsgi_request`.
zh_hans: 由测试处理程序生成的 ``WSGIRequest`` 实例现在附加到 :attr:`django.test.Response.wsgi_request` 属性。

source: The database settings for testing have been collected into a dictionary named :setting:`TEST <DATABASE-TEST>`.
id: Pengaturan basisdata untuk percobaan telah dikumpulkan kedalam kamus dinamai :setting:`TEST <DATABASE-TEST>`.
zh_hans: 测试的数据库设置已经收集到一个名为 :setting:`TEST <DATABASE-TEST>` 的字典中。

source: Utilities
id: Keperluan
zh_hans: 实用程序
