Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :class:`~django.db.models.Lookup` expressions may now be used in ``QuerySet`` annotations, aggregations, and directly in filters.
zh_hans: :class:`~django.db.models.Lookup` 表达式现在可以在 ``QuerySet`` 的注释、聚合和直接筛选中使用。

source: The new :ref:`default <aggregate-default>` argument for built-in aggregates allows specifying a value to be returned when the queryset (or grouping) contains no entries, rather than ``None``.
zh_hans: 内置聚合函数的新 :ref:`default <aggregate-default>` 参数允许指定当查询集（或分组）不包含条目时要返回的值，而不是返回 ``None``。

source: The :class:`~django.middleware.security.SecurityMiddleware` now adds the :ref:`Cross-Origin Opener Policy <cross-origin-opener-policy>` header with a value of ``'same-origin'`` to prevent cross-origin popups from sharing the same browsing context. You can prevent this header from being added by setting the :setting:`SECURE_CROSS_ORIGIN_OPENER_POLICY` setting to ``None``.
zh_hans: :class:`~django.middleware.security.SecurityMiddleware` 现在会添加具有值 ``'same-origin'`` 的 :ref:`Cross-Origin Opener Policy <cross-origin-opener-policy>` 头，以防止跨源弹出窗口共享相同的浏览上下文。你可以通过将 :setting:`SECURE_CROSS_ORIGIN_OPENER_POLICY` 设置为 ``None`` 来阻止添加此头部。

source: The new ``stdout`` argument for :func:`~django.db.models.signals.pre_migrate` and :func:`~django.db.models.signals.post_migrate` signals allows redirecting output to a stream-like object. It should be preferred over :py:data:`sys.stdout` and :py:func:`print` when emitting verbose output in order to allow proper capture when testing.
zh_hans: :func:`~django.db.models.signals.pre_migrate` 和 :func:`~django.db.models.signals.post_migrate` 信号现在有一个新的 ``stdout`` 参数，允许将输出重定向到类似流的对象。在发出详细输出时，应优先考虑使用它，以便在测试时能够正确捕获输出，而不是使用 :py:data:`sys.stdout` 和 :py:func:`print`。

source: :tfilter:`floatformat` template filter now allows using the ``u`` suffix to force disabling localization.
zh_hans: 模板过滤器 :tfilter:`floatformat` 现在允许使用 ``u`` 后缀来强制禁用本地化。

source: The new ``serialized_aliases`` argument of :func:`django.test.utils.setup_databases` determines which :setting:`DATABASES` aliases test databases should have their state serialized to allow usage of the :ref:`serialized_rollback <test-case-serialized-rollback>` feature.
zh_hans: :func:`django.test.utils.setup_databases` 的新参数 ``serialized_aliases`` 决定了哪些 :setting:`DATABASES` 别名的测试数据库应该被序列化以允许使用 :ref:`serialized_rollback <test-case-serialized-rollback>` 特性。

source: The new ``logger`` argument to :class:`~django.test.runner.DiscoverRunner` allows a Python :py:ref:`logger <logger>` to be used for logging.
zh_hans: :class:`~django.test.runner.DiscoverRunner` 的新参数 ``logger`` 允许使用 Python :py:ref:`logger <logger>` 进行日志记录。

source: The new :meth:`.DiscoverRunner.log` method provides a way to log messages that uses the ``DiscoverRunner.logger``, or prints to the console if not set.
zh_hans: 新的 :meth:`.DiscoverRunner.log` 方法提供了一种记录消息的方式，它使用 ``DiscoverRunner.logger`` 进行日志记录，如果未设置则打印到控制台。

source: The :option:`test --parallel` option now supports the value ``auto`` to run one test process for each processor core.
zh_hans: :option:`test --parallel` 选项现在支持值 ``auto``，以为每个处理器核心运行一个测试进程。

source: :meth:`.TestCase.captureOnCommitCallbacks` now captures new callbacks added while executing :func:`.transaction.on_commit` callbacks.
zh_hans: :meth:`.TestCase.captureOnCommitCallbacks` 现在会捕获在执行 :func:`.transaction.on_commit` 回调期间添加的新回调。

source: Backwards incompatible changes in 4.0
zh_hans: 4.0 版本中不向后兼容的变更

source: ``DatabaseOperations.year_lookup_bounds_for_date_field()`` and ``year_lookup_bounds_for_datetime_field()`` methods now take the optional ``iso_year`` argument in order to support bounds for ISO-8601 week-numbering years.
zh_hans: ``DatabaseOperations.year_lookup_bounds_for_date_field()`` 和 ``year_lookup_bounds_for_datetime_field()`` 方法现在接受可选的 ``iso_year`` 参数，以支持 ISO-8601 周编号年份的范围。

source: The second argument of ``DatabaseSchemaEditor._unique_sql()`` and ``_create_unique_sql()`` methods is now ``fields`` instead of ``columns``.
zh_hans: ``DatabaseSchemaEditor._unique_sql()`` 和 ``_create_unique_sql()`` 方法的第二个参数现在是 ``fields``，而不再是 ``columns``。

source: Support for PostGIS 2.3 is removed.
zh_hans: 移除了对 PostGIS 2.3 的支持。

source: Support for GDAL 2.0 and GEOS 3.5 is removed.
zh_hans: 移除了对 GDAL 2.0 和 GEOS 3.5 的支持。

source: Dropped support for PostgreSQL 9.6
zh_hans: 停止支持 PostgreSQL 9.6

source: Upstream support for PostgreSQL 9.6 ends in November 2021. Django 4.0 supports PostgreSQL 10 and higher.
zh_hans: PostgreSQL 9.6 的上游支持将在 2021 年 11 月结束。 Django 4.0 支持 PostgreSQL 10 及更高版本。

source: Also, the minimum supported version of ``psycopg2`` is increased from 2.5.4 to 2.8.4, as ``psycopg2`` 2.8.4 is the first release to support Python 3.8.
zh_hans: 此外，``psycopg2`` 的最低支持版本已从 2.5.4 提高到 2.8.4，因为 ``psycopg2`` 2.8.4 是第一个支持 Python 3.8 的版本。

source: Dropped support for Oracle 12.2 and 18c
zh_hans: 停止支持 Oracle 12.2 和 18c

source: Upstream support for Oracle 12.2 ends in March 2022 and for Oracle 18c it ends in June 2021. Django 3.2 will be supported until April 2024. Django 4.0 officially supports Oracle 19c.
zh_hans: Oracle 12.2 的上游支持将于 2022 年 3 月结束，Oracle 18c 的上游支持将于 2021 年 6 月结束。 Django 3.2 将得到支持直至 2024 年 4 月。 Django 4.0 正式支持 Oracle 19c 。

source: ``CSRF_TRUSTED_ORIGINS`` changes
zh_hans: ``CSRF_TRUSTED_ORIGINS`` 变更

source: Format change
zh_hans: 格式变更

source: Values in the :setting:`CSRF_TRUSTED_ORIGINS` setting must include the scheme (e.g. ``'http://'`` or ``'https://'``) instead of only the hostname.
zh_hans: 在 :setting:`CSRF_TRUSTED_ORIGINS` 设置中，值必须包括方案（例如，``'http://'`` 或 ``'https://'``），而不仅仅是主机名。

source: Also, values that started with a dot, must now also include an asterisk before the dot. For example, change ``'.example.com'`` to ``'https://*.example.com'``.
zh_hans: 此外，以点开头的值现在必须在点之前加上一个星号。例如，将 ``'.example.com'`` 更改为 ``'https://*.example.com'``。

source: A system check detects any required changes.
zh_hans: 系统检查会检测到任何所需的更改。

source: Configuring it may now be required
zh_hans: 现在可能需要配置它

source: As CSRF protection now consults the ``Origin`` header, you may need to set :setting:`CSRF_TRUSTED_ORIGINS`, particularly if you allow requests from subdomains by setting :setting:`CSRF_COOKIE_DOMAIN` (or :setting:`SESSION_COOKIE_DOMAIN` if :setting:`CSRF_USE_SESSIONS` is enabled) to a value starting with a dot.
zh_hans: 由于 CSRF 保护现在参考 ``Origin`` 标头，如果你通过将 :setting:`CSRF_COOKIE_DOMAIN` （或者如果启用了 :setting:`CSRF_USE_SESSIONS`，则为 :setting:`SESSION_COOKIE_DOMAIN`）设置为以点开头的值以允许来自子域的请求，你可能需要设置 :setting:`CSRF_TRUSTED_ORIGINS`。

source: ``SecurityMiddleware`` no longer sets the ``X-XSS-Protection`` header
zh_hans: ``SecurityMiddleware`` 不再设置 ``X-XSS-Protection`` 头

source: The :class:`~django.middleware.security.SecurityMiddleware` no longer sets the ``X-XSS-Protection`` header if the ``SECURE_BROWSER_XSS_FILTER`` setting is ``True``. The setting is removed.
zh_hans: 如果 ``SECURE_BROWSER_XSS_FILTER`` 设置为 ``True``，则 :class:`~django.middleware.security.SecurityMiddleware` 不再设置 ``X-XSS-Protection`` 头。此设置已被移除。

source: Most modern browsers don't honor the ``X-XSS-Protection`` HTTP header. You can use Content-Security-Policy_ without allowing ``'unsafe-inline'`` scripts instead.
zh_hans: 大多数现代浏览器不再支持 ``X-XSS-Protection`` HTTP 头。你可以使用 Content-Security-Policy_ 来代替，但请不要允许 ``'unsafe-inline'`` 脚本。

source: If you want to support legacy browsers and set the header, use this line in a custom middleware::
zh_hans: 如果您想要支持旧版浏览器并设置标头，请在自定义中间件中使用以下代码行：

source: Migrations autodetector changes
zh_hans: 迁移自动检测器的更改

source: The migrations autodetector now uses model states instead of model classes. Also, migration operations for ``ForeignKey`` and ``ManyToManyField`` fields no longer specify attributes which were not passed to the fields during initialization.
zh_hans: 迁移自动检测器现在使用模型状态而不是模型类。此外，对于 ``ForeignKey`` 和 ``ManyToManyField`` 字段的迁移操作不再指定未在字段初始化期间传递的属性。

source: As a side-effect, running ``makemigrations`` might generate no-op ``AlterField`` operations for ``ManyToManyField`` and ``ForeignKey`` fields in some cases.
zh_hans: 作为副作用，在某些情况下，运行 ``makemigrations`` 可能会为 ``ManyToManyField`` 和 ``ForeignKey`` 字段生成无操作的 ``AlterField`` 操作。

source: ``DeleteView`` changes
zh_hans: ``DeleteView`` 变更

source: :class:`~django.views.generic.edit.DeleteView` now uses :class:`~django.views.generic.edit.FormMixin` to handle POST requests. As a consequence, any custom deletion logic in ``delete()`` handlers should be moved to ``form_valid()``, or a shared helper method, if required.
zh_hans: :class:`~django.views.generic.edit.DeleteView` 现在使用 :class:`~django.views.generic.edit.FormMixin` 来处理 POST 请求。因此，任何在 ``delete()`` 处理程序中的自定义删除逻辑应该移动到 ``form_valid()``，或者如果需要的话，可以移动到共享的辅助方法。

source: Table and column naming scheme changes on Oracle
zh_hans: Oracle 上的表和列命名方案发生了变化。

source: Django 4.0 inadvertently changed the table and column naming scheme on Oracle. This causes errors for models and fields with names longer than 30 characters. Unfortunately, renaming some Oracle tables and columns is required. Use the upgrade script in :ticket:`33789 <33789#comment:15>` to generate ``RENAME`` statements to change naming scheme.
zh_hans: Django 4.0 无意中更改了 Oracle 上的表和列命名方案。这会导致模型和字段的名称超过 30 个字符的错误。不幸的是，需要重命名一些 Oracle 表和列。请使用 :ticket:`33789 <33789#comment:15>` 中的升级脚本生成 ``RENAME`` 语句来更改命名方案。

source: Support for ``cx_Oracle`` < 7.0 is removed.
zh_hans: 已移除对 ``cx_Oracle`` 版本低于 7.0 的支持。

source: To allow serving a Django site on a subpath without changing the value of :setting:`STATIC_URL`, the leading slash is removed from that setting (now ``'static/'``) in the default :djadmin:`startproject` template.
zh_hans: 为了允许在子路径上提供 Django 站点而不更改 :setting:`STATIC_URL` 的值，现在在默认的 :djadmin:`startproject` 模板中从该设置中移除了前导斜杠（现在是 ``'static/'``）。

source: The :class:`~django.contrib.admin.AdminSite` method for the admin ``index`` view is no longer decorated with ``never_cache`` when accessed directly, rather than via the recommended ``AdminSite.urls`` property, or ``AdminSite.get_urls()`` method.
zh_hans: 当直接访问 :class:`~django.contrib.admin.AdminSite` 的管理 ``index`` 视图时，不再使用 ``never_cache`` 进行装饰，而是建议通过 ``AdminSite.urls`` 属性或 ``AdminSite.get_urls()`` 方法访问。

source: Unsupported operations on a sliced queryset now raise ``TypeError`` instead of ``AssertionError``.
zh_hans: 对切片的查询集执行不支持的操作现在会引发 ``TypeError`` 而不是 ``AssertionError``。

source: The undocumented ``django.test.runner.reorder_suite()`` function is renamed to ``reorder_tests()``. It now accepts an iterable of tests rather than a test suite, and returns an iterator of tests.
zh_hans: 未记录的 ``django.test.runner.reorder_suite()`` 函数已更名为 ``reorder_tests()``。现在它接受一个测试的可迭代对象而不是测试套件，并返回一个测试的迭代器。

source: Calling ``FileSystemStorage.delete()`` with an empty ``name`` now raises ``ValueError`` instead of ``AssertionError``.
zh_hans: 现在，如果使用空的 ``name`` 调用 ``FileSystemStorage.delete()``，会引发 ``ValueError`` 而不是 ``AssertionError``。

source: Calling ``EmailMultiAlternatives.attach_alternative()`` or ``EmailMessage.attach()`` with an invalid ``content`` or ``mimetype`` arguments now raise ``ValueError`` instead of ``AssertionError``.
zh_hans: 如果使用无效的 ``content`` 或 ``mimetype`` 参数调用 ``EmailMultiAlternatives.attach_alternative()`` 或 ``EmailMessage.attach()``，现在会引发 ``ValueError`` 而不是 ``AssertionError``。

source: :meth:`~django.test.SimpleTestCase.assertHTMLEqual` no longer considers a non-boolean attribute without a value equal to an attribute with the same name and value.
zh_hans: :meth:`~django.test.SimpleTestCase.assertHTMLEqual` 不再将没有值的非布尔属性视为与具有相同名称和值的属性相等。

source: Tests that fail to load, for example due to syntax errors, now always match when using :option:`test --tag`.
zh_hans: 现在，无法加载的测试，例如由于语法错误等原因，使用 :option:`test --tag` 时始终匹配。

source: The undocumented ``django.contrib.admin.utils.lookup_needs_distinct()`` function is renamed to ``lookup_spawns_duplicates()``.
zh_hans: 未记录的 ``django.contrib.admin.utils.lookup_needs_distinct()`` 函数已更名为 ``lookup_spawns_duplicates()``。

source: The undocumented ``HttpRequest.get_raw_uri()`` method is removed. The :meth:`.HttpRequest.build_absolute_uri` method may be a suitable alternative.
zh_hans: 未记录的 ``HttpRequest.get_raw_uri()`` 方法已被移除。 :meth:`.HttpRequest.build_absolute_uri` 方法可能是一个合适的替代方法。

source: The ``object`` argument of undocumented ``ModelAdmin.log_addition()``, ``log_change()``, and ``log_deletion()`` methods is renamed to ``obj``.
zh_hans: 未记录的 ``ModelAdmin.log_addition()``、``log_change()`` 和 ``log_deletion()`` 方法的 ``object`` 参数已更名为 ``obj``。

source: :class:`~django.utils.feedgenerator.RssFeed`, :class:`~django.utils.feedgenerator.Atom1Feed`, and their subclasses now emit elements with no content as self-closing tags.
zh_hans: :class:`~django.utils.feedgenerator.RssFeed`、:class:`~django.utils.feedgenerator.Atom1Feed` 及其子类现在将没有内容的元素作为自关闭标签进行输出。

source: ``NodeList.render()`` no longer casts the output of ``render()`` method for individual nodes to a string. ``Node.render()`` should always return a string as documented.
zh_hans: ``NodeList.render()`` 不再将单个节点的 ``render()`` 方法的输出转换为字符串。根据文档，``Node.render()`` 应始终返回一个字符串。

source: The ``where_class`` property of ``django.db.models.sql.query.Query`` and the ``where_class`` argument to the private ``get_extra_restriction()`` method of ``ForeignObject`` and ``ForeignObjectRel`` are removed. If needed, initialize ``django.db.models.sql.where.WhereNode`` instead.
zh_hans: ``django.db.models.sql.query.Query`` 的 ``where_class`` 属性以及 ``ForeignObject`` 和 ``ForeignObjectRel`` 的私有方法 ``get_extra_restriction()`` 的 ``where_class`` 参数已被移除。如果需要，可以初始化 ``django.db.models.sql.where.WhereNode``。

source: The ``filter_clause`` argument of the undocumented ``Query.add_filter()`` method is replaced by two positional arguments ``filter_lhs`` and ``filter_rhs``.
zh_hans: 未记录的 ``Query.add_filter()`` 方法的 ``filter_clause`` 参数被替换为两个位置参数 ``filter_lhs`` 和 ``filter_rhs``。

source: :class:`~django.middleware.csrf.CsrfViewMiddleware` now uses ``request.META['CSRF_COOKIE_NEEDS_UPDATE']`` in place of ``request.META['CSRF_COOKIE_USED']``, ``request.csrf_cookie_needs_reset``, and ``response.csrf_cookie_set`` to track whether the CSRF cookie should be sent. This is an undocumented, private API.
zh_hans: :class:`~django.middleware.csrf.CsrfViewMiddleware` 现在使用 ``request.META['CSRF_COOKIE_NEEDS_UPDATE']`` 代替 ``request.META['CSRF_COOKIE_USED']``、``request.csrf_cookie_needs_reset`` 和 ``response.csrf_cookie_set`` 来跟踪 CSRF cookie 是否应该发送。这是一个未记录的私有 API。

source: The undocumented ``TRANSLATOR_COMMENT_MARK`` constant is moved from ``django.template.base`` to ``django.utils.translation.template``.
zh_hans: 未记录的 ``TRANSLATOR_COMMENT_MARK`` 常量已从 ``django.template.base`` 移动到 ``django.utils.translation.template``。

source: The ``real_apps`` argument of the undocumented ``django.db.migrations.state.ProjectState.__init__()`` method must now be a set if provided.
zh_hans: 未记录的 ``django.db.migrations.state.ProjectState.__init__()`` 方法的 ``real_apps`` 参数现在必须是一个集合（set），如果提供的话。

source: :class:`~django.forms.RadioSelect` and :class:`~django.forms.CheckboxSelectMultiple` widgets are now rendered in ``<div>`` tags so they are announced more concisely by screen readers. If you need the previous behavior, :ref:`override the widget template <overriding-built-in-widget-templates>` with the appropriate template from Django 3.2.
zh_hans: :class:`~django.forms.RadioSelect` 和 :class:`~django.forms.CheckboxSelectMultiple` 小部件现在在 ``<div>`` 标签中呈现，以便屏幕阅读器更简洁地宣读它们。如果需要以前的行为，请使用来自 Django 3.2 的适当模板 :ref:`覆盖小部件模板 <overriding-built-in-widget-templates>`。

source: The :tfilter:`floatformat` template filter no longer depends on the ``USE_L10N`` setting and always returns localized output. Use the ``u`` suffix to disable localization.
zh_hans: 模板过滤器 :tfilter:`floatformat` 不再依赖于 ``USE_L10N`` 设置，并始终返回本地化的输出。使用 ``u`` 后缀来禁用本地化。

source: The default value of the ``USE_L10N`` setting is changed to ``True``. See the :ref:`Localization section <use_l10n_deprecation>` above for more details.
zh_hans: ``USE_L10N`` 设置的默认值已更改为 ``True``。有关更多详细信息，请参阅上面的 :ref:`本地化部分 <use_l10n_deprecation>`。

source: As part of the :ref:`move to zoneinfo <whats-new-4.0>`, ``django.utils.timezone.utc`` is changed to alias :attr:`datetime.timezone.utc`.
zh_hans: 作为 :ref:`迁移到 zoneinfo <whats-new-4.0>` 的一部分，``django.utils.timezone.utc`` 被更改为别名 :attr:`datetime.timezone.utc`。

source: The minimum supported version of ``asgiref`` is increased from 3.3.2 to 3.4.1.
zh_hans: ``asgiref`` 的最低支持版本已从 3.3.2 增加到 3.4.1。

source: Features deprecated in 4.0
zh_hans: 在 4.0 版本中废弃的功能

source: Use of ``pytz`` time zones
zh_hans: 使用 ``pytz`` 时区

source: As part of the :ref:`move to zoneinfo <whats-new-4.0>`, use of ``pytz`` time zones is deprecated.
zh_hans: 作为 :ref:`迁移到 zoneinfo <whats-new-4.0>` 的一部分，不推荐使用 ``pytz`` 时区。

source: Accordingly, the ``is_dst`` arguments to the following are also deprecated:
zh_hans: 相应地，以下函数的 ``is_dst`` 参数也已被弃用：

source: Support for use of ``pytz`` will be removed in Django 5.0.
zh_hans: 在 Django 5.0 中将移除对 ``pytz`` 的支持。

source: Time zone support
zh_hans: 时区支持

source: In order to follow good practice, the default value of the :setting:`USE_TZ` setting will change from ``False`` to ``True``, and time zone support will be enabled by default, in Django 5.0.
zh_hans: 为了遵循良好的实践，:setting:`USE_TZ` 设置的默认值将从 ``False`` 更改为 ``True``，并且在 Django 5.0 中将默认启用时区支持。

source: Note that the default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes :setting:`USE_TZ = True <USE_TZ>` since Django 1.4.
zh_hans: 请注意，由 :djadmin:`django-admin startproject <startproject>` 创建的默认 :file:`settings.py` 文件自 Django 1.4 起就包括 :setting:`USE_TZ = True <USE_TZ>`。

source: You can set ``USE_TZ`` to ``False`` in your project settings before then to opt-out.
zh_hans: 你可以在那之前在项目设置中将 ``USE_TZ`` 设置为 ``False`` 以选择不使用时区支持。

source: Localization
zh_hans: 本地化

source: In order to follow good practice, the default value of the ``USE_L10N`` setting is changed from ``False`` to ``True``.
zh_hans: 为了遵循良好的实践，``USE_L10N`` 设置的默认值从 ``False`` 更改为 ``True``。

source: Moreover ``USE_L10N`` is deprecated as of this release. Starting with Django 5.0, by default, any date or number displayed by Django will be localized.
zh_hans: 此外，从此版本开始，``USE_L10N`` 已被弃用。从 Django 5.0 开始，默认情况下，Django 显示的任何日期或数字都将进行本地化。

source: The :ttag:`{% localize %} <localize>` tag and the :tfilter:`localize`/ :tfilter:`unlocalize` filters will still be honored by Django.
zh_hans: Django 仍将支持 :ttag:`{% localize %} <localize>` 标签以及 :tfilter:`localize`/ :tfilter:`unlocalize` 过滤器。

source: ``SERIALIZE`` test setting is deprecated as it can be inferred from the :attr:`~django.test.TestCase.databases` with the :ref:`serialized_rollback <test-case-serialized-rollback>` option enabled.
zh_hans: ``SERIALIZE`` 测试设置已被弃用，因为可以从启用 :ref:`serialized_rollback <test-case-serialized-rollback>` 选项的 :attr:`~django.test.TestCase.databases` 推断出。

source: The undocumented ``django.utils.baseconv`` module is deprecated.
zh_hans: 未记录的 ``django.utils.baseconv`` 模块已被弃用。

source: The undocumented ``django.utils.datetime_safe`` module is deprecated.
zh_hans: 未记录的 ``django.utils.datetime_safe`` 模块已被弃用。

source: The default sitemap protocol for sitemaps built outside the context of a request will change from ``'http'`` to ``'https'`` in Django 5.0.
zh_hans: 在 Django 5.0 中，构建在请求上下文之外的站点地图的默认协议将从 ``'http'`` 更改为 ``'https'``。

source: The ``extra_tests`` argument for :meth:`.DiscoverRunner.build_suite` and :meth:`.DiscoverRunner.run_tests` is deprecated.
zh_hans: :meth:`.DiscoverRunner.build_suite` 和 :meth:`.DiscoverRunner.run_tests` 的 ``extra_tests`` 参数已被弃用。

source: The :class:`~django.contrib.postgres.aggregates.ArrayAgg`, :class:`~django.contrib.postgres.aggregates.JSONBAgg`, and :class:`~django.contrib.postgres.aggregates.StringAgg` aggregates will return ``None`` when there are no rows instead of ``[]``, ``[]``, and ``''`` respectively in Django 5.0. If you need the previous behavior, explicitly set ``default`` to ``Value([])``, ``Value('[]')``, or ``Value('')``.
zh_hans: 在 Django 5.0 中，当没有行时，:class:`~django.contrib.postgres.aggregates.ArrayAgg`、:class:`~django.contrib.postgres.aggregates.JSONBAgg` 和 :class:`~django.contrib.postgres.aggregates.StringAgg` 聚合将返回 ``None``，而不是分别返回 ``[]``、``[]`` 和 ``''``。如果需要以前的行为，请显式将 ``default`` 设置为 ``Value([])``、``Value('[]')`` 或 ``Value('')``。

source: The ``django.contrib.gis.admin.GeoModelAdmin`` and ``OSMGeoAdmin`` classes are deprecated. Use :class:`~django.contrib.admin.ModelAdmin` and :class:`~django.contrib.gis.admin.GISModelAdmin` instead.
zh_hans: ``django.contrib.gis.admin.GeoModelAdmin`` 和 ``OSMGeoAdmin`` 类已被弃用。请改为使用 :class:`~django.contrib.admin.ModelAdmin` 和 :class:`~django.contrib.gis.admin.GISModelAdmin`。

source: Since form rendering now uses the template engine, the undocumented ``BaseForm._html_output()`` helper method is deprecated.
zh_hans: 由于表单渲染现在使用模板引擎，未记录的 ``BaseForm._html_output()`` 辅助方法已被弃用。

source: The ability to return a ``str`` from ``ErrorList`` and ``ErrorDict`` is deprecated. It is expected these methods return a ``SafeString``.
zh_hans: 从 ``ErrorList`` 和 ``ErrorDict`` 返回 ``str`` 的能力已被弃用。预期这些方法返回一个 ``SafeString``。

source: Features removed in 4.0
zh_hans: 在 4.0 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 4.0.
zh_hans: 这些功能已经完成了废弃周期，并在 Django 4.0 中被移除。

source: See :ref:`deprecated-features-3.0` for details on these changes, including how to remove usage of these features.
zh_hans: 请参阅 :ref:`deprecated-features-3.0` 以获取有关这些更改的详细信息，包括如何删除对这些功能的使用。

source: ``django.utils.http.urlquote()``, ``urlquote_plus()``, ``urlunquote()``, and ``urlunquote_plus()`` are removed.
zh_hans: ``django.utils.http.urlquote()``, ``urlquote_plus()``, ``urlunquote()``, 和 ``urlunquote_plus()`` 已被移除。

source: ``django.utils.encoding.force_text()`` and ``smart_text()`` are removed.
zh_hans: ``django.utils.encoding.force_text()`` 和 ``smart_text()`` 已被移除。

source: ``django.utils.translation.ugettext()``, ``ugettext_lazy()``, ``ugettext_noop()``, ``ungettext()``, and ``ungettext_lazy()`` are removed.
zh_hans: ``django.utils.translation.ugettext()``, ``ugettext_lazy()``, ``ugettext_noop()``, ``ungettext()``, 和 ``ungettext_lazy()`` 已被移除。

source: ``django.views.i18n.set_language()`` doesn't set the user language in ``request.session`` (key ``_language``).
zh_hans: ``django.views.i18n.set_language()`` 不会在 ``request.session`` 中设置用户语言（键为 ``_language``）。

source: ``alias=None`` is required in the signature of ``django.db.models.Expression.get_group_by_cols()`` subclasses.
zh_hans: ``alias=None`` 在 ``django.db.models.Expression.get_group_by_cols()`` 子类的签名中是必需的。

source: ``django.utils.text.unescape_entities()`` is removed.
zh_hans: ``django.utils.text.unescape_entities()`` 已被移除。

source: ``django.utils.http.is_safe_url()`` is removed.
zh_hans: ``django.utils.http.is_safe_url()`` 已被移除。

source: See :ref:`deprecated-features-3.1` for details on these changes, including how to remove usage of these features.
zh_hans: 请参阅 :ref:`deprecated-features-3.1` 以获取有关这些更改的详细信息，包括如何删除对这些功能的使用。

source: The ``PASSWORD_RESET_TIMEOUT_DAYS`` setting is removed.
zh_hans: ``PASSWORD_RESET_TIMEOUT_DAYS`` 设置已被移除。

source: The :lookup:`isnull` lookup no longer allows using non-boolean values as the right-hand side.
zh_hans: :lookup:`isnull` 查询不再允许使用非布尔值作为右侧的值。

source: The ``django.db.models.query_utils.InvalidQuery`` exception class is removed.
zh_hans: ``django.db.models.query_utils.InvalidQuery`` 异常类已被移除。

source: The ``django-admin.py`` entry point is removed.
zh_hans: ``django-admin.py`` 入口点已被移除。

source: The ``HttpRequest.is_ajax()`` method is removed.
zh_hans: ``HttpRequest.is_ajax()`` 方法已被移除。
