Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Please make sure to update your :ref:`custom format files <custom-format-files>` if they contain either ``e`` or ``o`` in a format string. For example a Spanish localization format previously only escaped the ``d`` format character::
id: Harap pastikan untuk memperbaharui :ref:`custom format files <custom-format-files>` anda jika mereka mengandung baik ``e`` atau ``o`` di bentuk deretan karakter. Sebagai contoh bentuk lokalisasi Spanyol sebelumnya hanya diloloskan karakter bentuk ``d``::
zh_hans: 请确保在您的 :ref:`自定义格式文件 <custom-format-files>` 中更新包含格式字符串中的 ``e`` 或 ``o`` 的部分。例如，先前的西班牙本地化格式仅对 ``d`` 格式字符进行了转义：

source: But now it needs to also escape ``e`` and ``o``::
id: Tetapi sekarang itu membutuhkan juga meloloskan ``e`` dan ``o``::
zh_hans: 但现在它还需要转义 ``e`` 和 ``o``：

source: For more information, see the :tfilter:`date` documentation.
id: Untuk informasi lebih, lihat dokumentasi :tfilter:`date`.
zh_hans: 有关更多信息，请参阅 :tfilter:`date` 文档。

source: Django 1.4 also includes several smaller improvements worth noting:
id: Django 1.4 juga menyertakan beberapa perbaikan kecil yang tidak berharga:
zh_hans: Django 1.4 还包括一些值得注意的较小改进：

source: A more usable stacktrace in the technical 500 page. Frames in the stack trace that reference Django's framework code are dimmed out, while frames in application code are slightly emphasized. This change makes it easier to scan a stacktrace for issues in application code.
id: Stackrace lebih berguna dalam halaman 500 teknis. Kerangka-kerangka dalam tumpukan jejak yang mengacu kode kerangka kode Django dikaburkan, selagi kerangka-kerangka dalam kode aplikasi sedikit ditekankan. Perubahan ini membuat itu lebih mudah untuk memindai stacktrace untuk diterbitkan dalam kode aplikasi.
zh_hans: 技术性 500 错误页面中更易用的堆栈跟踪。堆栈跟踪中引用 Django 框架代码的帧会变暗，而应用程序代码中的帧会稍微突出。这个改变使得在堆栈跟踪中查找应用程序代码的问题变得更容易。

source: :doc:`Tablespace support </topics/db/tablespaces>` in PostgreSQL.
id: :doc:`Tablespace support </topics/db/tablespaces>` di PostgreSQL.
zh_hans: 在 PostgreSQL 中支持 :doc:`表空间 </topics/db/tablespaces>`。

source: Customizable names for :meth:`~django.template.Library.simple_tag`.
id: Disesuaikan nama-nama untuk :meth:`~django.template.Library.simple_tag`.
zh_hans: 可自定义 :meth:`~django.template.Library.simple_tag` 的名称。

source: In the documentation, a helpful :doc:`security overview </topics/security>` page.
id: Di dokumentasi, halaman :doc:`security overview </topics/security>` yang membantu.
zh_hans: 在文档中，有一个有用的 :doc:`安全概述 </topics/security>` 页面。

source: The ``django.contrib.auth.models.check_password`` function has been moved to the :mod:`django.contrib.auth.hashers` module. Importing it from the old location will still work, but you should update your imports.
id: Fungsi ``django.contrib.auth.models.check_password`` telah dipindahkan ke modul :mod:`django.contrib.auth.hashers`. Mengimpornya dari tempat lama akan masih bekerja, tetapi anda harus memperbaharui impor anda.
zh_hans: ``django.contrib.auth.models.check_password`` 函数已移动到 :mod:`django.contrib.auth.hashers` 模块。从旧位置导入仍然可以工作，但您应该更新您的导入语句。

source: The :djadmin:`collectstatic` management command now has a ``--clear`` option to delete all files at the destination before copying or linking the static files.
id: Perintah pengelolaan :djadmin:`collectstatic` sekarang mempunyai sebuah pilihan ``--clear`` untuk menghapus semua berkas pada tujuan sebelum menyalin atau menautkan berkas-berkas tetap.
zh_hans: 现在，:djadmin:`collectstatic` 管理命令具有一个 ``--clear`` 选项，用于在复制或链接静态文件之前删除目标位置的所有文件。

source: It's now possible to load fixtures containing forward references when using MySQL with the InnoDB database engine.
id: Sekarang memungkinkan memuat alat bantu mengandung terusan acuan ketika menggunakan MySQL dengan mesin basisdata InnoDB.
zh_hans: 现在可以在使用带有 InnoDB 数据库引擎的 MySQL 时加载包含前向引用的固定数据。

source: A new 403 response handler has been added as ``'django.views.defaults.permission_denied'``. You can set your own handler by setting the value of :data:`django.conf.urls.handler403`. See the documentation about :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` for more information.
id: Penanganan tanggapan 403 baru telah ditambahkan sebagai ``'django.views.defaults.permission_denied'``. Anda dapat menyetel penangan anda sendiri dengan mengatur nilai dari :data:`django.conf.urls.handler403`. Lihat dokumentasi tentang :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` untuk informasi lebih.
zh_hans: 新增了一个新的 403 响应处理程序，名称为 ``'django.views.defaults.permission_denied'``。您可以通过设置 :data:`django.conf.urls.handler403` 的值来设置自己的处理程序。有关更多信息，请参阅 :ref:`403 (HTTP Forbidden) 视图 <http_forbidden_view>` 的文档。

source: The :djadmin:`makemessages` command uses a new and more accurate lexer, :pypi:`JsLex <jslex>`, for extracting translatable strings from JavaScript files.
zh_hans: :djadmin:`makemessages` 命令现在使用一个新的、更准确的词法分析器，:pypi:`JsLex <jslex>`，用于从 JavaScript 文件中提取可翻译的字符串。

source: The :ttag:`trans` template tag now takes an optional ``as`` argument to be able to retrieve a translation string without displaying it but setting a template context variable instead.
id: Etiket cetakan :ttag:`trans` sekarang mengambil sebuah pilihan argumen ``as`` untuk dapat mengambil deretan karakter terjemahan tanpa menampilkannya tetapi mengatur konteks cetakan sebagai gantinya.
zh_hans: :ttag:`trans` 模板标签现在接受一个可选的 ``as`` 参数，以便能够检索翻译字符串而不显示它，而是设置一个模板上下文变量。

source: The :ttag:`if` template tag now supports ``{% elif %}`` clauses.
id: Etiket cetakan :ttag:`if` sekarang mendukung klausa ``{% elif %}``.
zh_hans: :ttag:`if` 模板标签现在支持 ``{% elif %}`` 子句。

source: If your Django app is behind a proxy, you might find the new :setting:`SECURE_PROXY_SSL_HEADER` setting useful. It solves the problem of your proxy "eating" the fact that a request came in via HTTPS. But only use this setting if you know what you're doing.
id: Jika aplikasi Django anda dibelakang proxy, anda mungkin menemukan pengaturan berguna baru :setting:`SECURE_PROXY_SSL_HEADER`. Itu menyelesaikan masalah dari "eating" proxy fakta bahwa sebuah permintaan datang dalam melalui HTTPS. Tetapi hanya menggunakan pengaturan ini jika anda mengetahui apa yang anda lakukan.
zh_hans: 如果您的 Django 应用程序位于代理之后，您可能会发现新的 :setting:`SECURE_PROXY_SSL_HEADER` 设置很有用。它解决了代理将请求通过 HTTPS 进行传递的问题。但只有在知道自己在做什么的情况下才使用此设置。

source: A new, plain-text, version of the HTTP 500 status code internal error page served when :setting:`DEBUG` is ``True`` is now sent to the client when Django detects that the request has originated in JavaScript code. (``is_ajax()`` is used for this.)
zh_hans: 当 :setting:`DEBUG` 为 ``True`` 时，Django 在检测到请求源自 JavaScript 代码时，会向客户端发送新的 HTTP 500 状态码内部错误页面的纯文本版本（使用 ``is_ajax()`` 进行检测）。

source: Like its HTML counterpart, it contains a collection of different pieces of information about the state of the application.
id: Seperti pasangan HTML nya, itu mengandung kumpulan dari potongan berbeda dari informasi tentang keadaan dari aplikasi.
zh_hans: 与其 HTML 对应部分一样，它包含了关于应用程序状态的不同信息片段。

source: This should make it easier to read when debugging interaction with client-side JavaScript.
id: Ini seharusnya membuatnya lebih muda untuk membaca ketika mencari kesalahan interaksi dengan JavaScript sisi-klien.
zh_hans: 这将使得在调试与客户端 JavaScript 交互时更容易阅读。

source: Added the :option:`makemessages --no-location` option.
id: Ditambahkan pilihan :option:`makemessages --no-location`.
zh_hans: 新增了 :option:`makemessages --no-location` 选项。

source: Changed the ``locmem`` cache backend to use ``pickle.HIGHEST_PROTOCOL`` for better compatibility with the other cache backends.
id: Dirubah backend tembolok ``locmem`` untuk menggunakan ``pickle.HIGHEST_PROTOCOL`` untuk kesesuaian lebih baik dengan backend tembolok lain.
zh_hans: 更改了 ``locmem`` 缓存后端，以使用 ``pickle.HIGHEST_PROTOCOL`` 以提高与其他缓存后端的兼容性。

source: Added support in the ORM for generating ``SELECT`` queries containing ``DISTINCT ON``.
id: Ditambahkan dukungan di ORM untuk membangkitkan permintaan ``SELECT`` mengandung ``DISTINCT ON``.
zh_hans: 在 ORM 中添加了生成包含 ``DISTINCT ON`` 的 ``SELECT`` 查询的支持。

source: The ``distinct()`` ``QuerySet`` method now accepts an optional list of model field names. If specified, then the ``DISTINCT`` statement is limited to these fields. This is only supported in PostgreSQL.
id: Metode ``distinct()`` ``QuerySet`` sekarang menerima sebuah daftar pilihan dari nama bidang model. Jika ditentukan, kemudian pernyataan ``DISTINCT`` dibatasi pada bidang ini. Ini hanya didukung di PostgreSQL.
zh_hans: ``distinct()`` 方法现在接受一个可选的模型字段名称列表。如果指定了这些字段，则 ``DISTINCT`` 语句将限定在这些字段上。这仅在 PostgreSQL 中支持。

source: For more details, see the documentation for :meth:`~django.db.models.query.QuerySet.distinct`.
id: Untuk lebih rinci, lihat dokumentasi untuk :meth:`~django.db.models.query.QuerySet.distinct`.
zh_hans: 有关更多详细信息，请参阅 :meth:`~django.db.models.query.QuerySet.distinct` 的文档。

source: The admin login page will add a password reset link if you include a URL with the name ``'admin_password_reset'`` in your ``urls.py``, so plugging in the built-in password reset mechanism and making it available is now much easier. For details, see :ref:`auth_password_reset`.
zh_hans: 如果在您的 ``urls.py`` 中包含一个名称为 ``'admin_password_reset'`` 的 URL，管理员登录页面将添加一个密码重置链接，因此现在更容易使用内置的密码重置机制并使其可用。有关详细信息，请参阅 :ref:`auth_password_reset`。

source: The MySQL database backend can now make use of the savepoint feature implemented by MySQL version 5.0.3 or newer with the InnoDB storage engine.
id: Backend basisdata MySQL dapat sekarang menggunakan fitur savapoint diterapkan oleh versi MySQL 5.0.3 atau lebih baru dengan mesin penyimpanan InnoDB.
zh_hans: MySQL 数据库后端现在可以利用 MySQL 5.0.3 或更新版本的 InnoDB 存储引擎实现的保存点功能。

source: It's now possible to pass initial values to the model forms that are part of both model formsets and inline model formsets as returned from factory functions ``modelformset_factory`` and ``inlineformset_factory`` respectively just like with regular formsets. However, initial values only apply to extra forms, i.e. those which are not bound to an existing model instance.
id: Sekarang memungkinkan melewati nilai awal ke formulir model yang bagian dari kedua model formset dan formset model berderet sebagai dikembalikan dari fungsi pabrik ``modelformset_factory`` dan ``inlineformset_factory`` masing-masing cukup seperti formset biasa. Bagaimanapun, nilai awal hanya berlaku pada formulir tambahan, yaitu yang tidak mengikat ke contoh model yang ada.
zh_hans: 现在，可以像常规表单集合一样，将初始值传递给模型表单，这些模型表单是从工厂函数 ``modelformset_factory`` 和 ``inlineformset_factory`` 返回的，它们分别是模型表单集合和内联模型表单集合的一部分。但是，初始值仅适用于额外的表单，即不绑定到现有模型实例的表单。

source: The sitemaps framework can now handle HTTPS links using the new :attr:`Sitemap.protocol <django.contrib.sitemaps.Sitemap.protocol>` class attribute.
id: Kerangka kerja peta situs sekarang dapat menangani tautan HTPS menggunakan atribut kelas :attr:`Sitemap.protocol <django.contrib.sitemaps.Sitemap.protocol>` baru.
zh_hans: 现在，站点地图框架可以使用新的 :attr:`Sitemap.protocol <django.contrib.sitemaps.Sitemap.protocol>` 类属性处理 HTTPS 链接。

source: A new :class:`django.test.SimpleTestCase` subclass of :class:`unittest.TestCase` that's lighter than :class:`django.test.TestCase` and company. It can be useful in tests that don't need to hit a database. See :ref:`testcase_hierarchy_diagram`.
id: Sebuah subkelas :class:`django.test.SimpleTestCase` baru dari :class:`unittest.TestCase` yaitu lebih ringan dari :class:`django.test.TestCase` dan perusahaan. Itu dapat berguna di percobaan yang tidak butuh mengenai basisdata. Lihat :ref:`testcase_hierarchy_diagram`.
zh_hans: 新增了一个 :class:`django.test.SimpleTestCase`，它是 :class:`unittest.TestCase` 的子类，比 :class:`django.test.TestCase` 和相关的测试用例更轻量。它可以在不需要访问数据库的测试中使用。请参阅 :ref:`testcase_hierarchy_diagram`。

source: Backwards incompatible changes in 1.4
id: Perubahan bertentangan kebelakang di 1.4
zh_hans: 1.4 中的不向后兼容的变更

source: SECRET_KEY setting is required
id: Pengaturan SECRET_KEY dibutuhkan
zh_hans: SECRET_KEY 设置是必需的

source: Running Django with an empty or known :setting:`SECRET_KEY` disables many of Django's security protections and can lead to remote-code-execution vulnerabilities. No Django site should ever be run without a :setting:`SECRET_KEY`.
id: Menjalankan Django dengan sebuah :setting:`SECRET_KEY` kosong atau diketahui meniadakan banyak dari perlindungan keamanan Django dan dapat membawa ke kerentanan pengerjaan-kode-terpencil. Tidak ada situs Django harus berjalan tanpa :setting:`SECRET_KEY`.
zh_hans: 使用空或已知的 :setting:`SECRET_KEY` 运行 Django 会禁用许多 Django 的安全保护功能，并可能导致远程代码执行漏洞。任何 Django 站点都不应该在没有 :setting:`SECRET_KEY` 的情况下运行。

source: In Django 1.4, starting Django with an empty :setting:`SECRET_KEY` will raise a ``DeprecationWarning``. In Django 1.5, it will raise an exception and Django will refuse to start. This is slightly accelerated from the usual deprecation path due to the severity of the consequences of running Django with no :setting:`SECRET_KEY`.
zh_hans: 在 Django 1.4 中，使用空的 :setting:`SECRET_KEY` 启动 Django 会引发 ``DeprecationWarning``。在 Django 1.5 中，它将引发异常，并且 Django 将拒绝启动。这是因为在没有 :setting:`SECRET_KEY` 的情况下运行 Django 会导致严重后果，所以这个过程略有加速。

source: The included administration app ``django.contrib.admin`` has for a long time shipped with a default set of static files such as JavaScript, images and stylesheets. Django 1.3 added a new contrib app ``django.contrib.staticfiles`` to handle such files in a generic way and defined conventions for static files included in apps.
id: Aplikasi administrasi disertakan ``django.contrib.admin`` telah untuk waktu lama dibekali dengan awalan sekumpulan dari berkas-berkas tetap seperti JavaScript, gambar dan stylesheet. Django 1.3 ditambahkan sebuah bantuan aplikasi baru ``django.contrib.staticfiles`` untuk menangani berkas seperti itu di cara umum dan menentukan persetujuan untuk berkas-berkas tetap disertakan di aplikasi.
zh_hans: 包含的管理应用程序 ``django.contrib.admin`` 长期以来都包含了一组默认的静态文件，如 JavaScript、图像和样式表。Django 1.3 添加了一个新的 contrib 应用程序 ``django.contrib.staticfiles``，以一种通用的方式处理这些文件，并定义了应用程序中包含的静态文件的约定。

source: Starting in Django 1.4, the admin's static files also follow this convention, to make the files easier to deploy. In previous versions of Django, it was also common to define an ``ADMIN_MEDIA_PREFIX`` setting to point to the URL where the admin's static files live on a web server. This setting has now been deprecated and replaced by the more general setting :setting:`STATIC_URL`. Django will now expect to find the admin static files under the URL ``<STATIC_URL>/admin/``.
zh_hans: 从 Django 1.4 开始，管理界面的静态文件也遵循这个约定，以使文件更容易部署。在 Django 的早期版本中，通常会定义一个 ``ADMIN_MEDIA_PREFIX`` 设置，指向 web 服务器上管理界面的静态文件所在的 URL。现在，这个设置已被弃用，并由更通用的设置 :setting:`STATIC_URL` 取代。Django 现在期望在 URL ``<STATIC_URL>/admin/`` 下找到管理界面的静态文件。

source: If you've previously used a URL path for ``ADMIN_MEDIA_PREFIX`` (e.g. ``/media/``) simply make sure :setting:`STATIC_URL` and :setting:`STATIC_ROOT` are configured and your web server serves those files correctly. The development server continues to serve the admin files just like before. Read the :doc:`static files howto </howto/static-files/index>` for more details.
zh_hans: 如果您之前使用了 ``ADMIN_MEDIA_PREFIX`` 的 URL 路径（例如 ``/media/``），只需确保 :setting:`STATIC_URL` 和 :setting:`STATIC_ROOT` 配置正确，并且您的 Web 服务器能够正确提供这些文件。开发服务器仍然像以前一样提供管理界面的文件。阅读 :doc:`静态文件 howto </howto/static-files/index>` 以获取更多详细信息。

source: If your ``ADMIN_MEDIA_PREFIX`` is set to a specific domain (e.g. ``http://media.example.com/admin/``), make sure to also set your :setting:`STATIC_URL` setting to the correct URL -- for example, ``http://media.example.com/``.
zh_hans: 如果您的 ``ADMIN_MEDIA_PREFIX`` 设置为特定的域名（例如 ``http://media.example.com/admin/``），请确保将您的 :setting:`STATIC_URL` 设置为正确的 URL，例如 ``http://media.example.com/``。

source: If you're implicitly relying on the path of the admin static files within Django's source code, you'll need to update that path. The files were moved from :file:`django/contrib/admin/media/` to :file:`django/contrib/admin/static/admin/`.
id: Jika anda sedang tidak langsung bergantung pada jalur dari berkas tetap admin dalam kode sumber Django, anda akan butuh memperbaharui jalur itu. Berkas-berkas dipindahkan dari :file:`django/contrib/admin/media/` ke :file:`django/contrib/admin/static/admin/`.
zh_hans: 如果您隐式依赖于 Django 源代码中管理界面静态文件的路径，您需要更新该路径。这些文件已从 :file:`django/contrib/admin/media/` 移动到 :file:`django/contrib/admin/static/admin/`。

source: Supported browsers for the admin
id: Perambah didukung untuk admin
zh_hans: 管理支持的浏览器

source: Django hasn't had a clear policy on which browsers are supported by the admin app. Our new policy formalizes existing practices: `YUI's A-grade`_ browsers should provide a fully-functional admin experience, with the notable exception of Internet Explorer 6, which is no longer supported.
id: Django belum mempunyai kebijakan jelas pada perambah mana yang didukung oleh aplikasi admin. Kebijakan baru kami meresmikan praktik yang ada: perambah `YUI's A-grade`_ harus menyediakan pengalaman admin berfungsi-penuh, dengan keterangan pengecualian dari Internet Explorer 6, yang tidak lagi didukung.
zh_hans: Django 对于管理界面应用程序支持哪些浏览器一直没有明确的政策。我们的新政策正式规范了现有的做法：`YUI 的 A 级`_ 浏览器应提供完整功能的管理界面体验，但不再支持 Internet Explorer 6，这是一个显著的例外。

source: Released over 10 years ago, IE6 imposes many limitations on modern web development. The practical implications of this policy are that contributors are free to improve the admin without consideration for these limitations.
zh_hans: IE6 发布于 10 多年前，给现代 Web 开发带来了许多限制。这项政策的实际影响是，贡献者可以在不考虑这些限制的情况下自由地改进管理员界面。

source: This new policy **has no impact** on sites you develop using Django. It only applies to the Django admin. Feel free to develop apps compatible with any range of browsers.
zh_hans: 这个新政策 **不会影响** 使用 Django 开发的网站。它仅适用于 Django 管理界面。请随意开发与各种浏览器兼容的应用程序。

source: Removed admin icons
id: Pindahkan ikon admin
zh_hans: 移除了管理图标

source: As part of an effort to improve the performance and usability of the admin's change-list sorting interface and :attr:`horizontal <django.contrib.admin.ModelAdmin.filter_horizontal>` and :attr:`vertical <django.contrib.admin.ModelAdmin.filter_vertical>` "filter" widgets, some icon files were removed and grouped into two sprite files.
id: Sebagai bagian dari sebuah usaha untuk meningkatkan penampilan dan kegunaan dari antarmuka pengurutan daftar-rubah admin dan widget :attr:`horizontal <django.contrib.admin.ModelAdmin.filter_horizontal>` dan :attr:`vertical <django.contrib.admin.ModelAdmin.filter_vertical>` "filter", beberapa berkas ikon telah dipindahkan dan dikelompokkan kedalam dua berkas sprite.
zh_hans: 为了改善管理界面的列表排序界面和 :attr:`horizontal <django.contrib.admin.ModelAdmin.filter_horizontal>` 和 :attr:`vertical <django.contrib.admin.ModelAdmin.filter_vertical>` "filter" 小部件的性能和可用性，一些图标文件已被删除并组合到两个精灵文件中。

source: Specifically: ``selector-add.gif``, ``selector-addall.gif``, ``selector-remove.gif``, ``selector-removeall.gif``, ``selector_stacked-add.gif`` and ``selector_stacked-remove.gif`` were combined into ``selector-icons.gif``; and ``arrow-up.gif`` and ``arrow-down.gif`` were combined into ``sorting-icons.gif``.
id: Khususnya: ``selector-add.gif``, ``selector-addall.gif``, ``selector-remove.gif``, ``selector-removeall.gif``, ``selector_stacked-add.gif`` dan ``selector_stacked-remove.gif`` telah digabungkan kedalam ``selector-icons.gif``; dan ``arrow-up.gif`` dan ``arrow-down.gif`` telah digabungkan kedalam ``sorting-icons.gif``.
zh_hans: 具体来说：``selector-add.gif``, ``selector-addall.gif``, ``selector-remove.gif``, ``selector-removeall.gif``, ``selector_stacked-add.gif`` 和 ``selector_stacked-remove.gif`` 已合并到 ``selector-icons.gif`` 中；``arrow-up.gif`` 和 ``arrow-down.gif`` 已合并到 ``sorting-icons.gif`` 中。

source: If you used those icons to customize the admin, then you'll need to replace them with your own icons or get the files from a previous release.
id: Jika anda menggunakan ikon-ikon tersebut untuk menyesuaikan admin, kemudian anda akan butuh mengganti mereka dengan ikon-ikon anda sendiri atau mendapatkan berkas-berkas dari terbitan sebelumnya.
zh_hans: 如果您使用这些图标来自定义管理员界面，那么您需要用自己的图标替换它们，或者从以前的版本中获取这些文件。

source: CSS class names in admin forms
id: Nama kelas CSS di formulir admin
zh_hans: 管理员表单中的 CSS 类名

source: To avoid conflicts with other common CSS class names (e.g. "button"), we added a prefix ("field-") to all CSS class names automatically generated from the form field names in the main admin forms, stacked inline forms and tabular inline cells. You'll need to take that prefix into account in your custom style sheets or JavaScript files if you previously used plain field names as selectors for custom styles or JavaScript transformations.
id: Untuk menghindari pertentangan dengan nama kelas CSS umum lainnya (sebagai contoh "button"), kami menambahkan awalan (field-") ke semua nama kelas yang otomatis dibangkitkan dari nama bidang di formulir admin utama, formulir ditumpuk berderet dan sel-sel datar berderet. Anda akan butuh mengambil awalan itu kedalam akun di lembaran gaya penyesuaian anda atau berkas JavaScript jika anda sebelumnya menggunakan nama bidang polos sebagai pemilih untuk gaya penyesuaian atau perubahan JavaScript.
zh_hans: 为避免与其他常见 CSS 类名（例如 "button"）发生冲突，我们为主管理员表单、堆叠内联表单和表格内联单元格中的表单字段名自动生成的所有 CSS 类名添加了一个前缀（"field-"）。如果您之前使用普通字段名作为自定义样式或 JavaScript 转换的选择器，您需要在自定义样式表或 JavaScript 文件中考虑到这个前缀。

source: Compatibility with old signed data
id: Kesesuaian dengan data lama ditandatangani
zh_hans: 与旧版签名数据的兼容性

source: Django 1.3 changed the cryptographic signing mechanisms used in a number of places in Django. While Django 1.3 kept fallbacks that would accept hashes produced by the previous methods, these fallbacks are removed in Django 1.4.
id: Django 1.3 merubah mekanisme penandatanganan kriptografi digunakan dalam sejumlah tempat di Django. Selagi Django 1.3 terus menggunakan yang akan menerima acakan dihasilkan oleh metode sebelumnya, penggunaan ini akan dipindahkan di Django 1.4.
zh_hans: Django 1.3 更改了 Django 中多个地方使用的加密签名机制。尽管 Django 1.3 保留了接受由之前方法生成的哈希值的回退机制，但这些回退机制在 Django 1.4 中已被移除。

source: So, if you upgrade to Django 1.4 directly from 1.2 or earlier, you may lose/invalidate certain pieces of data that have been cryptographically signed using an old method. To avoid this, use Django 1.3 first for a period of time to allow the signed data to expire naturally. The affected parts are detailed below, with 1) the consequences of ignoring this advice and 2) the amount of time you need to run Django 1.3 for the data to expire or become irrelevant.
id: Jadi, jika anda meningkatkan ke Django 1.4 secara langsung dari 1.2 atau lebih awal, anda mungkin kehilangan/membatalkan potongan tertentu dari data yang telah dikriptografi ditandatangani menggunakan metode lama. Untuk menghindari ini, gunakan Django 1.3 dahulu untuk masa dari waktu untuk mengizinkan data ditandatangani untuk secara alamai kadaluarsa. Bagian terpengaruh dirinci dibawah ini, dengan 1) akibat dari mengabaikan saran ini dan 2) sejumlah waktu anda butuhkan untuk menjalankan Django 1.3 untuk data menjadi kadaluarsa atau menjadi tidak bersangkut paut.
zh_hans: 因此，如果您直接从 1.2 或更早版本升级到 Django 1.4，您可能会丢失/使使用旧方法加密签名的某些数据失效。为避免这种情况，请先使用 Django 1.3 一段时间，以便让签名数据自然过期。受影响的部分详细说明如下： 1 ) 忽略此建议的后果； 2 ) 为使数据过期或变得无关紧要，您需要运行 Django 1.3 的时间。

source: ``contrib.sessions`` data integrity check
id: Pemeriksaan kesatuan data ``contrib.sessions``
zh_hans: ``contrib.sessions`` 数据完整性检查

source: Consequences: The user will be logged out, and session data will be lost.
id: Konsekuensi: Pengguna akan keluar, dan data sesi akan hilang.
zh_hans: 后果：用户将被登出，且会话数据将丢失。

source: Time period: Defined by :setting:`SESSION_COOKIE_AGE`.
id: Periode waktu: Ditentukan oleh :setting:`SESSION_COOKIE_AGE`.
zh_hans: 时间段：由 :setting:`SESSION_COOKIE_AGE` 定义。
