Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The widgets in ``contrib.gis.forms.widgets`` and the admin's ``OpenLayersWidget`` use the :doc:`form rendering API </ref/forms/renderers>` rather than ``loader.render_to_string()``. If you're using a custom widget template, you'll need to be sure your form renderer can locate it. For example, you could use the :class:`~django.forms.renderers.TemplatesSetting` renderer.
id: Widget dalam ``contrib.gis.forms.widgets`` dan ``OpenLayersWidget`` admin menggunakan :doc:`form rendering API 1` daripada daripada ``loader.render_to_string()``.Jika anda sedang menggunakan cetakan widget penyesuaian, anda akan butuh memastikan formulir anda dibangun dapat menempatkan itu. Sebagai contoh, anda dapat juga menggunakan pembangun :class:`~django.forms.renderers.TemplatesSetting`.
zh_hans: ``contrib.gis.forms.widgets`` 中的小部件和管理员的 ``OpenLayersWidget`` 现在使用 :doc:`表单渲染 API </ref/forms/renderers>` 而不是 ``loader.render_to_string()``。如果您使用自定义小部件模板，您需要确保您的表单渲染器可以找到它。例如，您可以使用 :class:`~django.forms.renderers.TemplatesSetting` 渲染器。

source: ``collectstatic`` may now fail during post-processing when using a hashed static files storage if a reference loop exists (e.g. ``'foo.css'`` references ``'bar.css'`` which itself references ``'foo.css'``) or if the chain of files referencing other files is too deep to resolve in several passes. In the latter case, increase the number of passes using :attr:`.ManifestStaticFilesStorage.max_post_process_passes`.
id: ``collectstatic`` mungkin sekarang gagal selama penempatan-pengolahan ketika menggunakan sebuah penyimpanan berkas statis dicampur jika perulangan terkait ada (sebagai contoh ``'foo.css'`` mengacu ``'bar.css'`` yang itu sendiri mengacu ``'foo.css'``) atau jika rantai dari berkas-berkas mengacu berkas-berkas lain terlalu dalam untuk dipecahkan dalam beberapa perlewatan. Dalam kasus terakhir, meningkatkan sejumlah perlewatan menggunakan :attr:`.ManifestStaticFilesStorage.max_post_process_passes`.
zh_hans: 当使用散列的静态文件存储时，如果存在引用循环（例如，``'foo.css'`` 引用 ``'bar.css'``，而 ``'bar.css'`` 又引用 ``'foo.css'``），或者如果引用其他文件的文件链过深，无法在多次传递中解析，那么 ``collectstatic`` 在后处理期间可能会失败。在后一种情况下，可以通过 :attr:`.ManifestStaticFilesStorage.max_post_process_passes` 增加传递次数。

source: When using ``ManifestStaticFilesStorage``, static files not found in the manifest at runtime now raise a ``ValueError`` instead of returning an unchanged path. You can revert to the old behavior by setting :attr:`.ManifestStaticFilesStorage.manifest_strict` to ``False``.
id: Ketika menggunakan ``ManifestStaticFilesStorage``, berkas-berkas statis tidak ditemukan dalam manifest pada waktu berjalan sekarang memunculkan ``ValueError`` daripada mengembalikan jalur tidak berubah. Anda dapat merubah ke perilaku lama dengan mengatur :attr:`.ManifestStaticFilesStorage.manifest_strict`menjadi ``False``.
zh_hans: 当使用 ``ManifestStaticFilesStorage`` 时，运行时未在清单中找到的静态文件现在会引发 ``ValueError``，而不是返回不变的路径。您可以通过将 :attr:`.ManifestStaticFilesStorage.manifest_strict` 设置为 ``False`` 来恢复到旧的行为。

source: This section describes changes that may be needed in third-party database backends.
id: Bagian ini menjelaskan perubahan yang mungkin diperlukan oleh backend basis data pihak ketiga.
zh_hans: 本节介绍了第三方数据库后端可能需要的更改。

source: The ``DatabaseOperations.time_trunc_sql()`` method is added to support ``TimeField`` truncation. It accepts a ``lookup_type`` and ``field_name`` arguments and returns the appropriate SQL to truncate the given time field ``field_name`` to a time object with only the given specificity. The ``lookup_type`` argument can be either ``'hour'``, ``'minute'``, or ``'second'``.
id: Metode ``DatabaseOperations.time_trunc_sql()`` ditambahkan untuk mendukung pemotongan ``TimeField``. Itu menerima argumen ``lookup_type`` dan ``field_name`` dan mengembalikan SQL sesuai untuk memotong bidang waktu yang diberikan pada sebuah obyek waktu dengan hanya diberikan kekhususan. Argumen ``lookup_type`` dapat salsah satu ``'hour'``, ``'minute'``, atau ``'second'``.
zh_hans: 新增了 ``DatabaseOperations.time_trunc_sql()`` 方法，以支持 ``TimeField`` 截断。它接受一个 ``lookup_type`` 和 ``field_name`` 参数，并返回将给定时间字段 ``field_name`` 截断为只具有给定精度的时间对象的适当 SQL。``lookup_type`` 参数可以是 ``'hour'``、``'minute'`` 或 ``'second'``。

source: The ``DatabaseOperations.datetime_cast_time_sql()`` method is added to support the :lookup:`time` lookup. It accepts a ``field_name`` and ``tzname`` arguments and returns the SQL necessary to cast a datetime value to time value.
id: Metode ``DatabaseOperations.datetime_cast_time_sql()`` ditambahkan untuk mendukung pencarian :lookup:`time`. Itu menerima argumen ``field_name`` dan ``tzname`` dan mengembalikan SQL yang dibutuhkan untuk membuang nilai datetime menjadi nilai waktu.
zh_hans: 新增了 ``DatabaseOperations.datetime_cast_time_sql()`` 方法，以支持 :lookup:`time` 查询。它接受一个 ``field_name`` 和 ``tzname`` 参数，并返回将日期时间值强制转换为时间值所需的 SQL。

source: To enable ``FOR UPDATE SKIP LOCKED`` support, set ``DatabaseFeatures.has_select_for_update_skip_locked = True``.
id: Untuk mengadakan dukungan ``FOR UPDATE SKIP LOCKED``, setel ``DatabaseFeatures.has_select_for_update_skip_locked = True``.
zh_hans: 要启用 ``FOR UPDATE SKIP LOCKED`` 支持，请设置 ``DatabaseFeatures.has_select_for_update_skip_locked = True``。

source: The new ``DatabaseFeatures.supports_index_column_ordering`` attribute specifies if a database allows defining ordering for columns in indexes. The default value is ``True`` and the ``DatabaseIntrospection.get_constraints()`` method should include an ``'orders'`` key in each of the returned dictionaries with a list of ``'ASC'`` and/or ``'DESC'`` values corresponding to the ordering of each column in the index.
zh_hans: 新的 ``DatabaseFeatures.supports_index_column_ordering`` 属性指定数据库是否允许在索引中定义列的排序。默认值为 ``True``，而 ``DatabaseIntrospection.get_constraints()`` 方法应在每个返回的字典中包含一个 ``'orders'`` 键，该键包含一个列表，其中包含与索引中每列的排序对应的 ``'ASC'`` 和/或 ``'DESC'`` 值。

source: :djadmin:`inspectdb` no longer calls ``DatabaseIntrospection.get_indexes()`` which is deprecated. Custom database backends should ensure all types of indexes are returned by ``DatabaseIntrospection.get_constraints()``.
id: :djadmin:`inspectdb` tidak lagi memanggil ``DatabaseIntrospection.get_indexes()``yang diusangkan. Backend basisdata penyesuaian harus memastikan semua jenis dari indeks dikembalikan oleh ``DatabaseIntrospection.get_constraints()``.
zh_hans: :djadmin:`inspectdb` 不再调用已弃用的 ``DatabaseIntrospection.get_indexes()`` 方法。自定义数据库后端应确保 ``DatabaseIntrospection.get_constraints()`` 返回所有类型的索引。

source: Renamed the ``ignores_quoted_identifier_case`` feature to ``ignores_table_name_case`` to more accurately reflect how it is used.
id: Namai kembali fitur ``ignores_quoted_identifier_case`` untuk ``ignores_table_name_case`` untuk lebih akurat mencerminkan bagaimana itu digunakan.
zh_hans: 将 ``ignores_quoted_identifier_case`` 功能的名称更改为 ``ignores_table_name_case``，以更准确地反映它的使用方式。

source: The ``name`` keyword argument is added to the ``DatabaseWrapper.create_cursor(self, name=None)`` method to allow usage of server-side cursors on backends that support it.
id: Argumen kata kunci ``name`` ditambahkan ke metode ``DatabaseWrapper.create_cursor(self, name=None)`` untuk mengizinkan penggunaan dari kursor sisi-peladen pada backend yang mendukung itu.
zh_hans: 新增了 ``name`` 关键字参数到 ``DatabaseWrapper.create_cursor(self, name=None)`` 方法，以允许在支持的后端上使用服务器端游标。

source: Dropped support for PostgreSQL 9.2 and PostGIS 2.0
id: Dibuang dukungan untuk PostgreSQL 9.2 dan PostGIS 2.0
zh_hans: 不再支持 PostgreSQL 9.2 和 PostGIS 2.0 。

source: Upstream support for PostgreSQL 9.2 ends in September 2017. As a consequence, Django 1.11 sets PostgreSQL 9.3 as the minimum version it officially supports.
id: Dukungan hulu untuk PostgreSQL 9.2 berakhir dalam September 2017. Sebagai konsekuensinya, Django 1.11 menyetel PostgreSQL 9.3 sebagai versi minimal itu secara resmi dukung.
zh_hans: PostgreSQL 9.2 的上游支持将于 2017 年 9 月结束。因此，Django 1.11 将 PostgreSQL 9.3 设为其官方支持的最低版本。

source: Support for PostGIS 2.0 is also removed as PostgreSQL 9.2 is the last version to support it.
id: Dukungan untuk PostGIS 2.0 juga dipindahkan sebagai PostgreSQL 9.2 adalah versi terakhir untuk mendukung itu.
zh_hans: 由于 PostgreSQL 9.2 是支持 PostGIS 2.0 的最后一个版本，因此也取消了对 PostGIS 2.0 的支持。

source: Also, the minimum supported version of psycopg2 is increased from 2.4.5 to 2.5.4.
id: Juga, versi didukung minimal dari psycopg2ditingkatkan dari 2.4.5 menjadi 2.5.4.
zh_hans: 此外，支持的最低 psycopg2 版本从 2.4.5 提高到 2.5.4 。

source: ``LiveServerTestCase`` binds to port zero
id: ``LiveServerTestCase`` mengikat ke port nol
zh_hans: ``LiveServerTestCase`` 现在绑定到零端口

source: Rather than taking a port range and iterating to find a free port, ``LiveServerTestCase`` binds to port zero and relies on the operating system to assign a free port. The ``DJANGO_LIVE_TEST_SERVER_ADDRESS`` environment variable is no longer used, and as it's also no longer used, the ``manage.py test --liveserver`` option is removed.
id: Daripada mengambil jangkauan port dan mengulang menemukan port bebas, ``LiveServerTestCase`` mengikat port ke nol dan bergantung pada sistem operasi untuk memberikan port bebas. Variabel lingkungan ``DJANGO_LIVE_TEST_SERVER_ADDRESS`` tidak lagi digunakan, dan ketika itu tidak lagi digunakan, pilihan ``manage.py test --liveserver`` dipindahkan.
zh_hans: 与其采用端口范围并迭代查找空闲端口，``LiveServerTestCase`` 现在绑定到零端口，并依赖操作系统分配空闲端口。不再使用 ``DJANGO_LIVE_TEST_SERVER_ADDRESS`` 环境变量，也不再使用 ``manage.py test --liveserver`` 选项。

source: If you need to bind ``LiveServerTestCase`` to a specific port, use the ``port`` attribute added in Django 1.11.2.
id: Jika anda butuh mengikat ``LiveServerTestCase`` pada port khusus, gunakan atribut ``port`` ditambahkan dalam Django 1.11.2.
zh_hans: 如果需要将 ``LiveServerTestCase`` 绑定到特定端口，可以使用 Django 1.11.2 中新增的 ``port`` 属性。

source: Protection against insecure redirects in :mod:`django.contrib.auth` and ``i18n`` views
id: Perlindungan terhadap pengalihan tidak aman dalam tampilan :mod:`django.contrib.auth` dan ``i18n``
zh_hans: 在 :mod:`django.contrib.auth` 和 ``i18n`` 视图中加强了对不安全的重定向的保护。

source: ``LoginView``, ``LogoutView`` (and the deprecated function-based equivalents), and :func:`~django.views.i18n.set_language` protect users from being redirected to non-HTTPS ``next`` URLs when the app is running over HTTPS.
id: ``LoginView``, ``LogoutView`` (dan setara berdasarkan-fungsi diusangkan), dan :func:`~django.views.i18n.set_language` melindungi pengguna dari sedang dialigkan ke bukan-HTTPS url ``next`` ketika aplikasi sedang berjalan terhadap HTTPS.
zh_hans: ``LoginView``、``LogoutView`` （以及已弃用的函数式等效版本）和 :func:`~django.views.i18n.set_language` 在应用程序运行在 HTTPS 上时，会保护用户免受被重定向到非 HTTPS 的 ``next`` URL 的影响。

source: ``QuerySet.get_or_create()`` and ``update_or_create()`` validate arguments
id: Argumen pengecekan ``QuerySet.get_or_create()`` dan ``update_or_create()``
zh_hans: ``QuerySet.get_or_create()`` 和 ``update_or_create()`` 现在会验证参数。

source: To prevent typos from passing silently, :meth:`~django.db.models.query.QuerySet.get_or_create` and :meth:`~django.db.models.query.QuerySet.update_or_create` check that their arguments are model fields. This should be backwards-incompatible only in the fact that it might expose a bug in your project.
id: Untuk mencegah salah ketik dari melewatkan secara diam, :meth:`~django.db.models.query.QuerySet.get_or_create` dan :meth:`~django.db.models.query.QuerySet.update_or_create` memeriksa bahwa argumen mereka adalah bidang model. Ini harus berupa ketidaksesuaian-kebelakang hanya dalam fakta bahwa itu mungkin mengungkapkan kesalahan dalam proyek anda.
zh_hans: 为了防止拼写错误默默通过，:meth:`~django.db.models.query.QuerySet.get_or_create` 和 :meth:`~django.db.models.query.QuerySet.update_or_create` 检查它们的参数是否是模型字段。这只会在一个方面引入向后不兼容，可能会暴露出项目中的错误。

source: ``pytz`` is a required dependency and support for ``settings.TIME_ZONE = None`` is removed
id: ``pytz`` adalah ketergantungan diwajibkan dan mendukung untuk ``settings.TIME_ZONE = None`` dipindahkan
zh_hans: ``pytz`` 现在是必需的依赖项，不再支持将 ``settings.TIME_ZONE = None``。

source: To simplify Django's timezone handling, ``pytz`` is now a required dependency. It's automatically installed along with Django.
id: Untuk menyerdahanakan penanganan zona waktu Django, ``pytz`` sekarang membutuhkan ketergantungan. Itu otomatis memasang bersama dengan Django.
zh_hans: 为了简化 Django 的时区处理，``pytz`` 现在是必需的依赖项，它会自动与 Django 一起安装。

source: Support for ``settings.TIME_ZONE = None`` is removed as the behavior isn't commonly used and is questionably useful. If you want to automatically detect the timezone based on the system timezone, you can use :pypi:`tzlocal`::
zh_hans: 不再支持 ``settings.TIME_ZONE = None``，因为这种行为通常不常用且可疑的有用性。如果希望根据系统时区自动检测时区，可以使用 :pypi:`tzlocal`。

source: This works similar to ``settings.TIME_ZONE = None`` except that it also sets ``os.environ['TZ']``. `Let us know <https://groups.google.com/g/django-developers/c/OAV3FChfuPM/discussion>`__ if there's a use case where you find you can't adapt your code to set a ``TIME_ZONE``.
zh_hans: 这与 ``settings.TIME_ZONE = None`` 类似，但它还设置了 ``os.environ['TZ']``。如果存在情况下，您发现无法适应设置 ``TIME_ZONE`` 的代码，请通过 `告诉我们 <https://groups.google.com/g/django-developers/c/OAV3FChfuPM/discussion>`__。

source: HTML changes in admin templates
id: Perubahan HTML dalam cetakan admin
zh_hans: 管理模板中的 HTML 更改

source: ``<p class="help">`` is replaced with a ``<div>`` tag to allow including lists inside help text.
id: ``<p class="help">`` diganti dengan etiket ``<div>`` untuk mengizinkan daftar di dalam teks bantuan.
zh_hans: ``<p class="help">`` 被替换为 ``<div>`` 标签，以允许在帮助文本中包含列表。

source: Read-only fields are wrapped in ``<div class="readonly">...</div>`` instead of ``<p>...</p>`` to allow any kind of HTML as the field's content.
id: Bidang-bidang hanya-baca dibungkus dalam ``1...1`` daripada ``2...2`` untuk mengizinkan apapun dari HTML sebagai isi bidang.
zh_hans: 只读字段现在被包装在 ``<div class="readonly">...</div>`` 中，而不是 ``<p>...</p>``，以允许字段内容包含任何类型的 HTML。

source: Changes due to the introduction of template-based widget rendering
id: Perubahan karena perkenalan dari membangun widget berdasarkan-cetakan
zh_hans: 由于引入基于模板的小部件渲染，发生了一些更改。

source: Some undocumented classes in ``django.forms.widgets`` are removed:
id: Beberapa kelas-kelas tidak terdokumentasi dalam ``django.forms.widgets`` dipindahkan:
zh_hans: 移除了 ``django.forms.widgets`` 中一些未记录的类：

source: The undocumented ``Select.render_option()`` method is removed.
id: Metode ``Select.render_option()`` tidak didokumentasikan dipindahkan.
zh_hans: 移除了未记录的 ``Select.render_option()`` 方法。

source: The ``Widget.format_output()`` method is removed. Use a custom widget template instead.
id: Metode ``Widget.format_output()`` dipindahkan. Gunakan cetakan widget penyesuaian sebagai gantinya.
zh_hans: 移除了 ``Widget.format_output()`` 方法。请使用自定义小部件模板替代。

source: Some widget values, such as ``<select>`` options, are now localized if ``settings.USE_L10N=True``. You could revert to the old behavior with custom widget templates that uses the :ttag:`localize` template tag to turn off localization.
id: Beberapa nilai widget, seperti pilihan ``1``, sekarang dipelokalan jika ``settings.USE_L10N=True``. Anda dapat merubah ke perilaku lama dengan cetakan widget penyesuaian yang menggunakan etiket cetakan :ttag:`localize` untuk mematikan pelokalan.
zh_hans: 如果 ``settings.USE_L10N=True``，现在某些小部件的值，如 ``<select>`` 选项，将进行本地化。您可以通过使用 :ttag:`localize` 模板标签关闭本地化，恢复到旧的行为，使用自定义小部件模板。

source: ``django.template.backends.django.Template.render()`` prohibits non-dict context
id: ``django.template.backends.django.Template.render()`` melarang konteks bukan-dict
zh_hans: ``django.template.backends.django.Template.render()`` 禁止非字典上下文。

source: For compatibility with multiple template engines, ``django.template.backends.django.Template.render()`` (returned from high-level template loader APIs such as ``loader.get_template()``) must receive a dictionary of context rather than ``Context`` or ``RequestContext``. If you were passing either of the two classes, pass a dictionary instead -- doing so is backwards-compatible with older versions of Django.
id: Untuk kesesuaian dengan banyak cetakan mesin, ``django.template.backends.django.Template.render()`` (dikembalikan dari API pemuat cetakan tingkat-tinggi seperti ``loader.get_template()``)harus menerima sebuah dictionary dari konteks daripada ``Context`` atau ``RequestContext``.Jika anda sedang melewatkan antara dua kelas, lewatkan dictionary sebagai gantinya -- melakukan itu kesesuaian-kebelakang dengan versi terlama dari Django.
zh_hans: 为了与多个模板引擎兼容，``django.template.backends.django.Template.render()`` （从高级模板加载器 API（如 ``loader.get_template()``）返回）必须接收一个上下文字典，而不是 ``Context`` 或 ``RequestContext``。如果您之前传递了这两个类中的任何一个，请改为传递一个字典 - 这样做是向后兼容旧版本的 Django。

source: Model state changes in migration operations
id: Perubahan keadaan model dalam tindakan perpindahan
zh_hans: 迁移操作中的模型状态更改

source: To improve the speed of applying migrations, rendering of related models is delayed until an operation that needs them (e.g. ``RunPython``). If you have a custom operation that works with model classes or model instances from the ``from_state`` argument in ``database_forwards()`` or ``database_backwards()``, you must render model states using the ``clear_delayed_apps_cache()`` method as described in :ref:`writing your own migration operation <writing-your-own-migration-operation>`.
id: Untuk meningkatkan kecepatan dari memberlakukan perpindahan, membangun dari model terkait ditunda sampai sebuah tindakan yang butuh mereka (sebagai contoh ``RunPython``). Jika anda mempunyai tindakan penyesuaian yang bekerja dengan kelas-kelas model atau instance mode dari argumen ``from_state`` dalam ``database_forwards()`` atau ``database_backwards()``, anda harus membangun keadaan model menggunakan metode ``clear_delayed_apps_cache()`` seperti digambarkan dalam :ref:`writing your own migration operation 1`.
zh_hans: 为了提高应用迁移的速度，延迟了相关模型的渲染，直到需要它们的操作（例如 ``RunPython``）。如果您有一个自定义操作，需要在 ``database_forwards()`` 或 ``database_backwards()`` 的 ``from_state`` 参数中使用模型类或模型实例，您必须使用 ``clear_delayed_apps_cache()`` 方法来渲染模型状态，如 :ref:`编写自己的迁移操作 <writing-your-own-migration-operation>` 中所述。

source: Server-side cursors on PostgreSQL
id: Kursor sisi-peladen pada PostgreSQL
zh_hans: PostgreSQL 上的服务器端游标

source: The change to make :meth:`.QuerySet.iterator()` use server-side cursors on PostgreSQL prevents running Django with PgBouncer in transaction pooling mode. To reallow that, use the :setting:`DISABLE_SERVER_SIDE_CURSORS <DATABASE-DISABLE_SERVER_SIDE_CURSORS>` setting (added in Django 1.11.1) in :setting:`DATABASES`.
zh_hans: 将 :meth:`.QuerySet.iterator()` 使用服务器端游标在 PostgreSQL 上可能会阻止在事务池模式下使用 PgBouncer 运行 Django。要重新允许这样做，可以在 :setting:`DATABASES` 中使用 :setting:`DISABLE_SERVER_SIDE_CURSORS <DATABASE-DISABLE_SERVER_SIDE_CURSORS>` 设置（在 Django 1.11.1 中添加）。

source: See :ref:`transaction-pooling-server-side-cursors` for more discussion.
id: Lihat :ref:`transaction-pooling-server-side-cursors` untuk obrolan lebih.
zh_hans: 有关更多讨论，请参阅 :ref:`transaction-pooling-server-side-cursors`。

source: If no items in the feed have a ``pubdate`` or ``updateddate`` attribute, :meth:`SyndicationFeed.latest_post_date() <django.utils.feedgenerator.SyndicationFeed.latest_post_date>` now returns the current UTC date/time, instead of a datetime without any timezone information.
id: Jika tidak ada barang dalam umpan mempunyai atribut ``pubdate`` atau ``updateddate``, :meth:`SyndicationFeed.latest_post_date() <django.utils.feedgenerator.SyndicationFeed.latest_post_date>` sekarang mengembalikan date/time UTC saat ini, daripada datetime tanpa informasi zona waktu apapun.
zh_hans: 如果在 feed 中没有任何项目具有 ``pubdate`` 或 ``updateddate`` 属性，那么 :meth:`SyndicationFeed.latest_post_date() <django.utils.feedgenerator.SyndicationFeed.latest_post_date>` 现在会返回当前的 UTC 日期/时间，而不是一个没有任何时区信息的 datetime。

source: CSRF failures are logged to the ``django.security.csrf`` logger instead of ``django.request``.
id: Kegagalan CSRF dicatat ke pencatat ``django.security.csrf`` daripada ``django.request``.
zh_hans: CSRF 失败现在会被记录到 ``django.security.csrf`` 日志器，而不是 ``django.request``。

source: :setting:`ALLOWED_HOSTS` validation is no longer disabled when running tests. If your application includes tests with custom host names, you must include those host names in :setting:`ALLOWED_HOSTS`. See :ref:`topics-testing-advanced-multiple-hosts`.
id: Pengesahan :setting:`ALLOWED_HOSTS` tidak lagi ditiadakan ketika menjalankan percobaan. Jika aplikasi anda termasuk percobaan dengan nama rumah penyesuaian, anda harus menyertakan nama rumah tersebut dalam :setting:`ALLOWED_HOSTS`. Lihat :ref:`topics-testing-advanced-multiple-hosts`.
zh_hans: 运行测试时，不再禁用 :setting:`ALLOWED_HOSTS` 验证。如果您的应用程序包括具有自定义主机名的测试，您必须将这些主机名包含在 :setting:`ALLOWED_HOSTS` 中。请参阅 :ref:`topics-testing-advanced-multiple-hosts`。

source: Using a foreign key's id (e.g. ``'field_id'``) in ``ModelAdmin.list_display`` displays the related object's ID. Remove the ``_id`` suffix if you want the old behavior of the string representation of the object.
id: Menggunakan id foreign key (sebagai contoh ``'field_id'``) dalam ``ModelAdmin.list_display`` menampilan ID obyek terkait. Pindahkan akhiran ``_id`` jika anda ingin perilaku lama dari string mewakili dari obyek.
zh_hans: 在 ``ModelAdmin.list_display`` 中使用外键的 id（例如 ``'field_id'``）会显示相关对象的 ID。如果要恢复到对象的字符串表示的旧行为，请移除 ``_id`` 后缀。

source: In model forms, :class:`~django.db.models.CharField` with ``null=True`` now saves ``NULL`` for blank values instead of empty strings.
id: Dalam formulir model, :class:`~django.db.models.CharField` dengan ``null=True`` sekarang menyimpan nilai ``NULL`` daripada string kosong.
zh_hans: 在模型表单中，具有 ``null=True`` 的 :class:`~django.db.models.CharField` 现在会为空白值保存 ``NULL``，而不是空字符串。

source: On Oracle, :meth:`Model.validate_unique() <django.db.models.Model.validate_unique>` no longer checks empty strings for uniqueness as the database interprets the value as ``NULL``.
id: Pada Oracle, :meth:`Model.validate_unique() <django.db.models.Model.validate_unique>`tidak lagi memeriksa string kosong untuk keunikan sebagai penafsir basisdata nilai sebagai ``NULL``.
zh_hans: 在 Oracle 上，:meth:`Model.validate_unique() <django.db.models.Model.validate_unique>` 不再检查空字符串的唯一性，因为数据库会将该值解释为 ``NULL``。

source: If you subclass :class:`.AbstractUser` and override ``clean()``, be sure it calls ``super()``. :meth:`.BaseUserManager.normalize_email` is called in a new :meth:`.AbstractUser.clean` method so that normalization is applied in cases like model form validation.
id: Jika anda mensubkelaskan :class:`.AbstractUser` dan menimpa ``clean()``, pastikan itu memanggil ``super()``. :meth:`.BaseUserManager.normalize_email` dipanggil dalam sebuah metode :meth:`.AbstractUser.clean` baru sehingga nomarlisasi diberlakukan dalam kasus-kasus seperti pengesahan formulir model.
zh_hans: 如果您子类化了 :class:`.AbstractUser` 并覆盖了 ``clean()`` 方法，请确保它调用了 ``super()``。新的 :meth:`.AbstractUser.clean` 方法中会调用 :meth:`.BaseUserManager.normalize_email`，以便在模型表单验证等情况下应用标准化。

source: ``EmailField`` and ``URLField`` no longer accept the ``strip`` keyword argument. Remove it because it doesn't have an effect in older versions of Django as these fields always strip whitespace.
id: ``EmailField`` dan ``URLField`` tidak lagi menerima argumen katakunci ``strip``. Pindahkan itu karena itu tidak mempunyai pengaruh dalam versi terlama dari Django ketika bidang ini selalu menghilangkan ruang putih.
zh_hans: ``EmailField`` 和 ``URLField`` 不再接受 ``strip`` 关键字参数。移除它，因为在旧版本的 Django 中它没有任何效果，这些字段总是会去除空格。
