Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a regression in Django 3.1 that caused incorrect textarea layout on medium-sized screens in the admin change form view with the sidebar open (:ticket:`32127`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，该问题导致在打开侧边栏的情况下，管理的变更表单视图中的文本框布局不正确（:ticket:`32127`）。

source: Django 3.1.4 release notes
zh_hans: Django 3.1.4 版本发行说明

source: *December 1, 2020*
zh_hans: *2020 年 12 月 1 日*

source: Django 3.1.4 fixes several bugs in 3.1.3.
zh_hans: Django 3.1.4 修复了 3.1.3 中的几个漏洞。

source: Fixed setting the ``Content-Length`` HTTP header in ``AsyncRequestFactory`` (:ticket:`32162`).
zh_hans: 修正了 ``AsyncRequestFactory`` （:ticket:`32162`）中 ``Content-Length`` HTTP 头的配置。

source: Fixed passing extra HTTP headers to ``AsyncRequestFactory`` request methods (:ticket:`32159`).
zh_hans: 修正了向 ``AsyncRequestFactory`` 请求方法传递额外的 HTTP 头信息（:ticket:`32159`）。

source: Fixed crash of key transforms for :class:`~django.db.models.JSONField` on PostgreSQL when using on a ``Subquery()`` annotation (:ticket:`32182`).
zh_hans: 修正了 PostgreSQL 上的 :class:`~django.db.models.JSONField` 在 ``Subquery()`` 注解（:ticket:`32182`）上使用时，键转换的崩溃。

source: Fixed a regression in Django 3.1 that caused a crash of auto-reloader for certain invocations of ``runserver`` on Windows with Python 3.7 and below (:ticket:`32202`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，该问题导致在 Python 3.7 及以下版本的 Windows 上调用 ``runserver`` 时自动加载器崩溃（:ticket:`32202`）。

source: Fixed a regression in Django 3.1 that caused the incorrect grouping by a ``Q`` object annotation (:ticket:`32200`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，该倒退导致了 ``Q`` 对象注解的分组不正确（:ticket:`32200`）。

source: Fixed a regression in Django 3.1 that caused suppressing connection errors when :class:`~django.db.models.JSONField` is used on SQLite (:ticket:`32224`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当在 SQLite 上使用 :class:`~django.db.models.JSONField` 时，会导致抑制连接错误（:ticket:`32224`）。

source: Fixed a crash on SQLite, when ``QuerySet.values()/values_list()`` contained key transforms for :class:`~django.db.models.JSONField` returning non-string primitive values (:ticket:`32203`).
zh_hans: 修正了在 SQLite 上，当 ``QuerySet.values()/values_list()`` 包含 :class:`~django.db.models.JSONField` 的键变换返回非字符串基元值（:ticket:`32203`）时发生的崩溃。

source: Django 3.1.5 release notes
zh_hans: Django 3.1.5 版本发行说明

source: *January 4, 2021*
zh_hans: *2021 年 1 月 4 日*

source: Django 3.1.5 fixes several bugs in 3.1.4.
zh_hans: Django 3.1.5 修复了 3.1.4 中的几个漏洞。

source: Fixed ``__isnull=True`` lookup on key transforms for :class:`~django.db.models.JSONField` with Oracle and SQLite (:ticket:`32252`).
zh_hans: 修正了 :class:`~django.db.models.JSONField` 在 Oracle 和 SQLite（:ticket:`32252`）中键转换时的 ``__isnull=True`` 查找。

source: Fixed a bug in Django 3.1 that caused a crash when processing middlewares in an async context with a middleware that raises a ``MiddlewareNotUsed`` exception (:ticket:`32299`).
zh_hans: 修正了 Django 3.1 中的一个漏洞，这个漏洞导致在异步上下文中处理中间件时，中间件会引发 ``MiddlewareNotUsed`` 异常（:ticket:`32299`）。

source: Fixed a regression in Django 3.1 that caused the incorrect prefixing of ``STATIC_URL`` and ``MEDIA_URL`` settings, by the server-provided value of ``SCRIPT_NAME`` (or ``/`` if not set), when set to a URL specifying the protocol but without a top-level domain, e.g. ``http://myhost/`` (:ticket:`32304`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当配置为一个指定协议但没有顶级域名的 URL 时，例如 ``http://myhost/`` （:ticket:`32304`），服务器提供的 ``SCRIPT_NAME`` （如果没有设置，则为 ``/``）的值会导致 ``STATIC_URL`` 和 ``MEDIA_URL`` 配置的前缀不正确。

source: Django 3.1.6 release notes
zh_hans: Django 3.1.6 版本发行说明

source: Django 3.1.6 fixes a security issue with severity "low" and a bug in 3.1.5.
zh_hans: Django 3.1.6 修复了一个严重性为 “低” 的安全问题和 3.1.5 中的一个漏洞。

source: Fixed an admin layout issue in Django 3.1 where changelist filter controls would become squashed (:ticket:`32391`).
zh_hans: 修正了 Django 3.1 中的一个管理布局问题，即 changelist 过滤器控件会被压扁（:ticket:`32391`）。

source: Django 3.1.7 release notes
zh_hans: Django 3.1.7 版本发行说明

source: Django 3.1.7 fixes a security issue and a bug in 3.1.6.
zh_hans: Django 3.1.7 修复了 3.1.6 中的一个安全问题和一个漏洞。

source: Fixed a regression in Django 3.1 that caused ``RuntimeError`` instead of connection errors when using only the ``'postgres'`` database (:ticket:`32403`).
zh_hans: 修正了 Django 3.1 中的一个缺陷，当只使用 ``'postgres'`` 数据库时，会导致 ``RuntimeError`` 而不是连接错误（:ticket:`32403`）。

source: Django 3.1.8 release notes
zh_hans: Django 3.1.8 版本发行说明

source: Django 3.1.8 fixes a security issue with severity "low" and a bug in 3.1.7.
zh_hans: Django 3.1.8 修复了一个严重程度为 “低” 的安全问题，以及 3.1.7 中的一个漏洞。

source: Fixed a bug in Django 3.1 where the output was hidden on a test error or failure when using :option:`test --pdb` with the :option:`--buffer <test --buffer>` option (:ticket:`32560`).
zh_hans: 修正了 Django 3.1 中的一个错误，当使用 :option:`test --pdb` 和 :option:`--buffer <test --buffer>` 选项时，测试错误或失败时的输出被隐藏（:ticket:`32560`）。

source: Django 3.1.9 release notes
zh_hans: Django 3.1.9 版本发行说明

source: Django 3.1.9 fixes a security issue in 3.1.8.
zh_hans: Django 3.1.9 修复了 3.1.8 中的一个安全问题。

source: Django 3.2 release notes
zh_hans: Django 3.2 版本发行说明

source: Welcome to Django 3.2!
zh_hans: 欢迎来到 Django 3.2 版本！

source: These release notes cover the :ref:`new features <whats-new-3.2>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-3.2>` you'll want to be aware of when upgrading from Django 3.1 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-3.2>`.
zh_hans: 这些发行说明涵盖了 :ref:`新功能 <whats-new-3.2>`，以及一些 :ref:`向后不兼容的变化 <backward-incompatible-3.2>`，当你从 Django 3.1 或更早版本升级时，你需要注意。我们已经 :ref:`开始了一些功能的废弃过程 <deprecated-features-3.2>`。

source: Django 3.2 is designated as a :term:`long-term support release <Long-term support release>`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 2.2, will end in April 2022.
zh_hans: Django 3.2 被指定为 :term:`长期支持发行 <Long-term support release>`。它将在发行后至少三年内获得安全更新。对前一个 LTS，即 Django 2.2 的支持将于 2022 年 4 月结束。

source: Django 3.2 supports Python 3.6, 3.7, 3.8, 3.9, and 3.10 (as of 3.2.9). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 3.2 支持 Python 3.6、3.7、3.8、3.9 和 3.10（从 3.2.9 开始）。我们 **高度推荐** 并且只正式支持每个系列的最新版本。

source: What's new in Django 3.2
zh_hans: Django 3.2 新特性

source: Automatic :class:`~django.apps.AppConfig` discovery
zh_hans: 自动 :class:`~django.apps.AppConfig` 发现

source: Most pluggable applications define an :class:`~django.apps.AppConfig` subclass in an ``apps.py`` submodule. Many define a ``default_app_config`` variable pointing to this class in their ``__init__.py``.
zh_hans: 大多数可插拔的应用程序在 ``apps.py`` 子模块中定义一个 :class:`~django.apps.AppConfig` 子类。许多人在他们的 ``__init__.py`` 中定义了一个 ``default_app_config`` 的变量，指向这个类。

source: When the ``apps.py`` submodule exists and defines a single :class:`~django.apps.AppConfig` subclass, Django now uses that configuration automatically, so you can remove ``default_app_config``.
zh_hans: 当 ``apps.py`` 子模块存在并定义了一个 :class:`~django.apps.AppConfig` 子类时，Django 现在自动使用该配置，所以你可以删除 ``default_app_config``。

source: ``default_app_config`` made it possible to declare only the application's path in :setting:`INSTALLED_APPS` (e.g. ``'django.contrib.admin'``) rather than the app config's path (e.g. ``'django.contrib.admin.apps.AdminConfig'``). It was introduced for backwards-compatibility with the former style, with the intent to switch the ecosystem to the latter, but the switch didn't happen.
zh_hans: ``default_app_config`` 使得在 :setting:`INSTALLED_APPS` 中只需声明应用程序的路径（例如 ``'django.contrib.admin'``）而不是应用程序配置的路径（例如 ``'django.contrib.admin.apps.AdminConfig'``）。它的引入是为了向后兼容前者的风格，目的是将生态系统切换到后者，但这种切换并没有发生。

source: With automatic ``AppConfig`` discovery, ``default_app_config`` is no longer needed. As a consequence, it's deprecated.
zh_hans: 随着自动发现 ``AppConfig``，``default_app_config`` 不再需要了。因此，它被废弃了。

source: See :ref:`configuring-applications-ref` for full details.
zh_hans: 详见 :ref:`configuring-applications-ref`。

source: Customizing type of auto-created primary keys
zh_hans: 自定义自动创建的主键的类型

source: When defining a model, if no field in a model is defined with :attr:`primary_key=True <django.db.models.Field.primary_key>` an implicit primary key is added. The type of this implicit primary key can now be controlled via the :setting:`DEFAULT_AUTO_FIELD` setting and :attr:`AppConfig.default_auto_field <django.apps.AppConfig.default_auto_field>` attribute. No more needing to override primary keys in all models.
zh_hans: 当定义一个模型时，如果模型中没有字段被定义为 :attr:`primary_key=True <django.db.models.Field.primary_key>`，则会添加一个隐式主键。这个隐式主键的类型现在可以通过 :setting:`DEFAULT_AUTO_FIELD` 设置和 :attr:`AppConfig.default_auto_field <django.apps.AppConfig.default_auto_field>` 属性来控制。不再需要在所有模型中覆盖主键。

source: Maintaining the historical behavior, the default value for :setting:`DEFAULT_AUTO_FIELD` is :class:`~django.db.models.AutoField`. Starting with 3.2 new projects are generated with :setting:`DEFAULT_AUTO_FIELD` set to :class:`~django.db.models.BigAutoField`. Also, new apps are generated with :attr:`AppConfig.default_auto_field <django.apps.AppConfig.default_auto_field>` set to :class:`~django.db.models.BigAutoField`. In a future Django release the default value of :setting:`DEFAULT_AUTO_FIELD` will be changed to :class:`~django.db.models.BigAutoField`.
zh_hans: 保持历史行为，:setting:`DEFAULT_AUTO_FIELD` 的默认值是 :class:`~django.db.models.AutoField`。从 3.2 开始，新项目在生成时，:setting:`DEFAULT_AUTO_FIELD` 设置为 :class:`~django.db.models.BigAutoField`。另外，新的应用程序生成时，:attr:`AppConfig.default_auto_field <django.apps.AppConfig.default_auto_field>` 设置为 :class:`~django.db.models.BigAutoField`。在未来的 Django 版本中，:setting:`DEFAULT_AUTO_FIELD` 的默认值将被改为 :class:`~django.db.models.BigAutoField`。

source: To avoid unwanted migrations in the future, either explicitly set :setting:`DEFAULT_AUTO_FIELD` to :class:`~django.db.models.AutoField`::
zh_hans: 为了避免将来不需要的迁移，要么明确设置 :setting:`DEFAULT_AUTO_FIELD` 为 :class:`~django.db.models.AutoField` ：

source: or configure it on a per-app basis::
zh_hans: 或在每个应用的基础上进行配置：

source: or on a per-model basis::
zh_hans: 或在每个模型的基础上：

source: In anticipation of the changing default, a system check will provide a warning if you do not have an explicit setting for :setting:`DEFAULT_AUTO_FIELD`.
zh_hans: 由于预期默认值的变化，如果你没有明确设置 :setting:`DEFAULT_AUTO_FIELD`，系统检查将提供一个警告。

source: When changing the value of :setting:`DEFAULT_AUTO_FIELD`, migrations for the primary key of existing auto-created through tables cannot be generated currently. See the :setting:`DEFAULT_AUTO_FIELD` docs for details on migrating such tables.
zh_hans: 当改变 :setting:`DEFAULT_AUTO_FIELD` 的值时，目前不能生成现有的自动创建的表的主键的迁移。请参阅 :setting:`DEFAULT_AUTO_FIELD` 文档以了解迁移此类表的详情。

source: Functional indexes
zh_hans: 函数索引

source: The new :attr:`*expressions <django.db.models.Index.expressions>` positional argument of :class:`Index() <django.db.models.Index>` enables creating functional indexes on expressions and database functions. For example::
zh_hans: 新的 :attr:`*expressions <django.db.models.Index.expressions>` 的位置参数 :class:`Index() <django.db.models.Index>` 能够在表达式和数据库函数上创建函数索引。例如：

source: Functional indexes are added to models using the :attr:`Meta.indexes <django.db.models.Options.indexes>` option.
zh_hans: 函数索引是使用 :attr:`Meta.indexes <django.db.models.Options.indexes>` 选项添加到模型的。

source: ``pymemcache`` support
zh_hans: ``pymemcache`` 支持

source: The new ``django.core.cache.backends.memcached.PyMemcacheCache`` cache backend allows using the :pypi:`pymemcache` library for memcached. ``pymemcache`` 3.4.0 or higher is required. For more details, see the :doc:`documentation on caching in Django </topics/cache>`.
zh_hans: 新的 ``django.core.cache.backends.memcached.PyMemcacheCache`` 缓存后端允许使用 :pypi:`pymemcache` 库来操作 memcached。要求使用 ``pymemcache`` 的版本必须是 3.4.0 或更高。有关更多详细信息，请参阅 Django 缓存文档中的 :doc:`有关缓存的文档 </topics/cache>`。

source: New decorators for the admin site
zh_hans: 管理站点的新装饰器

source: The new :func:`~django.contrib.admin.display` decorator allows for easily adding options to custom display functions that can be used with :attr:`~django.contrib.admin.ModelAdmin.list_display` or :attr:`~django.contrib.admin.ModelAdmin.readonly_fields`.
zh_hans: 新的 :func:`~django.contrib.admin.display` 装饰器允许轻松地为自定义显示函数添加选项，这些函数可以与 :attr:`~django.contrib.admin.ModelAdmin.list_display` 或 :attr:`~django.contrib.admin.ModelAdmin.readonly_fields` 一起使用。

source: Likewise, the new :func:`~django.contrib.admin.action` decorator allows for easily adding options to action functions that can be used with :attr:`~django.contrib.admin.ModelAdmin.actions`.
zh_hans: 同样，新的 :func:`~django.contrib.admin.action` 装饰器允许轻松地将选项添加到可与 :attr:`~django.contrib.admin.ModelAdmin.actions` 一起使用的动作函数。

source: Using the ``@display`` decorator has the advantage that it is now possible to use the ``@property`` decorator when needing to specify attributes on the custom method. Prior to this it was necessary to use the ``property()`` function instead after assigning the required attributes to the method.
zh_hans: 使用 ``@display`` 装饰器的好处是，现在可以在需要指定自定义方法的属性时使用 ``@property`` 装饰器。在此之前，有必要在为方法指定所需的属性后使用 ``property()`` 函数来代替。

source: Using decorators has the advantage that these options are more discoverable as they can be suggested by completion utilities in code editors. They are merely a convenience and still set the same attributes on the functions under the hood.
zh_hans: 使用装饰器的好处是这些选项更容易被发现，因为它们可以被代码编辑器中的补全工具所提示。它们仅仅是一种方便，并且仍然在幕后的函数上设置相同的属性。

source: :attr:`.ModelAdmin.search_fields` now allows searching against quoted phrases with spaces.
zh_hans: :attr:`.ModelAdmin.search_fields` 现在允许针对带空格的引号短语进行搜索。

source: Read-only related fields are now rendered as navigable links if target models are registered in the admin.
zh_hans: 如果在管理中注册了目标模型，只读的相关字段现在被呈现为可浏览的链接。

source: The admin now supports theming, and includes a dark theme that is enabled according to browser settings. See :ref:`admin-theming` for more details.
zh_hans: 管理现在支持主题化，包括一个根据浏览器配置启用的暗色主题。更多细节见 :ref:`admin-theming`。

source: :attr:`.ModelAdmin.autocomplete_fields` now respects :attr:`ForeignKey.to_field <django.db.models.ForeignKey.to_field>` and :attr:`ForeignKey.limit_choices_to <django.db.models.ForeignKey.limit_choices_to>` when searching a related model.
zh_hans: :attr:`.ModelAdmin.autocomplete_fields` 现在搜索一个相关模型时尊重 :attr:`ForeignKey.to_field <django.db.models.ForeignKey.to_field>` 和 :attr:`ForeignKey.limit_choices_to <django.db.models.ForeignKey.limit_choices_to>`。

source: The admin now installs a final catch-all view that redirects unauthenticated users to the login page, regardless of whether the URL is otherwise valid. This protects against a potential model enumeration privacy issue.
zh_hans: 管理现在安装了一个全局最终回退视图，将未经认证的用户重定向到登录页面，无论该 URL 是否有效。这可以防止潜在的模型枚举隐私问题。

source: Although not recommended, you may set the new :attr:`.AdminSite.final_catch_all_view` to ``False`` to disable the catch-all view.
zh_hans: 尽管不推荐，你可以将新的 :attr:`.AdminSite.final_catch_all_view` 设置为 ``False`` 来禁用所有视图。

source: The default iteration count for the PBKDF2 password hasher is increased from 216,000 to 260,000.
zh_hans: PBKDF2 密码散列器的默认迭代次数从 216,000 次增加到 260,000 次。

source: The default variant for the Argon2 password hasher is changed to Argon2id. ``memory_cost`` and ``parallelism`` are increased to 102,400 and 8 respectively to match the ``argon2-cffi`` defaults.
zh_hans: Argon2 密码散列器的默认变量改为 Argon2id。``memory_cost`` 和 ``parallelism`` 分别增加到 102,400 和 8，以符合 ``argon2-cffi`` 的默认值。

source: Increasing the ``memory_cost`` pushes the required memory from 512 KB to 100 MB. This is still rather conservative but can lead to problems in memory constrained environments. If this is the case, the existing hasher can be subclassed to override the defaults.
zh_hans: 增加 ``memory_cost`` 将所需的内存从 512KB 推到 100MB。这仍然是相当保守的，但在内存有限的环境中可能会导致问题。如果是这种情况，可以对现有的散列器进行子类化以覆盖默认值。

source: The default salt entropy for the Argon2, MD5, PBKDF2, SHA-1 password hashers is increased from 71 to 128 bits.
zh_hans: Argon2, MD5, PBKDF2, SHA-1 密码散列器的默认盐熵从 71 位增加到 128 位。

source: The new ``absolute_max`` argument for :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` allows customizing the maximum number of forms that can be instantiated when supplying ``POST`` data. See :ref:`formsets-absolute-max` for more details.
zh_hans: :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` 的新参数 ``absolute_max`` 允许自定义提供 ``POST`` 数据时可以实例化的最大表单数量。更多细节请参见 :ref:`formsets-absolute-max`。

source: The new ``can_delete_extra`` argument for :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` allows removal of the option to delete extra forms. See :attr:`~.BaseFormSet.can_delete_extra` for more information.
zh_hans: :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` 的新参数 ``can_delete_extra`` 允许移除删除额外表单的选项。更多信息请参见 :attr:`~.BaseFormSet.can_delete_extra`。

source: The :meth:`.GDALRaster.transform` method now supports :class:`~django.contrib.gis.gdal.SpatialReference`.
zh_hans: :meth:`.GDALRaster.transform` 方法现在支持 :class:`~django.contrib.gis.gdal.SpatialReference`。

source: The :class:`~django.contrib.gis.gdal.DataSource` class now supports :class:`pathlib.Path`.
zh_hans: :class:`~django.contrib.gis.gdal.DataSource` 类现在支持 :class:`pathlib.Path`。

source: The :class:`~django.contrib.gis.utils.LayerMapping` class now supports :class:`pathlib.Path`.
zh_hans: :class:`~django.contrib.gis.utils.LayerMapping` 类现在支持 :class:`pathlib.Path`。

source: The new :attr:`.ExclusionConstraint.include` attribute allows creating covering exclusion constraints on PostgreSQL 12+.
zh_hans: 新的 :attr:`.ExclusionConstraint.include` 属性允许在 PostgreSQL 12+ 上创建覆盖排除约束。

source: The new ``ExclusionConstraint.opclasses`` attribute allows setting PostgreSQL operator classes.
zh_hans: 新的 ``ExclusionConstraint.opclasses`` 属性允许设置 PostgreSQL 操作符类。

source: The new :attr:`.JSONBAgg.ordering` attribute determines the ordering of the aggregated elements.
zh_hans: 新的 :attr:`.JSONBAgg.ordering` 属性决定了聚合元素的排序。

source: The new :attr:`.JSONBAgg.distinct` attribute determines if aggregated values will be distinct.
zh_hans: 新的 :attr:`.JSONBAgg.distinct` 属性决定了聚合的值是否会是唯一的。

source: The :class:`~django.contrib.postgres.operations.CreateExtension` operation now checks that the extension already exists in the database and skips the migration if so.
zh_hans: :class:`~django.contrib.postgres.operations.CreateExtension` 操作现在会检查数据库中是否已经存在扩展，如果存在则跳过迁移过程。

source: The new :class:`~django.contrib.postgres.operations.CreateCollation` and :class:`~django.contrib.postgres.operations.RemoveCollation` operations allow creating and dropping collations on PostgreSQL. See :ref:`manage-postgresql-collations` for more details.
zh_hans: 新的 :class:`~django.contrib.postgres.operations.CreateCollation` 和 :class:`~django.contrib.postgres.operations.RemoveCollation` 操作允许在 PostgreSQL 上创建和删除排序。参见 :ref:`manage-postgresql-collations` 获取更多细节。

source: Lookups for :class:`~django.contrib.postgres.fields.ArrayField` now allow (non-nested) arrays containing expressions as right-hand sides.
zh_hans: 对 :class:`~django.contrib.postgres.fields.ArrayField` 的查找现在允许包含表达式的（非嵌套）数组作为右侧。

source: The new :class:`OpClass() <django.contrib.postgres.indexes.OpClass>` expression allows creating functional indexes on expressions with a custom operator class. See :ref:`new_functional_indexes` for more details.
zh_hans: 新的 :class:`OpClass() <django.contrib.postgres.indexes.OpClass>` 表达式允许在具有自定义运算符类的表达式上创建函数索引。参见 :ref:`new_functional_indexes` 获取更多细节。

source: The new :class:`~django.contrib.sitemaps.Sitemap` attributes :attr:`~django.contrib.sitemaps.Sitemap.alternates`, :attr:`~django.contrib.sitemaps.Sitemap.languages` and :attr:`~django.contrib.sitemaps.Sitemap.x_default` allow generating sitemap *alternates* to localized versions of your pages.
zh_hans: 新的 :class:`~django.contrib.sitemaps.Sitemap` 属性 :attr:`~django.contrib.sitemaps.Sitemap.alternates`、:attr:`~django.contrib.sitemaps.Sitemap.languages` 和 :attr:`~django.contrib.sitemaps.Sitemap.x_default` 允许生成网站地图 *替换为* 你页面的本地化版本。

source: The new ``item_comments`` hook allows specifying a comments URL per feed item.
zh_hans: 新的 ``item_comments`` 钩子允许为每个 feed 项目指定一个评论 URL。

source: Third-party database backends can now skip or mark as expected failures tests in Django's test suite using the new ``DatabaseFeatures.django_test_skips`` and ``django_test_expected_failures`` attributes.
zh_hans: 第三方数据库后端现在可以使用新的 ``DatabaseFeatures.django_test_skips`` 和 ``django_test_expected_failures`` 属性在 Django 测试套件中跳过或标记为预期失败的测试。

source: Decorators
zh_hans: 装饰器

source: The new :func:`~django.views.decorators.common.no_append_slash` decorator allows individual views to be excluded from :setting:`APPEND_SLASH` URL normalization.
zh_hans: 新的 :func:`~django.views.decorators.common.no_append_slash` 装饰器允许个别视图从 :setting:`APPEND_SLASH` URL 规范化中排除。

source: Custom :class:`~django.views.debug.ExceptionReporter` subclasses can now define the :attr:`~django.views.debug.ExceptionReporter.html_template_path` and :attr:`~django.views.debug.ExceptionReporter.text_template_path` properties to override the templates used to render exception reports.
zh_hans: 自定义 :class:`~django.view.debug.ExceptionReporter` 子类现在可以定义 :attr:`~django.view.debug.ExceptionReporter.html_template_path` 和 :attr:`~django.view.debug.ExceptionReporter.text_template_path` 属性来重写用于渲染异常报告的模板。

source: The new :meth:`FileUploadHandler.upload_interrupted() <django.core.files.uploadhandler.FileUploadHandler.upload_interrupted>` callback allows handling interrupted uploads.
zh_hans: 新的 :meth:`FileUploadHandler.upload_interrupted() <django.core.files.uploadhandler.FileUploadHandler.upload_interrupted>` 回调允许处理中断的上传。

source: The new ``absolute_max`` argument for :func:`.formset_factory`, :func:`.inlineformset_factory`, and :func:`.modelformset_factory` allows customizing the maximum number of forms that can be instantiated when supplying ``POST`` data. See :ref:`formsets-absolute-max` for more details.
zh_hans: :func:`.formset_factory`、:func:`.inlineformset_factory` 和 :func:`.modelformset_factory` 的新 ``absolute_max`` 参数允许自定义提供 ``POST`` 数据时可实例化的最大表单数量。参见 :ref:`formsets-absolute-max` 以了解更多细节。

source: The new ``can_delete_extra`` argument for :func:`.formset_factory`, :func:`.inlineformset_factory`, and :func:`.modelformset_factory` allows removal of the option to delete extra forms. See :attr:`~.BaseFormSet.can_delete_extra` for more information.
zh_hans: :func:`.formet_factory`、:func:`.inlineformset_factory` 和 :func:`.modelformset_factory` 的新参数 ``can_delete_extra`` 允许删除额外的表单选项。更多信息请参见 :attr:`~.BaseFormSet.can_delete_extra`。

source: :class:`~django.forms.formsets.BaseFormSet` now reports a user facing error, rather than raising an exception, when the management form is missing or has been tampered with. To customize this error message, pass the ``error_messages`` argument with the key ``'missing_management_form'`` when instantiating the formset.
zh_hans: :class:`~django.forms.formsets.BaseFormSet` 现在当管理表单丢失或被篡改时，会报告一个面向用户的错误，而不是引发一个异常。要自定义这个错误信息，请在实例化表单集时，将 ``error_messages`` 参数与 ``'missing_management_form'`` 键一起传递。

source: The ``week_format`` attributes of :class:`~django.views.generic.dates.WeekMixin` and :class:`~django.views.generic.dates.WeekArchiveView` now support the ``'%V'`` ISO 8601 week format.
zh_hans: :class:`~django.views.generic.dates.WeekMixin` 和 :class:`~django.views.generic.dates.WeekArchiveView` 的 ``week_format`` 属性现在支持 ``'%V'`` ISO 8601 星期格式。

source: :djadmin:`loaddata` now supports fixtures stored in XZ archives (``.xz``) and LZMA archives (``.lzma``).
zh_hans: :djadmin:`loaddata` 现在支持存储在 XZ 档案（``.xz``）和 LZMA 档案（``.lzma``）中的固定数据。
