Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Update models and existing migrations to explicitly set the argument. Since the default is ``models.CASCADE``, add ``on_delete=models.CASCADE`` to all ``ForeignKey`` and ``OneToOneField``\s that don't use a different option. You can also pass it as the second positional argument if you don't care about compatibility with older versions of Django.
id: Model diperbaharui dan perpindahan yang ada untuk jelasnya menyetel argumen. Sejak awalan adalah ``models.CASCADE``, tambah ``on_delete=models.CASCADE`` untuk semua ``ForeignKey`` dan ``OneToOneField`` yang tidak menggunakan pilihan berbeda. Anda dapat juga melewatkannya sebagai argumen penemparan kedua jika anda tidak peduli tentang penyesuaian dengan versi terlama dari Django
zh_hans: 更新模型和现有的迁移以显式设置参数。由于默认值是 ``models.CASCADE``，因此请在所有不使用不同选项的 ``ForeignKey`` 和 ``OneToOneField`` 上添加 ``on_delete=models.CASCADE``。如果不关心与较早版本的 Django 的兼容性，也可以将其作为第二个位置参数传递。

source: ``Field.rel`` changes
id: ``Field.rel`` berubah
zh_hans: ``Field.rel`` 变更

source: ``Field.rel`` and its methods and attributes have changed to match the related fields API. The ``Field.rel`` attribute is renamed to ``remote_field`` and many of its methods and attributes are either changed or renamed.
id: ``Field.rel`` dan metode dan atributnya telah berubah untuk mencocokkan API bidang terkait. Atribut ``Field.rel`` dinamai kembali menjadi ``remote_field`` dan banyak dari metodenya dan atribut baik dirubah atau dinamai kembali.
zh_hans: ``Field.rel`` 及其方法和属性已更改以匹配相关字段的 API。``Field.rel`` 属性被重命名为 ``remote_field``，许多其方法和属性要么更改，要么重命名。

source: The aim of these changes is to provide a documented API for relation fields.
id: Tujuan dari perubahan ini adalah menyediakan sebuah dokumentasi API untuk hubungan bidang.
zh_hans: 这些更改的目的是为关系字段提供一个有文档记录的 API 。

source: ``GeoManager`` and ``GeoQuerySet`` custom methods
id: Metode penyesuaian ``GeoManager`` dan ``GeoQuerySet``
zh_hans: ``GeoManager`` 和 ``GeoQuerySet`` 的自定义方法

source: All custom ``GeoQuerySet`` methods (``area()``, ``distance()``, ``gml()``, ...) have been replaced by equivalent geographic expressions in annotations (see in new features). Hence the need to set a custom ``GeoManager`` to GIS-enabled models is now obsolete. As soon as your code doesn't call any of the deprecated methods, you can simply remove the ``objects = GeoManager()`` lines from your models.
id: Semua penyesuaian metode ``GeoQuerySet`` (``area()``, ``distance()``, ``gml()``, ...) telah diganti oleh pernyataan geografis yang setara di keterangan (lihat di fitur baru). Dengan demikian kebutuhan untuk menyetel sebuah penyesuaian ``GeoManager`` ke model diadakan-GIS sekarang usang. Segera setelah kode anda tidak memanggil setiap dari metode digusangkan, anda dapat cukup memindahkan baris ``objects = GeoManager()`` dari model anda.
zh_hans: 所有自定义的 ``GeoQuerySet`` 方法（如 ``area()``、``distance()``、``gml()`` 等）都已被等效的地理表达式注释所取代（请参见新特性）。因此，现在已经不再需要为支持 GIS 的模型设置自定义的 ``GeoManager``。一旦你的代码不再调用任何已弃用的方法，你可以简单地从模型中删除 ``objects = GeoManager()`` 行。

source: Template loader APIs have changed
id: Pemuat cetakan API telah berubah
zh_hans: 模板加载器的 API 已经改变。

source: Django template loaders have been updated to allow recursive template extending. This change necessitated a new template loader API. The old ``load_template()`` and ``load_template_sources()`` methods are now deprecated. Details about the new API can be found :ref:`in the template loader documentation <custom-template-loaders>`.
id: Pemuat cetakan Django telah diperbaharui untuk mengizinkan perpanjangan cetakan berulang. Perubahan ini mengharuskan sebuah API pemuat cetakan baru. Metode ``load_template()`` dan ``load_template_sources()`` lama sekarang diusangkan. Rincian tentang API baru dapat ditemukan :ref:`in the template loader documentation <custom-template-loaders>`.
zh_hans: Django 模板加载器已更新，允许递归模板扩展。这个变化需要一个新的模板加载器 API。旧的 ``load_template()`` 和 ``load_template_sources()`` 方法现在已被弃用。关于新 API 的详细信息可以在 :ref:`模板加载器文档中 <custom-template-loaders>` 找到。

source: Passing a 3-tuple or an ``app_name`` to ``include()``
id: Melewatkan 3-tuple atau sebuah ``app_name`` pada ``include()``
zh_hans: 将一个 3 元组或一个 ``app_name`` 传递给 ``include()``

source: The instance namespace part of passing a tuple as an argument to ``include()`` has been replaced by passing the ``namespace`` argument to ``include()``. For example::
id: Bagian namespace instance dari melewatkan sebuah tuple sebagai sebuah argumen pada ``include()`` telah diganti dengan melewatkan argumen ``namespace`` pada ``include()``. Sebagai contoh::
zh_hans: 传递元组作为参数到 ``include()`` 的实例命名空间部分已被替换为通过 ``include()`` 传递 ``namespace`` 参数。例如：

source: The ``app_name`` argument to ``include()`` has been replaced by passing a 2-tuple (as above), or passing an object or module with an ``app_name`` attribute (as below). If the ``app_name`` is set in this new way, the ``namespace`` argument is no longer required. It will default to the value of ``app_name``. For example, the URL patterns in the tutorial are changed from:
id: Argumen ``app_name`` pada ``include()`` telah diganti dengan melewatkan 2-tuple (seperti diatas), atau melewatkan sebuah obyek atau modul dengan sebuah atribut ``app_name`` (seperti dibawah). Jika ``app_name`` disetel di cara baru ini, argumen ``namespace`` tidak lagi dibutuhkan. Itu akan awalan pada nilai dari ``app_name``. Sebagai contoh, pola URL di pengajaran tambahan berubah dari:
zh_hans: ``include()`` 中的 ``app_name`` 参数已被替换为传递一个 2 元组（如上所示），或者传递一个具有 ``app_name`` 属性的对象或模块（如下所示）。如果以这种新方式设置了 ``app_name``，那么 ``namespace`` 参数将不再需要。它将默认为 ``app_name`` 的值。例如，教程中的 URL 模式已更改为：

source: to:
id: kepada:
zh_hans: 到：

source: This change also means that the old way of including an ``AdminSite`` instance is deprecated. Instead, pass ``admin.site.urls`` directly to ``django.conf.urls.url()``:
zh_hans: 这个变化还意味着旧的包含 ``AdminSite`` 实例的方式已经被弃用。相反，直接将 ``admin.site.urls`` 传递给 ``django.conf.urls.url()``：

source: URL application namespace required if setting an instance namespace
id: Namespace aplikasi URL diwajibkan jika mengatur sebuah namespace instance
zh_hans: 如果设置实例命名空间，需要提供 URL 应用程序命名空间。

source: In the past, an instance namespace without an application namespace would serve the same purpose as the application namespace, but it was impossible to reverse the patterns if there was an application namespace with the same name. Includes that specify an instance namespace require that the included URLconf sets an application namespace.
id: Di masa lalu, namespace instance tanpa sebuah namespace aplikasi akan melayani tujuan yang sama sebagai namespace aplikasi, tetapi itu tidak mungkin membalikkan pola jika ada sebuah namespace aplikasi dengan nama sama. Termasuk yang menentukan sebuah namespace instance mewajibkan itu termasuk URLconf menyetel sebuah namespace aplikasi.
zh_hans: 在过去，没有应用程序命名空间的实例命名空间会起到与应用程序命名空间相同的作用，但如果存在相同名称的应用程序命名空间，无法对模式进行反向操作。指定实例命名空间的包含（includes）要求被包含的 URLconf 设置应用程序命名空间。

source: ``current_app`` parameter to ``contrib.auth`` views
id: Parameter ``current_app`` pada tampilan ``contrib.auth``
zh_hans: ``contrib.auth`` 视图的 ``current_app`` 参数

source: All views in ``django.contrib.auth.views`` have the following structure:
zh_hans: ``django.contrib.auth.views`` 中的所有视图都具有以下结构：

source: As of Django 1.8, ``current_app`` is set on the ``request`` object. For consistency, these views will require the caller to set ``current_app`` on the ``request`` instead of passing it in a separate argument.
id: Pada Django 1.8, ``current_app`` disetel pada obyek ``request``. Untuk kemantapan, tampilan ini akan membutuhkan pemanggil untuk menyetel ``current_app`` pada ``request`` sebagai gantinya dari melewatkan itu di argumen terpisah.
zh_hans: 从 Django 1.8 开始，``current_app`` 已设置在 ``request`` 对象上。为了保持一致性，这些视图将要求调用者在 ``request`` 上设置 ``current_app``，而不是将其作为单独的参数传递。

source: The :mod:`django.contrib.gis.geoip2` module supersedes ``django.contrib.gis.geoip``. The new module provides a similar API except that it doesn't provide the legacy GeoIP-Python API compatibility methods.
id: Modul :mod:`django.contrib.gis.geoip2` menggantikan ``django.contrib.gis.geoip``. Modul baru menyediakan API mirip kecuali bahwa itu tidak menyediakan warisan metode kesesuaian API Python-GeoIP.
zh_hans: :mod:`django.contrib.gis.geoip2` 模块取代了 ``django.contrib.gis.geoip``。新模块提供了类似的 API，但不提供旧的 GeoIP-Python API 兼容方法。

source: The ``weak`` argument to ``django.dispatch.signals.Signal.disconnect()`` has been deprecated as it has no effect.
id: Argumen ``weak`` pada ``django.dispatch.signals.Signal.disconnect()`` telah diusangkan karena itu tidak mempunyai pengaruh.
zh_hans: ``django.dispatch.signals.Signal.disconnect()`` 中的 ``weak`` 参数已被弃用，因为它没有效果。

source: The ``check_aggregate_support()`` method of ``django.db.backends.base.BaseDatabaseOperations`` has been deprecated and will be removed in Django 2.0. The more general ``check_expression_support()`` should be used instead.
id: Metode ``check_aggregate_support()`` dari ``django.db.backends.base.BaseDatabaseOperations`` telah diusangkan dan akan dipindahkan di Django 2.0. ``check_expression_support()`` yang lebih umum harus digunakan sebagai gantinya.
zh_hans: ``django.db.backends.base.BaseDatabaseOperations`` 的 ``check_aggregate_support()`` 方法已被弃用，并将在 Django 2.0 中移除。应该改用更通用的 ``check_expression_support()``。

source: ``django.forms.extras`` is deprecated. You can find :class:`~django.forms.SelectDateWidget` in ``django.forms.widgets`` (or simply ``django.forms``) instead.
id: ``django.forms.extras`` diusangkan. Anda dapat menemukan :class:`~django.forms.SelectDateWidget` di ``django.forms.widgets`` (atau cukup ``django.forms``) sebagai gantinya.
zh_hans: ``django.forms.extras`` 已被弃用。你可以在 ``django.forms.widgets`` （或简单地在 ``django.forms`` 中）找到 :class:`~django.forms.SelectDateWidget`。

source: Private API ``django.db.models.fields.add_lazy_relation()`` is deprecated.
id: API pribadi ``django.db.models.fields.add_lazy_relation()`` diusangkan,
zh_hans: 私有 API ``django.db.models.fields.add_lazy_relation()`` 已被弃用。

source: The ``django.contrib.auth.tests.utils.skipIfCustomUser()`` decorator is deprecated. With the test discovery changes in Django 1.6, the tests for ``django.contrib`` apps are no longer run as part of the user's project. Therefore, the ``@skipIfCustomUser`` decorator is no longer needed to decorate tests in ``django.contrib.auth``.
id: Penghias ``django.contrib.auth.tests.utils.skipIfCustomUser()`` diusangkan. Dengan perubahan penemuan percobaan di Django 1.6, percobaan untuk aplikasi ``django.contrib`` tidak lagi berjaan sebagai bagian dari proyek pengguna. Karena itu, penghias ``@skipIfCustomUser`` tidak lagi dibutuhkan untuk menghias percobaan di ``django.contrib.auth``.
zh_hans: ``django.contrib.auth.tests.utils.skipIfCustomUser()`` 装饰器已被弃用。随着 Django 1.6 中的测试发现变化，不再将 ``django.contrib`` 应用程序的测试作为用户项目的一部分运行。因此，在 ``django.contrib.auth`` 中不再需要使用 ``@skipIfCustomUser`` 装饰器来装饰测试。

source: If you customized some :ref:`error handlers <error-views>`, the view signatures with only one request parameter are deprecated. The views should now also accept a second ``exception`` positional parameter.
id: Jika anda menyesuaikan beberapa :ref:`error handlers <error-views>`, tanda tangan tampilan dengan hanya satu parameter permintaan diusangkan. Tampilan harus sekarang juga menerima parameter penempatan ``exception`` kedua.
zh_hans: 如果你自定义了一些 :ref:`错误处理程序 <error-views>`，那些只有一个请求参数的视图签名已经被弃用。这些视图现在还应该接受一个名为 ``exception`` 的第二个位置参数。

source: The ``django.utils.feedgenerator.Atom1Feed.mime_type`` and ``django.utils.feedgenerator.RssFeed.mime_type`` attributes are deprecated in favor of ``content_type``.
id: Atribut ``django.utils.feedgenerator.Atom1Feed.mime_type`` dan ``django.utils.feedgenerator.RssFeed.mime_type`` diusangkan dalam mendukung ``content_type``.
zh_hans: ``django.utils.feedgenerator.Atom1Feed.mime_type`` 和 ``django.utils.feedgenerator.RssFeed.mime_type`` 属性已被弃用，建议使用 ``content_type`` 代替。

source: :class:`~django.core.signing.Signer` now issues a warning if an invalid separator is used. This will become an exception in Django 1.10.
id: :class:`~django.core.signing.Signer` sekarang menerbitkan sebuah peringatan jika sebuah pemisah tidak sah digunakan. Ini akan menjadi sebuah pengecualian di Django 1.10.
zh_hans: :class:`~django.core.signing.Signer` 现在如果使用无效的分隔符会发出警告。这在 Django 1.10 中将变成异常。

source: ``django.db.models.Field._get_val_from_obj()`` is deprecated in favor of ``Field.value_from_object()``.
id: ``django.db.models.Field._get_val_from_obj()`` diusangkan dalam mendukung ``Field.value_from_object()``.
zh_hans: ``django.db.models.Field._get_val_from_obj()`` 已被弃用，应使用 ``Field.value_from_object()``。

source: ``django.template.loaders.eggs.Loader`` is deprecated as distributing applications as eggs is not recommended.
id: ``django.template.loaders.eggs.Loader`` diusangkan ketika penyaluran aplikasi sebagai telur adalah tidak dianjurkan.
zh_hans: ``django.template.loaders.eggs.Loader`` 已被弃用，因为不建议将应用程序作为 eggs 分发。

source: The ``callable_obj`` keyword argument to ``SimpleTestCase.assertRaisesMessage()`` is deprecated. Pass the callable as a positional argument instead.
id: Arumen kata kunci ``callable_obj`` pada ``SimpleTestCase.assertRaisesMessage()`` diusangkan. Lewatkan dapat dipanggil sebagai argumen penempatan sebagai gantinya.
zh_hans: ``SimpleTestCase.assertRaisesMessage()`` 中的 ``callable_obj`` 关键字参数已被弃用。请将可调用对象作为位置参数传递。

source: The ``allow_tags`` attribute on methods of ``ModelAdmin`` has been deprecated. Use :func:`~django.utils.html.format_html`, :func:`~django.utils.html.format_html_join`, or :func:`~django.utils.safestring.mark_safe` when constructing the method's return value instead.
id: Atribut ``allow_tags`` di metode dari ``ModelAdmin`` telah diusangkan. Gunakan :func:`~django.utils.html.format_html`, :func:`~django.utils.html.format_html_join`, atau :func:`~django.utils.safestring.mark_safe` ketika membangun nilai kembali metode sebagai gantinya.
zh_hans: 在 ``ModelAdmin`` 方法中的 ``allow_tags`` 属性已被弃用。在构建方法的返回值时，改用 :func:`~django.utils.html.format_html`、:func:`~django.utils.html.format_html_join` 或 :func:`~django.utils.safestring.mark_safe`。

source: The ``enclosure`` keyword argument to ``SyndicationFeed.add_item()`` is deprecated. Use the new ``enclosures`` argument which accepts a list of ``Enclosure`` objects instead of a single one.
id: Argumen kata kunci ``enclosure`` pada ``SyndicationFeed.add_item()`` diusangkan. Gunakan argumen ``enclosures`` baru yang menerima sebuah daftar obyek ``Enclosure`` sebagai gantinya yang satu.
zh_hans: ``SyndicationFeed.add_item()`` 中的 ``enclosure`` 关键字参数已被弃用。改用新的 ``enclosures`` 参数，它接受一个 ``Enclosure`` 对象的列表，而不是单个对象。

source: The ``django.template.loader.LoaderOrigin`` and ``django.template.base.StringOrigin`` aliases for ``django.template.base.Origin`` are deprecated.
id: Nama lain ``django.template.loader.LoaderOrigin`` and ``django.template.base.StringOrigin`` untuk ``django.template.base.Origin`` diusangkan.
zh_hans: ``django.template.loader.LoaderOrigin`` 和 ``django.template.base.StringOrigin`` 对于 ``django.template.base.Origin`` 的别名已被弃用。

source: Features removed in 1.9
id: Fitur-fitur dipindahkan di 1.9
zh_hans: 在 1.9 版本中移除的功能。

source: These features have reached the end of their deprecation cycle and are removed in Django 1.9. See :ref:`deprecated-features-1.7` for details, including how to remove usage of these features.
id: Fitur-fitur ini telah mencapai akhir siklus pengusangan mereka dan dipindahkan di Django 1.9. Lihat :ref:`deprecated-features-1.7` untuk rincian, termasuk bagaimana memindahkan penggunaan fitur ini.
zh_hans: 这些特性已经达到了它们的弃用周期的尽头，将在 Django 1.9 中被移除。详情请参见 :ref:`deprecated-features-1.7`，包括如何删除对这些特性的使用。

source: ``django.utils.dictconfig`` is removed.
id: ``django.utils.dictconfig`` dipindahkan.
zh_hans: ``django.utils.dictconfig`` 已被移除。

source: ``django.utils.importlib`` is removed.
id: ``django.utils.importlib`` dipindahkan
zh_hans: ``django.utils.importlib`` 已被移除。

source: ``django.utils.tzinfo`` is removed.
id: ``django.utils.tzinfo`` dipindahkan.
zh_hans: ``django.utils.tzinfo`` 已被移除。

source: ``django.utils.unittest`` is removed.
id: ``django.utils.unittest`` dipindahkan.
zh_hans: ``django.utils.unittest`` 已被移除。

source: The ``syncdb`` command is removed.
id: Perintah ``syncdb`` dipindahkan.
zh_hans: ``syncdb`` 命令已被移除。

source: ``django.db.models.signals.pre_syncdb`` and ``django.db.models.signals.post_syncdb`` is removed.
id: ``django.db.models.signals.pre_syncdb`` dan ``django.db.models.signals.post_syncdb`` dipindahkan.
zh_hans: ``django.db.models.signals.pre_syncdb`` 和 ``django.db.models.signals.post_syncdb`` 已被移除。

source: Support for ``allow_syncdb`` on database routers is removed.
id: Dukungan untuk ``allow_syncdb`` pada perute basisdata dipindahkan.
zh_hans: 数据库路由器上的 ``allow_syncdb`` 支持已被移除。

source: Automatic syncing of apps without migrations is removed. Migrations are compulsory for all apps unless you pass the :option:`migrate --run-syncdb` option.
id: Menyeimbangkan otomatis dari aplikasi tanpa perpindahan adalah dipindahkan. Perpindahan adalah wajib untuk aplikasi meskipun anda melewatkan pilihan :option:`migrate --run-syncdb`.
zh_hans: 自动同步没有迁移的应用已被移除。对于所有应用程序，迁移是强制性的，除非你传递 :option:`migrate --run-syncdb` 选项。

source: The SQL management commands for apps without migrations, ``sql``, ``sqlall``, ``sqlclear``, ``sqldropindexes``, and ``sqlindexes``, are removed.
id: Perintah pengelolaan SQL untuk aplikasi tanpa perpindahan, ``sql``, ``sqlall``, ``sqlclear``, ``sqldropindexes``, dan ``sqlindexes``, dipindahkan.
zh_hans: 对于没有迁移的应用程序，已移除了 SQL 管理命令：``sql``、``sqlall``、``sqlclear``、``sqldropindexes`` 和 ``sqlindexes``。

source: Support for automatic loading of ``initial_data`` fixtures and initial SQL data is removed.
id: Dukungan untuk memuat otomatis dari alat bantu ``initial_data`` dan data SQL awal dipindahkan.
zh_hans: 已移除自动加载 ``initial_data`` fixtures 和初始 SQL 数据的支持。

source: All models need to be defined inside an installed application or declare an explicit :attr:`~django.db.models.Options.app_label`. Furthermore, it isn't possible to import them before their application is loaded. In particular, it isn't possible to import models inside the root package of an application.
id: Semua model-model butuh ditentukan dalam sebuah aplikasi terpasang atau menyatakan sebuah :attr:`~django.db.models.Options.app_label` yang jelas. Lebih lanjut, itu tidak memungkinkan mengimpor mereka sebelum aplikasi mereka dimuat. Khususnya, itu tidak memungkinkan mengimpor model-model didalam paket akar dari sebuah aplikasi.
zh_hans: 所有模型都需要在一个已安装的应用程序内定义，或者声明一个明确的 :attr:`~django.db.models.Options.app_label`。此外，在应用程序加载之前不能导入它们。特别是，在应用程序的根包内不能导入模型。

source: The model and form ``IPAddressField`` is removed. A stub field remains for compatibility with historical migrations.
id: Model dan formulir ``IPAddressField`` dipindahkan. Sebuah bidang keong tetap untuk kesesuaian dengan riwayat perpindahan.
zh_hans: 模型和表单的 ``IPAddressField`` 已被移除。为了与历史迁移兼容，仍然保留了一个存根字段。

source: ``AppCommand.handle_app()`` is no longer supported.
id: ``AppCommand.handle_app()`` tidak lagi didukung.
zh_hans: 不再支持 ``AppCommand.handle_app()``。

source: ``RequestSite`` and ``get_current_site()`` are no longer importable from ``django.contrib.sites.models``.
id: ``RequestSite`` dan ``get_current_site()`` tidak lagi dapat diimpor dari ``django.contrib.sites.models``.
zh_hans: 无法再从 ``django.contrib.sites.models`` 导入 ``RequestSite`` 和 ``get_current_site()``。

source: FastCGI support via the ``runfcgi`` management command is removed.
id: Dukungan FastCGI melalui perintah pengleolaan ``runfcgi`` dipindahkan.
zh_hans: 通过 ``runfcgi`` 管理命令的 FastCGI 支持已被移除。

source: ``django.utils.datastructures.SortedDict`` is removed.
id: ``django.utils.datastructures.SortedDict`` dipindahkan.
zh_hans: ``django.utils.datastructures.SortedDict`` 已被移除。

source: ``ModelAdmin.declared_fieldsets`` is removed.
id: ``ModelAdmin.declared_fieldsets`` dipindahkan.
zh_hans: ``ModelAdmin.declared_fieldsets`` 已被移除。

source: The ``util`` modules that provided backwards compatibility are removed:
id: Modul-modul ``util`` yang disediakan kesesuaian kebelakang dipindahkan:
zh_hans: 提供向后兼容性的 ``util`` 模块已被移除：

source: ``ModelAdmin.get_formsets`` is removed.
id: ``ModelAdmin.get_formsets`` dipindahkan.
zh_hans: ``ModelAdmin.get_formsets`` 已被移除。

source: The backward compatible shims introduced to rename the ``BaseMemcachedCache._get_memcache_timeout()`` method to ``get_backend_timeout()`` is removed.
id: Shim kesesuaian kebelakang diperkenalkan untuk menamai kembali metode ``BaseMemcachedCache._get_memcache_timeout()`` pada ``get_backend_timeout()`` akan dipindahkan.
zh_hans: 用于将 ``BaseMemcachedCache._get_memcache_timeout()`` 方法重命名为 ``get_backend_timeout()`` 的向后兼容 shims 已被移除。

source: The ``--natural`` and ``-n`` options for :djadmin:`dumpdata` are removed.
id: Pilihan-pilihan ``--natural`` dan ``-n`` untuk :djadmin:`dumpdata` dipindahkan.
zh_hans: :djadmin:`dumpdata` 的 ``--natural`` 和 ``-n`` 选项已被移除。

source: The ``use_natural_keys`` argument for ``serializers.serialize()`` is removed.
id: Argumen ``use_natural_keys`` untuk ``serializers.serialize()`` dipindahkan.
zh_hans: ``serializers.serialize()`` 的 ``use_natural_keys`` 参数已被移除。

source: Private API ``django.forms.forms.get_declared_fields()`` is removed.
id: API pribadi ``django.forms.forms.get_declared_fields()`` dipindahkan.
zh_hans: 私有 API ``django.forms.forms.get_declared_fields()`` 已被移除。

source: The ability to use a ``SplitDateTimeWidget`` with ``DateTimeField`` is removed.
id: Kemampuan menggunakan ``SplitDateTimeWidget`` dengan ``DateTimeField`` dipindahkan.
zh_hans: 使用 ``SplitDateTimeWidget`` 与 ``DateTimeField`` 的能力已被移除。

source: The ``WSGIRequest.REQUEST`` property is removed.
id: Sifat ``WSGIRequest.REQUEST`` dipindahkan.
zh_hans: ``WSGIRequest.REQUEST`` 属性已被移除。

source: The class ``django.utils.datastructures.MergeDict`` is removed.
id: Kelas ``django.utils.datastructures.MergeDict`` dipindahkan.
zh_hans: 类 ``django.utils.datastructures.MergeDict`` 已被移除。

source: The ``zh-cn`` and ``zh-tw`` language codes are removed.
id: Kode bahasa ``zh-cn`` and ``zh-tw`` telah dipindahkan.
zh_hans: ``zh-cn`` 和 ``zh-tw`` 语言代码已被移除。

source: The internal ``django.utils.functional.memoize()`` is removed.
id: Internal ``django.utils.functional.memoize()`` dipindahkan.
zh_hans: 内部的 ``django.utils.functional.memoize()`` 已被移除。

source: ``django.core.cache.get_cache`` is removed.
id: ``django.core.cache.get_cache`` dipindahkan.
zh_hans: ``django.core.cache.get_cache`` 已被移除。

source: ``django.db.models.loading`` is removed.
id: ``django.db.models.loading`` dipindahkan.
zh_hans: ``django.db.models.loading`` 已被移除。

source: Passing callable arguments to querysets is no longer possible.
id: Melewatkan argumen callable ke queryset tidak lagi memungkinkan.
zh_hans: 不再支持将可调用参数传递给查询集。

source: ``BaseCommand.requires_model_validation`` is removed in favor of ``requires_system_checks``. Admin validators is replaced by admin checks.
id: ``BaseCommand.requires_model_validation`` dipindahkan dalam mendukung ``requires_system_checks``. Pengesah admin diganti oleh pemeriksaan admin.
zh_hans: ``BaseCommand.requires_model_validation`` 被移除，取而代之的是 ``requires_system_checks``。管理器验证器被管理器检查取代。

source: The ``ModelAdmin.validator_class`` and ``default_validator_class`` attributes are removed.
id: Atribut ``ModelAdmin.validator_class`` dan ``default_validator_class`` dipindahkan.
zh_hans: ``ModelAdmin.validator_class`` 和 ``default_validator_class`` 属性已被移除。

source: ``ModelAdmin.validate()`` is removed.
id: ``ModelAdmin.validate()`` dipindahkan.
zh_hans: ``ModelAdmin.validate()`` 已被移除。
