Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Support for the pre-Django 3.1 encoding format of cookies values used by ``django.contrib.messages.storage.cookie.CookieStorage`` is removed.
zh_hans: 已移除对由 ``django.contrib.messages.storage.cookie.CookieStorage`` 使用的 Django 3.1 之前版本的 cookie 值编码格式的支持。

source: Support for the pre-Django 3.1 password reset tokens in the admin site (that use the SHA-1 hashing algorithm) is removed.
zh_hans: 移除了对使用 SHA-1 哈希算法的 Django 3.1 之前版本密码重置令牌在管理站点的支持。

source: Support for the pre-Django 3.1 encoding format of sessions is removed.
zh_hans: 移除了对使用 Django 3.1 之前编码格式的会话的支持。

source: Support for the pre-Django 3.1 ``django.core.signing.Signer`` signatures (encoded with the SHA-1 algorithm) is removed.
zh_hans: 已移除对 Django 3.1 之前版本中使用 SHA-1 算法编码的 ``django.core.signing.Signer`` 签名的支持。

source: Support for the pre-Django 3.1 ``django.core.signing.dumps()`` signatures (encoded with the SHA-1 algorithm) in ``django.core.signing.loads()`` is removed.
zh_hans: 已移除在 ``django.core.signing.loads()`` 中对 Django 3.1 之前版本中使用 SHA-1 算法编码的 ``django.core.signing.dumps()`` 签名的支持。

source: Support for the pre-Django 3.1 user sessions (that use the SHA-1 algorithm) is removed.
zh_hans: 移除了对使用 SHA-1 算法的 Django 3.1 之前用户会话的支持。

source: The ``get_response`` argument for ``django.utils.deprecation.MiddlewareMixin.__init__()`` is required and doesn't accept ``None``.
zh_hans: ``django.utils.deprecation.MiddlewareMixin.__init__()`` 的 ``get_response`` 参数是必需的，并且不接受 ``None``。

source: The ``providing_args`` argument for ``django.dispatch.Signal`` is removed.
zh_hans: ``django.dispatch.Signal`` 的 ``providing_args`` 参数已被移除。

source: The ``length`` argument for ``django.utils.crypto.get_random_string()`` is required.
zh_hans: ``django.utils.crypto.get_random_string()`` 的 ``length`` 参数是必需的。

source: The ``list`` message for ``ModelMultipleChoiceField`` is removed.
zh_hans: ``ModelMultipleChoiceField`` 的 ``list`` 消息已被移除。

source: Support for passing raw column aliases to ``QuerySet.order_by()`` is removed.
zh_hans: 不再支持将原始列别名传递给 ``QuerySet.order_by()``。

source: The ``NullBooleanField`` model field is removed, except for support in historical migrations.
zh_hans: ``NullBooleanField`` 模型字段已被移除，除了在历史迁移中的支持。

source: ``django.conf.urls.url()`` is removed.
zh_hans: ``django.conf.urls.url()`` 已被移除。

source: The ``django.contrib.postgres.fields.JSONField`` model field is removed, except for support in historical migrations.
zh_hans: ``django.contrib.postgres.fields.JSONField`` 模型字段已被移除，除了在历史迁移中的支持。

source: ``django.contrib.postgres.fields.jsonb.KeyTransform`` and ``django.contrib.postgres.fields.jsonb.KeyTextTransform`` are removed.
zh_hans: ``django.contrib.postgres.fields.jsonb.KeyTransform`` 和 ``django.contrib.postgres.fields.jsonb.KeyTextTransform`` 已被移除。

source: ``django.contrib.postgres.forms.JSONField`` is removed.
zh_hans: ``django.contrib.postgres.forms.JSONField`` 已被移除。

source: The ``{% ifequal %}`` and ``{% ifnotequal %}`` template tags are removed.
zh_hans: ``{% ifequal %}`` 和 ``{% ifnotequal %}`` 模板标签已被移除。

source: The ``DEFAULT_HASHING_ALGORITHM`` transitional setting is removed.
zh_hans: ``DEFAULT_HASHING_ALGORITHM`` 过渡设置已被移除。

source: Django 4.0.1 release notes
zh_hans: Django 4.0.1 版本发行说明

source: Django 4.0.1 fixes one security issue with severity "medium", two security issues with severity "low", and several bugs in 4.0.
zh_hans: Django 4.0.1 修复了一个"中等"严重性的安全问题，两个"低"严重性的安全问题，以及 4.0 版本中的几个错误。

source: Fixed a regression in Django 4.0 that caused a crash of ``assertFormsetError()`` on a formset named ``form`` (:ticket:`33346`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在名为 ``form`` 的表单集上调用 ``assertFormsetError()`` 时崩溃（:ticket:`33346`）。

source: Fixed a bug in Django 4.0 that caused a crash on booleans with the ``RedisCache`` backend (:ticket:`33361`).
zh_hans: 修复了 Django 4.0 中的一个错误，该错误导致在使用 ``RedisCache`` 后端时布尔值引发崩溃（:ticket:`33361`）。

source: Relaxed the check added in Django 4.0 to reallow use of a duck-typed ``HttpRequest`` in ``django.views.decorators.cache.cache_control()`` and ``never_cache()`` decorators (:ticket:`33350`).
zh_hans: 在 Django 4.0 中放宽了对于在 ``django.views.decorators.cache.cache_control()`` 和 ``never_cache()`` 装饰器中使用鸭子类型的 ``HttpRequest`` 的检查，以重新允许这种用法（:ticket:`33350`）。

source: Fixed a regression in Django 4.0 that caused creating bogus migrations for models that reference swappable models such as ``auth.User`` (:ticket:`33366`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致创建引用可交换模型（如 ``auth.User`` ）的模型的虚假迁移（:ticket:`33366`）。

source: Fixed a long standing bug in :ref:`geos-geometry-collections` and :class:`~django.contrib.gis.geos.Polygon` that caused a crash on some platforms (reported on macOS based on the ``ARM64`` architecture) (:ticket:`32600`).
zh_hans: 修复了 :ref:`geos-geometry-collections` 和 :class:`~django.contrib.gis.geos.Polygon` 中的一个长期存在的 bug，该 bug 导致在某些平台上崩溃（在 macOS 上基于 ``ARM64`` 架构的报告）（:ticket:`32600`）。

source: Django 4.0.10 release notes
zh_hans: Django 4.0.10 版本发行说明

source: Django 4.0.10 fixes a security issue with severity "moderate" in 4.0.9.
zh_hans: Django 4.0.10 修复了 4.0.9 版本中一个"中等"严重性的安全问题。

source: Django 4.0.2 release notes
zh_hans: Django 4.0.2 版本发行说明

source: Django 4.0.2 fixes two security issues with severity "medium" and several bugs in 4.0.1. Also, the latest string translations from Transifex are incorporated, with a special mention for Bulgarian (fully translated).
zh_hans: Django 4.0.2 修复了两个"中等"严重性的安全问题，以及 4.0.1 版本中的几个错误。此外，最新的 Transifex 字符串翻译已经整合，特别提及保加利亚语（完全翻译）。

source: Fixed a bug in Django 4.0 where ``TestCase.captureOnCommitCallbacks()`` could execute callbacks multiple times (:ticket:`33410`).
zh_hans: 修复了 Django 4.0 中的一个 bug，该 bug 导致 ``TestCase.captureOnCommitCallbacks()`` 可能会多次执行回调函数（:ticket:`33410`）。

source: Fixed a regression in Django 4.0 where ``help_text`` was HTML-escaped in automatically-generated forms (:ticket:`33419`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在自动生成的表单中对 ``help_text`` 进行 HTML 转义（:ticket:`33419`）。

source: Fixed a regression in Django 4.0 that caused displaying an incorrect name for class-based views on the technical 404 debug page (:ticket:`33425`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在技术性 404 调试页面上显示类基视图的不正确名称（:ticket:`33425`）。

source: Fixed a regression in Django 4.0 that caused an incorrect ``repr`` of ``ResolverMatch`` for class-based views (:ticket:`33426`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致类基视图的 ``ResolverMatch`` 的 ``repr`` 不正确（:ticket:`33426`）。

source: Fixed a regression in Django 4.0 that caused a crash of ``makemigrations`` on models without ``Meta.order_with_respect_to`` but with a field named ``_order`` (:ticket:`33449`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在没有 ``Meta.order_with_respect_to`` 但具有名为 ``_order`` 的字段的模型上运行 ``makemigrations`` 时崩溃（:ticket:`33449`）。

source: Fixed a regression in Django 4.0 that caused incorrect :attr:`.ModelAdmin.radio_fields` layout in the admin (:ticket:`33407`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致管理员中 :attr:`.ModelAdmin.radio_fields` 布局不正确（:ticket:`33407`）。

source: Fixed a duplicate operation regression in Django 4.0 that caused a migration crash when altering a primary key type for a concrete parent model referenced by a foreign key (:ticket:`33462`).
zh_hans: 修复了 Django 4.0 中的一个重复操作回归问题，该问题导致在更改外键引用的具体父模型的主键类型时，迁移崩溃（:ticket:`33462`）。

source: Fixed a bug in Django 4.0 that caused a crash of ``QuerySet.aggregate()`` after ``annotate()`` on an aggregate function with a :ref:`default <aggregate-default>` (:ticket:`33468`).
zh_hans: 修复了 Django 4.0 中的一个 bug，该 bug 导致在对带有 :ref:`default <aggregate-default>` 的聚合函数进行 ``annotate()`` 后调用 ``QuerySet.aggregate()`` 时崩溃（:ticket:`33468`）。

source: Fixed a regression in Django 4.0 that caused a crash of ``makemigrations`` when renaming a field of a renamed model (:ticket:`33480`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在重命名模型的字段时运行 ``makemigrations`` 时崩溃（:ticket:`33480`）。

source: Django 4.0.3 release notes
zh_hans: Django 4.0.3 版本发行说明

source: *March 1, 2022*
zh_hans: *2022 年 3 月 1 日*

source: Django 4.0.3 fixes several bugs in 4.0.2. Also, all Python code in Django is reformatted with :pypi:`black`.
zh_hans: Django 4.0.3 修复了 4.0.2 中的一些 bug。此外，Django 中的所有 Python 代码都使用 :pypi:`black` 进行了重新格式化。

source: Prevented, following a regression in Django 4.0.1, :djadmin:`makemigrations` from generating infinite migrations for a model with ``ManyToManyField`` to a lowercased swappable model such as ``'auth.user'`` (:ticket:`33515`).
zh_hans: 在 Django 4.0.1 中修复了一个回归问题，防止 :djadmin:`makemigrations` 为具有到小写的可交换模型（如 ``'auth.user'``）的 ``ManyToManyField`` 的模型生成无限迁移（:ticket:`33515`）。

source: Fixed a regression in Django 4.0 that caused a crash when rendering invalid inlines with :attr:`~django.contrib.admin.ModelAdmin.readonly_fields` in the admin (:ticket:`33547`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致在管理员中使用 :attr:`~django.contrib.admin.ModelAdmin.readonly_fields` 渲染无效的内联时崩溃（:ticket:`33547`）。

source: Django 4.0.4 release notes
zh_hans: Django 4.0.4 版本发行说明

source: Django 4.0.4 fixes two security issues with severity "high" and two bugs in 4.0.3.
zh_hans: Django 4.0.4 修复了两个严重程度为 "高" 的安全问题和两个 4.0.3 版本中的错误。

source: Fixed a regression in Django 4.0 that caused ignoring multiple ``FilteredRelation()`` relationships to the same field (:ticket:`33598`).
zh_hans: 修复了 Django 4.0 中的一个回归问题，该问题导致忽略多个到同一字段的 ``FilteredRelation()`` 关系（:ticket:`33598`）。

source: Django 4.0.5 release notes
zh_hans: Django 4.0.5 版本发行说明

source: *June 1, 2022*
zh_hans: *2022 年 6 月 1 日*

source: Django 4.0.5 fixes several bugs in 4.0.4.
zh_hans: Django 4.0.5 修复了 4.0.4 版本中的一些错误。

source: Fixed a bug in Django 4.0 where not all :setting:`OPTIONS <CACHES-OPTIONS>` were passed to a Redis client (:ticket:`33681`).
zh_hans: 修复了 Django 4.0 中的一个 bug，该 bug 导致未将所有 :setting:`OPTIONS <CACHES-OPTIONS>` 传递给 Redis 客户端（:ticket:`33681`）。

source: Fixed a bug in Django 4.0 that caused a crash of ``QuerySet.filter()`` on ``IsNull()`` expressions (:ticket:`33705`).
zh_hans: 修复了 Django 4.0 中的一个 bug，该 bug 导致在 ``IsNull()`` 表达式上调用 ``QuerySet.filter()`` 时崩溃（:ticket:`33705`）。

source: Fixed a bug in Django 4.0 where a hidden quick filter toolbar in the admin's navigation sidebar was focusable (:ticket:`33725`).
zh_hans: 修复了 Django 4.0 中的一个 bug，该 bug 导致管理员导航边栏中的隐藏快速过滤工具栏是可聚焦的（:ticket:`33725`）。

source: Django 4.0.6 release notes
zh_hans: Django 4.0.6 版本发行说明

source: Django 4.0.6 fixes a security issue with severity "high" in 4.0.5.
zh_hans: Django 4.0.6 修复了 4.0.5 版本中的一个严重安全问题。

source: Django 4.0.7 release notes
zh_hans: Django 4.0.7 版本发行说明

source: Django 4.0.7 fixes a security issue with severity "high" in 4.0.6.
zh_hans: Django 4.0.7 修复了在 4.0.6 版本中的一个严重安全问题。

source: Django 4.0.8 release notes
zh_hans: Django 4.0.8 版本发行说明

source: Django 4.0.8 fixes a security issue with severity "medium" in 4.0.7.
zh_hans: Django 4.0.8 修复了 4.0.7 版本中一个严重程度为"中等"的安全问题。

source: Django 4.0.9 release notes
zh_hans: Django 4.0.9 版本发行说明

source: Django 4.0.9 fixes a security issue with severity "moderate" in 4.0.8.
zh_hans: Django 4.0.9 修复了 4.0.8 版本中一个"中等"严重性的安全问题。

source: Django 4.1 release notes
zh_hans: Django 4.1 版本发行说明

source: Welcome to Django 4.1!
zh_hans: 欢迎使用 Django 4.1！

source: These release notes cover the :ref:`new features <whats-new-4.1>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-4.1>` you'll want to be aware of when upgrading from Django 4.0 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-4.1>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-4.1>`，以及从 Django 4.0 或更早版本升级时需要注意的一些 :ref:`不兼容变更 <backwards-incompatible-4.1>`。我们已经 :ref:`开始了某些功能的弃用过程 <deprecated-features-4.1>`。

source: Django 4.1 supports Python 3.8, 3.9, 3.10, and 3.11 (as of 4.1.3). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 4.1 支持 Python 3.8、3.9、3.10 和 3.11（从 4.1.3 开始）。我们 **强烈建议** 并且只官方支持每个系列的最新发布版本。

source: What's new in Django 4.1
zh_hans: Django 4.1 新特性

source: Asynchronous handlers for class-based views
zh_hans: 基于类的视图的异步处理程序。

source: View subclasses may now define async HTTP method handlers::
zh_hans: 现在，视图的子类可以定义异步的 HTTP 方法处理程序：

source: See :ref:`async-class-based-views` for more details.
zh_hans: 请参阅 :ref:`async-class-based-views` 以获取更多详细信息。

source: Asynchronous ORM interface
zh_hans: 异步的 ORM 接口。

source: ``QuerySet`` now provides an asynchronous interface for all data access operations. These are named as-per the existing synchronous operations but with an ``a`` prefix, for example ``acreate()``, ``aget()``, and so on.
zh_hans: ``QuerySet`` 现在为所有数据访问操作提供了异步接口。这些接口的命名方式与现有的同步操作相同，但带有一个 ``a`` 前缀，例如 ``acreate()``、``aget()`` 等等。

source: The new interface allows you to write asynchronous code without needing to wrap ORM operations in ``sync_to_async()``::
zh_hans: 新的接口允许您编写异步代码，而无需将 ORM 操作包装在 ``sync_to_async()`` 中：

source: Note that, at this stage, the underlying database operations remain synchronous, with contributions ongoing to push asynchronous support down into the SQL compiler, and integrate asynchronous database drivers. The new asynchronous queryset interface currently encapsulates the necessary ``sync_to_async()`` operations for you, and will allow your code to take advantage of developments in the ORM's asynchronous support as it evolves.
zh_hans: 值得注意的是，目前数据库操作仍然是同步的，但正在进行贡献工作，以将异步支持推向 SQL 编译器并集成异步数据库驱动程序。新的异步查询集接口目前为您封装了必要的 ``sync_to_async()`` 操作，将允许您的代码充分利用 ORM 异步支持的发展。

source: See :ref:`async-queries` for details and limitations.
zh_hans: 请参阅 :ref:`async-queries` 以获取详细信息和限制。

source: Validation of Constraints
zh_hans: 约束的验证

source: :class:`Check <django.db.models.CheckConstraint>`, :class:`unique <django.db.models.UniqueConstraint>`, and :class:`exclusion <django.contrib.postgres.constraints.ExclusionConstraint>` constraints defined in the :attr:`Meta.constraints <django.db.models.Options.constraints>` option are now checked during :ref:`model validation <validating-objects>`.
zh_hans: 在 :attr:`Meta.constraints <django.db.models.Options.constraints>` 选项中定义的 :class:`Check <django.db.models.CheckConstraint>`、:class:`unique <django.db.models.UniqueConstraint>` 和 :class:`exclusion <django.contrib.postgres.constraints.ExclusionConstraint>` 约束现在在 :ref:`模型验证 <validating-objects>` 期间进行检查。

source: Form rendering accessibility
zh_hans: 表单渲染的可访问性

source: In order to aid users with screen readers, and other assistive technology, new ``<div>`` based form templates are available from this release. These provide more accessible navigation than the older templates, and are able to correctly group related controls, such as radio-lists, into fieldsets.
zh_hans: 为了帮助使用屏幕阅读器和其他辅助技术的用户，从这个版本开始提供了基于 ``<div>`` 的新表单模板。这些模板提供比旧模板更可访问的导航，并能够正确地将相关控件（如单选列表）分组到字段集中。

source: The new templates are recommended, and will become the default form rendering style when outputting a form, like ``{{ form }}`` in a template, from Django 5.0.
zh_hans: 推荐使用新模板，并且在 Django 5.0 中，当在模板中输出表单时（如 ``{{ form }}``），新模板将成为默认的表单呈现样式。

source: In order to ease adopting the new output style, the default form and formset templates are now configurable at the project level via the :setting:`FORM_RENDERER` setting.
zh_hans: 为了方便采用新的输出样式，现在可以通过项目级别的 :setting:`FORM_RENDERER` 设置来配置默认的表单和表单集模板。

source: See :ref:`the Forms section (below)<forms-4.1>` for full details.
zh_hans: 请查看 :ref:`下面的表单部分 <forms-4.1>` 以获取完整的详细信息。

source: ``CSRF_COOKIE_MASKED`` setting
zh_hans: ``CSRF_COOKIE_MASKED`` 设置

source: The new ``CSRF_COOKIE_MASKED`` transitional setting allows specifying whether to mask the CSRF cookie.
zh_hans: 新的 ``CSRF_COOKIE_MASKED`` 过渡性设置允许指定是否要对 CSRF cookie 进行掩码处理。

source: :class:`~django.middleware.csrf.CsrfViewMiddleware` no longer masks the CSRF cookie like it does the CSRF token in the DOM. If you are upgrading multiple instances of the same project to Django 4.1, you should set ``CSRF_COOKIE_MASKED`` to ``True`` during the transition, in order to allow compatibility with the older versions of Django. Once the transition to 4.1 is complete you can stop overriding ``CSRF_COOKIE_MASKED``.
zh_hans: :class:`~django.middleware.csrf.CsrfViewMiddleware` 不再像它在 DOM 中处理 CSRF 令牌一样对 CSRF cookie 进行掩码处理。如果你正在将同一项目的多个实例升级到 Django 4.1，你应该在过渡期间将 ``CSRF_COOKIE_MASKED`` 设置为 ``True``，以便与旧版本的 Django 兼容。一旦升级到 4.1 完成，你可以停止覆盖 ``CSRF_COOKIE_MASKED``。

source: This setting is deprecated as of this release and will be removed in Django 5.0.
zh_hans: 该设置在此版本中已被弃用，并将在 Django 5.0 中移除。

source: The admin :ref:`dark mode CSS variables <admin-theming>` are now applied in a separate stylesheet and template block.
zh_hans: 管理员 :ref:`深色模式 CSS 变量 <admin-theming>` 现在应用在一个单独的样式表和模板块中。

source: :ref:`modeladmin-list-filters` providing custom ``FieldListFilter`` subclasses can now control the query string value separator when filtering for multiple values using the ``__in`` lookup.
zh_hans: 提供自定义 ``FieldListFilter`` 子类的 :ref:`modeladmin-list-filters` 现在可以在使用 ``__in`` 查询时控制查询字符串值的分隔符，用于多个值的过滤。

source: The admin :meth:`history view <django.contrib.admin.ModelAdmin.history_view>` is now paginated.
zh_hans: 管理员的 :meth:`history view <django.contrib.admin.ModelAdmin.history_view>` 现在支持分页。

source: Related widget wrappers now have a link to object's change form.
zh_hans: 相关的小部件包装现在有一个指向对象修改表单的链接。

source: The :meth:`.AdminSite.get_app_list` method now allows changing the order of apps and models on the admin index page.
zh_hans: :meth:`.AdminSite.get_app_list` 方法现在允许更改管理员首页上应用程序和模型的顺序。

source: The default iteration count for the PBKDF2 password hasher is increased from 320,000 to 390,000.
zh_hans: PBKDF2 密码哈希器的默认迭代次数从 320 , 000 增加到 390 , 000 。

source: The :meth:`.RemoteUserBackend.configure_user` method now allows synchronizing user attributes with attributes in a remote system such as an LDAP directory.
zh_hans: :meth:`.RemoteUserBackend.configure_user` 方法现在允许将用户属性与远程系统（如 LDAP 目录）中的属性同步。

source: The new :meth:`.GEOSGeometry.make_valid()` method allows converting invalid geometries to valid ones.
zh_hans: 新的 :meth:`.GEOSGeometry.make_valid()` 方法允许将无效的几何图形转换为有效的几何图形。

source: The new ``clone`` argument for :meth:`.GEOSGeometry.normalize` allows creating a normalized clone of the geometry.
zh_hans: :meth:`.GEOSGeometry.normalize` 的新参数 ``clone`` 允许创建几何图形的归一化克隆。

source: The new :class:`BitXor() <django.contrib.postgres.aggregates.BitXor>` aggregate function returns an ``int`` of the bitwise ``XOR`` of all non-null input values.
zh_hans: 新的 :class:`BitXor() <django.contrib.postgres.aggregates.BitXor>` 聚合函数返回所有非空输入值的按位 ``XOR`` 的 ``int`` 值。

source: :class:`~django.contrib.postgres.indexes.SpGistIndex` now supports covering indexes on PostgreSQL 14+.
zh_hans: :class:`~django.contrib.postgres.indexes.SpGistIndex` 现在在 PostgreSQL 14+ 上支持覆盖索引。

source: :class:`~django.contrib.postgres.constraints.ExclusionConstraint` now supports covering exclusion constraints using SP-GiST indexes on PostgreSQL 14+.
zh_hans: :class:`~django.contrib.postgres.constraints.ExclusionConstraint` 现在在 PostgreSQL 14+ 上支持使用 SP-GiST 索引的覆盖排除约束。

source: The new ``default_bounds`` attribute of :attr:`DateTimeRangeField <django.contrib.postgres.fields.DateTimeRangeField.default_bounds>` and :attr:`DecimalRangeField <django.contrib.postgres.fields.DecimalRangeField.default_bounds>` allows specifying bounds for list and tuple inputs.
zh_hans: 新的 :attr:`DateTimeRangeField <django.contrib.postgres.fields.DateTimeRangeField.default_bounds>` 和 :attr:`DecimalRangeField <django.contrib.postgres.fields.DecimalRangeField.default_bounds>` 的 ``default_bounds`` 属性允许为列表和元组输入指定边界。

source: :class:`~django.contrib.postgres.constraints.ExclusionConstraint` now allows specifying operator classes with the :class:`OpClass() <django.contrib.postgres.indexes.OpClass>` expression.
zh_hans: :class:`~django.contrib.postgres.constraints.ExclusionConstraint` 现在允许使用 :class:`OpClass() <django.contrib.postgres.indexes.OpClass>` 表达式指定操作符类。

source: The default sitemap index template ``<sitemapindex>`` now includes the ``<lastmod>`` timestamp where available, through the new :meth:`~django.contrib.sitemaps.Sitemap.get_latest_lastmod` method. Custom sitemap index templates should be updated for the adjusted :ref:`context variables <sitemap-index-context-variables>`.
zh_hans: 默认的站点地图索引模板 ``<sitemapindex>`` 现在在可用时包括 ``<lastmod>`` 时间戳，通过新的 :meth:`~django.contrib.sitemaps.Sitemap.get_latest_lastmod` 方法。自定义站点地图索引模板应该根据调整后的 :ref:`上下文变量 <sitemap-index-context-variables>` 进行更新。

source: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` now replaces paths to CSS source map references with their hashed counterparts.
zh_hans: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 现在会将 CSS 源映射引用的路径替换为它们的哈希版本。

source: Third-party database backends can now specify the minimum required version of the database using the ``DatabaseFeatures.minimum_database_version`` attribute which is a tuple (e.g. ``(10, 0)`` means "10.0"). If a minimum version is specified, backends must also implement ``DatabaseWrapper.get_database_version()``, which returns a tuple of the current database version. The backend's ``DatabaseWrapper.init_connection_state()`` method must call ``super()`` in order for the check to run.
zh_hans: 第三方数据库后端现在可以使用 ``DatabaseFeatures.minimum_database_version`` 属性指定数据库的最低要求版本，它是一个元组（例如 ``(10, 0)`` 表示 "10.0"）。如果指定了最低版本，后端还必须实现 ``DatabaseWrapper.get_database_version()``，该方法返回当前数据库版本的元组。后端的 ``DatabaseWrapper.init_connection_state()`` 方法必须调用 ``super()`` 以便进行版本检查。

source: The default template used to render forms when cast to a string, e.g. in templates as ``{{ form }}``, is now configurable at the project-level by setting :attr:`~django.forms.renderers.BaseRenderer.form_template_name` on the class provided for :setting:`FORM_RENDERER`.
zh_hans: 渲染表单时默认使用的模板，例如在模板中作为 ``{{ form }}`` 显示，现在可以在项目级别通过在提供给 :setting:`FORM_RENDERER` 的类上设置 :attr:`~django.forms.renderers.BaseRenderer.form_template_name` 来配置。

source: :attr:`.Form.template_name` is now a property deferring to the renderer, but may be overridden with a string value to specify the template name per-form class.
zh_hans: :attr:`.Form.template_name` 现在是一个属性，延迟到渲染器，但可以用一个字符串值覆盖，以指定每个表单类的模板名称。

source: Similarly, the default template used to render formsets can be specified via the matching :attr:`~django.forms.renderers.BaseRenderer.formset_template_name` renderer attribute.
zh_hans: 同样，可以通过匹配的 :attr:`~django.forms.renderers.BaseRenderer.formset_template_name` 渲染器属性来指定用于渲染表单集的默认模板。

source: The new ``div.html`` form template, referencing :attr:`.Form.template_name_div` attribute, and matching :meth:`.Form.as_div` method, render forms using HTML ``<div>`` elements.
zh_hans: 新的 ``div.html`` 表单模板引用了 :attr:`.Form.template_name_div` 属性，并与 :meth:`.Form.as_div` 方法匹配，使用 HTML ``<div>`` 元素来渲染表单。

source: This new output style is recommended over the existing :meth:`~.Form.as_table`, :meth:`~.Form.as_p` and :meth:`~.Form.as_ul` styles, as the template implements ``<fieldset>`` and ``<legend>`` to group related inputs and is easier for screen reader users to navigate.
zh_hans: 推荐使用这种新的输出样式，而不是现有的 :meth:`~.Form.as_table`、:meth:`~.Form.as_p` 和 :meth:`~.Form.as_ul` 样式，因为模板实现了 ``<fieldset>`` 和 ``<legend>`` 来组合相关的输入，对屏幕阅读器用户更容易导航。

source: The div-based output will become the default rendering style from Django 5.0.
zh_hans: 从 Django 5.0 开始，基于 div 的输出将成为默认的渲染样式。

source: In order to smooth adoption of the new ``<div>`` output style, two transitional form renderer classes are available: ``django.forms.renderers.DjangoDivFormRenderer`` and ``django.forms.renderers.Jinja2DivFormRenderer``, for the Django and Jinja2 template backends respectively.
zh_hans: 为了平稳过渡到新的 ``<div>`` 输出样式，提供了两个过渡性的表单渲染器类：``django.forms.renderers.DjangoDivFormRenderer`` 和 ``django.forms.renderers.Jinja2DivFormRenderer``，分别适用于 Django 和 Jinja2 模板后端。
