Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: After making this change, :djadmin:`makemigrations` will generate a new migration with two operations: ``RemoveConstraint`` and ``AddConstraint``. Since this change has no effect on the database schema, the :class:`~django.db.migrations.operations.SeparateDatabaseAndState` operation can be used to only update the migration state without running any SQL. Move the generated operations into the ``state_operations`` argument of :class:`~django.db.migrations.operations.SeparateDatabaseAndState`. For example::
zh_hans: 在进行这些更改后，:djadmin:`makemigrations` 将生成一个新的迁移，其中包含两个操作：``RemoveConstraint`` 和 ``AddConstraint``。由于这些更改不影响数据库架构，可以使用 :class:`~django.db.migrations.operations.SeparateDatabaseAndState` 操作来仅更新迁移状态而不运行任何 SQL。将生成的操作移动到 :class:`~django.db.migrations.operations.SeparateDatabaseAndState` 的 ``state_operations`` 参数中。例如：

source: The undocumented ability to pass ``errors=None`` to :meth:`.SimpleTestCase.assertFormError` and :meth:`assertFormsetError() <django.test.SimpleTestCase.assertFormSetError>` is deprecated. Use ``errors=[]`` instead.
zh_hans: 未记录的能够将 ``errors=None`` 传递给 :meth:`.SimpleTestCase.assertFormError` 和 :meth:`assertFormsetError() <django.test.SimpleTestCase.assertFormSetError>` 已被弃用。请改用 ``errors=[]``。

source: ``django.contrib.sessions.serializers.PickleSerializer`` is deprecated due to the risk of remote code execution.
zh_hans: 由于存在远程代码执行的风险，``django.contrib.sessions.serializers.PickleSerializer`` 已被弃用。

source: The usage of ``QuerySet.iterator()`` on a queryset that prefetches related objects without providing the ``chunk_size`` argument is deprecated. In older versions, no prefetching was done. Providing a value for ``chunk_size`` signifies that the additional query per chunk needed to prefetch is desired.
zh_hans: 在没有提供 ``chunk_size`` 参数的情况下，对预取相关对象的查询集使用 ``QuerySet.iterator()`` 的用法已被弃用。在旧版本中，不会进行预取。提供 ``chunk_size`` 的值表示希望每个块所需的预取额外查询。

source: Passing unsaved model instances to related filters is deprecated. In Django 5.0, the exception will be raised.
zh_hans: 将未保存的模型实例传递给相关的过滤器已被弃用。在 Django 5.0 中，将引发异常。

source: ``created=True`` is added to the signature of :meth:`.RemoteUserBackend.configure_user`. Support for ``RemoteUserBackend`` subclasses that do not accept this argument is deprecated.
zh_hans: :meth:`.RemoteUserBackend.configure_user` 的签名中添加了 ``created=True``。不接受此参数的 ``RemoteUserBackend`` 子类的支持已被弃用。

source: The ``django.utils.timezone.utc`` alias to :attr:`datetime.timezone.utc` is deprecated. Use :attr:`datetime.timezone.utc` directly.
zh_hans: 别名 ``django.utils.timezone.utc`` 到 :attr:`datetime.timezone.utc` 的使用已经被弃用。请直接使用 :attr:`datetime.timezone.utc`。

source: Passing a response object and a form/formset name to ``SimpleTestCase.assertFormError()`` and ``assertFormsetError()`` is deprecated. Use::
zh_hans: 在 ``SimpleTestCase.assertFormError()`` 和 ``assertFormsetError()`` 中传递响应对象和表单/表单集名称已被弃用。请使用以下方式：

source: or pass the form/formset object directly instead.
zh_hans: 或者直接传递表单/表单集对象。

source: The undocumented ``django.contrib.gis.admin.OpenLayersWidget`` is deprecated.
zh_hans: 未记录的 ``django.contrib.gis.admin.OpenLayersWidget`` 模块已被弃用。

source: ``django.contrib.auth.hashers.CryptPasswordHasher`` is deprecated.
zh_hans: ``django.contrib.auth.hashers.CryptPasswordHasher`` 已废弃。

source: The ability to pass ``nulls_first=False`` or ``nulls_last=False`` to ``Expression.asc()`` and ``Expression.desc()`` methods, and the ``OrderBy`` expression is deprecated. Use ``None`` instead.
zh_hans: 在 ``Expression.asc()`` 和 ``Expression.desc()`` 方法以及 ``OrderBy`` 表达式中传递 ``nulls_first=False`` 或 ``nulls_last=False`` 的能力已被弃用。请改用 ``None``。

source: The ``"django/forms/default.html"`` and ``"django/forms/formsets/default.html"`` templates which are a proxy to the table-based templates are deprecated. Use the specific template instead.
zh_hans: ``"django/forms/default.html"`` 和 ``"django/forms/formsets/default.html"`` 模板，它们是表格模板的代理，已被弃用。请使用具体的模板。

source: The undocumented ``LogoutView.get_next_page()`` method is renamed to ``get_success_url()``.
zh_hans: 未记录的 ``LogoutView.get_next_page()`` 方法已被重命名为 ``get_success_url()``。

source: Features removed in 4.1
zh_hans: 在 4.1 版本中移除的功能

source: These features have reached the end of their deprecation cycle and are removed in Django 4.1.
zh_hans: 这些功能已经结束了其弃用周期，并在 Django 4.1 中被移除。

source: See :ref:`deprecated-features-3.2` for details on these changes, including how to remove usage of these features.
zh_hans: 有关这些更改的详细信息，包括如何删除对这些功能的使用，请参阅 :ref:`deprecated-features-3.2`。

source: Support for assigning objects which don't support creating deep copies with ``copy.deepcopy()`` to class attributes in ``TestCase.setUpTestData()`` is removed.
zh_hans: 不再支持将不支持使用 ``copy.deepcopy()`` 创建深层副本的对象分配给 ``TestCase.setUpTestData()`` 中的类属性。

source: Support for using a boolean value in :attr:`.BaseCommand.requires_system_checks` is removed.
zh_hans: 不再支持在 :attr:`.BaseCommand.requires_system_checks` 中使用布尔值。

source: The ``whitelist`` argument and ``domain_whitelist`` attribute of ``django.core.validators.EmailValidator`` are removed.
zh_hans: ``django.core.validators.EmailValidator`` 的 ``whitelist`` 参数和 ``domain_whitelist`` 属性已被移除。

source: The ``default_app_config`` application configuration variable is removed.
zh_hans: ``default_app_config`` 应用程序配置变量已被移除。

source: ``TransactionTestCase.assertQuerysetEqual()`` no longer calls ``repr()`` on a queryset when compared to string values.
zh_hans: ``TransactionTestCase.assertQuerysetEqual()`` 在与字符串值进行比较时不再调用 ``repr()`` 方法来处理查询集。

source: The ``django.core.cache.backends.memcached.MemcachedCache`` backend is removed.
zh_hans: ``django.core.cache.backends.memcached.MemcachedCache`` 已被移除。

source: Support for the pre-Django 3.2 format of messages used by ``django.contrib.messages.storage.cookie.CookieStorage`` is removed.
zh_hans: 对 ``django.contrib.messages.storage.cookie.CookieStorage`` 使用的 Django 3.2 之前的消息格式的支持已被移除。

source: Django 4.1.1 release notes
zh_hans: Django 4.1.1 版本发行说明

source: *September 5, 2022*
zh_hans: *2022 年 9 月 5 日*

source: Django 4.1.1 fixes several bugs in 4.1.
zh_hans: Django 4.1.1 修复了 4.1 版本中的一些错误。

source: Reallowed, following a regression in Django 4.1, using ``GeoIP2()`` when GEOS is not installed (:ticket:`33886`).
zh_hans: 在 Django 4.1 中，已经重新允许在未安装 GEOS 的情况下使用 ``GeoIP2()`` （:ticket:`33886`）。

source: Fixed a regression in Django 4.1 that caused a crash of admin's autocomplete widgets when translations are deactivated (:ticket:`33888`).
zh_hans: 在 Django 4.1 中修复了一个问题，当禁用翻译时，导致管理员自动完成小部件崩溃的回归问题（:ticket:`33888`）。

source: Fixed a regression in Django 4.1 that caused a crash of the ``test`` management command when running in parallel and ``multiprocessing`` start method is ``spawn`` (:ticket:`33891`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在并行运行并且 ``multiprocessing`` 启动方法为 ``spawn`` 时，``test`` 管理命令崩溃的回归问题（:ticket:`33891`）。

source: Fixed a regression in Django 4.1 that caused an incorrect redirection to the admin changelist view when using *"Save and continue editing"* and *"Save and add another"* options (:ticket:`33893`).
zh_hans: 在 Django 4.1 中修复了一个问题，当使用 *"保存并继续编辑"* 和 *"保存并添加另一个"* 选项时，导致错误重定向到管理员 changelist 视图的回归问题（:ticket:`33893`）。

source: Fixed a regression in Django 4.1 that caused a crash of :class:`~django.db.models.expressions.Window` expressions with :class:`~django.contrib.postgres.aggregates.ArrayAgg` (:ticket:`33898`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致使用 :class:`~django.contrib.postgres.aggregates.ArrayAgg` 的 :class:`~django.db.models.expressions.Window` 表达式崩溃的回归问题（:ticket:`33898`）。

source: Fixed a regression in Django 4.1 that caused a migration crash on SQLite 3.35.5+ when removing an indexed field (:ticket:`33899`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 SQLite 3.35.5+ 上移除索引字段时发生迁移崩溃的回归问题（:ticket:`33899`）。

source: Fixed a bug in Django 4.1 that caused a crash of model validation on ``UniqueConstraint()`` with field names in ``expressions`` (:ticket:`33902`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 ``UniqueConstraint()`` 中使用字段名称的表达式时，模型验证崩溃的错误（:ticket:`33902`）。

source: Fixed a bug in Django 4.1 that caused an incorrect validation of ``CheckConstraint()`` with range fields on PostgreSQL (:ticket:`33905`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 PostgreSQL 上使用范围字段的 ``CheckConstraint()`` 验证不正确的错误（:ticket:`33905`）。

source: Fixed a regression in Django 4.1 that caused an incorrect migration when adding ``AutoField``, ``BigAutoField``, or ``SmallAutoField`` on PostgreSQL (:ticket:`33919`).
zh_hans: 在 Django 4.1 中修复了一个问题，当在 PostgreSQL 上添加 ``AutoField``、``BigAutoField`` 或 ``SmallAutoField`` 时，导致迁移不正确的回归问题（:ticket:`33919`）。

source: Fixed a regression in Django 4.1 that caused a migration crash on PostgreSQL when altering ``AutoField``, ``BigAutoField``, or ``SmallAutoField`` to ``OneToOneField`` (:ticket:`33932`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 PostgreSQL 上将 ``AutoField``、``BigAutoField`` 或 ``SmallAutoField`` 更改为 ``OneToOneField`` 时，迁移崩溃的回归问题（:ticket:`33932`）。

source: Fixed a migration crash on ``ManyToManyField`` fields with ``through`` referencing models in different apps (:ticket:`33938`).
zh_hans: 修复了 ``ManyToManyField`` 字段与引用不同应用程序中的模型的 ``through`` 的迁移崩溃问题（:ticket:`33938`）。

source: Fixed a regression in Django 4.1 that caused an incorrect migration when renaming a model with ``ManyToManyField`` and ``db_table`` (:ticket:`33953`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在重命名带有 ``ManyToManyField`` 和 ``db_table`` 的模型时，迁移不正确的回归问题（:ticket:`33953`）。

source: Reallowed, following a regression in Django 4.1, creating reverse foreign key managers on unsaved instances (:ticket:`33952`).
zh_hans: 在 Django 4.1 中，已经重新允许在未保存的实例上创建反向外键管理器，这是由于回归问题（:ticket:`33952`）。

source: Fixed a regression in Django 4.1 that caused a migration crash on SQLite < 3.20 (:ticket:`33960`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 SQLite < 3.20 上迁移崩溃的回归问题（:ticket:`33960`）。

source: Fixed a regression in Django 4.1 that caused an admin crash when the :mod:`~django.contrib.admindocs` app was used (:ticket:`33955`, :ticket:`33971`).
zh_hans: 在 Django 4.1 中修复了一个问题，当使用 :mod:`~django.contrib.admindocs` 应用程序时，导致管理员崩溃的回归问题（:ticket:`33955`, :ticket:`33971`）。

source: Django 4.1.10 release notes
zh_hans: Django 4.1.10 版本发行说明

source: Django 4.1.10 fixes a security issue with severity "moderate" in 4.1.9.
zh_hans: Django 4.1.10 修复了 4.1.9 版本中一些"中等"严重性的安全问题。

source: Django 4.1.11 release notes
zh_hans: Django 4.1.11 版本发行说明

source: Django 4.1.11 fixes a security issue with severity "moderate" in 4.1.10.
zh_hans: Django 4.1.11 修复了 4.1.10 版本中一些"中等"严重性的安全问题。

source: Django 4.1.12 release notes
zh_hans: Django 4.1.12 版本发行说明

source: Django 4.1.12 fixes a security issue with severity "moderate" in 4.1.11.
zh_hans: Django 4.1.12 修复了 4.1.11 版本中一些"中等"严重性的安全问题。

source: Django 4.1.13 release notes
zh_hans: Django 4.1.13 版本发行说明

source: Django 4.1.13 fixes a security issue with severity "moderate" in 4.1.12.
zh_hans: Django 4.1.13 修复了 4.1.12 版本中一些"中等"严重性的安全问题。

source: Django 4.1.2 release notes
zh_hans: Django 4.1.2 版本发行说明

source: Django 4.1.2 fixes a security issue with severity "medium" and several bugs in 4.1.1.
zh_hans: Django 4.1.2 修复了一个"中等"严重性的安全问题，以及 4.1.1 版本中的几个错误。

source: Fixed a regression in Django 4.1 that caused a migration crash on PostgreSQL when adding a model with ``ExclusionConstraint`` (:ticket:`33982`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 PostgreSQL 上添加带有 ``ExclusionConstraint`` 的模型时迁移崩溃的回归问题（:ticket:`33982`）。

source: Fixed a regression in Django 4.1 that caused aggregation over a queryset that contained an ``Exists`` annotation to crash due to too many selected columns (:ticket:`33992`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致对包含 ``Exists`` 注释的查询集进行聚合时，由于选择的列过多而崩溃的回归问题（:ticket:`33992`）。

source: Fixed a bug in Django 4.1 that caused an incorrect validation of ``CheckConstraint`` on ``NULL`` values (:ticket:`33996`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致对 ``NULL`` 值的 ``CheckConstraint`` 验证不正确的错误（:ticket:`33996`）。

source: Fixed a regression in Django 4.1 that caused a ``QuerySet.values()/values_list()`` crash on ``ArrayAgg()`` and ``JSONBAgg()`` (:ticket:`34016`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在 ``ArrayAgg()`` 和 ``JSONBAgg()`` 上使用 ``QuerySet.values()/values_list()`` 时崩溃的回归问题（:ticket:`34016`）。

source: Fixed a bug in Django 4.1 that caused :attr:`.ModelAdmin.autocomplete_fields` to be incorrectly selected after adding/changing related instances via popups (:ticket:`34025`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在通过弹出窗口添加/更改相关实例后，:attr:`.ModelAdmin.autocomplete_fields` 被不正确选择的错误（:ticket:`34025`）。

source: Fixed a regression in Django 4.1 where the app registry was not populated when running parallel tests with the ``multiprocessing`` start method ``spawn`` (:ticket:`34010`).
zh_hans: 在 Django 4.1 中修复了一个问题，在使用 ``multiprocessing`` 启动方法 ``spawn`` 运行并行测试时，应用程序注册表未填充的回归问题（:ticket:`34010`）。

source: Fixed a regression in Django 4.1 where the ``--debug-mode`` argument to ``test`` did not work when running parallel tests with the ``multiprocessing`` start method ``spawn`` (:ticket:`34010`).
zh_hans: 在 Django 4.1 中修复了一个问题，在使用 ``multiprocessing`` 启动方法 ``spawn`` 运行并行测试时，``test`` 命令的 ``--debug-mode`` 参数无法工作的回归问题（:ticket:`34010`）。

source: Fixed a regression in Django 4.1 that didn't alter a sequence type when altering type of pre-Django 4.1 serial columns on PostgreSQL (:ticket:`34058`).
zh_hans: 在 Django 4.1 中修复了一个问题，当在 PostgreSQL 上更改预先在 Django 4.1 之前创建的序列列的类型时，未更改序列类型的回归问题（:ticket:`34058`）。

source: Fixed a regression in Django 4.1 that caused a crash for :class:`View` subclasses with asynchronous handlers when handling non-allowed HTTP methods (:ticket:`34062`).
zh_hans: 在 Django 4.1 中修复了一个问题，当处理不允许的 HTTP 方法时，使用异步处理程序的 :class:`View` 子类崩溃的回归问题（:ticket:`34062`）。

source: Reverted caching related managers for ``ForeignKey``, ``ManyToManyField``, and ``GenericRelation`` that caused the incorrect refreshing of related objects (:ticket:`33984`).
zh_hans: 已回退了与 ``ForeignKey``、``ManyToManyField`` 和 ``GenericRelation`` 相关的缓存管理器，这导致相关对象的不正确刷新（:ticket:`33984`）。

source: Relaxed the system check added in Django 4.1 for the same name used for multiple template tag modules to a warning (:ticket:`32987`).
zh_hans: 对 Django 4.1 中添加的系统检查进行了放宽，用于同一名称用于多个模板标签模块的情况，现在是一个警告（:ticket:`32987`）。

source: Django 4.1.3 release notes
zh_hans: Django 4.1.3 版本发行说明

source: *November 1, 2022*
zh_hans: *2022 年 11 月 1 日*

source: Django 4.1.3 fixes a bug in 4.1.2 and adds compatibility with Python 3.11.
zh_hans: Django 4.1.3 修复了 4.1.2 版本中的一个错误，并增加了与 Python 3.11 的兼容性。

source: Fixed a bug in Django 4.1 that caused non-Python files created by ``startproject`` and ``startapp`` management commands from custom templates to be incorrectly formatted using the ``black`` command (:ticket:`34085`).
zh_hans: 在 Django 4.1 中修复了一个问题，该问题导致使用自定义模板从 ``startproject`` 和 ``startapp`` 管理命令创建的非 Python 文件在使用 ``black`` 命令时格式化不正确（:ticket:`34085`）。

source: Django 4.1.4 release notes
zh_hans: Django 4.1.4 版本发行说明

source: *December 6, 2022*
zh_hans: *2022 年 12 月 6 日*

source: Django 4.1.4 fixes several bugs in 4.1.3.
zh_hans: Django 4.1.4 修复了 4.1.3 版本中的一些错误。

source: Fixed a regression in Django 4.1 that caused an unnecessary table rebuild when adding a ``ManyToManyField`` on SQLite (:ticket:`34138`).
zh_hans: 在 Django 4.1 中修复了一个回归问题，当在 SQLite 上添加一个 ``ManyToManyField`` 时，导致不必要的表重建（:ticket:`34138`）。

source: Fixed a bug in Django 4.1 that caused a crash of the sitemap index view with an empty :meth:`Sitemap.items() <django.contrib.sitemaps.Sitemap.items>` and a callable :attr:`~django.contrib.sitemaps.Sitemap.lastmod` (:ticket:`34088`).
zh_hans: 在 Django 4.1 中修复了一个问题，当使用空的 :meth:`Sitemap.items() <django.contrib.sitemaps.Sitemap.items>` 和可调用的 :attr:`~django.contrib.sitemaps.Sitemap.lastmod` 时，导致站点地图索引视图崩溃的错误（:ticket:`34088`）。

source: Fixed a bug in Django 4.1 that caused a crash using ``acreate()``, ``aget_or_create()``, and ``aupdate_or_create()`` asynchronous methods of related managers (:ticket:`34139`).
zh_hans: 在 Django 4.1 中修复了一个问题，使用相关管理器的 ``acreate()``, ``aget_or_create()``, 和 ``aupdate_or_create()`` 异步方法时导致崩溃的错误（:ticket:`34139`）。

source: Fixed a bug in Django 4.1 that caused a crash of ``QuerySet.bulk_create()`` with ``"pk"`` in ``unique_fields`` (:ticket:`34177`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在使用 ``unique_fields`` 中包含 ``"pk"`` 时，``QuerySet.bulk_create()`` 崩溃的错误（:ticket:`34177`）。

source: Fixed a bug in Django 4.1 that caused a crash of ``QuerySet.bulk_create()`` on fields with ``db_column`` (:ticket:`34171`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在具有 ``db_column`` 的字段上使用 ``QuerySet.bulk_create()`` 时崩溃的错误（:ticket:`34171`）。

source: Django 4.1.5 release notes
zh_hans: Django 4.1.5 版本发行说明

source: *January 2, 2023*
zh_hans: *2023 年 1 月 2 日*

source: Django 4.1.5 fixes a bug in 4.1.4. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 4.1.5 修复了 4.1.4 版本中的一个错误。此外，还将来自 Transifex 的最新字符串翻译进行了整合。

source: Fixed a long standing bug in the ``__len`` lookup for ``ArrayField`` that caused a crash of model validation on :attr:`Meta.constraints <django.db.models.Options.constraints>` (:ticket:`34205`).
zh_hans: 在 ``ArrayField`` 的 ``__len`` 查找中修复了一个长期存在的 bug，该 bug 导致在 :attr:`Meta.constraints <django.db.models.Options.constraints>` 上进行模型验证时崩溃的问题（:ticket:`34205`）。

source: Django 4.1.6 release notes
zh_hans: Django 4.1.6 版本发行说明

source: Django 4.1.6 fixes a security issue with severity "moderate" and a bug in 4.1.5.
zh_hans: Django 4.1.6 修复了一个安全问题，严重程度为"中等"，以及 4.1.5 版本中的一个错误。

source: Fixed a bug in Django 4.1 that caused a crash of model validation on ``UniqueConstraint`` with ordered expressions (:ticket:`34291`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在带有有序表达式的 ``UniqueConstraint`` 上进行模型验证时崩溃的错误（:ticket:`34291`）。

source: Django 4.1.7 release notes
zh_hans: Django 4.1.7 版本发行说明

source: Django 4.1.7 fixes a security issue with severity "moderate" and a bug in 4.1.6.
zh_hans: Django 4.1.7 修复了一个安全问题，严重程度为"中等"，以及 4.1.6 版本中的一个错误。

source: Fixed a bug in Django 4.1 that caused a crash of model validation on ``ValidationError`` with no ``code`` (:ticket:`34319`).
zh_hans: 在 Django 4.1 中修复了一个问题，导致在没有 ``code`` 的情况下对 ``ValidationError`` 进行模型验证时崩溃的错误（:ticket:`34319`）。

source: Django 4.1.8 release notes
zh_hans: Django 4.1.8 版本发行说明

source: *April 5, 2023*
zh_hans: *2023 年 4 月 5 日*

source: Django 4.1.8 fixes a bug in 4.1.7.
zh_hans: Django 4.1.8 修复了 4.1.7 版本中的一个错误。

source: Fixed a bug in Django 4.1 that caused invalidation of sessions when rotating secret keys with ``SECRET_KEY_FALLBACKS`` (:ticket:`34384`).
zh_hans: 在 Django 4.1 中修复了一个问题，当使用 ``SECRET_KEY_FALLBACKS`` 旋转密钥时导致会话无效的错误（:ticket:`34384`）。

source: Django 4.1.9 release notes
zh_hans: Django 4.1.9 版本发行说明

source: Django 4.1.9 fixes a security issue with severity "low" in 4.1.8.
zh_hans: Django 4.1.9 修复了 4.1.8 版本中一个严重程度为"低"的安全问题。

source: Django 4.2 release notes
zh_hans: Django 4.2 版本发行说明

source: *April 3, 2023*
zh_hans: *2023 年 4 月 3 日*

source: Welcome to Django 4.2!
zh_hans: 欢迎使用 Django 4.2 ！

source: These release notes cover the :ref:`new features <whats-new-4.2>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-4.2>` you'll want to be aware of when upgrading from Django 4.1 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-4.2>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-4.2>`，以及一些 :ref:`不向后兼容的更改 <backwards-incompatible-4.2>`，在从 Django 4.1 或更早版本升级时需要注意。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-4.2>`。

source: Django 4.2 is designated as a :term:`long-term support release <Long-term support release>`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 3.2, will end in April 2024.
zh_hans: Django 4.2 被指定为 :term:`长期支持版本 <Long-term support release>`。它将在发布后至少三年内接收安全更新。对于之前的 LTS 版本 Django 3.2，支持将在 2024 年 4 月结束。

source: Django 4.2 supports Python 3.8, 3.9, 3.10, 3.11, and 3.12 (as of 4.2.8). We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 4.2 支持 Python 3.8、3.9、3.10、3.11 和 3.12（截止到 4.2.8 版本）。我们 **强烈推荐** 并且只官方支持每个系列的最新版本。

source: What's new in Django 4.2
zh_hans: Django 4.2 新特性

source: Psycopg 3 support
zh_hans: Psycopg 3 支持

source: Django now supports `psycopg`_ version 3.1.8 or higher. To update your code, install the :pypi:`psycopg library <psycopg>`, you don't need to change the :setting:`ENGINE <DATABASE-ENGINE>` as ``django.db.backends.postgresql`` supports both libraries.
zh_hans: Django 现在支持 `psycopg`_ 版本 3.1.8 或更高版本。要更新您的代码，请安装 :pypi:`psycopg library <psycopg>`，您不需要更改 :setting:`ENGINE <DATABASE-ENGINE>`，因为 ``django.db.backends.postgresql`` 支持这两个库。

source: Support for ``psycopg2`` is likely to be deprecated and removed at some point in the future.
zh_hans: 对 ``psycopg2`` 的支持可能会在将来的某个时候被弃用并移除。

source: Be aware that ``psycopg`` 3 introduces some breaking changes over ``psycopg2``. As a consequence, you may need to make some changes to account for `differences from psycopg2`_.
zh_hans: 请注意，``psycopg`` 3 对 ``psycopg2`` 进行了一些不兼容的更改。因此，您可能需要进行一些更改以适应与 `psycopg2 的不同之处`_。

source: Comments on columns and tables
zh_hans: 对列和表的注释

source: The new :attr:`Field.db_comment <django.db.models.Field.db_comment>` and :attr:`Meta.db_table_comment <django.db.models.Options.db_table_comment>` options allow creating comments on columns and tables, respectively. For example::
zh_hans: 新的 :attr:`Field.db_comment <django.db.models.Field.db_comment>` 和 :attr:`Meta.db_table_comment <django.db.models.Options.db_table_comment>` 选项允许分别在列和表上创建注释。例如：

source: Also, the new :class:`~django.db.migrations.operations.AlterModelTableComment` operation allows changing table comments defined in the :attr:`Meta.db_table_comment <django.db.models.Options.db_table_comment>`.
zh_hans: 此外，新的 :class:`~django.db.migrations.operations.AlterModelTableComment` 操作允许更改在 :attr:`Meta.db_table_comment <django.db.models.Options.db_table_comment>` 中定义的表注释。

source: Mitigation for the BREACH attack
zh_hans: 对 BREACH 攻击的缓解措施

source: :class:`~django.middleware.gzip.GZipMiddleware` now includes a mitigation for the BREACH attack. It will add up to 100 random bytes to gzip responses to make BREACH attacks harder. Read more about the mitigation technique in the `Heal The Breach (HTB) paper`_.
zh_hans: :class:`~django.middleware.gzip.GZipMiddleware` 现在包括对 BREACH 攻击的缓解措施。它将在 gzip 响应中添加最多 100 个随机字节，以增加 BREACH 攻击的难度。在 `Heal The Breach (HTB) paper`_ 中详细了解有关缓解技术。

source: In-memory file storage
zh_hans: 内存中的文件存储

source: The new :class:`django.core.files.storage.InMemoryStorage` class provides a non-persistent storage useful for speeding up tests by avoiding disk access.
zh_hans: 新的 :class:`django.core.files.storage.InMemoryStorage` 类提供了非持久性存储，对于加速测试并避免磁盘访问非常有用。

source: Custom file storages
zh_hans: 自定义文件存储

source: The new :setting:`STORAGES` setting allows configuring multiple custom file storage backends. It also controls storage engines for managing :doc:`files </topics/files>` (the ``"default"`` key) and :doc:`static files </ref/contrib/staticfiles>` (the ``"staticfiles"`` key).
zh_hans: 新的 :setting:`STORAGES` 设置允许配置多个自定义文件存储后端。它还控制了管理 :doc:`文件 </topics/files>` （``"default"`` 键）和 :doc:`静态文件 </ref/contrib/staticfiles>` （``"staticfiles"`` 键）的存储引擎。

source: The old ``DEFAULT_FILE_STORAGE`` and ``STATICFILES_STORAGE`` settings are deprecated as of this release.
zh_hans: 在此版本中，旧的 ``DEFAULT_FILE_STORAGE`` 和 ``STATICFILES_STORAGE`` 设置已被弃用。

source: The light or dark color theme of the admin can now be toggled in the UI, as well as being set to follow the system setting.
zh_hans: 现在可以在用户界面中切换管理界面的明亮或暗色主题，并且还可以设置为跟随系统设置。

source: The admin's font stack now prefers system UI fonts and no longer requires downloading fonts. Additionally, CSS variables are available to more easily override the default font families.
zh_hans: 管理界面现在更倾向于使用系统 UI 字体，不再需要下载字体。此外，提供了 CSS 变量，以便更轻松地覆盖默认字体系列。
