Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``django.contrib.postgres.aggregates.ArrayAgg``, ``JSONBAgg``, and ``StringAgg`` aggregates no longer return ``[]``, ``[]``, and ``''``, respectively, when there are no rows.
zh_hans: 当没有行时，``django.contrib.postgres.aggregates.ArrayAgg``、``JSONBAgg`` 和 ``StringAgg`` 聚合现在不再返回 ``[]``、``[]`` 和 ``''``，而是返回 ``None``。

source: The ``USE_L10N`` setting is removed.
zh_hans: ``USE_L10N`` 设置已被移除。

source: The ``USE_DEPRECATED_PYTZ`` transitional setting is removed.
zh_hans: ``USE_DEPRECATED_PYTZ`` 过渡设置已被移除。

source: Support for ``pytz`` timezones is removed.
zh_hans: 对于 ``pytz`` 时区的支持已被移除。

source: The ``is_dst`` argument is removed from:
zh_hans: ``is_dst`` 参数已从以下地方移除：

source: The ``django.contrib.gis.admin.GeoModelAdmin`` and ``OSMGeoAdmin`` classes are removed.
zh_hans: ``django.contrib.gis.admin.GeoModelAdmin`` 和 ``OSMGeoAdmin`` 类已被移除。

source: The undocumented ``BaseForm._html_output()`` method is removed.
zh_hans: 未记录的 ``BaseForm._html_output()`` 方法已被移除。

source: The ability to return a ``str``, rather than a ``SafeString``, when rendering an ``ErrorDict`` and ``ErrorList`` is removed.
zh_hans: 在渲染 ``ErrorDict`` 和 ``ErrorList`` 时返回 ``str`` 而不是 ``SafeString`` 的能力已被移除。

source: See :ref:`deprecated-features-4.1` for details on these changes, including how to remove usage of these features.
zh_hans: 有关这些更改的详细信息，包括如何删除对这些功能的使用，请参阅 :ref:`deprecated-features-4.1`。

source: The ``SitemapIndexItem.__str__()`` method is removed.
zh_hans: ``SitemapIndexItem.__str__()`` 方法已被移除。

source: The ``CSRF_COOKIE_MASKED`` transitional setting is removed.
zh_hans: ``CSRF_COOKIE_MASKED`` 过渡设置已被移除。

source: The ``name`` argument of ``django.utils.functional.cached_property()`` is removed.
zh_hans: ``django.utils.functional.cached_property()`` 的 ``name`` 参数已被移除。

source: The ``opclasses`` argument of ``django.contrib.postgres.constraints.ExclusionConstraint`` is removed.
zh_hans: ``django.contrib.postgres.constraints.ExclusionConstraint`` 的 ``opclasses`` 参数已被移除。

source: The undocumented ability to pass ``errors=None`` to ``SimpleTestCase.assertFormError()`` and ``assertFormsetError()`` is removed.
zh_hans: 已移除将 ``errors=None`` 传递给 ``SimpleTestCase.assertFormError()`` 和 ``assertFormsetError()`` 的未记录能力。

source: ``django.contrib.sessions.serializers.PickleSerializer`` is removed.
zh_hans: ``django.contrib.sessions.serializers.PickleSerializer`` 已被移除。

source: The usage of ``QuerySet.iterator()`` on a queryset that prefetches related objects without providing the ``chunk_size`` argument is no longer allowed.
zh_hans: 不再允许在预取相关对象但没有提供 ``chunk_size`` 参数的查询集上使用 ``QuerySet.iterator()``。

source: Passing unsaved model instances to related filters is no longer allowed.
zh_hans: 不再允许将未保存的模型实例传递给相关的过滤器。

source: ``created=True`` is required in the signature of ``RemoteUserBackend.configure_user()`` subclasses.
zh_hans: 在 ``RemoteUserBackend.configure_user()`` 子类的签名中需要包含 ``created=True``。

source: Support for logging out via ``GET`` requests in the ``django.contrib.auth.views.LogoutView`` and ``django.contrib.auth.views.logout_then_login()`` is removed.
zh_hans: 已移除通过 ``GET`` 请求在 ``django.contrib.auth.views.LogoutView`` 和 ``django.contrib.auth.views.logout_then_login()`` 中进行登出的支持。

source: The ``django.utils.timezone.utc`` alias to ``datetime.timezone.utc`` is removed.
zh_hans: ``django.utils.timezone.utc`` 到 ``datetime.timezone.utc`` 的别名已被移除。

source: Passing a response object and a form/formset name to ``SimpleTestCase.assertFormError()`` and ``assertFormSetError()`` is no longer allowed.
zh_hans: 不再允许将响应对象和表单/表单集名称传递给 ``SimpleTestCase.assertFormError()`` 和 ``assertFormSetError()``。

source: The ``django.contrib.gis.admin.OpenLayersWidget`` is removed.
zh_hans: ``django.contrib.gis.admin.OpenLayersWidget`` 已被移除。

source: The ``django.contrib.auth.hashers.CryptPasswordHasher`` is removed.
zh_hans: ``django.contrib.auth.hashers.CryptPasswordHasher`` 已被移除。

source: The ``"django/forms/default.html"`` and ``"django/forms/formsets/default.html"`` templates are removed.
zh_hans: ``"django/forms/default.html"`` 和 ``"django/forms/formsets/default.html"`` 模板已被移除。

source: The default form and formset rendering style is changed to the div-based.
zh_hans: 默认的表单和表单集呈现样式已更改为基于 div 的样式。

source: Passing ``nulls_first=False`` or ``nulls_last=False`` to ``Expression.asc()`` and ``Expression.desc()`` methods, and the ``OrderBy`` expression is no longer allowed.
zh_hans: 不再允许向 ``Expression.asc()`` 和 ``Expression.desc()`` 方法以及 ``OrderBy`` 表达式传递 ``nulls_first=False`` 或 ``nulls_last=False``。

source: Django 5.0.1 release notes
zh_hans: Django 5.0.1 版本发行说明

source: Django 5.0.1 fixes several bugs in 5.0.
zh_hans: Django 5.0.1 修复了 5.0 版本中的一些错误。

source: Reallowed, following a regression in Django 5.0, using a foreign key to a model with a primary key that is not ``AutoField`` in :attr:`.ModelAdmin.list_filter` (:ticket:`35020`).
zh_hans: 重新允许，在 Django 5.0 中出现回归后，使用外键到一个不是 ``AutoField`` 的主键模型在 :attr:`.ModelAdmin.list_filter` 中(:ticket:`35020`)。

source: Fixed a long standing bug in handling the ``RETURNING INTO`` clause that caused a crash when creating a model instance with a ``GeneratedField`` which ``output_field`` had backend-specific converters (:ticket:`35024`).
zh_hans: 修复了处理 ``RETURNING INTO`` 子句中的一个长期存在的错误，该错误在使用具有后端特定转换器的 ``GeneratedField`` 的 ``output_field`` 创建模型实例时导致崩溃（:ticket:`35024`）。

source: Fixed a regression in Django 5.0 that caused a crash of ``Model.save()`` for models with both ``GeneratedField`` and ``ForeignKey`` fields (:ticket:`35019`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，该问题导致具有 ``GeneratedField`` 和 ``ForeignKey`` 字段的模型的 ``Model.save()`` 崩溃(:ticket:`35019`)。

source: Fixed a bug in Django 5.0 that caused a migration crash on Oracle < 23c when adding a ``GeneratedField`` with ``output_field=BooleanField`` (:ticket:`35018`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误在向 Oracle < 23c 添加 ``GeneratedField`` 并使用 ``output_field=BooleanField`` 时导致迁移崩溃(:ticket:`35018`)。

source: Fixed a regression in Django 5.0 where admin fields on the same line could overflow the page and become non-interactive (:ticket:`35012`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，即同一行上的管理字段可能会溢出页面并变得不可交互（:ticket:`35012`）。

source: Added compatibility for ``oracledb`` 2.0.0 (:ticket:`35054`).
zh_hans: 添加了对 ``oracledb`` 2.0.0 的兼容性 (:ticket:`35054`).

source: Fixed a regression in Django 5.0 where querysets referenced incorrect field names from ``FilteredRelation()`` (:ticket:`35050`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，其中查询集从 ``FilteredRelation()`` 引用了不正确的字段名称(:ticket:`35050`)。

source: Fixed a regression in Django 5.0 that caused a system check crash when ``ModelAdmin.filter_horizontal`` or ``filter_vertical`` contained a reverse many-to-many relation with ``related_name`` (:ticket:`35056`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，当 ``ModelAdmin.filter_horizontal`` 或 ``filter_vertical`` 包含具有 ``related_name`` 的反向多对多关系时，会导致系统检查崩溃(:ticket:`35056`)。

source: Django 5.0.2 release notes
zh_hans: Django 5.0.2 版本发行说明

source: Django 5.0.2 fixes a security issue with severity "moderate" and several bugs in 5.0.1. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 5.0.2 修复了一个严重程度为 “中等” 的安全问题和 5.0.1 中的几个漏洞。此外，还加入了 Transifex 的最新字符串翻译。

source: Reallowed, following a regression in Django 5.0.1, filtering against local foreign keys not included in :attr:`.ModelAdmin.list_filter` (:ticket:`35087`).
zh_hans: 重新允许，在 Django 5.0.1 中出现回归后，对不包含在 :attr:`.ModelAdmin.list_filter` 中的本地外键进行过滤(:ticket:`35087`)。

source: Fixed a regression in Django 5.0 where links in the admin had an incorrect color (:ticket:`35121`).
zh_hans: 在 Django 5.0 中修复了一个回归问题，该问题导致管理界面中的链接颜色不正确（:ticket:`35121`）。

source: Fixed a bug in Django 5.0 that caused a crash of ``Model.full_clean()`` on models with a ``GeneratedField`` (:ticket:`35127`).
zh_hans: 在 Django 5.0 中修复了一个问题，导致具有 ``GeneratedField`` 的模型的 ``Model.full_clean()`` 崩溃(:ticket:`35127`)。

source: Fixed a regression in Django 5.0 that caused a crash of ``FilteredRelation()`` with querysets as right-hand sides (:ticket:`35135`). ``FilteredRelation()`` now raises a ``ValueError`` on querysets as right-hand sides.
zh_hans: 修复了 Django 5.0 中的一个回归问题，该问题导致 ``FilteredRelation()`` 与查询集作为右侧引发崩溃(:ticket:`35135`)。现在，``FilteredRelation()`` 在查询集作为右侧时会引发 ``ValueError``。

source: Fixed a regression in Django 5.0 that caused a crash of the ``dumpdata`` management command when a base queryset used ``prefetch_related()`` (:ticket:`35159`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，该问题导致在基本查询集使用 ``prefetch_related()`` 时，``dumpdata`` 管理命令崩溃(:ticket:`35159`)。

source: Fixed a regression in Django 5.0 that caused the ``request_finished`` signal to sometimes not be fired when running Django through an ASGI server, resulting in potential resource leaks (:ticket:`35059`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，导致在通过 ASGI 服务器运行 Django 时，``request_finished`` 信号有时不会被触发，可能导致资源泄漏（:ticket:`35059`）。

source: Fixed a bug in Django 5.0 that caused a migration crash on MySQL when adding a ``BinaryField``, ``TextField``, ``JSONField``, or ``GeometryField`` with a ``db_default`` (:ticket:`35162`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误导致在 MySQL 上添加包含一个 ``db_default`` 的 ``BinaryField``、``TextField``、``JSONField`` 或 ``GeometryField`` 时会发生迁移崩溃(:ticket:`35162`)。

source: Fixed a bug in Django 5.0 that caused a migration crash on models with a literal ``db_default`` of a complex type such as ``dict`` instance of a ``JSONField``. Running ``makemigrations`` might generate no-op ``AlterField`` operations for fields using ``db_default`` (:ticket:`35149`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误导致具有复杂类型（例如 ``JSONField`` 的 ``dict`` 实例）的文字 ``db_default`` 的模型迁移崩溃。运行 ``makemigrations`` 可能会为使用 ``db_default`` 的字段生成无操作的 ``AlterField`` 操作（:ticket:`35149`）。

source: Django 5.0.3 release notes
zh_hans: Django 5.0.3 版本发行说明

source: Django 5.0.3 fixes a security issue with severity "moderate" and several bugs in 5.0.2.
zh_hans: Django 5.0.3 修复了一些"中等"严重性的安全问题，以及 5.0.2 版本中的几个错误。

source: Fixed a regression in Django 5.0.2 where ``intcomma`` template filter could return a leading comma for string representation of floats (:ticket:`35172`).
zh_hans: 修复了 Django 5.0.2 中的一个回归问题，即 ``intcomma`` 模板过滤器可能在浮点数的字符串表示中返回一个前导逗号（:ticket:`35172`）。

source: Fixed a bug in Django 5.0 that caused a crash of ``Signal.asend()`` and ``asend_robust()`` when all receivers were asynchronous functions (:ticket:`35174`).
zh_hans: 修复了 Django 5.0 中的一个错误，导致当所有接收器都是异步函数时，``Signal.asend()`` 和 ``asend_robust()`` 崩溃（:ticket:`35174`）。

source: Fixed a regression in Django 5.0.1 where :meth:`.ModelAdmin.lookup_allowed` would prevent filtering against foreign keys using lookups like ``__isnull`` when the field was not included in :attr:`.ModelAdmin.list_filter` (:ticket:`35173`).
zh_hans: 修复了 Django 5.0.1 中的一个回归问题，即当字段未包含在 :attr:`.ModelAdmin.list_filter` 中时，:meth:`.ModelAdmin.lookup_allowed` 将阻止使用类似 ``__isnull`` 的查找对外键进行过滤（:ticket:`35173`）。

source: Fixed a regression in Django 5.0 that caused a crash of ``@sensitive_variables`` and ``@sensitive_post_parameters`` decorators on functions loaded from ``.pyc`` files (:ticket:`35187`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，即 ``@sensitive_variables`` 和 ``@sensitive_post_parameters`` 装饰器在从 ``.pyc`` 文件加载的函数上导致崩溃（:ticket:`35187`）。

source: Fixed a regression in Django 5.0 that caused a crash when reloading a test database and a base queryset for a base manager used ``prefetch_related()`` (:ticket:`35238`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，即当重新加载测试数据库并且基本管理器的基本查询集使用了 ``prefetch_related()`` 时导致崩溃（:ticket:`35238`）。

source: Fixed a bug in Django 5.0 where facet filters in the admin would crash on a ``SimpleListFilter`` using a queryset without primary keys (:ticket:`35198`).
zh_hans: 修复了 Django 5.0 中的一个错误，即在管理中使用一个没有主键的查询集的 ``SimpleListFilter`` 会导致面向方面的筛选器崩溃（:ticket:`35198`）。

source: Django 5.0.4 release notes
zh_hans: Django 5.0.4 版本发行说明

source: *April 3, 2024*
zh_hans: 2024年 4 月 3 日

source: Django 5.0.4 fixes several bugs in 5.0.3.
zh_hans: Django 5.0.4 修复了 5.0.3 版本中的多个错误。

source: Fixed a bug in Django 5.0 that caused a crash of ``Model.full_clean()`` on fields with expressions in ``db_default``. As a consequence, ``Model.full_clean()`` no longer validates for empty values in fields with ``db_default`` (:ticket:`35223`).
zh_hans: 修复了 Django 5.0 中的一个错误，导致在具有 ``db_default`` 中的表达式的字段上调用 ``Model.full_clean()`` 时崩溃。因此，``Model.full_clean()`` 不再验证具有 ``db_default`` 的字段中的空值（:ticket:`35223`）。

source: Fixed a regression in Django 5.0 where the ``AdminFileWidget`` could be rendered with two ``id`` attributes on the "Clear" checkbox (:ticket:`35273`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，即 ``AdminFileWidget`` 可能会在“清除”复选框上呈现两个 ``id`` 属性（:ticket:`35273`）。

source: Fixed a bug in Django 5.0 that caused a migration crash on PostgreSQL 15+ when adding a partial ``UniqueConstraint`` with ``nulls_distinct`` (:ticket:`35329`).
zh_hans: 修复了 Django 5.0 中的一个回归问题，该问题导致在同一迁移中添加包含``UniqueConstraint``的部分时，在 PostgreSQL 15+ 上发生迁移崩溃 (:ticket:`35329`)。

source: Fixed a crash in Django 5.0 when performing queries involving table aliases and lookups on a ``GeneratedField`` of the aliased table (:ticket:`35344`).
zh_hans: 修复了在 Django 5.0 中执行涉及表别名的查询以及在别名表“GenerateField”上进行查找时发生的崩溃。 (:ticket:`35344`)

source: Fixed a bug in Django 5.0 that caused a migration crash when adding a ``GeneratedField`` relying on the ``__contains`` or ``__icontains`` lookups or using a ``Value`` containing a ``"%"`` (:ticket:`35336`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误在添加依赖于 __contains 或 __icontains 查找或使用包含“%”的 Value 时导致迁移崩溃 ` (:ticket:`35336`).

source: Django 5.0.5 release notes
zh_hans: Django 5.0.5 版本发行说明

source: Django 5.0.5 fixes several bugs in 5.0.4.
zh_hans: Django 5.0.5 修复了 5.0.4 版本中的多个错误。

source: Fixed a bug in Django 5.0 that caused a crash of ``Model.save()`` when creating an instance of a model with a ``GeneratedField`` and providing a primary key (:ticket:`35350`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误在使用“GenerateField”创建模型实例并提供主键时导致“Model.save()”崩溃(:ticket:`35350`).

source: Fixed a compatibility issue encountered in Python 3.11.9+ and 3.12.3+ when validating email max line lengths with content decoded using the ``surrogateescape`` error handling scheme (:ticket:`35361`).
zh_hans: 修复了在使用“surrogateescape”错误处理方案解码的内容验证电子邮件最大行长度时在 Python 3.11.9+ 和 3.12.3+ 中遇到的兼容性问题 (:ticket:`35361`)

source: Fixed a bug in Django 5.0 that caused a crash when applying migrations including alterations to ``GeneratedField`` such as setting ``db_index=True`` on SQLite (:ticket:`35373`).
zh_hans: 修复了 Django 5.0 中的一个错误，该错误在应用迁移时导致崩溃，包括对“GeneratedField”的更改，例如在 SQLite 上设置“db_index=True”(:ticket:`35373`).

source: Allowed importing ``aprefetch_related_objects`` from ``django.db.models`` (:ticket:`35392`).
zh_hans: 允许从“django.db.models”导入“aprefetch_related_objects””(:ticket:`35392`).

source: Fixed a bug in Django 5.0 that caused a migration crash when a ``GeneratedField`` was added before any of the referenced fields from its ``expression`` definition (:ticket:`35359`).
zh_hans: 修复了Django 5.0中的一个错误，当在其“expression”定义中的任何引用字段之前添加“GeneratedField”时，会导致迁移崩溃 (:ticket:`35359`)。

source: Fixed a bug in Django 5.0 that caused a migration crash when altering a ``GeneratedField`` referencing a renamed field (:ticket:`35422`).
zh_hans: 修复了Django 5.0中的一个错误，该错误在更改引用重命名字段的“GeneratedField”时导致迁移崩溃(:ticket:`35422`)。

source: Fixed a bug in Django 5.0 where the ``querysets`` argument of ``GenericPrefetch`` was not required (:ticket:`35426`).
zh_hans: 修复了Django 5.0中不需要“GenericPrefetch”的“querysets”参数的错误 (:ticket:`35426`)。

source: Django 5.0.6 release notes
zh_hans: Django 5.0.6 版本发行说明

source: Django 5.0.6 fixes a packaging error in 5.0.5.
zh_hans: Django 5.0.6 修复了 5.0.5 版本中的一个打包错误。

source: Django 5.0.7 release notes
zh_hans: Django 5.0.7 版本发行说明

source: Release notes
id: Catatan terbitan
zh_hans: 发行说明

source: Release notes for the official Django releases. Each release note will tell you what's new in each version, and will also describe any backwards-incompatible changes made in that version.
id: Terbitan keamanan untuk terbitan Django secara resmi. Setiap terbitan catatan akan memberitahu anda apa yang baru di setiap versi, dan akan juga menggambarkan perubahan ketidaksesuaian-kebelakang apapun dibuat di versi tersebut.
zh_hans: Django 官方版本的发行说明。每个版本的发行说明都会告诉你每个版本的新内容，也会描述该版本中任何向后不兼容的改动。

source: For those :doc:`upgrading to a new version of Django</howto/upgrade-version>`, you will need to check all the backwards-incompatible changes and :doc:`deprecated features</internals/deprecation>` for each 'final' release from the one after your current Django version, up to and including the new version.
id: Untuk :doc:`upgrading to a new version of Django</howto/upgrade-version>` tersebut, anda akan butuh memeriksa semua perubahan ketidaksesuaian-kebelakang dan :doc:`deprecated features</internals/deprecation>` untuk setiap terbitan 'akhir' dari satu setelah versi Django anda saat ini, sampai dan menyertakan versi baru.
zh_hans: 对于那些 :doc:`升级到新版本的 Django </howto/upgrade-version>`，你需要检查所有向后不兼容的变化和 :doc:`废弃的功能 </internals/deprecation>`，从你当前的 Django 版本之后的每一个 “最终” 版本，直到并包括新版本。

source: Final releases
id: Terbitan akhir
zh_hans: 最终版本

source: Below are release notes through Django |version| and its patch releases. Newer versions of the documentation contain the release notes for any later releases.
id: Dibawah adalah terbitan catatan melalui Django |version| dan terbitan tambalannya. Versi terbaru dari dokumentasi mengandung terbitan catatan untuk setiap terbitan terakhir.
zh_hans: 下面是通过 Django |version| 及其补丁发布的发行说明。新版本的文档包含了以后版本的发行说明。

source: 5.0 release
zh_hans: 5.0 发行

source: 4.2 release
zh_hans: 4.2 发行

source: 4.1 release
zh_hans: 4.1 发行

source: 4.0 release
zh_hans: 4.0 发行

source: 3.2 release
zh_hans: 3.2 发行

source: 3.1 release
zh_hans: 3.1 发行

source: 3.0 release
zh_hans: 3.0 发行

source: 2.2 release
zh_hans: 2.2 发行

source: 2.1 release
zh_hans: 2.1 发行

source: 2.0 release
id: Terbitan 2.0
zh_hans: 2.0 发行

source: 1.11 release
id: Terbitan 1.11
zh_hans: 1.11 发行

source: 1.10 release
id: Terbitan 1.10
zh_hans: 1.10 发行

source: 1.9 release
id: Terbitan 1.9
zh_hans: 1.9 发行

source: 1.8 release
id: Terbitan 1.8
zh_hans: 1.8 发行

source: 1.7 release
id: Terbitan 1.7
zh_hans: 1.7 发行

source: 1.6 release
id: Terbitan 1.6
zh_hans: 1.6 发行

source: 1.5 release
id: Terbitan 1.5
zh_hans: 1.5 发行

source: 1.4 release
id: Terbitan 1.4
zh_hans: 1.4 发行

source: 1.3 release
id: Terbitan 1.3
zh_hans: 1.3 发行

source: 1.2 release
id: Terbitan 1.2
zh_hans: 1.2 发行

source: 1.1 release
id: Terbitan 1.1
zh_hans: 1.1 发行

source: 1.0 release
id: Terbitan 1.0
zh_hans: 1.0 发行

source: Pre-1.0 releases
id: Terbitan pra-1.0
zh_hans: 1.0 前发行

source: Security releases
id: Terbitan keamanan
zh_hans: 安全发行

source: Whenever a security issue is disclosed via :doc:`Django's security policies </internals/security>`, appropriate release notes are now added to all affected release series.
id: Kapanpun sebuah masalah keamanan adalah terbongkar melalui :doc:`Django's security policies </internals/security>`, terbitan catatan sesuai sekarang ditambahkan ke semua rangkaian terbitan terpengaruh.
zh_hans: 每当一个安全问题通过 :doc:`Django 的安全策略 </internals/security>` 披露时，适当的发布说明现在会添加到所有受影响的发行系列中。

source: Additionally, :doc:`an archive of disclosed security issues </releases/security>` is maintained.
id: Tambahannya, :doc:`an archive of disclosed security issues </releases/security>` dirawat.
zh_hans: 此外，还维护着 :doc:`已披露的安全问题档案 </releases/security>`。

source: Archive of security issues
id: Arsip dari masalah keamanan
zh_hans: 安全问题档案

source: Django's development team is strongly committed to responsible reporting and disclosure of security-related issues, as outlined in :doc:`Django's security policies </internals/security>`.
id: Tim pengembangan Django memiliki komitmen yang kuat untuk bertanggung jawab melaorkan dan menyingkap dari masalah terkait-keamanan, sebagai diuraikan di :doc:`Django's security policies </internals/security>`.
zh_hans: Django 的开发团队致力于负责任地报告和披露与安全相关的问题，正如 :doc:`Django 的安全政策 </internals/security>` 所概述的那样。

source: As part of that commitment, we maintain the following historical list of issues which have been fixed and disclosed. For each issue, the list below includes the date, a brief description, the `CVE identifier <https://en.wikipedia.org/wiki/Common_Vulnerabilities_and_Exposures>`_ if applicable, a list of affected versions, a link to the full disclosure and links to the appropriate patch(es).
id: Sebagai bagian dari komitmen itu, kami merawat daftar riwayat berikut dari masalah yang telah diperbaiki dan diungkapkan. Untuk setiap masalah, daftar dibawah termasuk tanggal, gambaran singkat `CVE identifier <https://en.wikipedia.org/wiki/Common_Vulnerabilities_and_Exposures>`_ jika diberlakukan, sebuah daftar dari versi terpengaruh, sebuah tautan pada pengungkapan penuh dan tautan ke tambalan-tambalan yang sesuai.
zh_hans: 作为该承诺的一部分，我们保留了以下已修复和披露的历史问题清单。对于每个问题，下面的列表包括日期、简要描述、`CVE 标识符 <https://en.wikipedia.org/wiki/Common_Vulnerabilities_and_Exposures>`_ （如果适用）、受影响版本的列表、到完整披露的链接以及到适当补丁的链接。

source: Some important caveats apply to this information:
id: Beberapa peringatan penting berlaku pada informasi ini:
zh_hans: 一些重要的注意事项适用于这些信息：

source: Lists of affected versions include only those versions of Django which had stable, security-supported releases at the time of disclosure. This means older versions (whose security support had expired) and versions which were in pre-release (alpha/beta/RC) states at the time of disclosure may have been affected, but are not listed.
id: Daftar dari versi terpengaruh termasuk hanya versi itu dari Django yang stabil, terbitan dukungan-keamanan pada saat dari penyingkapan. Ini berarti versi terlama (yang dukungan keamanan telah berakhir) dan versi yang berada di pra-terbitan keadaan (alpha/beta/RC) pada saat dari penyingkapan mungkin telah terpengaruh, tetapi tidak terdaftar.
zh_hans: 受影响的版本列表只包括那些在披露时有稳定的、安全支持的版本的 Django。这意味着旧版本（其安全支持已经过期）和在披露时处于发布前（alpha／beta／RC）状态的版本可能会受到影响，但没有被列出。

source: The Django project has on occasion issued security advisories, pointing out potential security problems which can arise from improper configuration or from other issues outside of Django itself. Some of these advisories have received CVEs; when that is the case, they are listed here, but as they have no accompanying patches or releases, only the description, disclosure and CVE will be listed.
id: Proyek Django terkadang menerbitkan saran keamanan, menunjuk kemungkinan masalah keamanan yang dapat muncul dari konfigurasi tidak sesuai atau dari masalah-masalah lain diluar Django itu sendiri. Beberapa dari saran-saran ini telah menerima CVE; ketika itu adalah kasus, mereka didaftarkan disini, tetapi karena mereka tidak mempunyai tambalan atau terbitan yang mendampingi, hanya gambaran, penyingkapan dan CVE akan didaftarkan.
zh_hans: Django 项目有时会发布安全公告，指出潜在的安全问题，这些问题可能是由于配置不当或 Django 本身以外的其他问题造成的。有些安全公告已经收到了 CVE，在这种情况下，它们会被列在这里，但由于它们没有附带的补丁或版本，所以只会列出描述、披露和 CVE。

source: Issues under Django's security process
id: Masalah dibawah pengolahan keamanan Django
zh_hans: Django 的安全流程下的问题

source: All security issues have been handled under versions of Django's security process. These are listed below.
zh_hans: 所有的安全问题都已经在 Django 的安全进程的版本下处理。这些版本列举如下。

source: March 4, 2024 - :cve:`2024-27351`
zh_hans: 2024 年 3 月 4 日 - :cve:`2024-27351`

source: Potential regular expression denial-of-service in ``django.utils.text.Truncator.words()``. `Full description <https://www.djangoproject.com/weblog/2024/mar/04/security-releases/>`__
zh_hans: ``django.utils.text.Truncator.words()`` 存在潜在的正则表达式拒绝服务漏洞。`完整描述 <https://www.djangoproject.com/weblog/2024/mar/04/security-releases/>`__

source: Django 5.0 :commit:`(patch) <3394fc6132436eca89e997083bae9985fb7e761e>`
zh_hans: Django 5.0 :commit:`(补丁) <3394fc6132436eca89e997083bae9985fb7e761e>`
