Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django's built-in ``FileField`` and ``ImageField`` now can take advantage of pluggable file-storage backends, allowing extensive customization of where and how uploaded files get stored by Django. For details, see :doc:`the files documentation </topics/files>`; big thanks go to Marty Alchin for putting in the hard work to get this completed.
id: ``FileField`` dan ``ImageField`` siap pakai Django sekarang dapat mengambil keuntungan dari backend penimpanan berkas dapat ditanam, mengizinkan penyesuaian luas dari dimana dan bagaimana mengunggah berkas-berkas disimpan oleh Django. Untuk rincian, lihat :doc:`the files documentation </topics/files>`; terima kasih besar ditujukan kepada Marty Alchin untuk menaruh di pekerjaan keras untuk mendapatkan ini selesai.
zh_hans: Django的内置 ``FileField`` 和 ``ImageField`` 目前获得了后端移动文件存储的功能优势，Django允许扩展自定义上传文件，指定上传文件的位置和如何上传文件。细节可以查看 :doc:`文件文档内容 </topics/files>`; 非常感谢 Marty Alchin 投入了艰难的工作完成这项特性功能。

source: Jython compatibility
id: Kesesuaian Jython
zh_hans: Jython 兼容性

source: Thanks to a lot of work from Leo Soto during a Google Summer of Code project, Django's codebase has been refactored to remove incompatibilities with `Jython`_, an implementation of Python written in Java, which runs Python code on the Java Virtual Machine. Django is now compatible with the forthcoming Jython 2.5 release.
id: Terima kasih kepada banyak kerja dari Leo Soto selama Google Summer of Code project, basiskode Django telah direfaktor untuk memindahkan ketidaksesuaian dengan ``Jython`_, sebuah penerapan dari Python ditulis dalam Java, yang menjalankan kode Python pada Java Virtual Machine. Django sekarang cocok dengan terbitan Jython 2.5 yang akan datang.
zh_hans: 非常感谢 Leo Soto 在谷歌夏季编程项目中做了大量工作，Django 的代码库已经重构后删除了与 `Jython`_ 不兼容的代码部分，一个用 Java 写的 Python 实现，可以在 Java 虚拟机上运行 Python 代码。Django 目前可以兼容即将发布的 Jython 2.5 版本了。

source: Generic relations in forms and admin
id: Hubungan umum di formulir dan admin
zh_hans: 表单和管理员中的普通关联

source: Classes are now included in ``django.contrib.contenttypes`` which can be used to support generic relations in both the admin interface and in end-user forms. See :ref:`the documentation for generic relations <generic-relations>` for details.
id: Kelas-kelas sekarang disertakan dalam ``django.contrib.contenttypes`` yang dapat digunakan untuk mendukung hubungan umum dalam kedua antarmuka admin dan formulir pengguna akhir. Lihat :ref:`the documentation for generic relations <generic-relations>` untuk rincian.
zh_hans: 许多类目前都放在了 ``django.contrib.contenttypes`` 模块中，这是用来支持后台接口和用户形式的普通关联。参考 :ref:`普通关联文档 <generic-relations>` 了解细节。

source: ``INSERT``/``UPDATE`` distinction
id: Perbedaan ``INSERT``/``UPDATE``
zh_hans: ``INSERT``和``UPDATE`` 区别

source: Although Django's default behavior of having a model's ``save()`` method automatically determine whether to perform an ``INSERT`` or an ``UPDATE`` at the SQL level is suitable for the majority of cases, there are occasional situations where forcing one or the other is useful. As a result, models can now support an additional parameter to ``save()`` which can force a specific operation.
id: Meskipun perilaku awal Django dari memiliki sebuah metode ``save()`` model otomatis menentukan apakah untuk melakukan sebuah ``INSERT`` atau sebuah ``UPDATE`` pada tingkat SQL adalah cocok untuk mayoritas dari kasus, ada keadaan kadang-kadang dimana memaksa satu atau lainnya adalah berguna. Sebagai hasil, mode sekarang dapat mendukung parameter tambahan pada ``save()`` yang dapat memaksa tindakan khusus.
zh_hans: 尽管 Django对于SQL数据库 ``INSERT``或 ``UPDATE`` 操作有一个默认自动执行的模型``save()``方法行为，在大多数情况下都适用，但偶尔也有一些情况要强制使用一个或另一个才行。作为结果，许多模块目前可以支持另一个可选参数，让``save()``方法强制执行具体的一个操作。

source: See :ref:`ref-models-force-insert` for details.
id: Lihat :ref:`ref-models-force-insert` untuk rincian.
zh_hans: 参考 :ref:`指向模型强制插入` 文档了解细节。

source: Split ``CacheMiddleware``
id: Pisah ``CacheMiddleware``
zh_hans: 去掉 ``CacheMiddleware``

source: Django's ``CacheMiddleware`` has been split into three classes: ``CacheMiddleware`` itself still exists and retains all of its previous functionality, but it is now built from two separate middleware classes which handle the two parts of caching (inserting into and reading from the cache) separately, offering additional flexibility for situations where combining these functions into a single middleware posed problems.
id: ``CacheMiddleware`` Django telah dipisah kedalam tiga kelas-kelas: ``CacheMiddleware`` itu sendiri masih ada dan menyimpan semua kegunaan sebelumnya, tetapi itu sekarang dibangun dari dua middleware kelas terpisah yang menangani dua bagian dari penyimpanan sementara(memasukkan kedalam dan membaca dari penyimpanan) secara terpisah, menawarkan tambahan fleksibel untuk keadaan dimana menggabungkan fungsi ini kedalam middleware tunggal menjadi masalah.
zh_hans: Django的 ``CacheMiddleware`` 已经分解成三个类了： ``CacheMiddleware`` 依然存在并且保留了以前本身的全部功能，但目前建立要从2个不同的中间件类来建立，分别处理缓存中的2个部分 (插入到缓存中和从缓存中读取)，这样为一些情况提供了额外的灵活性，例如把许多功能组合到一个中间件里来解决问题。

source: Full details, including updated notes on appropriate use, are in :doc:`the caching documentation </topics/cache>`.
id: Rincian penuh, termasuk catatan terbaru pada penggunaan sesuai, berada di :doc:`the caching documentation </topics/cache>`.
zh_hans: 全部细节，包括适当地更新注释，都在 :doc:`缓存文档 </topics/cache>` 中。

source: Refactored ``django.contrib.comments``
id: Refaktor ``django.contrib.comments``
zh_hans: 重构 ``django.contrib.comments``

source: As part of a Google Summer of Code project, Thejaswi Puthraya carried out a major rewrite and refactoring of Django's bundled comment system, greatly increasing its flexibility and customizability.
id: Sebagai bagian dari Google Summer dari Code project, Thejaswi Puthraya membawa penulisan kembali utama dan refaktor sistem komentar gabungan Django, sangat meningkatkan fleksibilitas dan penyesuaian.
zh_hans: 作为谷歌夏季代码项目的一部分， Thejaswi Puthraya 负责主要的重写和重构Django的捆绑注释系统，极大地提高了灵活性和自定义功能。

source: Removal of deprecated features
id: Pemindahan fitur usang
zh_hans: 移除淘汰的特性

source: A number of features and methods which had previously been marked as deprecated, and which were scheduled for removal prior to the 1.0 release, are no longer present in Django. These include imports of the form library from ``django.newforms`` (now located simply at ``django.forms``), the ``form_for_model`` and ``form_for_instance`` helper functions (which have been replaced by ``ModelForm``) and a number of deprecated features which were replaced by the dispatcher, file-uploading and file-storage refactoring introduced in the Django 1.0 alpha releases.
zh_hans: 一些特性和方法前面已经标记成淘汰的内容，而且在1.0版本发布时会被移除，在现在的Django版本中已经没有了。这些包括了导入库名 ``django.newforms`` (目前导入库名直接变成了 ``django.forms``)，而且 ``form_for_model`` 和 ``form_for_instance`` 辅助函数 (都被 ``ModelForm`` 所取代) 以及一些淘汰的特性都换成了调度器，文件上传和文件存储功能，在Django 1.0 alpha版本中进行的重构。

source: Known issues
id: Masalah yang diketahui
zh_hans: 已知问题

source: We've done our best to make Django 1.0 as solid as possible, but unfortunately there are a couple of issues that we know about in the release.
id: Kami telah melakukan terbaik kami untuk membuat Django 1.0 sekokoh mungkin, tetapi sayangnya ada sepasang masalah yang kami ketahui di terbitan.
zh_hans: 我们让 Django 1.0 尽可能成为稳固版本做了最好的工作，但不幸的是在发布后依然有一些问题。

source: Multi-table model inheritance with ``to_field``
id: Warisan model banyak-tabel dengan ``to_field``
zh_hans: 多表模型继承使用 ``to_field``

source: If you're using :ref:`multiple table model inheritance <multi-table-inheritance>`, be aware of this caveat: child models using a custom ``parent_link`` and ``to_field`` will cause database integrity errors. A set of models like the following are **not valid**::
id: Jika anda sedang menggunakan :ref:`multiple table model inheritance <multi-table-inheritance>`, sadarilah dari surat keberatan ini: model anak menggunakan penyesuaian ``parent_link`` dan ``to_field`` akan menyebabkan kesalahan kesatuan basisdata. Sekumpulan model seperti berikut adalah **tidak sah**::
zh_hans: 如果你正在使用 :ref:`多表模型继承 <multi-table-inheritance>` 的话，要知道一项警告：子模型在使用一个自定义 ``parent_link`` 和 ``to_field`` 的时候会导致数据库整合错误。一套模型可能会出现 **not valid**::

source: This bug will be fixed in the next release of Django.
id: Kesalahan ini akan diperbaiki di terbitan selanjutnya dari Django.
zh_hans: 这个漏洞将在 Django 的下一个版本中修复。

source: Caveats with support of certain databases
id: Peringatan dengan dukungan basisdata tertentu
zh_hans: 警告中含带某些数据库支持信息

source: Django attempts to support as many features as possible on all database backends. However, not all database backends are alike, and in particular many of the supported database differ greatly from version to version. It's a good idea to checkout our :doc:`notes on supported database </ref/databases>`:
id: Django berusaha mendukung sebanyak fitur yang mungkin pada semua backend basisdata. Bagaimanapun, tidak semua backend basisdata sama, dan dalam tertentu banyak dari basisdata didukung sangat beda dari versi ke versi. Itu adalah ide bagus untuk memeriksa :doc:`notes on supported database </ref/databases>` kami:
zh_hans: Django 尽可能支持所有数据库后端的特性。不管如何，不是所有的数据库后端都可能实现，并且在许多特殊的数据库支持上都是每个版本都有不同之处。有一个好的办法就是查阅文档 :doc:`所支持的数据库注意事项 </ref/databases>`：

source: Porting your apps from Django 0.96 to 1.0
id: Menghubungkan aplikasi anda dari Django 0.96 ke 1.0
zh_hans: 将你的应用从 Django 0.96 移植到 1.0

source: Django 1.0 breaks compatibility with 0.96 in some areas.
id: Django 1.0 memutus kesesuaian dengan 0.96 di beberapa kawasan.
zh_hans: Django 1.0 在某些地方与 0.96 版本是不兼容的。

source: This guide will help you port 0.96 projects and apps to 1.0. The first part of this document includes the common changes needed to run with 1.0. If after going through the first part your code still breaks, check the section `Less-common Changes`_ for a list of a bunch of less-common compatibility issues.
id: Panduan ini akan membantu anda menghubungkan proyek 0.96 dan apliaksi ke 1.0. Bagian pertama dari dokumen ini termasuk perubahan umum dibutuhkan untuk berjalan dengan 1.0. Jika setelah melalui bagian pertama kode anda masih rusak, periksa bagian `Less-common Changes`_ untuk daftar ikatan masalah kesesuaian yang kurang umum.
zh_hans: 这个指南会帮助你把 0.96 的项目和应用移植到 1.0 版本。本文档的第一部分包含了需要运行在 1.0上的常见变更。如果通过了第一部分的变更，你的代码依然无法运行，那么请检查 `Less-common Changes`_ 不常见的变更部分中列出的兼容问题。

source: The :doc:`1.0 release notes </releases/1.0>`. That document explains the new features in 1.0 more deeply; the porting guide is more concerned with helping you quickly update your code.
id: :doc:`1.0 release notes </releases/1.0>`. Dokumen itu menjelaskan fitur-fitur baru di 1.0 lebih dalam; panduan menghubungkan lebih diperhatikan dengan bantuan anda dengan cepat memperbaharui kode anda.
zh_hans: 文档 :doc:`1.0 版本注意事项 </releases/1.0>`。这份文档更深入地解释了 1.0 中新的特性；移植指南更多考虑了帮助你快速更新你的代码。

source: Common changes
id: Perubahan umum
zh_hans: 常见变更

source: This section describes the changes between 0.96 and 1.0 that most users will need to make.
id: Bagian ini menggambarkan perubahan diantara 0.96 dan 1.0 yang paling pengguna butuhkan untuk dibuat.
zh_hans: 本部分描述了 0.96 与 1.0 之间的变更，这些变更都是大部分用户会做的事情。

source: Use Unicode
id: Gunakan Unicode
zh_hans: 使用 Unicode 字符集

source: Change string literals (``'foo'``) into Unicode literals (``u'foo'``). Django now uses Unicode strings throughout. In most places, raw strings will continue to work, but updating to use Unicode literals will prevent some obscure problems.
id: Merubah harfiah deretan karakter (``'foo'``) menjadi harfiah Unicode (``u'foo'``). Django sekarang menggunakan deretan karakter Unicode seluruhnya. Di kebanyakan tempat, deretan karakter mentah akan lanjut bekerja, tetapi memperbaharui untuk menggunakan harfiah Unicode akan mencegah pengaburan beberapa masalah.
zh_hans: 逐字地把字符串 (``'foo'``) 变成 Unicode 字符串 (``u'foo'``)。Django 目前从始至终贯穿地使用 Unicode 字符集字符串。在绝大多数地方，生食字符串会继续有效，但更新成 Unicode 字符串会防止某些含糊的问题出现。

source: See :doc:`/ref/unicode` for full details.
id: Lihat :doc:`/ref/unicode` untuk rincian penuh.
zh_hans: 查阅 :doc:`/ref/unicode` 文档了解细节。

source: Models
id: Model
zh_hans: 模型

source: Common changes to your models file:
id: Perubahan umum ke berkas model anda:
zh_hans: 对于你的模型文件中常见的变更：

source: Rename ``maxlength`` to ``max_length``
id: Namai kembali ``maxlength`` ke ``max_length``
zh_hans: ``maxlength`` 重命名为 ``max_length``

source: Rename your ``maxlength`` argument to ``max_length`` (this was changed to be consistent with form fields):
id: Namai kembali argumen ``maxlength`` anda ke ``max_length`` (ini dirubah agar selaras dengan bidang-bidang formulir):
zh_hans: 把你的 ``maxlength`` 参数名变成 ``max_length`` (这次参数名的变更是为了与表单区域保持一致)：

source: Replace ``__str__`` with ``__unicode__``
id: Ganti ``__str__`` dengan ``__unicode__``
zh_hans: 用 ``__unicode__`` 代替 ``__str__``

source: Replace your model's ``__str__`` function with a ``__unicode__`` method, and make sure you `use Unicode`_ (``u'foo'``) in that method.
id: Ganti fungsi ``__str__`` model anda dengan metode ``__unicode__``, dan pastikan anda `use Unicode`_ (``u'foo'``) di metode itu.
zh_hans: 使用 ``__unicode__`` 方法替换你的模型中的 ``__str__`` 函数，然后才能确保你使用 `使用 Unicode 字符集`_ (``u'foo'``) 中所介绍的方法。

source: Remove ``prepopulated_from``
id: Pindahkan ``prepopulated_from``
zh_hans: 移除 ``prepopulated_from``

source: Remove the ``prepopulated_from`` argument on model fields. It's no longer valid and has been moved to the ``ModelAdmin`` class in ``admin.py``. See `the admin`_, below, for more details about changes to the admin.
id: Pindahkan argumen ``prepopulated_from`` pada bidang model. Itu tidak lagi sah dan telah dipindahkan ke kelas ``ModelAdmin`` di ``admin.py``. Lihat `the admin`_, dibawah ini, untuk rincian lebih tentang dirubah ke admin.
zh_hans: 删除模型区域中 ``prepopulated_from`` 参数。这个参数不再合法，而且已经转移到管理员 ``admin.py`` 模块里的 ``ModelAdmin`` 类中去了。查阅 `管理员`_ 内容了解更多对管理员变更的细节。

source: Remove ``core``
id: Pindahkan ``core``
zh_hans: 移除 ``core``

source: Remove the ``core`` argument from your model fields. It is no longer necessary, since the equivalent functionality (part of :ref:`inline editing <admin-inlines>`) is handled differently by the admin interface now. You don't have to worry about inline editing until you get to `the admin`_ section, below. For now, remove all references to ``core``.
id: Pindahkan argumen ``core`` dari bidang model anda. itu tidak lagi dibutuhkan, sejak kegunaan yang setara (bagian dari :ref:`inline editing <admin-inlines>`) ditangani dengan berbeda oleh antarmuka admin sekarang. Anda tidak harus khawatir tentang penyuntingan berderet sampai anda menuju bagian `the admin`_, dibawah. Untuk sekarang, pindahkan semua acuan ke ``core``.
zh_hans: 删除你的模型区域里的 ``core`` 参数。这个参数不再需要了，因为相同功能 (参考 :ref:`行内编辑 <admin-inlines>`) 目前已经由后台接口做出不同地处理。你不用再担心行内编辑，除非你在 `管理员`_ 部分才考虑行内编辑。目前，删除所有对 ``core`` 参数的指向。

source: Replace ``class Admin:`` with ``admin.py``
id: Ganti ``class Admin:`` dengan ``admin.py``
zh_hans: 用 ``admin.py`` 替换 ``class Admin:``

source: Remove all your inner ``class Admin`` declarations from your models. They won't break anything if you leave them, but they also won't do anything. To register apps with the admin you'll move those declarations to an ``admin.py`` file; see `the admin`_ below for more details.
id: Pindahkan semua pernyataan ``class Admin`` sebelah dalam dari model anda. Mereka tidak merusak apapun jika anda meninggalkan mereka, tetapi mereka juga tidak akan melakukan apapun. Untuk mendaftarkan aplikasi dengan admin anda akan pindahkan pernyataan itu ke berkas ``admin.py``; lihat `the admin`_ dibawah untuk lebih rinci.
zh_hans: 从你的模型里移除所有嵌入 ``class Admin`` 管理员类声明。如果你保留这种类的话，不会对任何有影响，但也不会起任何作用。要注册应用程序管理员，你要把这种类的声明移到 ``admin.py`` 管理员模块文件里；查看 `管理员`_ 内容了解更多细节。

source: A contributor to djangosnippets__ has written a script that'll `scan your models.py and generate a corresponding admin.py`__.
id: Seorang penyumbang pada djangosnippets__ telah menuli skembali sebuah tulisan yang akan `scan your models.py and generate a corresponding admin.py`__.
zh_hans: 对 djangosnippets__ 做出的贡献者已经写了一个脚本会 `扫描你的 models.py 模型模块后生成一个相应的 admin.py 管理员模块`__。

source: Example
id: Contoh
zh_hans: 例如

source: Below is an example ``models.py`` file with all the changes you'll need to make:
id: DIbawah ini adalah sebuah contoh berkas ``models.py`` dengan semua perubahan anda ingin buat:
zh_hans: 下面的一个例子 ``models.py`` 模型文件含有所有你需要做出的变更：

source: Old (0.96) ``models.py``::
id: Lama (0.96) ``models.py``::
zh_hans: 老版本 (0.96) ``models.py``::

source: New (1.0) ``models.py``::
id: Baru (1.0) ``models.py``::
zh_hans: 新版本 (1.0) ``models.py``::

source: New (1.0) ``admin.py``::
id: Baru (1.0) ``admin.py``::
zh_hans: 新版本 (1.0) ``admin.py`` 管理员模块：

source: The Admin
id: Admin
zh_hans: 管理员

source: One of the biggest changes in 1.0 is the new admin. The Django administrative interface (``django.contrib.admin``) has been completely refactored; admin definitions are now completely decoupled from model definitions, the framework has been rewritten to use Django's new form-handling library and redesigned with extensibility and customization in mind.
id: Satu dari perubahan terbesar di 1.0 adalah admin baru. Antarmuka administratif Django (``django.contrib.admin``) telah sepenuhnya di refaktor; pengertian admin sekarang sepenuhnya dipisahkan dari pengertian model, kerangka kerja telah ditulis kembali untuk menggunakan pustaka penanganan formulir baru Django dan dirancang kembali dengan perpanjangan dan penyesuaian dalam pikiran.
zh_hans: 在 1.0 版本中最具挑战性的新管理员功能问题之一。Django 管理接口 (``django.contrib.admin``) 管理员功能已经完全重构了；许多管理员定义目前都完全从许多模型定义中解构出来，许多框架都重写后使用 Django 的新表单处理库，而且重新设计成具有扩展和自定义能力。

source: Practically, this means you'll need to rewrite all of your ``class Admin`` declarations. You've already seen in `models`_ above how to replace your ``class Admin`` with an ``admin.site.register()`` call in an ``admin.py`` file. Below are some more details on how to rewrite that ``Admin`` declaration into the new syntax.
zh_hans: 实际中，意味着你要重写所有你的 ``class Admin`` 管理员类声明。你已经在上面的 `models`_ 中见过了如何替换你的 ``class Admin`` 管理员类，就是在 ``admin.py`` 管理员模块文件中用一个 ``admin.site.register()`` 管理员网页注册调用来替代。下面这些都是一些更详细的如何重写 ``Admin`` 管理员声明类的新句法。

source: Use new inline syntax
id: Gunakan sintaksis berderet yang baru
zh_hans: 使用新的行内句法

source: The new ``edit_inline`` options have all been moved to ``admin.py``. Here's an example:
id: Pilihan ``edit_inline`` baru semua telah dipindahkan ke ``admin.py``. Ini adalah contoh:
zh_hans: 新的 ``edit_inline`` 行内编辑选项都已经移到 ``admin.py`` 管理员模块中了。下面有一个例子：

source: Old (0.96)::
id: Lama (0.96)::
zh_hans: 老版本 (0.96)::

source: New (1.0)::
id: Baru (1.0)::
zh_hans: 新版本 (1.0)::

source: See :ref:`admin-inlines` for more details.
id: Lihat :ref:`admin-inlines` untuk rinci.
zh_hans: 查阅 :ref:`admin-inlines` 管理员行内文档了解更多细节。

source: Simplify ``fields``, or use ``fieldsets``
id: Sederhanakan ``fields``, atau gunakan ``fieldsets``
zh_hans: 简化 ``fields``，或使用 ``fieldsets``

source: The old ``fields`` syntax was quite confusing, and has been simplified. The old syntax still works, but you'll need to use ``fieldsets`` instead.
id: Sintaksis ``fields`` lama sangat membingungkan, dan telah disederhanakan. Sintaksis lama masih bekerja, tetapi anda akan butuh menggunakan ``fieldsets`` sebagai gantinya.
zh_hans: 老的 ``fields`` 句法是非常迷糊的，而且已经被简化过。老的句法依然有效，但你要使用 ``fieldsets`` 来代替老旧句法。

source: More detailed information about the changes and the reasons behind them can be found on the `NewformsAdminBranch wiki page`__
id: Informasi lebih rinci mengenai perubahan dan alasan dibelakang mereka dapat ditemukan pada `NewformsAdminBranch wiki page`__
zh_hans: 更多关于变更的详细信息以及背后的原因都可以在 `NewformsAdminBranch wiki page`__ 新表单管理分支维基百科页面找到

source: The new admin comes with a ton of new features; you can read about them in the :doc:`admin documentation </ref/contrib/admin/index>`.
id: Admin baru datang dengan satu ton fitur baru; anda dapat membaca tentang mereka di :doc:`admin documentation </ref/contrib/admin/index>`.
zh_hans: 新的管理员功能伴随着许多新特性；你可以在 :doc:`管理员文档 </ref/contrib/admin/index>` 中来阅读有关内容。

source: Update your root ``urls.py``
id: Perbaharui akar ``urls.py`` anda.
zh_hans: 更新你的根路径 ``urls.py`` 模块

source: If you're using the admin site, you need to update your root ``urls.py``.
id: Jika anda menggunakan situs admin, anda butuh memperbaharui akar ``urls.py`` anda.
zh_hans: 如果你正在使用后台界面，你需要更新你的根路径``urls.py`` 模块。

source: Old (0.96) ``urls.py``::
id: Lama (0.96) ``urls.py``::
zh_hans: 老版本 (0.96) ``urls.py``::

source: New (1.0) ``urls.py``::
id: Baru (1.0) ``urls.py``::
zh_hans: 新版本 (1.0) ``urls.py``::

source: Views
id: View
zh_hans: 视图

source: Use ``django.forms`` instead of ``newforms``
id: Gunakan ``django.forms`` sebagai gantinya ``newforms``
zh_hans: 使用 ``django.forms`` 来代替 ``newforms`` 用法

source: Replace ``django.newforms`` with ``django.forms`` -- Django 1.0 renamed the ``newforms`` module (introduced in 0.96) to plain old ``forms``. The ``oldforms`` module was also removed.
id: Ganti ``django.newforms`` dengan ``django.forms`` -- Django 1.0 dinamai kembali modul ``newforms`` (diperkenalkan di 0.96) untuk ``forms`` lama kosong. Modul ``oldforms`` juga dipindahkan.
zh_hans: 用 ``django.forms`` 来替换 ``django.newforms`` 用法 -- Django 1.0 版本重命名了 ``newforms`` 模块名 (曾用在 0.96 版本的名字) 采用以前用过的 ``forms`` 名字。而 ``oldforms`` 模块也会被移除。

source: If you're already using the ``newforms`` library, and you used our recommended ``import`` statement syntax, all you have to do is change your import statements.
id: Jika anda sudah menggunakan pustaka ``newforms``, dan anda menggunakan anjuran kami sintaksis pernyataan ``import``, semua anda harus lakukan adalah merubah pernyataan impor anda.
zh_hans: 如果你已经使用 ``newforms`` 库的话，而且你采用了我们所建议的 ``import`` 导入语句句法，那么所有你要做的就是改变一下你的导入依据即可。

source: Old::
id: Lama::
zh_hans: 老版本::

source: New::
id: Baru::
zh_hans: 新版本::

source: If you're using the old forms system (formerly known as ``django.forms`` and ``django.oldforms``), you'll have to rewrite your forms. A good place to start is the :doc:`forms documentation </topics/forms/index>`
id: Jika anda sedang menggunakan sistem formulir lama (dahulu dikenal sebagai ``django.forms`` dan ``django.oldforms``), anda akan harus menuli skembali formulir anda. Tempat bagus untuk memulai adalah :doc:`forms documentation </topics/forms/index>`
zh_hans: 如果你正在使用老的表单系统 (正规的名字是 ``django.forms`` 和 ``django.oldforms``)，那么你要重写你的表单。良好地开始就是从阅读 :doc:`表单文档 </topics/forms/index>` 内容

source: Handle uploaded files using the new API
id: Menangani berkas terunggah menggunakan API baru
zh_hans: 处理上传文件使用新的 API

source: Replace use of uploaded files -- that is, entries in ``request.FILES`` -- as simple dictionaries with the new :class:`~django.core.files.uploadedfile.UploadedFile`. The old dictionary syntax no longer works.
id: Rubah penggunaan berkas-berkas terunggah -- yaitu, masukan di ``request.FILES`` -- sebagai kamus sederhana dengan :class:`~django.core.files.uploadedfile.UploadedFile` baru. Sintaksis kamus lama tidak lagi bekerja.
zh_hans: 代替上传文件的用法 -- 那就是，采用 ``request.FILES`` 文件请求入口 -- 与含有 :class:`~django.core.files.uploadedfile.UploadedFile` 文件上传类的简单字典一样。老的字典句法不再有效了。

source: Thus, in a view like::
id: Jadi, dalam tampilan seperti::
zh_hans: 因此，看起来就像::

source: ...you'd need to make the following changes:
id: ...anda butuh membuat perubahan berikut:
zh_hans: ...你需要做出如下变更：

source: Old (0.96)
id: Lama (0.96)
zh_hans: 老版本 (0.96)

source: New (1.0)
id: Baru (1.0)
zh_hans: 新版本 (1.0)

source: Work with file fields using the new API
id: Bekerja dengan bidang berkas menggunakan API baru
zh_hans: 文件字段使用新API处理
