Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The ``django.contrib.auth.forms.ReadOnlyPasswordHashField`` form field is now :attr:`~django.forms.Field.disabled` by default. Therefore ``UserChangeForm.clean_password()`` is no longer required to return the initial value.
zh_hans: ``django.contrib.auth.forms.ReadOnlyPasswordHashField`` 表单字段现在默认为 :attr:`~django.forms.Field.disabled`。因此 ``UserChangeForm.clean_password()`` 不再需要返回初始值。

source: The ``cache.get_many()``, ``get_or_set()``, ``has_key()``, ``incr()``, ``decr()``, ``incr_version()``, and ``decr_version()`` cache operations now correctly handle ``None`` stored in the cache, in the same way as any other value, instead of behaving as though the key didn't exist.
zh_hans: ``cache.get_many()``、``get_or_set()``、``has_key()``、``incr()``、``decr()``、``incr_version()`` 和 ``decr_version()`` 的缓存操作现在可以正确处理缓存中的 ``None``，与其他值相同，而不是表现为键不存在。

source: Due to a ``python-memcached`` limitation, the previous behavior is kept for the deprecated ``MemcachedCache`` backend.
zh_hans: 由于 ``python-memcached`` 的限制，以前的行为被保留在已废弃的 ``MemcachedCache`` 后端。

source: The minimum supported version of SQLite is increased from 3.8.3 to 3.9.0.
zh_hans: SQLite 的最小支持版本从 3.8.3 增加到 3.9.0。

source: :class:`~django.contrib.messages.storage.cookie.CookieStorage` now stores messages in the :rfc:`6265` compliant format. Support for cookies that use the old format remains until Django 4.1.
zh_hans: :class:`~django.contrib.messages.storage.cookie.CookieStorage` 现在以 :rfc:`6265` 兼容的格式存储信息。对使用旧格式的 cookie 的支持仍然保留到 Django 4.1。

source: The minimum supported version of ``asgiref`` is increased from 3.2.10 to 3.3.2.
zh_hans: ``asgiref`` 的最小支持版本从 3.2.10 提高到 3.3.2。

source: Features deprecated in 3.2
zh_hans: 在 3.2 中被废弃的功能

source: Assigning objects which don't support creating deep copies with :py:func:`copy.deepcopy` to class attributes in :meth:`.TestCase.setUpTestData` is deprecated.
zh_hans: 在 :meth:`.TestCase.setUpTestData` 中，将不支持用 :py:func:`copy.deepcopy` 创建深度拷贝的对象分配给类属性的做法已被废弃。

source: Using a boolean value in :attr:`.BaseCommand.requires_system_checks` is deprecated. Use ``'__all__'`` instead of ``True``, and ``[]`` (an empty list) instead of ``False``.
zh_hans: 在 :attr:`.BaseCommand.requires_system_checks` 中使用一个布尔值已被废弃。使用 ``'__all__'`` 来代替 ``True``，使用 ``[]`` （一个空列表）来代替 ``False``。

source: The ``whitelist`` argument and ``domain_whitelist`` attribute of :class:`~django.core.validators.EmailValidator` are deprecated. Use ``allowlist`` instead of ``whitelist``, and ``domain_allowlist`` instead of ``domain_whitelist``. You may need to rename ``whitelist`` in existing migrations.
zh_hans: :class:`~django.core.validators.EmailValidator` 的 ``whitelist`` 参数和 ``domain_whitelist`` 属性已被废弃。使用 ``allowlist`` 代替 ``whitelist``，``domain_allowlist`` 代替 ``domain_whitelist``。你可能需要在现有的迁移中重命名 ``whitelist``。

source: The ``default_app_config`` application configuration variable is deprecated, due to the now automatic ``AppConfig`` discovery. See :ref:`whats-new-3.2` for more details.
zh_hans: ``default_app_config`` 应用程序配置变量已被废弃，因为现在自动发现了 ``AppConfig``。更多细节请参见 :ref:`whats-new-3.2`。

source: Automatically calling ``repr()`` on a queryset in ``TransactionTestCase.assertQuerysetEqual()``, when compared to string values, is deprecated. If you need the previous behavior, explicitly set ``transform`` to ``repr``.
zh_hans: 在 ``TransactionTestCase.assertQuerysetEqual()`` 中与字符串值比较时自动调用 ``repr()``，已被废弃。如果你需要以前的行为，明确设置 ``transform`` 为 ``repr``。

source: The ``django.core.cache.backends.memcached.MemcachedCache`` backend is deprecated as ``python-memcached`` has some problems and seems to be unmaintained. Use ``django.core.cache.backends.memcached.PyMemcacheCache`` or ``django.core.cache.backends.memcached.PyLibMCCache`` instead.
zh_hans: ``django.core.cache.backends.memcached.MemcachedCache`` 后端已被废弃，因为 ``python-memcached`` 有一些问题，而且似乎无人维护。使用 ``django.core.cache.backends.memcached.PyMemcacheCache`` 或 ``django.core.cache.backends.memcached.PyLibMCCache`` 代替。

source: The format of messages used by ``django.contrib.messages.storage.cookie.CookieStorage`` is different from the format generated by older versions of Django. Support for the old format remains until Django 4.1.
zh_hans: ``django.contrib.messages.storage.cookie.CookieStorage`` 使用的消息格式与旧版本的 Django 生成的格式不同。对旧格式的支持一直持续到 Django 4.1。

source: Django 3.2.1 release notes
zh_hans: Django 3.2.1 版本发行说明

source: Django 3.2.1 fixes a security issue and several bugs in 3.2.
zh_hans: Django 3.2.1 修复了 3.2 中的一个安全问题和几个漏洞。

source: Corrected detection of GDAL 3.2 on Windows (:ticket:`32544`).
zh_hans: 纠正了在 Windows 上对 GDAL 3.2 的检测（:ticket:`32544`）。

source: Fixed a bug in Django 3.2 where subclasses of ``BigAutoField`` and ``SmallAutoField`` were not allowed for the :setting:`DEFAULT_AUTO_FIELD` setting (:ticket:`32620`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，:setting:`DEFAULT_AUTO_FIELD` 配置无法使用 ``BigAutoField`` 和 ``SmallAutoField`` 的子类（:ticket:`32620`）。

source: Fixed a regression in Django 3.2 that caused a crash of ``QuerySet.values()/values_list()`` after ``QuerySet.union()``, ``intersection()``, and ``difference()`` when it was ordered by an unannotated field (:ticket:`32627`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当在 ``QuerySet.union()``、``intersection()`` 和 ``difference()`` 之后使用一个无注解字段进行排序的 ``QuerySet.values()/values_list()`` 会发生崩溃（:ticket:`32627`）。

source: Restored, following a regression in Django 3.2, displaying an exception message on the technical 404 debug page (:ticket:`32637`).
zh_hans: 恢复了，在 Django 3.2 中的缺陷，在技术 404 调试页面显示异常消息（:ticket:`32637`）。

source: Fixed a bug in Django 3.2 where a system check would crash on a reverse one-to-one relationships in ``CheckConstraint.check`` or ``UniqueConstraint.condition`` (:ticket:`32635`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即在 ``CheckConstraint.check`` 或 ``UniqueConstraint.condition`` 中反向查询一对一关系时，系统检查会崩溃（:ticket:`32635`）。

source: Fixed a regression in Django 3.2 that caused a crash of :attr:`.ModelAdmin.search_fields` when searching against phrases with unbalanced quotes (:ticket:`32649`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当搜索时带不平衡引号的短语时，会导致 :attr:`.ModelAdmin.search_fields` 崩溃（:ticket:`32649`）。

source: Fixed a bug in Django 3.2 where variable lookup errors were logged rendering the sitemap template if alternates were not defined (:ticket:`32648`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即如果没有定义候补变量，变量查找错误会被记录在站点地图模板上（:ticket:`32648`）。

source: Fixed a regression in Django 3.2 that caused a crash when combining ``Q()`` objects which contains boolean expressions (:ticket:`32548`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当组合包含布尔表达式（:ticket:`32548`）的 ``Q()`` 对象时导致崩溃的问题。

source: Fixed a regression in Django 3.2 that caused a crash of ``QuerySet.update()`` on a queryset ordered by inherited or joined fields on MySQL and MariaDB (:ticket:`32645`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷导致 ``QuerySet.update()`` 在 MySQL 和 MariaDB 按继承或连接字段排序的查询集上崩溃（:ticket:`32645`）。

source: Fixed a regression in Django 3.2 that caused a crash when decoding a cookie value, used by ``django.contrib.messages.storage.cookie.CookieStorage``, in the pre-Django 3.2 format (:ticket:`32643`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当解码由 ``django.contrib.messages.storage.CookieStorage`` 使用的 Django 3.2 之前格式的 cookie 值时，导致崩溃（:ticket:`32643`）。

source: Fixed a regression in Django 3.2 that stopped the shift-key modifier selecting multiple rows in the admin changelist (:ticket:`32647`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷使 shift 键修改器无法在管理更新列表中选择多行（:ticket:`32647`）。

source: Fixed a bug in Django 3.2 where a system check would crash on the :setting:`STATICFILES_DIRS` setting with a list of 2-tuples of ``(prefix, path)`` (:ticket:`32665`).
zh_hans: 修正了 Django 3.2 中的一个bug，即系统检查会在 :setting:`STATICFILES_DIRS` 配置中出现 ``(prefix, path)`` 的二元元组列表时崩溃（:ticket:`32665`）。

source: Fixed a long standing bug involving queryset bitwise combination when used with subqueries that began manifesting in Django 3.2, due to a separate fix using ``Exists`` to ``exclude()`` multi-valued relationships (:ticket:`32650`).
zh_hans: 修正了一个长期存在的漏洞，涉及到与子查询一起使用时的查询集按位组合，该漏洞在 Django 3.2 中开始出现，是由于一个使用 ``Exists`` 来 ``exclude()`` 多值关系的单独修正（:ticket:`32650`）。

source: Fixed a bug in Django 3.2 where variable lookup errors were logged when rendering some admin templates (:ticket:`32681`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即在渲染某些管理模板时记录了变量查询错误（:ticket:`32681`）。

source: Fixed a bug in Django 3.2 where an admin changelist would crash when deleting objects filtered against multi-valued relationships (:ticket:`32682`). The admin changelist now uses ``Exists()`` instead of ``QuerySet.distinct()`` because calling ``delete()`` after ``distinct()`` is not allowed in Django 3.2 to address a data loss possibility.
zh_hans: 在 Django 3.2 中修复了一个 bug，该 bug 导致在删除针对多值关系进行过滤的对象时，管理员 changelist 会崩溃 (:ticket:`32682`)。管理员 changelist 现在使用 ``Exists()`` 而不是 ``QuerySet.distinct()``，因为在 Django 3.2 中不允许在 ``distinct()`` 后调用 ``delete()``，以解决数据丢失的可能性。

source: Fixed a regression in Django 3.2 where the calling process environment would not be passed to the ``dbshell`` command on PostgreSQL (:ticket:`32687`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，即在 PostgreSQL 上调用进程环境不会被传递给 ``dbshell`` 命令（:ticket:`32687`）。

source: Fixed a performance regression in Django 3.2 when building complex filters with subqueries (:ticket:`32632`). As a side-effect the private API to check ``django.db.sql.query.Query`` equality is removed.
zh_hans: 修正了 Django 3.2 中使用子查询构建复杂过滤器时的性能缺陷（:ticket:`32632`）。作为一个副作用，删除了检查 ``django.db.sql.query.Query`` 相等的私有 API。

source: Django 3.2.10 release notes
zh_hans: Django 3.2.10 版本发行说明

source: Django 3.2.10 fixes a security issue with severity "low" and a bug in 3.2.9.
zh_hans: Django 3.2.10 修复了 3.2.9 版本中一个严重程度为"低"的安全问题和一个错误。

source: Fixed a regression in Django 3.2 that caused a crash of ``setUpTestData()`` with ``BinaryField`` on PostgreSQL, which is ``memoryview``-backed (:ticket:`33333`).
zh_hans: 修复了 Django 3.2 中的一个回归问题，该问题导致在 PostgreSQL 上使用 ``memoryview`` 支持的 ``BinaryField`` 时，``setUpTestData()`` 崩溃 (:ticket:`33333`)。

source: Django 3.2.11 release notes
zh_hans: Django 3.2.11 版本发行说明

source: Django 3.2.11 fixes one security issue with severity "medium" and two security issues with severity "low" in 3.2.10.
zh_hans: Django 3.2.11 修复了 3.2.10 版本中一个严重程度为"中"的安全问题和两个严重程度为"低"的安全问题。

source: Django 3.2.12 release notes
zh_hans: Django 3.2.12 版本发行说明

source: Django 3.2.12 fixes two security issues with severity "medium" in 3.2.11.
zh_hans: Django 3.2.12 修复了 3.2.11 版本中两个严重程度为"中"的安全问题。

source: Django 3.2.13 release notes
zh_hans: Django 3.2.13 版本发行说明

source: Django 3.2.13 fixes two security issues with severity "high" in 3.2.12 and a regression in 3.2.4.
zh_hans: Django 3.2.13 修复了 3.2.12 版本中两个严重程度为"高"的安全问题，以及 3.2.4 版本中的一个回归问题。

source: Fixed a regression in Django 3.2.4 that caused the auto-reloader to no longer detect changes when the ``DIRS`` option of the ``TEMPLATES`` setting contained an empty string (:ticket:`33628`).
zh_hans: 修复了 Django 3.2.4 中的一个回归问题，该问题导致当 ``TEMPLATES`` 设置的 ``DIRS`` 选项包含空字符串时，自动重新加载器不再检测到更改 (:ticket:`33628`)。

source: Django 3.2.14 release notes
zh_hans: Django 3.2.14 版本发行说明

source: *July 4, 2022*
zh_hans: *2022 年 7 月 4 日*

source: Django 3.2.14 fixes a security issue with severity "high" in 3.2.13.
zh_hans: Django 3.2.14 修复了 3.2.13 版本中一个严重程度为"高"的安全问题。

source: CVE-2022-34265: Potential SQL injection via ``Trunc(kind)`` and ``Extract(lookup_name)`` arguments
zh_hans: CVE-2022-34265: 通过 ``Trunc(kind)`` 和 ``Extract(lookup_name)`` 参数潜在的 SQL 注入漏洞

source: :class:`Trunc() <django.db.models.functions.Trunc>` and :class:`Extract() <django.db.models.functions.Extract>` database functions were subject to SQL injection if untrusted data was used as a ``kind``/``lookup_name`` value.
zh_hans: :class:`Trunc() <django.db.models.functions.Trunc>` 和 :class:`Extract() <django.db.models.functions.Extract>` 数据库函数在使用不受信任的数据作为 ``kind``/``lookup_name`` 值时可能受到 SQL 注入的影响。

source: Applications that constrain the lookup name and kind choice to a known safe list are unaffected.
zh_hans: 将约束查找名称和类型选择在已知安全列表中的应用程序不受影响。

source: Django 3.2.15 release notes
zh_hans: Django 3.2.15 版本发行说明

source: *August 3, 2022*
zh_hans: *2022 年 8 月 3 日*

source: Django 3.2.15 fixes a security issue with severity "high" in 3.2.14.
zh_hans: Django 3.2.15 修复了 3.2.14 版本中一个严重程度为"高"的安全问题。

source: CVE-2022-36359: Potential reflected file download vulnerability in ``FileResponse``
zh_hans: CVE-2022-36359: ``FileResponse`` 中的潜在反射文件下载漏洞

source: An application may have been vulnerable to a reflected file download (RFD) attack that sets the Content-Disposition header of a :class:`~django.http.FileResponse` when the ``filename`` was derived from user-supplied input. The ``filename`` is now escaped to avoid this possibility.
zh_hans: 一个应用程序可能对反射性文件下载（RFD）攻击存在漏洞，当 ``filename`` 是从用户提供的输入派生时，它会设置 :class:`~django.http.FileResponse` 的 Content-Disposition 标头。现在对 ``filename`` 进行了转义以避免这种可能性。

source: Django 3.2.16 release notes
zh_hans: Django 3.2.16 版本发行说明

source: *October 4, 2022*
zh_hans: *2022 年 10 月 4 日*

source: Django 3.2.16 fixes a security issue with severity "medium" in 3.2.15.
zh_hans: Django 3.2.16 修复了 3.2.15 版本中一个严重程度为"中"的安全问题。

source: CVE-2022-41323: Potential denial-of-service vulnerability in internationalized URLs
zh_hans: CVE-2022-41323 ：国际化 URL 中存在潜在的拒绝服务漏洞。

source: Internationalized URLs were subject to potential denial of service attack via the locale parameter.
zh_hans: 国际化 URL 可能通过 locale 参数受到拒绝服务攻击的威胁。

source: Django 3.2.17 release notes
zh_hans: Django 3.2.17 版本发行说明

source: *February 1, 2023*
zh_hans: *2023 年 2 月 1 日*

source: Django 3.2.17 fixes a security issue with severity "moderate" in 3.2.16.
zh_hans: Django 3.2.17 修复了 3.2.16 版本中一个严重程度为"中等"的安全问题。

source: CVE-2023-23969: Potential denial-of-service via ``Accept-Language`` headers
zh_hans: CVE-2023-23969: 通过 ``Accept-Language`` 标头的潜在拒绝服务漏洞

source: The parsed values of ``Accept-Language`` headers are cached in order to avoid repetitive parsing. This leads to a potential denial-of-service vector via excessive memory usage if large header values are sent.
zh_hans: 为了避免重复解析，``Accept-Language`` 标头的解析值被缓存起来。如果发送大型标头值，这可能导致潜在的拒绝服务攻击向量，因为会占用大量内存。

source: In order to avoid this vulnerability, the ``Accept-Language`` header is now parsed up to a maximum length.
zh_hans: 为了避免这个漏洞，现在对 ``Accept-Language`` 标头进行了最大长度限制的解析。

source: Django 3.2.18 release notes
zh_hans: Django 3.2.18 版本发行说明

source: *February 14, 2023*
zh_hans: *2023 年 2 月 14 日*

source: Django 3.2.18 fixes a security issue with severity "moderate" in 3.2.17.
zh_hans: Django 3.2.18 修复了 3.2.17 版本中一个严重程度为"中等"的安全问题。

source: CVE-2023-24580: Potential denial-of-service vulnerability in file uploads
zh_hans: CVE-2023-24580 ：文件上传中存在潜在的拒绝服务漏洞。

source: Passing certain inputs to multipart forms could result in too many open files or memory exhaustion, and provided a potential vector for a denial-of-service attack.
zh_hans: 向多部分表单传递特定输入可能导致过多的打开文件或内存耗尽，并为拒绝服务攻击提供了潜在的入口。

source: The number of files parts parsed is now limited via the new :setting:`DATA_UPLOAD_MAX_NUMBER_FILES` setting.
zh_hans: 现在通过新的 :setting:`DATA_UPLOAD_MAX_NUMBER_FILES` 设置来限制解析的文件部分数量。

source: Django 3.2.19 release notes
zh_hans: Django 3.2.19 版本发行说明

source: *May 3, 2023*
zh_hans: *2023 年 5 月 3 日*

source: Django 3.2.19 fixes a security issue with severity "low" in 3.2.18.
zh_hans: Django 3.2.19 修复了 3.2.18 版本中一个严重程度为"低"的安全问题。

source: CVE-2023-31047: Potential bypass of validation when uploading multiple files using one form field
zh_hans: CVE-2023-31047 ：通过使用一个表单字段上传多个文件时，存在绕过验证的潜在漏洞。

source: Uploading multiple files using one form field has never been supported by :class:`.forms.FileField` or :class:`.forms.ImageField` as only the last uploaded file was validated. Unfortunately, :ref:`uploading_multiple_files` topic suggested otherwise.
zh_hans: 使用一个表单字段上传多个文件从未得到 :class:`.forms.FileField` 或 :class:`.forms.ImageField` 的支持，因为只有最后上传的文件会被验证。不幸的是，:ref:`uploading_multiple_files` 主题提到了相反的情况。

source: In order to avoid the vulnerability, :class:`~django.forms.ClearableFileInput` and :class:`~django.forms.FileInput` form widgets now raise ``ValueError`` when the ``multiple`` HTML attribute is set on them. To prevent the exception and keep the old behavior, set ``allow_multiple_selected`` to ``True``.
zh_hans: 为了避免这个漏洞，现在当在 :class:`~django.forms.ClearableFileInput` 和 :class:`~django.forms.FileInput` 表单小部件上设置了 ``multiple`` HTML 属性时，它们会引发 ``ValueError``。为了防止异常并保持旧的行为，将 ``allow_multiple_selected`` 设置为 ``True``。

source: For more details on using the new attribute and handling of multiple files through a single field, see :ref:`uploading_multiple_files`.
zh_hans: 有关使用新属性以及通过单个字段处理多个文件的更多详细信息，请参阅 :ref:`uploading_multiple_files`。

source: Django 3.2.2 release notes
zh_hans: Django 3.2.2 版本发行说明

source: Django 3.2.2 fixes a security issue and a bug in 3.2.1.
zh_hans: Django 3.2.2 修复了 3.2.1 中的一个安全问题和一个漏洞。

source: Prevented, following a regression in Django 3.2.1, :djadmin:`makemigrations` from generating infinite migrations for a model with ``Meta.ordering`` contained ``OrderBy`` expressions (:ticket:`32714`).
zh_hans: 在 Django 3.2.1 版本中，防止了 :djadmin:`makemigrations` 对 ``Meta.order`` 包含 ``OrderBy`` 表达式的模型产生无限的迁移（:ticket:`32714`）。

source: Django 3.2.20 release notes
zh_hans: Django 3.2.20 版本发行说明

source: *July 3, 2023*
zh_hans: *2023 年 7 月 3 日*

source: Django 3.2.20 fixes a security issue with severity "moderate" in 3.2.19.
zh_hans: Django 3.2.20 修复了在 3.2.19 中的一个安全问题，安全级别为 "moderate"。

source: CVE-2023-36053: Potential regular expression denial of service vulnerability in ``EmailValidator``/``URLValidator``
zh_hans: CVE-2023-36053: ``EmailValidator``/``URLValidator`` 中潜在的正则表达式拒绝服务漏洞

source: ``EmailValidator`` and ``URLValidator`` were subject to potential regular expression denial of service attack via a very large number of domain name labels of emails and URLs.
zh_hans: ``EmailValidator`` 和 ``URLValidator`` 可能受到通过非常大数量的电子邮件和 URL 的域名标签发起的正则表达式拒绝服务攻击的影响。

source: Django 3.2.21 release notes
zh_hans: Django 3.2.21 版本发行说明

source: *September 4, 2023*
zh_hans: *2023 年 9 月 4 日*

source: Django 3.2.21 fixes a security issue with severity "moderate" in 3.2.20.
zh_hans: Django 3.2.21 修复了在 3.2.20 中的一个安全问题，安全级别为 "moderate"。

source: CVE-2023-41164: Potential denial of service vulnerability in ``django.utils.encoding.uri_to_iri()``
zh_hans: CVE-2023-41164: ``django.utils.encoding.uri_to_iri()`` 中的潜在拒绝服务漏洞

source: ``django.utils.encoding.uri_to_iri()`` was subject to potential denial of service attack via certain inputs with a very large number of Unicode characters.
zh_hans: ``django.utils.encoding.uri_to_iri()`` 可能受到通过带有大量 Unicode 字符的某些输入发起的拒绝服务攻击的影响。

source: Django 3.2.22 release notes
zh_hans: Django 3.2.22 版本发行说明

source: *October 4, 2023*
zh_hans: *2023 年 10 月 4 日*

source: Django 3.2.22 fixes a security issue with severity "moderate" in 3.2.21.
zh_hans: Django 3.2.22 修复了在 3.2.21 中的一个安全问题，安全级别为 "moderate"。

source: CVE-2023-43665: Denial-of-service possibility in ``django.utils.text.Truncator``
zh_hans: CVE-2023-43665: ``django.utils.text.Truncator`` 中的可能导致拒绝服务的漏洞

source: Following the fix for :cve:`2019-14232`, the regular expressions used in the implementation of ``django.utils.text.Truncator``'s ``chars()`` and ``words()`` methods (with ``html=True``) were revised and improved. However, these regular expressions still exhibited linear backtracking complexity, so when given a very long, potentially malformed HTML input, the evaluation would still be slow, leading to a potential denial of service vulnerability.
zh_hans: 在修复了 :cve:`2019-14232` 后，重新审查并改进了 ``django.utils.text.Truncator`` 的 ``chars()`` 和 ``words()`` 方法（使用 ``html=True``）中使用的正则表达式。但是，这些正则表达式仍然表现出线性回溯复杂性，因此如果输入一个非常长且可能格式不正确的 HTML 输入，评估仍然会很慢，从而导致潜在的拒绝服务漏洞。

source: The ``chars()`` and ``words()`` methods are used to implement the :tfilter:`truncatechars_html` and :tfilter:`truncatewords_html` template filters, which were thus also vulnerable.
zh_hans: ``chars()`` 和 ``words()`` 方法用于实现 :tfilter:`truncatechars_html` 和 :tfilter:`truncatewords_html` 模板过滤器，因此这些模板过滤器也存在漏洞。

source: The input processed by ``Truncator``, when operating in HTML mode, has been limited to the first five million characters in order to avoid potential performance and memory issues.
zh_hans: 为了避免潜在的性能和内存问题，当以 HTML 模式运行时，``Truncator`` 处理的输入已被限制为前五百万个字符。

source: Django 3.2.23 release notes
zh_hans: Django 3.2.23 版本发行说明

source: *November 1, 2023*
zh_hans: *2023 年 11 月 1 日*

source: Django 3.2.23 fixes a security issue with severity "moderate" in 3.2.22.
zh_hans: Django 3.2.23 修复了在 3.2.22 中的一个安全问题，安全级别为 "moderate"。

source: CVE-2023-46695: Potential denial of service vulnerability in ``UsernameField`` on Windows
zh_hans: CVE-2023-46695: ``UsernameField`` 在 Windows 上的潜在拒绝服务漏洞

source: The :func:`NFKC normalization <python:unicodedata.normalize>` is slow on Windows. As a consequence, ``django.contrib.auth.forms.UsernameField`` was subject to a potential denial of service attack via certain inputs with a very large number of Unicode characters.
zh_hans: 在 Windows 上，:func:`NFKC normalization <python:unicodedata.normalize>` 的速度较慢。因此，``django.contrib.auth.forms.UsernameField`` 可能会受到通过具有大量 Unicode 字符的某些输入发起的潜在拒绝服务攻击的影响。

source: In order to avoid the vulnerability, invalid values longer than ``UsernameField.max_length`` are no longer normalized, since they cannot pass validation anyway.
zh_hans: 为了避免这个漏洞，超过 ``UsernameField.max_length`` 长度的无效值不再进行规范化，因为它们无论如何都无法通过验证。

source: Django 3.2.24 release notes
zh_hans: Django 3.2.24 版本发行说明

source: *February 6, 2024*
zh_hans: *2024 年 2 月 6 日*

source: Django 3.2.24 fixes a security issue with severity "moderate" in 3.2.23.
zh_hans: Django 3.2.24 修复了在 3.2.23 中的一个安全问题，安全级别为 "moderate"。

source: CVE-2024-24680: Potential denial-of-service in ``intcomma`` template filter
zh_hans: CVE-2024-24680：``intcomma`` 模板过滤器中存在潜在的拒绝服务漏洞

source: The ``intcomma`` template filter was subject to a potential denial-of-service attack when used with very long strings.
zh_hans: 使用非常长的字符串时，``intcomma`` 模板过滤器存在潜在的拒绝服务攻击风险。

source: Django 3.2.25 release notes
zh_hans: Django 3.2.25 版本发行说明

source: *March 4, 2024*
zh_hans: *2024 年 3 月 4 日*

source: Django 3.2.25 fixes a security issue with severity "moderate" and a regression in 3.2.24.
zh_hans: Django 3.2.25 修复了一些"中等"严重性的安全问题，以及 3.2.24 版本中的一个错误。

source: CVE-2024-27351: Potential regular expression denial-of-service in ``django.utils.text.Truncator.words()``
zh_hans: CVE-2024-27351: ``django.utils.text.Truncator.words()`` 存在潜在的正则表达式拒绝服务漏洞

source: ``django.utils.text.Truncator.words()`` method (with ``html=True``) and :tfilter:`truncatewords_html` template filter were subject to a potential regular expression denial-of-service attack using a suitably crafted string (follow up to :cve:`2019-14232` and :cve:`2023-43665`).
zh_hans: ``django.utils.text.Truncator.words()`` 方法（使用 ``html=True``）和 :tfilter:`truncatewords_html` 模板过滤器可能受到潜在的正则表达式拒绝服务攻击，使用精心设计的字符串（对 :cve:`2019-14232` 和 :cve:`2023-43665` 的后续）。

source: Fixed a regression in Django 3.2.24 where ``intcomma`` template filter could return a leading comma for string representation of floats (:ticket:`35172`).
zh_hans: 修复了 Django 3.2.24 中的一个回归问题，即 ``intcomma`` 模板过滤器可能在浮点数的字符串表示中返回一个前导逗号（:ticket:`35172`）。

source: Django 3.2.3 release notes
zh_hans: Django 3.2.3 版本发行说明

source: Django 3.2.3 fixes several bugs in 3.2.2.
zh_hans: Django 3.2.3 修复了 3.2.2 中的几个漏洞。

source: Prepared for ``mysqlclient`` > 2.0.3 support (:ticket:`32732`).
zh_hans: 为 ``mysqlclient`` > 2.0.3 支持做准备（:ticket:`32732`）。

source: Fixed a regression in Django 3.2 that caused the incorrect filtering of querysets combined with the ``|`` operator (:ticket:`32717`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该问题导致对与 ``|`` 操作符结合的查询集进行了错误的过滤（:ticket:`32717`）。
