Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed a regression in Django 3.2.1 where saving ``FileField`` would raise a ``SuspiciousFileOperation`` even when a custom :attr:`~django.db.models.FileField.upload_to` returns a valid file path (:ticket:`32718`).
zh_hans: 修正了 Django 3.2.1 中的一个缺陷，即保存 ``FileField`` 会引发 ``SuspiciousFileOperation``，即使自定义 :attr:`~django.db.models.FileField.upload_to` 返回了有效的文件路径（:ticket:`32718`）。

source: Django 3.2.4 release notes
zh_hans: Django 3.2.4 版本发行说明

source: Django 3.2.4 fixes two security issues and several bugs in 3.2.3.
zh_hans: Django 3.2.4 修复了 3.2.3 中的两个安全问题和几个漏洞。

source: Fixed a bug in Django 3.2 where a final catch-all view in the admin didn't respect the server-provided value of ``SCRIPT_NAME`` when redirecting unauthenticated users to the login page (:ticket:`32754`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，当把未认证的用户重定向到登录页面时，管理中的最终全局视图没有尊重服务器提供的 ``SCRIPT_NAME`` 的值（:ticket:`32754`）。

source: Fixed a bug in Django 3.2 where a system check would crash on an abstract model (:ticket:`32733`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即系统检查会在抽象模型上崩溃（:ticket:`32733`）。

source: Prevented unnecessary initialization of unused caches following a regression in Django 3.2 (:ticket:`32747`).
zh_hans: 防止 Django 3.2 中不必要地初始化未使用缓存的缺陷（:ticket:`32747`）。

source: Fixed a crash in Django 3.2 that could occur when running ``mod_wsgi`` with the recommended settings while the Windows ``colorama`` library was installed (:ticket:`32740`).
zh_hans: 修正了 Django 3.2 中的一个崩溃问题，在安装了 Windows ``colorama`` 库的情况下，以推荐的设置运行 ``mod_wsgi`` 时，可能会发生崩溃（:ticket:`32740`）。

source: Fixed a bug in Django 3.2 that would trigger the auto-reloader for template changes when directory paths were specified with strings (:ticket:`32744`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，当目录路径用字符串指定时，会触发模板变化的自动重载程序（:ticket:`32744`）。

source: Fixed a regression in Django 3.2 that caused a crash of auto-reloader with ``AttributeError``, e.g. inside a ``Conda`` environment (:ticket:`32783`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷导致自动加载器在出现 ``AttributeError`` 时崩溃，例如在 ``Conda`` 环境中（:ticket:`32783`）。

source: Fixed a regression in Django 3.2 that caused a loss of precision for operations with ``DecimalField`` on MySQL (:ticket:`32793`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷导致在 MySQL 上使用 ``DecimalField`` 进行操作时的精度损失（:ticket:`32793`）。

source: Django 3.2.5 release notes
zh_hans: Django 3.2.5 版本发行说明

source: Django 3.2.5 fixes a security issue with severity "high" and several bugs in 3.2.4. Also, the latest string translations from Transifex are incorporated.
zh_hans: Django 3.2.5 修复了一个严重程度为 “高” 的安全问题和 3.2.4 中的几个漏洞。此外，还加入了 Transifex 的最新字符串翻译。

source: Fixed a regression in Django 3.2 that caused a crash of ``QuerySet.values_list(…, named=True)`` after ``prefetch_related()`` (:ticket:`32812`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷导致 ``QuerySet.values_list(..., named=True)`` 在 ``prefetch_related()`` 之后崩溃（:ticket:`32812`）。

source: Fixed a bug in Django 3.2 that caused a migration crash on MySQL 8.0.13+ when altering ``BinaryField``, ``JSONField``, or ``TextField`` to non-nullable (:ticket:`32503`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，在 MySQL 8.0.13 以上版本中，将 ``BinaryField``、``JSONField`` 或 ``TextField`` 改为非空值时，会造成迁移崩溃（:ticket:`32503`）。

source: Fixed a regression in Django 3.2 that caused a migration crash on MySQL 8.0.13+ when adding nullable ``BinaryField``, ``JSONField``, or ``TextField`` with a default value (:ticket:`32832`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，在 MySQL 8.0.13 以上版本中，当添加默认值为空的 ``BinaryField``、``JSONField`` 或 ``TextField`` 时，会导致迁移崩溃（:ticket:`32832`）。

source: Fixed a bug in Django 3.2 where a system check would crash on a model with an invalid ``app_label`` (:ticket:`32863`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即系统检查会在模型上出现无效的 ``app_label`` 时崩溃（:ticket:`32863`）。

source: Django 3.2.6 release notes
zh_hans: Django 3.2.6 版本发行说明

source: *August 2, 2021*
zh_hans: *2021 年 8 月 2 日*

source: Django 3.2.6 fixes several bugs in 3.2.5.
zh_hans: Django 3.2.6 修复了 3.2.5 中的几个漏洞。

source: Fixed a regression in Django 3.2 that caused a crash validating ``"NaN"`` input with a ``forms.DecimalField`` when additional constraints, e.g. ``max_value``, were specified (:ticket:`32949`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当指定了额外的约束条件，如 ``max_value`` 时，在验证输入 ``"NaN"`` 的 ``forms.DecimalField`` 时，会出现崩溃（:ticket:`32949`）。

source: Fixed a bug in Django 3.2 where a system check would crash on a model with a reverse many-to-many relation inherited from a parent class (:ticket:`32947`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，即系统检查会在一个具有从父类继承的反向多对多关系的模型上崩溃（:ticket:`32947`）。

source: Django 3.2.7 release notes
zh_hans: Django 3.2.7 版本发行说明

source: *September 1, 2021*
zh_hans: *2021 年 9 月 1 日*

source: Django 3.2.7 fixes a bug in 3.2.6.
zh_hans: Django 3.2.7 修复了 3.2.6 中的几个漏洞。

source: Fixed a regression in Django 3.2 that caused the incorrect offset extraction from fixed offset timezones (:ticket:`32992`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，该缺陷导致从固定偏移的时区提取不正确的偏移量（:ticket:`32992`）。

source: Django 3.2.8 release notes
zh_hans: Django 3.2.8 版本发行说明

source: *October 5, 2021*
zh_hans: *2021 年 10 月 5 日*

source: Django 3.2.8 fixes two bugs in 3.2.7.
zh_hans: Django 3.2.8 修复了 3.2.7 的两个漏洞。

source: Fixed a bug in Django 3.2 that caused incorrect links on read-only fields in the admin (:ticket:`33077`).
zh_hans: 修正了 Django 3.2 中的一个漏洞，该漏洞导致管理中只读字段的链接不正确（:ticket:`33077`）。

source: Fixed a regression in Django 3.2 that caused incorrect selection of items across all pages when actions were placed both on the top and bottom of the admin change-list view (:ticket:`33083`).
zh_hans: 修正了 Django 3.2 中的一个缺陷，当动作同时放置在管理变更列表视图的顶部和底部时，会导致所有页面的项目选择不正确（:ticket:`33083`）。

source: Django 3.2.9 release notes
zh_hans: Django 3.2.9 版本发行说明

source: *November 1, 2021*
zh_hans: *2021 年 11 月 1 日*

source: Django 3.2.9 fixes a bug in 3.2.8 and adds compatibility with Python 3.10.
zh_hans: Django 3.2.9 修复了 3.2.8 版本中的一个错误，并添加了对 Python 3.10 的兼容性。

source: Fixed a bug in Django 3.2 that caused a migration crash on SQLite when altering a field with a functional index (:ticket:`33194`).
zh_hans: 修复了 Django 3.2 中的一个 bug，该 bug 导致在 SQLite 上修改具有函数索引的字段时发生迁移崩溃 (:ticket:`33194`)。

source: Django 4.0 release notes
zh_hans: Django 4.0 版本发行说明

source: Welcome to Django 4.0!
zh_hans: 欢迎使用 Django 4.0 ！

source: These release notes cover the :ref:`new features <whats-new-4.0>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-4.0>` you'll want to be aware of when upgrading from Django 3.2 or earlier. We've :ref:`begun the deprecation process for some features <deprecated-features-4.0>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-4.0>`，以及从 Django 3.2 或更早版本升级时需要注意的一些 :ref:`不向后兼容的变更 <backwards-incompatible-4.0>`。我们已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-4.0>`。

source: Django 4.0 supports Python 3.8, 3.9, and 3.10. We **highly recommend** and only officially support the latest release of each series.
zh_hans: Django 4.0 支持 Python 3.8、3.9 和 3.10。我们 **强烈建议** 并只官方支持每个系列的最新版本。

source: The Django 3.2.x series is the last to support Python 3.6 and 3.7.
zh_hans: Django 3.2.x 系列是最后一个支持 Python 3.6 和 3.7 的版本。

source: What's new in Django 4.0
zh_hans: Django 4.0 新特性

source: ``zoneinfo`` default timezone implementation
zh_hans: ``zoneinfo`` 默认时区实现

source: The Python standard library's :mod:`zoneinfo` is now the default timezone implementation in Django.
zh_hans: Python 标准库的 :mod:`zoneinfo` 现在是 Django 中默认的时区实现。

source: This is the next step in the migration from using ``pytz`` to using :mod:`zoneinfo`. Django 3.2 allowed the use of non-``pytz`` time zones. Django 4.0 makes ``zoneinfo`` the default implementation. Support for ``pytz`` is now deprecated and will be removed in Django 5.0.
zh_hans: 这是从使用 ``pytz`` 到使用 :mod:`zoneinfo` 迁移的下一步。Django 3.2 允许使用非 ``pytz`` 时区。Django 4.0 将 ``zoneinfo`` 作为默认实现。对于 ``pytz`` 的支持现在已经不推荐使用，并将在 Django 5.0 中移除。

source: :mod:`zoneinfo` is part of the Python standard library from Python 3.9. The ``backports.zoneinfo`` package is automatically installed alongside Django if you are using Python 3.8.
zh_hans: :mod:`zoneinfo` 是自 Python 3.9 起的 Python 标准库的一部分。如果你正在使用 Python 3.8，那么 ``backports.zoneinfo`` 包会在安装 Django 时自动安装。

source: The move to ``zoneinfo`` should be largely transparent. Selection of the current timezone, conversion of datetime instances to the current timezone in forms and templates, as well as operations on aware datetimes in UTC are unaffected.
zh_hans: 迁移到 ``zoneinfo`` 应该在很大程度上是透明的。选择当前时区、在表单和模板中将日期时间实例转换为当前时区，以及在 UTC 中进行的带时区日期时间的操作都不受影响。

source: However, if you are working with non-UTC time zones, and using the ``pytz`` ``normalize()`` and ``localize()`` APIs, possibly with the :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` setting, you will need to audit your code, since ``pytz`` and ``zoneinfo`` are not entirely equivalent.
zh_hans: 然而，如果你正在使用非 UTC 时区，并使用 ``pytz`` 的 ``normalize()`` 和 ``localize()`` API，可能还涉及到 :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` 设置，那么你需要审查你的代码，因为``pytz`` 和 ``zoneinfo`` 并不完全等同。

source: To give time for such an audit, the transitional ``USE_DEPRECATED_PYTZ`` setting allows continued use of ``pytz`` during the 4.x release cycle. This setting will be removed in Django 5.0.
zh_hans: 为了给这样的审核留出时间，过渡性的 ``USE_DEPRECATED_PYTZ`` 设置允许在 4.x 发布周期内继续使用 ``pytz``。这个设置将在 Django 5.0 中移除。

source: In addition, a `pytz_deprecation_shim`_ package, created by the ``zoneinfo`` author, can be used to assist with the migration from ``pytz``. This package provides shims to help you safely remove ``pytz``, and has a detailed `migration guide`_ showing how to move to the new ``zoneinfo`` APIs.
zh_hans: 此外，``zoneinfo`` 的作者创建了一个名为 `pytz_deprecation_shim`_ 的包，可用于协助从 ``pytz`` 迁移。这个包提供了帮助你安全移除 ``pytz`` 的 shims，并有一个详细的 `迁移指南`_，展示了如何切换到新的 ``zoneinfo`` API。

source: Using `pytz_deprecation_shim`_ and the ``USE_DEPRECATED_PYTZ`` transitional setting is recommended if you need a gradual update path.
zh_hans: 如果需要逐步更新路径，建议使用 `pytz_deprecation_shim`_ 和过渡性的 ``USE_DEPRECATED_PYTZ`` 设置。

source: Functional unique constraints
zh_hans: 函数式唯一约束

source: The new :attr:`*expressions <django.db.models.UniqueConstraint.expressions>` positional argument of :class:`UniqueConstraint() <django.db.models.UniqueConstraint>` enables creating functional unique constraints on expressions and database functions. For example::
zh_hans: :class:`UniqueConstraint() <django.db.models.UniqueConstraint>` 的新的 :attr:`*expressions <django.db.models.UniqueConstraint.expressions>` 位置参数允许在表达式和数据库函数上创建功能性的唯一约束。例如：

source: Functional unique constraints are added to models using the :attr:`Meta.constraints <django.db.models.Options.constraints>` option.
zh_hans: 功能性唯一约束是通过在模型中使用 :attr:`Meta.constraints <django.db.models.Options.constraints>` 选项来添加的。

source: ``scrypt`` password hasher
zh_hans: ``scrypt`` 密码哈希器

source: The new :ref:`scrypt password hasher <scrypt-usage>` is more secure and recommended over PBKDF2. However, it's not the default as it requires OpenSSL 1.1+ and more memory.
zh_hans: 新的 :ref:`scrypt 密码哈希器 <scrypt-usage>` 更安全，推荐使用，但它不是默认选项，因为它需要 OpenSSL 1.1+ 和更多内存。

source: Redis cache backend
zh_hans: Redis 缓存后端

source: The new ``django.core.cache.backends.redis.RedisCache`` cache backend provides built-in support for caching with Redis. :pypi:`redis-py <redis>` 3.0.0 or higher is required. For more details, see the :ref:`documentation on caching with Redis in Django <redis>`.
zh_hans: 新的 ``django.core.cache.backends.redis.RedisCache`` 缓存后端提供了内置的支持，用于使用 Redis 进行缓存。需要 :pypi:`redis-py <redis>` 的版本为 3.0.0 或更高。更多详情请参阅 Django 中关于使用 Redis 进行缓存的 :ref:`文档 <redis>`。

source: Template based form rendering
zh_hans: 基于模板的表单渲染

source: :class:`Forms <django.forms.Form>`, :doc:`Formsets </topics/forms/formsets>`, and :class:`~django.forms.ErrorList` are now rendered using the template engine to enhance customization. See the new :meth:`~django.forms.Form.render`, :meth:`~django.forms.Form.get_context`, and :attr:`~django.forms.Form.template_name` for ``Form`` and :ref:`formset rendering <formset-rendering>` for ``Formset``.
zh_hans: :class:`Forms <django.forms.Form>`、:doc:`Formsets </topics/forms/formsets>` 和 :class:`~django.forms.ErrorList` 现在使用模板引擎进行渲染，以增强自定义功能。查看 ``Form`` 的新方法 :meth:`~django.forms.Form.render`、:meth:`~django.forms.Form.get_context` 和 :attr:`~django.forms.Form.template_name`，以及关于 ``Formset`` 的 :ref:`formset 渲染 <formset-rendering>`。

source: The ``admin/base.html`` template now has a new block ``header`` which contains the admin site header.
zh_hans: ``admin/base.html`` 模板现在有一个新的块 ``header``，其中包含了管理站点的标题。

source: The new :meth:`.ModelAdmin.get_formset_kwargs` method allows customizing the keyword arguments passed to the constructor of a formset.
zh_hans: 新的 :meth:`.ModelAdmin.get_formset_kwargs` 方法允许自定义传递给表单集构造函数的关键字参数。

source: The navigation sidebar now has a quick filter toolbar.
zh_hans: 导航侧边栏现在有一个快速筛选工具栏。

source: The new context variable ``model`` which contains the model class for each model is added to the :meth:`.AdminSite.each_context` method.
zh_hans: 新的上下文变量 ``model`` 包含了每个模型的模型类，已添加到 :meth:`.AdminSite.each_context` 方法中。

source: The new :attr:`.ModelAdmin.search_help_text` attribute allows specifying a descriptive text for the search box.
zh_hans: 新的 :attr:`.ModelAdmin.search_help_text` 属性允许指定搜索框的描述性文本。

source: The :attr:`.InlineModelAdmin.verbose_name_plural` attribute now fallbacks to the :attr:`.InlineModelAdmin.verbose_name` + ``'s'``.
zh_hans: :attr:`.InlineModelAdmin.verbose_name_plural` 属性现在会回退到 :attr:`.InlineModelAdmin.verbose_name` + ``'s'``。

source: jQuery is upgraded from version 3.5.1 to 3.6.0.
zh_hans: jQuery 从版本 3.5.1 升级到 3.6.0 。

source: The admindocs now allows esoteric setups where :setting:`ROOT_URLCONF` is not a string.
zh_hans: admindocs 现在允许复杂的设置，其中 :setting:`ROOT_URLCONF` 不是一个字符串。

source: The model section of the ``admindocs`` now shows cached properties.
zh_hans: ``admindocs`` 的模型部分现在显示缓存的属性。

source: The default iteration count for the PBKDF2 password hasher is increased from 260,000 to 320,000.
zh_hans: PBKDF2 密码哈希器的默认迭代次数从 260 , 000 增加到 320 , 000 。

source: The new :attr:`LoginView.next_page <django.contrib.auth.views.LoginView.next_page>` attribute and :meth:`~django.contrib.auth.views.LoginView.get_default_redirect_url` method allow customizing the redirect after login.
zh_hans: 新的 :attr:`LoginView.next_page <django.contrib.auth.views.LoginView.next_page>` 属性和 :meth:`~django.contrib.auth.views.LoginView.get_default_redirect_url` 方法允许自定义登录后的重定向。

source: Added support for SpatiaLite 5.
zh_hans: 新增对 SpatiaLite 5 的支持。

source: :class:`~django.contrib.gis.gdal.GDALRaster` now allows creating rasters in any GDAL virtual filesystem.
zh_hans: :class:`~django.contrib.gis.gdal.GDALRaster` 现在允许在任何 GDAL 虚拟文件系统中创建栅格数据。

source: The new :class:`~django.contrib.gis.admin.GISModelAdmin` class allows customizing the widget used for ``GeometryField``. This is encouraged instead of deprecated ``GeoModelAdmin`` and ``OSMGeoAdmin``.
zh_hans: 新的 :class:`~django.contrib.gis.admin.GISModelAdmin` 类允许自定义用于 ``GeometryField`` 的小部件，这是鼓励使用的，而不是不推荐使用的 ``GeoModelAdmin`` 和 ``OSMGeoAdmin``。

source: The PostgreSQL backend now supports connecting by a service name. See :ref:`postgresql-connection-settings` for more details.
zh_hans: PostgreSQL 后端现在支持通过服务名称进行连接。更多详情请参阅 :ref:`postgresql-connection-settings`。

source: The new :class:`~django.contrib.postgres.operations.AddConstraintNotValid` operation allows creating check constraints on PostgreSQL without verifying that all existing rows satisfy the new constraint.
zh_hans: 新的 :class:`~django.contrib.postgres.operations.AddConstraintNotValid` 操作允许在 PostgreSQL 上创建检查约束，而无需验证所有现有行是否满足新约束。

source: The new :class:`~django.contrib.postgres.operations.ValidateConstraint` operation allows validating check constraints which were created using :class:`~django.contrib.postgres.operations.AddConstraintNotValid` on PostgreSQL.
zh_hans: 新的 :class:`~django.contrib.postgres.operations.ValidateConstraint` 操作允许验证在 PostgreSQL 上使用 :class:`~django.contrib.postgres.operations.AddConstraintNotValid` 创建的检查约束。

source: The new :class:`ArraySubquery() <django.contrib.postgres.expressions.ArraySubquery>` expression allows using subqueries to construct lists of values on PostgreSQL.
zh_hans: 新的 :class:`ArraySubquery() <django.contrib.postgres.expressions.ArraySubquery>` 表达式允许在 PostgreSQL 上使用子查询来构建值列表。

source: The new :lookup:`trigram_word_similar` lookup, and the :class:`TrigramWordDistance() <django.contrib.postgres.search.TrigramWordDistance>` and :class:`TrigramWordSimilarity() <django.contrib.postgres.search.TrigramWordSimilarity>` expressions allow using trigram word similarity.
zh_hans: 新的 :lookup:`trigram_word_similar` 查找以及 :class:`TrigramWordDistance() <django.contrib.postgres.search.TrigramWordDistance>` 和 :class:`TrigramWordSimilarity() <django.contrib.postgres.search.TrigramWordSimilarity>` 表达式允许使用 trigram 单词相似度。

source: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` now replaces paths to JavaScript source map references with their hashed counterparts.
zh_hans: :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 现在会将 JavaScript 源映射引用的路径替换为它们的哈希版本。

source: The new ``manifest_storage`` argument of :class:`~django.contrib.staticfiles.storage.ManifestFilesMixin` and :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` allows customizing the manifest file storage.
zh_hans: :class:`~django.contrib.staticfiles.storage.ManifestFilesMixin` 和 :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` 的新参数 ``manifest_storage`` 允许自定义清单文件的存储。

source: The new async API for ``django.core.cache.backends.base.BaseCache`` begins the process of making cache backends async-compatible. The new async methods all have ``a`` prefixed names, e.g. ``aadd()``, ``aget()``, ``aset()``, ``aget_or_set()``, or ``adelete_many()``.
zh_hans: ``django.core.cache.backends.base.BaseCache`` 的新异步 API 开始了使缓存后端支持异步的过程。新的异步方法都有 ``a`` 前缀的名称，例如 ``aadd()``、``aget()``、``aset()``、``aget_or_set()`` 或 ``adelete_many()``。

source: Going forward, the ``a`` prefix will be used for async variants of methods generally.
zh_hans: 今后，``a`` 前缀将用于一般方法的异步变体。

source: CSRF protection now consults the ``Origin`` header, if present. To facilitate this, :ref:`some changes <csrf-trusted-origins-changes-4.0>` to the :setting:`CSRF_TRUSTED_ORIGINS` setting are required.
zh_hans: CSRF 保护现在会查看是否存在 ``Origin`` 标头。为了实现这一点，需要对 :setting:`CSRF_TRUSTED_ORIGINS` 设置进行 :ref:`一些更改 <csrf-trusted-origins-changes-4.0>`。

source: :class:`~django.forms.ModelChoiceField` now includes the provided value in the ``params`` argument of a raised :exc:`~django.core.exceptions.ValidationError` for the ``invalid_choice`` error message. This allows custom error messages to use the ``%(value)s`` placeholder.
zh_hans: :class:`~django.forms.ModelChoiceField` 现在会在引发 ``invalid_choice`` 错误消息的 :exc:`~django.core.exceptions.ValidationError` 中的 ``params`` 参数中包含提供的值，这允许自定义错误消息使用 ``%(value)s`` 占位符。

source: :class:`~django.forms.formsets.BaseFormSet` now renders non-form errors with an additional class of ``nonform`` to help distinguish them from form-specific errors.
zh_hans: :class:`~django.forms.formsets.BaseFormSet` 现在会在渲染非表单错误时添加一个额外的类 ``nonform``，以帮助区分它们与特定于表单的错误。

source: :class:`~django.forms.formsets.BaseFormSet` now allows customizing the widget used when deleting forms via :attr:`~django.forms.formsets.BaseFormSet.can_delete` by setting the :attr:`~django.forms.formsets.BaseFormSet.deletion_widget` attribute or overriding :meth:`~django.forms.formsets.BaseFormSet.get_deletion_widget` method.
zh_hans: :class:`~django.forms.formsets.BaseFormSet` 现在允许通过设置 :attr:`~django.forms.formsets.BaseFormSet.deletion_widget` 属性或覆盖 :meth:`~django.forms.formsets.BaseFormSet.get_deletion_widget` 方法来自定义在通过 :attr:`~django.forms.formsets.BaseFormSet.can_delete` 删除表单时使用的小部件。

source: Added support and translations for the Malay language.
zh_hans: 添加了对马来语的支持和翻译。

source: :class:`~django.views.generic.edit.DeleteView` now uses :class:`~django.views.generic.edit.FormMixin`, allowing you to provide a :class:`~django.forms.Form` subclass, with a checkbox for example, to confirm deletion. In addition, this allows ``DeleteView`` to function with :class:`django.contrib.messages.views.SuccessMessageMixin`.
zh_hans: :class:`~django.views.generic.edit.DeleteView` 现在使用 :class:`~django.views.generic.edit.FormMixin`，允许你提供一个 :class:`~django.forms.Form` 的子类，例如带有复选框的表单，来确认删除。此外，这还允许 ``DeleteView`` 与 :class:`django.contrib.messages.views.SuccessMessageMixin` 配合使用。

source: In accordance with ``FormMixin``, object deletion for POST requests is handled in ``form_valid()``. Custom delete logic in ``delete()`` handlers should be moved to ``form_valid()``, or a shared helper method, as needed.
zh_hans: 根据 ``FormMixin``，对于 POST 请求的对象删除是在 ``form_valid()`` 中处理的。如果需要，应将 ``delete()`` 处理程序中的自定义删除逻辑移动到 ``form_valid()`` 或共享的辅助方法中。

source: The alias of the database used in an SQL call is now passed as extra context along with each message to the :ref:`django-db-logger` logger.
zh_hans: 现在，用于 SQL 调用的数据库的别名会作为额外的上下文与每条消息一起传递到 :ref:`django-db-logger` 记录器中。

source: The :djadmin:`runserver` management command now supports the :option:`--skip-checks` option.
zh_hans: :djadmin:`runserver` 管理命令现在支持 :option:`--skip-checks` 选项。

source: On PostgreSQL, :djadmin:`dbshell` now supports specifying a password file.
zh_hans: 在 PostgreSQL 上，:djadmin:`dbshell` 现在支持指定密码文件。

source: The :djadmin:`shell` command now respects :py:data:`sys.__interactivehook__` at startup. This allows loading shell history between interactive sessions. As a consequence, ``readline`` is no longer loaded if running in *isolated* mode.
zh_hans: :djadmin:`shell` 命令现在在启动时会尊重 :py:data:`sys.__interactivehook__`。这允许在交互式会话之间加载 shell 历史记录。因此，在 *隔离* 模式下运行时不再加载 ``readline``。

source: The new :attr:`BaseCommand.suppressed_base_arguments <django.core.management.BaseCommand.suppressed_base_arguments>` attribute allows suppressing unsupported default command options in the help output.
zh_hans: 新的 :attr:`BaseCommand.suppressed_base_arguments <django.core.management.BaseCommand.suppressed_base_arguments>` 属性允许在帮助输出中抑制不支持的默认命令选项。

source: The new :option:`startapp --exclude` and :option:`startproject --exclude` options allow excluding directories from the template.
zh_hans: 新的 :option:`startapp --exclude` 和 :option:`startproject --exclude` 选项允许从模板中排除目录。

source: New :meth:`QuerySet.contains(obj) <.QuerySet.contains>` method returns whether the queryset contains the given object. This tries to perform the query in the simplest and fastest way possible.
zh_hans: 新的 :meth:`QuerySet.contains(obj) <.QuerySet.contains>` 方法返回查询集是否包含给定对象。它尝试以最简单和最快的方式执行查询。

source: The new ``precision`` argument of the :class:`Round() <django.db.models.functions.Round>` database function allows specifying the number of decimal places after rounding.
zh_hans: :class:`Round() <django.db.models.functions.Round>` 数据库函数的新 ``precision`` 参数允许指定舍入后的小数位数。

source: :meth:`.QuerySet.bulk_create` now sets the primary key on objects when using SQLite 3.35+.
zh_hans: 使用 SQLite 3.35+ 时，:meth:`.QuerySet.bulk_create` 现在会为对象设置主键。

source: :class:`~django.db.models.DurationField` now supports multiplying and dividing by scalar values on SQLite.
zh_hans: :class:`~django.db.models.DurationField` 现在在 SQLite 上支持乘法和除法以及标量值。

source: :meth:`.QuerySet.bulk_update` now returns the number of objects updated.
zh_hans: :meth:`.QuerySet.bulk_update` 现在会返回更新的对象数量。

source: The new :attr:`.Expression.empty_result_set_value` attribute allows specifying a value to return when the function is used over an empty result set.
zh_hans: 新的 :attr:`.Expression.empty_result_set_value` 属性允许在函数用于空结果集时指定要返回的值。

source: The ``skip_locked`` argument of :meth:`.QuerySet.select_for_update()` is now allowed on MariaDB 10.6+.
zh_hans: 在 MariaDB 10.6+ 上，现在允许使用 :meth:`.QuerySet.select_for_update()` 的 ``skip_locked`` 参数。
