Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 1.5 :commit:`(patch) <985434fb1d6bf2335bf96c6ebf91c3674f1f399f>`
zh_hans: Django 1.5 :commit:`（补丁） <985434fb1d6bf2335bf96c6ebf91c3674f1f399f>`

source: Django 1.6 :commit:`(patch) <5f0829a27e85d89ad8c433f5c6a7a7d17c9e9292>`
zh_hans: Django 1.6 :commit:`（补丁） <5f0829a27e85d89ad8c433f5c6a7a7d17c9e9292>`

source: Django 1.7 :commit:`(patch) <34526c2f56b863c2103655a0893ac801667e86ea>`
zh_hans: Django 1.7 :commit:`（补丁） <34526c2f56b863c2103655a0893ac801667e86ea>`

source: April 21, 2014 - :cve:`2014-0473`
id: 21 April 2014 - :cve:`2014-0473`
zh_hans: 2014 年 4 月 21 日 - :cve:`2014-0473`

source: Caching of anonymous pages could reveal CSRF token. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
id: Cache dari halaman anonim dapat mengungkap token CSRF. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
zh_hans: 匿名页面的缓存可能会显示 CSRF 令牌。`完整描述 <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__

source: Django 1.4 :commit:`(patch) <1170f285ddd6a94a65f911a27788ba49ca08c0b0>`
zh_hans: Django 1.4 :commit:`（补丁） <1170f285ddd6a94a65f911a27788ba49ca08c0b0>`

source: Django 1.5 :commit:`(patch) <6872f42757d7ef6a97e0b6ec5db4d2615d8a2bd8>`
zh_hans: Django 1.5 :commit:`（补丁） <6872f42757d7ef6a97e0b6ec5db4d2615d8a2bd8>`

source: Django 1.6 :commit:`(patch) <d63e20942f3024f24cb8cd85a49461ba8a9b6736>`
zh_hans: Django 1.6 :commit:`（补丁） <d63e20942f3024f24cb8cd85a49461ba8a9b6736>`

source: Django 1.7 :commit:`(patch) <380545bf85cbf17fc698d136815b7691f8d023ca>`
zh_hans: Django 1.7 :commit:`（补丁） <380545bf85cbf17fc698d136815b7691f8d023ca>`

source: April 21, 2014 - :cve:`2014-0472`
id: 21 April 2014 - :cve:`2014-0472`
zh_hans: 2014 年 4 月 21 日 - :cve:`2014-0472`

source: Unexpected code execution using ``reverse()``. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
id: Pengerjaan kode tidak diharapkan menggunakan ``reverse()``. `Full description <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__
zh_hans: 使用 ``reverse()`` 导致意外的代码执行。`完整描述 <https://www.djangoproject.com/weblog/2014/apr/21/security/>`__

source: Django 1.4 :commit:`(patch) <c1a8c420fe4b27fb2caf5e46d23b5712fc0ac535>`
zh_hans: Django 1.4 :commit:`（补丁） <c1a8c420fe4b27fb2caf5e46d23b5712fc0ac535>`

source: Django 1.5 :commit:`(patch) <2a5bcb69f42b84464b24b5c835dca6467b6aa7f1>`
zh_hans: Django 1.5 :commit:`（补丁） <2a5bcb69f42b84464b24b5c835dca6467b6aa7f1>`

source: Django 1.6 :commit:`(patch) <4352a50871e239ebcdf64eee6f0b88e714015c1b>`
zh_hans: Django 1.6 :commit:`（补丁） <4352a50871e239ebcdf64eee6f0b88e714015c1b>`

source: Django 1.7 :commit:`(patch) <546740544d7f69254a67b06a3fc7fa0c43512958>`
zh_hans: Django 1.7 :commit:`（补丁） <546740544d7f69254a67b06a3fc7fa0c43512958>`

source: September 14, 2013 - :cve:`2013-1443`
id: 14 September 2013 - :cve:`2013-1443`
zh_hans: 2013 年 9 月 14 日 - :cve:`2013-1443`

source: Denial-of-service via large passwords. `Full description <https://www.djangoproject.com/weblog/2013/sep/15/security/>`__
id: Denial-of-service melalui sandi besar. `Full description <https://www.djangoproject.com/weblog/2013/sep/15/security/>`__
zh_hans: 通过大型密码进行拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2013/sep/15/security/>`__

source: Django 1.4 :commit:`(patch <3f3d887a6844ec2db743fee64c9e53e04d39a368>` and :commit:`Python compatibility fix) <6903d1690a92aa040adfb0c8eb37cf62e4206714>`
zh_hans: Django 1.4 :commit:`（补丁 <3f3d887a6844ec2db743fee64c9e53e04d39a368>` 和 :commit:`Python 兼容性修复） <6903d1690a92aa040adfb0c8eb37cf62e4206714>`

source: Django 1.5 :commit:`(patch) <22b74fa09d7ccbc8c52270d648a0da7f3f0fa2bc>`
zh_hans: Django 1.5 :commit:`（补丁） <22b74fa09d7ccbc8c52270d648a0da7f3f0fa2bc>`

source: September 10, 2013 - :cve:`2013-4315`
id: 10 September 2013 - :cve:`2013-4315`
zh_hans: 2013 年 9 月 10 日 - :cve:`2013-4315`

source: Directory-traversal via ``ssi`` template tag. `Full description <https://www.djangoproject.com/weblog/2013/sep/10/security-releases-issued/>`__
id: Lintasan-direktori melalui etiket cetakan ``ssi``. `Full description <https://www.djangoproject.com/weblog/2013/sep/10/security-releases-issued/>`__
zh_hans: 通过 ``ssi`` 模板标签进行目录遍历。`完整描述 <https://www.djangoproject.com/weblog/2013/sep/10/security-releases-issued/>`__

source: Django 1.4 :commit:`(patch) <87d2750b39f6f2d54b7047225521a44dcd37e896>`
zh_hans: Django 1.4 :commit:`（补丁） <87d2750b39f6f2d54b7047225521a44dcd37e896>`

source: Django 1.5 :commit:`(patch) <988b61c550d798f9a66d17ee0511fb7a9a7f33ca>`
zh_hans: Django 1.5 :commit:`（补丁） <988b61c550d798f9a66d17ee0511fb7a9a7f33ca>`

source: August 13, 2013 - :cve:`2013-6044`
id: 13 Agustus 2013 - :cve:`2013-6044`
zh_hans: 2013 年 8 月 13 日 - :cve:`2013-6044`

source: Possible XSS via unvalidated URL redirect schemes. `Full description <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__
id: Kemungkinan XSS melalui skema pengalihan URL tidak disahkan. `Full description <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__
zh_hans: 可能通过未经验证的 URL 重定向方案进行跨站脚本（XSS）攻击。`完整描述 <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__

source: Django 1.4 :commit:`(patch) <ec67af0bd609c412b76eaa4cc89968a2a8e5ad6a>`
zh_hans: Django 1.4 :commit:`（补丁） <ec67af0bd609c412b76eaa4cc89968a2a8e5ad6a>`

source: Django 1.5 :commit:`(patch) <1a274ccd6bc1afbdac80344c9b6e5810c1162b5f>`
zh_hans: Django 1.5 :commit:`（补丁） <1a274ccd6bc1afbdac80344c9b6e5810c1162b5f>`

source: August 13, 2013 - :cve:`2013-4249`
id: 13 Agustus 2013 - :cve:`2013-4249`
zh_hans: 2013 年 8 月 13 日 - :cve:`2013-4249`

source: XSS via admin trusting ``URLField`` values. `Full description <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__
id: XSS melalui nilai-nilai ``URLField`` dipercaya admin. `Full description <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__
zh_hans: 通过管理员信任的 ``URLField`` 值进行跨站脚本（XSS）攻击。`完整描述 <https://www.djangoproject.com/weblog/2013/aug/13/security-releases-issued/>`__

source: Django 1.5 :commit:`(patch) <90363e388c61874add3f3557ee654a996ec75d78>`
zh_hans: Django 1.5 :commit:`（补丁） <90363e388c61874add3f3557ee654a996ec75d78>`

source: February 19, 2013 - :cve:`2013-0306`
id: 19 Februari 2013 - :cve:`2013-0306`
zh_hans: 2013 年 1 月 19 日 - :cve:`2013-0306`

source: Denial-of-service via formset ``max_num`` bypass. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
id: Denial-of-service melalui memotong ``max_num`` formset. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
zh_hans: 通过 formset 的 ``max_num`` 绕过进行拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__

source: Django 1.3 :commit:`(patch) <d7094bbce8cb838f3b40f504f198c098ff1cf727>`
zh_hans: Django 1.3 :commit:`（补丁） <d7094bbce8cb838f3b40f504f198c098ff1cf727>`

source: Django 1.4 :commit:`(patch) <0cc350a896f70ace18280410eb616a9197d862b0>`
zh_hans: Django 1.4 :commit:`（补丁） <0cc350a896f70ace18280410eb616a9197d862b0>`

source: February 19, 2013 - :cve:`2013-0305`
id: 19 Februari 2013 - :cve:`2013-0305`
zh_hans: 2013 年 1 月 19 日 - :cve:`2013-0305`

source: Information leakage via admin history log. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
id: Kebocoran informasi melalui catatan riwayat admin. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
zh_hans: 通过管理员历史记录日志泄露信息。`完整描述 <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__

source: Django 1.3 :commit:`(patch) <d3a45e10c8ac8268899999129daa27652ec0da35>`
zh_hans: Django 1.3 :commit:`（补丁） <d3a45e10c8ac8268899999129daa27652ec0da35>`

source: Django 1.4 :commit:`(patch) <0e7861aec73702f7933ce2a93056f7983939f0d6>`
zh_hans: Django 1.4 :commit:`（补丁） <0e7861aec73702f7933ce2a93056f7983939f0d6>`

source: February 19, 2013 - :cve:`2013-1664` / :cve:`2013-1665`
id: 19 Februari 2013 - :cve:`2013-1664` / :cve:`2013-1665`
zh_hans: 2013 年 1 月 19 日 - :cve:`2013-1664` / :cve:`2013-1665`

source: Entity-based attacks against Python XML libraries. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
id: Serangan berdasarkan-masukan terhadap pustaka XML Python. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
zh_hans: 针对 Python XML 库的实体攻击。`完整描述 <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__

source: Django 1.3 :commit:`(patch) <d19a27066b2247102e65412aa66917aff0091112>`
zh_hans: Django 1.3 :commit:`（补丁） <d19a27066b2247102e65412aa66917aff0091112>`

source: Django 1.4 :commit:`(patch) <1c60d07ba23e0350351c278ad28d0bd5aa410b40>`
zh_hans: Django 1.4 :commit:`（补丁） <1c60d07ba23e0350351c278ad28d0bd5aa410b40>`

source: February 19, 2013 - No CVE
id: Februari 19, 2013 - No CVE
zh_hans: 2013 年 2 月 19 日 - 无 CVE

source: Additional hardening of ``Host`` header handling. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
id: Tambahan pengerasan dari penanganan kepala ``Host``. `Full description <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__
zh_hans: 对 ``Host`` 头处理的额外加固。`完整描述 <https://www.djangoproject.com/weblog/2013/feb/19/security/>`__

source: Django 1.3 :commit:`(patch) <27cd872e6e36a81d0bb6f5b8765a1705fecfc253>`
zh_hans: Django 1.3 :commit:`（补丁） <27cd872e6e36a81d0bb6f5b8765a1705fecfc253>`

source: Django 1.4 :commit:`(patch) <9936fdb11d0bbf0bd242f259bfb97bbf849d16f8>`
zh_hans: Django 1.4 :commit:`（补丁） <9936fdb11d0bbf0bd242f259bfb97bbf849d16f8>`

source: December 10, 2012 - No CVE 2
id: Desember 10, 2012 - No CVE 2
zh_hans: 2012 年 12 月 10 日 - 无 CVE 2

source: Additional hardening of redirect validation. `Full description <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__
id: Tambahan pengerasan dari pengalihan pengesahan. `Full description <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__
zh_hans: 对重定向验证的额外加固。`完整描述 <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__

source: Django 1.3: :commit:`(patch) <1515eb46daa0897ba5ad5f0a2db8969255f1b343>`
zh_hans: Django 1.3: :commit:`（补丁） <1515eb46daa0897ba5ad5f0a2db8969255f1b343>`

source: Django 1.4: :commit:`(patch) <b2ae0a63aeec741f1e51bac9a95a27fd635f9652>`
zh_hans: Django 1.4: :commit:`（补丁） <b2ae0a63aeec741f1e51bac9a95a27fd635f9652>`

source: December 10, 2012 - No CVE 1
id: Desember 10, 2012 - No CVE 1
zh_hans: 2012 年 12 月 10 日 - 无 CVE 1

source: Additional hardening of ``Host`` header handling. `Full description <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__
id: Tambahan pengerasan dari penanganan kepala ``Host``. `Full description <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__
zh_hans: 对 ``Host`` 头处理的额外加固。`完整描述 <https://www.djangoproject.com/weblog/2012/dec/10/security/>`__

source: Django 1.3 :commit:`(patch) <2da4ace0bc1bc1d79bf43b368cb857f6f0cd6b1b>`
zh_hans: Django 1.3 :commit:`（补丁） <2da4ace0bc1bc1d79bf43b368cb857f6f0cd6b1b>`

source: Django 1.4 :commit:`(patch) <319627c184e71ae267d6b7f000e293168c7b6e09>`
zh_hans: Django 1.4 :commit:`（补丁） <319627c184e71ae267d6b7f000e293168c7b6e09>`

source: October 17, 2012 - :cve:`2012-4520`
id: 17 Oktober 2012 - :cve:`2012-4520`
zh_hans: 2012 年 10 月 17 日 - :cve:`2012-4520`

source: ``Host`` header poisoning. `Full description <https://www.djangoproject.com/weblog/2012/oct/17/security/>`__
id: Peracunan kepala ``Host``. `Full description <https://www.djangoproject.com/weblog/2012/oct/17/security/>`__
zh_hans: ``Host`` 头部污染。`完整描述 <https://www.djangoproject.com/weblog/2012/oct/17/security/>`__

source: Django 1.3 :commit:`(patch) <b45c377f8f488955e0c7069cad3f3dd21910b071>`
zh_hans: Django 1.3 :commit:`（补丁） <b45c377f8f488955e0c7069cad3f3dd21910b071>`

source: Django 1.4 :commit:`(patch) <92d3430f12171f16f566c9050c40feefb830a4a3>`
zh_hans: Django 1.4 :commit:`（补丁） <92d3430f12171f16f566c9050c40feefb830a4a3>`

source: July 30, 2012 - :cve:`2012-3444`
id: 30 Juli 2012 - :cve:`2012-3444`
zh_hans: 2012 年 7 月 30 日 - :cve:`2012-3444`

source: Denial-of-service via large image files. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
id: Denial-of-service melalui berkas-berkas gambar. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
zh_hans: 通过大型图像文件进行拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__

source: Django 1.3 :commit:`(patch) <9ca0ff6268eeff92d0d0ac2c315d4b6a8e229155>`
zh_hans: Django 1.3 :commit:`（补丁） <9ca0ff6268eeff92d0d0ac2c315d4b6a8e229155>`

source: Django 1.4 :commit:`(patch) <da33d67181b53fe6cc737ac1220153814a1509f6>`
zh_hans: Django 1.4 :commit:`（补丁） <da33d67181b53fe6cc737ac1220153814a1509f6>`

source: July 30, 2012 - :cve:`2012-3443`
id: 30 Juli 2012 - :cve:`2012-3443`
zh_hans: 2012 年 7 月 30 日 - :cve:`2012-3443`

source: Denial-of-service via compressed image files. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
id: Denial-of-service melalui berkas-berkas gambar termampatkan. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
zh_hans: 通过压缩的图像文件进行拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__

source: Django 1.3: :commit:`(patch) <b2eb4787a0fff9c9993b78be5c698e85108f3446>`
zh_hans: Django 1.3: :commit:`（补丁） <b2eb4787a0fff9c9993b78be5c698e85108f3446>`

source: Django 1.4: :commit:`(patch) <c14f325c4eef628bc7bfd8873c3a72aeb0219141>`
zh_hans: Django 1.4: :commit:`（补丁） <c14f325c4eef628bc7bfd8873c3a72aeb0219141>`

source: July 30, 2012 - :cve:`2012-3442`
id: 30 Juli 2012 - :cve:`2012-3442`
zh_hans: 2012 年 7 月 30 日 - :cve:`2012-3442`

source: XSS via failure to validate redirect scheme. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
id: XSS melalui kegagalan untuk mensahkan skema pengalihan. `Full description <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__
zh_hans: 通过未能验证重定向方案进行跨站脚本（XSS）攻击。`完整描述 <https://www.djangoproject.com/weblog/2012/jul/30/security-releases-issued/>`__

source: Django 1.3: :commit:`(patch) <4dea4883e6c50d75f215a6b9bcbd95273f57c72d>`
zh_hans: Django 1.3: :commit:`（补丁） <4dea4883e6c50d75f215a6b9bcbd95273f57c72d>`

source: Django 1.4: :commit:`(patch) <e34685034b60be1112160e76091e5aee60149fa1>`
zh_hans: Django 1.4: :commit:`（补丁） <e34685034b60be1112160e76091e5aee60149fa1>`

source: September 9, 2011 - :cve:`2011-4140`
id: 9 September 2011 - :cve:`2011-4140`
zh_hans: 2011 年 9 月 9 日 - :cve:`2011-4140`

source: Potential CSRF via ``Host`` header. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
id: Kemungkinan CSRF melalui kepala ``Host``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
zh_hans: 潜在的 CSRF（跨站请求伪造）攻击通过 ``Host`` 头部。`完整描述 <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__

source: This notification was an advisory only, so no patches were issued.
id: Pemberitahuan ini hanya saran, jadi tidak ada tambalan diterbitkan.
zh_hans: 此通知仅为提醒，因此没有发布补丁。

source: September 9, 2011 - :cve:`2011-4139`
id: 9 September 2011 - :cve:`2011-4139`
zh_hans: 2011 年9月9日 - :cve:`2011-4139`

source: ``Host`` header cache poisoning. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
id: Peracunan cache kepala ``Host``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
zh_hans: ``Host`` 头部缓存污染。`完整描述 <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__

source: Django 1.2 :commit:`(patch) <c613af4d6485586c79d692b70a9acac429f3ca9d>`
zh_hans: Django 1.2 :commit:`（补丁） <c613af4d6485586c79d692b70a9acac429f3ca9d>`

source: Django 1.3 :commit:`(patch) <2f7fadc38efa58ac0a8f93f936b82332a199f396>`
zh_hans: Django 1.3 :commit:`（补丁） <2f7fadc38efa58ac0a8f93f936b82332a199f396>`

source: September 9, 2011 - :cve:`2011-4138`
id: 9 September 2011 - :cve:`2011-4138`
zh_hans: 2011 年9月9日 - :cve:`2011-4138`

source: Information leakage/arbitrary request issuance via ``URLField.verify_exists``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
id: Pengeluaran permintaan kebocoran/berubah-ubah informasi melalui ``URLField.verify_exists``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
zh_hans: 通过 ``URLField.verify_exists`` 存在信息泄露/任意请求发出。`完整描述 <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__

source: Django 1.2: :commit:`(patch) <7268f8af86186518821d775c530d5558fd726930>`
zh_hans: Django 1.2: :commit:`（补丁） <7268f8af86186518821d775c530d5558fd726930>`

source: Django 1.3: :commit:`(patch) <1a76dbefdfc60e2d5954c0ba614c3d054ba9c3f0>`
zh_hans: Django 1.3: :commit:`（补丁） <1a76dbefdfc60e2d5954c0ba614c3d054ba9c3f0>`

source: September 9, 2011 - :cve:`2011-4137`
id: 9 September 2011 - :cve:`2011-4137`
zh_hans: 2011 年 9 月 9 日 - :cve:`2011-4137`

source: Denial-of-service via ``URLField.verify_exists``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
id: Denial-of-service melalui ``URLField.verify_exists``. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
zh_hans: 通过 ``URLField.verify_exists`` 进行拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__

source: Django 1.2 :commit:`(patch) <7268f8af86186518821d775c530d5558fd726930>`
zh_hans: Django 1.2 :commit:`（补丁） <7268f8af86186518821d775c530d5558fd726930>`

source: Django 1.3 :commit:`(patch) <1a76dbefdfc60e2d5954c0ba614c3d054ba9c3f0>`
zh_hans: Django 1.3 :commit:`（补丁） <1a76dbefdfc60e2d5954c0ba614c3d054ba9c3f0>`

source: September 9, 2011 - :cve:`2011-4136`
id: 9 September 2011 - :cve:`2011-4136`
zh_hans: 2011 年9月9日 - :cve:`2011-4136`

source: Session manipulation when using memory-cache-backed session. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
id: Manipulasi sesi ketika menggunakan sesi backend-cache-memori. `Full description <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__
zh_hans: 在使用内存缓存支持的会话时进行会话操纵。`完整描述 <https://www.djangoproject.com/weblog/2011/sep/09/security-releases-issued/>`__

source: Django 1.2 :commit:`(patch) <ac7c3a110f906e4dfed3a17451bf7fd9fcb81296>`
zh_hans: Django 1.2 :commit:`（补丁） <ac7c3a110f906e4dfed3a17451bf7fd9fcb81296>`

source: Django 1.3 :commit:`(patch) <fbe2eead2fa9d808658ca582241bcacb02618840>`
zh_hans: Django 1.3 :commit:`（补丁） <fbe2eead2fa9d808658ca582241bcacb02618840>`

source: February 8, 2011 - :cve:`2011-0698`
id: 8 Februari 2011 - :cve:`2011-0698`
zh_hans: 2011 年 2 月 8 日 - :cve:`2011-0698`

source: Directory-traversal on Windows via incorrect path-separator handling. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
id: Lintasan-direktori pada Windows melalui penanganan pemisah-jalur tidak benar. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
zh_hans: 通过不正确的路径分隔符处理在 Windows 上进行目录遍历。`完整描述 <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__

source: Django 1.1 :commit:`(patch) <570a32a047ea56265646217264b0d3dab1a14dbd>`
zh_hans: Django 1.1 :commit:`（补丁） <570a32a047ea56265646217264b0d3dab1a14dbd>`

source: Django 1.2 :commit:`(patch) <194566480b15cf4e294d3f03ff587019b74044b2>`
zh_hans: Django 1.2 :commit:`（补丁） <194566480b15cf4e294d3f03ff587019b74044b2>`

source: February 8, 2011 - :cve:`2011-0697`
id: 8 Februari 2011 - :cve:`2011-0697`
zh_hans: 2011 年 2 月 8 日 - :cve:`2011-0697`

source: XSS via unsanitized names of uploaded files. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
id: XSS melalui nama-nama tidak dibersihkan dari berkas-berkas terunggah. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
zh_hans: 通过未经过滤的上传文件的名称进行跨站脚本（XSS）攻击。`完整描述 <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__

source: Django 1.1 :commit:`(patch) <1966786d2dde73e17f39cf340eb33fcb5d73904e>`
zh_hans: Django 1.1 :commit:`（补丁） <1966786d2dde73e17f39cf340eb33fcb5d73904e>`

source: Django 1.2 :commit:`(patch) <1f814a9547842dcfabdae09573055984af9d3fab>`
zh_hans: Django 1.2 :commit:`（补丁） <1f814a9547842dcfabdae09573055984af9d3fab>`

source: February 8, 2011 - :cve:`2011-0696`
id: 8 Februari 2011 - :cve:`2011-0696`
zh_hans: 2011 年 2 月 8 日 - :cve:`2011-0696`

source: CSRF via forged HTTP headers. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
id: CSRF melalui kepala HTTP yang ditempa. `Full description <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__
zh_hans: 通过伪造的 HTTP 头部进行 CSRF 攻击。`完整描述 <https://www.djangoproject.com/weblog/2011/feb/08/security/>`__

source: Django 1.1 :commit:`(patch) <408c5c873ce1437c7eee9544ff279ecbad7e150a>`
zh_hans: Django 1.1 :commit:`（补丁） <408c5c873ce1437c7eee9544ff279ecbad7e150a>`

source: Django 1.2 :commit:`(patch) <818e70344e7193f6ebc73c82ed574e6ce3c91afc>`
zh_hans: Django 1.2 :commit:`（补丁） <818e70344e7193f6ebc73c82ed574e6ce3c91afc>`

source: December 22, 2010 - :cve:`2010-4535`
id: 22 Desember 2010 - :cve:`2010-4535`
zh_hans: 2010 年 12 月 22 日 - :cve:`2010-4535`

source: Denial-of-service in password-reset mechanism. `Full description <https://www.djangoproject.com/weblog/2010/dec/22/security/>`__
id: Denial-of-service di mekanisme setel kembali-sandi. `Full description <https://www.djangoproject.com/weblog/2010/dec/22/security/>`__
zh_hans: 在密码重置机制中的拒绝服务攻击。`完整描述 <https://www.djangoproject.com/weblog/2010/dec/22/security/>`__

source: Django 1.1 :commit:`(patch) <7f8dd9cbac074389af8d8fd235bf2cb657227b9a>`
zh_hans: Django 1.1 :commit:`（补丁） <7f8dd9cbac074389af8d8fd235bf2cb657227b9a>`

source: Django 1.2 :commit:`(patch) <d5d8942a160685c403d381a279e72e09de5489a9>`
zh_hans: Django 1.2 :commit:`（补丁） <d5d8942a160685c403d381a279e72e09de5489a9>`

source: December 22, 2010 - :cve:`2010-4534`
id: 22 Desember 2010 - :cve:`2010-4534`
zh_hans: 2010 年 12 月 22 日 - :cve:`2010-4534`

source: Information leakage in administrative interface. `Full description <https://www.djangoproject.com/weblog/2010/dec/22/security/>`__
id: Kebocoran informasi di antarmuka administratif. `Full description <https://www.djangoproject.com/weblog/2010/dec/22/security/>`__
zh_hans: 界面管理中的信息泄漏`完整描述<https://www.djangoproject.com/weblog/2010/dec/22/security/>`__

source: Django 1.1 :commit:`(patch) <17084839fd7e267da5729f2a27753322b9d415a0>`
zh_hans: Django 1.1 :commit:`（补丁） <17084839fd7e267da5729f2a27753322b9d415a0>`

source: Django 1.2 :commit:`(patch) <85207a245bf09fdebe486b4c7bbcb65300f2a693>`
zh_hans: Django 1.2 :commit:`（补丁） <85207a245bf09fdebe486b4c7bbcb65300f2a693>`

source: September 8, 2010 - :cve:`2010-3082`
id: 8 September 2010 - :cve:`2010-3082`
zh_hans: 2010年9月8日 - :cve:`2010-3082`

source: XSS via trusting unsafe cookie value. `Full description <https://www.djangoproject.com/weblog/2010/sep/08/security-release/>`__
id: XSS melalui nilai kue tidak aman dipercaya. `Full description <https://www.djangoproject.com/weblog/2010/sep/08/security-release/>`__
zh_hans: XSS通过信任不安全的cookie值。完整描述<https://www.djangoproject.com/weblog/2010/sep/08/security-release/>`__

source: Django 1.2 :commit:`(patch) <7f84657b6b2243cc787bdb9f296710c8d13ad0bd>`
zh_hans: Django 1.2 :commit:`（补丁） <7f84657b6b2243cc787bdb9f296710c8d13ad0bd>`
