Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: ``EmailMessage.attach()`` and ``attach_file()`` now fall back to MIME type ``application/octet-stream`` when binary content that can't be decoded as UTF-8 is specified for a ``text/*`` attachment.
id: ``EmailMessage.attach()`` dan ``attach_file()`` kembali ke jenis MIME `application/octet-stream`` ketika isi biner yang tidak dapat disandikan sebagai UTF-8 ditentukan untuk lampiran ``text/*``.

source: The new :attr:`CharField.empty_value <django.forms.CharField.empty_value>` attribute allows specifying the Python value to use to represent "empty".
id: Atribut :attr:`CharField.empty_value <django.forms.CharField.empty_value>` baru mengizinkan menentukan nilai Python untuk digunakan untuk mewakili "empty".

source: Added support for :meth:`python:unittest.TestCase.subTest`s when using the :option:`test --parallel` option.
id: Ditambahkan dukungan untuk :meth:`python:unittest.TestCase.subTest` ketika menggunakan pilihan :option:`test --parallel`.

source: ``contrib.gis.maps`` is removed as it interfaces with a retired version of the Google Maps API and seems to be unmaintained. If you're using it, `let us know <https://code.djangoproject.com/ticket/14284>`_.
id: ``contrib.gis.maps`` dipindahkan ketika itu mengantarmukakan dengan versi pensiun dari Google Maps API dan kelihatan untuk tidak dirawat. Jika anda sedang menggunakan itu, `let us know <https://code.djangoproject.com/ticket/14284>`_.

source: This works similar to ``settings.TIME_ZONE = None`` except that it also sets ``os.environ['TZ']``. `Let us know <https://groups.google.com/d/topic/django-developers/OAV3FChfuPM/discussion>`__ if there's a use case where you find you can't adapt your code to set a ``TIME_ZONE``.
id: Pekerjaan ini mirip pada ``settings.TIME_ZONE = None`` kecuali bahwa itu juga menyetel ``os.environ['TZ']``. `Let us know <https://groups.google.com/d/topic/django-developers/OAV3FChfuPM/discussion>`__ jika ada kasus penggunaan dimana anda menemukan anda tidak bisa menyesuaikan kode anda untuk disetel ``TIME_ZONE``.

source: :class:`~django.middleware.http.ConditionalGetMiddleware` no longer sets the ``Date`` header as Web servers set that header. It also no longer sets the ``Content-Length`` header as this is now done by :class:`~django.middleware.common.CommonMiddleware`.
id: :class:`~django.middleware.http.ConditionalGetMiddleware` tidak lagi menyetel kepala ``Date`` ketika peladen Jaringan menyetel kepala itu. Itu juga tidak lagi menyetel kepala ``Content-Length``ketika ini diselesaikan oleh :class:`~django.middleware.common.CommonMiddleware`.

source: ``contrib.auth``s ``login()`` and ``logout()`` function-based views are deprecated in favor of new class-based views :class:`~django.contrib.auth.views.LoginView` and :class:`~django.contrib.auth.views.LogoutView`.
id: Tampilan berdasarkan-fungsi ``login()`` dan ``logout()````contrib.auth`` diusangkan menduung dari tampilan berdasarkan-kelas baru :class:`~django.contrib.auth.views.LoginView` dan :class:`~django.contrib.auth.views.LogoutView`.

source: ``contrib.auth``s ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, and ``password_reset_complete()`` function-based views are deprecated in favor of new class-based views :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, and :class:`~django.contrib.auth.views.PasswordResetCompleteView`.
id: Tampilan berdasarkan-fungsi ``contrib.auth``s ``password_change()``, ``password_change_done()``, ``password_reset()``, ``password_reset_done()``, ``password_reset_confirm()``, dan ``password_reset_complete()`` diusangkan mendukung dari tampilan berdasarkan-kelas baru :class:`~django.contrib.auth.views.PasswordChangeView`, :class:`~django.contrib.auth.views.PasswordChangeDoneView`, :class:`~django.contrib.auth.views.PasswordResetView`, :class:`~django.contrib.auth.views.PasswordResetDoneView`, :class:`~django.contrib.auth.views.PasswordResetConfirmView`, dan :class:`~django.contrib.auth.views.PasswordResetCompleteView`.

source: The change in Django 1.11 to make :meth:`.QuerySet.iterator()` use server-side cursors on PostgreSQL prevents running Django with `pgBouncer` in transaction pooling mode. To reallow that, use the :setting:`DISABLE_SERVER_SIDE_CURSORS <DATABASE-DISABLE_SERVER_SIDE_CURSORS>` setting in :setting:`DATABASES`.
id: Perubahan dalam Django 1.11 untuk membuat :meth:`.QuerySet.iterator()` menggunakan kursor sisi-peladen pada PostgreSQL mencegah menjalankan Django dengan `pgBouncer` dalam suasana penyatuan transaksi. Untuk mengizinkan kembali itu, gunakan pengaturan :setting:`DISABLE_SERVER_SIDE_CURSORS 1` dalam :setting:`DATABASES`.

source: Made migrations respect ``Index``s ``name`` argument. If you created a named index with Django 1.11, ``makemigrations`` will create a migration to recreate the index with the correct name (:ticket:`28051`).
id: Dibuat perpindahan mematuhi argumen ``name`` ``Index``. Jika anda membuat indeks bernama dengan Django 1.11, ``makemigrations`` akan membuat perpindahan untuk membuat kembali indeks dengan nama benar (:ticket:`28051`).

source: Fixed a crash when using a two-tuple in ``EmailMessage``s ``attachments`` argument (:ticket:`28042`).
id: Diperbaiki kegagalan ketika menggunakan dua-tuple dalam argumen lampiran ``EmailMessage`` (:ticket:`28042`).

source: Prevented ``Paginator``s unordered object list warning from evaluating a ``QuerySet`` (:ticket:`28284`).
id: Dicegah peringatan daftar obyek tidak berurutan ``Paginator`` dari menilai ``QuerySet`` (:ticket:`28284`).

source: Fixed the value of ``redirect_field_name`` in ``LoginView``s template context. It's now an empty string (as it is for the original function-based ``login()`` view) if the corresponding parameter isn't sent in a request (in particular, when the login page is accessed directly) (:ticket:`28229`).
id: Diperbaiki nilai dari ``redirect_field_name`` dalam konteks cetakan``LoginView``. Itu sekarang sebuah string kosong (seperti itu untuk tampilan ``login()`` berdasarkan-fungsi asli) jika parameter sesuai tidak dikirim dalam sebuah permintaan (khususnya, ketika halaman masuk diakses langsung) (:ticket:`28229`).

source: Support for `multiple database connections`_ in a single Django instance.
id: Mendukung `multiple database connections`_ pada satu instan Django.

source: Vastly `improved protection against Cross-Site Request Forgery`_ (CSRF).
id: Sangat `improved protection against Cross-Site Request Forgery`_ (CSRF).

source: A new `user "messages" framework`_ with support for cookie- and session-based message for both anonymous and authenticated users.
id: `user "messages" framework`_ baru dengan dukungan untuk pesan berdasarkan kue-dan-sesi untuk kedua pengguna anonim dan terotentifikasi.

source: Hooks for `object-level permissions`_, `permissions for anonymous users`_, and `more flexible username requirements`_.
id: Kaitan untuk `object-level permissions`_, `permissions for anonymous users`_, dan `more flexible username requirements`_.

source: These are just the highlights; full details and a complete list of features `may be found below`_.
id: Ini hanya sorotan; rincian penuh dan daftar lengkap dari fitur-fitur `may be found below`_.

source: The :func:`~django.contrib.auth.decorators.user_passes_test`, :func:`~django.contrib.auth.decorators.login_required`, and :func:`~django.contrib.auth.decorators.permission_required`, decorators from :mod:`django.contrib.auth` only apply to functions and no longer work on methods. There's a simple one-line fix `detailed below`_.
id: :func:`~django.contrib.auth.decorators.user_passes_test`, :func:`~django.contrib.auth.decorators.login_required`, dan :func:`~django.contrib.auth.decorators.permission_required`, penghias dari :mod:`django.contrib.auth` hanya berlaku pada fungsi dan tidak lagi bekerja pada metode. Ada sebuah perbaikan satu-baris sederhana `detailed below`_.

source: You can now use a ``DJANGO_COLORS`` environment variable to modify or disable the colors used by ``django-admin.py`` to provide :ref:`syntax highlighting <syntax-coloring>`.
id: Anda dapat sekarang menggunakan variabel lingkungan ``DJANGO_COLORS`` untuk merubah atau meniadakan warna digunakan oleh ``django-admin.py`` untuk menyediakan :ref:`syntax highlighting <syntax-coloring>`.

source: Finally, :doc:`GeoDjango's documentation </ref/contrib/gis/index>` is now included with Django's and is no longer hosted separately at `geodjango.org <http://geodjango.org/>`_.
id: Akhirnya, :doc:`GeoDjango's documentation </ref/contrib/gis/index>` sekarang disertakan dengan Django dan tidak lagi ditempatkan terpisah pada `geodjango.org <http://geodjango.org/>`_.

source: You may also need to update your templates if you were relying on the implementation of Django's template tags *not* being thread safe. The :ttag:`cycle` tag is the most likely to be affected in this way, especially when used in conjunction with the :ttag:`include` tag. Consider the following template fragment::
id: Anda mungkin juga butuh memperbaharui cetakan anda jika anda sedang menggantungkan pada penerapan dari etiket cetakan Django *bukan* menjadi thread safe. Etiket :ttag:`cycle` adalah paling disukai untuk dipengaruhi di cara ini, khususnya ketika digunakan di rangkaian dengan etiket :ttag:`include`. Pertimbangkan mengikuti fragmen cetakan berikut::

source: with a ``subtemplate.html`` that reads::
id: dengan ``subtemplate.html`` yang membaca::

source: Using the non-thread-safe, pre-Django 1.2 renderer, this would output::
id: Menggunakan non-thread-safe, pembangun pra-Django 1.2, ini akan mengeluarkan::

source: Using the thread-safe Django 1.2 renderer, you will instead get::
id: Menggunakan pembangun Django 1.2 thread-safe, anda akan mendapatkan sebagai gantinya::

source: ``django.utils.translation.get_date_formats()`` and ``django.utils.translation.get_partial_date_formats()`` have been deprecated in favor of the appropriate calls to ``django.utils.formats.get_format()``, which is locale-aware when :setting:`USE_L10N` is set to ``True``, and falls back to default settings if set to ``False``.
id: ``django.utils.translation.get_date_formats()`` dan ``django.utils.translation.get_partial_date_formats()`` telah diusangkan dalam mendukung dari panggilan yang sesuai pada ``django.utils.formats.get_format()``, yang merupakan sadar-lokal ketika :setting:`USE_L10N` disetel ke ``True``, dan kembali ke pengaturan awalan jika setel ke ``False``.

source: Because the table structure of the OGC spatial metadata tables differs across spatial databases, the ``SpatialRefSys`` and ``GeometryColumns`` models can no longer be associated with the ``gis`` application name. Thus, no models will be returned when using the ``get_models`` method in the following example::
id: Karena struktur tabel dari tabel metadata spasial OGC berbeda terhadap basisdata spasial, model ``SpatialRefSys`` dan ``GeometryColumns`` tidak lagi dapat dikaitkan dengan nama aplikasi ``gis``. Dengan demikian, tidak ada model akan dikembalikan ketika menggunakan metode ``get_models`` di contoh berikut::

source: To get the correct ``SpatialRefSys`` and ``GeometryColumns`` for your spatial database use the methods provided by the spatial backend::
id: Untuk mendapatkan ``SpatialRefSys`` dan ``GeometryColumns`` benar untuk basisdata spasial anda gunakan metode disediakan oleh backend spasial::

source: The currently used language code for Norwegian Bokml ``no`` is being replaced by the more common language code ``nb``.
id: Kode bahasa yang digunakan saat ini untuk Norwegia Bokml 11no11 sedang diganti oleh kode bahasa lebih umum ``nb``.

source: Django 1.2.1 was released almost immediately after 1.2.0 to correct two small bugs: one was in the documentation packaging script, the other was a bug_ that affected datetime form field widgets when localization was enabled.
id: Django 1.2.1 telah diterbitkan hampir segera setelah 1.2.0 untuk memperbaiki dua kesalahan kecil: satu adalah di tulisan pemaketan dokumentasi, lainnya adalah bug_ yang mempengaruhi datetime dari widget bidang ketika lokalisasi diadakan.

source: The patch_ applied for the security issue covered in Django 1.2.2 caused issues with non-ASCII responses using CSRF tokens.
id: patch_ diberlakukan untuk masalah keamanan dicakupi dalam Django 1.2.2 menyebabkan masalah dengan tanggapan bukan-ASCII menggunakan token CSRF.

source: Most users -- even users with multiple-database configurations -- need not be concerned about the data loss bug, or the manual configuration of :setting:`TEST_DEPENDENCIES`. See the `original problem report`_ documentation on :ref:`controlling the creation order of test databases <topics-testing-creation-dependencies>` for details.
id: Kebanyakan pengguna -- bahkan pengguna dengan konfigurasi basisdata banyak -- tidak butuh khawatir tentang kesalahan kehilangan data, atau konfigurasi manual dari :setting:`TEST_DEPENDENCIES`. Lihat dokumentasi `original problem report`_ pada :ref:`controlling the creation order of test databases <topics-testing-creation-dependencies>` untuk rincian.

source: Django 1.2.4 introduced a method ``lookup_allowed`` on ``ModelAdmin``, to cope with a security issue (changeset `[15033] <https://code.djangoproject.com/changeset/15033>`_). Although this method was never documented, it seems some people have overridden ``lookup_allowed``, especially to cope with regressions introduced by that changeset. While the method is still undocumented and not marked as stable, it may be helpful to know that the signature of this function has changed.
id: Django 1.2.4 memperkenalkan sebuah metode ``lookup_allowed`` pada ``ModelAdmin``, untuk mengatasi dengan sebuah masalah keamanan (changeset `[15033] <https://code.djangoproject.com/changeset/15033>`_). meskipun metode ini tidak pernah didokumentasikan, itu kelihatannya beberapa orang telah menimpa ``lookup_allowed``, khususnya untuk mengatasi dengan pemulihan diperkenalkan oleh changeset. Selagi metode ini masih tidak terdokumentasi dan tidak ditandai sebagai stabil, itu mungkin berguna untuk mengetahui bahwa tandatangan dari fungsi ini telah berubah.

source: Wherever possible, of course, new features are introduced in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>` policy. As a result of this policy, Django 1.3 :ref:`begins the deprecation process for some features <deprecated-features-1.3>`.
id: Sedapat mungkin, tentu saja, fitur-fitur baru diperkenalkan di sikap kesesuaian-kebelakang per kebijakan :doc:`our API stability policy </misc/api-stability>`. Sebagai hasil dari kebijakan ini, Django 1.3 :ref:`begins the deprecation process for some features <deprecated-features-1.3>`.

source: See :doc:`the documentation on class-based generic views</topics/class-based-views/index>` for more details. There is also a document to help you `convert your function-based generic views to class-based views <https://docs.djangoproject.com/en/1.4/topics/generic-views-migration/>`_.
id: Lihat :doc:`the documentation on class-based generic views</topics/class-based-views/index>` untuk lebih rinci. Ada juga sebuah dokumen untuk membantu anda `convert your function-based generic views to class-based views <https://docs.djangoproject.com/en/1.4/topics/generic-views-migration/>`_.

source: Django 1.3 adds framework-level support for Python's ``logging`` module. This means you can now easily configure and control logging as part of your Django project. A number of logging handlers and logging calls have been added to Django's own code as well -- most notably, the error emails sent on a HTTP 500 server error are now handled as a logging activity. See :doc:`the documentation on Django's logging interface </topics/logging>` for more details.
id: Django 1.3 menambahkan dukungan tingkatan-kerangka kerja untuk modul ``logging`` Python. Ini berarti anda dapat sekarang dengan mudah mengkonfigurasi dan mengendalikan pencatatan sebagai bagian dari proyek Django anda. Sejumlah penangan pencatatan dan pencatatan panggilan telah ditambahkan juga ke kode sendiri Django -- kebanyakan terutama, surel kesalahan dikirim pada kesalahan peladen HTTP 500 sekarang ditangani sebagai sebuah aktivitas pencatatan. Lihat :doc:`the documentation on Django's logging interface </topics/logging>` untuk lebih rinci.

source: Support for HTTPOnly_ cookies.
id: Mendukung untuk kue HTTPOnly_.

source: In earlier Django versions, when a model instance containing a :class:`~django.db.models.FileField` was deleted, :class:`~django.db.models.FileField` took it upon itself to also delete the file from the backend storage. This opened the door to several data-loss scenarios, including rolled-back transactions and fields on different models referencing the same file. In Django 1.3, when a model is deleted the :class:`~django.db.models.FileField`s ``delete()`` method won't be called. If you need cleanup of orphaned files, you'll need to handle it yourself (for instance, with a custom management command that can be run manually or scheduled to run periodically via e.g. cron).
id: Dalam versi paling awal Django, ketika sebuah instance model mengandung sebuah :class:`~django.db.models.FileField` dihapus, :class:`~django.db.models.FileField` mengambil itu pada dirinya sendiri untuk juga menghapus berkas dari penyimpanan backend. Ini membuat pintu untuk beberapa kemungkinan skenario kehilangan-data serius, termasuk transaksi dikembalikan dan bidang-bidang pada model berbeda mengacu berkas sama. Di Django 1.3, ketika sebuah model dihapus metode ``delete()`` :class:`~django.db.models.FileField` tidak akan dipanggil. Jika anda butuh membersihkan berkas-berkas tidak bertuan, anda akan butuh menangani nya anda sendiri (sebagai contoh, dengan perintah pengelolaan penyesuaian yang dapat berjalan secara manual atau terjadwal untuk berjalan secara periodeik melalui sebagai contoh cron).

source: If you have an existing project that is using the database session backend, you don't have to do anything to accommodate this change. However, you may get a significant performance boost if you manually add the new index to the session table. The SQL that will add the index can be found by running the ``sqlindexes`` admin command::
id: Jika anda memiliki sebuah proyek yang ada yaitu menggunakan backend sesi basisdata, anda tidak harus melakukan apapun menampung perubahan ini. Bagaimanapun, anda mungkin mendapat dorongan penampilan yang signifikan jika anda secara manual menambahkan indeks baru ke tabel sesi. SQL yang akan menambah indeks dapat ditemukan dengan menjalankan perintah admin ``sqlindexes``::

source: If you want to restore the old behavior, simply put a ``PROFANITIES_LIST`` setting in your settings file that includes the words that you want to prohibit (see the `commit that implemented this change`_ if you want to see the list of words that was historically prohibited). However, if avoiding profanities is important to you, you would be well advised to seek out a better, less naive approach to the problem.
id: Jika anda ingin menyimpan kembali perilaku lama, cukup taruh pengaturan ``PROFANITIES_LIST`` di berkas pengaturan anda yang menyertakan kata anda ingin larang (lihat `commit that implemented this change`_ jika anda ingin melihat kata-kata yang riwayatnya dilarang). Bagaimanapun, jika mengindari kata-kata kotor adalah penting bagi anda, anda akan disarankan mencari yang terbaik, sedikit pendekatan yang dibuat-buat pada masalah

source: For example with a ``FormSet``::
id: Sebagai contoh, dengan sebuah ``FormSet``::

source: the following code will raise a ``ValidationError``::
id: kode berikut akan memunculkan sebuah ``ValidationError``::

source: if you need to instantiate an empty ``FormSet``, don't pass in the data or use ``None``::
id: Jika anda butuh untuk membuat obyek sebuah ``FormSet`` kosong, jangan lewatkan di data atau gunakan ``None``::

source: Previously, a callable in a template would only be called automatically as part of the variable resolution process if it was retrieved via attribute lookup. This was an inconsistency that could result in confusing and unhelpful behavior::
id: Sebelumnya, callable di cetakan akan hanya dipanggil otomatis sebagai bagian dari pengolah keputusan variabel jika itu telah diambil melalui pencarian atribut. Ini adalah sebuah ketidakkonsistenan yang dapat menghasilkan kebingungan dan perilaku tidak membantu::

source: Most template tags will allow you to pass in either constants or variables as arguments -- for example::
id: Kebanyakan etiket cetakan akan mengizinkan untuk melewati di baik ketetapan atau variabel sebagai argumen -- sebagai contoh::

source: allows you to specify a base template as a constant, but if you have a context variable ``templ`` that contains the value ``base.html``::
id: mengizinkan anda menentukan cetakan dasar sebagai ketetapan, tetapi jika anda mempunyai variabel konteks ``templ`` yang mengandung nilai ``base.html``::

source: Django 1.3 marks the start of the process to correct this historical accident. Django 1.3 adds a new template library -- ``future`` -- that provides alternate implementations of the ``url`` and ``ssi`` template tags. This ``future`` library implement behavior that makes the handling of the first argument consistent with the handling of all other variables. So, an existing template that contains::
id: Django 1.3 menandai mulai pengolahan untuk memperbaiki riwayat kecelakaan. Django 1.3 menambahkan pustaka cetakan baru -- ``future`` yang menyediakan penerapan lain dari etiket cetakan ``url`` dan ``ssi``. Pustaka ``future`` ini menerapkan perilaku yang membuat penanganan dari argumen pertama tetap dengan penanganan dari semua variabel lain. Jadi, sebuah cetakan yang ada yang mengandung:

source: should be replaced with::
id: harus diganti dengan::

source: In previous version the admin app defined login methods in multiple locations and ignored the almost identical implementation in the already used auth app. A side effect of this duplication was the missing adoption of the changes made in r12634_ to support a broader set of characters for usernames.
id: Di versi aplikasi admin sebelumnya menentukan metode masuk di banyak tempat dan mengabaikan hampir penerapan mirip di aplikasi otentifikasi yang sudah digunakan. Efek samping dari penggandaan ini adalah kehilangan pemakaian dari perubahan dibuat di r12634_ untuk mendukung kumpulan lebih luas dari karakter untuk nama pengguna.

source: There are potential strange development- and deployment-time problems like the fact that the ``project_dir/locale/`` subdir can generate spurious error messages when the project directory is added to the Python path (``manage.py runserver`` does this) and then it clashes with the equally named standard library module, this is a typical warning message::
id: Terdapat kemungkinan pengembangan aneh- dan penyebaran- masalah waktu seperti fakta bahwa subdirektori ``project_dir/locale/`` daapt membangkitkan pesan-pesan kesalahan tiruan ketika direktori proyek ditambahkan ke jalur Python (``manage.py runserver`` melakukan ini) dan kemudian itu bentrok dengan modul pustaka standar dinamai sama, ini adalah pesan kesalahan khas::
