Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django's own built-in parsing of the Host header is, however, still vulnerable, as was reported to us recently. The Host header parsing in Django 1.3.3 and Django 1.4.1 -- specifically, ``django.http.HttpRequest.get_host()`` -- was incorrectly handling username/password information in the header. Thus, for example, the following Host header would be accepted by Django when running on "validsite.com"::
id: Pengurai siap-pakai Django sendiri dari kepala Host, bagaimanapun, masih rentan, ketika telah dilaporkan ke kami baru-baru ini. Pengurai kepala Host di Django 1.3.3 dan Django 1.4.1 -- khususnya, ``django.http.HttpRequest.get_host()`` -- tidak benar menangani informasi nama pengguna/sandi di kepala. Demikian, sebagai contoh, kepala Host berikut akan diterima oleh Django ketika berjalan pada "validsite.com"::

source: Some parts of Django -- independent of end-user-written applications -- make use of full URLs, including domain name, which are generated from the HTTP Host header. Django's documentation has for some time contained notes advising users on how to configure Web servers to ensure that only valid Host headers can reach the Django application. However, it has been reported to us that even with the recommended Web server configurations there are still techniques available for tricking many common Web servers into supplying the application with an incorrect and possibly malicious Host header.
id: Beberapa bagian dari Django -- berdiri sendiri dari aplikasi ditulis-pengguna-akhir -- menggunakan URL penuh, termasuk nama ranah, yang dibangkitkan dari kepala HTTP Host. Dokumentasi Django terkadang mengandung catatan menyarankan pengguna pada bagaimana mengkonfigurasi peladen Jaringan untuk memastikan bahwa hanya kepala Host sah dapat mencapai aplikasi Django. Bagaimanapun, itu masih tersedia teknik untuk membodohi konfigurasi banyak peladen Jaringan umum untuk menyokong aplikasi dengan tidak benar dan kemungkinan kepala Host jahat.

source: In previous versions of Django, an admin user without change permission on a model could still view the unicode representation of instances via their admin history log. Django 1.3.6 now limits the admin history log view for an object to users with change permission for that model.
id: Di vesi sebelumnya dari Django, sebuah pengguna admin tanpa merubah perizinan pada model dapat masih menampilkan perwakilan unicode dari instance melalui catatan riwayat admin mereka. Django 1.3.6 sekarang membatasi tampilan catatan riwayat admin untuk sebuah obyek pada pengguna dengan perubahan perizinan untuk model itu.

source: For instance, with the following layout::
id: Untuk contoh, dengan tata letak berikut::

source: Anything imported as a top-level module can be placed adjacent to the new ``manage.py``. For instance, to decouple "myapp" from the project module and import it as just ``myapp``, place it outside the ``mysite/`` directory::
id: Apapun diimpor sebagai modul tingkat-atas dapat ditempatkan berdekatan ke ``manage.py`` baru. Sebagai contoh, untuk memisahkan "myapp" dari modul proyek dan impor itu sebagai hanya ``myapp``, tempatkan itu diluar direktori ``mysite/``::

source: For example, Django will use the ``/path/to/my_project_template`` directory when you run the following command::
id: Sebagai contoh, Django akan menggunakan direktori ``/path/to/my_project_template`` ketika anda menjalankan perintah berikut::

source: You can also now provide a destination directory as the second argument to both :djadmin:`startapp` and :djadmin:`startproject`::
id: Anda dapat juga sekarang menyediakan tujuan direktori sebagai argumen kedua pada kedua :djadmin:`startapp` and :djadmin:`startproject`::

source: Django 1.4 adds both a low-level API for signing values and a high-level API for setting and reading signed cookies, one of the most common uses of signing in Web applications.
id: Django 1.4 menambahkan kedua API tingkat-rendah untuk menandatangani nilai-nilai dan API tingkat-tinggi untuk mengatur dan membaca kue ditandatangani, satu dari penggunaan paling umum dari penandatanganan di apliaksi Jaringan.

source: Django can now look for a language prefix in the URLpattern when using the new :func:`~django.conf.urls.i18n.i18n_patterns` helper function. It's also now possible to define translatable URL patterns using :func:`~django.utils.translation.ugettext_lazy`. See :ref:`url-internationalization` for more information about the language prefix and how to internationalize URL patterns.
id: Django sekarang mencari untuk awalan bahasa di URLpattern ketika menggunakan fungsi pembantu :func:`~django.conf.urls.i18n.i18n_patterns` baru. Itu juga sekarang memungkinkan menentukan pola URL dapat diartikan menggunakan :func:`~django.utils.translation.ugettext_lazy`. Lihat :ref:`url-internationalization` untuk informasi lebih mengenai awalan bahasa dan bagaimana untuk menginternasionalisasi pola URL.

source: The :mod:`staticfiles<django.contrib.staticfiles>` contrib app has a new ``static`` template tag to refer to files saved with the :setting:`STATICFILES_STORAGE` storage backend. It uses the storage backend's ``url`` method and therefore supports advanced features such as :ref:`serving files from a cloud service<staticfiles-from-cdn>`.
id: Bantuan aplikasi :mod:`staticfiles<django.contrib.staticfiles>` mempunyai etiket cetakan ``static`` baru untuk mengacu ke berkas-berkas disimpan dengan penyimpanan backend :setting:`STATICFILES_STORAGE`. Dia menggunakan metode ``url`` penyimpanan backend dan karena itu mendukung fitur lebih tinggi seperti :ref:`serving files from a cloud service<staticfiles-from-cdn>`.

source: The :mod:`staticfiles<django.contrib.staticfiles>` contrib app now has a :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` backend that caches the files it saves (when running the :djadmin:`collectstatic` management command) by appending the MD5 hash of the file's content to the filename. For example, the file ``css/styles.css`` would also be saved as ``css/styles.55e7cbb9ba48.css``
id: Aplikasi bantuan :mod:`staticfiles<django.contrib.staticfiles>` sekarang mempunyai backend :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` yang menyembunyikan berkas dia simpan (ketika menjalankan perintah pengelolaan :djadmin:`collectstatic`) dengan menambahkan acakan MD5 dari isi berkas ke nama berkas. Sebagai contoh, berkas ``css/styles.css`` akan juga disimpan sebagai ``css/styles.55e7cbb9ba48.css``

source: See the :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` docs for more information.
id: Lihat dokumen :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` untuk informasi lebih.

source: The :djadmin:`makemessages` command uses a new and more accurate lexer, `JsLex`_, for extracting translatable strings from JavaScript files.
id: Perintah :djadmin:`makemessages` menggunakan lexer baru dan lebih akurat, `JsLex`_, untuk mengeluarkan deretan karakter dapat diartikan dari berkas-berkas JavaScript.

source: A new, plain-text, version of the HTTP 500 status code internal error page served when :setting:`DEBUG` is ``True`` is now sent to the client when Django detects that the request has originated in JavaScript code. (:meth:`~django.http.HttpRequest.is_ajax` is used for this.)
id: Sebuah baru, teks-polos, versi dari halaman kesalahan internal kode keadaan 500 HTTP dilayani ketika :setting:`DEBUG` adalah ``True`` sekarang dikirim ke klien ketika Django mengenali bahwa permintaan berasal di kode JavaScript. (:meth:`~django.http.HttpRequest.is_ajax` digunakan untuk ini.)

source: The admin login page will add a password reset link if you include a URL with the name `'admin_password_reset'` in your urls.py, so plugging in the built-in password reset mechanism and making it available is now much easier. For details, see :ref:`auth_password_reset`.
id: Halaman amsuk admin akan menambahkan tautan setel kembali sandi jika anda menyertakan sebuah URL dengan `'admin_password_reset'` di urls.py anda, jadi menanam mekanisme penyetelan kembali sandi siap-pakai dan membuatnya tersedia sekarang lebih mudah. Untuk rincian, lihat :ref:`auth_password_reset`.

source: In Django 1.4, starting Django with an empty :setting:`SECRET_KEY` will raise a `DeprecationWarning`. In Django 1.5, it will raise an exception and Django will refuse to start. This is slightly accelerated from the usual deprecation path due to the severity of the consequences of running Django with no :setting:`SECRET_KEY`.
id: Di Django 1.4, memulai Django dengan sebuah :setting:`SECRET_KEY` kosong akan memunculkan sebuah `DeprecationWarning`. Di Django 1.5, itu akan memunculkan sebuah pengecualian dan Django akan menolak mulai. Ini sedikit dipercepat dari jalur pengusangan biasa karena kerasnya akibat dari menjalankan Django dengan tidak ada :setting:`SECRET_KEY`.

source: Starting in Django 1.4, the admin's static files also follow this convention, to make the files easier to deploy. In previous versions of Django, it was also common to define an ``ADMIN_MEDIA_PREFIX`` setting to point to the URL where the admin's static files live on a Web server. This setting has now been deprecated and replaced by the more general setting :setting:`STATIC_URL`. Django will now expect to find the admin static files under the URL ``<STATIC_URL>/admin/``.
id: Memulai di Django 1.4, berkas tetap admin juga mengikuti persetujuan ini, untuk membuat berkas ini lebih mudah di sebarkan. Dalam versi sebelumnya dari Django, itu juga umum untuk menentukan sebuah pengaturan ``ADMIN_MEDIA_PREFIX`` untuk menunjuk ke URL dimana berkas tetap admin tinggal di peladen Jaringan. Pengaturan ini sekarang telah diusangkan dan diganti oleh pengaturan :setting:`STATIC_URL`. Django sekarang akan berharap menemukan berkas tetap admin dibawah URL ``<STATIC_URL>/admin/``.

source: If you've previously used a URL path for ``ADMIN_MEDIA_PREFIX`` (e.g. ``/media/``) simply make sure :setting:`STATIC_URL` and :setting:`STATIC_ROOT` are configured and your Web server serves those files correctly. The development server continues to serve the admin files just like before. Read the :doc:`static files howto </howto/static-files/index>` for more details.
id: Jika anda sebelumnya menggunakan jalur URL untuk ``ADMIN_MEDIA_PREFIX`` (sebagai contoh ``/media/``) cukup pastikan :setting:`STATIC_URL` dan :setting:`STATIC_ROOT` dikonfigurasi dan peladen Jaringan anda melayani berkas-berkas tersebut dengan benar. Pengembangan peladen berlanjut melayani berkas admin sama seperti sebelumnya. Baca :doc:`static files howto </howto/static-files/index>` untuk lebih rinci.

source: If your ``ADMIN_MEDIA_PREFIX`` is set to an specific domain (e.g. ``http://media.example.com/admin/``), make sure to also set your :setting:`STATIC_URL` setting to the correct URL -- for example, ``http://media.example.com/``.
id: Jika ``ADMIN_MEDIA_PREFIX`` anda disetel ke sebuah ranah khusus (sebagai contoh ``http://media.example.com/admin/``), pastikan untuk juga menyetel pengaturan :setting:`STATIC_URL` anda ke URL benar -- sebagai contoh, ``http://media.example.com/``.

source: Released over 10 years ago, IE6 imposes many limitations on modern Web development. The practical implications of this policy are that contributors are free to improve the admin without consideration for these limitations.
id: Diterbitkan lebih 10 tahun lalu, IE6 menyebabkan banyak batasan pada pengembangan Jaringan modern. Dampak praktik dari kebijakan ini adalah bahwa pembantu bebas meningkatkan admin tanpa pertimbangan dari batasan-batasan ini.

source: Obviously, this new policy **has no impact** on sites you develop using Django. It only applies to the Django admin. Feel free to develop apps compatible with any range of browsers.
id: Dengan jelas, kebijakan baru ini **tidak mempunyai dampak** pada situs anda kembangkan menggunakan Django. Itu hanya berlaku ke admin Django. Jangan ragu untuk mengembangkan aplikasi sesuai dengan jangkauan apapun dari perambah.

source: Time period: Defined by :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.
id: Periode waktu: Ditentukan oleh :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.

source: Form-related hashes: these have a are much shorter lifetime and are relevant only for the short window where a user might fill in a form generated by the pre-upgrade Django instance and try to submit it to the upgraded Django instance:
id: Campuran hubungan-formulir: kepunyaan ini lebih pendek masa hidupnya dan hanya bersangkut paut untuk jendela pendek dimana pengguna mungkin mengisi sebuah formulir dibangkitkan oleh pra-peningkatan contoh Django dan mencoba mengajukan nya ke contoh Django ditingkatkan:

source: As part of this change, all underlying SQLite connections are now enabled for potential thread-sharing (by passing the ``check_same_thread=False`` attribute to pysqlite). ``DatabaseWrapper`` however preserves the previous behavior by disabling thread-sharing by default, so this does not affect any existing code that purely relies on the ORM or on ``DatabaseWrapper.cursor()``.
id: Sebagai bagian dari perubahan ini, semua hubungan SQLite pokok sekarang diadakan untuk peluang thread-sharing (dengan melewatkan atribut ``check_same_thread=False`` ke pysqlite). ``DatabaseWrapper`` bagaimanapun menjaga perilaku sebelumnya dengan meniadakan thread-sharing secara awalan, jadi ini tidak semua mempengaruhi kode yang ada yang murni bergantung pada ORM atau pada ``DatabaseWrapper.cursor()``.

source: `COMMENTS_BANNED_USERS_GROUP` setting
id: Pengaturan `COMMENTS_BANNED_USERS_GROUP`

source: `IGNORABLE_404_STARTS` and `IGNORABLE_404_ENDS` settings
id: Pengaturan `IGNORABLE_404_STARTS` dan `IGNORABLE_404_ENDS`

source: Session cookies now include the ``httponly`` attribute by default to help reduce the impact of potential XSS attacks. As a consequence of this change, session cookie data, including sessionid, is no longer accessible from JavaScript in many browsers. For strict backwards compatibility, use ``SESSION_COOKIE_HTTPONLY = False`` in your settings file.
id: Kue sesi sekarang menyertakan atribut ``httponly`` secara awalan untuk membantu mengurangi dampak dari peluang serangan XSS. Sebagai konsekuensi dari perubahan ini, data kue sesi, termasuk sessionid, tidak lagi dapat diakses dari JavaScript di banyak peramban. Untuk kesesuaian kebelakang yang ketat, gunakan ``SESSION_COOKIE_HTTPONLY = False`` di berkas pengaturan anda.

source: The development server is now is multithreaded by default. Use the :option:`runserver --nothreading` option to disable the use of threading in the development server::
id: Peladen pengembangan sekarang multithread secara awalan. Gunakan pilihan :option:`runserver --nothreading` untuk meniadakan penggunaan dari thread di peladen pengembangan::

source: This function was never documented or part of the public API, but it was widely recommended for use in setting up a "Django environment" for a user script. These uses should be replaced by setting the ``DJANGO_SETTINGS_MODULE`` environment variable or using :func:`django.conf.settings.configure`.
id: Fungsi ini tidak pernah didokumentasikan atau bagian dari API umum, tetapi itu sangat luas dianjurkan untuk digunakan di pengaturan "Django environment" untuk tulisan pengguna. Penggunaan ini harus diganti dengan mengatur variabel lingkungan ``DJANGO_SETTINGS_MODULE`` atau menggunakan :func:`django.conf.settings.configure`.

source: Wildcard expansion of application names in `INSTALLED_APPS`
id: Perluasan wildcard dari nama aplikasi di `INSTALLED_APPS`

source: This behavior was never documented. Since it is unpythonic and not obviously useful, it was removed in Django 1.4. If you relied on it, you must edit your settings file to list all your applications explicitly.
id: Perilaku ini tidak pernah didokumentasikan. Sejak itu adalah bukan python dan tidak jelas berguna, itu telah dipindahkan di Django 1.4. Jika anda bergantung pada itu, anda harus menyunting berkas pengaturan anda ke daftar semua aplikasi anda secara eksplisit.

source: When HTTP headers are placed into the WSGI environ, they are normalized by converting to uppercase, converting all dashes to underscores, and prepending `HTTP_`. For instance, a header ``X-Auth-User`` would become ``HTTP_X_AUTH_USER`` in the WSGI environ (and thus also in Django's ``request.META`` dictionary).
id: Ketika kepala HTTP ditempatkan kedalam kepungan WSGI, mereka dinormalkan dengan merubah menjadi huruf besar, merubah semua tanda garis menjadi garis bawah, dan megnawali `HTTP_`. Sebagai contoh, sebuah kepala ``X-Auth-User`` akan menjadi ``HTTP_X_AUTH_USER`` di kepungan WSGI (dan demikian juga di kamus ``request.META`` Django).

source: In previous versions of Django, an admin user without change permission on a model could still view the unicode representation of instances via their admin history log. Django 1.4.4 now limits the admin history log view for an object to users with change permission for that model.
id: Di vesi sebelumnya dari Django, sebuah pengguna admin tanpa merubah perizinan pada model dapat masih menampilkan perwakilan unicode dari instance melalui catatan riwayat admin mereka. Django 1.4.4 sekarang membatasi tampilan catatan riwayat admin untuk sebuah obyek pada pengguna dengan perubahan perizinan untuk model itu.

source: Corrected usage of :func:`~django.views.decorators.debug.sensitive_post_parameters` in :mod:`django.contrib.auth`s admin
id: Penggunaan diperbaiki dari :func:`~django.views.decorators.debug.sensitive_post_parameters` di admin :mod:`django.contrib.auth`

source: When traversing relations, the ORM will avoid re-fetching objects that were previously loaded. For example, with the tutorial's models::
id: Ketika melintasi hubungan, ORM akan menghindari mengambil kembali obyek yang sebelumnya dimuat. Sebagai contoh, dengan model tutorial::

source: The methods :meth:`ContentTypeManager.get_for_model() <django.contrib.contenttypes.models.ContentTypeManager.get_for_model()>` and :meth:`ContentTypeManager.get_for_models() <django.contrib.contenttypes.models.ContentTypeManager.get_for_models()>` have a new keyword argument respectively ``for_concrete_model`` and ``for_concrete_models``. By passing ``False`` using this argument it is now possible to retrieve the :class:`ContentType <django.contrib.contenttypes.models.ContentType>` associated with proxy models.
id: Metode :meth:`ContentTypeManager.get_for_model() <django.contrib.contenttypes.models.ContentTypeManager.get_for_model()>` dan :meth:`ContentTypeManager.get_for_models() <django.contrib.contenttypes.models.ContentTypeManager.get_for_models()>` mempunyai argumen kata kunci baru -- masing-masing ``for_concrete_model`` dan ``for_concrete_models``. Dengan melewatkan ``False`` menggunakan argumen ini itu sekarang memungkinkan mengambil :class:`ContentType <django.contrib.contenttypes.models.ContentType>` terkait dengan model proxy

source: In the localflavor for Canada, "pq" was added to the acceptable codes for Quebec. It's an old abbreviation.
id: Jika localflavor untuk Canada, "pq" telah ditambahkan pada kode diterima untuk Quebec. Itu adalah singkatan lama.

source: It's not required any more to have ``404.html`` and ``500.html`` templates in the root templates directory. Django will output some basic error messages for both situations when those templates are not found. Of course, it's still recommended as good practice to provide those templates in order to present pretty error pages to the user.
id: Itu tidak dibutuhkan lagi memiliki cetakan ``404.html`` dan ``500.html`` di akar direktori cetakan. Django akan mengeluarkan beberapa pesan kesalahan untuk kedua keadaan ketika cetakan tersebut tidak ditemukan. Tentu saja, itu masih dianjurkan sebagai latihan bagus untuk menyediakan cetakan tersebut untuk menampilkan halaman kesalahan cantik ke pengguna.

source: Multi-column indexes can now be created on models. Read the :attr:`~django.db.models.Options.index_together` documentation for more information.
id: Indeks banyak-kolom sekarang dapat dibuat pada model. Baca dokumentasi :attr:`~django.db.models.Options.index_together` untuk informasi lebih.

source: :class:`~django.views.generic.dates.YearArchiveView` and :class:`~django.views.generic.dates.MonthArchiveView` were documented to provide a ``date_list`` sorted in ascending order in the context, like their function-based predecessors, but it actually was in descending order. In 1.5, the documented order was restored. You may want to add (or remove) the ``reversed`` keyword when you're iterating on ``date_list`` in a template::
id: :class:`~django.views.generic.dates.YearArchiveView` dan :class:`~django.views.generic.dates.MonthArchiveView` didokumentasikan untuk menyediakan urutan ``date_list`` dalam urutan menurun. Dalam 1.5, urutan dokumentasi telah disimpan kembali. Anda mungkin ingin menambah (atau memindahkan) katakunci ``reversed`` ketika anda sedang mengulang pada ``date_list`` di cetakan::

source: :attr:`request.POST <django.http.HttpRequest.POST>` will no longer include data posted via HTTP requests with non form-specific content-types in the header. In prior versions, data posted with content-types other than ``multipart/form-data`` or ``application/x-www-form-urlencoded`` would still end up represented in the :attr:`request.POST <django.http.HttpRequest.POST>` attribute. Developers wishing to access the raw POST data for these cases, should use the :attr:`request.body <django.http.HttpRequest.body>` attribute instead.
id: :attr:`request.POST <django.http.HttpRequest.POST>` akan tidak lagi menyertakan data ditempatkan melalui permintaan HTTP dengan content-types bukan bentuk-khusus di kepala. Di versi sebelumnya, data ditempatkan dengan content-types daripada ``multipart/form-data`` atau ``application/x-www-form-urlencoded`` akan masih mengakhiri diwakili di atribut :attr:`request.POST <django.http.HttpRequest.POST>`. Pengembang berharap mengakses ke data POST mentah untuk kasus ini, harus menggunakan atribut :attr:`request.body <django.http.HttpRequest.body>` sebagai gantinya.

source: A system version of ``simplejson``, if one was available (ie. ``import simplejson`` works), if it was more recent than Django's built-in copy or it had the C speedups, or
id: Versi sistem dari ``simplejson``, jika satu telah tersedia (yaitu ``import simplejson`` bekerja), jika itu lebih sering dari salinan siap-pakai Django atau itu mempunyai pemercepat C, atau

source: The :mod:`json` module from the standard library, if it was available (ie. Python 2.6 or greater), or
id: Modul :mod:`json` dari pustaka standar, jika itu telah tersedia (yaitu Python 2.6 atau lebih besar), atau

source: While the ``simplejson`` API is documented as always returning unicode strings, the optional C implementation can return a byte string. This was fixed in Python 2.7.
id: Selagi API ``simplejson`` didokumentasikan sebagai selalu mengembalikan deretan karakter unicode, penerapan pilihan C dapat mengembalikan deretan karakter byte. Ini telah diperbaiki di Python 2.7.

source: More information on these incompatibilities is available in `ticket #18023`_.
id: Informasi lebih pada ketidaksesuaian ini tersedia di `ticket #18023`_.
