Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Preparation for new features. For example the ORM is now internally ready for multicolumn foreign keys.
id: Perssiapan untuk fitur baru. Sebagai contoh, ORM sekarang secara internal siap untuk foreign key banyak kolom.
zh_hans: 为新功能做准备。例如，ORM 现在在内部已准备好支持多列外键。

source: General cleanup.
id: Pembersihan umum.
zh_hans: 整体清理

source: These changes can result in some compatibility problems. For example, some queries will now generate different table aliases. This can affect :meth:`QuerySet.extra() <django.db.models.query.QuerySet.extra>`. In addition some queries will now produce different results. An example is :meth:`exclude(condition) <django.db.models.query.QuerySet.exclude>` where the condition is a complex one (referencing multijoins inside :class:`Q objects <django.db.models.Q>`). In many cases the affected queries didn't produce correct results in Django 1.5 but do now. Unfortunately there are also cases that produce different results, but neither Django 1.5 nor 1.6 produce correct results.
id: Perubahan ini dapat menghasilkan di beberapa masalah kesesuaian. Sebagai contoh, beberapa permintaan akan sekarang membangkitkan nama lain tabel berbeda. Ini dapat mempengaruhi :meth:`QuerySet.extra() <django.db.models.query.QuerySet.extra>`. Sebagai tambahan beberapa permintaan akan sekarang membuat hasil berbeda. Sebuah contoh adalah :meth:`exclude(condition) <django.db.models.query.QuerySet.exclude>` dimana kondisi adalah satu rumit (mengacu banyak penyertaan didalam :class:`Q objects <django.db.models.Q>`). Dalam banyak kasus permintaan yang dipengaruhi tidak membuat hasil di Django 1.5 tetapi melakukan sekarang. Sayangnya ada juga kasus-kasus yang membuat hasil berbeda, tetapi juga tidak Django 1.5 maupun 1.6 membuat hasil benar.
zh_hans: 这些变化可能会导致一些兼容性问题。例如，一些查询现在可能会生成不同的表别名。这可能会影响 :meth:`QuerySet.extra() <django.db.models.query.QuerySet.extra>`。此外，一些查询现在可能会产生不同的结果。一个例子是 :meth:`exclude(condition) <django.db.models.query.QuerySet.exclude>`，其中条件比较复杂（引用了 :class:`Q objects <django.db.models.Q>` 中的多重连接）。在许多情况下，受影响的查询在 Django 1.5 中并没有生成正确的结果，但现在却能够生成正确的结果。不幸的是，还有一些情况会产生不同的结果，但无论是在 Django 1.5 还是在 1.6 中都没有生成正确的结果。

source: Finally, there have been many changes to the ORM internal APIs.
id: Akhirnya, terdapat banyak perubahan pada API internal ORM.
zh_hans: 最后，ORM 的内部 API 发生了许多变化

source: The ``django.db.models.query.EmptyQuerySet`` can't be instantiated any more - it is only usable as a marker class for checking if :meth:`~django.db.models.query.QuerySet.none` has been called: ``isinstance(qs.none(), EmptyQuerySet)``
id: ``django.db.models.query.EmptyQuerySet`` tidak dapat diinstiasikan lagi - itu adalah hanya berguna sebagai penanda kelas untuk memeriksa jika :meth:`~django.db.models.query.QuerySet.none` telah dipanggil: ``isinstance(qs.none(), EmptyQuerySet)``
zh_hans: ``django.db.models.query.EmptyQuerySet`` 现在不能再实例化了，它只能用作检查是否调用了 :meth:`~django.db.models.query.QuerySet.none` 的标记类：``isinstance(qs.none(), EmptyQuerySet)``。

source: If your CSS/JavaScript code used to access HTML input widgets by type, you should review it as ``type='text'`` widgets might be now output as ``type='email'``, ``type='url'`` or ``type='number'`` depending on their corresponding field type.
id: Jika kode CSS/JavaScript anda digunakan untuk mengakses widget masukan HTML berdasarkan jenis, anda harus meninjau kembali itu seperti widget ``type='text'`` mungkin sekarang mengeluarkan seperti ``type='email'``, ``type='url'`` atau ``type='number'`` tergantung pada jenis bidang yang sesuai mereka.
zh_hans: 如果您的 CSS/JavaScript 代码以前根据输入小部件的类型进行访问，您应该进行审查，因为 ``type='text'`` 的小部件现在可能会根据其对应的字段类型输出为 ``type='email'``、``type='url'`` 或 ``type='number'``。

source: Form field's :attr:`~django.forms.Field.error_messages` that contain a placeholder should now always use a named placeholder (``"Value '%(value)s' is too big"`` instead of ``"Value '%s' is too big"``). See the corresponding field documentation for details about the names of the placeholders. The changes in 1.6 particularly affect :class:`~django.forms.DecimalField` and :class:`~django.forms.ModelMultipleChoiceField`.
id: :attr:`~django.forms.Field.error_messages` bidang formulir yang mengandung placeholder harus sekarang selalu menggunakan bernama placeholder(``"ilai '%(value)' terlalu besar"`` daripada ``"Nilai '%s' terlalu besar"``). Lihat bidang sesuai untuk rincian tentang nama-nama dari placeholder. Perubahan di 1.6 terutama mempengaruhi :class:`~django.forms.DecimalField` dan :class:`~django.forms.ModelMultipleChoiceField`.
zh_hans: 表单字段的 :attr:`~django.forms.Field.error_messages` 中包含占位符的错误消息现在应始终使用具名占位符（``"Value '%(value)s' is too big"`` 而不是 ``"Value '%s' is too big"``）。有关占位符名称的详细信息，请参阅相应的字段文档。1.6 中的更改特别影响到了 :class:`~django.forms.DecimalField` 和 :class:`~django.forms.ModelMultipleChoiceField`。

source: Some :attr:`~django.forms.Field.error_messages` for :class:`~django.forms.IntegerField`, :class:`~django.forms.EmailField`, ``IPAddressField``, :class:`~django.forms.GenericIPAddressField`, and :class:`~django.forms.SlugField` have been suppressed because they duplicated error messages already provided by validators tied to the fields.
id: Beberapa :attr:`~django.forms.Field.error_messages` untuk :class:`~django.forms.IntegerField`, :class:`~django.forms.EmailField`, ``IPAddressField``, :class:`~django.forms.GenericIPAddressField`, dan :class:`~django.forms.SlugField` telah tertindih karena mereka menggandakan pesan kesalahan yang sudah disediakan oleh pengecek diikat ke bidang.
zh_hans: 一些针对 :class:`~django.forms.IntegerField`、:class:`~django.forms.EmailField`、``IPAddressField``、:class:`~django.forms.GenericIPAddressField` 和 :class:`~django.forms.SlugField` 的 :attr:`~django.forms.Field.error_messages` 已经被抑制，因为它们重复了与字段绑定的验证器已经提供的错误消息。

source: Due to a change in the form validation workflow, :class:`~django.forms.TypedChoiceField` ``coerce`` method should always return a value present in the ``choices`` field attribute. That limitation should be lift again in Django 1.7.
id: Karena sebuah perubahan di alur kerja pengesahan formulir, metode :class:`~django.forms.TypedChoiceField` ``coerce`` harus selalu mengembalikan sebuah nilai hadir di atribut bidang ``choices``. Batasan tersebut harus diangkat kembali di Django 1.7.
zh_hans: 由于表单验证工作流程的更改，:class:`~django.forms.TypedChoiceField` 的 ``coerce`` 方法应该始终返回存在于 ``choices`` 字段属性中的值。这个限制应该在 Django 1.7 中被取消。

source: There have been changes in the way timeouts are handled in cache backends. Explicitly passing in ``timeout=None`` no longer results in using the default timeout. It will now set a non-expiring timeout. Passing 0 into the memcache backend no longer uses the default timeout, and now will set-and-expire-immediately the value.
id: Telah ada perubahan di cara waktu habis ditangani di backend cache. Secara eksplisit melewatkan di ``timeout=None`` tidak lagi mengasilkan di penggunaan awalan waktu habis. itu akan sekarang menyetel waktu habis bukan-kadaluarsa. Melewatkan 0 kedalam backend memcached tidak lagi menggunakan awalan waktu habis, dan sekarang akan menyetel-dan-berakhir-segera nilai.
zh_hans: 在缓存后端中，超时处理方式发生了变化。显式传递 ``timeout=None`` 不再会使用默认超时。现在它将设置一个永不过期的超时。在 memcache 后端中传递 0 不再使用默认超时，而是立即设置并过期值。

source: The ``django.contrib.flatpages`` app used to set custom HTTP headers for debugging purposes. This functionality was not documented and made caching ineffective so it has been removed, along with its generic implementation, previously available in ``django.core.xheaders``.
id: Aplikasi ``django.contrib.flatpages`` digunakan untuk menyetel kepala HTTP penyesuaian untuk tujuan mencari kesalahan. Kegunaan ini tidak didokumentasikan dan membuat menyembunyikan tidak efektif jadi itu telah dipindahkan, bersama dengan penerapan umumnya, sebelumnya tersedia di ``django.core.xheaders``.
zh_hans: ``django.contrib.flatpages`` 应用程序曾经为调试目的设置自定义 HTTP 标头。这个功能没有记录在文档中，而且使得缓存失效，因此已经被移除，以及之前在 ``django.core.xheaders`` 中可用的通用实现也被移除。

source: The ``XViewMiddleware`` has been moved from ``django.middleware.doc`` to ``django.contrib.admindocs.middleware`` because it is an implementation detail of admindocs, proven not to be reusable in general.
id: ``XViewMiddleware`` telah dipindahkan dari ``django.middleware.doc`` ke ``django.contrib.admindocs.middleware`` karena itu adalah sebuah penerapan rincian dari admindoc, terbukti tidak menjadi digunakan kembali secara umum.
zh_hans: ``XViewMiddleware`` 已经从 ``django.middleware.doc`` 移动到 ``django.contrib.admindocs.middleware``，因为它是 admindocs 的实现细节，已被证明在一般情况下不可重用。

source: :class:`~django.db.models.GenericIPAddressField` will now only allow ``blank`` values if ``null`` values are also allowed. Creating a ``GenericIPAddressField`` where ``blank`` is allowed but ``null`` is not will trigger a model validation error because ``blank`` values are always stored as ``null``. Previously, storing a ``blank`` value in a field which did not allow ``null`` would cause a database exception at runtime.
id: :class:`~django.db.models.GenericIPAddressField` sekarang akan hanya mengizinkan nilai ``blank`` jika nilai ``null`` juga diizinkan. Membuat sebuah ``GenericIPAddressField`` dimana ``blank`` diizinkan tetapi ``null`` tidak akan memicu sebuah kesalahan pengesahan model karena nilai ``blank`` selalu disimpan sebagai ``null``. Sebelumnya, menyimpan nilai ``blank`` di bidang yang tidak mengizinkan ``null`` akan menyebabkan pengecualian basisdata pada waktu berjalan.
zh_hans: :class:`~django.db.models.GenericIPAddressField` 现在只允许 ``blank`` 值，如果也允许 ``null`` 值。如果创建一个 ``GenericIPAddressField``，允许 ``blank`` 但不允许 ``null``，将会触发模型验证错误，因为 ``blank`` 值总是被存储为 ``null``。以前，在一个不允许 ``null`` 的字段中存储一个 ``blank`` 值会在运行时引发数据库异常。

source: If a ``NoReverseMatch`` exception is raised from a method when rendering a template, it is not silenced. For example, ``{{ obj.view_href }}`` will cause template rendering to fail if ``view_href()`` raises ``NoReverseMatch``. There is no change to the :ttag:`{% url %}<url>` tag, it causes template rendering to fail like always when ``NoReverseMatch`` is raised.
zh_hans: 如果在渲染模板时从方法中引发了 ``NoReverseMatch`` 异常，它将不会被消除。例如，如果 ``view_href()`` 引发了 ``NoReverseMatch``，那么 ``{{ obj.view_href }}`` 将导致模板渲染失败。对于 :ttag:`{% url %}<url>` 标签没有改变，当引发 ``NoReverseMatch`` 时，它仍然会导致模板渲染失败。

source: :meth:`django.test.Client.logout` now calls :meth:`django.contrib.auth.logout` which will send the :func:`~django.contrib.auth.signals.user_logged_out` signal.
id: :meth:`django.test.Client.logout` sekarang memanggil :meth:`django.contrib.auth.logout` yang akan mengirim sinyal :func:`~django.contrib.auth.signals.user_logged_out`.
zh_hans: :meth:`django.test.Client.logout` 现在调用 :meth:`django.contrib.auth.logout`，它将发送 :func:`~django.contrib.auth.signals.user_logged_out` 信号。

source: :ref:`Authentication views <built-in-auth-views>` are now reversed by name, not their locations in ``django.contrib.auth.views``. If you are using the views without a ``name``, you should update your ``urlpatterns`` to use ``django.conf.urls.url()`` with the ``name`` parameter. For example::
zh_hans: :ref:`身份验证视图 <built-in-auth-views>` 现在通过名称反转，而不是它们在 ``django.contrib.auth.views`` 中的位置。如果您在没有 ``name`` 的情况下使用这些视图，您应该更新您的 ``urlpatterns`` 使用带有 ``name`` 参数的 ``django.conf.urls.url()``。例如：

source: :class:`~django.views.generic.base.RedirectView` now has a ``pattern_name`` attribute which allows it to choose the target by reversing the URL.
zh_hans: :class:`~django.views.generic.base.RedirectView` 现在有一个 ``pattern_name`` 属性，允许它通过反转 URL 来选择目标。

source: In Django 1.4 and 1.5, a blank string was unintentionally not considered to be a valid password. This meant :meth:`~django.contrib.auth.models.User.set_password()` would save a blank password as an unusable password like :meth:`~django.contrib.auth.models.User.set_unusable_password()` does, and thus :meth:`~django.contrib.auth.models.User.check_password()` always returned ``False`` for blank passwords. This has been corrected in this release: blank passwords are now valid.
id: Di Django 1.4 dan 1.5, string kosong tidak sengaja dianggap sandi yang sah. Ini berarti :meth:`~django.contrib.auth.models.User.set_password()` akan menyimpan sandi kosong sebagai sandi tidak berguna seperti :meth:`~django.contrib.auth.models.User.set_unusable_password()` lakukan, dan dengan demikian :meth:`~django.contrib.auth.models.User.check_password()` selalu dikembalikan ``False`` untuk sandi kosong. Ini telah diperbaiki di terbitan ini: sandi kosong adalah sekarang sah.
zh_hans: 在 Django 1.4 和 1.5 中，空字符串无意中被认为不是有效密码。这意味着 :meth:`~django.contrib.auth.models.User.set_password()` 会将空密码保存为不可用密码，就像 :meth:`~django.contrib.auth.models.User.set_unusable_password()` 一样，因此 :meth:`~django.contrib.auth.models.User.check_password()` 对于空密码始终返回 ``False``。在此版本中已经进行了修正：空密码现在是有效的。

source: The admin :attr:`~django.contrib.admin.ModelAdmin.changelist_view` previously accepted a ``pop`` GET parameter to signify it was to be displayed in a popup. This parameter has been renamed to ``_popup`` to be consistent with the rest of the admin views. You should update your custom templates if they use the previous parameter name.
id: Admin :attr:`~django.contrib.admin.ModelAdmin.changelist_view` sebelumnya menerima sebuah parameter GET ``pop`` untuk menandakan itu telah ditampilkan di popup. Parameter ini telah dinamai menjadi ``_popup`` untuk tetap konsisten dengan sisa dari tampilan admin. Anda harus memperbaharui cetakan penyesuaian anda jika mereka menggunakan nama parameter sebelumnya.
zh_hans: 管理员 :attr:`~django.contrib.admin.ModelAdmin.changelist_view` 以前接受一个 ``pop`` GET 参数，表示它将显示在弹出窗口中。现在已将此参数重命名为 ``_popup``，以使其与其他管理员视图保持一致。如果您的自定义模板使用了以前的参数名称，您应该进行更新。

source: :meth:`~django.core.validators.validate_email` now accepts email addresses with ``localhost`` as the domain.
id: :meth:`~django.core.validators.validate_email` sekarang menerima alamat surel dengan ``localhost`` sebagai ranah.
zh_hans: :meth:`~django.core.validators.validate_email` 现在接受具有 ``localhost`` 作为域名的电子邮件地址。

source: The new :option:`makemessages --keep-pot` option prevents deleting the temporary ``.pot`` file generated before creating the ``.po`` file.
zh_hans: 新的 :option:`makemessages --keep-pot` 选项防止在创建 ``.po`` 文件之前删除生成的临时 ``.pot`` 文件。

source: The undocumented ``django.core.servers.basehttp.WSGIServerException`` has been removed. Use ``socket.error`` provided by the standard library instead. This change was also released in Django 1.5.5.
id: ``django.core.servers.basehttp.WSGIServerException`` yang tidak didokumentasikan telah dipindahkan. Gunakan ``socket.error`` disediakan oleh pustaka standar sebagai gantinya. Perubahan ini juga diterbitkan di Django 1.5.5.
zh_hans: 未记录的 ``django.core.servers.basehttp.WSGIServerException`` 已被移除。请改用标准库提供的 ``socket.error``。这个变化也在 Django 1.5.5 中发布过。

source: The signature of :meth:`django.views.generic.base.RedirectView.get_redirect_url` has changed and now accepts positional arguments as well (``*args, **kwargs``). Any unnamed captured group will now be passed to ``get_redirect_url()`` which may result in a ``TypeError`` if you don't update the signature of your custom method.
id: Tanda tangan dari :meth:`django.views.generic.base.RedirectView.get_redirect_url` telah berubah dan sekarang menerima argumen penempatan juga (``*args, **kwargs``). Apapun kelompok ditangkap tidak bernama akan sekarang diloloskan ke ``get_redirect_url()`` yang mungkin menghasilkan sebuah ``TypeError`` jika anda tidak memperbaharui tanda tangan dari metode penyesuaian anda.
zh_hans: :meth:`django.views.generic.base.RedirectView.get_redirect_url` 的签名已更改，现在也接受位置参数（``*args, **kwargs``）。任何未命名的捕获组现在都将传递给 ``get_redirect_url()``，如果您不更新自定义方法的签名，可能会导致 ``TypeError``。

source: Features deprecated in 1.6
id: Fitur diusangkan di 1.6
zh_hans: 在 1.6 中被废弃的功能

source: Transaction management APIs
id: Transaksi pengelolaan API
zh_hans: 事务管理的 API

source: Transaction management was completely overhauled in Django 1.6, and the current APIs are deprecated:
id: Pengelolaan transaksi sepenuhnya dirombak di Django 1.6, dan API saat ini diusangkan:
zh_hans: Django 1.6 对事务管理进行了完全改进，并且当前的 API 已被弃用：

source: the ``TRANSACTIONS_MANAGED`` setting
id: Pengaturan ``TRANSACTIONS_MANAGED``
zh_hans: ``TRANSACTIONS_MANAGED`` 设置

source: Django's comment framework has been deprecated and is no longer supported. It will be available in Django 1.6 and 1.7, and removed in Django 1.8. Most users will be better served with a custom solution, or a hosted product like Disqus__.
id: Kerangka kerja komentar Django telah diusangkan dan tidak lagi didukung. Itu akan tersedia di Django 1.6 dan 1.7, dan dipindahkan di Django 1.8. Kebanyakan pengguna akan menjadi lebih baik dilayani dengan pemecahan penyesuaian, atau produk disimpan seperti Disqus__.
zh_hans: Django 的评论框架已被弃用，不再受支持。它将在 Django 1.6 和 1.7 中可用，并在 Django 1.8 中移除。大多数用户可以通过自定义解决方案或使用类似 Disqus 的托管产品来更好地满足其需求。

source: The code formerly known as ``django.contrib.comments`` is `still available in an external repository`__.
id: Kode dahulu dikenal sebagai ``django.contrib.comments`` `still available in an external repository`__.
zh_hans: 以前被称为 ``django.contrib.comments`` 的代码仍然可以在一个外部存储库中获得。

source: Support for PostgreSQL versions older than 8.4
id: Mendukung untuk PostgreSQL versi lebih lama dari 8.4
zh_hans: 不支持早于 8.4 版本的 PostgreSQL 。

source: The end of upstream support periods was reached in December 2011 for PostgreSQL 8.2 and in February 2013 for 8.3. As a consequence, Django 1.6 sets 8.4 as the minimum PostgreSQL version it officially supports.
id: Akhir dari masa dukungan hulu telah tercapai di Desember 2011 untuk PostgreSQL 8.2 dan di February 2013 untuk 8.3. Sebagai konsekuensinya, Django 1.6 menyetel 8.4 sebagai versi minimal PostgreSQL itu secara resmi dukung.
zh_hans: 在 PostgreSQL 8.2 的上游支持期限于 2011 年 12 月结束，而 8.3 的上游支持期限于 2013 年 2 月结束。因此，Django 1.6 将 8.4 版本设置为它正式支持的最低 PostgreSQL 版本。

source: You're strongly encouraged to use the most recent version of PostgreSQL available, because of performance improvements and to take advantage of the native streaming replication available in PostgreSQL 9.x.
id: Anda sangat didorong menggunakan versi paling terakhir dari PostgreSQL tersedia, karena dari perbaikan peningkatan dan untuk mengambil keuntungan dari replikasi aliran alamiah tersedia di PostgreSQL 9.x.
zh_hans: 强烈建议您使用最新版本的可用的 PostgreSQL，以利用性能改进和 PostgreSQL 9.x 中可用的原生流复制功能。

source: Changes to :ttag:`cycle` and :ttag:`firstof`
id: Perubahan ke :ttag:`cycle` dan :ttag:`firstof`
zh_hans: 对 :ttag:`cycle` 和 :ttag:`firstof` 的更改

source: The template system generally escapes all variables to avoid XSS attacks. However, due to an accident of history, the :ttag:`cycle` and :ttag:`firstof` tags render their arguments as-is.
id: Sistem cetakan umumnya meloloskan semua variabel untuk menghindari serangan XSS. Bagaimanaoun, karena sebuah kecelakaan sejarah, etiket :ttag:`cycle` dan :ttag:`firstof` membangun argumen mereka dengan adanya.
zh_hans: 模板系统通常会对所有变量进行转义，以防止 XSS 攻击。然而，由于历史原因，:ttag:`cycle` 和 :ttag:`firstof` 标签会原样呈现其参数。

source: Django 1.6 starts a process to correct this inconsistency. The ``future`` template library provides alternate implementations of :ttag:`cycle` and :ttag:`firstof` that autoescape their inputs. If you're using these tags, you're encouraged to include the following line at the top of your templates to enable the new behavior:
zh_hans: Django 1.6 开始了一个过程来纠正这个不一致性。``future`` 模板库提供了 :ttag:`cycle` 和 :ttag:`firstof` 的替代实现，它们会自动转义其输入。如果您使用这些标签，建议在模板顶部包含以下行以启用新的行为：

source: or:
zh_hans: 或：

source: The tags implementing the old behavior have been deprecated, and in Django 1.8, the old behavior will be replaced with the new behavior. To ensure compatibility with future versions of Django, existing templates should be modified to use the ``future`` versions.
id: Etiket menerapkan perilaku lama telah diusangkan, dan di Django 1.8, perilaku lama akan diganti dengan perilaku baru. Untuk memastikan kesesuaian dengan versi masa depan dari Django, cetakan yang ada harus dirubah untuk menggunakan versi ``future``.
zh_hans: 实现旧行为的标签已被弃用，并且在 Django 1.8 中，旧行为将被新行为替代。为了确保与未来版本的 Django 兼容，现有模板应该被修改以使用 ``future`` 版本。

source: If necessary, you can temporarily disable auto-escaping with :func:`~django.utils.safestring.mark_safe` or :ttag:`{% autoescape off %} <autoescape>`.
id: Jika diperlukan, anda dapat sementara meniadakan pelolosan-otomatis dengan :func:`~django.utils.safestring.mark_safe` atau :ttag:`{% autoescape off %} <autoescape>`.
zh_hans: 如有必要，您可以使用 :func:`~django.utils.safestring.mark_safe` 或 :ttag:`{% autoescape off %} <autoescape>` 来暂时禁用自动转义。

source: ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` setting
id: Pengaturan ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY``
zh_hans: ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` 设置

source: ``CacheMiddleware`` and ``UpdateCacheMiddleware`` used to provide a way to cache requests only if they weren't made by a logged-in user. This mechanism was largely ineffective because the middleware correctly takes into account the ``Vary: Cookie`` HTTP header, and this header is being set on a variety of occasions, such as:
id: ``CacheMiddleware`` dan ``UpdateCacheMiddleware`` digunakan untuk menyediakan cara untuk menyimpan sementara permintaan hanya jika mereka tidak dibuat oleh pengguna masuk. Mekanisme ini telah sebagian besar tidak efektif karena middleware dengan benar mengambil kedalam akun kepala HTTP ``Vary: Cookie``, dan kepala ini sedang dikirim di berbagai kesempatan, seperti:
zh_hans: ``CacheMiddleware`` 和 ``UpdateCacheMiddleware`` 曾经提供了一种只有在请求不是由已登录用户发起时才缓存的方法。这个机制在很大程度上是无效的，因为中间件正确地考虑了 ``Vary: Cookie`` HTTP 头，而这个头在各种情况下都被设置，比如：

source: accessing the session, or
id: mengkases sesi, atau
zh_hans: 访问会话，或者

source: using CSRF protection, which is turned on by default, or
id: menggunakan perlindungan CSRF, yang menghidupkan secara awal, atau
zh_hans: 使用默认启用的 CSRF 保护，或者

source: using a client-side library which sets cookies, like `Google Analytics`__.
id: menggunakan pustaka sisi klien yang menyetel kue, seperti `Google Analytics`__.
zh_hans: 使用客户端库设置了 cookies，比如 `Google Analytics`__。

source: This makes the cache effectively work on a per-session basis regardless of the ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` setting.
id: Ini membuat tembolok secara efektif bekerja pada berdasarkan per-sesi tanpa memperhatikan pengaturan ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY``.
zh_hans: 这使得缓存在每个会话中都能有效地工作，而不受 ``CACHE_MIDDLEWARE_ANONYMOUS_ONLY`` 设置的影响。

source: ``SEND_BROKEN_LINK_EMAILS`` setting
id: Pengaturan ``SEND_BROKEN_LINK_EMAILS``
zh_hans: ``SEND_BROKEN_LINK_EMAILS`` 设置

source: :class:`~django.middleware.common.CommonMiddleware` used to provide basic reporting of broken links by email when ``SEND_BROKEN_LINK_EMAILS`` is set to ``True``.
id: :class:`~django.middleware.common.CommonMiddleware` digunakan untuk menyediakan pelaporan dasar dari tautan rusak oleh surel ketika ``SEND_BROKEN_LINK_EMAILS`` disetel menjadi ``True``.
zh_hans: :class:`~django.middleware.common.CommonMiddleware` 用于在 ``SEND_BROKEN_LINK_EMAILS`` 设置为 ``True`` 时通过电子邮件提供损坏链接的基本报告。

source: Because of intractable ordering problems between :class:`~django.middleware.common.CommonMiddleware` and :class:`~django.middleware.locale.LocaleMiddleware`, this feature was split out into a new middleware: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware`.
id: Karena masalah pengurutan yang keras kepala diantara :class:`~django.middleware.common.CommonMiddleware` dan :class:`~django.middleware.locale.LocaleMiddleware`, fitur ini telah dipisah menjadi middleware: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware`.
zh_hans: 由于 :class:`~django.middleware.common.CommonMiddleware` 和 :class:`~django.middleware.locale.LocaleMiddleware` 之间存在难以解决的顺序问题，因此这个功能被拆分成了一个新的中间件： :class:`~django.middleware.common.BrokenLinkEmailsMiddleware`。
