Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Removed null assignment check for non-null foreign key fields
id: Dipindahkan pemeriksaan penugasan null untuk bidang foreign key bukan-null
zh_hans: 删除了非空外键字段的空值赋值检查。

source: In older versions, assigning ``None`` to a non-nullable ``ForeignKey`` or ``OneToOneField`` raised ``ValueError('Cannot assign None: "model.field" does not allow null values.')``. For consistency with other model fields which don't have a similar check, this check is removed.
id: Dalam versi terlama, menugaskan ``None`` pada ``ForeignKey`` atau ``OneToOneField`` nukan-null memunculkan ``ValueError('Cannot assign None: "model.field" does not allow null values.')``. Untuk ketidakkonsistenan dengan bidang model lain yang tidak mempunyai pemeriksaan sama, pemeriksaan ini dipindahkan.
zh_hans: 在旧版本中，将 ``None`` 分配给非空 ``ForeignKey`` 或 ``OneToOneField`` 会引发 ``ValueError('Cannot assign None: "model.field" does not allow null values.')``。为了与没有类似检查的其他模型字段保持一致，此检查已被移除。

source: Removed weak password hashers from the default ``PASSWORD_HASHERS`` setting
id: Dipindahkan pengacak sandi lemah dari pengaturan ``PASSWORD_HASHERS`` awal
zh_hans: 从默认的 ``PASSWORD_HASHERS`` 设置中移除了弱密码哈希器。

source: Django 0.90 stored passwords as unsalted MD5. Django 0.91 added support for salted SHA1 with automatic upgrade of passwords when a user logs in. Django 1.4 added PBKDF2 as the default password hasher.
id: Django 0.90 menyimpan sandi sebagai MD5 tidak tergarami. Django 0.91 ditambahkan dukungan untuk SHA1 tergarami dengan peningkatan otomatis dari sandi ketika penggina masuk. Django 1.4 ditambahkan PBKDF2 sebagai pengacak sandi awal.
zh_hans: Django 0.90 将密码存储为未加盐的 MD5 。 Django 0.91 添加了对加盐 SHA1 的支持，并在用户登录时自动升级密码。 Django 1.4 将 PBKDF2 作为默认密码哈希器。

source: If you have an old Django project with MD5 or SHA1 (even salted) encoded passwords, be aware that these can be cracked fairly easily with today's hardware. To make Django users acknowledge continued use of weak hashers, the following hashers are removed from the default :setting:`PASSWORD_HASHERS` setting::
id: Jika anda mempunyai proyek Django lama dengan MD5 atau SHA1 (bahkan tergarami) sandi dikodekan, sadarilah bahwa ini dapat dirusak dengan mudah dengan perangkat keras hari ini. Untuk membuat pengguna Django mengakui penggunaan berkelanjutan dari pengacak lemah, pencampur berikut dipindahkan dari :setting:`PASSWORD_HASHERS` setting awal::
zh_hans: 如果您有一个旧的 Django 项目，其中包含使用 MD5 或 SHA1（即使使用了盐值）编码的密码，请注意，这些密码可以在今天的硬件上相对容易地被破解。为了让 Django 用户确认继续使用弱哈希器，以下哈希器已从默认的 :setting:`PASSWORD_HASHERS` 设置中移除：

source: Consider using a :ref:`wrapped password hasher <wrapping-password-hashers>` to strengthen the hashes in your database. If that's not feasible, add the :setting:`PASSWORD_HASHERS` setting to your project and add back any hashers that you need.
id: Pertimbangkan menggunakan :ref:`wrapped password hasher <wrapping-password-hashers>` untuk menguatkan campuran di basisdata anda. Jika itu tidak layak, tambah pengaturan :setting:`PASSWORD_HASHERS` ke proyek anda dan tambah kembali pencampur apapun yang anda butuhkan.
zh_hans: 考虑使用一个 :ref:`包装的密码哈希器 <wrapping-password-hashers>` 来加强数据库中的哈希值。如果这不可行，可以将 :setting:`PASSWORD_HASHERS` 设置添加到您的项目中，并添加回您需要的任何哈希器。

source: You can check if your database has any of the removed hashers like this::
id: Anda dapat memeriksa jika basisdata anda mempunyai tiap dari pengacak dipindahkan seperti ini::
zh_hans: 您可以像这样检查您的数据库是否具有任何已删除的哈希器：

source: ``Field.get_prep_lookup()`` and ``Field.get_db_prep_lookup()`` methods are removed
id: Metode ``Field.get_prep_lookup()`` dan ``Field.get_db_prep_lookup()`` dipindahkan.
zh_hans: ``Field.get_prep_lookup()`` 和 ``Field.get_db_prep_lookup()`` 方法已被移除。

source: If you have a custom field that implements either of these methods, register a custom lookup for it. For example::
id: Jika anda mempunyai bidang penyesuaian yang menerapkan baik metode ini, mendaftarkan pencarian penyesuaian untuknya. Sebagai contoh::
zh_hans: 如果您有一个自定义字段实现了这两种方法中的任何一种，请为其注册一个自定义查找。例如：

source: Support for SpatiaLite < 3.0 and GEOS < 3.3 is dropped.
id: Dukungan untuk SpatiaLite < 3.0 dan GEOS < 3.3 dibuang.
zh_hans: 不再支持 SpatiaLite < 3.0 和 GEOS < 3.3 。

source: The ``add_postgis_srs()`` backwards compatibility alias for ``django.contrib.gis.utils.add_srs_entry()`` is removed.
id: Nama lain kesesuaian kebelakang ``add_postgis_srs()`` untuk ``django.contrib.gis.utils.add_srs_entry()`` dipindahkan.
zh_hans: ``add_postgis_srs()`` 的向后兼容别名已被移除，应使用 ``django.contrib.gis.utils.add_srs_entry()``。

source: On Oracle/GIS, the :class:`~django.contrib.gis.db.models.functions.Area` aggregate function now returns a ``float`` instead of ``decimal.Decimal``. (It's still wrapped in a measure of square meters.)
id: Pada Oracle/GIS, fungsi pengumpulan :class:`~django.contrib.gis.db.models.functions.Area` sekarang mengembalikan ``float`` daripada ``decimal.Decimal``. (Itu masih dibungkus dalam ukuran meter persegi.)
zh_hans: 在 Oracle/GIS 上，:class:`~django.contrib.gis.db.models.functions.Area` 聚合函数现在返回一个 ``float``，而不再是 ``decimal.Decimal``。（它仍然以平方米为单位包装。）

source: The default :class:`~django.contrib.gis.geos.GEOSGeometry` representation (WKT output) is trimmed by default. That is, instead of ``POINT (23.0000000000000000 5.5000000000000000)``, you'll get ``POINT (23 5.5)``.
id: Perwakilan :class:`~django.contrib.gis.geos.GEOSGeometry` awal (keluaran WKT) dipangkas secara awal. Yaitu, daripada ``POINT (23.0000000000000000 5.5000000000000000)``, anda akan mendapatkan ``POINT (23 5.5)``.
zh_hans: 默认情况下，:class:`~django.contrib.gis.geos.GEOSGeometry` 的表示形式（WKT 输出）现在默认被修剪。也就是说，不再是 ``POINT (23.0000000000000000 5.5000000000000000)``，而是 ``POINT (23 5.5)``。

source: Maximum size of a request body and the number of GET/POST parameters is limited
id: Ukuran maksimum dari permintaan badan dan angka dari parameter GET/POST dibatasi
zh_hans: 请求体的最大大小以及 GET/POST 参数的数量受到限制。

source: Two new settings help mitigate denial-of-service attacks via large requests:
id: Dua pengaturan baru membantu mengurangi serangan denial-of-service melalui permintaan besar:
zh_hans: 两个新配置有助于减轻通过大型请求发起的拒绝服务攻击：

source: :setting:`DATA_UPLOAD_MAX_MEMORY_SIZE` limits the size that a request body may be. File uploads don't count toward this limit.
zh_hans: :setting:`DATA_UPLOAD_MAX_MEMORY_SIZE` 限制请求主体的大小。文件上传不计入此限制。

source: :setting:`DATA_UPLOAD_MAX_NUMBER_FIELDS` limits the number of GET/POST parameters that are parsed.
id: :setting:`DATA_UPLOAD_MAX_NUMBER_FIELDS` membatasi angka dari parameter GET/POST yang diuraikan.
zh_hans: :setting:`DATA_UPLOAD_MAX_NUMBER_FIELDS` 限制解析的 GET/POST 参数的数量。

source: Applications that receive unusually large form posts may need to tune these settings.
id: Aplikasi yang menerima penempatan formulir tidak biasanya besar mungkin butuh merubah pengaturan ini.
zh_hans: 接收异常大表单提交的应用程序可能需要调整这些设置。

source: Miscellaneous
id: Bermacam-macam
zh_hans: 杂项

source: The ``repr()`` of a ``QuerySet`` is wrapped in ``<QuerySet >`` to disambiguate it from a plain list when debugging.
id: ``repr()`` dari ``QuerySet`` dibungkus dalam ``<QuerySet >`` untuk memindahkan kedua artian nya dari daftar kosong ketika mencari kesalahan.
zh_hans: ``QuerySet`` 的 ``repr()`` 现在在调试时会包装在 ``<QuerySet >`` 中，以便与普通列表进行区分。

source: ``utils.version.get_version()`` returns :pep:`440` compliant release candidate versions (e.g. '1.10rc1' instead of '1.10c1').
id: ``utils.version.get_version()`` mengembalikan :pep:`440` versi calon terbitan (sebagai contoh '1.10rc1' instead of '1.10c1').
zh_hans: ``utils.version.get_version()`` 返回符合 :pep:`440` 的候选版本（例如 '1.10rc1' 而不是 '1.10c1'）。

source: CSRF token values are now required to be strings of 64 alphanumerics; values of 32 alphanumerics, as set by older versions of Django by default, are automatically replaced by strings of 64 characters. Other values are considered invalid. This should only affect developers or users who replace these tokens.
id: Nilai token CSRF sekarang diwajibkan menjadi deretan karakter 64 alfanumerik; nilai dari 32 alfanumerik, seperti disetel oleh versi terlama Django secara awal, otomatis diganti dengan deretan karakter dari 64 karakter. Nilai lain dianggap tidak sah. Ini harus hanya mempengaruhi pengembang atau pengguna yang mengganti token ini.
zh_hans: 现在要求 CSRF 令牌值必须是 64 个字母数字字符串；默认情况下，由旧版 Django 设置的 32 个字母数字值将自动替换为 64 个字符的字符串。其他值将被视为无效。这应该只会影响替换这些令牌的开发人员或用户。

source: The ``LOGOUT_URL`` setting is removed as Django hasn't made use of it since pre-1.0. If you use it in your project, you can add it to your project's settings. The default value was ``'/accounts/logout/'``.
id: Pengaturan ``LOGOUT_URL`` dipindahkan sebagai Django belum membuat menggunakannya sejak pra-1.0. Jika anda ingin menggunakannya di proyek anda, anda dapat menambahkannya ke pengaturan proyek anda. Nilai awal adalah ``'/accounts/logout/'``.
zh_hans: ``LOGOUT_URL`` 设置已删除，因为自 1.0 版本以来 Django 不再使用它。如果你在项目中使用了它，可以将其添加到项目的设置中。默认值是 ``'/accounts/logout/'``。

source: Objects with a ``close()`` method such as files and generators passed to :class:`~django.http.HttpResponse` are now closed immediately instead of when the WSGI server calls ``close()`` on the response.
id: Obyek dengan metode ``close()`` seperti berkas dan pembangkit dilewatkan ke :class:`~django.http.HttpResponse` sekarang ditutup segera sebagai gantinya ketika peladen WSGI memanggil ``close()`` pada tanggapan.
zh_hans: 具有 ``close()`` 方法的对象，例如文件和生成器，传递给 :class:`~django.http.HttpResponse` 现在会立即关闭，而不是在 WSGI 服务器调用响应的 ``close()`` 方法时关闭。

source: A redundant ``transaction.atomic()`` call in ``QuerySet.update_or_create()`` is removed. This may affect query counts tested by ``TransactionTestCase.assertNumQueries()``.
id: Memanggil ``transaction.atomic()`` berlebihan dalam ``QuerySet.update_or_create()`` dipindahkan. Ini mungkin mempengaruhi permintaan perhitungan dicoba oleh ``TransactionTestCase.assertNumQueries()``.
zh_hans: 在 ``QuerySet.update_or_create()`` 中删除了多余的 ``transaction.atomic()`` 调用。这可能会影响 ``TransactionTestCase.assertNumQueries()`` 测试的查询计数。

source: Support for ``skip_validation`` in ``BaseCommand.execute(**options)`` is removed. Use ``skip_checks`` (added in Django 1.7) instead.
id: Dukungan untuk ``skip_validation`` di ``BaseCommand.execute(**options)`` dipindahkan. Gunakan ``skip_checks`` (ditambahkan di Django 1.7) sebagai gantinya.
zh_hans: 在 ``BaseCommand.execute(**options)`` 中删除了对 ``skip_validation`` 的支持。请改用 ``skip_checks`` （Django 1.7 中添加）来代替。

source: :djadmin:`loaddata` now raises a ``CommandError`` instead of showing a warning when the specified fixture file is not found.
id: :djadmin:`loaddata` sekarang memunculkan sebuah ``CommandError`` sebagai gantinya dari menampilkan sebuah peringatan ketika berkas peralatan tetap ditentukan tidak ditemukan.
zh_hans: 现在，在指定的夹具文件未找到时，:djadmin:`loaddata` 将引发一个 ``CommandError``，而不是显示警告。

source: Instead of directly accessing the ``LogEntry.change_message`` attribute, it's now better to call the ``LogEntry.get_change_message()`` method which will provide the message in the current language.
id: Daripada secara langsung mengakses atribut ``LogEntry.change_message``, sekarang lebih baik memanggil metode ``LogEntry.get_change_message()`` yang akan menyediakan pesan di bahasa saat ini.
zh_hans: 现在，最好调用 ``LogEntry.get_change_message()`` 方法来获取日志条目的消息，而不是直接访问 ``LogEntry.change_message`` 属性，这样可以提供当前语言的消息。

source: The default error views now raise ``TemplateDoesNotExist`` if a nonexistent ``template_name`` is specified.
id: Tampilan kesalahan awal sekarang menampilkan ``TemplateDoesNotExist`` jika ``template_name`` tidak ada ditentukan.
zh_hans: 如果指定了不存在的 ``template_name``，默认错误视图现在会引发 ``TemplateDoesNotExist`` 异常。

source: The unused ``choices`` keyword argument of the ``Select`` and ``SelectMultiple`` widgets' ``render()`` method is removed. The ``choices`` argument of the ``render_options()`` method is also removed, making ``selected_choices`` the first argument.
id: Argumen kata kunci ``choices`` tidak digunakan dari widgets ``Select`` dan ``SelectMultiple`` metode ``render()`` dipindahkan. Argumen ``choices`` dari metode ``render_options()`` juga dipindahkan, membuat ``selected_choices`` argumen pertama.
zh_hans: ``Select`` 和 ``SelectMultiple`` 小部件的 ``render()`` 方法中未使用的 ``choices`` 关键字参数已被移除。 ``render_options()`` 方法中的 ``choices`` 参数也已被移除，现在 ``selected_choices`` 是第一个参数。

source: Tests that violate deferrable database constraints will now error when run on a database that supports deferrable constraints.
id: Percobaan yang melanggar penundaan batasan basisdatasekarang akan salah ketika berjalan pada sebuah basisdata yang mendukung batasan penundaan.
zh_hans: 现在，在支持可延迟约束的数据库上运行的违反可延迟数据库约束的测试将会出现错误。

source: Built-in management commands now use indexing of keys in ``options``, e.g. ``options['verbosity']``, instead of ``options.get()`` and no longer perform any type coercion. This could be a problem if you're calling commands using ``Command.execute()`` (which bypasses the argument parser that sets a default value) instead of :func:`~django.core.management.call_command`. Instead of calling ``Command.execute()``, pass the command object as the first argument to ``call_command()``.
id: Perintah pengelolaan pasang-tetap sekarang menggunakan pengindeksan dari kunci di ``options``, sebagai contoh ``options['verbosity']``, daripada ``options.get()`` dan tidak lagi melakukan jenis paksaan apapun. Ini dapat menjadi sebuah masalah jika anda sedang memanggil perintah menggunakan ``Command.execute()`` (yang melewatkan pengurai argumen yang menyetel nilai awalan) daripada :func:`~django.core.management.call_command`. Daripada memanggil ``Command.execute()``, lewati obyek perintah sebagai argumen pertama untuk ``call_command()``.
zh_hans: 内置管理命令现在使用 ``options`` 中键的索引，例如 ``options['verbosity']``，而不是 ``options.get()``，并且不再执行任何类型强制转换。如果你正在使用 ``Command.execute()`` 调用命令（绕过设置默认值的参数解析器），而不是 :func:`~django.core.management.call_command`，这可能会导致问题。不要调用 ``Command.execute()``，而是将命令对象作为第一个参数传递给 ``call_command()``。

source: :class:`~django.contrib.auth.backends.ModelBackend` and :class:`~django.contrib.auth.backends.RemoteUserBackend` now reject inactive users. This means that inactive users can't login and will be logged out if they are switched from ``is_active=True`` to ``False``. If you need the previous behavior, use the new :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` or :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` in :setting:`AUTHENTICATION_BACKENDS` instead.
id: :class:`~django.contrib.auth.backends.ModelBackend` dan :class:`~django.contrib.auth.backends.RemoteUserBackend` sekarang menolak pengguna tidak aktif. Ini berarti bahwa pengguna tidak aktif tidak dapat masuk dan akan keluar jika mereka diganti dari ``is_active=True`` menjadi ``False``. Jika anda butuh perilaku sebelumnya, gunakan :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` atau :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` di :setting:`AUTHENTICATION_BACKENDS` sebagai gantinya.
zh_hans: :class:`~django.contrib.auth.backends.ModelBackend` 和 :class:`~django.contrib.auth.backends.RemoteUserBackend` 现在会拒绝不活跃的用户。这意味着不活跃的用户无法登录，如果将他们从 ``is_active=True`` 更改为 ``False``，他们将被登出。如果需要以前的行为，请在 :setting:`AUTHENTICATION_BACKENDS` 中使用新的 :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` 或 :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend`。

source: In light of the previous change, the test client's :meth:`~django.test.Client.login()` method no longer always rejects inactive users but instead delegates this decision to the authentication backend. :meth:`~django.test.Client.force_login()` also delegates the decision to the authentication backend, so if you're using the default backends, you need to use an active user.
id: Dalam terangnya perubahan sebelumnya, percobaan metode :meth:`~django.test.Client.login()` klien tidak lagi selalu menolak pengguna tidak aktif tetapi malahan menugaskan keputusan ini ke backend otentifikasi. :meth:`~django.test.Client.force_login()` juga menugaskan keputusan ke backend otentifikasi, jadi jika anda sedang menggunakan backend awal, anda butuh menggunakan pengguna aktif.
zh_hans: 鉴于先前的更改，测试客户端的 :meth:`~django.test.Client.login()` 方法不再始终拒绝不活跃的用户，而是将这个决定委托给身份验证后端。 :meth:`~django.test.Client.force_login()` 也将决定委托给身份验证后端，因此如果你使用默认的后端，你需要使用一个活跃的用户。

source: :func:`django.views.i18n.set_language` may now return a 204 status code for AJAX requests.
id: :func:`django.views.i18n.set_language` sekarang mungkin mengembalikan kode keadaan 204 untuk permintaan AJAX.
zh_hans: :func:`django.views.i18n.set_language` 现在可以为 AJAX 请求返回一个 204 状态码。

source: The ``base_field`` attribute of :class:`~django.contrib.postgres.fields.RangeField` is now a type of field, not an instance of a field. If you have created a custom subclass of :class:`~django.contrib.postgres.fields.RangeField`, you should change the ``base_field`` attribute.
id: Atribut ``base_field`` dari :class:`~django.contrib.postgres.fields.RangeField` sekarang jenis dari bidang, bukan sebuah instance dari bidang. Jika anda telah membuat subkelas penyesuaian dari :class:`~django.contrib.postgres.fields.RangeField`, anda harus merubah atribut ``base_field``.
zh_hans: :class:`~django.contrib.postgres.fields.RangeField` 的 ``base_field`` 属性现在是一个字段类型，而不是字段的实例。如果你创建了 :class:`~django.contrib.postgres.fields.RangeField` 的自定义子类，你应该更改 ``base_field`` 属性。

source: Middleware classes are now initialized when the server starts rather than during the first request.
id: Kelas-kelas middleware sekarang diinisialisasikan ketika peladen mulai daripada selama permintaan pertama.
zh_hans: 现在，中间件类在服务器启动时初始化，而不是在第一个请求期间。

source: If you override ``is_authenticated()`` or ``is_anonymous()`` in a custom user model, you must convert them to attributes or properties as described in :ref:`the deprecation note <user-is-auth-anon-deprecation>`.
id: Jika anda menimpa ``is_authenticated()`` atau ``is_anonymous()`` dalam model pengguna penyesuaian, anda harus merubah mereka ke atribut atau sifat seperti digambarkan di :ref:`the deprecation note <user-is-auth-anon-deprecation>`.
zh_hans: 如果你在自定义用户模型中重写了 ``is_authenticated()`` 或 ``is_anonymous()`` 方法，你必须将它们转换为属性或属性，如 :ref:`弃用说明 <user-is-auth-anon-deprecation>` 中所述。

source: When using :attr:`ModelAdmin.save_as=True <django.contrib.admin.ModelAdmin.save_as>`, the "Save as new" button now redirects to the change view for the new object instead of to the model's changelist. If you need the previous behavior, set the new :attr:`ModelAdmin.save_as_continue <django.contrib.admin.ModelAdmin.save_as_continue>` attribute to ``False``.
id: Ketika menggunakan :attr:`ModelAdmin.save_as=True <django.contrib.admin.ModelAdmin.save_as>`, tombol "Save as new" sekarang mengalihkan ke merubah tampilan untuk obyek baru daripada ke daftar rubah model. Jika anda butuh perilaku sebelumnya, setel atribut :attr:`ModelAdmin.save_as_continue <django.contrib.admin.ModelAdmin.save_as_continue>` baru menjadi ``False``.
zh_hans: 当使用 :attr:`ModelAdmin.save_as=True <django.contrib.admin.ModelAdmin.save_as>` 时，"Save as new" 按钮现在会重定向到新对象的修改视图，而不是模型的变更列表。如果你需要之前的行为，请将新的 :attr:`ModelAdmin.save_as_continue <django.contrib.admin.ModelAdmin.save_as_continue>` 属性设置为 ``False``。

source: Required form fields now have the ``required`` HTML attribute. Set the :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` attribute to ``False`` to disable it. You could also add the ``novalidate`` attribute to ``<form>`` if you don't want browser validation. To disable the ``required`` attribute on custom widgets, override the :meth:`Widget.use_required_attribute() <django.forms.Widget.use_required_attribute>` method.
id: Bidang-bidang formulir diwajibkan sekarang mempunyai atribut HTML ``required``. Setel atribut :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` menjadi ``False`` untuk meniadakannya. Anda dapat juga menambah atribut ``novalidate`` pada ``<form>`` jika anda tidak ingin pengesahan peramban. Untuk meniadakan atribut ``required`` pada widget penyesuaian, menimpa metode :meth:`Widget.use_required_attribute() <django.forms.Widget.use_required_attribute>`.
zh_hans: 必填的表单字段现在具有 ``required`` HTML 属性。如果要禁用它，请将 :attr:`Form.use_required_attribute <django.forms.Form.use_required_attribute>` 属性设置为 ``False``。如果不想要浏览器验证，还可以在 ``<form>`` 中添加 ``novalidate`` 属性。如果要在自定义小部件上禁用 ``required`` 属性，请重写 :meth:`Widget.use_required_attribute() <django.forms.Widget.use_required_attribute>` 方法。

source: The WSGI handler no longer removes content of responses from ``HEAD`` requests or responses with a ``status_code`` of 100-199, 204, or 304. Most web servers already implement this behavior. Responses retrieved using the Django test client continue to have these "response fixes" applied.
zh_hans: WSGI 处理程序不再从 ``HEAD`` 请求或具有 ``status_code`` 为 100-199、204 或 304 的响应中删除内容。大多数 Web 服务器已经实现了这种行为。使用 Django 测试客户端检索的响应仍然会应用这些 "响应修复"。

source: ``Model.__init__()`` now receives ``django.db.models.DEFERRED`` as the value of deferred fields.
id: ``Model.__init__()`` sekarang menerima ``django.db.models.DEFERRED`` sebagai nilai dari bidang-bidang yang ditangguhkan.
zh_hans: ``Model.__init__()`` 现在会将 ``django.db.models.DEFERRED`` 作为延迟字段的值。

source: The ``Model._deferred`` attribute is removed as dynamic model classes when using ``QuerySet.defer()`` and ``only()`` is removed.
id: Atribut ``Model._deferred`` dpindahkan sebagai kelas-kelas model dinamis ketika menggunakan ``QuerySet.defer()`` dan ``only()`` dipindahkan.
zh_hans: ``Model._deferred`` 属性在使用 ``QuerySet.defer()`` 和 ``only()`` 时动态模型类被移除。

source: :meth:`Storage.save() <django.core.files.storage.Storage.save>` no longer replaces ``'\'`` with ``'/'``. This behavior is moved to :class:`~django.core.files.storage.FileSystemStorage` since this is a storage specific implementation detail. Any Windows user with a custom storage implementation that relies on this behavior will need to implement it in the custom storage's ``save()`` method.
id: :meth:`Storage.save() <django.core.files.storage.Storage.save>` tidak lagi mengganti ``'\'`` dengan ``'/'``. Perilaku ini dipindahkan ke :class:`~django.core.files.storage.FileSystemStorage` sejak ini adalah rincian penerapan penyimpanan khusus. Tiap pengguna Windows dengan penerapan penyimpanan penyesuaian yang mengandalkan pada perilaku ini akan butuh menerapkannya di metode ``save()`` penyimpanan penyesuaian.
zh_hans: :meth:`Storage.save() <django.core.files.storage.Storage.save>` 不再将 ``'\'`` 替换为 ``'/'``。这个行为已经移到 :class:`~django.core.files.storage.FileSystemStorage` 中，因为这是一个与存储相关的具体实现细节。如果有自定义存储实现依赖这个行为的 Windows 用户，需要在自定义存储的 ``save()`` 方法中实现这个行为。
