Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The packaging manifest did not contain the full list of required files.
id: Wujud pemaketan tidak mengandung daftar penuh dari berkas-berkas dibutuhkan.
zh_hans: 打包清单中未包含所需文件的完整列表。

source: Django 1.2.4 release notes
id: Catatan terbitan Django 1.2.4
zh_hans: Django 1.2.4 版本发行说明

source: Welcome to Django 1.2.4!
id: Selamat datang di Django 1.2.4!
zh_hans: 欢迎来到 Django 1.2.4 版本！

source: This is the fourth "bugfix" release in the Django 1.2 series, improving the stability and performance of the Django 1.2 codebase.
id: Ini adalah terbitan "bugfix" keempat di rangkaian Django 1.2, memperbaiki kestabilan dan penampilan dari kode dasar Django 1.2.
zh_hans: 这是 Django 1.2 系列中的第四个“修复错误”的版本，提高了 Django 1.2 代码库的稳定性和性能。

source: With one exception, Django 1.2.4 maintains backwards compatibility with Django 1.2.3. It also contains a number of fixes and other improvements. Django 1.2.4 is a recommended upgrade for any development or deployment currently using or targeting Django 1.2.
id: Dengan satu pengecualian, Django 1.2.4 merawat kesesuaian kebelakang dengan Django 1.2.3. Itu juga mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.2.4 adalah peningkatan dianjurkan untuk setiap pengembangan dan penyebaran saat ini menggunakan atau menyasar Django 1.2.
zh_hans: 除一个例外外，Django 1.2.4 保持了与 Django 1.2.3 的向后兼容性。它还包含了许多修复和其他改进。对于当前使用或针对 Django 1.2 的任何开发或部署，建议升级到 Django 1.2.4 。

source: Ordinarily, a point release would not include new features, but in the case of Django 1.2.4, we have made an exception to this rule.
id: Aslinya, titik terbitan akan tidak menyertakan fitur baru, tetapi dalam kasus Django 1.2.4, kami telah membuat sebuah pengecualian pada aturan ini.
zh_hans: 通常情况下，一个小版本更新不会包含新功能，但在 Django 1.2.4 的情况下，我们对这个规则做了一个例外。

source: One of the bugs fixed in Django 1.2.4 involves a set of circumstances whereby a running a test suite on a multiple database configuration could cause the original source database (i.e., the actual production database) to be dropped, causing catastrophic loss of data. In order to provide a fix for this problem, it was necessary to introduce a new setting -- :setting:`TEST_DEPENDENCIES` -- that allows you to define any creation order dependencies in your database configuration.
id: Satu dari perbaikan kesalahan di Django 1.2.4 melibatkan sekumpulan dari keadaan dimana deretan percobaan berjalan pada konfigurasi banyak basisdata dapat menyebabkan sumber asli basisdata (yaitu, basisdata produksi sebenarnya) untuk dibuang, menyebabkan bencana kehilangan data. Untuk menyediakan sebuah perbaikan untuk masalah ini, itu sangat penting untuk memperkenalkan pengaturan baru -- :setting:`TEST_DEPENDENCIES` -- yang mengizinkan anda untuk menentukan apapun pembuatan urutan ketergantungan di konfigurasi basisdata anda.
zh_hans: Django 1.2.4 中修复的一个 bug 涉及在多数据库配置上运行测试套件时可能导致原始源数据库（即实际的生产数据库）被删除，从而导致数据灾难性丧失的一组情况。为了解决这个问题，需要引入一个新的设置 -- :setting:`TEST_DEPENDENCIES` -- 允许您在数据库配置中定义任何创建顺序依赖项。

source: Most users -- even users with multiple-database configurations -- need not be concerned about the data loss bug, or the manual configuration of :setting:`TEST_DEPENDENCIES`. See the :ticket:`original problem report <14415>` documentation on :ref:`controlling the creation order of test databases <topics-testing-creation-dependencies>` for details.
zh_hans: 大多数用户，甚至使用多数据库配置的用户，无需担心数据丢失的 bug，也不需要手动配置 :setting:`TEST_DEPENDENCIES`。有关详细信息，请参阅 :ticket:`原始问题报告 <14415>` 文档中的 :ref:`控制测试数据库创建顺序 <topics-testing-creation-dependencies>`。

source: The function-based :setting:`TEST_RUNNER` previously used to execute the GeoDjango test suite, ``django.contrib.gis.tests.run_gis_tests``, was finally deprecated in favor of a class-based test runner, ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``, added in this release.
id: :setting:`TEST_RUNNER` berdasarkan-fungsi sebelumnya digunakan untuk menjalankan deretan percobaan GeoDjango, ``django.contrib.gis.tests.run_gis_tests``, akhirnya diusangkan dalam mendukung pejalan percobaan berdasarkan kelas, ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``, ditambahkan di terbitan ini.
zh_hans: 用于执行 GeoDjango 测试套件的基于函数的 :setting:`TEST_RUNNER`，``django.contrib.gis.tests.run_gis_tests``，已经被弃用，改用了一个基于类的测试运行器，``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``，这个变化是在这个版本中添加的。

source: In addition, the GeoDjango test suite is now included when :ref:`running the Django test suite <running-unit-tests>` with ``runtests.py`` and using :ref:`spatial database backends <spatial-backends>`.
id: Sebagai tambahan, deretan percobaan GeoDjango sekarang disertakan ketika :ref:`running the Django test suite <running-unit-tests>` dengan ``runtests.py`` dan menggunakan :ref:`spatial database backends <spatial-backends>`.
zh_hans: 此外，在使用 ``runtests.py`` 运行 :ref:`Django 测试套件 <running-unit-tests>` 并使用 :ref:`空间数据库后端 <spatial-backends>` 时，现在已经包含了 GeoDjango 测试套件。

source: Django 1.2.5 release notes
id: Catatan terbitan Django 1.2.5
zh_hans: Django 1.2.5 版本发行说明

source: Welcome to Django 1.2.5!
id: Selamat datang di Django 1.2.5!
zh_hans: 欢迎来到 Django 1.2.5 版本！

source: This is the fifth "bugfix" release in the Django 1.2 series, improving the stability and performance of the Django 1.2 codebase.
id: Ini adalah terbitan "bugfix" kelima di rangkaian Django 1.2, memperbaiki kestabilan dan penampilan dari kode dasar Django 1.2.
zh_hans: 这是 Django 1.2 系列中的第五个“修复错误”的版本，提高了 Django 1.2 代码库的稳定性和性能。

source: With four exceptions, Django 1.2.5 maintains backwards compatibility with Django 1.2.4. It also contains a number of fixes and other improvements. Django 1.2.5 is a recommended upgrade for any development or deployment currently using or targeting Django 1.2.
id: Dengan empat pengecualian, Django 1.2.5 merawat kesesuaian kebelakang dengan Django 1.2.4. Itu juga mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.2.5 adalah peningkatan dianjurkan untuk setiap pengembangan dan penyebaran saat ini menggunakan atau menyasar Django 1.2.
zh_hans: 除四个例外外，Django 1.2.5 保持了与 Django 1.2.4 的向后兼容性。它还包含了许多修复和其他改进。对于当前使用或针对 Django 1.2 的任何开发或部署，建议升级到 Django 1.2.5 。

source: FileField no longer deletes files
id: FileField tidak lagi menghapus berkas-berkas
zh_hans: FileField 不再删除文件

source: In earlier Django versions, when a model instance containing a :class:`~django.db.models.FileField` was deleted, :class:`~django.db.models.FileField` took it upon itself to also delete the file from the backend storage. This opened the door to several potentially serious data-loss scenarios, including rolled-back transactions and fields on different models referencing the same file. In Django 1.2.5, :class:`~django.db.models.FileField` will never delete files from the backend storage. If you need cleanup of orphaned files, you'll need to handle it yourself (for instance, with a custom management command that can be run manually or scheduled to run periodically via e.g. cron).
id: Dalam versi paling awal Django, ketika sebuah instance model mengandung sebuah :class:`~django.db.models.FileField` dihapus, :class:`~django.db.models.FileField` mengambil itu pada dirinya sendiri untuk juga menghapus berkas dari penyimpanan backend. Ini membuat pintu untuk beberapa kemungkinan skenario kehilangan-data serius, termasuk transaksi dikembalikan dan bidang-bidang pada model berbeda mengacu berkas sama. Di Django 1.2.5, :class:`~django.db.models.FileField` tidak pernah menghapus berkas dari penyimpanan backend. Jika anda butuh membersihkan berkas-berkas tidak bertuan, anda akan butuh menangani nya anda sendiri (sebagai contoh, dengan perintah pengelolaan penyesuaian yang dapat berjalan secara manual atau terjadwal untuk berjalan secara periodeik melalui sebagai contoh cron).
zh_hans: 在较早的 Django 版本中，当删除包含 :class:`~django.db.models.FileField` 的模型实例时，:class:`~django.db.models.FileField` 会自行从后端存储中删除文件。这为几种潜在严重的数据丢失情况敞开了大门，包括回滚的事务和不同模型上的字段引用相同的文件。在 Django 1.2.5 中，:class:`~django.db.models.FileField` 将永远不会从后端存储中删除文件。如果需要清理孤立的文件，您需要自行处理（例如，使用一个自定义的管理命令，可以手动运行或通过 cron 定期运行）。

source: Use of custom SQL to load initial data in tests
id: Penggunaan SQL penyesuaian untuk memuat data inisial di percobaan
zh_hans: 在测试中使用自定义 SQL 加载初始数据

source: Django provides a custom SQL hooks as a way to inject hand-crafted SQL into the database synchronization process. One of the possible uses for this custom SQL is to insert data into your database. If your custom SQL contains ``INSERT`` statements, those insertions will be performed every time your database is synchronized. This includes the synchronization of any test databases that are created when you run a test suite.
id: Django menyediakan pengkaitan SQL penyesuaian sebagai sebuah cara untuk memasukkan SQL buah-tangan kedalam pengeolahan sinkronisasi basisdata. Satu dari kemungkinan penggunaan untuk penyesuaian SQL ini adalah memasukkan data kedalam basisdata anda. Jika SQL penyesuaian anda mengangund pernyataan ``INSERT``, pemasukan tersebut akan dilakukan setiap kali basisdata anda disinkronkan. Ini termasuk sinkronisasi dari tiap basisdata percobaan yang dibuat ketika anda menjalankan deretan percobaan.
zh_hans: Django 提供了自定义 SQL 钩子作为将手工编写的 SQL 注入到数据库同步过程中的一种方式。这个自定义 SQL 的一个可能用途是将数据插入到数据库中。如果您的自定义 SQL 包含 ``INSERT`` 语句，那么这些插入操作将在每次数据库同步时执行。这包括在运行测试套件时创建的任何测试数据库的同步。

source: However, in the process of testing the Django 1.3, it was discovered that this feature has never completely worked as advertised. When using database backends that don't support transactions, or when using a TransactionTestCase, data that has been inserted using custom SQL will not be visible during the testing process.
id: Bagaimanapun, dalam pengolahan dari percobaan Django 1.3, itu ditemukan bahwa fitur ini tidak pernah lengkap bekerja seperti diiklan. Ketika menggunakan backend basisdata yang tidak mendukung transaksi, atau ketika menggunakan TransactionTestCase, data yang telah dimasukkan menggunakan SQL penyesuaian tidak akan nampak selama pengolahan percobaan.
zh_hans: 然而，在测试 Django 1.3 的过程中，发现这个功能从未完全按照宣传的那样工作。当使用不支持事务的数据库后端或使用 TransactionTestCase 时，使用自定义 SQL 插入的数据在测试过程中将不可见。

source: Unfortunately, there was no way to rectify this problem without introducing a backwards incompatibility. Rather than leave SQL-inserted initial data in an uncertain state, Django now enforces the policy that data inserted by custom SQL will *not* be visible during testing.
id: Sayangnya, tidak ada cara untuk memperbaiki masalah ini tanpa memperkenalkan ketidaksesuaian kebelakang. Daripada membiarkan data inisial dimasukkan SQL di keadaan yang tidak menentu, Django sekarang memaksa kebijakan yang data dimasukkan oleh SQL penyesuaian *tidak* akan nampak selama percobaan.
zh_hans: 不幸的是，要纠正这个问题，没有办法不引入向后不兼容性。与其让通过自定义 SQL 插入的初始数据处于不确定的状态，Django 现在强制执行一个策略，即通过自定义 SQL 插入的数据在测试期间将 *不* 可见。

source: This change only affects the testing process. You can still use custom SQL to load data into your production database as part of the ``syncdb`` process. If you require data to exist during test conditions, you should either insert it using :ref:`test fixtures <topics-testing-fixtures>`, or using the ``setUp()`` method of your test case.
id: Perubahan ini hanya mempengaruhi pengolahan percobaan. Anda masih dapat menggunakan SQL penyesuaian untuk memuat data kedalam basisdata produksi anda sebagai bagian dari pengolahan ``syncdb``. Jika anda membutuhkan data untuk ada selama kondisi percobaan, anda harus salah satu memasukkannya menggunakan :ref:`test fixtures <topics-testing-fixtures>`, atau menggunakan metode ``setUp()`` dari kasus percobaan anda.
zh_hans: 这个更改只影响测试过程。您仍然可以使用自定义 SQL 在 ``syncdb`` 进程的一部分中将数据加载到生产数据库中。如果您需要在测试条件下存在数据，您应该使用 :ref:`测试固件 <topics-testing-fixtures>` 来插入它，或者使用您的测试用例的 ``setUp()`` 方法。

source: ModelAdmin.lookup_allowed signature changed
id: Tanda tangan ModelAdmin.lookup_allowed berubah
zh_hans: ModelAdmin.lookup_allowed 签名已更改

source: Django 1.2.4 introduced a method ``lookup_allowed`` on ``ModelAdmin``, to cope with a security issue (changeset :commit:`[15033] <85207a245bf09fdebe486b4c7bbcb65300f2a693>`). Although this method was never documented, it seems some people have overridden ``lookup_allowed``, especially to cope with regressions introduced by that changeset. While the method is still undocumented and not marked as stable, it may be helpful to know that the signature of this function has changed.
zh_hans: Django 1.2.4 引入了一个名为 ``lookup_allowed`` 的方法，用于在 ``ModelAdmin`` 上处理一个安全问题（changeset :commit:`[15033] <85207a245bf09fdebe486b4c7bbcb65300f2a693>`）。尽管这个方法从未被文档化，但似乎有一些人已经重写了 ``lookup_allowed``，尤其是为了应对该 changeset 引入的回归问题。虽然这个方法仍然未被文档化并且未标记为稳定，但了解该函数的签名已发生变化可能会有所帮助。

source: Django 1.2.6 release notes
id: Catatan terbitan Django 1.2.6
zh_hans: Django 1.2.6 版本发行说明

source: *September 9, 2011*
zh_hans: *2011 年 9 月 9 日*

source: Welcome to Django 1.2.6!
id: Selamat datang di Django 1.2.6!
zh_hans: 欢迎来到 Django 1.2.6 版本！

source: This is the sixth bugfix/security release in the Django 1.2 series, fixing several security issues present in Django 1.2.5. Django 1.2.6 is a recommended upgrade for all users of any Django release in the 1.2.X series.
id: Ini adalah terbitan keamanan/perbaikan kesalahan keenam di rangkaian Django 1.2, memperbaiki beberapa masalah keamanan yang hadir di Django 1.2.5. Django 1.2.6 adalah peningkatan yang dianjurkan untuk semua pengguna dari tiap terbitan Django di rangkaian 1.2.X.
zh_hans: 这是 Django 1.2 系列中的第六个修复错误/安全性发布，修复了 Django 1.2.5 中存在的几个安全问题。对于 1.2.X 系列中任何 Django 版本的所有用户，建议升级到 Django 1.2.6 。

source: For a full list of issues addressed in this release, see the `security advisory`_.
id: Untuk daftar penuh dari masalah-masalah yang dialamatkan, lihat `security advisory`_.
zh_hans: 要查看此版本中解决的所有问题的完整列表，请参阅 `安全公告`_。

source: Django 1.2.7 release notes
id: Catatan terbitan Django 1.2.7
zh_hans: Django 1.2.7 版本发行说明

source: *September 10, 2011*
zh_hans: *2011 年 9 月 10 日*

source: Welcome to Django 1.2.7!
id: Selamat datang di Django 1.2.7!
zh_hans: 欢迎来到 Django 1.2.7 版本！

source: This is the seventh bugfix/security release in the Django 1.2 series. It replaces Django 1.2.6 due to problems with the 1.2.6 release tarball. Django 1.2.7 is a recommended upgrade for all users of any Django release in the 1.2.X series.
id: Ini adalah terbitan keamanan/perbaikan kesalahan ketujuh di rangkaian Django 1.2. Itu mengganti Django 1.2.6 karena masalah dengan tarball terbitan 1.2.6. Django 1.2.7 adalah peningkatan dianjurkan untuk semua pengguna dari tiap terbitan Django di rangkaian 1.2.X.
zh_hans: 这是 Django 1.2 系列中的第七个修复错误/安全性发布。由于 1.2.6 版本压缩包存在问题，它取代了 Django 1.2.6 。对于 1.2.X 系列中任何 Django 版本的所有用户，建议升级到 Django 1.2.7 。

source: For more information, see the `release advisory`_.
id: Untuk informasi lebih, lihat `release advisory`_.
zh_hans: 有关更多信息，请参阅 `发布公告`_。

source: Django 1.3 release notes
id: Catatan terbitan Django 1.3
zh_hans: Django 1.3 版本发行说明

source: *March 23, 2011*
id: *23 Maret 2011*
zh_hans: *2011 年 3 月 23 日*

source: Welcome to Django 1.3!
id: Selamat datang di Django 1.3!
zh_hans: 欢迎来到 Django 1.3 版本！

source: Nearly a year in the making, Django 1.3 includes quite a few :ref:`new features <whats-new-1.3>` and plenty of bug fixes and improvements to existing features. These release notes cover the new features in 1.3, as well as some :ref:`backwards-incompatible changes <backwards-incompatible-changes-1.3>` you'll want to be aware of when upgrading from Django 1.2 or older versions.
id: Hampir setahun dalam membuat, The same applies1.3 termasuk sedikit :ref:`new features <whats-new-1.3>` dan cukup dari perbaikan kesalahan dan peningkatan pada fitur-fitur yang ada. Catatan terbitan ini melingkupi fitur-fitur baru di 1.2, dan juga beberapa :ref:`backwards-incompatible changes <backwards-incompatible-changes-1.3>` anda ingin disadari dari ketika meningkatkan dari Django 1.2 atau versi terlama.
zh_hans: 经过将近一年的努力，Django 1.3 包括了相当多的 :ref:`新功能 <whats-new-1.3>`，以及对现有功能的大量错误修复和改进。这些发布说明涵盖了 1.3 中的新功能，以及从 Django 1.2 或更早版本升级时需要注意的一些 :ref:`向后不兼容的更改 <backwards-incompatible-changes-1.3>`。

source: Django 1.3's focus has mostly been on resolving smaller, long-standing feature requests, but that hasn't prevented a few fairly significant new features from landing, including:
id: Fokus Django 1.3 kebanyakan pada memecahkan lebih kecil, permintaan fitur yang lama berdiri, tetapi tidak mencegah sedikit fitur baru cukup dignifikan dari mendarat, termasuk:
zh_hans: Django 1.3 的重点主要是解决较小的、长期存在的功能需求，但这并未阻止一些相当重要的新功能的实现，包括：

source: A framework for writing `class-based views`_.
id: Sebuah kerangka untuk menulis `tampilan berbasis-kelas`_.
zh_hans: 一个用于编写 `基于类的视图`_ 的框架。

source: Built-in support for `using Python's logging facilities`_.
id: Dukungan siap-pakai untuk `using Python's logging facilities`_.
zh_hans: 内置支持 `使用 Python 的日志记录工具`_。

source: Contrib support for `easy handling of static files`_.
id: Dukungan bantuan untuk `easy handling of static files`_.
zh_hans: 为 `静态文件的简单处理`_ 提供的贡献支持。

source: Django's testing framework now supports (and ships with a copy of) `the unittest2 library`_.
id: Kerangka kerja percobaan Django sekarang mendukung (dan dibekali dengan salinan dari) `the unittest2 library`_.
zh_hans: Django 的测试框架现在支持（并随附了一份） `unittest2 库`_。

source: Wherever possible, new features are introduced in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>` policy. As a result of this policy, Django 1.3 :ref:`begins the deprecation process for some features <deprecated-features-1.3>`.
zh_hans: 在可能的情况下，新功能都按照 :doc:`我们的 API 稳定性政策 </misc/api-stability>` 以向后兼容的方式引入。由于这个政策，Django 1.3 :ref:`开始了某些功能的弃用过程 <deprecated-features-1.3>`。

source: The release of Django 1.2 was notable for having the first shift in Django's Python compatibility policy; prior to Django 1.2, Django supported any 2.x version of Python from 2.3 up. As of Django 1.2, the minimum requirement was raised to Python 2.4.
id: Terbitan dari The same applies1.2 adalah penting untuk mempunyai pergantian pertama di kebijakan kesesuaian Python Django; sebelum Django 1.2, Django mendukung tiap versi 2.x dari Python mulai 2.3 keatas. Mulai Django 1.2, persyaratan minimal telah dimunculkan pada Python 2.4.
zh_hans: Django 1.2 的发布引人注目，因为它是 Django Python 兼容性政策的第一个变化；在 Django 1.2 之前，Django 支持从 2.3 到任何 2.x 版本的 Python 。从 Django 1.2 开始，最低要求提高到 Python 2.4 。

source: Django 1.3 continues to support Python 2.4, but will be the final Django release series to do so; beginning with Django 1.4, the minimum supported Python version will be 2.5. A document outlining our full timeline for deprecating Python 2.x and moving to Python 3.x will be published shortly after the release of Django 1.3.
id: Django 1.3 lanjut mendukung Python 2.4, tetapi akan menjadi rangkaian terbitan Django akhir untuk melakukannya; dimuai dengan Django 1.4, versi Python minimal yang didukung akan menjadi 2.5. Sebuah dokumen menguraikan linimasa penuh kami untuk pengusangan Python 2.x dan berpindah ke Python 3.x akan diterbitkan secepatnya setelah terbitan Django 1.3.
zh_hans: Django 1.3 继续支持 Python 2.4，但这将是最后一个支持该版本的 Django 发布系列；从 Django 1.4 开始，最低支持的 Python 版本将是 2.5 。在 Django 1.3 发布后不久，我们将发布一份详细说明废弃 Python 2.x 并转向 Python 3.x 的完整时间表的文档。

source: What's new in Django 1.3
id: Apa yang baru di Django 1.3
zh_hans: Django 1.3 新特性

source: Class-based views
id: Tampilan berdasarkan-kelas
zh_hans: 基于类的视图

source: Django 1.3 adds a framework that allows you to use a class as a view. This means you can compose a view out of a collection of methods that can be subclassed and overridden to provide common views of data without having to write too much code.
id: Django 1.3 menambahkan sebuah keangka kerja yang mengizinkan anda menggunakan kelas sebagai tampilan. Ini berarti anda dapat menyusun tampilan dari kumpulan dari metode yang dapat di subkelaskan dan ditimpa untuk menyesiakan tampilan umum data tanpa harus menulis kode terlalu banyak.
zh_hans: Django 1.3 添加了一个框架，允许您使用类作为视图。这意味着您可以使用一组方法组成一个视图，这些方法可以被子类化和重写，以提供数据的通用视图，而无需编写太多代码。

source: Analogs of all the old function-based generic views have been provided, along with a completely generic view base class that can be used as the basis for reusable applications that can be easily extended.
id: Analog untuk semua tampilan umum berdasarkan-fungsi lama telah disediakam, bersama dengan kelas dasar tampilan umum lengkap yang dapat digunakan sebagai dasar untuk penggunaan kembali aplikasi yang dapat dengan mudah diperpanjang.
zh_hans: 已经提供了所有旧的基于函数的通用视图的类似物，以及一个完全通用的视图基类，可以用作可重用应用程序的基础，这些应用程序可以很容易地扩展。

source: See :doc:`the documentation on class-based generic views</topics/class-based-views/index>` for more details. There is also a document to help you `convert your function-based generic views to class-based views <https://raw.githubusercontent.com/django/django/ea9dc9f4b03ae034c1dc080730422dda7a9c2e47/docs/topics/generic-views-migration.txt>`_.
zh_hans: 有关更多详细信息，请参阅 :doc:`关于基于类的通用视图的文档</topics/class-based-views/index>`。还有一份文档可以帮助您将 `基于函数的通用视图转换为基于类的视图 <https://raw.githubusercontent.com/django/django/ea9dc9f4b03ae034c1dc080730422dda7a9c2e47/docs/topics/generic-views-migration.txt>`_。

source: Logging
id: Pencatatan
zh_hans: 日志

source: Django 1.3 adds framework-level support for Python's ``logging`` module. This means you can now easily configure and control logging as part of your Django project. A number of logging handlers and logging calls have been added to Django's own code as well -- most notably, the error emails sent on an HTTP 500 server error are now handled as a logging activity. See :doc:`the documentation on Django's logging interface </topics/logging>` for more details.
zh_hans: Django 1.3 在框架级别添加了对 Python 的 ``logging`` 模块的支持。这意味着现在您可以轻松地在您的 Django 项目中配置和控制日志记录。此外，Django 的代码中还添加了许多日志处理程序和日志调用，最显著的是，在发生 HTTP 500 服务器错误时发送的错误邮件现在被处理为日志活动。有关更多详细信息，请参阅 :doc:`关于 Django 日志记录接口的文档 </topics/logging>`。

source: Extended static files handling
id: Memperpanjang penanganan berkas tetap
zh_hans: 扩展静态文件处理

source: Django 1.3 ships with a new contrib app -- ``django.contrib.staticfiles`` -- to help developers handle the static media files (images, CSS, JavaScript, etc.) that are needed to render a complete web page.
id: Django 1.3 dibekali dengan aplikasi bantuan baru -- ``django.contrib.staticfiles`` -- untuk membantu pengembang manangani berkas-berkas media tetap (gambar, CSS, JavaScript, dll.) yang dibutuhkan untuk membangun sebuah halaman jaringan lengkap.
zh_hans: Django 1.3 随附了一个新的贡献应用程序 -- ``django.contrib.staticfiles`` -- 以帮助开发人员处理渲染完整网页所需的静态媒体文件（图像、CSS、JavaScript 等）。

source: In previous versions of Django, it was common to place static assets in :setting:`MEDIA_ROOT` along with user-uploaded files, and serve them both at :setting:`MEDIA_URL`. Part of the purpose of introducing the ``staticfiles`` app is to make it easier to keep static files separate from user-uploaded files. Static assets should now go in ``static/`` subdirectories of your apps or in other static assets directories listed in :setting:`STATICFILES_DIRS`, and will be served at :setting:`STATIC_URL`.
id: Di versi sebelummnya, itu adalah tempat umum untuk menempatkan aset tetap di :setting:`MEDIA_ROOT` bersama dengan berkas-berkas diunggah-pengguna, dan melayani mereka kedua di :setting:`MEDIA_URL`. Bagian dari tujuan untuk memperkenalkan aplikasi ``staticfiles`` adalah untuk membuatnya lebih mudah menjaga berkas-berkas tetap terpisah dari berkas-berkas terunggah-pengguna. Aset tetap harus sekarang berada di subdirektori ``static/`` dari aplikasi anda atau di direktori aset tetap lain terdaftar di :setting:`STATICFILES_DIRS`, dan akan dilayani pada :setting:`STATIC_URL`.
zh_hans: 在以前的 Django 版本中，通常会将静态资源与用户上传的文件一起放在 :setting:`MEDIA_ROOT` 中，并同时在 :setting:`MEDIA_URL` 上提供它们。引入 ``staticfiles`` 应用程序的部分目的是使将静态文件与用户上传的文件分开更加容易。现在，静态资源应该放在您的应用程序的 ``static/`` 子目录中或在 :setting:`STATICFILES_DIRS` 中列出的其他静态资源目录中，并将在 :setting:`STATIC_URL` 上提供。
