Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django 1.8.6 adds official support for Python 3.5 and fixes several bugs in 1.8.5.
id: Django 1.8.6 menambahkan dukungan resmi untuk Python 3.5 dan memperbaiki beberapa kesalahan di 1.8.5.
zh_hans: Django 1.8.6 为 Python 3.5 添加了官方支持，并修复了 1.8.5 中的几个错误。

source: Fixed a regression causing ``ModelChoiceField`` to ignore ``prefetch_related()`` on its queryset (:ticket:`25496`).
id: Diperbaiki sebuah pemulihan menyebabkan ``ModelChoiceField`` mengabaikan ``prefetch_related()`` di queryset nya (:ticket:`25496`).
zh_hans: 修复了导致 ``ModelChoiceField`` 忽略其查询集上的 ``prefetch_related()`` 的回归问题（:ticket:`25496`）。

source: Allowed "mode=memory" in SQLite test database name if supported (:ticket:`12118`).
id: Diizinkan "mode=memory" di nama basisdata percobaan SQlite jika didukung (:ticket:`12118`).
zh_hans: 如果支持，允许在 SQLite 测试数据库名称中使用 "mode=memory"（:ticket:`12118`）。

source: Fixed system check crash on ``ForeignKey`` to abstract model (:ticket:`25503`).
id: Diperbaiki kegagalan pemeriksaan sistem di ``ForeignKey`` pada model nyata (:ticket:`25503`).
zh_hans: 修复了在 ``ForeignKey`` 指向抽象模型时导致系统检查崩溃的问题（:ticket:`25503`）。

source: Fixed incorrect queries when you have multiple ``ManyToManyField``\s on different models that have the same field name, point to the same model, and have their reverse relations disabled (:ticket:`25545`).
id: Diperbaiki permintaan tidak benar ketika anda mempunyai banyak ``ManyToManyField`` di model berbeda yang mempunyai nama bidang sama, menunjuk pada model sama, dan mempunyai hubungan balikan mereka ditiadakan (:ticket:`25545`).
zh_hans: 修复了在不同模型上具有相同字段名称、指向相同模型并且禁用了它们的反向关系时导致查询不正确的问题，这些模型上有多个 ``ManyToManyField`` （:ticket:`25545`）。

source: Allowed filtering over a ``RawSQL`` annotation (:ticket:`25506`).
id: Diizinkan menyaring terhadap keterangan ``RawSQL`` (:ticket:`25506`).
zh_hans: 允许在 ``RawSQL`` 注释上进行过滤操作（:ticket:`25506`）。

source: Made the ``Concat`` database function idempotent on SQLite (:ticket:`25517`).
id: Dibuat fungsi basisdata ``Concat`` yang memiliki kekuatan yang sama pada SQLite (:ticket:`25517`).
zh_hans: 在 SQLite 上使 ``Concat`` 数据库函数成为幂等的（:ticket:`25517`）。

source: Avoided a confusing stack trace when starting :djadmin:`runserver` with an invalid :setting:`INSTALLED_APPS` setting (:ticket:`25510`). This regression appeared in 1.8.5 as a side effect of fixing :ticket:`24704`.
id: Dihindari jejak tumpukan membingungkan ketika memulai :djadmin:`runserver` dengan pengaturan :setting:`INSTALLED_APPS` tidak sah (:ticket:`25510`). Pemulihan ini muncul di 1.8.5 sebagai pengaruh saming dari memperbaiki :ticket:`24704`.
zh_hans: 避免在使用无效的 :setting:`INSTALLED_APPS` 设置启动 :djadmin:`runserver` 时出现令人困惑的堆栈跟踪。这个回归问题出现在 1.8.5 中，是修复 :ticket:`24704` 的副作用（:ticket:`25510`）。

source: Made deferred models use their proxied model's ``_meta.apps`` for caching and retrieval (:ticket:`25563`). This prevents any models generated in data migrations using ``QuerySet.defer()`` from leaking to test and application code.
id: Dibuat model yang ditangguhkan menggunakan ``_meta.apps`` model proxy mereka untuk menyimpan sementara dan mengambil (:ticket:`25563`). Ini mencegah model apapun dibangkitkan dalam perpindahan data menggunakan ``QuerySet.defer()`` dari bocoran pada percobaan dan kode aplikasi.
zh_hans: 使延迟加载的模型使用其代理模型的 ``_meta.apps`` 进行缓存和检索（:ticket:`25563`）。这可以防止在数据迁移中使用 ``QuerySet.defer()`` 生成的任何模型泄漏到测试和应用程序代码中。

source: Fixed a typo in the name of the ``strictly_above`` PostGIS lookup (:ticket:`25592`).
zh_hans: 修复了在 ``strictly_above`` PostGIS 查询中名称拼写错误的问题（:ticket:`25592`）。

source: Fixed crash with ``contrib.postgres.forms.SplitArrayField`` and ``IntegerField`` on invalid value (:ticket:`25597`).
id: Diperbaiki kegagalan dengan ``contrib.postgres.forms.SplitArrayField`` dan ``IntegerField`` pada nilai tidak sah (:ticket:`25597`).
zh_hans: 修复了在使用无效值时 ``contrib.postgres.forms.SplitArrayField`` 和 ``IntegerField`` 导致崩溃的问题（:ticket:`25597`）。

source: Added a helpful error message when Django and South migrations exist in the same directory (:ticket:`25618`).
id: Ditambahkan pesan kesalahan membantu ketika perpindahan Django dan South ada di direktori sama (:ticket:`25618`).
zh_hans: 当同一目录中存在 Django 和 South 迁移时，添加了一个有用的错误消息（:ticket:`25618`）。

source: Fixed a regression in ``URLValidator`` that allowed URLs with consecutive dots in the domain section (like ``http://example..com/``) to pass (:ticket:`25620`).
id: DIperbaiki sebuah pemulihan di ``URLValidator`` yang mengizinkan URL dengan titik berurutan di bagian ranah (seperti ``http://example..com/``) untuk dilewatkan (:ticket:`25620`).
zh_hans: 修复了 ``URLValidator`` 中的回归问题，该问题允许在域部分中有连续的点的 URL 通过（例如 ``http://example..com/``）（:ticket:`25620`）。

source: Fixed a crash with ``GenericRelation`` and ``BaseModelAdmin.to_field_allowed`` (:ticket:`25622`).
id: Diperbaiki sebuah kegagalan dengan ``GenericRelation`` dan ``BaseModelAdmin.to_field_allowed`` (:ticket:`25622`).
zh_hans: 修复了使用 ``GenericRelation`` 和 ``BaseModelAdmin.to_field_allowed`` 导致崩溃的问题（:ticket:`25622`）。

source: Django 1.8.7 release notes
id: Catatan terbitan Django 1.8.7
zh_hans: Django 1.8.7 版本发行说明

source: Django 1.8.7 fixes a security issue and several bugs in 1.8.6.
id: Django 1.8.7 memperbaiki masalah keamanan dan beberapa kesalahan di 1.8.6.
zh_hans: Django 1.8.7 修复了 1.8.6 中的一个安全问题和几个错误。

source: Additionally, Django's vendored version of six, ``django.utils.six``, has been upgraded to the latest release (1.10.0).
id: Tambahannya, versi penjaja Django dari enam, ``django.utils.six``, telah ditingkatkan ke terbitan terakhir (1.10.0).
zh_hans: 另外，Django 的兼容库版本的 six，即 ``django.utils.six``，已升级到最新版本（1.10.0）。

source: Fixed a crash of the debug view during the autumn DST change when :setting:`USE_TZ` is ``False`` and ``pytz`` is installed.
id: Diperbaiki sebuah kegagalan dari tampilan mencari kesalahan selama DST musim gugur berubah ketika :setting:`USE_TZ` adalah ``False`` dan ``pytz`` terpasang.
zh_hans: 在秋季 DST 更改期间，当 :setting:`USE_TZ` 为 ``False`` 且安装了 ``pytz`` 时，修复了调试视图的崩溃问题。

source: Fixed a regression in 1.8.6 that caused database routers without an ``allow_migrate()`` method to crash (:ticket:`25686`).
id: Diperbaiki sebuah pemulihan di 1.8.6 yang menyebabkan rute basisdata tanpa sebuah metode ``allow_migrate()`` menjadi gagal (:ticket:`25686`).
zh_hans: 修复了 1.8.6 中的回归问题，导致没有 ``allow_migrate()`` 方法的数据库路由器崩溃的问题（:ticket:`25686`）。

source: Fixed a regression in 1.8.6 by restoring the ability to use ``Manager`` objects for the ``queryset`` argument of ``ModelChoiceField`` (:ticket:`25683`).
id: Diperbaiki sebuah pemulihan di 1.8.6 dengan menyimpan kembali kemampuan untuk menggunakan obyek ``Manager`` untuk argumen ``queryset`` dari ``ModelChoiceField`` (:ticket:`25683`).
zh_hans: 通过恢复可以使用 ``Manager`` 对象作为 ``ModelChoiceField`` 的 ``queryset`` 参数的能力，修复了 1.8.6 中的回归问题（:ticket:`25683`）。

source: Fixed a regression in 1.8.6 that caused an application with South migrations in the ``migrations`` directory to fail (:ticket:`25618`).
id: Diperbaiki sebuah pemulihan di 1.8.6 yang menyebabkan sebuah aplikasi dengan perpindahan South di direktori ``migrations`` menjadi gagal (:ticket:`25618`).
zh_hans: 修复了 1.8.6 中的回归问题，导致具有 South 迁移的应用在 ``migrations`` 目录中失败的问题（:ticket:`25618`）。

source: Fixed a regression in 1.8 by making ``gettext()`` once again return UTF-8 bytestrings on Python 2 if the input is a bytestring (:ticket:`25720`).
id: Diperbaiki sebuah pemulihan di 1.8 dengan membuat ``gettext()`` sekali lagi mengembalikan bytestring UTF-8 di Python 2 jika masukan adalah sebuah bytestring (:ticket:`25720`).
zh_hans: 通过在 Python 2 中，如果输入是字节串，再次使 ``gettext()`` 返回 UTF-8 字节串，修复了 1.8 中的回归问题（:ticket:`25720`）。

source: Fixed serialization of :class:`~django.contrib.postgres.fields.DateRangeField` and :class:`~django.contrib.postgres.fields.DateTimeRangeField` (:ticket:`24937`).
id: Diperbaiki serialisasi dari :class:`~django.contrib.postgres.fields.DateRangeField` dan :class:`~django.contrib.postgres.fields.DateTimeRangeField` (:ticket:`24937`).
zh_hans: 修复了对 :class:`~django.contrib.postgres.fields.DateRangeField` 和 :class:`~django.contrib.postgres.fields.DateTimeRangeField` 的序列化问题（:ticket:`24937`）。

source: Fixed the exact lookup of ``ArrayField`` (:ticket:`25666`).
id: Diperbaiki pencarian tepat dari ``ArrayField`` (:ticket:`25666`).
zh_hans: 修复了 ``ArrayField`` 的精确查找问题（:ticket:`25666`）。

source: Fixed ``Model.refresh_from_db()`` updating of ``ForeignKey`` fields with ``on_delete=models.SET_NULL`` (:ticket:`25715`).
id: Diperbaiki ``Model.refresh_from_db()`` memperbaharui dari bidang ``ForeignKey`` dengan ``on_delete=models.SET_NULL`` (:ticket:`25715`).
zh_hans: 修复了 ``Model.refresh_from_db()`` 更新带有 ``on_delete=models.SET_NULL`` 的 ``ForeignKey`` 字段的问题（:ticket:`25715`）。

source: Fixed a duplicate query regression in 1.8 on proxied model deletion (:ticket:`25685`).
id: Diperbaiki pemulihan permintaan ganda di 1.8 di penghapusan model proxy (:ticket:`25685`).
zh_hans: 修复了 1.8 中在代理模型删除时出现的重复查询回归问题（:ticket:`25685`）。

source: Fixed ``set_FOO_order()`` crash when the ``ForeignKey`` of a model with ``order_with_respect_to`` references a model with a ``OneToOneField`` primary key (:ticket:`25786`).
id: Diperbaiki kegagalan ``set_FOO_order()`` ketika ``ForeignKey`` dari sebuah model dengan ``order_with_respect_to`` mengacu sebuah model dengan primary key ``OneToOneField`` (:ticket:`25786`).
zh_hans: 修复了当具有 ``order_with_respect_to`` 的模型的 ``ForeignKey`` 引用具有 ``OneToOneField`` 主键的模型时，导致 ``set_FOO_order()`` 崩溃的问题（:ticket:`25786`）。

source: Fixed incorrect validation for ``PositiveIntegerField`` and ``PositiveSmallIntegerField`` on MySQL resulting in values greater than 4294967295 or 65535, respectively, passing validation and being silently truncated by the database (:ticket:`25767`).
id: Diperbaiki pengesahan tidak benar untuk ``PositiveIntegerField`` dan ``PositiveSmallIntegerField`` di MySQL menghasilkan di nilai lebih besar dari 4294967295 atau 65535, masing-masing, melewatkan pengesahan dan menjadi diam dipotong oleh basisdata (:ticket:`25767`).
zh_hans: 修复了在 MySQL 上对 ``PositiveIntegerField`` 和 ``PositiveSmallIntegerField`` 进行错误验证的问题，导致值大于 4294967295 或 65535 的值通过验证，并被数据库默默截断（:ticket:`25767`）。

source: Django 1.8.8 release notes
id: Catatan terbitan Django 1.8.8
zh_hans: Django 1.8.8 版本发行说明

source: *January 2, 2016*
id: *2 Januari 2016*
zh_hans: *2016 年 1 月 2 日*

source: Django 1.8.8 fixes several bugs in 1.8.7.
id: Django 1.8.8 memperbaiki beberapa kesalahan di 1.8.7.
zh_hans: Django 1.8.8 修复了 1.8.7 中的几个错误。

source: Python 3.2 users, please be advised that we've decided to drop support for Python 3.2 in Django 1.8.x at the end of 2016. We won't break things intentionally after that, but we won't test subsequent releases against Python 3.2 either. Upstream support for Python 3.2 ends February 2016 so we don't find much value in providing security updates for a version of Python that could be insecure. To read more about the decision and to let us know if this will be problematic for you, please read the `django-developers thread <https://groups.google.com/g/django-developers/c/eMu5UQpUdWs/discussion>`_.
zh_hans: Python 3.2 用户，请注意我们决定在 2016 年底停止对 Django 1.8.x 的 Python 3.2 支持。之后我们不会故意破坏兼容性，但也不会针对 Python 3.2 测试后续版本。Python 3.2 的上游支持在 2016 年 2 月结束，因此我们不认为为可能存在安全风险的 Python 版本提供安全更新有多大价值。要了解更多关于这个决定的信息，并告诉我们是否会对您造成问题，请阅读 `django-developers 线程 <https://groups.google.com/g/django-developers/c/eMu5UQpUdWs/discussion>`_。

source: Fixed incorrect ``unique_together`` field name generation by ``inspectdb`` (:ticket:`25274`).
id: Diperbaiki pembangkitan nama bidang ``unique_together`` oleh ``inspectdb`` (:ticket:`25274`).
zh_hans: 修复了 ``inspectdb`` 生成的字段名称不正确的 ``unique_together`` （:ticket:`25274`）。

source: Corrected ``__len`` query lookup on ``ArrayField`` for empty arrays (:ticket:`25772`).
id: Diperbaiki pencarian permintaan ``__len`` pada ``ArrayField`` untuk larik kosong (:ticket:`25772`).
zh_hans: 纠正了对空数组的 ``ArrayField`` 上的 ``__len`` 查询查找（:ticket:`25772`）。

source: Restored the ability to use custom formats from ``formats.py`` with ``django.utils.formats.get_format()`` and the ``date`` template filter (:ticket:`25812`).
id: Disimpan kembali kemampuan untuk menggunakan penyesuaian bentuk dari ``formats.py`` dengan ``django.utils.formats.get_format()`` dan penyaring cetakan ``date`` (:ticket:`25812`).
zh_hans: 恢复了使用 ``django.utils.formats.get_format()`` 和 ``date`` 模板过滤器与 ``formats.py`` 中的自定义格式的能力（:ticket:`25812`）。

source: Fixed a state bug when migrating a ``SeparateDatabaseAndState`` operation backwards (:ticket:`25896`).
id: Diperbaiki sebuah keadaan kesalahan ketika memindahkan operasi ``SeparateDatabaseAndState`` kebelakang (:ticket:`25896`).
zh_hans: 修复了在向后迁移 ``SeparateDatabaseAndState`` 操作时的状态错误问题（:ticket:`25896`）。

source: Fixed missing ``varchar/text_pattern_ops`` index on ``CharField`` and ``TextField`` respectively when using ``AlterField`` on PostgreSQL (:ticket:`25412`).
id: Diperbaiki kehilangan indeks ``varchar/text_pattern_ops`` di ``CharField`` dan ``TextField`` masing-masing ketika menggunakan ``AlterField`` di PostgreSQL (:ticket:`25412`).
zh_hans: 在 PostgreSQL 上使用 ``AlterField`` 时，修复了在 ``CharField`` 和 ``TextField`` 上分别缺少 ``varchar/text_pattern_ops`` 索引的问题（:ticket:`25412`）。

source: Fixed a state bug when using an ``AlterModelManagers`` operation (:ticket:`25852`).
id: Diperbaiki sebuah keadaan kesalahan ketika menggunakan sebuah tindakan ``AlterModelManagers`` (:ticket:`25852`).
zh_hans: 修复了在使用 ``AlterModelManagers`` 操作时的状态错误问题（:ticket:`25852`）。

source: Fixed a regression which prevented using a language not in Django's default language list (:setting:`LANGUAGES`) (:ticket:`25915`).
id: Diperbaiki sebuah pemulihan yang mencegah menggunakan sebuah bahasa bukan di daftar basaha awal Django (:setting:`LANGUAGES`) (:ticket:`25915`).
zh_hans: 修复了一个导致无法使用不在 Django 的默认语言列表 (:setting:`LANGUAGES`) 中的语言的回归问题（:ticket:`25915`）。

source: ``django.views.decorators.cache.never_cache()`` now sends more persuasive headers (added ``no-cache, no-store, must-revalidate`` to ``Cache-Control``) to better prevent caching (:ticket:`13008`). This fixes a problem where a page refresh in Firefox cleared the selected entries in the admin's ``filter_horizontal`` and ``filter_vertical`` widgets, which could result in inadvertent data loss if a user didn't notice that and then submitted the form (:ticket:`22955`).
id: ``django.views.decorators.cache.never_cache()`` sekarang mengirim kepala meyakinkan (ditambahkan ``no-cache, no-store, must-revalidate`` pada ``Cache-Control``) untuk lebih baik mencegah menyimpan sementara (:ticket:`13008`). Ini memperbaiki sebuah masalah dimana sebuah halaman disegarkan dalam Firefox membersihkan masukan yang dipilih di widget ``filter_horizontal`` dan ``filter_vertical`` admin, yang dapat menghasilkan dalam kehilangan data tidak sengaja jika seorang pengguna tidak menyadari itu dan kemudian mengajukan formulir (:ticket:`22955`).
zh_hans: ``django.views.decorators.cache.never_cache()`` 现在发送更有说服力的头部信息（在 ``Cache-Control`` 中添加了 ``no-cache, no-store, must-revalidate``），以更好地防止缓存（:ticket:`13008`）。这修复了在 Firefox 中刷新页面会清除管理员的 ``filter_horizontal`` 和 ``filter_vertical`` 小部件中选择的条目的问题，如果用户没有注意到这一点然后提交表单，可能会导致意外的数据丢失（:ticket:`22955`）。

source: Fixed a regression in the admin which ignored line breaks in read-only fields instead of converting them to ``<br>`` (:ticket:`25465`).
id: Diperbaiki sebuah pemulihan di admin yang mengabaikan baris jeda di bidang hanya-baca daripada merubah mereka menjadi ``<br>`` (:ticket:`25465`).
zh_hans: 修复了在管理员中的回归问题，该问题忽略只读字段中的换行符而不是将它们转换为 ``<br>`` （:ticket:`25465`）。

source: Made ``loaddata`` skip disabling and enabling database constraints when it doesn't load any fixtures (:ticket:`23372`).
id: Dibuat ``loaddata`` melewati meniadakan dan mengadakan batasan basisdata ketika itu tidak memuat alat bantu apapun (:ticket:`23372`).
zh_hans: 当 ``loaddata`` 不加载任何数据时，使其跳过禁用和启用数据库约束（:ticket:`23372`）。

source: Fixed a crash in ``QuerySet.values()/values_list()`` after an ``annotate()`` and ``order_by()`` when ``values()/values_list()`` includes a field not in the ``order_by()`` (:ticket:`25316`).
id: Diperbaiki sebuah kegagalan di ``QuerySet.values()/values_list()`` setelah sebuah ``annotate()`` dan ``order_by()`` ketika ``values()/values_list()`` menyertakan sebuah bidang bukan di ``order_by()`` (:ticket:`25316`).
zh_hans: 修复了在 ``annotate()`` 和 ``order_by()`` 后使用 ``QuerySet.values()/values_list()`` 并包含一个不在 ``order_by()`` 中的字段后导致崩溃的问题（:ticket:`25316`）。

source: Django 1.8.9 release notes
id: Catatan terbitan Django 1.8.9
zh_hans: Django 1.8.9 版本发行说明

source: *February 1, 2016*
id: *1 Februari 2016*
zh_hans: *2016 年 2 月 1 日*

source: Django 1.8.9 fixes several bugs in 1.8.8.
id: Django 1.8.9 memperbaiki beberapa kesalahan di 1.8.8.
zh_hans: Django 1.8.9 修复了 1.8.8 中的几个错误。

source: Fixed a regression that caused the "user-tools" items to display on the admin's logout page (:ticket:`26035`).
id: Diperbaiki sebuah pemulihan yang disebabkan barang "user-tools" untuk ditampilkan di halaman keluar admin (:ticket:`26035`).
zh_hans: 修复了一个导致在管理员的注销页面上显示 "user-tools" 项的回归问题（:ticket:`26035`）。

source: Fixed a crash in the translations system when the current language has no translations (:ticket:`26046`).
id: Diperbaiki sebuah kegagalan di sistem terjemahan ketika bahasa saat ini tidak mempunyai terjemahan (:ticket:`26046`).
zh_hans: 修复了在当前语言没有翻译时翻译系统崩溃的问题（:ticket:`26046`）。

source: Fixed a regression that caused the incorrect day to be selected when opening the admin calendar widget for timezones from GMT+0100 to GMT+1200 (:ticket:`24980`).
id: Diperbaiki sebuah pemulihan yang menyebabkan hari tidak benar untuk dipilih ketika membuka widget kalender admin untuk zonawaktu dari GMT+0100 menjadi GMT+1200 (:ticket:`24980`).
zh_hans: 修复了一个导致在时区从 GMT+0100 到 GMT+1200 时，打开管理员日历小部件时选择了错误的日期的回归问题（:ticket:`24980`）。

source: Fixed a regression in 1.8.8 causing incorrect index handling in migrations on PostgreSQL when adding ``db_index=True`` or ``unique=True`` to a ``CharField`` or ``TextField`` that already had the other specified, or when removing one of them from a field that had both, or when adding ``unique=True`` to a field already listed in ``unique_together`` (:ticket:`26034`).
id: Diperbaiki sebuah pemulihan di 1.8.8 menyebabkan penanganan indeks tidak benar di perpindahan di PostgreSQL ketika menambahkan ``db_index=True`` atau ``unique=True`` pada ``CharField`` atau ``TextField`` yang sudah memiliki lainnya yang sudah ditentukan, atau ketika memindahkan satu dari mereka dari sebuah bidang yang mempunyai keduanya, atau ketika menambahkan ``unique=True`` pada sebuah bidang yang sudah di daftarkan di ``unique_together`` (:ticket:`26034`).
zh_hans: 修复了 1.8.8 中的回归问题，导致在 PostgreSQL 上的迁移中在将 ``db_index=True`` 或 ``unique=True`` 添加到已经具有另一个指定的 ``CharField`` 或 ``TextField``，或者从已经同时具有两者之一的字段中移除一个，或者将 ``unique=True`` 添加到已在 ``unique_together`` 中列出的字段时，处理索引不正确的问题（:ticket:`26034`）。

source: Fixed a crash when using an ``__in`` lookup inside a ``Case`` expression (:ticket:`26071`).
id: Diperbaiki sebuah kegagalan ketika menggunakan sebuah pencarian ``__in`` didalam pernyataan ``Case`` (:ticket:`26071`).
zh_hans: 修复了在 ``Case`` 表达式中使用 ``__in`` 查找时导致崩溃的问题（:ticket:`26071`）。

source: Fixed a crash when using a reverse ``OneToOneField`` in ``ModelAdmin.readonly_fields`` (:ticket:`26060`).
id: Diperbaiki sebuah kegagalan ketika menggunakan balikan ``OneToOneField`` di ``ModelAdmin.readonly_fields`` (:ticket:`26060`).
zh_hans: 修复了在 ``ModelAdmin.readonly_fields`` 中使用反向的 ``OneToOneField`` 时导致崩溃的问题（:ticket:`26060`）。

source: Fixed a regression in Django 1.8.5 that broke copying a ``SimpleLazyObject`` with ``copy.copy()`` (:ticket:`26122`).
id: Diperbaiki sebuah pemulihan di Django 1.8.5 yang merusak salinan sebuah ``SimpleLazyObject`` dengan ``copy.copy()`` (:ticket:`26122`).
zh_hans: 修复了 Django 1.8.5 中的回归问题，导致无法使用 ``copy.copy()`` 复制 ``SimpleLazyObject`` （:ticket:`26122`）。

source: Fixed the ``contrib.gis`` map widgets when using ``USE_THOUSAND_SEPARATOR=True`` (:ticket:`20415`).
id: Diperbaiki widget peta ``contrib.gis`` ketika menggunakan ``USE_THOUSAND_SEPARATOR=True`` (:ticket:`20415`).
zh_hans: 修复了在使用 ``USE_THOUSAND_SEPARATOR=True`` 时，``contrib.gis`` 地图小部件的问题（:ticket:`20415`）。

source: Django 1.9 release notes
id: Catatan terbitan Django 1.9
zh_hans: Django 1.9 版本发行说明

source: *December 1, 2015*
id: *Desember 1, 2015*
zh_hans: *2015 年 12 月 1 日*

source: Welcome to Django 1.9!
id: Selamat datang di Django 1.9!
zh_hans: 欢迎使用 Django 1.9 ！

source: These release notes cover the :ref:`new features <whats-new-1.9>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.9>` you'll want to be aware of when upgrading from Django 1.8 or older versions. We've :ref:`dropped some features<removed-features-1.9>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-1.9>`.
id: Catatan terbitan ini melingkupi :ref:`new features <whats-new-1.9>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.9>` anda ingin sadari dari ketika meningkatkan dari Django 1.8 atau versi terlama. Kami telah :ref:`dropped some features <removed-features-1.9>` yang telah mencapai akhir dari siklus pengusangan mereka, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.9>`.
zh_hans: 这些发布说明包括 :ref:`新特性 <whats-new-1.9>`，以及从 Django 1.8 或更早版本升级时需要注意的一些 :ref:`不兼容变更 <backwards-incompatible-1.9>`。我们已经 :ref:`删除了一些已经完成了其废弃周期的功能 <removed-features-1.9>`，并且已经 :ref:`开始废弃某些功能 <deprecated-features-1.9>`。

source: Django 1.9 requires Python 2.7, 3.4, or 3.5. We **highly recommend** and only officially support the latest release of each series.
id: Django 1.9 membutuhkan Python 2.7, 3.4, or 3.5. Kami **sangat menganjurkan** dan hanya secara resmi mendukung terbitan terakhir dari setiap rangkaian.
zh_hans: Django 1.9 需要 Python 2.7、3.4 或 3.5。我们 **强烈建议** 并且只官方支持每个系列的最新版本。

source: The Django 1.8 series is the last to support Python 3.2 and 3.3.
id: Rangkaian Django 1.8 adalah dukungan terakhir untuk mendukung Python 3.2 dan 3.3.
zh_hans: Django 1.8 系列是最后一个支持 Python 3.2 和 3.3 的版本。

source: What's new in Django 1.9
id: Apa yang baru di Django 1.9
zh_hans: Django 1.9 的新特性

source: Performing actions after a transaction commit
id: Melakukan tindakan setelah perbaikan transaksi
zh_hans: 事务提交后执行操作

source: The new :func:`~django.db.transaction.on_commit` hook allows performing actions after a database transaction is successfully committed. This is useful for tasks such as sending notification emails, creating queued tasks, or invalidating caches.
id: Kaitan :func:`~django.db.transaction.on_commit` baru mengizinkan melakukan tindakan setelah sebuah transaksi basisdata berhasil diperbaiki. Ini berguna untuk tugas seperti mengirim surel pemberitahuan, membuat antrian tugas, atau membatalkan cache.
zh_hans: 新的 :func:`~django.db.transaction.on_commit` 钩子允许在数据库事务成功提交后执行操作。这对于执行诸如发送通知电子邮件、创建排队任务或使缓存无效等任务非常有用。

source: This functionality from the :pypi:`django-transaction-hooks` package has been integrated into Django.
zh_hans: 这个功能已经被集成到 Django 中，之前是作为 :pypi:`django-transaction-hooks` 包的一部分。

source: Password validation
id: Pengesahan sandi
zh_hans: 密码验证
