Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: If you have written a :ref:`custom password hasher <auth_password_storage>`, your ``encode()``, ``verify()`` or ``safe_summary()`` methods should accept Unicode parameters (``password``, ``salt`` or ``encoded``). If any of the hashing methods need byte strings, you can use the :func:`~django.utils.encoding.force_bytes` utility to encode the strings.
id: Jika anda telah menulis :ref:`custom password hasher <auth_password_storage>`, metode ``encode()``, ``verify()`` atau ``safe_summary()`` anda harus menerima parameter Unicode (``password``, ``salt`` atau ``encoded``). Jika tiap dari cara campuran butuh byte deretan karakter, anda dapat menggunakan kegunaan :func:`~django.utils.encoding.force_bytes` untuk menyandi deretan karakter.

source: `cleaned_data` dictionary kept for invalid forms
id: Kamus `cleaned_data` menjaga untuk formulir tidak sah.

source: The new packages are available on GitHub. The core team cannot efficiently maintain these packages in the long term it spans just a dozen countries at this time; similar to translations, maintenance will be handed over to interested members of the community.
id: Paket-paket baru tersedia di GitHub. Tim inti tidak dapat merawat paket-paket ini dalam jangka panjang -- itu terbentang hanya selusin negara pada saat ini; mirip pada terjemahan, perawatan akan diserahkan pada anggota yang tertarik di komunitas.

source: The ``django.utils.encoding.StrAndUnicode`` mix-in has been deprecated. Define a ``__str__`` method and apply the :func:`~django.utils.encoding.python_2_unicode_compatible` decorator instead.
id: Minx-in ``django.utils.encoding.StrAndUnicode`` telah diusangkan. Tentukan metode ``__str__`` dan berlakukan penghias :func:`~django.utils.encoding.python_2_unicode_compatible` sebagai gantinya.

source: The biggest fix is for a memory leak introduced in Django 1.5. Under certain circumstances, repeated iteration over querysets could leak memory - sometimes quite a bit of it. If you'd like more information, the details are in `our ticket tracker`__ (and in `a related issue`__ in Python itself).
id: Perbaikan terbesar untuk kebocoran memori diperkenalkan di Django 1.5. Dibawah keadaan tertentu perulangan berulang terhadap queryset dapat membocorkan memori - terkadang sedikit itu. Jika anda ingin informasi lebih lanjut, rincian adalah di `our ticket tracker`__ (dan di `a related issue`__ Python itu sendiri).

source: Fixed :class:`~django.db.models.ManyToManyField` if it has a unicode ``name`` parameter (#20207).
id: Diperbaiki :class:`~django.db.models.ManyToManyField` jika itu mempunyai parameter ``name`` unicode (#20207).

source: :mod:`django.contrib.sessions` currently uses :mod:`pickle` to serialize session data before storing it in the backend. If you're using the :ref:`signed cookie session backend<cookie-session-backend>` and :setting:`SECRET_KEY` is known by an attacker (there isn't an inherent vulnerability in Django that would cause it to leak), the attacker could insert a string into his session which, when unpickled, executes arbitrary code on the server. The technique for doing so is simple and easily available on the internet. Although the cookie session storage signs the cookie-stored data to prevent tampering, a :setting:`SECRET_KEY` leak immediately escalates to a remote code execution vulnerability.
id: :mod:`django.contrib.sessions` saat ini menggunakan :mod:`pickle` untuk menserialisasikan sesi data sebelum menyimpannya di backend. Jika anda sedang menggunakan :ref:`signed cookie session backend<cookie-session-backend>` dan :setting:`SECRET_KEY` diketahui oleh penyerang (tidak ada kerentanan melekat di Django yang menyebabkannya bocor), penyerang dapat memasukkan deretan karakter kedalam sesinya yang, ketika dibonglar, menjalankan kode berubah-ubah pada peladen. Teknik untuk melakukannya sangat sederhana dan mudah tersedia di internet. Meskipun penyimpanan sesi kue menandatangani data kue-disimpan untuk mencegah sabotase, bocoran :setting:`SECRET_KEY` segera meluas ke kerentanan pengerjaan kode terpencil.

source: Malcolm was a long-time contributor to Django, a model community member, a brilliant mind, and a friend. His contributions to Django and to many other open source projects are nearly impossible to enumerate. Many on the core Django team had their first patches reviewed by him; his mentorship enriched us. His consideration, patience, and dedication will always be an inspiration to us.
id: Malcom adalah pembantu lama pada Django, sebuah model anggota komunitas, pikiran cemerlang, dan seorang teman. Bantuannya pada Django - dan ke banyak proyek sumber terbuka lainnya - hampir tidak mungkin menghitung. Banyak pada tim Django inti mempunyai tambalan pertama mereka ditinjau oleh dia; bimbingannya memperkaya kami. Pertimbangan dia, kesabaran, dan pengabdian akan selalu menjadi inspirasi untuk kami.

source: Django now supports reusing the same database connection for several requests. This avoids the overhead of re-establishing a connection at the beginning of each request. For backwards compatibility, this feature is disabled by default. See :ref:`persistent-database-connections` for details.
id: Django sekarang menggunakan penggunaan kembali hubungan basisdata sama untuk beberapa permintaan. Ini menghindari kelebihan dari membangun kembali sebuah hubungan pada awal dari setiap permintaan. Untuk kesesuaian kebelakang, fitur ini ditiadakan secara awalan. Lihat :ref:`persistent-database-connections` untuk rincian.

source: The :meth:`~django.test.TransactionTestCase.assertQuerysetEqual` now checks for undefined order and raises :exc:`ValueError` if undefined order is spotted. The order is seen as undefined if the given ``QuerySet`` isn't ordered and there are more than one ordered values to compare against.
id: :meth:`~django.test.TransactionTestCase.assertQuerysetEqual` sekarang diperiksa untuk urutan tidak ditentukan dan memunculkan :exc:`ValueError` jika urutan tidak ditentukan dilihat. Urutan dilihat sebagai tidak ditentukan jika ``QuerySet`` diberikan tidak diurutkan dan ada lebih dari satu nilai terurut untuk dibandingkan.

source: Django now wraps all PEP-249 exceptions.
id: Django sekarang membungkus pengecualian PEP-249

source: The :attr:`~django.views.generic.edit.DeletionMixin.success_url` of :class:`~django.views.generic.edit.DeletionMixin` is now interpolated with its ``object``s ``__dict__``.
id: :attr:`~django.views.generic.edit.DeletionMixin.success_url` dari :class:`~django.views.generic.edit.DeletionMixin` sekarang ditambahkan dengan ``__dict__`` ``object`` nya.

source: `Pillow`_ is now the preferred image manipulation library to use with Django. `PIL`_ is pending deprecation (support to be removed in Django 1.8). To upgrade, you should **first** uninstall PIL, **then** install Pillow.
id: `Pillow`_ sekarang memilih pustaka mengubah gambar untuk menggunakan dengan Django. `PIL`_ ditunda pengusangan (dukungan untuk dipindahkan di Django 1.8). Untuk meningkatkan, anda harus **pertama** melepas PIL, **kemudian** pasang Pillow.

source: The :class:`~django.test.SimpleTestCase` class includes a new assertion helper for testing formset errors: :meth:`~django.test.SimpleTestCase.assertFormsetError`.
id: Kelas :class:`~django.test.SimpleTestCase` termasuk pembantu tuntutan baru untuk percobaan kesalahan formset: :meth:`~django.test.SimpleTestCase.assertFormsetError`.

source: :class:`~django.forms.ModelForm` fields can now override error messages defined in model fields by using the :attr:`~django.forms.Field.error_messages` argument of a ``Field``s constructor. To take advantage of this new feature with your custom fields, :ref:`see the updated recommendation <raising-validation-error>` for raising a ``ValidationError``.
id: Bidang-bidang :class:`~django.forms.ModelForm` sekarang dapat menimpa pesan-pesan kesalahan ditentukan di bidang model dengan menggunakan argumen :attr:`~django.forms.Field.error_messages` dari pembangun ``Field``. Untuk mengambil kesimpulan dari fitur ini dengan bidang penyesuaian anda, :ref:`see the updated recommendation <raising-validation-error>` untuk memunculkan ``ValidationError``.

source: This import forces the custom user model to be registered. Without this import, the test will be unable to swap in the custom user model, and you will get an error reporting::
id: Impor ini memaksa model pengguna penyesuaian untuk didaftarkan. Tanpa impor ini, percobaan akan tidak dapat bertukar di model pengguna penyesuaian, dan anda akan mendapatkan sebuah pelaporan kesalahan::

source: To achieve preserving and restoring list view filters, admin views now pass around the `_changelist_filters` GET parameter. It's important that you account for that change if you have custom admin templates or if your tests rely on the previous URLs. If you want to revert to the original behavior you can set the :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` attribute to ``False``.
id: Untuk mencapai melindungi dan meyimpan kembali daftar tampilan penyaring, tampilan admin sekarang melewatkan sekitar `_changelist_filters` parameter GET. Itu adalah penting bahwa akun anda untuk perubahan itu jika anda mempunyai penyesuaian cetakan admin atau jika percobaan anda bergantung pada URL sebelumnya. Jika anda ingin merubah ke perilaku aslinya anda dapat menyetel atribut :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` menjadi ``False``.

source: You can remove this URL pattern after your app has been deployed with Django 1.6 for :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.
id: Anda dapat memindahkan pola URL ini setelah aplikasi anda telah disebarkan dengan Django 1.6 untuk :setting:`PASSWORD_RESET_TIMEOUT_DAYS`.

source: Historically, :mod:`django.contrib.sessions` used :mod:`pickle` to serialize session data before storing it in the backend. If you're using the :ref:`signed cookie session backend<cookie-session-backend>` and :setting:`SECRET_KEY` is known by an attacker (there isn't an inherent vulnerability in Django that would cause it to leak), the attacker could insert a string into his session which, when unpickled, executes arbitrary code on the server. The technique for doing so is simple and easily available on the internet. Although the cookie session storage signs the cookie-stored data to prevent tampering, a :setting:`SECRET_KEY` leak immediately escalates to a remote code execution vulnerability.
id: Secara riwayat, :mod:`django.contrib.sessions` menggunakan :mod:`pickle` untuk menserialisasikan data sesi sebelum menyimpannya di backend. Jika anda sedang menggunakan :ref:`signed cookie session backend<cookie-session-backend>` dan :setting:`SECRET_KEY` dikenal oleh seorang penyerang (tidak ada kerentanan warisan di Django yang akan menyebabkan itu bocor), penyerang dapat memasukkan sebuah string ke dalam sesi yang, ketika tidak mengawetkan, menjalankan kode berubah-ubah di peladen. Teknik untuk melakukannya adalah sederhana dan mudah tersedia di internet. Meskipun penyimpanan sesi kue menandai data disimpan-kue untuk mencegah rusak, sebuah bocoran :setting:`SECRET_KEY` segera meningkatkan kerentanan ke pengerjaan kode terpencil.

source: If a ``NoReverseMatch`` exception is raised from a method when rendering a template, it is not silenced. For example, ``{{ obj.view_href }}`` will cause template rendering to fail if ``view_href()`` raises ``NoReverseMatch``. There is no change to the :ttag:`{% url %}<url>`tag, it causes template rendering to fail like always when ``NoReverseMatch`` is raised.
id: Jika sebuah pengecualian ``NoReverseMatch`` dimunculkan dari sebuah metode ketika membangun sebuah cetakan, itu adalah tidak diam. Sebagai contoh, ``{{ obj.view_href }}`` akan menyebabkan cetakan membangun menjadi gagal jika ``view_href()`` memunculkan ``NoReverseMatch``. Tidak ada perubahan pada etiket :ttag:`{% url %}<url>`, itu menyebabkan membangun cetakan menjadi gagal seperti selalu ketika ``NoReverseMatch`` dimunculkan.

source: :ref:`Authentication views <built-in-auth-views>` are now reversed by name, not their locations in ``django.contrib.auth.views``. If you are using the views without a ``name``, you should update your ``urlpatterns`` to use :meth:`~django.conf.urls.url` with the ``name`` parameter. For example::
id: :ref:`Authentication views <built-in-auth-views>` sekarang dibalik berdasarkan nama, ukan tempat mereka di ``django.contrib.auth.views``. Jika anda sedang menggunakan tampilan tanpa sebuah ``name``, anda harus memperbaharui ``urlpatterns`` anda untuk menggunakan :meth:`~django.conf.urls.url` dengan parameter ``name``. Sebagai contoh::

source: :class:`~django.views.generic.base.RedirectView` now has a `pattern_name` attribute which allows it to choose the target by reversing the URL.
id: :class:`~django.views.generic.base.RedirectView` sekarang mempunyai atribut `pattern_name` yang mengizinkannya memilih sasaran dengan membalikkan URL.

source: The new :option:`makemessages --keep-pot` option prevents deleting the temporary .pot file generated before creating the .po file.
id: Pilihan baru :option:`makemessages --keep-pot` mencegah menghapus berkas .pot sementara dibangkitkan sebelum pembuatan berkas .po.

source: Django 1.6 starts a process to correct this inconsistency. The ``future`` template library provides alternate implementations of :ttag:`cycle` and :ttag:`firstof` that autoescape their inputs. If you're using these tags, you're encouraged to include the following line at the top of your templates to enable the new behavior::
id: Django 1.6 mulai mengolah untuk memperbaiki ketidak konsistenannya. Pustaka cetakan ``future`` menyediakan penerapan lain dari :ttag:`cycle` dan :ttag:`firstof` yang meloloskan otomatis masukan mereka. Jika anda sedang menggunakan etiket ini, anda dianjurkan untuk menyertakan baris berikut pada atas dari cetakan anda untuk mengadakan perilaku baru::

source: Fixed ``BCryptSHA256PasswordHasher`` with py-bcrypt and Python 3 (#21398).
id: Diperbaiki ``BCryptSHA256PasswordHasher`` dengan py-bcrypt dan Python 3 (#21398).

source: Fixed ``django.contrib.humanize`` translations where the unicode sequence for the non-breaking space was returned verbatim (#21415).
id: Diperbaiki terjemahan ``django.contrib.humanize`` dimana urutan unicode untuk bukan-spasi putus telah dikembalikan kata demi kata (#21415).

source: Fixed a crash in the debug view after an exception occurred on Python 3.3 (#21443).
id: Diperbaiki sebuah kegagalan di tampilan mencari kesalahan setelah sebuah pengecualian muncul pada Python 3.3 (#21443).

source: Last year :func:`~django.utils.html.strip_tags` was changed to work iteratively. The problem is that the size of the input it's processing can increase on each iteration which results in an infinite loop in ``strip_tags()``. This issue only affects versions of Python that haven't received `a bugfix in HTMLParser <https://bugs.python.org/issue20288>`_; namely Python < 2.7.7 and 3.3.5. Some operating system vendors have also backported the fix for the Python bug into their packages of earlier versions.
id: Tahun lalu :func:`~django.utils.html.strip_tags` telah berubah untuk bekerja secara berulang. Masalah adalah bahwa ukuran dari masukan itu sedang olah dapat meningkat di setiap perulangan yang menghasilkan di perulangan tidak berujung di ``strip_tags()``. Masalah ini hanya mempengaruhi versi dari Python yang belum menerima `a bugfix in HTMLParser <https://bugs.python.org/issue20288>`_; dinamai Python < 2.7.7 and 3.3.5. Beberapa penjaja sistem operasi juga menghubungkan perbaikan untuk kesalahan Python kedalam paket mereka dari versi paling awal.

source: Restored bug fix for sending unicode email with Python 2.6.5 and below (:ticket:`19107`).
id: Disimpan kembali perbaikan untuk mengirim surel unicode dengan Python 2.6.5 dan dibawah (:ticket:`19107`).

source: ``name``: The field's attribute name on its parent model, or None if it is not part of a model
id: ``name``: Nama atribut bidang di model induknya, atau None jika itu adalah bukan bagian dari sebuah model.

source: :class:`~django.contrib.messages.storage.base.Message` objects now have a ``level_tag`` attribute that contains the string representation of the message level.
id: Obyek :class:`~django.contrib.messages.storage.base.Message` sekarang mempunyai sebuah atribut ``level_tag`` yang mengandung string perwakilan dari tingkatan pesan.

source: The ``"django.contrib.sessions.backends.cached_db"`` session backend now respects :setting:`SESSION_CACHE_ALIAS`. In previous versions, it always used the `default` cache.
id: Backend sesi ``"django.contrib.sessions.backends.cached_db"`` sekarang menghormati :setting:`SESSION_CACHE_ALIAS`. Di versi sebelumnya, itu selalu menggunakan cache `default`.

source: The :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` backend gets a sibling class called :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` that doesn't use the cache system at all but instead a JSON file called ``staticfiles.json`` for storing the mapping between the original file name (e.g. ``css/styles.css``) and the hashed file name (e.g. ``css/styles.55e7cbb9ba48.css``). The ``staticfiles.json`` file is created when running the :djadmin:`collectstatic` management command and should be a less expensive alternative for remote storages such as Amazon S3.
id: Backend :class:`~django.contrib.staticfiles.storage.CachedStaticFilesStorage` mendapatkan kelas saudara kandung dipanggil :class:`~django.contrib.staticfiles.storage.ManifestStaticFilesStorage` yang tidak menggunakan sistem penyembunyian pada semua tetapi malahan berkas JSON dipanggil ``staticfiles.json`` untuk menyimpan pemetaan diantara nama berkas asli (sebagai contoh ``css/styles.css``) dan nama berkas dicampur (sebagai contoh ``css/styles.55e7cbb9ba48.css``). Berkas ``staticfiles.json`` dibuat ketika menjalankan perintah pengelolaan :djadmin:`collectstatic` dan harus sedikit alternatif mahal untuk penyimpanan terpencil seperti Amazon S3.

source: :func:`~django.core.mail.send_mail` now accepts an ``html_message`` parameter for sending a multipart ``text/plain`` and ``text/html`` email.
id: :func:`~django.core.mail.send_mail` sekarang menerima sebuah parameter ``html_message`` untuk mengirim banyak bagian ``text/plain`` dan ``text/html`` surel.

source: It's now possible to customize the error messages for ``ModelForm``s ``unique``, ``unique_for_date``, and ``unique_together`` constraints. In order to support ``unique_together`` or any other ``NON_FIELD_ERROR``, ``ModelForm`` now looks for the ``NON_FIELD_ERROR`` key in the ``error_messages`` dictionary of the ``ModelForm``s inner ``Meta`` class. See :ref:`considerations regarding model's error_messages <considerations-regarding-model-errormessages>` for more details.
id: Itu sekarang memungkinkan untuk menyesuaikan pesan kesalahan untuk ``ModelForm`` ``unique``, ``unique_for_date``, dan batasan ``unique_together``. Untuk mendukung ``unique_together`` atau setiap ``NON_FIELD_ERROR`` lain, ``ModelForm`` sekarang mencari kunci ``NON_FIELD_ERROR`` di kamus ``error_messages`` dari ``ModelForm`` sebelah dalam kelas ``Meta``. Lihat :ref:`considerations regarding model's error_messages <considerations-regarding-model-errormessages>` untuk lebih rincian.

source: The :class:`~django.middleware.locale.LocaleMiddleware` now stores the user's selected language with the session key ``_language``. This should only be accessed using the :data:`~django.utils.translation.LANGUAGE_SESSION_KEY` constant. Previously it was stored with the key ``django_language`` and the ``LANGUAGE_SESSION_KEY`` constant did not exist, but keys reserved for Django should start with an underscore. For backwards compatibility ``django_language`` is still read from in 1.7. Sessions will be migrated to the new key as they are written.
id: :class:`~django.middleware.locale.LocaleMiddleware` sekarang menyimpan bahasa terpilih pengguna dengan kunci sesi ``_language``. Ini harus hanya bisa diakses menggunakan konstanta :data:`~django.utils.translation.LANGUAGE_SESSION_KEY`. Sebelumnya itu disimpan dengan kunci konstanta ``django_language`` dan ``LANGUAGE_SESSION_KEY``tidak ada, tetapi kunci disimpan untuk Django harus mulai dengan sebuah garis bawah. Untuk kesesuaian kebelakang ``django_language`` masih membaca dari di 1.7. Sesi akan dipindahkan ke kunci baru ketika mereka ditulis.

source: The :ttag:`blocktrans` tag now supports a ``trimmed`` option. This option will remove newline characters from the beginning and the end of the content of the ``{% blocktrans %}`` tag, replace any whitespace at the beginning and end of a line and merge all lines into one using a space character to separate them. This is quite useful for indenting the content of a ``{% blocktrans %}`` tag without having the indentation characters end up in the corresponding entry in the PO file, which makes the translation process easier.
id: Etiket :ttag:`blocktrans` sekarang mendukung sebuah pilihan ``trimmed``. Pilihan ini akan memindahkan karakter baris baru dari awal dan akhir dari isi dari etiket ``{% blocktrans %}``, ganti setiap ruang kosong pada awal dan akhir dari sebuah baris dan menggabungkan semua baris kedalam satu menggunakan karakter ruang kosong untuk memisahkan mereka. Ini sangat berguna untuk melekukkan isi dari etiket ``{% blocktrans %}`` tanpa memiliki karakter lekukan terakhir di masukan yang sesuai di berkas PO, yang membuat pengolahan terjemahan lebih mudah.

source: The :djadmin:`makemessages` command now always adds the ``--previous`` command line flag to the ``msgmerge`` command, keeping previously translated strings in po files for fuzzy strings.
id: Perintah :djadmin:`makemessages` sekarang selalu menambah bendera baris perintah ``--previous`` ke perintah ``msgmerge``, menjaga string terjemahan sebelumnya di berkas po untuk string tidak jelas.

source: On Linux systems, if pyinotify_ is installed, the development server will reload immediately when a file is changed. Previously, it polled the filesystem for changes every second. That caused a small delay before reloads and reduced battery life on laptops.
id: Di sistem Linux, jika pyinotify_ terpasang, peladen pengembangan akan memuat ulang segera ketika sebuah berkas berubah. Sebelumnya, itu menanyai sistem berkas untuk perubahan setiap detik. Itu menyebabkan penundaan kecil sebelum memuat kembali dan mengurangi hidup baterai di laptop.

source: Initial SQL data now works better if the sqlparse_ Python library is installed.
id: Inisial data SQL sekarang bekerja lebih baik jika pustaka Python sqlparse_ terpasang

source: You can use a single list for :attr:`~django.db.models.Options.index_together` (rather than a list of lists) when specifying a single set of fields.
id: Anda dapat menggunakan daftar tunggal untuk :attr:`~django.db.models.Options.index_together` (daripada sebuah daftar dari daftar) ketika menentukan setelan tunggal dari bidang.

source: The model signals can be now be connected to using a ``str`` of the ``'app_label.ModelName'`` form just like related fields to lazily reference their senders.
id: Sinyal model dapat sekarang dihubungkan untuk menggunakan ``str`` dari formulir ``'app_label.ModelName'`` - seperti bidang-bidang terkait - untuk bermalas-malasan mengacukan pengirim mereka.

source: deconstruct() and serializability
id: deconstruct() dan serializability
