Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: :class:`~django.contrib.admin.ModelAdmin` now preserves filters on the list view after creating, editing or deleting an object. It's possible to restore the previous behavior of clearing filters by setting the :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` attribute to ``False``.
id: :class:`~django.contrib.admin.ModelAdmin` sekarang mempertahankan penyaring pada daftar tampilan setelah membuat, menyunting atau menghapus sebuah obyek. Itu memungkinkan menyimpan kembali perilaku sebelumnya dari membersihkan penyaring dengan mengatur atribut :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` menjadi ``False``.
zh_hans: :class:`~django.contrib.admin.ModelAdmin` 在创建、编辑或删除对象后，现在会保留列表视图上的过滤器。可以通过将 :attr:`~django.contrib.admin.ModelAdmin.preserve_filters` 属性设置为 ``False`` 来恢复以前的清除过滤器的行为。

source: Added :meth:`FormMixin.get_prefix<django.views.generic.edit.FormMixin.get_prefix>` (which returns :attr:`FormMixin.prefix<django.views.generic.edit.FormMixin.prefix>` by default) to allow customizing the :attr:`~django.forms.Form.prefix` of the form.
id: Ditambahkan :meth:`FormMixin.get_prefix<django.views.generic.edit.FormMixin.get_prefix>` (yang mengembalikan :attr:`FormMixin.prefix<django.views.generic.edit.FormMixin.prefix>` secara awalan) untuk mengizinkan menyesuaikan :attr:`~django.forms.Form.prefix` dari formulir.
zh_hans: 新增了 :meth:`FormMixin.get_prefix<django.views.generic.edit.FormMixin.get_prefix>` （默认返回 :attr:`FormMixin.prefix<django.views.generic.edit.FormMixin.prefix>`），允许自定义表单的 :attr:`~django.forms.Form.prefix`。

source: Raw queries (``Manager.raw()`` or ``cursor.execute()``) can now use the "pyformat" parameter style, where placeholders in the query are given as ``'%(name)s'`` and the parameters are passed as a dictionary rather than a list (except on SQLite). This has long been possible (but not officially supported) on MySQL and PostgreSQL, and is now also available on Oracle.
id: Permintaan mentah (``Manager.raw()`` atau ``cursor.execute()``) sekarang dapat menggunakan gaya parameter "pyformat", dimana placeholder dalam permintaan diberikan sebagai ``'%(name)s'`` dan parameter dilewatkan sebagai sebuah kamus daripada sebuah daftar (kecuali di SQLite). Ini telam lama mungkin (tetapi bukan secara resmi didukung) di MySQL dan PostgreSQL, dan sekarang juga tersedia di Oracle.
zh_hans: 原始查询（``Manager.raw()`` 或 ``cursor.execute()``）现在可以使用 "pyformat" 参数样式，其中查询中的占位符以 ``'%(name)s'`` 形式给出，参数以字典形式传递，而不是列表（在 SQLite 上除外）。在 MySQL 和 PostgreSQL 上早就支持（但未得到官方支持），现在在 Oracle 上也可用。

source: The default iteration count for the PBKDF2 password hasher has been increased by 20%. This backwards compatible change will not affect existing passwords or users who have subclassed ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` to change the default value. Passwords :ref:`will be upgraded <password-upgrades>` to use the new iteration count as necessary.
id: Perhitungan putaran awal untuk pengacak sandi PBKDF2 telah ditingkatkan oleh 20%. Perubahan kesesuaian kebelakang tidak akan mempengaruhi sandi atau pengguna yang mempunyai disubkelaskan ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` untuk merubah nilai awal. Sandi :ref:`will be upgraded <password-upgrades>` untuk menggunakan perhitungan putaran baru sesuai kebutuhan.
zh_hans: PBKDF2 密码哈希器的默认迭代次数增加了 20%。这个向后兼容的更改不会影响现有的密码或已经子类化 ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` 以更改默认值的用户。必要时，密码将 :ref:`被升级 <password-upgrades>` 以使用新的迭代次数。

source: Backwards incompatible changes in 1.6
id: Perubahan bertentangan kebelakang di 1.6
zh_hans: Django 1.6 中的向后不兼容变更

source: In addition to the changes outlined in this section, be sure to review the :ref:`deprecation plan <deprecation-removed-in-1.6>` for any features that have been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada perubahan diuraikan di bagian ini, pastikan untuk meninjau kembali :ref:`deprecation plan <deprecation-removed-in-1.6>` untuk setiap fitur yang telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur yang diberikan, perpindahannya mugkin muncul sebagai perubahan ketidaksesuaian kebelakang.
zh_hans: 除了本节中概述的更改之外，还请务必查看 :ref:`弃用计划 <deprecation-removed-in-1.6>`，以了解已删除的功能。如果在给定功能的弃用时间范围内未更新代码，则其删除可能会显示为不向后兼容的更改。

source: New transaction management model
id: Model pengelolaan transaksi baru
zh_hans: 全新的事务管理模型

source: Behavior changes
id: Perubahan perilaku
zh_hans: 行为变更

source: Database-level autocommit is enabled by default in Django 1.6. While this doesn't change the general spirit of Django's transaction management, there are a few backwards-incompatibilities.
id: Pembenaran otomatis tingkat-basisdata diadakan secara awalan di Django 1.6. Selagi ini tidak merubah jiwa umum dari pengelolaan transaksi Django, ada sedikit ketidaksesuaian-kebelakang.
zh_hans: 在 Django 1.6 中，默认情况下启用了数据库级别的自动提交。虽然这不会改变 Django 事务管理的一般原则，但会引入一些不兼容性。

source: Savepoints and ``assertNumQueries``
id: Savepoints dan ``assertNumQueries``
zh_hans: 保存点和 ``assertNumQueries``

source: The changes in transaction management may result in additional statements to create, release or rollback savepoints. This is more likely to happen with SQLite, since it didn't support savepoints until this release.
id: Perubahan di pengelolaan transaksi dapat menghasilkan di pernyataan tambahan untuk membuat, menerbitkan atau menyimpan kembali titik penyimpanan sampai terbitan ini.
zh_hans: 事务管理的变更可能会导致额外的语句来创建、释放或回滚保存点。这在 SQLite 中更有可能发生，因为在此版本之前它不支持保存点。

source: If tests using :meth:`~django.test.TransactionTestCase.assertNumQueries` fail because of a higher number of queries than expected, check that the extra queries are related to savepoints, and adjust the expected number of queries accordingly.
id: Jika percobaan menggunakan :meth:`~django.test.TransactionTestCase.assertNumQueries` gagal karena dari angka tertinggi dari permintaan daripada diharapkan, periksa bahwa permintaan tambahan dikaitkan ke titik penyimpanan, dan menyesuaikan angka yang diharapkan dari permintaan sesuai dengan itu.
zh_hans: 如果使用 :meth:`~django.test.TransactionTestCase.assertNumQueries` 的测试因查询次数超过预期而失败，请检查额外的查询是否与保存点相关，并相应地调整预期的查询次数。

source: Autocommit option for PostgreSQL
id: Pilihan perbaikan otomatis untuk PostgreSQL
zh_hans: PostgreSQL 的自动提交选项

source: In previous versions, database-level autocommit was only an option for PostgreSQL, and it was disabled by default. This option is now ignored and can be removed.
id: Di versi sebelumnya, perbaikan otomatis tingkatan-basisdata hanya sebuah pilihan untuk PostgreSQL, dan itu ditiadakan secara awalan. Pilihan ini sekarang diabaikan dan dapat dipindah.
zh_hans: 在先前版本中，数据库级别的自动提交仅适用于 PostgreSQL，并且默认情况下被禁用。现在该选项被忽略并可以移除。

source: New test runner
id: Pejalan percobaan baru
zh_hans: 全新的测试运行器

source: In order to maintain greater consistency with Python's ``unittest`` module, the new test runner (``django.test.runner.DiscoverRunner``) does not automatically support some types of tests that were supported by the previous runner:
zh_hans: 为了与 Python 的 ``unittest`` 模块保持更一致，新的测试运行器（``django.test.runner.DiscoverRunner``）不会自动支持以前的运行器支持的一些测试类型：

source: Tests in ``models.py`` and ``tests/__init__.py`` files will no longer be found and run. Move them to a file whose name begins with ``test``.
id: Percobaan di berkas ``models.py`` dan ``tests/__init__.py`` tidak lagi ditemukan dan berjalan. Pindahkan mereka ke sebuah berkas yang namanya dimulai dengan ``test``.
zh_hans: 不再会查找和运行 ``models.py`` 和 ``tests/__init__.py`` 文件中的测试。将它们移到文件名以 ``test`` 开头的文件中。

source: Doctests will no longer be automatically discovered. To integrate doctests in your test suite, follow the :ref:`recommendations in the Python documentation <doctest-unittest-api>`.
id: Doctest tidak akan lagi secara otomatis ditemukan. Untuk memadukan doctest ke deretan percobaan anda, ikuti :ref:`recommendations in the Python documentation <doctest-unittest-api>`.
zh_hans: 不再自动发现 doctests。要将 doctests 集成到测试套件中，请遵循 Python 文档中的 :ref:`建议 <doctest-unittest-api>`。

source: Django bundles a modified version of the :mod:`doctest` module from the Python standard library (in ``django.test._doctest``) and includes some additional doctest utilities. These utilities are deprecated and will be removed in Django 1.8; doctest suites should be updated to work with the standard library's doctest module (or converted to ``unittest``-compatible tests).
zh_hans: Django 包含了 Python 标准库中的 :mod:`doctest` 模块的修改版本（在 ``django.test._doctest`` 中），并包含一些额外的 doctest 工具。这些工具已被弃用，并将在 Django 1.8 中删除；doctest 测试套件应该更新以使用标准库的 doctest 模块（或转换为与 ``unittest`` 兼容的测试）。

source: If you wish to delay updates to your test suite, you can set your :setting:`TEST_RUNNER` setting to ``django.test.simple.DjangoTestSuiteRunner`` to fully restore the old test behavior. ``DjangoTestSuiteRunner`` is deprecated but will not be removed from Django until version 1.8.
id: Jika anda berharap menunda perbaharuan ke deretan percobaan anda, anda dapat menyetel pengaturan :setting:`TEST_RUNNER` anda menjadi ``django.test.simple.DjangoTestSuiteRunner`` untuk sepenuhnya menyimpan kembali perilaku percobaan lama. ``DjangoTestSuiteRunner`` diusangkan tetapi tidak akan dipindahkan dari Django sampai versi 1.8.
zh_hans: 如果希望延迟更新测试套件，可以将 :setting:`TEST_RUNNER` 设置为 ``django.test.simple.DjangoTestSuiteRunner``，以完全恢复旧的测试行为。虽然 ``DjangoTestSuiteRunner`` 已被弃用，但在 Django 1.8 版本之前不会从 Django 中删除。

source: Removal of ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner`` GeoDjango custom test runner
id: Perpindahan dari pejalan percobaan penyesuaian GeoDjango ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner``
zh_hans: 移除了 ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner`` GeoDjango 自定义测试运行器。

source: This is for developers working on the GeoDjango application itself and related to the item above about changes in the test runners:
id: Ini adalah untuk pengembang yang bekerja pada aplikasi GeoDjango itu sendiri dan terkait ke barang diatas tentang perubahan di penjalan percobaan:
zh_hans: 这适用于开发 GeoDjango 应用程序本身及其相关开发人员，与上述有关测试运行器变更的项目相关：

source: The ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner`` test runner has been removed and the standalone GeoDjango tests execution setup it implemented isn't supported anymore. To run the GeoDjango tests simply use the new ``DiscoverRunner`` and specify the ``django.contrib.gis`` app.
id: Penjalan percobaan ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner`` telah dipindahkan dan setelan pengerjaan percobaan GeoDajngo berdiri sendiri itu terapkan tidak didukung lagi. Untuk menjalankan percobaan GeoDjango cukup gunakan ``DiscoverRunner`` baru dan tentukan aplikasi ``django.contrib.gis``.
zh_hans: ``django.contrib.gis.tests.GeoDjangoTestSuiteRunner`` 测试运行器已被移除，它实现的独立 GeoDjango 测试执行设置不再受支持。要运行 GeoDjango 测试，只需使用新的 ``DiscoverRunner`` 并指定 ``django.contrib.gis`` 应用程序。

source: Custom user models in tests
id: Menyesuaikan model user di percobaan
zh_hans: 在测试中使用自定义用户模型

source: The introduction of the new test runner has also slightly changed the way that test models are imported. As a result, any test that overrides ``AUTH_USER_MODEL`` to test behavior with one of Django's test user models ( ``django.contrib.auth.tests.custom_user.CustomUser`` and ``django.contrib.auth.tests.custom_user.ExtensionUser``) must now explicitly import the User model in your test module::
id: Perkenalan dari pejalan percobaan baru juga sedikit merubah cara dimana model percobaan diimpor. Sebagai hasilnya, percobaan apapun yang menimpa ``AUTH_USER_MODEL`` untuk mencoba perilaku dengan satu dari model pengguna percobaan Dajngo ( ``django.contrib.auth.tests.custom_user.CustomUser`` dan ``django.contrib.auth.tests.custom_user.ExtensionUser``) harus sekarang secara eksplisit impor model User di modul percobaan anda::
zh_hans: 新测试运行器的引入也稍微改变了测试模型的导入方式。因此，任何覆盖 ``AUTH_USER_MODEL`` 以测试与 Django 的测试用户模型之一（``django.contrib.auth.tests.custom_user.CustomUser`` 和 ``django.contrib.auth.tests.custom_user.ExtensionUser``）行为的测试现在必须在测试模块中显式导入用户模型：

source: This import forces the custom user model to be registered. Without this import, the test will be unable to swap in the custom user model, and you will get an error reporting:
zh_hans: 这个导入语句会强制注册自定义用户模型。如果没有这个导入语句，测试将无法切换到自定义用户模型，你将会收到一个错误报告：

source: Time zone-aware ``day``, ``month``, and ``week_day`` lookups
id: Sadar-zona waktu pencarian ``day``, ``month``, dan ``week_day``
zh_hans: 时间区域感知的 ``day``、``month`` 和 ``week_day`` 查找

source: Django 1.6 introduces time zone support for :lookup:`day`, :lookup:`month`, and :lookup:`week_day` lookups when :setting:`USE_TZ` is ``True``. These lookups were previously performed in UTC regardless of the current time zone.
id: Django 1.6 memperkenalkan dukungan zona waktu untuk pencarian :lookup:`day`, :lookup:`month`, dan :lookup:`week_day` ketika :setting:`USE_TZ` adalah ``True``. Pencarian ini sebelumnya dilakukan di UTC tanpa memperhatikan dari zona waktu sekarang.
zh_hans: Django 1.6 在 :setting:`USE_TZ` 为 ``True`` 时引入了对 :lookup:`day`、:lookup:`month` 和 :lookup:`week_day` 查找的时间区域支持。以前，这些查找在不考虑当前时区的情况下都在 UTC 中执行。

source: This requires :ref:`time zone definitions in the database <database-time-zone-definitions>`. If you're using SQLite, you must install pytz_. If you're using MySQL, you must install pytz_ and load the time zone tables with `mysql_tzinfo_to_sql`_.
id: Ini membutuhkan :ref:`time zone definitions in the database <database-time-zone-definitions>`. Jika anda sedang menggunakan SQLite, anda harus memasang pytz_. Jika anda sedang menggunakan MySQL, anda harus memasang pytz_ dan memuat tabel zona waktu dengan `mysql_tzinfo_to_sql`_.
zh_hans: 这需要数据库中的 :ref:`时区定义 <database-time-zone-definitions>`。如果使用的是 SQLite，你必须安装 pytz_。如果使用的是 MySQL，你必须安装 pytz_ 并使用 `mysql_tzinfo_to_sql`_ 加载时区表。

source: Addition of ``QuerySet.datetimes()``
id: Tambahan dari ``QuerySet.datetimes()``
zh_hans: 添加了 ``QuerySet.datetimes()`` 方法

source: When the :doc:`time zone support </topics/i18n/timezones>` added in Django 1.4 was active, :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` lookups returned unexpected results, because the aggregation was performed in UTC. To fix this, Django 1.6 introduces a new API, :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`. This requires a few changes in your code.
id: Ketika :doc:`time zone support </topics/i18n/timezones>` ditambahkan di Django 1.4 telah aktif, pencarian :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` mengembalikan hasil tidak diharapkan, karena pengumpulan telah dilakukan dalam UTC. Untuk memperbaiki ini, Django 1.6 memperkenalkan API baru, :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`. Ini membutuhkan sedikit perubahan di kode anda.
zh_hans: 当 Django 1.4 中添加的 :doc:`时区支持 </topics/i18n/timezones>` 处于活动状态时，:meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` 查找返回了意外的结果，因为聚合是在 UTC 中执行的。为了解决这个问题，Django 1.6 引入了一个新的 API，:meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`。这需要在你的代码中进行一些更改。

source: ``QuerySet.dates()`` returns ``date`` objects
id: ``QuerySet.dates()`` mengembalikan obyek ``date``
zh_hans: ``QuerySet.dates()`` 返回的是 ``date`` 对象

source: :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` now returns a list of :class:`~datetime.date`. It used to return a list of :class:`~datetime.datetime`.
id: :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` sekarang mengemblikan sebuah daftar dari :class:`~datetime.date`. Itu digunakan untuk mengembalikan sebuah daftar :class:`~datetime.datetime`.
zh_hans: :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` 现在返回的是 :class:`~datetime.date` 的列表。它以前返回的是 :class:`~datetime.datetime` 的列表。

source: :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` returns a list of :class:`~datetime.datetime`.
id: :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` mengembalikan sebuah daftar dari :class:`~datetime.datetime`.
zh_hans: :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` 返回的是 :class:`~datetime.datetime` 的列表。

source: ``QuerySet.dates()`` no longer usable on ``DateTimeField``
id: ``QuerySet.dates()`` tidak lagi digunakan pada ``DateTimeField``
zh_hans: ``QuerySet.dates()`` 不再适用于 ``DateTimeField``

source: :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` raises an error if it's used on :class:`~django.db.models.DateTimeField` when time zone support is active. Use :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` instead.
id: :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` memunculkan sebuah kesalahan jika itu digunakan di :class:`~django.db.models.DateTimeField` ketika dukungan zona waktu aktif. Gunakan :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` sebagai gantinya.
zh_hans: 当时间区域支持处于活动状态时，如果在 :class:`~django.db.models.DateTimeField` 上使用 :meth:`QuerySet.dates() <django.db.models.query.QuerySet.dates>` 会引发错误。此时应该使用 :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`。

source: ``date_hierarchy`` requires time zone definitions
id: ``date_hierarchy`` membutuhkan penentuan zona waktu
zh_hans: ``date_hierarchy`` 需要时间区域定义

source: The :attr:`~django.contrib.admin.ModelAdmin.date_hierarchy` feature of the admin now relies on :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` when it's used on a :class:`~django.db.models.DateTimeField`.
id: Fitur :attr:`~django.contrib.admin.ModelAdmin.date_hierarchy` dari admin sekarang bergantung pada :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>` ketika itu digunakan di :class:`~django.db.models.DateTimeField`.
zh_hans: 在管理员中使用 :attr:`~django.contrib.admin.ModelAdmin.date_hierarchy` 特性时，如果它用于 :class:`~django.db.models.DateTimeField`，现在会依赖于 :meth:`QuerySet.datetimes() <django.db.models.query.QuerySet.datetimes>`。

source: This requires time zone definitions in the database when :setting:`USE_TZ` is ``True``. :ref:`Learn more <database-time-zone-definitions>`.
id: Ini membutuhkan penentuan zona waktu di basisdata ketika :setting:`USE_TZ` adalah ``True``. :ref:`Learn more <database-time-zone-definitions>`.
zh_hans: 这需要在数据库中启用时区定义，当 :setting:`USE_TZ` 设置为 ``True`` 时。详细信息请参阅 :ref:`了解更多 <database-time-zone-definitions>`。

source: ``date_list`` in generic views requires time zone definitions
id: ``date_list`` dalam tampilan umum membutuhkan penentuan zona waktu
zh_hans: 在通用视图中使用的 ``date_list`` 需要时间区域的定义

source: For the same reason, accessing ``date_list`` in the context of a date-based generic view requires time zone definitions in the database when the view is based on a :class:`~django.db.models.DateTimeField` and :setting:`USE_TZ` is ``True``. :ref:`Learn more <database-time-zone-definitions>`.
id: Untuk alasan sama, mengakses ``date_list`` di konteks dari tampilan umum berdasarkan-tanggal membutuhkan penentuan zona waktu di basisdata ketika tampilan berdasarkan pada :class:`~django.db.models.DateTimeField` dan :setting:`USE_TZ` adalah ``True``. :ref:`Learn more <database-time-zone-definitions>`.
zh_hans: 出于相同的原因，当视图基于 :class:`~django.db.models.DateTimeField` 且 :setting:`USE_TZ` 设置为 ``True`` 时，在日期为基础的通用视图中访问上下文中的 ``date_list`` 需要数据库中的时间区域定义。详细信息请参阅 :ref:`了解更多 <database-time-zone-definitions>`。

source: New lookups may clash with model fields
id: Pencarian baru mungkin bertabrakan dengan bidang-bidang model
zh_hans: 新的查找可能与模型字段冲突

source: Django 1.6 introduces ``hour``, ``minute``, and ``second`` lookups on :class:`~django.db.models.DateTimeField`. If you had model fields called ``hour``, ``minute``, or ``second``, the new lookups will clash with you field names. Append an explicit :lookup:`exact` lookup if this is an issue.
id: Django 1.6 memperkenalkan pencarian ``hour``, ``minute``, dan ``second`` di :class:`~django.db.models.DateTimeField`. Jika anda mempunyai bidang model dipanggil ``hour``, ``minute``, atau ``second``, pencarian baru akan bentrok dengan nama bidang anda. Tambahkan sebuah pencarian :lookup:`exact` jelas jika ini adalah sebuah masalah.
zh_hans: Django 1.6 引入了在 :class:`~django.db.models.DateTimeField` 上的 ``hour``、``minute`` 和 ``second`` 查找。如果您的模型字段名为 ``hour``、``minute`` 或 ``second``，新的查找可能会与您的字段名冲突。如果出现此问题，请附加一个明确的 :lookup:`exact` 查找。

source: ``BooleanField`` no longer defaults to ``False``
id: ``BooleanField`` tidak lagi disetel ke `False``
zh_hans: ``BooleanField`` 不再默认为 ``False``

source: When a :class:`~django.db.models.BooleanField` doesn't have an explicit :attr:`~django.db.models.Field.default`, the implicit default value is ``None``. In previous version of Django, it was ``False``, but that didn't represent accurately the lack of a value.
id: Ketika sebuah :class:`~django.db.models.BooleanField` tidak mempunyai :attr:`~django.db.models.Field.default` jelas, nilai awalan tersirat adalah ``None``. Dalam versi sebelumnya dari Django, itu adalah ``False``, tetapi itu tidak mewakili secara akurat kekurangan dari sebuah nilai.
zh_hans: 当一个 :class:`~django.db.models.BooleanField` 没有明确的 :attr:`~django.db.models.Field.default` 时，隐式的默认值是 ``None``。在之前的 Django 版本中，默认值是 ``False``，但这并没有准确地表示缺少值。

source: Code that relies on the default value being ``False`` may raise an exception when saving new model instances to the database, because ``None`` isn't an acceptable value for a :class:`~django.db.models.BooleanField`. You should either specify ``default=False`` in the field definition, or ensure the field is set to ``True`` or ``False`` before saving the object.
id: Kode yang bergantung pada nilai awalan menjadi ``False`` mungkin memunculkan sebuah pengecualian ketika menyimpan instance model baru ke basisdata, karena ``None`` bukan sebuah nilai yang dapat diterima untuk sebuah :class:`~django.db.models.BooleanField`. Anda harus juga menentukan ``default=False`` di penentuan bidang, atau memastikan bidang disetel ke ``True`` atau ``False`` sebelum menyimpan obyek.
zh_hans: 依赖默认值为 ``False`` 的代码在保存新的模型实例到数据库时可能会引发异常，因为 ``None`` 不是 :class:`~django.db.models.BooleanField` 的可接受值。您应该在字段定义中明确指定 ``default=False``，或者在保存对象之前确保字段被设置为 ``True`` 或 ``False``。

source: Translations and comments in templates
id: Terjemahan dan komentar dalam cetakan
zh_hans: 模板中的翻译和注释

source: Extraction of translations after comments
id: Pengeluaran dari terjemahan setelah komentar
zh_hans: 提取注释后的翻译内容

source: Extraction of translatable literals from templates with the :djadmin:`makemessages` command now correctly detects i18n constructs when they are located after a ``{#`` / ``#}``-type comment on the same line. E.g.:
id: Pengeluaran dari harfiah dapat diterjemahkan dari cetakan dengan perintah :djadmin:`makemessages` sekarang dengan benar mengenali gagasan i18n ketika mereka ditempatkan setelah sebuah ``{#`` / ``#}``- ketik komentar di baris sama. Sebagai contoh:
zh_hans: 使用 :djadmin:`makemessages` 命令从模板中提取可翻译文字时，现在可以正确检测到位于同一行的 ``{#`` / ``#}`` 类型的注释之后的 i18n 构造。例如：

source: Location of translator comments
id: Tempat untuk komentar penterjemah
zh_hans: 翻译者注释的位置

source: :ref:`translator-comments-in-templates` specified using ``{#`` / ``#}`` need to be at the end of a line. If they are not, the comments are ignored and :djadmin:`makemessages` will generate a warning. For example:
id: :ref:`translator-comments-in-templates` ditentukan menggunakan ``{#`` / ``#}`` harus pada akhir dari sebuah baris. Jika mereka tidak, komentar diabaikan dan :djadmin:`makemessages` akan membangkitkan sebuah peringatan. Sebagai contoh:
zh_hans: :ref:`translator-comments-in-templates` 使用 ``{#`` / ``#}`` 指定的注释必须位于一行的末尾。如果不是，这些注释将被忽略，并且 :djadmin:`makemessages` 将生成警告。例如：

source: Quoting in ``reverse()``
id: Mengutip dalam ``reverse()``
zh_hans: ``reverse()`` 中的引号
