Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Reallowed the ``{% for %}`` tag to unpack any iterable (:ticket:`27058`).
id: Diizinkan kembali etiket ``{% for %}`` untuk membuka setiap dapat berulang (:ticket:`27058`).
zh_hans: 重新允许 ``{% for %}`` 标签解包任何可迭代对象 (:ticket:`27058`)。

source: Made ``makemigrations`` skip inconsistent history checks on non-default databases if database routers aren't in use or if no apps can be migrated to the database (:ticket:`27054`, :ticket:`27110`, :ticket:`27142`).
id: Membuat ``makemigrations`` melewati pemeriksaan riwayat tidak tetap pada basisdata bukan-awalan jika perute basisdata tidak digunakan atau jika bukan aplikasi dapat dipindahkan ke basisdata (:ticket:`27054`, :ticket:`27110`, :ticket:`27142`).
zh_hans: 如果没有使用数据库路由器，或者没有应用可以迁移到数据库，则在非默认数据库上使 ``makemigrations`` 跳过不一致的历史检查 (:ticket:`27054`, :ticket:`27110`, :ticket:`27142`)。

source: Removed duplicated managers in ``Model._meta.managers`` (:ticket:`27073`).
id: Dipindahkan pengelola ganda dalam ``Model._meta.managers`` (:ticket:`27073`).
zh_hans: 移除了 ``Model._meta.managers`` 中的重复管理器 (:ticket:`27073`)。

source: Fixed ``contrib.admindocs`` crash when a view is in a class, such as some of the admin views (:ticket:`27018`).
id: Diperbaiki kegagalan ``contrib.admindocs`` ketika sebuah tampilan ada di sebuah kelas, seperti beberapa dari tampilan admin (:ticket:`27018`).
zh_hans: 修复了 ``contrib.admindocs`` 在视图位于类中（例如某些管理视图）时崩溃的问题 (:ticket:`27018`)。

source: Reverted a few admin checks that checked ``field.many_to_many`` back to ``isinstance(field, models.ManyToManyField)`` since it turned out the checks weren't suitable to be generalized like that (:ticket:`26998`).
id: Dikembalikan sedikit pemeriksaan admin yang memeriksa ``field.many_to_many`` kembali ke ``isinstance(field, models.ManyToManyField)`` sejak itu ternyata pemeriksaan tidak cocok untuk disamaratakan seperti itu (:ticket:`26998`).
zh_hans: 回滚了一些检查，这些检查将 ``field.many_to_many`` 检查回到 ``isinstance(field, models.ManyToManyField)``，因为事实证明这些检查不适合这样泛化 (:ticket:`26998`)。

source: Added the database alias to the ``InconsistentMigrationHistory`` message raised by ``makemigrations`` and ``migrate`` (:ticket:`27089`).
id: Ditambahkan nama lain basisdata pada pesan ``InconsistentMigrationHistory`` dimunculkan oleh ``makemigrations`` dan ``migrate`` (:ticket:`27089`).
zh_hans: 在 ``makemigrations`` 和 ``migrate`` 引发的 ``InconsistentMigrationHistory`` 消息中添加了数据库别名 (:ticket:`27089`)。

source: Fixed the creation of ``ContentType`` and ``Permission`` objects for models of applications without migrations when calling the ``migrate`` command with no migrations to apply (:ticket:`27044`).
id: Diperbaiki pembuatan dari obyek ``ContentType`` dan ``Permission`` untuk model dari aplikasi tanpa perpndahan ketika memanggil perintah ``migrate`` dengan tidak ada perpindahan untuk diberlakukan (:ticket:`27044`).
zh_hans: 在没有要应用的迁移时，通过调用 ``migrate`` 命令修复了在没有迁移的应用程序模型中创建 ``ContentType`` 和 ``Permission`` 对象的问题 (:ticket:`27044`)。

source: Included the already applied migration state changes in the ``Apps`` instance provided to the ``pre_migrate`` signal receivers to allow ``ContentType`` renaming to be performed on model rename (:ticket:`27100`).
id: Disertakan perubahan keadaan perpindahan sudah diberlakukan di instance ``App`` disediakan ke penerima sinyal ``pre_migrate`` untuk mengizinkan penamaan kembali ``ContentType`` pada penamaan kembali model (:ticket:`27100`).
zh_hans: 在提供给 ``pre_migrate`` 信号接收器的 ``Apps`` 实例中包括已应用的迁移状态更改，以允许在模型重命名时执行 ``ContentType`` 重命名 (:ticket:`27100`)。

source: Reallowed subclassing ``UserCreationForm`` without ``USERNAME_FIELD`` in ``Meta.fields`` (:ticket:`27111`).
id: Diizinkan kembali mensubkelaskan ``UserCreationForm`` tanpa ``USERNAME_FIELD`` di ``Meta.fields`` (:ticket:`27111`).
zh_hans: 重新允许在 ``Meta.fields`` 中没有 ``USERNAME_FIELD`` 的情况下继承 ``UserCreationForm`` (:ticket:`27111`)。

source: Fixed a regression in model forms where model fields with a ``default`` that didn't appear in POST data no longer used the ``default`` (:ticket:`27039`).
id: Diperbaiki pemulihan di formulir model dimana bidang model dengan ``default`` yang tidak muncul di data POST tidak lagi menggunakan ``default`` (:ticket:`27039`).
zh_hans: 修复了模型表单中的一个回归问题，即模型字段具有未出现在 POST 数据中的 ``default`` 不再使用 ``default`` (:ticket:`27039`)。

source: Django 1.10.2 release notes
id: Catatan terbitan Django 1.10.2
zh_hans: Django 1.10.2 版本发行说明

source: *October 1, 2016*
id: *1 Oktober 2016*
zh_hans: *2016 年 10 月 1 日*

source: Django 1.10.2 fixes several bugs in 1.10.1.
id: Django 1.10.2 memperbaiki beberapa kesalahan di 1.10.1.
zh_hans: Django 1.10.2 修复了 1.10.1 中的几个漏洞。

source: Fixed a crash in MySQL database validation where ``SELECT @@sql_mode`` doesn't return a result (:ticket:`27180`).
id: Diperbaiki sebuah kegagalan di pengesahan basisdata MySQL dimana ``SELECT @@sql_mode`` tidak mengembalikan sebuah hasil (:ticket:`27180`).
zh_hans: 修复了 MySQL 数据库验证中的一个崩溃问题，其中 ``SELECT @@sql_mode`` 不返回结果 (:ticket:`27180`)。

source: Allowed combining ``contrib.postgres.search.SearchQuery`` with more than one ``&`` or ``|`` operators (:ticket:`27143`).
id: Diizinkan memadukan ``contrib.postgres.search.SearchQuery`` dengan lebih dari satu penghubung ``&`` atau ``|`` (:ticket:`27143`).
zh_hans: 允许将 ``contrib.postgres.search.SearchQuery`` 与多个 ``&`` 或 ``|`` 操作符组合使用 (:ticket:`27143`)。

source: Disabled system check for URL patterns beginning with a '/' when ``APPEND_SLASH=False`` (:ticket:`27238`).
id: Meniadakan pemeriksaan sistem untuk pola URL dimulai dengan sebuah '/' ketika ``APPEND_SLASH=False`` (:ticket:`27238`).
zh_hans: 在 ``APPEND_SLASH=False`` 时，禁用了以 '/' 开头的 URL 模式的系统检查 (:ticket:`27238`)。

source: Fixed model form ``default`` fallback for ``CheckboxSelectMultiple``, ``MultiWidget``, ``FileInput``, ``SplitDateTimeWidget``, ``SelectDateWidget``, and ``SplitArrayWidget`` (:ticket:`27186`). Custom widgets affected by this issue should implement :meth:`~django.forms.Widget.value_omitted_from_data`.
id: Diperbaiki formulir model fallback ``default`` untuk ``CheckboxSelectMultiple``, ``MultiWidget``, ``FileInput``, ``SplitDateTimeWidget``, ``SelectDateWidget``, dan ``SplitArrayWidget`` (:ticket:`27186`). Widget penyesuaian dipengaruhi oleh masalah ini harus menerapkan :meth:`~django.forms.Widget.value_omitted_from_data`.
zh_hans: 修复了模型表单中对于 ``CheckboxSelectMultiple``、``MultiWidget``、``FileInput``、``SplitDateTimeWidget``、``SelectDateWidget`` 和 ``SplitArrayWidget`` 的 ``default`` 回退问题 (:ticket:`27186`)。受此问题影响的自定义小部件应该实现 :meth:`~django.forms.Widget.value_omitted_from_data`。

source: Fixed a crash in ``runserver`` logging during a "Broken pipe" error (:ticket:`27271`).
id: Diperbaiki sebuah kegagalan di mencatat ``runserver`` selama kesalahan "Broken pipe" (:ticket:`27271`).
zh_hans: 修复了在 "Broken pipe" 错误期间 ``runserver`` 日志记录中的崩溃问题 (:ticket:`27271`)。

source: Fixed a regression where unchanged localized date/time fields were listed as changed in the admin's model history messages (:ticket:`27302`).
id: Diperbaiki sebuah pemulihan dimana bidang tanggal/waktu lokal tidak berubah didaftarkan sebagai berubah di pesan riwayat model admin (:ticket:`27302`).
zh_hans: 修复了一个回归问题，即在管理员的模型历史消息中，未更改的本地化日期/时间字段被列为已更改 (:ticket:`27302`)。

source: Django 1.10.3 release notes
id: Catatan terbitan Django 1.10.3
zh_hans: Django 1.10.3 版本发行说明

source: *November 1, 2016*
id: *1 November 2016*
zh_hans: *2016 年 11 月 1 日*

source: Django 1.10.3 fixes two security issues and several bugs in 1.10.2.
id: Django 1.10.3 memperbaiki dua masalah keamanan dan beberapa kesalahan di 1.10.2.
zh_hans: Django 1.10.3 修复了 1.10.2 中的两个安全问题和几个漏洞。

source: User with hardcoded password created when running tests on Oracle
id: Pengguna dengan sandi kode keras dibuat ketika menjalankan percobaan pada Oracle
zh_hans: 在 Oracle 上运行测试时创建了带有硬编码密码的用户

source: When running tests with an Oracle database, Django creates a temporary database user. In older versions, if a password isn't manually specified in the database settings ``TEST`` dictionary, a hardcoded password is used. This could allow an attacker with network access to the database server to connect.
id: Ketika menjalankan percobaan dengan basisdata Oracle, Django membuat basisdata sementara pengguna. Di versi terlama, jika sandi tidak secara manual ditentukan di pengaturan basisdata kamus ``TEST``, sebuah kode keras sandi digunakan. Inidapat mengizinkan penyerang dengan akses jaringan ke peladen basisdata untuk terhubung.
zh_hans: 在使用 Oracle 数据库运行测试时，Django 会创建一个临时数据库用户。在旧版本中，如果在数据库设置的 ``TEST`` 字典中没有手动指定密码，那么会使用硬编码的密码。这可能允许具有对数据库服务器的网络访问权限的攻击者连接到数据库。

source: This user is usually dropped after the test suite completes, but not when using the ``manage.py test --keepdb`` option or if the user has an active session (such as an attacker's connection).
id: Pengguna ini biasanya dibuang setelah rangkaian percobaan selesai, tetapi tidak ketika menggunakan pilihan ``manage.py test --keepdb`` atau jika pengguna mempunyai sesi aktif (seperti seorang hubungan penyerang).
zh_hans: 通常情况下，在测试套件完成后会删除此用户，但如果使用 ``manage.py test --keepdb`` 选项，或者用户有一个活动会话（例如攻击者的连接），则不会删除此用户。

source: A randomly generated password is now used for each test run.
id: Secara acak sandi dibangkitkan sekarang digunakan untuk setiap pejalan percobaan.
zh_hans: 现在每次测试运行都使用随机生成的密码。

source: DNS rebinding vulnerability when ``DEBUG=True``
id: Kerentanan pengikatan kembali DNS ketika ``DEBUG=True``
zh_hans: 当 ``DEBUG=True`` 时，存在 DNS 重新绑定漏洞

source: Older versions of Django don't validate the ``Host`` header against ``settings.ALLOWED_HOSTS`` when ``settings.DEBUG=True``. This makes them vulnerable to a `DNS rebinding attack <https://benmmurphy.github.io/blog/2016/07/11/rails-webconsole-dns-rebinding/>`_.
zh_hans: 在旧版本的 Django 中，当 ``settings.DEBUG=True`` 时，不会验证 ``Host`` 标头与 ``settings.ALLOWED_HOSTS`` 是否匹配。这使得它们容易受到 `DNS 重新绑定攻击 <https://benmmurphy.github.io/blog/2016/07/11/rails-webconsole-dns-rebinding/>`_ 的威胁。

source: While Django doesn't ship a module that allows remote code execution, this is at least a cross-site scripting vector, which could be quite serious if developers load a copy of the production database in development or connect to some production services for which there's no development instance, for example. If a project uses a package like the ``django-debug-toolbar``, then the attacker could execute arbitrary SQL, which could be especially bad if the developers connect to the database with a superuser account.
id: Selagi Django tidak dibekali modul yang mengizinkan pengerjaan kode secara terpencil, ini setidaknya vektor cross-site scripting, yang dapat sangat serius jika pengembang memuat salinan dari basisdata produksi di pengembangan atau terhubung ke beberapa layanan produksi untuk dimana tidak ada instance pengembangan, sebagai contoh. Jika sebuah proyek menggunakan sebuah paket seperti ``django-debug-toolbar``, kemudian penyerang dapa menjalankan SQL yang berubah-ubah, yang dapat khususnya buruk jika pengembang terhubung ke basisdata dengan akun superuser.
zh_hans: 虽然 Django 没有提供远程代码执行的模块，但这至少是一个跨站点脚本（XSS）的漏洞，如果开发人员在开发环境中加载了生产数据库的副本或连接到一些没有开发实例的生产服务，这可能会非常严重。如果项目使用类似 ``django-debug-toolbar`` 这样的包，攻击者可以执行任意的 SQL 查询，如果开发人员使用超级用户账户连接到数据库，那么情况可能会特别糟糕。

source: ``settings.ALLOWED_HOSTS`` is now validated regardless of ``DEBUG``. For convenience, if ``ALLOWED_HOSTS`` is empty and ``DEBUG=True``, the following variations of localhost are allowed ``['localhost', '127.0.0.1', '::1']``. If your local settings file has your production ``ALLOWED_HOSTS`` value, you must now omit it to get those fallback values.
id: ``settings.ALLOWED_HOSTS`` sekarang disahkan meskipun ``DEBUG``. Untuk kemnyamanan, jika ``ALLOWED_HOSTS`` adalah kosong dan ``DEBUG=True``, perbedaan berikut dari localhost diizinkan ``['localhost', '127.0.0.1', '::1']``. Jika berkas pengaturan lokal anda mempunyai produksi anda nilai ``ALLOWED_HOSTS``, anda harus sekarang menghilangkan itu untuk mendapatkan nilai fallback tersebut.
zh_hans: 现在无论 ``DEBUG`` 的值如何，都会验证 ``settings.ALLOWED_HOSTS``。为了方便起见，如果 ``ALLOWED_HOSTS`` 为空且 ``DEBUG=True``，则允许以下本地主机的变化 ``['localhost', '127.0.0.1', '::1']``。如果您的本地设置文件中包含生产环境的 ``ALLOWED_HOSTS`` 值，现在必须将其省略以获得这些备用值。

source: Allowed ``User.is_authenticated`` and ``User.is_anonymous`` properties to be tested for ``set`` membership (:ticket:`27309`).
id: Diizinkan milik ``User.is_authenticated`` dan ``User.is_anonymous`` untuk dicobakan untuk ``set`` keanggotaan (:ticket:`27309`).
zh_hans: 允许对 ``User.is_authenticated`` 和 ``User.is_anonymous`` 属性进行 ``set`` 成员测试 (:ticket:`27309`)。

source: Fixed a performance regression when running ``migrate`` in projects with ``RenameModel`` operations (:ticket:`27279`).
id: Diperbaiki sebuah pemulihan penampilan ketika menjalankan ``migrate`` di proyek dengan tindakan ``RenameModel`` (:ticket:`27279`).
zh_hans: 修复了在具有 ``RenameModel`` 操作的项目中运行 ``migrate`` 时的性能回归问题 (:ticket:`27279`)。

source: Added ``model_name`` to the ``allow_migrate()`` calls in ``makemigrations`` (:ticket:`27200`).
id: Ditambahkan ``model_name`` pada panggilan ``allow_migrate()`` di ``makemigrations`` (:ticket:`27200`).
zh_hans: 在 ``makemigrations`` 中的 ``allow_migrate()`` 调用中添加了 ``model_name`` 参数 (:ticket:`27200`)。

source: Made the ``JavaScriptCatalog`` view respect the ``packages`` argument; previously it was ignored (:ticket:`27374`).
id: Membuat tampilan ``JavaScriptCatalog`` mematuhi argumen ``packages``; sebelumnya dia diabaikan (:ticket:`27374`).
zh_hans: 使 ``JavaScriptCatalog`` 视图尊重 ``packages`` 参数；之前它会被忽略 (:ticket:`27374`)。

source: Fixed ``QuerySet.bulk_create()`` on PostgreSQL when the number of objects is a multiple plus one of ``batch_size`` (:ticket:`27385`).
id: Diperbaiki ``QuerySet.bulk_create()`` pada PostgreSQL ketika sejumlah obyek adalah banyak ditambah satu dari ``batch_size`` (:ticket:`27385`).
zh_hans: 修复了在 PostgreSQL 上使用 ``QuerySet.bulk_create()`` 时，对象数量是 ``batch_size`` 的倍数加一时的问题 (:ticket:`27385`)。

source: Prevented ``i18n_patterns()`` from using too much of the URL as the language to fix a use case for ``prefix_default_language=False`` (:ticket:`27063`).
id: Dicegah ``i18n_patterns()`` dari menggunakan terlalu banyak dari URL sebagai bahasa untuk memperbaki kasus penggunaan untuk ``prefix_default_language=False`` (:ticket:`27063`).
zh_hans: 防止 ``i18n_patterns()`` 使用太多 URL 作为语言，以修复 ``prefix_default_language=False`` 的用例 (:ticket:`27063`)。

source: Replaced a possibly incorrect redirect from ``SessionMiddleware`` when a session is destroyed in a concurrent request with a ``SuspiciousOperation`` to indicate that the request can't be completed (:ticket:`27363`).
id: Diganti sebuah kemungkinan pengalihan tidak benar dari ``SessionMiddleware`` ketika sebuah sesi dihancurkan di permintaan yang berbarengan dengan sebuah ``SuspiciousOperation`` untuk mengarahkan bahwa permintaan tidak dapat dilengkapi (:ticket:`27363`).
zh_hans: 在并发请求中，将 ``SessionMiddleware`` 中可能不正确的重定向替换为 ``SuspiciousOperation``，以指示请求无法完成 (:ticket:`27363`)。

source: Django 1.10.4 release notes
id: Catatan terbitan Django 1.10.4
zh_hans: Django 1.10.4 版本发行说明

source: *December 1, 2016*
id: *1 Desmber, 2016*
zh_hans: *2016 年 12 月 1 日*

source: Django 1.10.4 fixes several bugs in 1.10.3.
id: Django 1.10.4 memperbaiki beberapa kesalahan di 1.10.3.
zh_hans: Django 1.10.4 修复了 1.10.3 中的几个漏洞。

source: Quoted the Oracle test user's password in queries to fix the "ORA-00922: missing or invalid option" error when the password starts with a number or special character (:ticket:`27420`).
id: Dikutip sandi pengguna percobaan Oracle dalam permintaan untuk memperbaiki kesalahan "ORA-00922: missing or invalid option" ketika sandi dimulai dengan sebuah angka atau karakter khusus (:ticket:`27420`).
zh_hans: 在查询中引用 Oracle 测试用户的密码，以修复密码以数字或特殊字符开头时出现 "ORA-00922: missing or invalid option" 错误的问题 (:ticket:`27420`)。

source: Fixed incorrect ``app_label`` / ``model_name`` arguments for ``allow_migrate()`` in ``makemigrations`` migration consistency checks (:ticket:`27461`).
id: Diperbaiki argumen ``app_label`` / ``model_name`` tidak benar untuk ``allow_migrate()`` di pemeriksaan kemantapan perpindahan ``makemigrations`` (:ticket:`27461`).
zh_hans: 修复了在 ``makemigrations`` 迁移一致性检查中的 ``allow_migrate()`` 中不正确的 ``app_label`` / ``model_name`` 参数 (:ticket:`27461`)。

source: Made ``Model.delete(keep_parents=True)`` preserve parent reverse relationships in multi-table inheritance (:ticket:`27407`).
id: Dibuat ``Model.delete(keep_parents=True)`` menjaga hubungan membalikkan induk di warisan tabel-banyak (:ticket:`27407`).
zh_hans: 在多表继承中，通过 ``Model.delete(keep_parents=True)`` 保留父级反向关系 (:ticket:`27407`)。

source: Fixed a ``QuerySet.update()`` crash on SQLite when updating a ``DateTimeField`` with an ``F()`` expression and a ``timedelta`` (:ticket:`27544`).
id: Diperbaiki sebuah kegagalan ``QuerySet.update()`` padaSQLite ketika memperbaharui sebuah ``DateTimeField`` dengan sebuah pernyataan ``F()`` dan ``timedelta`` (:ticket:`27544`).
zh_hans: 修复了在 SQLite 上使用 ``QuerySet.update()`` 时，更新带有 ``F()`` 表达式和 ``timedelta`` 的 ``DateTimeField`` 时发生的崩溃 (:ticket:`27544`)。

source: Prevented ``LocaleMiddleware`` from redirecting on URLs that should return 404 when using ``prefix_default_language=False`` (:ticket:`27402`).
id: Dicegah ``LocaleMiddleware`` dari menjadi pengalihan pada URL yang harus mengembalikan 404 ketika menggunakan ``prefix_default_language=False`` (:ticket:`27402`).
zh_hans: 在使用 ``prefix_default_language=False`` 时，防止 ``LocaleMiddleware`` 在应该返回 404 的 URL 上进行重定向 (:ticket:`27402`)。

source: Prevented an unnecessary index from being created on an InnoDB ``ForeignKey`` when the field was added after the model was created (:ticket:`27558`).
id: Dicegah indeks tidak perlu dari sedang dibuat pada sebuah ``ForeignKey`` InnoDB ketika bidang telah ditambahkan setelah model dibuat (:ticket:`27558`).
zh_hans: 在模型创建后添加字段时，防止在 InnoDB ``ForeignKey`` 上创建不必要的索引 (:ticket:`27558`)。

source: Django 1.10.5 release notes
id: Catatan terbitan Django 1.10.5
zh_hans: Django 1.10.5 版本发行说明

source: *January 4, 2017*
id: *4 Januari 2017*
zh_hans: *2017 年 1 月 4 日*

source: Django 1.10.5 fixes several bugs in 1.10.4.
id: Django 1.10.5 memperbaiki beberapa kesalahan di 1.10.4.
zh_hans: Django 1.10.5 修复了 1.10.4 中的几个漏洞。

source: Fixed a crash in the debug view if ``request.user`` can't be retrieved, such as if the database is unavailable (:ticket:`27567`).
id: Diperbaiki sebuah kegagalan di tampilan mencari kesalahan jika ``request.user`` tidak dapat ditarik, seperti jika basisdata tidak tersedia (:ticket:`27567`).
zh_hans: 修复了在调试视图中出现的崩溃，如果无法检索 ``request.user``，例如如果数据库不可用 (:ticket:`27567`)。

source: Fixed occasional missing plural forms in ``JavaScriptCatalog`` (:ticket:`27418`).
id: Diperbaiki terkadang kehilangan formulir jamak di ``JavaScriptCatalog`` (:ticket:`27418`).
zh_hans: 修复了偶尔在 ``JavaScriptCatalog`` 中丢失的复数形式 (:ticket:`27418`)。

source: Fixed a regression in the ``timesince`` and ``timeuntil`` filters that caused incorrect results for dates in a leap year (:ticket:`27637`).
id: Diperbaiki sebuah pemulihan di penyaring ``timesince`` dan ``timeuntil`` yang menyebabkan hasil untuk tanggal di tahun kabisat (:ticket:`27637`).
zh_hans: 修复了 ``timesince`` 和 ``timeuntil`` 过滤器中的回归问题，导致闰年日期的结果不正确 (:ticket:`27637`)。

source: Fixed a regression where ``collectstatic`` overwrote newer files in remote storages (:ticket:`27658`).
id: Diperbaiki sebuah pemulihan dimana ``collectstatic`` menimpa berkas terbaru di penyimpanan terpencil (:ticket:`27658`).
zh_hans: 修复了 ``collectstatic`` 在远程存储中覆盖更新文件的回归问题 (:ticket:`27658`)。

source: Django 1.10.6 release notes
id: Catatan terbitan Django 1.10.6
zh_hans: Django 1.10.6 版本发行说明

source: *March 1, 2017*
id: *1 Maret 2017*
zh_hans: *2017 年 3 月 1 日*

source: Django 1.10.6 fixes several bugs in 1.10.5.
id: Django 1.10.6 memperbaiki beberapa kesalahan di 1.10.5.
zh_hans: Django 1.10.6 修复了 1.10.5 中的几个漏洞。

source: Fixed ``ClearableFileInput``’s "Clear" checkbox on model form fields where the model field has a ``default`` (:ticket:`27805`).
zh_hans: 修复了在模型字段具有 ``default`` 的情况下，模型表单字段上的 ``ClearableFileInput`` 的 "Clear" 复选框 (:ticket:`27805`)。

source: Fixed ``RequestDataTooBig`` and ``TooManyFieldsSent`` exceptions crashing rather than generating a bad request response (:ticket:`27820`).
id: Diperbaiki pengecualian kegagalan ``RequestDataTooBig`` dan ``TooManyFieldsSent`` daripada membangkitan tanggapan permintaan buruk (:ticket:`27820`).
zh_hans: 修复了 ``RequestDataTooBig`` 和 ``TooManyFieldsSent`` 异常崩溃而不是生成坏请求响应的问题 (:ticket:`27820`)。

source: Fixed a crash on Oracle and PostgreSQL when subtracting ``DurationField`` or ``IntegerField`` from ``DateField`` (:ticket:`27828`).
id: Diperbaiki sebuah kegagalan pada Oracle dan PostgreSQL ketika mengurangkan ``DurationField`` atau ``IntegerField`` dari ``DateField`` (:ticket:`27828`).
zh_hans: 修复了在 Oracle 和 PostgreSQL 上从 ``DateField`` 中减去 ``DurationField`` 或 ``IntegerField`` 时发生的崩溃问题 (:ticket:`27828`)。

source: Fixed query expression date subtraction accuracy on PostgreSQL for differences larger than a month (:ticket:`27856`).
id: Diperbaiki keakuratan pengurangan tanggal pernyataan permintaan pada PostgreSQL untuk perbedaan besar dari sebuah bulan (:ticket:`27856`).
zh_hans: 修复了在 PostgreSQL 上查询表达式日期相减的精度问题，适用于大于一个月的差异 (:ticket:`27856`)。

source: Fixed a ``GDALException`` raised by ``GDALClose`` on GDAL ≥ 2.0 (:ticket:`27479`).
zh_hans: 修复了在 GDAL ≥ 2.0 上由 ``GDALClose`` 引发的 ``GDALException`` (:ticket:`27479`)。

source: Django 1.10.7 release notes
id: Catatan terbitan Django 1.10.7
zh_hans: Django 1.10.7 版本发行说明

source: *April 4, 2017*
id: *4 April 2017*
zh_hans: *2017 年 4 月 4 日*

source: Django 1.10.7 fixes two security issues and a bug in 1.10.6.
id: Django 1.10.7 memperbaiki dua masalah keamanan dan beberapa kesalahan di 1.10.6.
zh_hans: Django 1.10.7 修复了 1.10.6 中的两个安全问题和一个错误。

source: CVE-2017-7233: Open redirect and possible XSS attack via user-supplied numeric redirect URLs
id: CVE-2017-7233: Pengalihan terbuka dan kemungkinan serangan XSS melalui URL pengalihan numerik diberikan-pengguna
zh_hans: CVE-2017-7233 ：通过用户提供的数字重定向 URL 进行开放式重定向和可能的 XSS 攻击

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()`` and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security check for these redirects (namely ``django.utils.http.is_safe_url()``) considered some numeric URLs (e.g. ``http:999999999``) "safe" when they shouldn't be.
zh_hans: Django 在某些情况下依赖用户输入（例如 ``django.contrib.auth.views.login()`` 和 :doc:`i18n </topics/i18n/index>`) 来将用户重定向到“成功”URL。这些重定向的安全检查（即 ``django.utils.http.is_safe_url()``）认为一些数值 URL（例如 ``http:999999999``）是“安全”的，但实际上它们不应该是安全的。

source: Also, if a developer relies on ``is_safe_url()`` to provide safe redirect targets and puts such a URL into a link, they could suffer from an XSS attack.
id: Juga, jika seorang pengembang bergantung pada ``is_safe_url()`` untuk menyediakan sasaran pengalihan dan menaruh URL seperti itu kedalam sebuah tautan, mereka dapat menderita dari serangan XSS.
zh_hans: 此外，如果开发人员依赖于 ``is_safe_url()`` 来提供安全的重定向目标，并将这样的 URL 放入链接中，他们可能会受到 XSS 攻击的影响。

source: CVE-2017-7234: Open redirect vulnerability in ``django.views.static.serve()``
id: CVE-2017-7234: Kerentanan pengalihan terbuka dalam ``django.views.static.serve()``
zh_hans: CVE-2017-7234: ``django.views.static.serve()`` 中的开放重定向漏洞
