Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed schema check for ManyToManyField to look for internal type instead of checking class instance, so you can write custom m2m-like fields with the same behavior. (:ticket:`24104`).
id: Diperbaiki skema pemeriksaan untuk ManyToManyField untuk mencari untuk jenis internal daripada memeriksa instance kelas, jadi anda dapat menulis penyesuaian bidang seperti-m2m dengan perilaku lama. (:ticket:`24104`).
zh_hans: 修复了对 ManyToManyField 的模式检查，以查找内部类型而不是检查类实例，因此您可以编写具有相同行为的自定义 ManyToManyField 类似字段。（:ticket:`24104`)。

source: Django 1.7.5 release notes
id: Catatan terbitan Django 1.7.5
zh_hans: Django 1.7.5 版本发行说明

source: *February 25, 2015*
id: *Februari 25, 2015*
zh_hans: *2015 年 2 月 25 日*

source: Django 1.7.5 fixes several bugs in 1.7.4.
id: Django 1.7.5 memperbaiki beberapa kesalahan di 1.7.4.
zh_hans: Django 1.7.5 修复了 1.7.4 版本中的一些错误。

source: Reverted a fix that prevented a migration crash when unapplying ``contrib.contenttypes``’s or ``contrib.auth``’s first migration (:ticket:`24075`) due to severe impact on the test performance (:ticket:`24251`) and problems in multi-database setups (:ticket:`24298`).
zh_hans: 由于对测试性能的严重影响（:ticket:`24251`）和在多数据库设置中出现的问题（:ticket:`24298`），回退了一个修复，该修复防止在取消应用 ``contrib.contenttypes`` 或 ``contrib.auth`` 的第一个迁移时出现迁移崩溃问题（:ticket:`24075`)。

source: Fixed a regression that prevented custom fields inheriting from ``ManyToManyField`` from being recognized in migrations (:ticket:`24236`).
id: Diperbaiki sebuah pemulihan yang mencegah penyesuaian bidang mewarisi dari ``ManyToManyField`` dari menjadi diakui di perpindahan (:ticket:`24236`).
zh_hans: 修复了阻止自定义字段继承自 ``ManyToManyField`` 在迁移中被识别的回退问题（:ticket:`24236`)。

source: Fixed crash in ``contrib.sites`` migrations when a default database isn't used (:ticket:`24332`).
id: Diperbaiki kegagalan di perpindahan ``contrib.sites`` ketika basisdata awalan tidak digunakan (:ticket:`24332`).
zh_hans: 修复了在未使用默认数据库时，``contrib.sites`` 迁移中的崩溃问题（:ticket:`24332`)。

source: Added the ability to set the isolation level on PostgreSQL with psycopg2 ≥ 2.4.2 (:ticket:`24318`). It was advertised as a new feature in Django 1.6 but it didn't work in practice.
zh_hans: 添加了在使用 psycopg2 ≥ 2.4.2 时在 PostgreSQL 上设置隔离级别的功能（:ticket:`24318`）。这在 Django 1.6 中被宣传为一个新功能，但在实际使用中没有起作用。

source: Formats for the Azerbaijani locale (``az``) have been added.
id: Bentuk untuk lokal Azerbaijan (``az``) telah ditambahkan.
zh_hans: 已添加阿塞拜疆语（``az``）区域的格式。

source: Django 1.7.6 release notes
id: Catatan terbitan Django 1.7.6
zh_hans: Django 1.7.6 版本发行说明

source: *March 9, 2015*
id: *9 Maret 2015*
zh_hans: *2015 年 3 月 9 日*

source: Django 1.7.6 fixes a security issue and several bugs in 1.7.5.
id: Django 1.7.6 memperbaiki beberapa kesalahan dan masalah keamanan di 1.7.5.
zh_hans: Django 1.7.6 修复了 1.7.5 版本中的一个安全问题和一些错误。

source: Mitigated an XSS attack via properties in ``ModelAdmin.readonly_fields``
id: Mengurangi sebuah serangan XSS melalui sifat di ``ModelAdmin.readonly_fields``
zh_hans: 通过 ``ModelAdmin.readonly_fields`` 中的属性缓解了XSS攻击

source: The :attr:`ModelAdmin.readonly_fields <django.contrib.admin.ModelAdmin.readonly_fields>` attribute in the Django admin allows displaying model fields and model attributes. While the former were correctly escaped, the latter were not. Thus untrusted content could be injected into the admin, presenting an exploitation vector for XSS attacks.
id: Atribut :attr:`ModelAdmin.readonly_fields <django.contrib.admin.ModelAdmin.readonly_fields>` di admin Django mengizinkan menampilkan bidang model dan atribut model. Selagi pendahulunya telah degan benar diloloskan, yang terakhir tidak. Dengan demikian isi yang tidak dapat dipercaya dapat disuntikkan kedalam admin, menghadirkan sebuah vektor eksploitasi untuk serangan XSS.
zh_hans: Django admin 中的 :attr:`ModelAdmin.readonly_fields <django.contrib.admin.ModelAdmin.readonly_fields>` 属性允许显示模型字段和模型属性。虽然前者已经正确转义，但后者没有。因此，不受信任的内容可能会被注入到管理界面，从而构成了 XSS 攻击的利用向量。

source: In this vulnerability, every model attribute used in ``readonly_fields`` that is not an actual model field (e.g. a :class:`property`) will **fail to be escaped** even if that attribute is not marked as safe. In this release, autoescaping is now correctly applied.
id: Dalam kerentanan ini, setiap atribut model digunakan di ``readonly_fields`` yang bukan bidang model yang sebenarnya (sebagai contoh sebuah :class:`property`) akan **gagal diloloskan** bahkan jika atribut itu tidak ditandai sebagai aman. Di terbitan ini, pelolosan otomatis sekarang dengan benar diberlakukan.
zh_hans: 在这个漏洞中，``readonly_fields`` 中使用的每个模型属性，如果不是实际的模型字段（例如一个 :class:`property`），即使该属性未标记为安全，也会 **未经转义而失败**。在这个版本中，现在正确地应用了自动转义。

source: Fixed crash when coercing ``ManyRelatedManager`` to a string (:ticket:`24352`).
id: Diperbaiki kegagalan ketika memaksa ``ManyRelatedManager`` menjadi string (:ticket:`24352`).
zh_hans: 修复了将 ``ManyRelatedManager`` 强制转换为字符串时的崩溃问题（:ticket:`24352`）。

source: Fixed a bug that prevented migrations from adding a foreign key constraint when converting an existing field to a foreign key (:ticket:`24447`).
id: Diperbaiki sebuah kesalahan yang mencegah perpindahan dari menambahkan batasan primary key ketika merubah bidang yang ada pada sebuah foreign key (:ticket:`24447`).
zh_hans: 修复了一个 bug，当将现有字段转换为外键时，阻止迁移添加外键约束的问题（:ticket:`24447`）。

source: Django 1.7.7 release notes
id: Catatan terbitan Django 1.7.7
zh_hans: Django 1.7.7 版本发行说明

source: Django 1.7.7 fixes several bugs and security issues in 1.7.6.
id: Django 1.7.7 memperbaiki beberapa kesalahan dan masalah keamanan di 1.7.6.
zh_hans: Django 1.7.7 修复了 1.7.6 版本中的一些错误和安全问题。

source: Fixed renaming of classes in migrations where renaming a subclass would cause incorrect state to be recorded for objects that referenced the superclass (:ticket:`24354`).
id: Diperbaiki manamai kembali dari kelas-kelas di perpindahan ketika menamai kembali sebuah subkelas akan menyebabkan keadaan tidak benar untuk direkam untuk obyek yang mengacu superkelas (:ticket:`24354`).
zh_hans: 修复了在迁移中重命名类的问题，其中重命名子类会导致引用超类的对象记录错误状态（:ticket:`24354`）。

source: Stopped writing migration files in dry run mode when merging migration conflicts. When ``makemigrations --merge`` is called with ``verbosity=3`` the migration file is written to ``stdout`` (:ticket:`24427`).
id: DIhentikan menulis berkas-berkas perpindahan dalam suasana percobaan ketika menggabungkan pertentangan perpindahan. Ketika ``makemigrations --merge`` dipanggil dengan ``verbosity=3`` berkas perpindahan ditulis menjadi ``stdout`` (:ticket:`24427`).
zh_hans: 在合并迁移冲突时，在干运行模式下停止写入迁移文件。当使用 ``makemigrations --merge`` 并指定 ``verbosity=3`` 时，迁移文件将写入到 ``stdout`` （:ticket:`24427`）。

source: Django 1.7.8 release notes
id: Catatan terbitan Django 1.7.8
zh_hans: Django 1.7.8 版本发行说明

source: *May 1, 2015*
id: *1 Mei 2015*
zh_hans: *2015 年 5 月 1 日*

source: Django 1.7.8 fixes:
id: Catatan terbitan Django 1.7.8
zh_hans: Django 1.7.8 修复了以下问题：

source: Database introspection with SQLite 3.8.9 (released April 8, 2015) (:ticket:`24637`).
id: Introspeksi basisdata dengan SQLite 3.8.9 (diterbitkan April 8, 2015) (:ticket:`24637`).
zh_hans: 使用 SQLite 3.8.9（发布于 2015 年 4 月 8 日）进行数据库内省（:ticket:`24637`）。

source: A database table name quoting regression in 1.7.2 (:ticket:`24605`).
id: Sebuah nama tabel basisdata mengutip pemulihan di 1.7.2 (:ticket:`24605`).
zh_hans: 1.7.2 中的数据库表名引用回退问题（:ticket:`24605`）。

source: The loss of ``null``/``not null`` column properties during field alteration of MySQL databases (:ticket:`24595`).
id: Kehilangan dari sifat kolom ``null``/``not null`` selama perubahan bidang dari basisdata MySQL (:ticket:`24595`).
zh_hans: 在 MySQL 数据库字段修改过程中丢失了 ``null``/``not null`` 列属性（:ticket:`24595`）。

source: Django 1.7.9 release notes
id: Catatan terbitan Django 1.7.9
zh_hans: Django 1.7.9 版本发行说明

source: Django 1.7.9 fixes several security issues and bugs in 1.7.8.
id: Django 1.7.9 memperbaiki beberapa masalah keamanan di 1.7.8.
zh_hans: Django 1.7.9 修复了 1.7.8 版本中的多个安全问题和错误。

source: :func:`~django.core.validators.validate_ipv4_address`, :func:`~django.core.validators.validate_slug`, and :class:`~django.core.validators.URLValidator` are also affected, however, as of Django 1.6 the ``GenericIPAddresseField``, ``IPAddressField``, ``SlugField``, and ``URLField`` form fields which use these validators all strip the input, so the possibility of newlines entering your data only exists if you are using these validators outside of the form fields.
id: :func:`~django.core.validators.validate_ipv4_address`, :func:`~django.core.validators.validate_slug`, dan :class:`~django.core.validators.URLValidator` juga terpengaruh, bagaimanapun, pada Django 1.6 bidang formulir ``GenericIPAddresseField``, ``IPAddressField``, ``SlugField``, dan ``URLField`` yang menggunakan pengesah ini semua memilah masukan, jadi kemungkinan dari baris baru memasukkan data anda hanya ada jika anda sedang menggunakan pengesah ini diluat dari bidang formulir.
zh_hans: :func:`~django.core.validators.validate_ipv4_address`、:func:`~django.core.validators.validate_slug` 和 :class:`~django.core.validators.URLValidator` 也受到影响，但从 Django 1.6 开始，使用这些验证器的 ``GenericIPAddresseField``、``IPAddressField``、``SlugField`` 和 ``URLField`` 表单字段都会剥离输入，因此只有在在表单字段之外使用这些验证器时才存在新行进入数据的可能性。

source: Prevented the loss of ``null``/``not null`` column properties during field renaming of MySQL databases (:ticket:`24817`).
id: Dicegah kehilangan sifat kolom ``null``/``not null`` selama penamaan bidang dari basisdata MySQL (:ticket:`24817`).
zh_hans: 在重命名 MySQL 数据库字段时防止了丢失 ``null``/``not null`` 列属性（:ticket:`24817`）。

source: Fixed ``SimpleTestCase.assertRaisesMessage()`` on Python 2.7.10 (:ticket:`24903`).
id: Diperbaiki ``SimpleTestCase.assertRaisesMessage()`` pada Python 2.7.10 (:ticket:`24903`).
zh_hans: 修复了在 Python 2.7.10 上的 ``SimpleTestCase.assertRaisesMessage()`` （:ticket:`24903`）。

source: Django 1.8 release notes
id: Catatan terbitan Django 1.8
zh_hans: Django 1.8 版本发行说明

source: *April 1, 2015*
zh_hans: *2015 年 4 月 1 日*

source: Welcome to Django 1.8!
id: Selamat datang di Django 1.8!
zh_hans: 欢迎使用 Django 1.8 ！

source: These release notes cover the :ref:`new features <whats-new-1.8>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.8>` you'll want to be aware of when upgrading from Django 1.7 or older versions. We've also :ref:`begun the deprecation process for some features <deprecated-features-1.8>`, and some features have reached the end of their deprecation process and :ref:`have been removed <removed-features-1.8>`.
id: Catatan terbitan ini mencangkup :ref:`new features <whats-new-1.8>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.8>` anda akan ingin waspadai ketika meningkatkan dari Django 1.7 atau versi terlama. Kami juga telah :ref:`begun the deprecation process for some features <deprecated-features-1.8>`, dan beberapa telah dicapai pada akhir pengolahan pengusangan mereka dan :ref:`have been removed <removed-features-1.8>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.8>`，以及从 Django 1.7 或更早版本升级时需要注意的一些 :ref:`不向后兼容的变更 <backwards-incompatible-1.8>`。我们还已经 :ref:`开始了一些功能的弃用过程 <deprecated-features-1.8>`，并且一些功能已经完成了弃用过程并被 :ref:`移除了 <removed-features-1.8>`。

source: Django 1.8 has been designated as Django's second :term:`long-term support release <Long-term support release>`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 1.4, will end 6 months from the release date of Django 1.8.
zh_hans: Django 1.8 已被指定为 Django 的第二个 :term:`长期支持版本 <Long-term support release>`。它将在发布后至少三年内接收安全更新。对于之前的 LTS 版本，Django 1.4，支持将在 Django 1.8 发布日期后的 6 个月内结束。

source: Django 1.8 requires Python 2.7, 3.2, 3.3, 3.4, or 3.5. We **highly recommend** and only officially support the latest release of each series.
id: Django 1.8 membutuhkan Python 2.7, 3.2, 3.3, 3.4 atau 3.5. Kami **sangat menganjurkan** dan hanya secara resmi mendukung terbitan terakhir dari setiap rangkaian.
zh_hans: Django 1.8 需要 Python 2.7、3.2、3.3、3.4 或 3.5。我们 **强烈推荐** 并且只官方支持每个系列的最新版本。

source: Django 1.8 is the first release to support Python 3.5.
id: Django 1.8 adalah terbitan pertama untuk mendukung Python 3.5.
zh_hans: Django 1.8 是第一个支持 Python 3.5 的版本。

source: Due to the end of upstream support for Python 3.2 in February 2016, we won't test Django 1.8.x on Python 3.2 after the end of 2016.
id: Karena akhir dari dukungan hulu untuk Python 3,2 di Februari 2016, kami tidak akan mencoba Django 1.8.x di Python 3.2 setelah akhir dari 2016.
zh_hans: 由于 Python 3.2 在 2016 年 2 月结束了上游支持，因此在 2016 年底之后我们将不再在 Python 3.2 上测试 Django 1.8.x 。

source: What's new in Django 1.8
id: Apa yang baru di Django 1.8
zh_hans: Django 1.8 的新特性

source: Django now has a formalized API for :doc:`Model._meta </ref/models/meta>`, providing an officially supported way to :ref:`retrieve fields <model-meta-field-api>` and filter fields based on their :ref:`attributes <model-field-attributes>`.
id: Django sekarang telah memerumuskan API untuk :doc:`Model._meta </ref/models/meta>`, menyediakan sebuah cara dukungan resmi pada :ref:`retrieve fields <model-meta-field-api>` dan bidang penyaring berdasarkan pada :ref:`attributes <model-field-attributes>` mereka.
zh_hans: Django 现在有了一个正式的 API 用于 :doc:`Model._meta </ref/models/meta>`，提供了一种官方支持的方式来 :ref:`检索字段 <model-meta-field-api>` 并根据它们的 :ref:`属性 <model-field-attributes>` 进行过滤。

source: The ``Model._meta`` object has been part of Django since the days of pre-0.96 "Magic Removal" -- it just wasn't an official, stable API. In recognition of this, we've endeavored to maintain backwards-compatibility with the old API endpoint where possible. However, API endpoints that aren't part of the new official API have been deprecated and will eventually be removed.
zh_hans: ``Model._meta`` 对象从 Django 的 0.96 版本前的 "Magic Removal" 时期就存在了，只是它不是一个官方的、稳定的 API。鉴于这一点，我们努力在可能的情况下保持与旧 API 端点的向后兼容性。然而，那些不属于新官方 API 的 API 端点已经被弃用，并最终将被移除。

source: Multiple template engines
id: Banyak cetakan mesin
zh_hans: 多模板引擎

source: Django 1.8 defines a stable API for integrating template backends. It includes built-in support for the Django template language and for :class:`~django.template.backends.jinja2.Jinja2`. It supports rendering templates with multiple engines within the same project. Learn more about the new features in the :doc:`topic guide </topics/templates>` and check the upgrade instructions in older versions of the documentation.
id: Django 1.8 menentukan API stabil untuk menyatukan backend cetakan. Itu menyertakan dukungan siap-pakai untuk bahasa cetakan Django dan untuk :class:`~django.template.backends.jinja2.Jinja2`. Itu mendukung membangun cetakan dengan banyak mesin dalam proyek sama. Pelajari lebih tentang fitur baru di :doc:`topic guide </topics/templates>` dan tingkatkan petunjuk-petunjuk dalam versi terlama dari dokumentasi.
zh_hans: Django 1.8 定义了一个稳定的 API 用于集成模板后端。它内置支持 Django 模板语言和 :class:`~django.template.backends.jinja2.Jinja2`。它支持在同一个项目中使用多个引擎来渲染模板。了解更多关于新功能的信息，请参阅 :doc:`主题指南 </topics/templates>`，并查看早期版本文档中的升级说明。

source: Security enhancements
id: Peningkatan keamanan
zh_hans: 安全增强

source: Several features of the :pypi:`django-secure` third-party library have been integrated into Django. :class:`django.middleware.security.SecurityMiddleware` provides several security enhancements to the request/response cycle. The new :option:`check --deploy` option allows you to check your production settings file for ways to increase the security of your site.
zh_hans: :pypi:`django-secure` 第三方库的几个功能已经集成到 Django 中。:class:`django.middleware.security.SecurityMiddleware` 提供了一些安全增强功能，用于请求/响应循环。新的 :option:`check --deploy` 选项允许你检查生产设置文件，以提高站点的安全性。

source: New PostgreSQL specific functionality
id: Kegunaan khusus PostgreSQL baru
zh_hans: 新的 PostgreSQL 特有功能

source: Django now has a module with extensions for PostgreSQL specific features, such as :class:`~django.contrib.postgres.fields.ArrayField`, :class:`~django.contrib.postgres.fields.HStoreField`, :ref:`range-fields`, and :lookup:`unaccent` lookup. A full breakdown of the features is available :doc:`in the documentation </ref/contrib/postgres/index>`.
id: Django sekarang mempunyai sebuah modul dengan perpanjangan untuk fitur-fitur khusus PostgreSQL , seperti pencarian :class:`~django.contrib.postgres.fields.ArrayField`, :class:`~django.contrib.postgres.fields.HStoreField`, :ref:`range-fields`, dan :lookup:`unaccent`. Sebuah uraian penuh dari fitur tersedia :doc:`in the documentation </ref/contrib/postgres/index>`.
zh_hans: Django 现在有一个模块，用于扩展 PostgreSQL 特定的功能，例如 :class:`~django.contrib.postgres.fields.ArrayField`、:class:`~django.contrib.postgres.fields.HStoreField`、:ref:`range-fields` 和 :lookup:`unaccent` 查找。可以在 :doc:`文档 </ref/contrib/postgres/index>` 中找到有关这些功能的详细信息。

source: New data types
id: Jenis data baru
zh_hans: 新的数据类型

source: Django now has a :class:`~django.db.models.UUIDField` for storing universally unique identifiers. It is stored as the native ``uuid`` data type on PostgreSQL and as a fixed length character field on other backends. There is a corresponding :class:`form field <django.forms.UUIDField>`.
id: Django sekarang mempunyai :class:`~django.db.models.UUIDField` untuk menyimpan penciri unik universal. Itu disimpan sebagai jenis dara ``uuid`` asli di PostgreSQL dan sebagaibidang karakter panjang tetap di backend lain. Ada sebuah :class:`form field <django.forms.UUIDField>` yang sesuai.
zh_hans: Django 现在有一个 :class:`~django.db.models.UUIDField` 用于存储通用唯一标识符。它在 PostgreSQL 上以本地的 ``uuid`` 数据类型存储，在其他后端上以固定长度的字符字段存储。还有一个相应的 :class:`表单字段 <django.forms.UUIDField>`。

source: Django now has a :class:`~django.db.models.DurationField` for storing periods of time - modeled in Python by :class:`~python:datetime.timedelta`. It is stored in the native ``interval`` data type on PostgreSQL, as a ``INTERVAL DAY(9) TO SECOND(6)`` on Oracle, and as a ``bigint`` of microseconds on other backends. Date and time related arithmetic has also been improved on all backends. There is a corresponding :class:`form field <django.forms.DurationField>`.
id: Django sekarang mempunyai sebuah :class:`~django.db.models.DurationField` untuk menyimpan periode waktu - model di Python oleh :class:`~python:datetime.timedelta`. Itu disimpan dalam jenis data ``interval`` asli di PostgreSQL, sebagai sebuah ``INTERVAL DAY(9) TO SECOND(6)`` di Oracle, dan sebagai ``bigint`` dari mikrodetik di backend lain. Tanggal dan waktu terkait aritmatik juga telah ditingkatkan pada semua backend. Ada sebuah :class:`form field <django.forms.DurationField>` yang berhubungan.
zh_hans: Django 现在有一个 :class:`~django.db.models.DurationField` 用于存储时间段，Python 中用 :class:`~python:datetime.timedelta` 来建模。它在 PostgreSQL 上以本地的 ``interval`` 数据类型存储，在 Oracle 上以 ``INTERVAL DAY(9) TO SECOND(6)`` 存储，在其他后端上以微秒的 ``bigint`` 存储。所有后端上的日期和时间相关算术操作也得到了改进。还有一个相应的 :class:`表单字段 <django.forms.DurationField>`。

source: Query Expressions, Conditional Expressions, and Database Functions
id: Query Expressions, Conditional Expressions, dan Database Function
zh_hans: 查询表达式、条件表达式和数据库函数

source: :doc:`Query Expressions </ref/models/expressions>` allow you to create, customize, and compose complex SQL expressions. This has enabled annotate to accept expressions other than aggregates. Aggregates are now able to reference multiple fields, as well as perform arithmetic, similar to ``F()`` objects. :meth:`~django.db.models.query.QuerySet.order_by` has also gained the ability to accept expressions.
id: :doc:`Query Expressions </ref/models/expressions>` mengizinkan anda membuat, menyesuaikan, dan menyusun pernyataan SQL rumit. Ini mempunyai keterangan diadakan untuk menerima pernyataan selaind ari pengumpulan. Pengumpulan sekarang dapat mengacu banyak bidang, sama halnya aritmatika, mirip pada obyek ``F()``. :meth:`~django.db.models.query.QuerySet.order_by` juga mendapatkan kemampuan menerima pernyataan.
zh_hans: :doc:`查询表达式 </ref/models/expressions>` 允许你创建、自定义和组合复杂的 SQL 表达式。这使得 annotate 能够接受除了聚合之外的表达式。聚合现在可以引用多个字段，并执行类似于 ``F()`` 对象的算术操作。:meth:`~django.db.models.query.QuerySet.order_by` 也具备接受表达式的能力。

source: :doc:`Conditional Expressions </ref/models/conditional-expressions>` allow you to use :keyword:`if` ... :keyword:`elif` ... :keyword:`else` logic within queries.
id: :doc:`Conditional Expressions </ref/models/conditional-expressions>` mengizinkan anda menggunakan logika :keyword:`if` ... :keyword:`elif` ... :keyword:`else` dalam permintaan.
zh_hans: :doc:`条件表达式 </ref/models/conditional-expressions>` 允许你在查询中使用 :keyword:`if` ... :keyword:`elif` ... :keyword:`else` 逻辑。

source: A collection of :doc:`database functions </ref/models/database-functions>` is also included with functionality such as :class:`~django.db.models.functions.Coalesce`, :class:`~django.db.models.functions.Concat`, and :class:`~django.db.models.functions.Substr`.
id: Sebuah kumpulan dari :doc:`database functions </ref/models/database-functions>` juga disertakan dengan kegunaan seperti :class:`~django.db.models.functions.Coalesce`, :class:`~django.db.models.functions.Concat`, dan :class:`~django.db.models.functions.Substr`.
zh_hans: 还包括了一组 :doc:`数据库函数 </ref/models/database-functions>`，其中包括 :class:`~django.db.models.functions.Coalesce`、:class:`~django.db.models.functions.Concat` 和 :class:`~django.db.models.functions.Substr` 等功能。

source: ``TestCase`` data setup
id: Pengaturan data ``TestCase``
zh_hans: ``TestCase`` 数据设置

source: :class:`~django.test.TestCase` has been refactored to allow for data initialization at the class level using transactions and savepoints. Database backends which do not support transactions, like MySQL with the MyISAM storage engine, will still be able to run these tests but won't benefit from the improvements. Tests are now run within two nested :func:`~django.db.transaction.atomic()` blocks: one for the whole class and one for each test.
id: :class:`~django.test.TestCase` telah direfaktor untuk mengizinkan untuk inisialisasi data pada tingkatan kelas menggunakan transaksi dan titik simpan. Backend basisdata yang tidak mendukung transaksi, seperti MySQL dengan penyimpanan MyISAM, akan masih dapat menjalankan percobaan ini tetapi tidak akan bermanfaat dari perbaikan. Percobaan sekarang berjalan dalam dua blok :func:`~django.db.transaction.atomic()` bersarang: satu untuk keseluruhan kelas dan untuk setiap percobaan.
zh_hans: :class:`~django.test.TestCase` 已进行重构，以允许在类级别使用事务和保存点进行数据初始化。不支持事务的数据库后端，比如使用 MyISAM 存储引擎的 MySQL，仍然可以运行这些测试，但不会从改进中受益。现在，测试在两个嵌套的 :func:`~django.db.transaction.atomic()` 块中运行：一个用于整个类，一个用于每个测试。

source: The class method :meth:`TestCase.setUpTestData() <django.test.TestCase.setUpTestData>` adds the ability to set up test data at the class level. Using this technique can speed up the tests as compared to using ``setUp()``.
zh_hans: 类方法 :meth:`TestCase.setUpTestData() <django.test.TestCase.setUpTestData>` 添加了在类级别设置测试数据的能力。使用这种技术可以加速测试，与使用 ``setUp()`` 相比。

source: Fixture loading within ``TestCase`` is now performed once for the whole ``TestCase``.
zh_hans: 在 ``TestCase`` 中的 fixture 加载现在一次性完成整个 ``TestCase``。

source: :class:`~django.contrib.admin.ModelAdmin` now has a :meth:`~django.contrib.admin.ModelAdmin.has_module_permission` method to allow limiting access to the module on the admin index page.
id: :class:`~django.contrib.admin.ModelAdmin` sekarang mempunyai sebuah metode :meth:`~django.contrib.admin.ModelAdmin.has_module_permission` untuk mengizinkan membatasi akses pada modul di halaman indeks admin.
zh_hans: :class:`~django.contrib.admin.ModelAdmin` 现在具有一个 :meth:`~django.contrib.admin.ModelAdmin.has_module_permission` 方法，允许限制在管理索引页面上对模块的访问。
