Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Added a warning for duplicate models when a module is reloaded. Previously a ``RuntimeError`` was raised every time two models clashed in the app registry. (:ticket:`23621`).
id: Ditambahkan untuk sebuah peringatan untuk model ganda ketika sebuah modul memuat kembali. Sebelumnya sebuah ``RuntimeError`` telah dimunculkan setiap kali dua model bertentangan di registrar aplikasi (:ticket:`23621`).
zh_hans: 在重新加载模块时，当存在重复的模型时添加了警告。以前，每当两个模型在应用程序注册表中冲突时，都会引发 ``RuntimeError`` (:ticket:`23621`)。

source: Prevented :djadmin:`flush` from loading initial data for migrated apps (:ticket:`23699`).
id: Dicegah :djadmin:`flush` dari memuat data inisial untuk aplikasi berpindah (:ticket:`23699`).
zh_hans: 防止 :djadmin:`flush` 为已迁移的应用程序加载初始数据 (:ticket:`23699`)。

source: Fixed a :djadmin:`makemessages` regression in 1.7.1 when :setting:`STATIC_ROOT` has the default ``None`` value (:ticket:`23717`).
id: Diperbaiki sebuah pemulihan :djadmin:`makemessages` di 1.7.1 ketika :setting:`STATIC_ROOT` mempunyai awalan nilai ``None`` (:ticket:`23717`).
zh_hans: 修复了 1.7.1 中的 :djadmin:`makemessages` 回归问题，当 :setting:`STATIC_ROOT` 具有默认值 ``None`` 时 (:ticket:`23717`)。

source: Added GeoDjango compatibility with mysqlclient database driver.
id: Menambahkan kesesuaian GeoDjango dengan driver basisdata mysqlclient.
zh_hans: 添加了 GeoDjango 与 mysqlclient 数据库驱动的兼容性。

source: Fixed MySQL 5.6+ crash with ``GeometryField``\s in migrations (:ticket:`23719`).
id: Diperbaiki kegagalan MySQL 5.6+ dengan ``GeometryField`` di perpindahan (:ticket:`23719`).
zh_hans: 修复了 MySQL 5.6+ 在迁移中与 ``GeometryField`` 相关的崩溃问题 (:ticket:`23719`)。

source: Fixed a migration crash when removing a field that is referenced in ``AlterIndexTogether`` or ``AlterUniqueTogether`` (:ticket:`23614`).
id: Diperbaiki kegagalan perpindahan ketika memindahkan sebuah bidang yang mengacu di `AlterIndexTogether`` atau ``AlterUniqueTogether`` (:ticket:`23614`).
zh_hans: 修复了在删除一个被 ``AlterIndexTogether`` 或 ``AlterUniqueTogether`` 引用的字段时的迁移崩溃问题 (:ticket:`23614`)。

source: Updated the first day of the week in the Ukrainian locale to Monday.
id: Diperbaharui hari pertama dari minggu di lokal Ukraina pada Senin.
zh_hans: 将乌克兰语环境中每周的第一天更新为星期一。

source: Added support for transactional spatial metadata initialization on SpatiaLite 4.1+ (:ticket:`23152`).
id: Ditambahkan dukungan untuk inisialisasi metadata spasial transaksi pada SpatiaLite 4.1+ (:ticket:`23152`).
zh_hans: 在 SpatiaLite 4.1+ 上添加了事务性空间元数据初始化的支持 (:ticket:`23152`)。

source: Fixed a migration crash that prevented changing a nullable field with a default to non-nullable with the same default (:ticket:`23738`).
id: Diperbaiki kegagalan perpindahan yang mencegah merubah bidang null dengan awalan pada bukan-null dengan awalan sama (:ticket:`23738`).
zh_hans: 修复了迁移中的崩溃问题，该问题阻止了将具有相同默认值的可空字段更改为非可空字段 (:ticket:`23738`)。

source: Fixed a migration crash when adding ``GeometryField``\s with ``blank=True`` on PostGIS (:ticket:`23731`).
id: Diperbaiki kegagalan perpindahan ketika menambahkan ``GeometryField`` dengan ``blank=True`` pada PostGIS (:ticket:`23731`).
zh_hans: 修复了在 PostGIS 上添加具有 ``blank=True`` 的 ``GeometryField`` 时的迁移崩溃问题 (:ticket:`23731`)。

source: Allowed usage of ``DateTimeField()`` as ``Transform.output_field`` (:ticket:`23420`).
id: Diizinkan penggunaan dari ``DateTimeField()`` sebagai ``Transform.output_field`` (:ticket:`23420`).
zh_hans: 允许将 ``DateTimeField()`` 用作 ``Transform.output_field`` (:ticket:`23420`)。

source: Fixed a migration serializing bug involving ``float("nan")`` and ``float("inf")`` (:ticket:`23770`).
id: Diperbaiki sebuah perpindahan serialisasikan kesalahan melibatkan ``float("nan")`` dan ``float("inf")`` (:ticket:`23770`).
zh_hans: 修复了与 ``float("nan")`` 和 ``float("inf")`` 相关的迁移序列化 bug (:ticket:`23770`)。

source: Fixed a regression where custom form fields having a ``queryset`` attribute but no ``limit_choices_to`` could not be used in a :class:`~django.forms.ModelForm` (:ticket:`23795`).
id: Diperbaiki sebuah pemulihan dimana bidang formulir penyesuaian mempunyai sebuah atribut ``queryset`` tetapi `tidak ada `limit_choices_to``tidak dapat digunakan di :class:`~django.forms.ModelForm` (:ticket:`23795`).
zh_hans: 修复了回归问题，其中具有 ``queryset`` 属性但没有 ``limit_choices_to`` 的自定义表单字段不能在 :class:`~django.forms.ModelForm` 中使用 (:ticket:`23795`)。

source: Fixed a custom field type validation error with MySQL backend when ``db_type`` returned ``None`` (:ticket:`23761`).
id: Diperbaiki sebuah kesalahan pengesahan jenis bidang penyesuaian dengan backend MySQL ketika `db_type`` dikembalikan ``None`` (:ticket:`23761`).
zh_hans: 修复了在 MySQL 后端中，当 ``db_type`` 返回 ``None`` 时的自定义字段类型验证错误 (:ticket:`23761`)。

source: Fixed a migration crash when a field is renamed that is part of an ``index_together`` (:ticket:`23859`).
id: Diperbaiki kegagalan perpindahan ketika sebuah bidang dinamai adalah bagian dari sebuah ``index_together`` (:ticket:`23859`).
zh_hans: 修复了一个当重命名一个作为 ``index_together`` 的一部分的字段时的迁移崩溃问题 (:ticket:`23859`)。

source: Fixed :djadmin:`squashmigrations` to respect the ``--no-optimize`` parameter (:ticket:`23799`).
id: Diperbaiki :djadmin:`squashmigrations` untuk menghormati parameter ``--no-optimize`` (:ticket:`23799`).
zh_hans: 修复了 :djadmin:`squashmigrations` 以尊重 ``--no-optimize`` 参数 (:ticket:`23799`)。

source: Made :class:`~django.db.migrations.operations.RenameModel` reversible (:ticket:`22248`)
id: Dibuat :class:`~django.db.migrations.operations.RenameModel` yang dapat dibalikkan (:ticket:`22248`)
zh_hans: 使 :class:`~django.db.migrations.operations.RenameModel` 可逆操作 (:ticket:`22248`)。

source: Avoided unnecessary rollbacks of migrations from other apps when migrating backwards (:ticket:`23410`).
id: Dihindari rollback tidak perlu dari perpindahan dari aplikasi lain ketika perpindahan kebelakang (:ticket:`23410`).
zh_hans: 在向后迁移时避免了不必要的来自其他应用程序的迁移回滚 (:ticket:`23410`)。

source: Fixed a rare query error when using deeply nested subqueries (:ticket:`23605`).
id: Diperbaiki kesalahan permintaan jarang ketika menggunakan sub permintaan bersarang dalam (:ticket:`23605`).
zh_hans: 修复了在使用深度嵌套子查询时的一种罕见的查询错误 (:ticket:`23605`)。

source: Fixed a crash in migrations when deleting a field that is part of a ``index/unique_together`` constraint (:ticket:`23794`).
id: Diperbaiki kegagalan di perpindahan ketika menghapus sebuah bidang yaitu bagian dari batasan ``index/unique_together`` (:ticket:`23794`).
zh_hans: 修复了在删除一个作为 ``index/unique_together`` 约束的一部分的字段时迁移中的崩溃问题 (:ticket:`23794`)。

source: Fixed ``django.core.files.File.__repr__()`` when the file's ``name`` contains Unicode characters (:ticket:`23888`).
id: Diperbaiki ``django.core.files.File.__repr__()`` ketika ``name`` berkas mengandung karakter Unicode (:ticket:`23888`).
zh_hans: 修复了当文件的 ``name`` 包含 Unicode 字符时，``django.core.files.File.__repr__()`` 的问题 (:ticket:`23888`)。

source: Added missing context to the admin's ``delete_selected`` view that prevented custom site header, etc. from appearing (:ticket:`23898`).
id: Ditambahkan konteks hilang pada tampilan ``delete_selected`` admin yang mencegah penyesuaian kepala situs, sebagai contoh dari kemunculan (:ticket:`23898`).
zh_hans: 在管理员的 ``delete_selected`` 视图中添加了缺失的上下文，以防止自定义站点标题等不显示 (:ticket:`23898`)。

source: Fixed an infinite loop bug for certain cyclic migration dependencies, and made the error message for cyclic dependencies much more helpful.
id: DIperbaiki sebuah kesalahan perulangan tidak terbatas untuk ketergantungan perpindahan siklus tertentu, dan membuat pesan kesalahan untuk ketergantungan siklus banyak lebih membantu.
zh_hans: 修复了某些循环迁移依赖关系的无限循环 bug，并对循环依赖关系的错误消息进行了改进，使其更加有帮助。

source: Added missing ``index_together`` handling for SQLite (:ticket:`23880`).
id: Ditambahkan penanganan ``index_together`` hilang untuk SQLite (:ticket:`23880`).
zh_hans: 为 SQLite 添加了缺失的 ``index_together`` 处理 (:ticket:`23880`)。

source: Fixed a crash when ``RunSQL`` SQL content was collected by the schema editor, typically when using ``sqlmigrate`` (:ticket:`23909`).
id: Diperbaiki sebuah kegagalan ketika ``RunSQL`` isi SQL dikumpulkan oleh penyunting skema, kshususnya ketika menggunakan ``sqlmigrate`` (:ticket:`23909`).
zh_hans: 修复了在模式编辑器收集 ``RunSQL`` SQL 内容时崩溃的问题，通常在使用 ``sqlmigrate`` 时发生 (:ticket:`23909`)。

source: Fixed a regression in ``contrib.admin`` add/change views which caused some ``ModelAdmin`` methods to receive the incorrect ``obj`` value (:ticket:`23934`).
id: Diperbaiki sebuah pemulihan di ``contrib.admin`` tampilan tambah/rubah yang menyebabkan beberapa metode ``ModelAdmin`` untuk menerima nilai ``obj`` tidak benar (:ticket:`23934`).
zh_hans: 修复了 ``contrib.admin`` 添加/更改视图中的回归问题，导致一些 ``ModelAdmin`` 方法接收到错误的 ``obj`` 值 (:ticket:`23934`)。

source: Fixed ``runserver`` crash when socket error message contained Unicode characters (:ticket:`23946`).
id: Diperbaiki kegagalan ``runserver`` ketika soket pesan kesalahan mengandung karakter Unicode (:ticket:`23946`).
zh_hans: 修复了当套接字错误消息包含 Unicode 字符时，``runserver`` 崩溃的问题 (:ticket:`23946`)。

source: Fixed serialization of ``type`` when adding a ``deconstruct()`` method (:ticket:`23950`).
id: Diperbaiki serialisasi dari obyek ``type`` ketika menambahkan sebuah metode ``deconstruct()`` (:ticket:`23950`).
zh_hans: 修复了在添加 ``deconstruct()`` 方法时对 ``type`` 的序列化问题 (:ticket:`23950`)。

source: Prevented the ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` from setting a ``"Vary: Cookie"`` header on all responses (:ticket:`23939`).
id: Dicegah ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` dari mengatur sebuah kepala ``"Vary: Cookie"`` di semua tanggapan (:ticket:`23939`).
zh_hans: 阻止了 ``django.contrib.auth.middleware.SessionAuthenticationMiddleware`` 在所有响应上设置 ``"Vary: Cookie"`` 头 (:ticket:`23939`)。

source: Fixed a crash when adding ``blank=True`` to ``TextField()`` on MySQL (:ticket:`23920`).
id: Diperbaiki sebuah kegagalan ketika menambahkan ``blank=True`` menjadi ``TextField()`` di MySQL (:ticket:`23920`).
zh_hans: 修复了在 MySQL 上将 ``blank=True`` 添加到 ``TextField()`` 时的崩溃问题 (:ticket:`23920`)。

source: Fixed index creation by the migration infrastructure, particularly when dealing with PostgreSQL specific ``{text|varchar}_pattern_ops`` indexes (:ticket:`23954`).
id: Diperbaiki pembuatan indeks oleh infrastruktur perpindahan, khususnya ketika berhubungan dengan PostgreSQL indeks ``{text|varchar}_pattern_ops`` tertentu (:ticket:`23954`).
zh_hans: 修复了迁移基础结构创建索引的问题，特别是在处理 PostgreSQL 特定的 ``{text|varchar}_pattern_ops`` 索引时的问题 (:ticket:`23954`)。

source: Fixed bug in ``makemigrations`` that created broken migration files when dealing with multiple table inheritance and inheriting from more than one model (:ticket:`23956`).
id: Diperbaiki kesalahan di ``makemigrations`` yang membuat perpindahan berkas-berkas rusak ketika berurusan dengan banyak tabel warisan dan mewarisi lebih dari satu model (:ticket:`23956`).
zh_hans: 修复了在处理多表继承并继承自多个模型时，``makemigrations`` 会创建损坏的迁移文件的 bug (:ticket:`23956`)。

source: Fixed a crash when a ``MultiValueField`` has invalid data (:ticket:`23674`).
id: Diperbaiki sebuah kegagalan ketika ``MultiValueField`` mempunyai data tidak sah (:ticket:`23674`).
zh_hans: 修复了当 ``MultiValueField`` 具有无效数据时的崩溃问题 (:ticket:`23674`)。

source: Fixed a crash in the admin when using "Save as new" and also deleting a related inline (:ticket:`23857`).
id: Diperbaiki sebuah kegagalan di admin ketika menggunakan "Save as new" dan juga menghapus berderet terkait (:ticket:`23857`).
zh_hans: 修复了在管理员中使用 "另存为新" 并删除相关联的内联时的崩溃问题 (:ticket:`23857`)。

source: Always converted ``related_name`` to text (Unicode), since that is required on Python 3 for interpolation. Removed conversion of ``related_name`` to text in migration deconstruction (:ticket:`23455` and :ticket:`23982`).
zh_hans: 始终将 ``related_name`` 转换为文本 (Unicode)，因为在 Python 3 中，这是插值所必需的。移除了迁移反构造中的 ``related_name`` 到文本的转换 (:ticket:`23455` 和 :ticket:`23982`)。

source: Enlarged the sizes of tablespaces which are created by default for testing on Oracle (the main tablespace was increased from 200M to 300M and the temporary tablespace from 100M to 150M). This was required to accommodate growth in Django's own test suite (:ticket:`23969`).
id: Diperbesar ukuran dari tablespace yang dibuat oleh awalan untuk percobaan di Oracle (tablespace utama meningkat dari 200M menjadi 300M dan dan tablespace sementara dari 100 M menjadi 150M). Ini diwajibkan untuk menampung pertumbuhan di deretan percobaan sendiri Django (:ticket:`23969`).
zh_hans: 扩大了默认情况下在 Oracle 上用于测试的表空间的大小（主表空间从 200M 增加到 300M，临时表空间从 100M 增加到 150M）。这是为了适应 Django 自己的测试套件的增长而需要的 (:ticket:`23969`)。

source: Fixed ``timesince`` filter translations in Korean (:ticket:`23989`).
id: Diperbaiki terjemahan penyaring ``timesince`` di Korea (:ticket:`23989`).
zh_hans: 修复了韩语中 ``timesince`` 过滤器的翻译问题 (:ticket:`23989`)。

source: Fixed the SQLite ``SchemaEditor`` to properly add defaults in the absence of a user specified ``default``. For example, a ``CharField`` with ``blank=True`` didn't set existing rows to an empty string which resulted in a crash when adding the ``NOT NULL`` constraint (:ticket:`23987`).
id: Diperbaiki ``SchemaEditor`` SQLite untuk dengan benar menambahkan awalan di tidak adanya pengguna menentukan ``default``. Sebagai contoh, ``CharField`` dengan ``blank=True`` tidak mensetel baris yang ada ke string kosong yang menghasilkan sebuah kegagalan ketika menambahkan batasan ``NOT NULL`` (:ticket:`23987`).
zh_hans: 修复了 SQLite 的 ``SchemaEditor`` 在没有用户指定的 ``default`` 的情况下正确添加默认值的问题。例如，一个具有 ``blank=True`` 的 ``CharField`` 没有将现有的行设置为空字符串，这会在添加 ``NOT NULL`` 约束时导致崩溃 (:ticket:`23987`)。

source: ``makemigrations`` no longer prompts for a default value when adding ``TextField()`` or ``CharField()`` without a ``default`` (:ticket:`23405`).
id: ``makemigrations`` tidak lagi menunjuk untuk nilai awalan ketika menambahkan ``TextField()`` atau ``CharField()`` tanpa sebuah ``default`` (:ticket:`23405`).
zh_hans: 在添加没有 ``default`` 的 ``TextField()`` 或 ``CharField()`` 时，``makemigrations`` 不再提示输入默认值 (:ticket:`23405`)。

source: Fixed a migration crash when adding ``order_with_respect_to`` to a table with existing rows (:ticket:`23983`).
id: Diperbaiki sebuah kegagalan perpindahan ketika menambahkan ``order_with_respect_to`` ke sebuah tabel dengan baris yang ada (:ticket:`23983`).
zh_hans: 修复了在向具有现有行的表添加 ``order_with_respect_to`` 时的迁移崩溃问题 (:ticket:`23983`)。

source: Restored the ``pre_migrate`` signal if all apps have migrations (:ticket:`23975`).
id: Disimpan kembali sinyal ``pre_migrate`` jika semua aplikasi memiliki perpindahan (:ticket:`23975`).
zh_hans: 如果所有应用程序都具有迁移，则恢复了 ``pre_migrate`` 信号 (:ticket:`23975`)。

source: Made admin system checks run for custom ``AdminSite``\s (:ticket:`23497`).
id: Membuat pemeriksaan sistem admin untuk penyesuaian ``AdminSite`` (:ticket:`23497`).
zh_hans: 使自定义 ``AdminSite`` 运行管理员系统检查 (:ticket:`23497`)。

source: Ensured the app registry is fully populated when unpickling models. When an external script (like a queueing infrastructure) reloads pickled models, it could crash with an ``AppRegistryNotReady`` exception (:ticket:`24007`).
id: Dipastikan registrar aplikasi sepenuhnya dikumpulkan ketika membatalkan model. Ketika sebuah tulisan eksternal (seperti antrian infrastruktur) memuat kembali model kesulitan, itu dapat gagal dengan sebuah pengecualian ``AppRegistryNotReady`` (:ticket:`24007`).
zh_hans: 确保在反序列化模型时完全填充应用程序注册表。当外部脚本（如队列基础架构）重新加载序列化的模型时，可能会出现 ``AppRegistryNotReady`` 异常导致崩溃 (:ticket:`24007`)。

source: Added quoting to field indexes in the SQL generated by migrations to prevent a crash when the index name requires it (:ticket:`24015`).
zh_hans: 在迁移生成的 SQL 中为字段索引添加引号，以防止索引名称需要引号时导致崩溃 (:ticket:`24015`)。

source: Added ``datetime.time`` support to migrations questioner (:ticket:`23998`).
id: Menambahkan dukungan ``datetime.time`` untuk perpindahan pertanyaan (:ticket:`23998`).
zh_hans: 在迁移问题中添加了对 ``datetime.time`` 的支持 (:ticket:`23998`)。

source: Fixed admindocs crash on apps installed as eggs (:ticket:`23525`).
id: Diperbaiki kegagalan amindoc pada aplikasi terpasang sebagai telur (:ticket:`23525`).
zh_hans: 修复了在以 egg 形式安装的应用程序上的 admindocs 崩溃问题 (:ticket:`23525`)。

source: Changed migrations autodetector to generate an ``AlterModelOptions`` operation instead of ``DeleteModel`` and ``CreateModel`` operations when changing ``Meta.managed``. This prevents data loss when changing ``managed`` from ``False`` to ``True`` and vice versa (:ticket:`24037`).
id: Berubah pengenal otomatis perppindahan untuk membangkitkan sebuah tindakan ``AlterModelOptions`` daripada tindakan ``DeleteModel`` dan ``CreateModel`` ketika merubah ``Meta.managed``. Ini mencegah kehilangan data ketika merubah ``managed`` dari ``False`` menjadi ``True`` dan sebaliknya (:ticket:`24037`).
zh_hans: 更改了迁移自动检测器，以在更改 ``Meta.managed`` 时生成 ``AlterModelOptions`` 操作，而不是生成 ``DeleteModel`` 和 ``CreateModel`` 操作。这可以防止在 ``managed`` 从 ``False`` 更改为 ``True`` 或反之时丢失数据 (:ticket:`24037`)。

source: Enabled the ``sqlsequencereset`` command on apps with migrations (:ticket:`24054`).
id: Diadakan perintah ``sqlsequencereset`` di aplikasi dengan perpindahan (:ticket:`24054`).
zh_hans: 在具有迁移的应用程序上启用了 ``sqlsequencereset`` 命令 (:ticket:`24054`)。

source: Added tablespace SQL to apps with migrations (:ticket:`24051`).
id: Ditambahkan SQL tablespace pada aplikasi dengan perpindahan (:ticket:`24051`).
zh_hans: 在具有迁移的应用程序中添加了表空间 SQL (:ticket:`24051`)。

source: Corrected ``contrib.sites`` default site creation in a multiple database setup (:ticket:`24000`).
id: Diperbaiki pembuatan situs awalan ``contrib.sites`` di banyak pengaturan basisdata (:ticket:`24000`).
zh_hans: 在多数据库设置中纠正了 ``contrib.sites`` 默认站点创建的问题 (:ticket:`24000`)。

source: Restored support for objects that aren't :class:`str` or :class:`bytes` in ``django.utils.safestring.mark_for_escaping()`` on Python 3.
id: Dipulihkan dukungan untuk obyek yang tidak :class:`str` or :class:`bytes` di ``django.utils.safestring.mark_for_escaping()`` di Python 3.
zh_hans: 在 Python 3 中恢复了 ``django.utils.safestring.mark_for_escaping()`` 中不是 :class:`str` 或 :class:`bytes` 类型的对象的支持。

source: Supported strings escaped by third-party libraries with the ``__html__`` convention in the template engine (:ticket:`23831`).
id: Didukung pelolosan string oleh pustaka pihak-ketiga dengan ketentuan ``__html__`` di mesin cetakan (:ticket:`23831`).
zh_hans: 在模板引擎中支持了通过第三方库使用 ``__html__`` 约定进行转义的字符串 (:ticket:`23831`)。

source: Prevented extraneous ``DROP DEFAULT`` SQL in migrations (:ticket:`23581`).
id: Dicegah SQL ``DROP DEFAULT`` asing di perpindahan (:ticket:`23581`).
zh_hans: 防止在迁移中出现多余的 ``DROP DEFAULT`` SQL (:ticket:`23581`)。

source: Restored the ability to use more than five levels of subqueries (:ticket:`23758`).
id: Disimpan kembali kemampuan untuk menggunakan lebih dari 5 tingkatan dari subpermintaan (:ticket:`23758`).
zh_hans: 恢复了使用超过五层子查询的能力 (:ticket:`23758`)。

source: Fixed crash when ``ValidationError`` is initialized with a ``ValidationError`` that is initialized with a dictionary (:ticket:`24008`).
id: Diperbaiki kegagalan ketika ``ValidationError`` diinisialisasikan dengan ``ValidationError`` yaitu dinisialisasikan dengan sebuah kamus (:ticket:`24008`).
zh_hans: 修复了当使用一个初始化为字典的 ``ValidationError`` 来初始化另一个 ``ValidationError`` 时出现崩溃的问题 (:ticket:`24008`)。

source: Prevented a crash on apps without migrations when running ``migrate --list`` (:ticket:`23366`).
id: Dicegah sebuah kegagalan pada aplikasi tanpa perpindahan ketika menjalankan ``migrate --list`` (:ticket:`23366`).
zh_hans: 在运行 ``migrate --list`` 时，防止了在没有迁移的应用程序上发生崩溃 (:ticket:`23366`)。

source: Django 1.7.3 release notes
id: Catatan terbitan Django 1.7.3
zh_hans: Django 1.7.3 版本发行说明

source: Django 1.7.3 fixes several security issues and bugs in 1.7.2.
id: Django 1.7.3 memperbaiki beberapa masalah keamanan dan kesalahan di 1.7.2.
zh_hans: Django 1.7.3 修复了 1.7.2 版本中的一些安全问题和错误。

source: The default iteration count for the PBKDF2 password hasher has been increased by 25%. This part of the normal major release process was inadvertently omitted in 1.7. This backwards compatible change will not affect users who have subclassed ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` to change the default value.
id: Perhitungan putaran awal untuk pencampur sandi PBKDF2 telah ditingkatkan oleh 25%. Bagian ini dari pengolahan terbitan utama biasa telah secara tidak sengaja dihilangkan di 1.7. Perubahan kesesuaian kebelakang tidak akan mempengaruhi pengguna yang telah disubkelaskan ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` untuk merubah nilai awal.
zh_hans: PBKDF2 密码哈希器的默认迭代次数增加了 25%。这是正常的主要发布流程的一部分，在 1.7 版中无意中被遗漏。这个向后兼容的更改不会影响那些已经子类化了 ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` 以更改默认值的用户。

source: Fixed a crash in the CSRF middleware when handling non-ASCII referer header (:ticket:`23815`).
id: Fixed sebuah kegagalan di middleware CSRF ketika menangani bukan-ASCII megnarah kepala (:ticket:`23815`).
zh_hans: 修复了 CSRF 中间件在处理非 ASCII referer 头部时的崩溃问题（:ticket:`23815`）。

source: Fixed a crash in the ``django.contrib.auth.redirect_to_login`` view when passing a ``reverse_lazy()`` result on Python 3 (:ticket:`24097`).
id: Diperbaiki sebuah kegagalan di tampilan ``django.contrib.auth.redirect_to_login`` ketika melewatkan hasil ``reverse_lazy()`` pada Python 3 (:ticket:`24097`).
zh_hans: 修复了在 Python 3 上传递 ``reverse_lazy()`` 结果时，``django.contrib.auth.redirect_to_login`` 视图中的崩溃问题（:ticket:`24097`）。

source: Added correct formats for Greek (``el``) (:ticket:`23967`).
id: Ditambahkan bentuk benar untuk Yunani (``el``) (:ticket:`23967`).
zh_hans: 为希腊语（``el``）添加了正确的格式（:ticket:`23967`)。

source: Fixed a migration crash when unapplying a migration where multiple operations interact with the same model (:ticket:`24110`).
id: Diperbaiki sebuah kegagalan ketika tidak memberlakukan perpindahan dimana banyak operasi interaksi dengan model sama (:ticket:`24110`).
zh_hans: 修复了在取消应用多个操作与同一模型交互的迁移时出现的崩溃问题（:ticket:`24110`)。

source: Django 1.7.4 release notes
id: Catatan terbitan Django 1.7.4
zh_hans: Django 1.7.4 版本发行说明

source: Django 1.7.4 fixes several bugs in 1.7.3.
id: Django 1.7.4 memperbaiki beberapa kesalahan di 1.7.3.
zh_hans: Django 1.7.4 修复了 1.7.3 版本中的一些错误。

source: Fixed a migration crash when unapplying ``contrib.contenttypes``’s or ``contrib.auth``’s first migration (:ticket:`24075`).
zh_hans: 修复了在取消应用 ``contrib.contenttypes`` 或 ``contrib.auth`` 的第一个迁移时出现的崩溃问题（:ticket:`24075`)。

source: Made the migration's ``RenameModel`` operation rename ``ManyToManyField`` tables (:ticket:`24135`).
id: Dibuat tindakan ``RenameModel`` perpindahan menamai kembali tabel-tabel ``ManyToManyField`` (:ticket:`24135`).
zh_hans: 使迁移中的 ``RenameModel`` 操作能够重命名 ``ManyToManyField`` 表（:ticket:`24135`)。

source: Fixed a migration crash on MySQL when migrating from a ``OneToOneField`` to a ``ForeignKey`` (:ticket:`24163`).
id: Diperbaiki sebuah kegagalan perpindahan di MySQL ketika berpindah dari ``OneToOneField`` ke ``ForeignKey`` (:ticket:`24163`).
zh_hans: 修复了在从 ``OneToOneField`` 迁移到 ``ForeignKey`` 时，在 MySQL 上发生的迁移崩溃问题（:ticket:`24163`)。

source: Prevented the ``static.serve`` view from producing ``ResourceWarning``\s in certain circumstances (security fix regression, :ticket:`24193`).
id: Dicegah tampilan ``static.serve`` dari menghasilkan ``ResourceWarning`` di keadaan tertentu (pemulihan perbaikan keamanan, :ticket:`24193`).
zh_hans: 在某些情况下，防止 ``static.serve`` 视图产生 ``ResourceWarning`` （安全性修复回退，:ticket:`24193`)。
