Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Time lookups (hour, minute, second) are now supported by :class:`~django.db.models.TimeField` for all database backends. Support for backends other than SQLite was added but undocumented in Django 1.7.
id: Pencarian waktu (jam, menit, detik) sekarang didukung oleh :class:`~django.db.models.TimeField` untuk semua backend basisdata. Dukungan untuk backend selain dari SQLite telah ditambahkan tetapi tidak terdokumentasikan di Django 1.7.
zh_hans: 时间查询（小时，分钟，秒）现在对所有数据库后端都受到 :class:`~django.db.models.TimeField` 的支持。在 Django 1.7 中添加了对除 SQLite 外的后端的支持，但未记录在文档中。

source: You can specify the ``output_field`` parameter of the :class:`~django.db.models.Avg` aggregate in order to aggregate over non-numeric columns, such as ``DurationField``.
id: Anda dapat menentukan parameter ``output_field`` dari kumpulan :class:`~django.db.models.Avg` untuk mengumpulkan terhadap kolom bukan-numerik, seperti ``DurationField``.
zh_hans: 你可以通过指定 :class:`~django.db.models.Avg` 聚合的 ``output_field`` 参数来对非数字列（如 ``DurationField``）进行聚合。

source: Added the :lookup:`date` lookup to :class:`~django.db.models.DateTimeField` to allow querying the field by only the date portion.
id: Ditambahkan pencarian :lookup:`date` pada :class:`~django.db.models.DateTimeField` untuk mengizinkan meminta bidang dengan hanya sebagian tanggal.
zh_hans: 在 :class:`~django.db.models.DateTimeField` 中添加了 :lookup:`date` 查询，允许仅查询字段的日期部分。

source: Added the :class:`~django.db.models.functions.Greatest` and :class:`~django.db.models.functions.Least` database functions.
id: Ditambahkan fungsi basisdata :class:`~django.db.models.functions.Greatest` dan :class:`~django.db.models.functions.Least`.
zh_hans: 添加了 :class:`~django.db.models.functions.Greatest` 和 :class:`~django.db.models.functions.Least` 数据库函数。

source: Added the :class:`~django.db.models.functions.Now` database function, which returns the current date and time.
id: Ditambahkan fungsi basisdata :class:`~django.db.models.functions.Now`, yang mengembalikan tanggal dan waktu saat ini.
zh_hans: 添加了 :class:`~django.db.models.functions.Now` 数据库函数，该函数返回当前的日期和时间。

source: :class:`~django.db.models.Transform` is now a subclass of :ref:`Func() <func-expressions>` which allows ``Transform``\s to be used on the right hand side of an expression, just like regular ``Func``\s. This allows registering some database functions like :class:`~django.db.models.functions.Length`, :class:`~django.db.models.functions.Lower`, and :class:`~django.db.models.functions.Upper` as transforms.
id: :class:`~django.db.models.Transform` sekarang sebuah subkelas dari :ref:`Func() <func-expressions>` yang mengizinkan ``Transform`` untuk digunakan di sisi tangan kanan dari pernyataan, sama seperti ``Func`` biasa. Ini mengizinkan mendaftarkan beberapa fungsi basisdata seperti :class:`~django.db.models.functions.Length`, :class:`~django.db.models.functions.Lower`, dan :class:`~django.db.models.functions.Upper` sebagai perubahan bentuk.
zh_hans: :class:`~django.db.models.Transform` 现在是 :ref:`Func() <func-expressions>` 的子类，这使得 ``Transform`` 可以像常规的 ``Func`` 一样用在表达式的右侧。这允许注册一些数据库函数，如 :class:`~django.db.models.functions.Length`、:class:`~django.db.models.functions.Lower` 和 :class:`~django.db.models.functions.Upper` 作为转换函数。

source: :class:`~django.db.models.SlugField` now accepts an :attr:`~django.db.models.SlugField.allow_unicode` argument to allow Unicode characters in slugs.
id: :class:`~django.db.models.SlugField` sekarang menerima sebuah argumen :attr:`~django.db.models.SlugField.allow_unicode` untuk mengizinkan karakter Unicode di keong.
zh_hans: :class:`~django.db.models.SlugField` 现在接受一个 :attr:`~django.db.models.SlugField.allow_unicode` 参数，允许在 slug 中使用 Unicode 字符。

source: Added support for referencing annotations in ``QuerySet.distinct()``.
id: Ditambahkan dukungan untuk mengacu keterangan di ``QuerySet.distinct()``.
zh_hans: 在 ``QuerySet.distinct()`` 中增加了对注解引用的支持。

source: ``connection.queries`` shows queries with substituted parameters on SQLite.
id: ``connection.queries`` menampilkan permintaan dengan parameter pengganti pada SQLite.
zh_hans: ``connection.queries`` 在 SQLite 上显示带有替代参数的查询。

source: :doc:`Query expressions </ref/models/expressions>` can now be used when creating new model instances using ``save()``, ``create()``, and ``bulk_create()``.
id: :doc:`Query expressions </ref/models/expressions>` dapat sekarang digunakan ketika membuat instance model baru menggunakan ``save()``, ``create()``, dan ``bulk_create()``.
zh_hans: :doc:`查询表达式 </ref/models/expressions>` 现在可以在使用 ``save()``, ``create()`` 和 ``bulk_create()`` 创建新模型实例时使用。

source: Unless :attr:`HttpResponse.reason_phrase <django.http.HttpResponse.reason_phrase>` is explicitly set, it now is determined by the current value of :attr:`HttpResponse.status_code <django.http.HttpResponse.status_code>`. Modifying the value of ``status_code`` outside of the constructor will also modify the value of ``reason_phrase``.
id: Meskipun :attr:`HttpResponse.reason_phrase <django.http.HttpResponse.reason_phrase>` adalah jelas disetel, itu sekarang ditentukan oleh nilai saat ini dari :attr:`HttpResponse.status_code <django.http.HttpResponse.status_code>`. Merubah nilai dari ``status_code`` diluar dari pembangun akan juga merubah nilai dari ``reason_phrase``.
zh_hans: 除非显式设置 :attr:`HttpResponse.reason_phrase <django.http.HttpResponse.reason_phrase>`，否则它现在由 :attr:`HttpResponse.status_code <django.http.HttpResponse.status_code>` 的当前值确定。在构造函数之外修改 ``status_code`` 的值也会修改 ``reason_phrase`` 的值。

source: The debug view now shows details of chained exceptions on Python 3.
id: Tampilan mencari kesalahan sekarang menampilkan rincian dari tambatan pengecualian pada Python 3.
zh_hans: 调试视图现在在 Python 3 上显示链式异常的详细信息。

source: The default 40x error views now accept a second positional parameter, the exception that triggered the view.
id: Awalan tampilan kesalahan 40x sekarang menerima sebuah pameter penempatan kedua, pengecualian yang membangkitkan tampilan.
zh_hans: 默认的 40x 错误视图现在接受第二个位置参数，即触发视图的异常。

source: View error handlers now support :class:`~django.template.response.TemplateResponse`, commonly used with class-based views.
id: Tampilan penangan kesalahan sekarang mendukung :class:`~django.template.response.TemplateResponse`, secara umum digunakan dengan tampilan berdasarkan-kelas.
zh_hans: 视图错误处理程序现在支持 :class:`~django.template.response.TemplateResponse`，这在使用基于类的视图时常常使用。

source: Exceptions raised by the ``render()`` method are now passed to the ``process_exception()`` method of each middleware.
id: Pengecualian dimunculkan oleh metode ``render()`` sekarang dilewatkan ke metode ``process_exception()`` untuk setiap middleware.
zh_hans: 由 ``render()`` 方法引发的异常现在会传递给每个中间件的 ``process_exception()`` 方法。

source: Request middleware can now set :attr:`HttpRequest.urlconf <django.http.HttpRequest.urlconf>` to ``None`` to revert any changes made by previous middleware and return to using the :setting:`ROOT_URLCONF`.
id: Permintaan middleware sekarang dapat menyetel :attr:`HttpRequest.urlconf <django.http.HttpRequest.urlconf>` menjadi ``None`` untuk mengembalikan perubahan apapun dibuat oleh middleware sebelumnya dan mengembalikan menggunakan :setting:`ROOT_URLCONF`.
zh_hans: 请求中间件现在可以将 :attr:`HttpRequest.urlconf <django.http.HttpRequest.urlconf>` 设置为 ``None``，以撤销之前中间件所做的任何更改并返回使用 :setting:`ROOT_URLCONF`。

source: The :setting:`DISALLOWED_USER_AGENTS` check in :class:`~django.middleware.common.CommonMiddleware` now raises a :class:`~django.core.exceptions.PermissionDenied` exception as opposed to returning an :class:`~django.http.HttpResponseForbidden` so that :data:`~django.conf.urls.handler403` is invoked.
id: Pemeriksaan :setting:`DISALLOWED_USER_AGENTS` di :class:`~django.middleware.common.CommonMiddleware` sekarang memunculkan sebuah pengecualian :class:`~django.core.exceptions.PermissionDenied` sebagai lawan ke mengembalikan sebuah :class:`~django.http.HttpResponseForbidden` sehingga :data:`~django.conf.urls.handler403` dipanggil.
zh_hans: 在 :class:`~django.middleware.common.CommonMiddleware` 中的 :setting:`DISALLOWED_USER_AGENTS` 检查现在引发 :class:`~django.core.exceptions.PermissionDenied` 异常，而不是返回 :class:`~django.http.HttpResponseForbidden`，以便调用 :data:`~django.conf.urls.handler403`。

source: Added :meth:`HttpRequest.get_port() <django.http.HttpRequest.get_port>` to fetch the originating port of the request.
id: Ditambahkan :meth:`HttpRequest.get_port() <django.http.HttpRequest.get_port>` untuk mengambil port berasal dari permintaan.
zh_hans: 添加了 :meth:`HttpRequest.get_port() <django.http.HttpRequest.get_port>` 方法，用于获取请求的起始端口。

source: Added the ``json_dumps_params`` parameter to :class:`~django.http.JsonResponse` to allow passing keyword arguments to the ``json.dumps()`` call used to generate the response.
id: Ditambahkan parameter ``json_dumps_params`` pada :class:`~django.http.JsonResponse` untuk mengizinkan melewatkan argumen kata kunci ke panggilan ``json.dumps()`` digunakan untuk membangkitkan tanggapan.
zh_hans: 在 :class:`~django.http.JsonResponse` 中添加了 ``json_dumps_params`` 参数，允许将关键字参数传递给用于生成响应的 ``json.dumps()`` 调用。

source: The :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` now ignores 404s when the referer is equal to the requested URL. To circumvent the empty referer check already implemented, some web bots set the referer to the requested URL.
zh_hans: :class:`~django.middleware.common.BrokenLinkEmailsMiddleware` 现在在引用者等于请求的 URL 时忽略 404 错误。为了规避已经实施的空引用检查，一些网络爬虫将引用者设置为请求的 URL。

source: Template tags created with the :meth:`~django.template.Library.simple_tag` helper can now store results in a template variable by using the ``as`` argument.
id: Etiket cetakan dibuat dengan pembantu :meth:`~django.template.Library.simple_tag` sekarang dapat menyimpan hasil dalam sebuah variabel cetakan dengan menggunakan argumen ``as``.
zh_hans: 使用 :meth:`~django.template.Library.simple_tag` 辅助程序创建的模板标签现在可以使用 ``as`` 参数将结果存储在模板变量中。

source: Added a :meth:`Context.setdefault() <django.template.Context.setdefault>` method.
id: Ditambahkan sebuah metode :meth:`Context.setdefault() <django.template.Context.setdefault>`.
zh_hans: 添加了 :meth:`Context.setdefault() <django.template.Context.setdefault>` 方法。

source: The :ref:`django.template <django-template-logger>` logger was added and includes the following messages:
id: Pencatat :ref:`django.template <django-template-logger> telah ditambahkan dan menyertakan pesan berikut:
zh_hans: 添加了 :ref:`django.template <django-template-logger>` 记录器，并包括以下消息：

source: A ``DEBUG`` level message for missing context variables.
id: Pesan tingkatan ``DEBUG`` untuk konteks variabel hilang.
zh_hans: 对于缺少上下文变量的情况，添加了一个 ``DEBUG`` 级别的消息。

source: A ``WARNING`` level message for uncaught exceptions raised during the rendering of an ``{% include %}`` when debug mode is off (helpful since ``{% include %}`` silences the exception and returns an empty string).
id: Sebuah peringatan tingkat ``WARNING`` untuk pengecualian tidak tertangkap dimunculkan selama membangun dari sebuah ``{% include %}`` ketika suasana mencari kesalahan mati (sangat membantu sejak ``{% include %}`` mendiamkan pengecualian dan mengembalikan sebuah string kosong).
zh_hans: 在关闭调试模式时，对于在渲染 ``{% include %}`` 期间引发的未捕获异常，添加了一个 ``WARNING`` 级别的消息（这对于 ``{% include %}`` 会将异常消除并返回空字符串的情况很有帮助）。

source: The :ttag:`firstof` template tag supports storing the output in a variable using 'as'.
id: Etiket cetakan :ttag:`firstof` mengukung menyimpan keluaran di sebuah variabel menggunakan 'as'.
zh_hans: :ttag:`firstof` 模板标签支持使用 'as' 将输出存储在一个变量中。

source: Django template loaders can now extend templates recursively.
id: Pemuat cetakan Django sekarang dapat memperpanjang cetakan berulang.
zh_hans: Django 模板加载器现在可以递归地扩展模板。

source: The debug page template postmortem now include output from each engine that is installed.
zh_hans: 调试页面模板的事后分析现在包括安装的每个引擎的输出。

source: :ref:`Debug page integration <template-debug-integration>` for custom template engines was added.
id: :ref:`Debug page integration <template-debug-integration>` untuk penyesuaian mesin cetakan telah ditambahkan.
zh_hans: 为自定义模板引擎添加了 :ref:`调试页面集成 <template-debug-integration>`。

source: The :class:`~django.template.backends.django.DjangoTemplates` backend gained the ability to register libraries and builtins explicitly through the template :setting:`OPTIONS <TEMPLATES-OPTIONS>`.
id: Backend :class:`~django.template.backends.django.DjangoTemplates` mendapatkan kemampuan untuk mendaftarkan pustaka dan siap pakai secara eksplisit melalui cetakan :setting:`OPTIONS <TEMPLATES-OPTIONS>`.
zh_hans: :class:`~django.template.backends.django.DjangoTemplates` 后端通过模板 :setting:`OPTIONS <TEMPLATES-OPTIONS>` 获得了明确注册库和内置函数的能力。

source: The ``timesince`` and ``timeuntil`` filters were improved to deal with leap years when given large time spans.
id: Penyaring ``timesince`` dan ``timeuntil`` telah diperbaiki untuk berurusan dengan tahun kabisat ketika diberikan jangkauan waktu yang besar.
zh_hans: ``timesince`` 和 ``timeuntil`` 过滤器在处理大时间跨度时进行了改进，以应对闰年。

source: The ``include`` tag now caches parsed templates objects during template rendering, speeding up reuse in places such as for loops.
id: Etiket ``include`` sekarang menyimpan sementara objek cetakan diurai selama membangun cetakan, mempercepat penggunaan kembali seperti untuk perulangan.
zh_hans: ``include`` 标签现在在模板渲染期间缓存解析的模板对象，加快了在诸如 for 循环等地方的重复使用。

source: Added the :meth:`json() <django.test.Response.json>` method to test client responses to give access to the response body as JSON.
id: Ditambahkan metode :meth:`json() <django.test.Response.json>` pada tanggapan klien percobaan untuk memberikan akses ke tanggapan badan sebagai JSON.
zh_hans: 在测试客户端响应中添加了 :meth:`json() <django.test.Response.json>` 方法，以便访问响应体作为 JSON。

source: Added the :meth:`~django.test.Client.force_login()` method to the test client. Use this method to simulate the effect of a user logging into the site while skipping the authentication and verification steps of :meth:`~django.test.Client.login()`.
id: Ditambahkan metode :meth:`~django.test.Client.force_login()` ke klien percobaan. Gunakan metode ini untuk merangsang pengaruh dari pengguna masuk kedalam situs selagi melewati langkah-langkah otentifikasi dan pemeriksaan dari :meth:`~django.test.Client.login()`.
zh_hans: 在测试客户端中添加了 :meth:`~django.test.Client.force_login()` 方法。使用该方法模拟用户登录站点的效果，同时跳过 :meth:`~django.test.Client.login()` 的身份验证和验证步骤。

source: Regular expression lookaround assertions are now allowed in URL patterns.
id: Pernyataan melihat-lihat regular expression sekarang diizinkan di pola URL
zh_hans: URL 模式中现在允许使用正则表达式的环视断言。

source: The application namespace can now be set using an ``app_name`` attribute on the included module or object. It can also be set by passing a 2-tuple of (<list of patterns>, <application namespace>) as the first argument to ``include()``.
id: Namespace aplikasi sekarang dapat disetel menggunakan sebuah atribut ``app_name`` pada modul atau obyek disertakan. Itu juga dapat disetel dengan melewatkan 2-tuple dari (<list of patterns>, <application namespace>) sebagai argumen pertama pada ``include()``.
zh_hans: 应用程序命名空间现在可以通过在包含的模块或对象上设置 ``app_name`` 属性来设置。也可以通过将一个 2 元组（<模式列表>，<应用程序命名空间>）作为 ``include()`` 的第一个参数来设置。

source: System checks have been added for common URL pattern mistakes.
id: Pemeriksaan sistem telah ditambahkan untuk kesalahan corak URL umum.
zh_hans: 已添加了用于检测常见 URL 模式错误的系统检查。

source: Added :func:`django.core.validators.int_list_validator` to generate validators of strings containing integers separated with a custom character.
id: Ditambahkan :func:`django.core.validators.int_list_validator` untuk membangkitkan pengesah dari string mengandung integer terpisah dengan penyesuaian karakter.
zh_hans: 添加了 :func:`django.core.validators.int_list_validator`，用于生成验证包含整数并用自定义字符分隔的字符串的验证器。

source: :class:`~django.core.validators.EmailValidator` now limits the length of domain name labels to 63 characters per :rfc:`1034`.
id: :class:`~django.core.validators.EmailValidator` sekarang membatasi panjang dari label nama ranah menjadi 63 karakter per :rfc:`1034`.
zh_hans: :class:`~django.core.validators.EmailValidator` 现在根据 :rfc:`1034`，限制了域名标签的长度为 63 个字符。

source: Added :func:`~django.core.validators.validate_unicode_slug` to validate slugs that may contain Unicode characters.
id: Ditambahkan :func:`~django.core.validators.validate_unicode_slug` untuk mensahkan siput yang mungkin mengandung karakter Unicode.
zh_hans: 添加了 :func:`~django.core.validators.validate_unicode_slug`，用于验证可能包含 Unicode 字符的 slugs。

source: Backwards incompatible changes in 1.9
id: Perubahan bertentangan kebelakang di 1.9
zh_hans: 1.9 版本中的不向后兼容变更

source: In addition to the changes outlined in this section, be sure to review the :ref:`removed-features-1.9` for the features that have reached the end of their deprecation cycle and therefore been removed. If you haven't updated your code within the deprecation timeline for a given feature, its removal may appear as a backwards incompatible change.
id: Sebagai tambahan pada uraian berubah di bagian ini, pastikan meninjau :ref:`removed-features-1.9` untuk fitur yang telah mencapai akhir dari siklus pengusangan mereka dan karena itu telah dipindahkan. Jika anda belum memperbaharui kode anda dalam linimasa pengusangan untuk fitur diberikan, perpindahan ini mungkin muncul sebagai perubahan ketidaksesuaian kebelakang.
zh_hans: 除了本节中概述的更改之外，请确保查看 :ref:`removed-features-1.9`，了解已经完成弃用周期并因此被移除的功能。如果您没有在给定功能的弃用时间内更新您的代码，其移除可能会被视为不兼容的更改。

source: A couple of new tests rely on the ability of the backend to introspect column defaults (returning the result as ``Field.default``). You can set the ``can_introspect_default`` database feature to ``False`` if your backend doesn't implement this. You may want to review the implementation on the backends that Django includes for reference (:ticket:`24245`).
id: Sepasang percobaan baru bergantung pada kemampuan dari backend untuk mengintrospeksi kolom awalan (mengembalikan hasil sebagai ``Field.default``). Anda dapat menyetel fitur basisdata ``can_introspect_default`` menjadi ``False`` jika backend anda tidak menerapkan ini. Anda mungkin ingin meninjau penerapan pada backend yang Django sertakan untuk acuan (:ticket:`24245`).
zh_hans: 一些新的测试依赖于后端能够自省列的默认值（将结果返回为 ``Field.default``）。如果您的后端没有实现这个功能，您可以将数据库特性 ``can_introspect_default`` 设置为 ``False``。您可能希望参考 Django 包含的后端的实现来进行审查（:ticket:`24245`）。

source: Registering a global adapter or converter at the level of the DB-API module to handle time zone information of :class:`~datetime.datetime` values passed as query parameters or returned as query results on databases that don't support time zones is discouraged. It can conflict with other libraries.
id: Mendaftarkan penyadur global atau perubah pada tingkat dari modul API-DB untuk menangani informasi zona waktu dari nilai-nilai :class:`~datetime.datetime` dilewatkan sebagai parameter permintaan atau dikembalikan sebagai hasil permintaan di basisdata yang tidak mendukung zona waktu adalah kecil. Itu dapat bertentangan dengan pustaka-pustaka lain.
zh_hans: 不鼓励在 DB-API 模块级别注册全局适配器或转换器来处理作为查询参数传递或作为查询结果返回的不支持时区的 :class:`~datetime.datetime` 值的时区信息。这可能会与其他库发生冲突。

source: The recommended way to add a time zone to :class:`~datetime.datetime` values fetched from the database is to register a converter for ``DateTimeField`` in ``DatabaseOperations.get_db_converters()``.
id: Cara yang dianjurkan untuk menambah zona waktu ke nilai-nilai :class:`~datetime.datetime` diambil dari basisdata adalah mendaftarkan perubah untuk ``DateTimeField`` di ``DatabaseOperations.get_db_converters()``.
zh_hans: 向从数据库获取的 :class:`~datetime.datetime` 值添加时区的推荐方法是在 ``DatabaseOperations.get_db_converters()`` 中为 ``DateTimeField`` 注册一个转换器。

source: The ``needs_datetime_string_cast`` database feature was removed. Database backends that set it must register a converter instead, as explained above.
id: Fitur basisdata ``needs_datetime_string_cast`` telah dipindahkan. Backend basisdata yang disetel harus mebdaftarkan perubah sebagai gantinya, seperti dijalankan diatas.
zh_hans: 已移除了 ``needs_datetime_string_cast`` 数据库特性。设置了这个特性的数据库后端必须按照上述说明注册一个转换器。

source: The ``DatabaseOperations.value_to_db_<type>()`` methods were renamed to ``adapt_<type>field_value()`` to mirror the ``convert_<type>field_value()`` methods.
id: Metode ``DatabaseOperations.value_to_db_<type>()`` telah dinamai menjadi ``adapt_<type>field_value()`` untuk mencerminkan metode ``convert_<type>field_value()``.
zh_hans: ``DatabaseOperations.value_to_db_<type>()`` 方法被重命名为 ``adapt_<type>field_value()``，以与 ``convert_<type>field_value()`` 方法保持一致。

source: To use the new ``date`` lookup, third-party database backends may need to implement the ``DatabaseOperations.datetime_cast_date_sql()`` method.
id: Untuk menggunakan pencarian ``date` baru, backend basisdata pihak-ketiga mungkin butuh menerapkan metode ``DatabaseOperations.datetime_cast_date_sql()``.
zh_hans: 要使用新的 ``date`` 查询，第三方数据库后端可能需要实现 ``DatabaseOperations.datetime_cast_date_sql()`` 方法。

source: The ``DatabaseOperations.time_extract_sql()`` method was added. It calls the existing ``date_extract_sql()`` method. This method is overridden by the SQLite backend to add time lookups (hour, minute, second) to :class:`~django.db.models.TimeField`, and may be needed by third-party database backends.
id: Metode ``DatabaseOperations.time_extract_sql()``telah ditambahkan. Dia memanggil metode ``date_extract_sql()`` yang ada. Metode ini ditimpan oleh backend SQLite untuk menambah waktu pencarian (jam, menit, detik) pada :class:`~django.db.models.TimeField`, dan mungkin dibutuhkan oleh backend basisdata pihak-ketiga.
zh_hans: 添加了 ``DatabaseOperations.time_extract_sql()`` 方法。它调用现有的 ``date_extract_sql()`` 方法。SQLite 后端会重写此方法，以向 :class:`~django.db.models.TimeField` 添加时间查询（小时、分钟、秒），第三方数据库后端可能需要实现此方法。

source: The ``DatabaseOperations.datetime_cast_sql()`` method (not to be confused with ``DatabaseOperations.datetime_cast_date_sql()`` mentioned above) has been removed. This method served to format dates on Oracle long before 1.0, but hasn't been overridden by any core backend in years and hasn't been called anywhere in Django's code or tests.
id: Metode ``DatabaseOperations.datetime_cast_sql()`` (jangan bingung dengan ``DatabaseOperations.datetime_cast_date_sql()`` disebutkan diatas) telah dipindahkan. Metode ini melayani untuk membentuk tanggal pada Oracle jauh sebelum 1.0, tetapi itu belum ditimpa oleh backend inti apapun bertahun-tahun dan belum dipanggil dimanapun di kode Django atau percobaan.
zh_hans: 已删除 ``DatabaseOperations.datetime_cast_sql()`` 方法（请不要与上面提到的 ``DatabaseOperations.datetime_cast_date_sql()`` 混淆）。这个方法在很多年前用于在 Oracle 上格式化日期，但很多年来没有被任何核心后端重写，也没有在 Django 代码或测试中被调用过。

source: In order to support test parallelization, you must implement the ``DatabaseCreation._clone_test_db()`` method and set ``DatabaseFeatures.can_clone_databases = True``. You may have to adjust ``DatabaseCreation.get_test_db_clone_settings()``.
id: Untuk mendukung paralelisasi percobaan, anda harus menerapkan metode ``DatabaseCreation._clone_test_db()`` dan setel ``DatabaseFeatures.can_clone_databases = True``. Anda mungkin harus menyesuaikan ``DatabaseCreation.get_test_db_clone_settings()``.
zh_hans: 为了支持测试并行化，您必须实现 ``DatabaseCreation._clone_test_db()`` 方法并设置 ``DatabaseFeatures.can_clone_databases = True``。您可能需要调整 ``DatabaseCreation.get_test_db_clone_settings()``。

source: Default settings that were tuples are now lists
id: Pengaturan awalan yang dimana tuple adalah sekarang daftar.
zh_hans: 原来的默认设置是元组，现在改为列表
