Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Fixed layout of ``ReadOnlyPasswordHashWidget`` (used in the admin's user change page) (:ticket:`28097`).
id: Diperbaiki tata letak dari ``ReadOnlyPasswordHashWidget`` (digunakan dalam halaman rubah pengguna admin) (:ticket:`28097`).
zh_hans: 修复了 ``ReadOnlyPasswordHashWidget`` 的布局（在管理员的用户更改页面中使用） (:ticket:`28097`)。

source: Allowed prefetch calls on managers with custom ``ModelIterable`` subclasses (:ticket:`28096`).
id: Diizinkan mengambil panggilan pada pengelola dengan penyesuaian subkelas ``ModelIterable`` (:ticket:`28096`).
zh_hans: 允许在具有自定义 ``ModelIterable`` 子类的管理器上进行预取调用 (:ticket:`28096`)。

source: Fixed change password link in the ``contrib.auth`` admin for ``el``, ``es_MX``, and ``pt`` translations (:ticket:`28100`).
id: Diperbaiki tautan rubah sandi dalam admin ``contrib.auth``untuk terjemahan ``el``, ``es_MX``, dan ``pt``(:ticket:`28100`).
zh_hans: 修复了 ``contrib.auth`` 管理员中的更改密码链接，适用于 ``el``、``es_MX`` 和 ``pt`` 翻译 (:ticket:`28100`)。

source: Restored the output of the ``class`` attribute in the ``<ul>`` of widgets that use the ``multiple_input.html`` template. This fixes ``ModelAdmin.radio_fields`` with ``admin.HORIZONTAL`` (:ticket:`28059`).
id: Disimpan kembali keluaran dari atribut ``class`` dalam ``1``dari widget yang menggunakan cetakan ``multiple_input.html``. Ini memperbaiki ``ModelAdmin.radio_fields`` dengan ``admin.HORIZONTAL`` (:ticket:`28059`).
zh_hans: 恢复了在使用 ``multiple_input.html`` 模板的小部件的 ``<ul>`` 中的 ``class`` 属性的输出。这修复了使用 ``admin.HORIZONTAL`` 的 ``ModelAdmin.radio_fields`` (:ticket:`28059`)。

source: Fixed crash in ``BaseGeometryWidget.subwidgets()`` (:ticket:`28039`).
id: Diperbaiki kegagalan dalam ``BaseGeometryWidget.subwidgets()`` (:ticket:`28039`).
zh_hans: 修复了 ``BaseGeometryWidget.subwidgets()`` 中的崩溃 (:ticket:`28039`)。

source: Fixed exception reraising in ORM query execution when ``cursor.execute()`` fails and the subsequent ``cursor.close()`` also fails (:ticket:`28091`).
id: Diperbaiki pengecualian memunculkan kembali dalam penjalanan permintaan ORM ketika ``cursor.execute()`` gagal dan yang menyusul ``cursor.close()`` juga gagal (:ticket:`28091`).
zh_hans: 修复了在 ORM 查询执行中，当 ``cursor.execute()`` 失败并且随后的 ``cursor.close()`` 也失败时重新引发异常 (:ticket:`28091`)。

source: Fixed a regression where ``CheckboxSelectMultiple``, ``NullBooleanSelect``, ``RadioSelect``, ``SelectMultiple``, and ``Select`` localized option values (:ticket:`28075`).
id: Diperbaiki pemulihan dimana``CheckboxSelectMultiple``, ``NullBooleanSelect``, ``RadioSelect``, ``SelectMultiple``, dan ``Select`` membatasi nilai pilihan (:ticket:`28075`).
zh_hans: 修复了一个回归问题，其中 ``CheckboxSelectMultiple``、``NullBooleanSelect``、``RadioSelect``、``SelectMultiple`` 和 ``Select`` 的本地化选项值 (:ticket:`28075`)。

source: Corrected the stack level of unordered queryset pagination warnings (:ticket:`28109`).
id: Diperbaiki tingkat susunan dari peringatan halaman queryset tidak berurutan (:ticket:`28109`).
zh_hans: 修正了无序查询集分页警告的堆栈级别 (:ticket:`28109`)。

source: Fixed a regression causing incorrect queries for ``__in`` subquery lookups when models use ``ForeignKey.to_field`` (:ticket:`28101`).
id: Diperbaiki pemulihan menyebabkan permintaan tidak benar untuk untuk pencarian sub permintaan ``__in`` ketika model menggunakan ``ForeignKey.to_field`` (:ticket:`28101`).
zh_hans: 修复了回归问题，当模型使用 ``ForeignKey.to_field`` 时，导致 ``__in`` 子查询查找的查询不正确 (:ticket:`28101`)。

source: Fixed crash when overriding the template of ``django.views.static.directory_index()`` (:ticket:`28122`).
id: Diperbaiki kegagalan ketika menimpa cetakan dari ``django.views.static.directory_index()`` (:ticket:`28122`).
zh_hans: 修复了在重写 ``django.views.static.directory_index()`` 模板时的崩溃问题 (:ticket:`28122`)。

source: Fixed a regression in formset ``min_num`` validation with unchanged forms that have initial data (:ticket:`28130`).
id: Diperbaiki pemulihan dalam formset pengesahan ``min_num``dengan formulir tidak berubah yang mempunyai data awal (:ticket:`28130`).
zh_hans: 修复了在表单集 ``min_num`` 验证中的回归问题，当未更改具有初始数据的表单时 (:ticket:`28130`)。

source: Prepared for ``cx_Oracle`` 6.0 support (:ticket:`28138`).
id: Dipersiapkan untuk dukungan ``cx_Oracle`` 6.0 (:ticket:`28138`).
zh_hans: 准备好支持 ``cx_Oracle`` 6.0 (:ticket:`28138`)。

source: Updated the ``contrib.postgres`` ``SplitArrayWidget`` to use template-based widget rendering (:ticket:`28040`).
id: Diperbaharui ``contrib.postgres`` ``SplitArrayWidget``untuk menggunakan membangun widget berdasarkan-cetakan (:ticket:`28040`).
zh_hans: 更新了 ``contrib.postgres`` 中的 ``SplitArrayWidget``，使用基于模板的小部件渲染 (:ticket:`28040`)。

source: Fixed crash in ``BaseGeometryWidget.get_context()`` when overriding existing ``attrs`` (:ticket:`28105`).
id: Diperbaiki kegagalan dalam ``BaseGeometryWidget.get_context()`` ketika menimpa ``attrs`` yang ada (:ticket:`28105`).
zh_hans: 修复了在覆盖现有 ``attrs`` 时导致的 ``BaseGeometryWidget.get_context()`` 崩溃 (:ticket:`28105`)。

source: Prevented ``AddIndex`` and ``RemoveIndex`` from mutating model state (:ticket:`28043`).
id: Dicegah ``AddIndex`` dan ``RemoveIndex`` dari mengubah keadaan model (:ticket:`28043`).
zh_hans: 阻止了 ``AddIndex`` 和 ``RemoveIndex`` 对模型状态进行更改 (:ticket:`28043`)。

source: Prevented migrations from dropping database indexes from ``Meta.indexes`` when changing ``Field.db_index`` to ``False`` (:ticket:`28052`).
id: Dicegah perpindahan dari menjatuhkan indeks basisdata dari ``Meta.indexes``ketika merubah ``Field.db_index`` menjadi ``False`` (:ticket:`28052`).
zh_hans: 阻止了在将 ``Field.db_index`` 更改为 ``False`` 时，迁移从 ``Meta.indexes`` 中删除数据库索引 (:ticket:`28052`)。

source: Fixed a regression in choice ordering in form fields with grouped and non-grouped options (:ticket:`28157`).
id: Diperbaiki pemulihan dalam urutan pilihan dalam bidang formulir dengan pilihan dikelompokkan dan tidak dikelompopkkan (:ticket:`28157`).
zh_hans: 修复了在具有分组和非分组选项的表单字段中选择顺序的退化问题 (:ticket:`28157`)。

source: Fixed crash in ``BaseInlineFormSet._construct_form()`` when using ``save_as_new`` (:ticket:`28159`).
id: Diperbaiki kegagalan dalam ``BaseInlineFormSet._construct_form()`` ketika menggunakan ``save_as_new`` (:ticket:`28159`).
zh_hans: 修复了在使用 ``save_as_new`` 时导致的 ``BaseInlineFormSet._construct_form()`` 崩溃 (:ticket:`28159`)。

source: Fixed a regression where ``Model._state.db`` wasn't set correctly on multi-table inheritance parent models after saving a child model (:ticket:`28166`).
id: Diperbaiki pemulihan dimana ``Model._state.db`` tidak disetel dengan benar pada model induk warisan banyak-tabel setelah menyimpan model anak (:ticket:`28166`).
zh_hans: 修复了在保存子模型后，多表继承父模型上未正确设置 ``Model._state.db`` 的退化问题 (:ticket:`28166`)。

source: Corrected the return type of ``ArrayField(CITextField())`` values retrieved from the database (:ticket:`28161`).
id: Diperbaiki jenis kembalian dari nilai ``ArrayField(CITextField())`` diambil dari basisdata (:ticket:`28161`).
zh_hans: 已更正从数据库中检索的 ``ArrayField(CITextField())`` 值的返回类型 (:ticket:`28161`)。

source: Fixed ``QuerySet.prefetch_related()`` crash when fetching relations in nested ``Prefetch`` objects (:ticket:`27554`).
id: Diperbaiki kegagalan ``QuerySet.prefetch_related()`` ketika mengambil hubungan dalam obyek ``Prefetch`` bersarang (:ticket:`27554`).
zh_hans: 修复了在获取嵌套的 ``Prefetch`` 对象中的关系时导致的 ``QuerySet.prefetch_related()`` 崩溃问题 (:ticket:`27554`)。

source: Prevented hiding GDAL errors if it's not installed when using ``contrib.gis`` (:ticket:`28160`). (It's a required dependency as of Django 1.11.)
id: Dicegah menyembungikan kesalahan GDAL jika itu tidak dipasang ketika menggunakan ``contrib.gis`` (:ticket:`28160`). (itu mewajibkan ketergantungan sampai Django 1.11.)
zh_hans: 在使用 ``contrib.gis`` 时，防止隐藏 GDAL 错误，如果它未安装的话 (:ticket:`28160`)。 (自 Django 1.11 起，它是一个必需的依赖项。)

source: Fixed a regression causing ``__in`` lookups on a foreign key to fail when using the foreign key's parent model as the lookup value (:ticket:`28175`).
id: Diperbaiki pemulihan menyebabkan pencarian ``__in`` pada foreign key gagal ketika menggunakan model induk foreign key sebagai nilai pencarian (:ticket:`28175`).
zh_hans: 修复了使用外键的父模型作为查找值时导致 ``__in`` 查找失败的退化问题 (:ticket:`28175`)。

source: Django 1.11.10 release notes
id: Catatan terbitan Django 1.11.10
zh_hans: Django 1.11.10 版本发行说明

source: *February 1, 2018*
id: *1 Februari 2018*
zh_hans: *2018 年 2 月 1 日*

source: Django 1.11.10 fixes a security issue and several bugs in 1.11.9.
id: Django 1.11.10 memperbaiki masalah keamanan dan beberapa kesalahan di 1.11.9.
zh_hans: Django 1.11.10 修复了 1.11.9 中的一个安全问题和几个漏洞。

source: CVE-2018-6188: Information leakage in ``AuthenticationForm``
id: CVE-2018-6188: Kebocoran informasi dalam ``AuthenticationForm``
zh_hans: CVE-2018-6188: ``AuthenticationForm`` 中的信息泄露问题

source: A regression in Django 1.11.8 made :class:`~django.contrib.auth.forms.AuthenticationForm` run its ``confirm_login_allowed()`` method even if an incorrect password is entered. This can leak information about a user, depending on what messages ``confirm_login_allowed()`` raises. If ``confirm_login_allowed()`` isn't overridden, an attacker enter an arbitrary username and see if that user has been set to ``is_active=False``. If ``confirm_login_allowed()`` is overridden, more sensitive details could be leaked.
zh_hans: Django 1.11.8 中的一个退化问题导致 :class:`~django.contrib.auth.forms.AuthenticationForm` 即使输入了不正确的密码，也会运行其 ``confirm_login_allowed()`` 方法。这可能会泄露关于用户的信息，具体取决于 ``confirm_login_allowed()`` 引发了什么消息。如果未覆盖 ``confirm_login_allowed()``，攻击者可以输入任意用户名并查看该用户是否已设置为 ``is_active=False``。如果覆盖了 ``confirm_login_allowed()``，则可能会泄露更敏感的详细信息。

source: This issue is fixed with the caveat that ``AuthenticationForm`` can no longer raise the "This account is inactive." error if the authentication backend rejects inactive users (the default authentication backend, ``ModelBackend``, has done that since Django 1.10). This issue will be revisited for Django 2.1 as a fix to address the caveat will likely be too invasive for inclusion in older versions.
zh_hans: 这个问题已经得到修复，但需要注意的是，如果身份验证后端拒绝非活动用户（默认身份验证后端“ModelBackend”自 Django 1.10 起就一直是这样），那么 ``AuthenticationForm`` 不再会引发“此帐户处于非活动状态。”错误。这个问题将在 Django 2.1 中重新审查，因为解决这个问题的修复措施可能对旧版本来说过于侵入性。

source: Fixed incorrect foreign key nullification if a model has two foreign keys to the same model and a target model is deleted (:ticket:`29016`).
zh_hans: 修复了如果一个模型有两个指向同一模型的外键，且目标模型被删除时外键空值化不正确的问题 (:ticket:`29016`)。

source: Fixed a regression where ``contrib.auth.authenticate()`` crashes if an authentication backend doesn't accept ``request`` and a later one does (:ticket:`29071`).
zh_hans: 修复了一个退化问题，即如果身份验证后端不接受 ``request``，而后续的后端接受它，``contrib.auth.authenticate()`` 会崩溃的问题 (:ticket:`29071`)。

source: Fixed crash when entering an invalid uuid in ``ModelAdmin.raw_id_fields`` (:ticket:`29094`).
zh_hans: 修复了在 ``ModelAdmin.raw_id_fields`` 中输入无效 UUID 时导致崩溃的问题 (:ticket:`29094`)。

source: Django 1.11.11 release notes
id: Catatan terbitan Django 1.11.11
zh_hans: Django 1.11.11 版本发行说明

source: *March 6, 2018*
id: *6 Maret 2018*
zh_hans: *2018 年 3 月 6 日*

source: Django 1.11.11 fixes two security issues in 1.11.10.
id: Django 1.11.11 memperbaiki dua masalah keamanan di 1.11.10.
zh_hans: Django 1.11.11 修复了 1.11.10 中的两个安全问题。

source: CVE-2018-7536: Denial-of-service possibility in ``urlize`` and ``urlizetrunc`` template filters
zh_hans: CVE-2018-7536: ``urlize`` 和 ``urlizetrunc`` 模板过滤器中的拒绝服务可能性问题

source: The ``django.utils.html.urlize()`` function was extremely slow to evaluate certain inputs due to catastrophic backtracking vulnerabilities in two regular expressions. The ``urlize()`` function is used to implement the ``urlize`` and ``urlizetrunc`` template filters, which were thus vulnerable.
zh_hans: ``django.utils.html.urlize()`` 函数在处理某些输入时非常慢，这是由于两个正则表达式中的灾难性回溯漏洞引起的。``urlize()`` 函数用于实现 ``urlize`` 和 ``urlizetrunc`` 模板过滤器，因此这两个过滤器也存在漏洞。

source: The problematic regular expressions are replaced with parsing logic that behaves similarly.
zh_hans: 问题正则表达式被替换为具有相似行为的解析逻辑。

source: CVE-2018-7537: Denial-of-service possibility in ``truncatechars_html`` and ``truncatewords_html`` template filters
zh_hans: CVE-2018-7537: ``truncatechars_html`` 和 ``truncatewords_html`` 模板过滤器中存在拒绝服务可能性问题。

source: If ``django.utils.text.Truncator``'s ``chars()`` and ``words()`` methods were passed the ``html=True`` argument, they were extremely slow to evaluate certain inputs due to a catastrophic backtracking vulnerability in a regular expression. The ``chars()`` and ``words()`` methods are used to implement the ``truncatechars_html`` and ``truncatewords_html`` template filters, which were thus vulnerable.
zh_hans: 如果给 ``django.utils.text.Truncator`` 的 ``chars()`` 和 ``words()`` 方法传递了 ``html=True`` 参数，由于正则表达式中的灾难性回溯漏洞，它们在处理某些输入时非常慢。``chars()`` 和 ``words()`` 方法用于实现 ``truncatechars_html`` 和 ``truncatewords_html`` 模板过滤器，因此这两个过滤器也存在漏洞。

source: The backtracking problem in the regular expression is fixed.
zh_hans: 正则表达式中的回溯问题已经修复。

source: Django 1.11.12 release notes
id: Catatan terbitan Django 1.11.12
zh_hans: Django 1.11.12 版本发行说明

source: *April 2, 2018*
id: *2 April 2018*
zh_hans: *2018 年 4 月 2 日*

source: Django 1.11.12 fixes two bugs in 1.11.11.
id: Django 1.11.12 memperbaiki dua kesalahan yang ada pada 1.11.11.
zh_hans: Django 1.11.12 修复了 1.11.11 中的两个漏洞。

source: Fixed a regression in Django 1.11.8 where combining two annotated ``values_list()`` querysets with ``union()``, ``difference()``, or ``intersection()`` crashed due to mismatching columns (:ticket:`29229`).
zh_hans: 修复了在 Django 1.11.8 中的一个退化问题，即将两个经过注释的 ``values_list()`` 查询集与 ``union()``, ``difference()`` 或 ``intersection()`` 结合时因列不匹配而导致崩溃的问题 (:ticket:`29229`)。

source: Fixed a regression in Django 1.11 where an empty choice could be initially selected for the ``SelectMultiple`` and ``CheckboxSelectMultiple`` widgets (:ticket:`29273`).
zh_hans: 修复了 Django 1.11 中的一个退化问题，即对于 ``SelectMultiple`` 和 ``CheckboxSelectMultiple`` 小部件，初始情况下可以选择一个空的选项 (:ticket:`29273`)。

source: Django 1.11.13 release notes
id: Catatan rilis Django 1.11.13
zh_hans: Django 1.11.13 版本发行说明

source: *May 1, 2018*
id: *1 Mei 2018*
zh_hans: *2018 年 5 月 1 日*

source: Django 1.11.13 fixes several bugs in 1.11.12.
id: Django 1.11.13 memperbaiki beberapa kesalahan yang ada pada 1.11.12.
zh_hans: Django 1.11.13 修复了 1.11.12 中的几个漏洞。

source: Fixed a regression in Django 1.11.8 where altering a field with a unique constraint may drop and rebuild more foreign keys than necessary (:ticket:`29193`).
zh_hans: 修复了 Django 1.11.8 中的一个退化问题，即更改具有唯一约束的字段可能会删除和重建比必要更多的外键 (:ticket:`29193`)。

source: Fixed crashes in ``django.contrib.admindocs`` when a view is a callable object, such as ``django.contrib.syndication.views.Feed`` (:ticket:`29296`).
zh_hans: 修复了在 ``django.contrib.admindocs`` 中当一个视图是可调用对象（例如 ``django.contrib.syndication.views.Feed``）时导致崩溃的问题 (:ticket:`29296`)。

source: Fixed a regression in Django 1.11.12 where ``QuerySet.values()`` or ``values_list()`` after combining an annotated and unannotated queryset with ``union()``, ``difference()``, or ``intersection()`` crashed due to mismatching columns (:ticket:`29286`).
zh_hans: 修复了 Django 1.11.12 中的一个退化问题，即在使用 ``union()``, ``difference()`` 或 ``intersection()`` 合并了一个经过注释和未经注释的查询集后，调用 ``QuerySet.values()`` 或 ``values_list()`` 导致由于列不匹配而崩溃的问题 (:ticket:`29286`)。

source: Django 1.11.14 release notes
id: Catatan terbitan Django 1.11.14
zh_hans: Django 1.11.14 版本发行说明

source: *July 2, 2018*
id: *2 Juli 2018*
zh_hans: *2018 年 7 月 2 日*

source: Django 1.11.14 fixes several bugs in 1.11.13.
id: Django 1.11.14 memperbaiki beberapa kesalahan yang ada pada 1.11.13.
zh_hans: Django 1.11.14 修复了 1.11.13 中的几个漏洞。

source: Fixed ``WKBWriter.write()`` and ``write_hex()`` for empty polygons on GEOS 3.6.1+ (:ticket:`29460`).
zh_hans: 修复了 GEOS 3.6.1+ 上的空多边形情况下的 ``WKBWriter.write()`` 和 ``write_hex()`` 方法 (:ticket:`29460`)。

source: Fixed a regression in Django 1.10 that could result in large memory usage when making edits using ``ModelAdmin.list_editable`` (:ticket:`28462`).
zh_hans: 修复了 Django 1.10 中的一个退化问题，可能导致在使用 ``ModelAdmin.list_editable`` 进行编辑时出现大内存使用的问题 (:ticket:`28462`)。

source: Django 1.11.15 release notes
id: Catatan terbitan Django 1.11.15
zh_hans: Django 1.11.15 版本发行说明

source: *August 1, 2018*
id: *1 Agustus 2018*
zh_hans: *2018 年 8 月 1 日*

source: Django 1.11.15 fixes a security issue in 1.11.14.
id: Django 1.11.15 memperbaiki masalah keamanan di 1.11.14.
zh_hans: Django 1.11.15 修复了 1.11.14 中的一个安全问题。

source: CVE-2018-14574: Open redirect possibility in ``CommonMiddleware``
zh_hans: CVE-2018-14574: ``CommonMiddleware`` 中存在开放重定向漏洞的可能性。

source: If the :class:`~django.middleware.common.CommonMiddleware` and the :setting:`APPEND_SLASH` setting are both enabled, and if the project has a URL pattern that accepts any path ending in a slash (many content management systems have such a pattern), then a request to a maliciously crafted URL of that site could lead to a redirect to another site, enabling phishing and other attacks.
zh_hans: 如果同时启用了 :class:`~django.middleware.common.CommonMiddleware` 和 :setting:`APPEND_SLASH` 设置，并且项目具有接受以斜杠结尾的任何路径的 URL 模式（许多内容管理系统都有这样的模式），那么对站点的恶意构造的 URL 的请求可能会导致重定向到另一个站点，从而可能启用钓鱼和其他攻击。

source: ``CommonMiddleware`` now escapes leading slashes to prevent redirects to other domains.
zh_hans: 现在，``CommonMiddleware`` 对于防止重定向到其他域的情况会转义开头的斜杠。

source: Django 1.11.16 release notes
id: Catatan terbitan Django 1.11.16
zh_hans: Django 1.11.16 版本发行说明

source: *October 1, 2018*
zh_hans: *2018 年 10 月 1 日*

source: Django 1.11.16 fixes a data loss bug in 1.11.15.
id: Django 1.11.16 memperbaiki kesalahan kehilangan data di 1.11.15.
zh_hans: Django 1.11.16 修复了 1.11.15 中的一个数据丢失漏洞。

source: Fixed a race condition in ``QuerySet.update_or_create()`` that could result in data loss (:ticket:`29499`).
zh_hans: 修复了 ``QuerySet.update_or_create()`` 中的竞态条件，可能导致数据丢失的问题 (:ticket:`29499`)。

source: Django 1.11.17 release notes
zh_hans: Django 1.11.17 版本发行说明

source: *December 3, 2018*
zh_hans: *2018 年 12 月 3 日*

source: Django 1.11.17 fixes several bugs in 1.11.16 and adds compatibility with Python 3.7.
zh_hans: Django 1.11.17 修复了 1.11.16 中的几个漏洞，并增加了对 Python 3.7 的兼容性。

source: Prevented repetitive calls to ``geos_version_tuple()`` in the ``WKBWriter`` class in an attempt to fix a random crash involving ``LooseVersion`` since Django 1.11.14 (:ticket:`29959`).
zh_hans: 为了尝试解决自 Django 1.11.14 以来涉及 ``LooseVersion`` 的随机崩溃问题，阻止了对 ``WKBWriter`` 类中的 ``geos_version_tuple()`` 的重复调用 (:ticket:`29959`)。

source: Django 1.11.18 release notes
zh_hans: Django 1.11.18 版本发行说明

source: *January 4, 2019*
zh_hans: *2019 年 1 月 4 日*

source: Django 1.11.18 fixes a security issue in 1.11.17.
zh_hans: Django 1.11.18 修复了 1.11.17 中的一个安全问题。

source: CVE-2019-3498: Content spoofing possibility in the default 404 page
zh_hans: CVE- 2019-3498 ：默认 404 页面中的内容欺骗可能性

source: An attacker could craft a malicious URL that could make spoofed content appear on the default page generated by the ``django.views.defaults.page_not_found()`` view.
zh_hans: 攻击者可以构造恶意 URL，使伪造的内容出现在由 ``django.views.defaults.page_not_found()`` 视图生成的默认页面上。

source: The URL path is no longer displayed in the default 404 template and the ``request_path`` context variable is now quoted to fix the issue for custom templates that use the path.
zh_hans: 默认的 404 模板中不再显示 URL 路径，并且 ``request_path`` 上下文变量现在被引用起来，以解决使用路径的自定义模板的问题。

source: Django 1.11.19 release notes
zh_hans: Django 1.11.19 版本发行说明

source: *February 11, 2019*
zh_hans: *2019 年 2 月 11 日*

source: Django 1.11.19 fixes a security issue in 1.11.18.
zh_hans: Django 1.11.19 修复了 1.11.18 中的一个安全问题。

source: CVE-2019-6975: Memory exhaustion in ``django.utils.numberformat.format()``
zh_hans: CVE-2019-6975: ``django.utils.numberformat.format()`` 中的内存耗尽问题。

source: If ``django.utils.numberformat.format()`` -- used by ``contrib.admin`` as well as the ``floatformat``, ``filesizeformat``, and ``intcomma`` templates filters -- received a ``Decimal`` with a large number of digits or a large exponent, it could lead to significant memory usage due to a call to ``'{:f}'.format()``.
zh_hans: 如果 ``django.utils.numberformat.format()`` -- 被 ``contrib.admin`` 以及 ``floatformat``、``filesizeformat`` 和 ``intcomma`` 模板过滤器使用 -- 收到具有大量数字或大指数的 ``Decimal``，它可能会导致由于调用 ``'{:f}'.format()`` 而导致显著的内存使用。

source: To avoid this, decimals with more than 200 digits are now formatted using scientific notation.
zh_hans: 为避免这种情况，现在使用科学记数法格式化超过 200 位数的小数。

source: Django 1.11.2 release notes
id: Catatan terbitan Django 1.11.2
zh_hans: Django 1.11.2 版本发行说明

source: *June 1, 2017*
id: *1 Juni 2017*
zh_hans: *2017 年 6 月 1 日*

source: Django 1.11.2 adds a minor feature and fixes several bugs in 1.11.1. Also, the latest string translations from Transifex are incorporated.
id: Django 1.11.2 menambahkan fitur kecil dan memperbaiki beberapa kesalahan dalam 1.11.1. Juga, terjemahan string terakhir dari Transifexdigabung.
zh_hans: Django 1.11.2 在 1.11.1 的基础上增加了一个小功能，并修复了一些错误。此外，还整合了来自 Transifex 的最新字符串翻译。

source: Minor feature
id: Fitur kecil
zh_hans: 次要特性

source: The new ``LiveServerTestCase.port`` attribute reallows the use case of binding to a specific port following the :ref:`bind to port zero <liveservertestcase-port-zero-change>` change in Django 1.11.
id: Atribut ``LiveServerTestCase.port`` baru mengizikan kembali penggunaan kasus dari mengikat port tertentu mengikuti :ref:`bind to port zero 1`dirubah dalam Django 1.11.
zh_hans: 新的 ``LiveServerTestCase.port`` 属性重新允许绑定到特定端口的用例，这是自 Django 1.11 中的 :ref:`绑定到零端口 <liveservertestcase-port-zero-change>` 更改后的情况。

source: Added detection for GDAL 2.1 and 2.0, and removed detection for unsupported versions 1.7 and 1.8 (:ticket:`28181`).
id: Ditambahkan pengenalan untuk GDAL 2.1 dan 2.0, dan dipindahkan pengenalan untuk versi tidak didukung 1.7 dan 1.8 (:ticket:`28181`).
zh_hans: 已添加对 GDAL 2.1 和 2.0 的检测，并移除了不支持的版本 1.7 和 1.8 的检测 (:ticket:`28181`)。

source: Changed ``contrib.gis`` to raise ``ImproperlyConfigured`` rather than ``GDALException`` if ``gdal`` isn't installed, to allow third-party apps to catch that exception (:ticket:`28178`).
id: Dirubah ``contrib.gis`` untuk memunculkan ``ImproperlyConfigured`` daripada ``GDALException`` jika ``gdal`` tidak terpasang, untuk mengizinkan aplikasi pihak-ketiga untuk menangkap pengecualian itu (:ticket:`28178`).
zh_hans: 已更改 ``contrib.gis``，如果未安装 ``gdal``，则引发 ``ImproperlyConfigured`` 而不是 ``GDALException``，以允许第三方应用程序捕获该异常 (:ticket:`28178`)。

source: Fixed ``django.utils.http.is_safe_url()`` crash on invalid IPv6 URLs (:ticket:`28142`).
id: Diperbaiki kegagalan ``django.utils.http.is_safe_url()`` pada URL IPv6 tidak sah (:ticket:`28142`).
zh_hans: 修复了在无效的 IPv6 URL 上导致 ``django.utils.http.is_safe_url()`` 崩溃的问题 (:ticket:`28142`)。

source: Fixed regression causing pickling of model fields to crash (:ticket:`28188`).
id: Diperbaiki pemulihan menyebabkan pickle dari bidang model untuk kegagalan (:ticket:`28188`).
zh_hans: 修复了导致模型字段的 pickle 操作崩溃的退化问题 (:ticket:`28188`)。

source: Fixed ``django.contrib.auth.authenticate()`` when multiple authentication backends don't accept a positional ``request`` argument (:ticket:`28207`).
id: Diperbaiki ``django.contrib.auth.authenticate()`` ketika banyak backend autentifikasi tidak menerima sebuah argumen ``request`` penempatan (:ticket:`28207`).
zh_hans: 修复了 ``django.contrib.auth.authenticate()`` 当多个身份验证后端不接受位置参数的 ``request`` 时的问题 (:ticket:`28207`)。

source: Fixed introspection of index field ordering on PostgreSQL (:ticket:`28197`).
id: Diperbaiki interospeksi dari pengurutan bidang indeks pada PostgreSQL (:ticket:`28197`).
zh_hans: 修复了对 PostgreSQL 上索引字段排序的内省问题 (:ticket:`28197`)。
