Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Customizable syntax highlighting
id: Penyorotan sintaksis disesuaikan
zh_hans: 可定制的语法高亮

source: You can now use a :envvar:`DJANGO_COLORS` environment variable to modify or disable the colors used by ``django-admin.py`` to provide :ref:`syntax highlighting <syntax-coloring>`.
zh_hans: 现在，你可以使用 :envvar:`DJANGO_COLORS` 环境变量来修改或禁用 ``django-admin.py`` 用于提供 :ref:`语法高亮 <syntax-coloring>` 的颜色。

source: Syndication feeds as views
id: Umpan perkongsian sebagai tampilan
zh_hans: 将聚合订阅作为视图

source: :doc:`Syndication feeds </ref/contrib/syndication>` can now be used directly as views in your :doc:`URLconf </topics/http/urls>`. This means that you can maintain complete control over the URL structure of your feeds. Like any other view, feeds views are passed a ``request`` object, so you can do anything you would normally do with a view, like user based access control, or making a feed a named URL.
id: :doc:`Syndication feeds </ref/contrib/syndication>` sekarang dapat digunakan secara langsung sebagai tampilan dalam :doc:`URLconf </topics/http/urls>` anda. Ini berarti bahwa anda dapat merawat kendali sepenuhnya terhadap struktur URL dari umpan anda. Seperti tampilan lainnya, tampilan umpan melewatkan obyek ``request``, jadi anda dapat melakukan apapun anda akan lalukan secara biasa dengan tampilan, seperti kendali akses berdasarkan pengguna, atau membuat sebuah umpan URL dinamai.
zh_hans: :doc:`Syndication feeds </ref/contrib/syndication>` 现在可以直接用作你的 :doc:`URLconf </topics/http/urls>` 中的视图。这意味着你可以完全控制你的 feeds 的 URL 结构。与任何其他视图一样，feeds 视图会传递一个 ``request`` 对象，因此你可以像处理常规视图一样进行操作，如基于用户的访问控制，或将 feed 作为具名 URL。

source: The most significant new feature for :doc:`GeoDjango </ref/contrib/gis/index>` in 1.2 is support for multiple spatial databases. As a result, the following :ref:`spatial database backends <spatial-backends>` are now included:
id: Fitur baru paling penting dari :doc:`GeoDjango </ref/contrib/gis/index>` di 1.2 adalah mendukung untuk banyak basisdata spasial. Sebagai hasilnya, :ref:`spatial database backends <spatial-backends>` berikut sekarang disertakan:
zh_hans: 在 1.2 版本中，对于 :doc:`GeoDjango </ref/contrib/gis/index>` 最重要的新功能之一是对多个空间数据库的支持。因此，现在包括了以下 :ref:`空间数据库后端 <spatial-backends>`：

source: GeoDjango now supports the rich capabilities added in the PostGIS 1.5 release. New features include support for the :ref:`geography type <geography-type>` and enabling of :ref:`distance queries <distance-queries>` with non-point geometries on geographic coordinate systems.
id: GeoDjango sekarang mendukung kemampuan kaya ditambahkan di terbitan PostGIS 1.5. Fitur baru termasuk dukungan untuk :ref:`geography type <geography-type>` dan mengadakan :ref:`distance queries <distance-queries>` dengan geometri tidak-bertitik pada sistem kordinat geografis.
zh_hans: GeoDjango 现在支持 PostGIS 1.5 发布中添加的丰富功能。新功能包括对 :ref:`geography 类型 <geography-type>` 的支持，并在地理坐标系统上启用了对非点几何图形的 :ref:`距离查询 <distance-queries>`。

source: Support for 3D geometry fields was added, and may be enabled by setting the :attr:`~django.contrib.gis.db.models.GeometryField.dim` keyword to 3 in your :class:`~django.contrib.gis.db.models.GeometryField`. The :class:`~django.contrib.gis.db.models.Extent3D` aggregate and ``extent3d()`` ``GeoQuerySet`` method were added as a part of this feature.
id: Dukungan untuk bidang geometri 3D telah ditambahkan, dan mungkin diadakan dengan mengatur kata kunci :attr:`~django.contrib.gis.db.models.GeometryField.dim` menjadi 3 di :class:`~django.contrib.gis.db.models.GeometryField` anda. Kumpulan :class:`~django.contrib.gis.db.models.Extent3D` dan metode ``extent3d()`` ``GeoQuerySet`` telah ditambahkan sebagai bagian dari fitur ini.
zh_hans: 已添加对 3D 几何字段的支持，可以通过在 :class:`~django.contrib.gis.db.models.GeometryField` 中设置 :attr:`~django.contrib.gis.db.models.GeometryField.dim` 关键字为 3 来启用。作为此功能的一部分，还添加了 :class:`~django.contrib.gis.db.models.Extent3D` 聚合和 ``extent3d()`` ``GeoQuerySet`` 方法。

source: The ``force_rhr()``, ``reverse_geom()``, and ``geohash()`` ``GeoQuerySet`` methods are new.
id: Metode-metode ``GeoQuerySet`` ``force_rhr()``, ``reverse_geom()``, dan ``geohash()`` adalah baru.
zh_hans: 新添加了 ``force_rhr()``、``reverse_geom()`` 和 ``geohash()`` ``GeoQuerySet`` 方法。

source: The GEOS interface was updated to use thread-safe C library functions when available on the platform.
id: Antarmuka GEOS telah diperbaharui untuk menggunakan fungsi pustaka C thread-safe ketika tersedia pada serambi.
zh_hans: 当平台支持时，更新了 GEOS 接口以使用线程安全的 C 库函数。

source: The GDAL interface now allows the user to set a :attr:`~django.contrib.gis.gdal.Layer.spatial_filter` on the features returned when iterating over a :class:`~django.contrib.gis.gdal.Layer`.
id: Antarmuka GDAL sekarang mengizinkan pengguna untuk menyetel :attr:`~django.contrib.gis.gdal.Layer.spatial_filter` pada fitur-fitur dikembalikan ketika berputar terhadap :class:`~django.contrib.gis.gdal.Layer`.
zh_hans: GDAL 接口现在允许用户在迭代 :class:`~django.contrib.gis.gdal.Layer` 时设置 :attr:`~django.contrib.gis.gdal.Layer.spatial_filter`，以过滤返回的要素。

source: Finally, :doc:`GeoDjango's documentation </ref/contrib/gis/index>` is now included with Django's and is no longer hosted separately at ``geodjango.org``.
zh_hans: 最后，:doc:`GeoDjango 的文档 </ref/contrib/gis/index>` 现在已经与 Django 的文档一起包括在内，不再单独托管在 ``geodjango.org`` 上。

source: JavaScript-assisted handling of inline related objects in the admin
id: Penanganan dibantu-JavaScript dari obyek terhubung berderet di admin
zh_hans: 在管理中使用 JavaScript 辅助处理内联相关对象。

source: If a user has JavaScript enabled in their browser, the interface for inline objects in the admin now allows inline objects to be dynamically added and removed. Users without JavaScript-enabled browsers will see no change in the behavior of inline objects.
id: Jika pengguna mempunyai JavaScript diadakan di peramban mereka, antarmuka untuk obyek berderet di admin sekarang mengizinkan obyek berderet untuk secara dinamis ditambahkan dan dipindahkan. Pengguna tanpa perambah diadakan-JavaScript akan melihat tidak ada perubahan di perilaku dari obyek berderet.
zh_hans: 如果用户的浏览器启用了 JavaScript，则管理中内联对象的界面现在允许动态添加和删除内联对象。没有启用 JavaScript 的浏览器的用户将不会看到内联对象行为的任何变化。

source: New ``now`` template tag format specifier characters: ``c`` and ``u``
id: Bentuk etiket cetakan ``Now`` baru menentukan karakter: ``c`` dan ``u``
zh_hans: 新的 ``now`` 模板标签格式说明符字符：``c`` 和 ``u``

source: The argument to the :ttag:`now` has gained two new format characters: ``c`` to specify that a datetime value should be formatted in ISO 8601 format, and ``u`` that allows output of the microseconds part of a datetime or time value.
id: Argumen pada :ttag:`now` telah mendapatkan dua bentuk karakter baru: ``c`` untuk menentukan bahwa nilai tanggal waktu harus dibentukkan dalam bentuk ISO 8601, dan ``u`` yang mengizinkan keluaran dari bagian mikrodetik dari nilai tanggal waktu atau waktu.
zh_hans: :ttag:`now` 的参数新增了两个新的格式字符：``c`` 用于指定将日期时间值格式化为 ISO 8601 格式，``u`` 允许输出日期时间或时间值的微秒部分。

source: These are also available in others parts like the :tfilter:`date` and :tfilter:`time` template filters, the ``humanize`` template tag library and the new `format localization`_ framework.
id: Ini juga tersedia di bagian lain seperti tfilter:`date` dan :tfilter:`time` template filters, pustaka etiket cetakan ``humanize`` dan kerangka kerja `format localization`_ baru.
zh_hans: 这些新格式字符也在其他地方可用，如 :tfilter:`date` 和 :tfilter:`time` 模板过滤器、``humanize`` 模板标签库以及新的 `格式本地化`_ 框架。

source: Backwards-incompatible changes in 1.2
id: Perubahan bertentangan kebelakang di 1.2
zh_hans: 1.2 版本中的不向后兼容的更改。

source: Wherever possible the new features above have been introduced in a backwards-compatible manner per :doc:`our API stability policy </misc/api-stability>` policy. This means that practically all existing code which worked with Django 1.1 will continue to work with Django 1.2; such code will, however, begin issuing warnings (see below for details).
id: Dimanapun memungkinkan fitur baru diatas telah diperkenalkan dalam sikap kesesuaian kebelakang per kebijakan :doc:`our API stability policy </misc/api-stability>`. Ini berarti bahwa sebenarnya semua kode yang ada yang bekerja dengan Django 1.1 akan berlanjut bekerja dengan Django 1.2; kode itu akan, bagaimanapun, mulai menerbitkan peringatan (lihat dibaah untuk rincian).
zh_hans: 在可能的情况下，上述新功能均以向后兼容的方式引入，遵循 :doc:`我们的 API 稳定性政策 </misc/api-stability>`。这意味着几乎所有与 Django 1.1 兼容的现有代码都将继续适用于 Django 1.2 版本；然而，这样的代码将开始发出警告（详情见下文）。

source: However, a handful of features *have* changed in ways that, for some users, will be immediately backwards-incompatible. Those changes are detailed below.
id: Bagaimanapun, segenggam dari fitur-fitur *telah* berubah di cara-cara itu, untuk beberapa pengguna, akan segera ketidaksesuaian kebelakang. Perubahan-perubahan tersebut dirinci dibawah.
zh_hans: 然而，有一些功能确实以一种对某些用户来说立即不向后兼容的方式发生了变化。这些变化将在下面详细说明。

source: CSRF Protection
id: Proteksi CSRF
zh_hans: CSRF 保护。

source: We've made large changes to the way CSRF protection works, detailed in :doc:`the CSRF documentation </ref/csrf>`. Here are the major changes you should be aware of:
id: Kami telah membuat perubahan besar pada cara perlindungan CSRF bekerja, rincian di :doc:`the CSRF documentation </ref/csrf>`. Ini adalah perubahan utama anda harus sadari:
zh_hans: 我们对 CSRF 保护的工作方式进行了重大改变，详细信息请参阅 :doc:`CSRF 文档 </ref/csrf>`。以下是你应该注意的主要变化：

source: ``CsrfResponseMiddleware`` and ``CsrfMiddleware`` have been deprecated and will be removed completely in Django 1.4, in favor of a template tag that should be inserted into forms.
id: ``CsrfResponseMiddleware`` dan ``CsrfMiddleware`` telah diusangkan dan akan dipindahkan sepenuhnya di Django 1.4, dalam mendukung dari etiket cetakan yang harus dimasukkan kedalam formulir.
zh_hans: ``CsrfResponseMiddleware`` 和 ``CsrfMiddleware`` 已被弃用，并将在 Django 1.4 中完全删除，取而代之的是应该插入到表单中的模板标签。

source: All contrib apps use a ``csrf_protect`` decorator to protect the view. This requires the use of the ``csrf_token`` template tag in the template. If you have used custom templates for contrib views, you MUST READ THE UPGRADE INSTRUCTIONS to fix those templates.
id: Semua aplikasi bantuan menggunakan penghias ``csrf_protect`` untuk melindungi tampilan. Ini mewajibkan penggunaan dari etiket cetakan ``csrf_token`` di cetakan. Jika anda telah menggunakan cetakan penyesuaian untuk tampilan bantuan, anda HARUS MEMBACA PERINTAH PENINGKATAN untuk memperbaiki cetakan tersebut.
zh_hans: 所有的 contrib 应用都使用了一个 ``csrf_protect`` 装饰器来保护视图。这需要在模板中使用 ``csrf_token`` 模板标签。如果你已经使用了自定义模板来定制 contrib 视图，你必须阅读升级说明来修复这些模板。

source: Documentation removed
id: Dokumentasi dipindahkan
zh_hans: 已删除文档

source: The upgrade notes have been removed in current Django docs. Please refer to the docs for Django 1.3 or older to find these instructions.
id: Catatan peningkatan telah dipindahkan di dokumen Django saat ini. Silahkan mengacu ke dokumen untuk Django 1.3 atau lebih lama untuk menemukan perintah-perintah ini.
zh_hans: 当前 Django 文档中已删除了升级说明。请参考 Django 1.3 或更早版本的文档以查找这些说明。

source: ``CsrfViewMiddleware`` is included in ``MIDDLEWARE_CLASSES`` by default. This turns on CSRF protection by default, so views that accept POST requests need to be written to work with the middleware. Instructions on how to do this are found in the CSRF docs.
id: ``CsrfViewMiddleware`` disertakan dalam ``MIDDLEWARE_CLASSES`` secara awalan. Ini mengubah perlindungan CSRF secara awalan, sehingga tampilan yang menerima permintaan POST butuh ditulis untuk bekerja dengan middleware. Petunjuk-petunjuk pada bagaimana melakukan ini ditemukan dalam dokumen CSRF.
zh_hans: ``CsrfViewMiddleware`` 默认包含在 ``MIDDLEWARE_CLASSES`` 中。这默认启用了 CSRF 保护，因此接受 POST 请求的视图需要编写以与中间件一起使用。如何做到这一点的说明可以在 CSRF 文档中找到。

source: All of the CSRF has moved from contrib to core (with backwards compatible imports in the old locations, which are deprecated and will cease to be supported in Django 1.4).
id: Semua CSRF telah dipindahkan dari bantuan ke inti (dengan impor kesesuaian kebelakang di tempat lama, yang diusangkan dan akan berhenti didukung di Django 1.4).
zh_hans: 所有的 CSRF 已经从 contrib 转移到了核心（在旧的位置有向后兼容的导入，这些导入已被弃用，并将在 Django 1.4 中停止支持）。

source: ``get_db_prep_*()`` methods on ``Field``
id: Metode ``get_db_prep_*()`` pada ``Field``
zh_hans: ``Field`` 上的 ``get_db_prep_*()`` 方法

source: Prior to Django 1.2, a custom ``Field`` had the option of defining several functions to support conversion of Python values into database-compatible values. A custom field might look something like::
id: Sebelum DJango 1.2, ``Field`` penyesuaian mempunyai pilihan dari menentukan beberapa fungsi untuk mendukung perubahan dari nilai-nilai Python kedalam nilai-nilai basisdata-sesuai. Bidang penyesuaian mungkin terlihat seperti::
zh_hans: 在 Django 1.2 之前，自定义的 ``Field`` 可以定义多个函数，用于将 Python 值转换为与数据库兼容的值。一个自定义字段可能如下所示：

source: In 1.2, these three methods have undergone a change in prototype, and two extra methods have been introduced::
id: Di 1.2, ketiga metode ini telah menjalani perubahan di purwa rupa, dan dua tambahan metode telah diperkenalkan:
zh_hans: 在 1.2 版本中，这三种方法的原型发生了变化，还引入了两种额外的方法：

source: These changes are required to support multiple databases -- ``db_type`` and ``get_db_prep_*`` can no longer make any assumptions regarding the database for which it is preparing. The ``connection`` argument now provides the preparation methods with the specific connection for which the value is being prepared.
id: Perubahan ini dibutuhkan untuk mendukuna banyak basisdata -- ``db_type`` dan ``get_db_prep_*`` dapat tidak lagi membuat perandaian apapun mengenai basisdata untuk dimana itu dipersiapkan. Argumen ``connection`` sekarang menyediakan metode persiapan dengan hubungan khusus untuk nilai mana sedang dipesiapkan.
zh_hans: 这些更改是为了支持多个数据库 - ``db_type`` 和 ``get_db_prep_*`` 不能再对其准备的数据库做任何假设。现在，``connection`` 参数为准备方法提供了特定的连接，用于准备该值。

source: The two new methods exist to differentiate general data-preparation requirements from requirements that are database-specific. The ``prepared`` argument is used to indicate to the database-preparation methods whether generic value preparation has been performed. If an unprepared (i.e., ``prepared=False``) value is provided to the ``get_db_prep_*()`` calls, they should invoke the corresponding ``get_prep_*()`` calls to perform generic data preparation.
id: Dua metode baru yang ada untuk membedakan persyaratan persiapan-data umum dari persyaratan yang merupakan basisdata-khusus. Argumen ``prepared`` digunakan untuk menunjukkan pada metode persiapan-basisdata apakah persiapan nilai umum telah dilakukan. Jika nilai tidak dipersiapkan (yaitu ``prepared=False``) disediakan pada panggilan ``get_db_prep_*()``, mereka harus meminta panggilan ``get_prep_*()`` yang sesuai untuk melakukan persiapan data umum.
zh_hans: 这两个新方法的存在是为了区分通用的数据准备需求和特定于数据库的需求。``prepared`` 参数用于指示数据库准备方法是否已执行通用值准备。如果将未准备好的值（即 ``prepared=False``）提供给 ``get_db_prep_*()`` 调用，它们应该调用相应的 ``get_prep_*()`` 调用来执行通用数据准备。

source: We've provided conversion functions that will transparently convert functions adhering to the old prototype into functions compatible with the new prototype. However, these conversion functions will be removed in Django 1.4, so you should upgrade your ``Field`` definitions to use the new prototype as soon as possible.
id: Kami telah menyediakan fungsi perubahan yang akan secara terbuka merubah fungsi berpegang pada purwa rupa lama kedalam fungsi sesuai dengan purwa rupa baru. Bagimanapun, fungsi perubahan ini akan dipindahkan di Django 1.4, jadi anda harus meningkatkan pengertian ``Field`` anda untuk menggunakan purwa rupa baru secepat mungkin.
zh_hans: 我们提供了转换函数，可以将符合旧原型的函数透明地转换为与新原型兼容的函数。但是，这些转换函数将在 Django 1.4 中移除，因此你应该尽快升级你的 ``Field`` 定义，以使用新的原型。

source: If your ``get_db_prep_*()`` methods made no use of the database connection, you should be able to upgrade by renaming ``get_db_prep_value()`` to ``get_prep_value()`` and ``get_db_prep_lookup()`` to ``get_prep_lookup()``. If you require database specific conversions, then you will need to provide an implementation ``get_db_prep_*`` that uses the ``connection`` argument to resolve database-specific values.
id: Jika metode ``get_db_prep_*()`` anda membuat tidak ada penggunaan hubungan basisdata, anda harus dapat meningkatkan dengan menamai kembali ``get_db_prep_value()`` menjadi ``get_prep_value()`` dan ``get_db_prep_lookup()`` menjadi ``get_prep_lookup()``. Jika anda membutuhkan perubahan khusus basisdata, kemudian anda akan butuh menyediakan sebuah penerapan ``get_db_prep_*`` yang menggunakan argumen ``connection`` untuk menyelesaikan nilai-nilai basisdata-khsuus.
zh_hans: 如果你的 ``get_db_prep_*()`` 方法没有使用数据库连接，你应该可以通过将 ``get_db_prep_value()`` 重命名为 ``get_prep_value()``，将 ``get_db_prep_lookup()`` 重命名为 ``get_prep_lookup()`` 来进行升级。如果你需要数据库特定的转换，那么你需要提供一个实现 ``get_db_prep_*`` 的方法，使用 ``connection`` 参数来解析数据库特定的值。

source: Stateful template tags
id: Etiket cetakan mempertahan keadaan
zh_hans: 有状态的模板标签

source: Template tags that store rendering state on their ``Node`` subclass have always been vulnerable to thread-safety and other issues; as of Django 1.2, however, they may also cause problems when used with the new :ref:`cached template loader<template-loaders>`.
id: Etiket cetakan yang menyimpan keadaan membangun pada subkelas ``Node`` mereka selalu rentan pada thread-safety dan masalah-masalah lain; seperti Django 1.2, bagaimanapun, mereka juga menyebabkan masalah ketika digunakan dengan :ref:`cached template loader<template-loaders>` baru.
zh_hans: 将渲染状态存储在其 ``Node`` 子类上的模板标签一直容易受到线程安全和其他问题的影响；然而，从Django 1.2开始，当与新的 :ref:`cached template loader<template-loaders>` 一起使用时，它们可能也会引发问题。

source: All of the built-in Django template tags are safe to use with the cached loader, but if you're using custom template tags that come from third party packages, or from your own code, you should ensure that the ``Node`` implementation for each tag is thread-safe. For more information, see :ref:`template tag thread safety considerations<template_tag_thread_safety>`.
id: Semua etiket cetakan Django siap-pakai adalah aman untuk digunakan dengan pemuat disimpan sementara, tetapi jika anda sedang menggunakan etiket cetakan penyesuaian yang datang dari paket pihak ketiga, atau dari kode anda sendiri, anda harus memastikan bahwa penerapan ``Node`` untuk setiap etiket adalah thread-safe. Untuk informasi lebih, lihat :ref:`template tag thread safety considerations<template_tag_thread_safety>`.
zh_hans: 所有内置的 Django 模板标签都可以安全地与缓存加载器一起使用，但如果你使用的是来自第三方包或你自己的代码的自定义模板标签，你应该确保每个标签的 ``Node`` 实现是线程安全的。更多信息，请参阅 :ref:`模板标签线程安全注意事项<template_tag_thread_safety>`。

source: You may also need to update your templates if you were relying on the implementation of Django's template tags *not* being thread safe. The :ttag:`cycle` tag is the most likely to be affected in this way, especially when used in conjunction with the :ttag:`include` tag. Consider the following template fragment:
zh_hans: 如果你依赖于 Django 模板标签的实现 *不* 是线程安全的，你可能还需要更新你的模板。在这种情况下，:ttag:`cycle` 标签最有可能受到影响，特别是当与 :ttag:`include` 标签一起使用时。考虑以下模板片段：

source: with a ``subtemplate.html`` that reads:
zh_hans: 带有一个 ``subtemplate.html``，其内容如下：

source: Using the non-thread-safe, pre-Django 1.2 renderer, this would output:
zh_hans: 使用非线程安全的、 Django 1.2 之前的渲染器，输出如下：

source: Using the thread-safe Django 1.2 renderer, you will instead get:
zh_hans: 使用线程安全的 Django 1.2 渲染器，你将得到：

source: This is because each rendering of the :ttag:`include` tag is an independent rendering. When the :ttag:`cycle` tag was not thread safe, the state of the :ttag:`cycle` tag would leak between multiple renderings of the same :ttag:`include`. Now that the :ttag:`cycle` tag is thread safe, this leakage no longer occurs.
id: Ini karena setiap membangun dari etiket :ttag:`include` adalah sebuah membangun berdiri sendiri. Ketika etiket :ttag:`cycle` bukan thread safe, keadaan dari etiket :ttag:`cycle` akan bocor diantara banyak membangun dari :ttag:`include` yang sama. Sekarang etiket :ttag:`cycle` adalah thread safe, kebocoran ini tidak lagi muncul.
zh_hans: 这是因为每次渲染 :ttag:`include` 标签都是独立的渲染。当 :ttag:`cycle` 标签不是线程安全时，:ttag:`cycle` 标签的状态会在同一个 :ttag:`include` 的多次渲染之间泄漏。现在 :ttag:`cycle` 标签是线程安全的，这种泄漏不再发生。

source: ``user_passes_test``, ``login_required`` and ``permission_required``
id: ``user_passes_test``, ``login_required`` dan ``permission_required``
zh_hans: ``user_passes_test``, ``login_required`` 和 ``permission_required``

source: ``django.contrib.auth.decorators`` provides the decorators ``login_required``, ``permission_required`` and ``user_passes_test``. Previously it was possible to use these decorators both on functions (where the first argument is 'request') and on methods (where the first argument is 'self', and the second argument is 'request'). Unfortunately, flaws were discovered in the code supporting this: it only works in limited circumstances, and produces errors that are very difficult to debug when it does not work.
id: ``django.contrib.auth.decorators`` menyediakan penghias `login_required``, ``permission_required`` dan ``user_passes_test``. Sebelumnya itu dimungkinkan menggunakan kedua penghias ini pada fungsi (dimana argumen partama adalah 'request') dan pada cara (dimana argumen pertama adalah 'self', dan argumen kedua adalah 'request'). Sayangnya, kelemahan-kelemahan ditemukan di kode yang mendukung ini: itu hanya bekerja di keadaan terbatas, dan menghasilkan kesalahan yang sangat sulit untuk dicari kesalahan ketika itu tidak bekerja.
zh_hans: ``django.contrib.auth.decorators`` 提供了装饰器 ``login_required``、``permission_required`` 和 ``user_passes_test``。以前可以在函数上使用这些装饰器（其中第一个参数是 'request'），也可以在方法上使用（其中第一个参数是 'self'，第二个参数是 'request'）。不幸的是，发现了支持这种用法的代码存在缺陷：它只在有限的情况下工作，并且在不起作用时会产生非常难以调试的错误。

source: For this reason, the 'auto adapt' behavior has been removed, and if you are using these decorators on methods, you will need to manually apply :func:`django.utils.decorators.method_decorator` to convert the decorator to one that works with methods. For example, you would change code from this::
id: Untuk alasan ini, perilaku 'auto adapt' telah dipindahkan, dan jika anda sedang menggunakan penghias pada metode, anda akan butuh untuk secara manual memberlakukan :func:`django.utils.decorators.method_decorator` untuk merubah penghias menjadi satu yang bekerja dengan cara ini. Sebagai contoh, anda akan merubah kode dari ini::
zh_hans: 因此，已经移除了'auto adapt'行为，如果你在方法上使用这些装饰器，你需要手动应用 :func:`django.utils.decorators.method_decorator` 来将装饰器转换为适用于方法的装饰器。例如，你需要将代码从这样改为：

source: or::
id: atau::
zh_hans: 或者：

source: For those of you who've been following the development trunk, this change also applies to other decorators introduced since 1.1, including ``csrf_protect``, ``cache_control`` and anything created using ``decorator_from_middleware``.
id: Untuk siapa dari anda yang telah mengikuti tempat pengembangan, perubahan ini juga berlaku ke penghias lain diperkenalkan sejak 1.1, termasuk ``csrf_protect``, ``cache_control`` dan apapun dibuat menggunakan ``decorator_from_middleware``.
zh_hans: 对于那些一直关注开发主干的人，这个变更也适用于自 1.1 版以来引入的其他装饰器，包括 ``csrf_protect``、``cache_control`` 和使用 ``decorator_from_middleware`` 创建的任何装饰器。

source: :ttag:`if` tag changes
id: Etiket :ttag:`if` berubah
zh_hans: :ttag:`if` 标签的变更
