Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: The internal implementation of :class:`django.db.models.FileField` have changed. A visible result of this is that the way you access special attributes (URL, filename, image size, etc.) of these model fields has changed. You will need to make the following changes, assuming your model's :class:`~django.db.models.FileField` is called ``myfile``:
id: Penerapan internal dari :class:`django.db.models.FileField` telah berubah. Hasil nampak dari ini adalah bahwa cara anda mengakses atribut khusus (URL, berkas nama, ukuran gambar, dll.) dari bidang model ini telah berubah. Anda akan butuh membuat perubahan berikut, menganggap :class:`~django.db.models.FileField` model anda dipanggil ``myfile``:
zh_hans: class:`django.db.models.FileField` 的内部实现已更改。一个明显的结果是您访问特殊属性(URL, filename, image size, 等等)的方式发生了变化。您需要进行以下更改，假设您的模型 :class:`~django.db.models.FileField` 调用 ``myfile``:

source: Note that the ``width`` and ``height`` attributes only make sense for :class:`~django.db.models.ImageField` fields. More details can be found in the :doc:`model API </ref/models/fields>` documentation.
id: Catat bahwa atribut ``width`` dan ``height`` hanya masuk akal untuk bidang :class:`~django.db.models.ImageField`. Rincian lebih dapat ditemukan di dokumentasi :doc:`model API </ref/models/fields>`.
zh_hans: 请注意 ``width`` 和 ``height`` 属性仅对:class:`~django.db.models.ImageField` 字段有意义。更多详细信息可以在 :doc:`模型 API </ref/models/fields>` 文档中找到。

source: Use ``Paginator`` instead of ``ObjectPaginator``
id: Gunakan ``Paginator`` daripada ``ObjectPaginator``
zh_hans: 使用 ``Paginator`` 而不是 ``ObjectPaginator``

source: The ``ObjectPaginator`` in 0.96 has been removed and replaced with an improved version, :class:`django.core.paginator.Paginator`.
id: ``ObjectPaginator`` di 0.96 telah dipindahkan dan diganti dengan versi diperbaiki, :class:`django.core.paginator.Paginator`.
zh_hans: 0.96 版本中的 ``ObjectPaginator`` 已被删除，并替换为一个改进版本: class:`django.core.paginator.Paginator`。

source: Templates
id: Templat
zh_hans: 模板

source: Learn to love autoescaping
id: Belajar mencintai pelolosan otomatis
zh_hans: 学会爱上自动转义

source: By default, the template system now automatically HTML-escapes the output of every variable. To learn more, see :ref:`automatic-html-escaping`.
id: Secara awal, sistem cetakan sekarang otomatis meloloskan HTML keluaran setiap variabel. Untuk mempelajari lebih, lihat :ref:`automatic-html-escaping`.
zh_hans: 默认情况下，模板系统现在会自动对每个变量的输出进行HTML转义。要了解更多信息，请参阅 :ref:`automatic-html-escaping`。

source: To disable auto-escaping for an individual variable, use the :tfilter:`safe` filter:
id: Untuk meniadakan pelolosan otomatis untuk variabel tersendiri, gunakan :tfilter:`safe` filter:
zh_hans: 要禁用单个变量的自动转义，请使用 :tfilter:`safe` 过滤器:

source: To disable auto-escaping for an entire template, wrap the template (or just a particular section of the template) in the :ttag:`autoescape` tag:
id: Untuk meniadakan pelolosan otomatis untuk keseluruhan cetakan, bungkus cetakan (atau cukup bagian tertentu dari cetakan) di etiket :ttag:`autoescape`:
zh_hans: 要禁用整个模板的自动转义，请将模板（或模板的特定部分）包装在 :ttag:`autoescape` 标签:

source: Less-common changes
id: Perubahan kurang umum
zh_hans: 不常见的变化

source: The following changes are smaller, more localized changes. They should only affect more advanced users, but it's probably worth reading through the list and checking your code for these things.
id: Perubahan berikut lebih kecil, lebih perubahan lokal. Mereka hanya berpengaruh lebih pengguna lanjutan, tetapi itu mungkin bernilai baik membaca melalui daftar dan memeriksa kode anda untuk hal-hal ini.
zh_hans: 以下更改是较小的、更本地化的更改。它们应该只影响更高级的用户，但是通读列表并检查代码中的这些东西可能是值得的。

source: Signals
id: Sinyal
zh_hans: 信号

source: Add ``**kwargs`` to any registered signal handlers.
id: Tambah ``**kwargs`` pada setiap penangan sinyal terdaftar.
zh_hans: 将``**kwargs``添加到任何注册的信号处理程序中。

source: Connect, disconnect, and send signals via methods on the :class:`~django.dispatch.Signal` object instead of through module methods in ``django.dispatch.dispatcher``.
id: Hubungkan, putuskan, dan kirim sinyal melalui metode pada obyek :class:`~django.dispatch.Signal` daripada melalui modul metode di ``django.dispatch.dispatcher``.
zh_hans: 通过 :class:`~django.dispatch.Signal` 对象上的方法连接、断开连接和发送信号，而不是通过 ``django.dispatch.dispatcher`` 中的模块方法。

source: Remove any use of the ``Anonymous`` and ``Any`` sender options; they no longer exist. You can still receive signals sent by any sender by using ``sender=None``
id: Pindahkan tiap penggunaan pilihan pengirim ``Anonymous`` dan ``Any``; mereka tidak lagi ada. Anda masih dapat menerima sinyal dikirim oleh pengirim dengan menggunakan ``sender=None``
zh_hans: 移除任何对 ``Anonymous`` 和 ``Any`` 发送者选项的使用；它们不再存在。你仍然可以通过使用 ``sender=None`` 接收来自任何发送者的信号。

source: Make any custom signals you've declared into instances of :class:`django.dispatch.Signal` instead of anonymous objects.
id: Buat sinyal penyesuaian apa saja anda telah nyatakan kedalam instance dari :class:`django.dispatch.Signal` sebagai ganti dari obyek anonim.
zh_hans: 将你声明的任何自定义信号转换为 :class:`django.dispatch.Signal` 的实例，而不是匿名对象。

source: Here's quick summary of the code changes you'll need to make:
id: Berikut rekap dari perubahan kode yang perlu anda lakukan:
zh_hans: 以下是你需要进行的代码更改的快速摘要：

source: Comments
id: Komentar
zh_hans: 评论

source: If you were using Django 0.96's ``django.contrib.comments`` app, you'll need to upgrade to the new comments app introduced in 1.0. See the upgrade guide for details.
id: Jika anda menggunakan aplikasi ``django.contrib.comments`` Django 0.96, anda akan btuuh meningkatkan ke aplikasi komentar baru diperkenalkan di 1.0. Lihat panduan peningkatan untuk rincian.
zh_hans: 如果你使用的是Django 0.96版的` Django .contrib.comments`应用程序，你需要升级到1.0版引入的新评论应用程序。详细信息请参见升级指导书。

source: Template tags
id: Tag templat
zh_hans: 模板标签

source: :ttag:`spaceless` tag
id: Etiket :ttag:`spaceless`
zh_hans: :ttag:`spaceless` 标签

source: The ``spaceless`` template tag now removes *all* spaces between HTML tags, instead of preserving a single space.
id: Template tag ``spaceless`` sekarang menghapus *semua* spasi diantara tag HTML, alih-alih mempertahankan satu buah spasi.
zh_hans: ``spaceless`` 模板标签现在会移除 HTML 标签之间的 *所有* 空格，而不再保留单个空格。

source: Local flavors
id: Rasa lokal
zh_hans: 本地风味

source: U.S. local flavor
id: Rasa lokal U.S
zh_hans: 美国本地风味

source: ``django.contrib.localflavor.usa`` has been renamed to ``django.contrib.localflavor.us``. This change was made to match the naming scheme of other local flavors. To migrate your code, all you need to do is change the imports.
id: ``django.contrib.localflavor.usa`` telah dinamai kembali ke ``django.contrib.localflavor.us``. Perubahan ini dibuat untuk mencocokan penamaan skema dari rasa lokal lainnya. Untuk memindahkan kode anda, anda yang butuh lakukan adalah merubah impor.
zh_hans: ``django.contrib.localflavor.usa`` 已重命名为 ``django.contrib.localflavor.us``。此更改是为了与其他本地化风格的命名方案匹配。要迁移你的代码，你只需要更改导入语句。

source: Sessions
id: Sesi
zh_hans: 会话

source: Getting a new session key
id: Mendapatkan kunci sesi baru
zh_hans: 获取新的会话密钥

source: ``SessionBase.get_new_session_key()`` has been renamed to ``_get_new_session_key()``. ``get_new_session_object()`` no longer exists.
id: ``SessionBase.get_new_session_key()`` telah dinamai kembali menjadi ``_get_new_session_key()``. ``get_new_session_object()`` tidak lagi ada.
zh_hans: ``SessionBase.get_new_session_key()`` 已重命名为 ``_get_new_session_key()``。``get_new_session_object()`` 不再存在。

source: Fixtures
id: Perlengkapan
zh_hans: 辅助工具

source: Loading a row no longer calls ``save()``
id: Memuat sebuah baris yang tidak memanggil ``save()``
zh_hans: 加载一行不再调用"save()"

source: Previously, loading a row automatically ran the model's ``save()`` method. This is no longer the case, so any fields (for example: timestamps) that were auto-populated by a ``save()`` now need explicit values in any fixture.
id: Sebelumnya, memuat sebuah baris secara otomatis menjalankan metode ``save()`` model. Ini bukan lagi kasus, jadi tiap bidang (sebagai contoh: timestamp) yang dikumpulkan otomatis oleh ``save()`` sekarang butuh nilai eksplisit di tiap perlengkapan tetap.
zh_hans: 以前加载一行数据会自动运行模型的`save()`方法。现在情况不再是这样了，所以任何由``save()``自动填充的字段(例如:时间戳)现在都需要在任何fixture中显示值。

source: Settings
id: Pengaturan
zh_hans: 配置

source: Better exceptions
id: Pengecualian terbaik
zh_hans: 更好的异常处理

source: The old :exc:`EnvironmentError` has split into an :exc:`ImportError` when Django fails to find the settings module and a :exc:`RuntimeError` when you try to reconfigure settings after having already used them.
id: :exc:`EnvironmentError` lama telah dipisah menjadi :exc:`ImportError` ketika Django gagal menemukan modul pengaturan dan :exc:`RuntimeError` ketika anda mencoba mengkonfigurasi kembali pengaturan setelah selesai menggunakan mereka.
zh_hans: 旧的 :exc:`EnvironmentError` 现已拆分为 :exc:`ImportError` （当 Django 无法找到设置模块时）和 :exc:`RuntimeError` （当你尝试在已经使用过设置之后重新配置它们时）。

source: :setting:`LOGIN_URL` has moved
id: :setting:`LOGIN_URL` telah dipindahkan
zh_hans: :setting:`LOGIN_URL` 已移动

source: The :setting:`LOGIN_URL` constant moved from ``django.contrib.auth`` into the ``settings`` module. Instead of using ``from django.contrib.auth import LOGIN_URL`` refer to :setting:`settings.LOGIN_URL <LOGIN_URL>`.
id: Ketetapan :setting:`LOGIN_URL` dipindah dari ``django.contrib.auth`` kedalam modul ``settings``. Daripada menggunakan ``from django.contrib.auth import LOGIN_URL`` mengacu pada :setting:`settings.LOGIN_URL <LOGIN_URL>`.
zh_hans: :setting:`LOGIN_URL` 常量已从 ``django.contrib.auth`` 移动到 ``settings`` 模块。不再使用 ``from django.contrib.auth import LOGIN_URL``，请改用 :setting:`settings.LOGIN_URL <LOGIN_URL>`。

source: :setting:`APPEND_SLASH` behavior has been updated
id: Perilaku :setting:`APPEND_SLASH` telah diperbaharui
zh_hans: :setting:`APPEND_SLASH` 的行为已更新。

source: In 0.96, if a URL didn't end in a slash or have a period in the final component of its path, and :setting:`APPEND_SLASH` was True, Django would redirect to the same URL, but with a slash appended to the end. Now, Django checks to see whether the pattern without the trailing slash would be matched by something in your URL patterns. If so, no redirection takes place, because it is assumed you deliberately wanted to catch that pattern.
id: Di 0.96, jika sebuah URL tidak berakhir di garis miring atau mempunyai titik di akhir komponen dari jalurnya, dan :setting:`APPEND_SLASH` adalah True, Django akan mengalihkan ke URL sama, tetapi dengan tanda miring ditambahkan pada akhir. Sekarang, Django memeriksa apakah pola tanpa ekor garis miring akan cocok oleh sesuatu di pola URL anda. Jika demikian, tidak ada pengalihan, karena itu dianggap anda sengaja ingin menangkap pola itu.
zh_hans: 在 0.96 版本中，如果一个 URL 不以斜杠结尾，或者其路径的最后一个组件中没有句点，并且 :setting:`APPEND_SLASH` 为 True，Django 会重定向到相同的 URL，但在末尾添加斜杠。现在，Django 会检查去掉尾部斜杠的模式是否与你的 URL 模式中的某些内容匹配。如果匹配成功，不会进行重定向，因为假定你是有意捕获该模式的。

source: For most people, this won't require any changes. Some people, though, have URL patterns that look like this::
id: Untuk kebanyakan orang, ini tidak akan membutuhkan perubahan. Beberapa orang, meskipun, mempunyai pola URL yang terlihat seperti ini::
zh_hans: 对大多数人来说，这不需要进行任何更改。然而，有些人的 URL 模式看起来像这样：

source: Previously, those patterns would have been redirected to have a trailing slash. If you always want a slash on such URLs, rewrite the pattern as::
id: Sebelumnya, pola itu akan dialihkan untuk mempunyai sebuah ekor garis miring. Jika anda selalu ingin garis miring pada URL itu, tulis kembali pola sebagai::
zh_hans: 以前，这些模式会被重定向以添加尾部斜杠。如果你希望这些 URL 始终带有斜杠，请将模式改写为：

source: Smaller model changes
id: Perubahan model kecil
zh_hans: 较小的模型更改

source: Different exception from ``get()``
id: Pengecualian berbeda dari ``get()``
zh_hans: 与``get()``不同的异常

source: Managers now return a :exc:`~django.core.exceptions.MultipleObjectsReturned` exception instead of :exc:`AssertionError`:
id: Pengelola sekarang mengembalikan pengecualian :exc:`~django.core.exceptions.MultipleObjectsReturned` daripada :exc:`AssertionError`:
zh_hans: 现在，管理器返回 :exc:`~django.core.exceptions.MultipleObjectsReturned` 异常，而不再返回 :exc:`AssertionError` 异常：

source: ``LazyDate`` has been fired
id: ``LazyDate`` telah dinyalakan
zh_hans: ``LazyDate`` 已删除。

source: The ``LazyDate`` helper class no longer exists.
id: Kelas pembantu ``LazyDate`` tidak lagi ada.
zh_hans: ``LazyDate`` 帮助类不再存在。

source: Default field values and query arguments can both be callable objects, so instances of ``LazyDate`` can be replaced with a reference to ``datetime.datetime.now``:
id: Nilai bidang awalan dan permintaan argumen keduanya obyek callable, jadi instance dari ``LazyDate`` dapat diganti dengan acuan pada ``datetime.datetime.now``:
zh_hans: 默认字段值和查询参数都可以是可调用对象，因此可以将 ``LazyDate`` 的实例替换为对 ``datetime.datetime.now`` 的引用：

source: ``DecimalField`` is new, and ``FloatField`` is now a proper float
id: ``DecimalField`` adalah baru, dan ``FloatField`` sekarang float tepat.
zh_hans: ``DecimalField`` 是新的，而 ``FloatField`` 现在是真正的浮点数字段。

source: If you forget to make this change, you will see errors about ``FloatField`` not taking a ``max_digits`` attribute in ``__init__``, because the new ``FloatField`` takes no precision-related arguments.
id: Jika anda lupa membuat perubahan ini, anda akan melihat kesalahan tentang ``FloatField`` bukan mengambil atribut ``max_digits`` di ``__init__``, karena ``FloatField`` baru mengambil argumen terkait tidak teliti.
zh_hans: 如果你忘记进行这个更改，你会看到关于 ``FloatField`` 在 ``__init__`` 中不接受 ``max_digits`` 属性的错误，因为新的 ``FloatField`` 不接受与精度相关的参数。

source: If you're using MySQL or PostgreSQL, no further changes are needed. The database column types for ``DecimalField`` are the same as for the old ``FloatField``.
id: Jika anda sedang menggunakan MySQL atau PostgreSQL, tidak dibtuuhkan perubahan lebih lanjut. Jenis kolom basisdata untuk ``DecimalField`` adalah sama untuk ``FloatField`` lama.
zh_hans: 如果你使用的是 MySQL 或 PostgreSQL，不需要进一步的更改。对于 ``DecimalField``，数据库列类型与旧的 ``FloatField`` 相同。

source: If you're using SQLite, you need to force the database to view the appropriate columns as decimal types, rather than floats. To do this, you'll need to reload your data. Do this after you have made the change to using ``DecimalField`` in your code and updated the Django code.
id: Jika anda menggunakan SQLite, anda butuh memaksa basisdata melihat kolom yang sesuai sebagai jenis desimal, daripada float. untuk melakukan ini, anda akan butuh memuat kembali data anda. Lakukam ini setelah anda membuat perubahan untuk menggunakan ``DecimalField`` di kode anda dan kode Django diperbaharui.
zh_hans: 如果你使用的是 SQLite，你需要强制数据库将相应的列视为十进制类型，而不是浮点数。要做到这一点，你需要在对代码进行更改并更新 Django 代码后重新加载数据。

source: **Back up your database first!**
id: **Sokong basisdata anda dahulu!**
zh_hans: **首先备份你的数据库!!!!**

source: For SQLite, this means making a copy of the single file that stores the database (the name of that file is the ``DATABASE_NAME`` in your ``settings.py`` file).
zh_hans: 对于SQLite，这意味着要复制存储数据库的单个文件(该文件的名称是``settings.py``文件中的``DATABASE_NAME``)。

source: To upgrade each application to use a ``DecimalField``, you can do the following, replacing ``<app>`` in the code below with each app's name:
id: Untuk meningkatkan setiap aplikasi untuk menggunakan sebuah ``DecimalField``, anda dapat melakukan berikut, mengganti ``<app>`` di kode dibawah ini dengan setiap nama aplikasi:
zh_hans: 要升级每个应用程序以使用 ``DecimalField``，你可以按照以下代码进行操作，将代码中的 ``<app>`` 替换为每个应用程序的名称：

source: Notes:
id: Catatan:
zh_hans: 注意：

source: It's important that you remember to use XML format in the first step of this process. We are exploiting a feature of the XML data dumps that makes porting floats to decimals with SQLite possible.
id: Itu sangat penting bahwa anda mengingat untuk menggunakan bentuk XML dalam langkah pertama dari pengolahan ini. Kami sedang menggunakan fitur dari data buangan XML yang membuat belokan float ke desimal dengan SQLite memungkinkan.
zh_hans: 在这个过程的第一步中，重要的是记住要使用 XML 格式。我们利用了 XML 数据转储的一个特性，使得将浮点数转换为 SQLite 中的十进制数成为可能。

source: In the second step you will be asked to confirm that you are prepared to lose the data for the application(s) in question. Say yes; we'll restore this data in the third step.
zh_hans: 在第二步中，你将被要求确认你是否准备好丢失相关应用程序的数据。选择是；我们将在第三步中恢复这些数据。

source: ``DecimalField`` is not used in any of the apps shipped with Django prior to this change being made, so you do not need to worry about performing this procedure for any of the standard Django models.
id: ``DecimalField`` tidak digunakan di tiap aplikasi yang dibekali dengan Django sebelum perubahan ini dibuat, jadi anda tidak butuh khawatir tentang melakukan prosedur ini untuk tiap model Django standar.
zh_hans: 在这个更改之前，Django 附带的应用程序中没有使用 ``DecimalField``，所以你不需要担心为任何标准的 Django 模型执行此过程。

source: If something goes wrong in the above process, just copy your backed up database file over the original file and start again.
id: Jika sesuatu berjalan salah di pengolahan diatas, cukup salin berkas basisdata sokongan anda terhadap berkas asli dan mulai kembali.
zh_hans: 如果上述过程出现问题，只需将备份的数据库文件复制到原始文件上，然后重新开始。

source: Internationalization
id: Internasionalisasi
zh_hans: 国际化

source: :func:`django.views.i18n.set_language` now requires a POST request
id: :func:`django.views.i18n.set_language` sekarang membutuhkan permintaan POST
zh_hans: :func:`django.views.i18n.set_language` 现在要求使用 POST 请求。

source: Previously, a GET request was used. The old behavior meant that state (the locale used to display the site) could be changed by a GET request, which is against the HTTP specification's recommendations. Code calling this view must ensure that a POST request is now made, instead of a GET. This means you can no longer use a link to access the view, but must use a form submission of some kind (e.g. a button).
id: Sebelumnya, permintaan GET telah digunakan. Perilaku lama berarti bahwa keadaan (lokal digunakan untuk menampilkan situs) dapat berubah dengan permintaan GET, yaitu terhadap anjuran spesifikasi HTTP. Kode memanggil tampilan ini harus memastikan bahwa permintaan POST sekaragn dibuat, sebagai gantinya GET. Ini berarti anda tidak dapat lagi menggunakan tautan mengakses tampilan, tetapi harus menggunakan pengajuan formulir dari sejenis (sebagai contoh tombol).
zh_hans: 以前使用的是 GET 请求。旧的行为意味着可以通过 GET 请求更改状态（用于显示站点的区域设置），这违反了 HTTP 规范的建议。调用此视图的代码必须确保现在进行的是 POST 请求，而不是 GET 请求。这意味着你不能再使用链接来访问视图，而是必须使用某种表单提交方式（例如按钮）。

source: ``_()`` is no longer in builtins
id: ``_()`` tidak lagi siap pakai
zh_hans: ``_()`` 不再位于内置函数中

source: ``_()`` (the callable object whose name is a single underscore) is no longer monkeypatched into builtins -- that is, it's no longer available magically in every module.
id: ``_()`` (obyek callable yang namanya adalah garis bawah tunggal) tidak lagi monkeypatch kedalam siap pakai -- yaitu, itu tidak lagi tersedia secara ajaib di setiap modul.
zh_hans: ``_()`` （其名称为单个下划线的可调用对象）不再被自动添加到内置函数中，也就是说，它不再在每个模块中自动可用。

source: If you were previously relying on ``_()`` always being present, you should now explicitly import ``ugettext`` or ``ugettext_lazy``, if appropriate, and alias it to ``_`` yourself::
id: Jika anda sebelumnya bergantung pada ``_()`` selalu menjadi hadir, anda harus sekarang secara eksplisit mengimpor ``ugettext`` atau ``ugettext_lazy``, jika sesuai, dan namai itu menjadi ``_`` anda sendiri::
zh_hans: 如果你之前依赖于 ``_()`` 总是存在，现在应该显式导入 ``ugettext`` 或 ``ugettext_lazy`` （如果适用），并自己将其别名为 ``_``：

source: HTTP request/response objects
id: Obyek HTTP request/response
zh_hans: HTTP 请求/响应对象

source: Dictionary access to ``HttpRequest``
id: Akses kamus ke ``HttpRequest``
zh_hans: 对于 ``HttpRequest`` 的字典访问：

source: ``HttpRequest`` objects no longer directly support dictionary-style access; previously, both ``GET`` and ``POST`` data were directly available on the ``HttpRequest`` object (e.g., you could check for a piece of form data by using ``if 'some_form_key' in request`` or by reading ``request['some_form_key']``. This is no longer supported; if you need access to the combined ``GET`` and ``POST`` data, use ``request.REQUEST`` instead.
id: Obyek ``HttpRequest`` tidak lagi langsung mendukung akses gaya kamus; sebelumnya, kedua data ``GET`` dan ``POST`` langsung tersedia pada obyek ``HttpRequest`` (sebagai contoh, anda dapat memeriksa untuk potongan dari formulir data dengan menggunakan ``if 'some_form_key' in request`` atau dengan membaca ``request['some_form_key']``. Ini tidak lagi didukung; jika anda butuh akses untuk mengkombinasikan data ``GET`` dan ``POST``, gunakan ``request.REQUEST`` sebagai gantinya.
zh_hans: ``HttpRequest`` 对象不再直接支持字典风格的访问；以前，``GET`` 和 ``POST`` 数据都可以直接在 ``HttpRequest`` 对象上使用（例如，你可以通过 ``if 'some_form_key' in request`` 或读取 ``request['some_form_key']`` 来检查表单数据。不再支持这种方式；如果你需要访问组合的 ``GET`` 和 ``POST`` 数据，请使用 ``request.REQUEST``。

source: It is strongly suggested, however, that you always explicitly look in the appropriate dictionary for the type of request you expect to receive (``request.GET`` or ``request.POST``); relying on the combined ``request.REQUEST`` dictionary can mask the origin of incoming data.
id: Itu sangat disarankan, bagaimanapun, bahwa anda selalu secara eksplisit mencari di kamus yang sesuai untuk jenis dari permintaan anda harapkan untuk menerima (``request.GET`` or ``request.POST``); bergantung pada gabungan kamus ``request.REQUEST`` dapat menutup data datang asli.
zh_hans: 然而，强烈建议你始终明确查找你期望接收的请求类型的字典（``request.GET`` 或 ``request.POST``）；依赖于组合的 ``request.REQUEST`` 字典可能会掩盖传入数据的来源。

source: Accessing ``HTTPResponse`` headers
id: Mengakses kepala ``HTTPResponse``
zh_hans: 访问``HTTPResponse`` headers

source: ``django.http.HttpResponse.headers`` has been renamed to ``_headers`` and :class:`~django.http.HttpResponse` now supports containment checking directly. So use ``if header in response:`` instead of ``if header in response.headers:``.
id: ``django.http.HttpResponse.headers`` telah dinamai kembali ke ``_headers`` dan :class:`~django.http.HttpResponse` sekarang mendukung penahanan pemeriksaan secara langsung. Jadi gunakan ``if header in response:`` daripada ``if header in response.headers:``.
zh_hans: ``django.http.HttpResponse.headers`` 已重命名为 ``_headers``，并且 :class:`~django.http.HttpResponse` 现在直接支持包含检查。所以使用 ``if header in response:`` 而不是 ``if header in response.headers:``。

source: Generic relations
id: Hubungan umum
zh_hans: 通用关系

source: Generic relations have been moved out of core
id: Hubungan umum telah dipindahkan keluar dari inti
zh_hans: 通用关系已从核心中移出。

source: The generic relation classes -- ``GenericForeignKey`` and ``GenericRelation`` -- have moved into the :mod:`django.contrib.contenttypes` module.
id: Kelas-kelas hubungan umum -- ``GenericForeignKey`` dan ``GenericRelation`` -- telah dipindahkan kedalam modul :mod:`django.contrib.contenttypes`.
zh_hans: 通用关联类 -- ``GenericForeignKey`` 和 ``GenericRelation`` -- 已移动到 :mod:`django.contrib.contenttypes` 模块。

source: Testing
id: Pengujian
zh_hans: 测试中

source: :meth:`django.test.Client.login` has changed
id: meth:`django.test.Client.login` telah berubah
zh_hans: :meth:`django.test.Client.login` 发生了变化

source: Management commands
id: Pengelolaan perintah
zh_hans: 管理命令

source: Running management commands from your code
id: Menjalankan pengelolaan perintah dari kode anda
zh_hans: 从你的代码中运行管理命令

source: :mod:`django.core.management` has been greatly refactored.
id: :mod:`django.core.management` telah direfaktor.
zh_hans: :mod:`django.core.management` 已经进行了大规模的重构。
