Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: However, it has been demonstrated that this can be abused to gain access to information outside of an admin user's permissions; for example, an attacker with access to the admin and sufficient knowledge of model structure and relations could construct query strings which -- with repeated use of regular-expression lookups supported by the Django database API -- expose sensitive information such as users' password hashes.
id: Bagaimanapun, itu telah ditunjukkan bahwa ini dapat disalahgunakan untuk mendapatkan akses ke informasi diluar dari perizinan pengguna admin; sebagai contoh, seorang penyerang dengan akses ke admin dan pengetahun yang cukup dari struktur model dan hubungan dapat membangun permintaan deretan karakter yang -- dengan penggunaan berulang pencarian pernyataan biasa didukung oleh API basisdata Django -- membuka informasi sensitif seperti acakan sandi pengguna.
zh_hans: 然而，已经证明这种方法可以被滥用来获取管理员用户权限之外的信息。例如，如果攻击者能够访问管理员权限并且对模型结构和关联关系有足够的了解，他们可以构造查询字符串，通过重复使用 Django 数据库 API 支持的正则表达式查询，来获取敏感信息，例如用户的密码哈希值。

source: To remedy this, ``django.contrib.admin`` will now validate that querystring lookup arguments either specify only fields on the model being viewed, or cross relations which have been explicitly allowed by the application developer using the preexisting mechanism mentioned above. This is backwards-incompatible for any users relying on the prior ability to insert arbitrary lookups.
zh_hans: 为了解决这个问题，``django.contrib.admin`` 现在会验证查询字符串查找参数，要么只指定在正在查看的模型上的字段，要么跨关系，并且这些跨关系必须是应用程序开发人员使用上述现有机制明确允许的。对于依赖先前能力插入任意查找的用户来说，这是不兼容的。

source: Django 1.1.4 release notes
id: Catatan terbitan Django 1.1.4
zh_hans: Django 1.1.4 版本发行说明

source: Welcome to Django 1.1.4!
id: Selamat datang di Django 1.1.4!
zh_hans: 欢迎来到 Django 1.1.4 版本！

source: This is the fourth "bugfix" release in the Django 1.1 series, improving the stability and performance of the Django 1.1 codebase.
id: Ini adalah terbitan "bugfix" keempat di rangkaian Django 1.1, memperbaiki kestabilan dan penampilan dari kode dasar Django 1.1.
zh_hans: 这是 Django 1.1 系列的第四个“错误修复”版本，改进了 Django 1.1 代码库的稳定性和性能。

source: With one exception, Django 1.1.4 maintains backwards compatibility with Django 1.1.3. It also contains a number of fixes and other improvements. Django 1.1.4 is a recommended upgrade for any development or deployment currently using or targeting Django 1.1.
id: Dengan satu pengecualian, Django 1.1.4 merawat kesesuaian kebelakang dengan Django 1.1.3. Itu juga mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.1.4 adalah peningkatan dianjurkan untuk setiap pengembangan dan penyebaran saat ini menggunakan atau menyasar Django 1.1.
zh_hans: 除了一个例外，Django 1.1.4 与 Django 1.1.3 兼容。它还包含了一些修复和其他改进。对于当前使用或目标为 Django 1.1 的任何开发或部署，推荐升级到 Django 1.1.4 。

source: CSRF exception for AJAX requests
id: Pengecualian CSRF untuk permintaan AJAX
zh_hans: AJAX 请求的 CSRF 例外

source: Django includes a CSRF-protection mechanism, which makes use of a token inserted into outgoing forms. Middleware then checks for the token's presence on form submission, and validates it.
id: Django menyertakan mekanisme perlindungan CSRF, yang memanfaatkan token dimasukkan kedalam formulir keluar. Middleware kemudian memeriksa untuk kehadiran token pada pengajuan formulir, dan mengecek itu.
zh_hans: Django 包含一个 CSRF 保护机制，它通过在传出的表单中插入一个令牌来实现。然后，中间件在表单提交时检查令牌的存在，并对其进行验证。

source: Prior to Django 1.2.5, our CSRF protection made an exception for AJAX requests, on the following basis:
id: Sebelum Django 1.2.5, perlindungan CSRF kami membuat sebuah pengecualian untuk permintaan AJAX, pada dasar berikut:
zh_hans: 在 Django 1.2.5 之前，我们的 CSRF 保护对 AJAX 请求做了一个例外，基于以下原因：

source: Many AJAX toolkits add an X-Requested-With header when using XMLHttpRequest.
id: Banyak alat bantu AJAX menambahkan sebuah kepala X-Requested-With ketika menggunakan XMLHttpRequest.
zh_hans: 许多 AJAX 工具包在使用 XMLHttpRequest 时会添加一个 X-Requested -With 头部。

source: Browsers have strict same-origin policies regarding XMLHttpRequest.
id: Peramban mempunyai kebijakan asli-sama ketat mengenai XMLHttpRequest.
zh_hans: 浏览器对于 XMLHttpRequest 具有严格的同源策略。

source: In the context of a browser, the only way that a custom header of this nature can be added is with XMLHttpRequest.
id: Di konteks dari peramban, hanya cara yang kepala penyesuaian dari sifat ini dapat ditambahkan adalah dengan XMLHttpRequest.
zh_hans: 在浏览器的上下文中，只有使用 XMLHttpRequest 才能添加这种自定义头部。

source: Therefore, for ease of use, we did not apply CSRF checks to requests that appeared to be AJAX on the basis of the X-Requested-With header. The Ruby on Rails web framework had a similar exemption.
id: Karena itu, untuk mudah penggunaan, kami tidak memberlakukan pemeriksanaan CSRF untuk meminta yang muncul menjadi AJAX pada dasar dari kepala X-Requested-With. Kerangka kerja jaringan Ruby on Rails mempunyai pengecualian yang sama.
zh_hans: 因此，为了方便使用，我们基于 X-Requested-With 头部，对看起来是 AJAX 请求的请求没有应用 CSRF 检查。 Ruby on Rails Web 框架也有类似的例外情况。

source: Recently, engineers at Google made members of the Ruby on Rails development team aware of a combination of browser plugins and redirects which can allow an attacker to provide custom HTTP headers on a request to any website. This can allow a forged request to appear to be an AJAX request, thereby defeating CSRF protection which trusts the same-origin nature of AJAX requests.
id: Baru saja, insinyur di Google membuat anggota dari tim pengembangan Ruby on Rails menyadari dari perpaduan dari plugin peramban dan pengalihan yang dapat mengizinkan seorang penyerang menyediakan kepala HTTP penyesuaian pada permintaan ke tiap situs jaringan. Ini dapat mengizinkan permintaan tiruan muncul menjadi permintaan AJAX, sehingga mengalahkan perlindungan CSRF yang percaya sifat asli-sama dari permintaan AJAX.+
zh_hans: 最近，Google 的工程师向 Ruby on Rails 开发团队的成员们提醒了一种结合浏览器插件和重定向的技术，可以允许攻击者在向任何网站发出请求时提供自定义的 HTTP 头信息。这可以使伪造的请求看起来像是 AJAX 请求，从而破坏了 CSRF 保护机制，因为它信任 AJAX 请求具有同源性质。

source: Michael Koziarski of the Rails team brought this to our attention, and we were able to produce a proof-of-concept demonstrating the same vulnerability in Django's CSRF handling.
id: Michael Koziarski dari tim Rails membawa ini ke perhatian kami, dan kami dapat menghasilkan bukti dari konsep menunjukkan kerentanan sama di penanganan CSRF Django.
zh_hans: Rails 团队的 Michael Koziarski 向我们提出了这个问题，我们能够制作出一个概念验证，证明了 Django 的 CSRF 处理也存在同样的漏洞。

source: To remedy this, Django will now apply full CSRF validation to all requests, regardless of apparent AJAX origin. This is technically backwards-incompatible, but the security risks have been judged to outweigh the compatibility concerns in this case.
id: Untuk memperbaiki ini, Django akan sekarang memberlakukan pengesagan CSRF penuh ke semua permintaan, tanpa memperhatikan asal jelas AJAX. Ini secara teknis bertentangan kebelakang, tetapi resiko keamanan telah dijatuhkan lebih besar perhatian kesesuaian dalam kasus ini.
zh_hans: 为了解决这个问题，Django 现在将对所有请求应用完整的 CSRF 验证，无论它们看起来是否来自 AJAX 。从技术上讲，这是不兼容的，但在这种情况下，安全风险被认为超过了兼容性问题。

source: Additionally, Django will now accept the CSRF token in the custom HTTP header X-CSRFTOKEN, as well as in the form submission itself, for ease of use with popular JavaScript toolkits which allow insertion of custom headers into all AJAX requests.
id: Tambahannya, Django akan sekarang menerima token CSRF dalam kepala HTTP penyesuaian X-CSRFTOKEN, sama halnya di pengajuan formulir itu sendiri, untuk mudah penggunaan dengan alat bantu JavaScript terkenal yang mengizinkan pemasukan kepala penyesuaian kedalam semua permintaan AJAX.
zh_hans: 此外，Django 现在将接受自定义 HTTP 头 X-CSRFTOKEN 中的 CSRF 令牌，以及表单提交本身中的令牌，以便与流行的 JavaScript 工具包一起使用，这些工具包允许在所有 AJAX 请求中插入自定义头。这样做是为了方便使用。

source: Please see the :ref:`CSRF docs for example jQuery code <csrf-ajax>` that demonstrates this technique, ensuring that you are looking at the documentation for your version of Django, as the exact code necessary is different for some older versions of Django.
id: Silahkan lihat :ref:`CSRF docs for example jQuery code <csrf-ajax>` yang menunjukkan teknik ini, memastikan bahwa anda mencari di dokumentasi untuk versi Django anda, seperti kode tepat diperlukan berbeda untuk beberapa versi terlama dari Django.
zh_hans: 请参阅 :ref:`CSRF 文档中的示例 jQuery 代码 <csrf-ajax>`，该代码演示了这个技巧，确保您查看的是适用于您的 Django 版本的文档，因为一些较旧版本的 Django 需要不同的确切代码。

source: Django 1.10 release notes
id: Catatan terbitan Django 1.10
zh_hans: Django 1.10 版本发行说明

source: *August 1, 2016*
id: *Agustus 1, 2016*
zh_hans: *2016 年 8 月 1 日*

source: Welcome to Django 1.10!
id: Selamat datang di Django 1.10!
zh_hans: 欢迎来到 Django 1.10 版本！

source: These release notes cover the :ref:`new features <whats-new-1.10>`, as well as some :ref:`backwards incompatible changes <backwards-incompatible-1.10>` you'll want to be aware of when upgrading from Django 1.9 or older versions. We've :ref:`dropped some features <removed-features-1.10>` that have reached the end of their deprecation cycle, and we've :ref:`begun the deprecation process for some features <deprecated-features-1.10>`.
id: Catatan terbitan ini melingkupi :ref:`new features <whats-new-1.10>`, sama halnya beberapa :ref:`backwards incompatible changes <backwards-incompatible-1.10>` anda ingin sadari dari ketika meningkatkan dari Django 1.9 atau versi terlama. Kami telah :ref:`dropped some features <removed-features-1.10>` yang telah mencapai akhir dari siklus pengusangan mereka, dan kami telah :ref:`begun the deprecation process for some features <deprecated-features-1.10>`.
zh_hans: 这些发布说明涵盖了 :ref:`新功能 <whats-new-1.10>`，以及一些 :ref:`不兼容的更改 <backwards-incompatible-1.10>`，在从 Django 1.9 或更早版本升级时，您需要注意这些更改。我们已经 :ref:`放弃了一些功能 <removed-features-1.10>`，它们已经达到了停用周期的末尾，同时我们已经 :ref:`开始了一些功能的停用过程 <deprecated-features-1.10>`。

source: See the :doc:`/howto/upgrade-version` guide if you're updating an existing project.
id: Lihat panduan :doc:`/howto/upgrade-version` jika anda sedang memperbaharui proyek yang ada.
zh_hans: 如果你要更新现有的项目，请看 :doc:`/howto/upgrade-version` 指南。

source: Python compatibility
id: Kesesuaian Python
zh_hans: Python 兼容性

source: Like Django 1.9, Django 1.10 requires Python 2.7, 3.4, or 3.5. We **highly recommend** and only officially support the latest release of each series.
id: Seperti Django 1.9, Django 1.10 membutuhkan Python 2.7, 3.4, atau 3.5. Kami **sangat menganjurkan** dan hanya secara resmi mendukung terbitan terakhir dari setiap rangkaian.
zh_hans: 与 Django 1.9 一样，Django 1.10 需要 Python 2.7、3.4 或 3.5。我们 **强烈建议** 并且只正式支持每个系列的最新版本。

source: What's new in Django 1.10
id: Apa yang baru di Django 1.10
zh_hans: Django 1.10 新特性

source: Full text search for PostgreSQL
id: Pencarian teks penuh untuk PostgreSQL
zh_hans: PostgreSQL 的全文搜索

source: ``django.contrib.postgres`` now includes a :doc:`collection of database functions </ref/contrib/postgres/search>` to allow the use of the full text search engine. You can search across multiple fields in your relational database, combine the searches with other lookups, use different language configurations and weightings, and rank the results by relevance.
id: ``django.contrib.postgres`` sekarang menyertakan :doc:`collection of database functions </ref/contrib/postgres/search>` untuk mengizinkan penggunaan dari pencarian teks penuh mesin pencarian. Anda dapat mencari lintas bidang banyak di hubungan basisdata, memadukan pencarian dengan pencarian lain, menggunakan konfigurasi dan pembobotan bahasa berbeda, dan memangkatkan hasil berdasarkan pertalian.
zh_hans: ``django.contrib.postgres`` 现在包括一个 :doc:`数据库函数集合 </ref/contrib/postgres/search>`，允许使用全文搜索引擎。您可以在关系数据库中跨多个字段进行搜索，将搜索与其他查找组合使用，使用不同的语言配置和权重，以及按相关性对结果进行排名。

source: It also now includes trigram support, using the :lookup:`trigram_similar` lookup, and the :class:`~django.contrib.postgres.search.TrigramSimilarity` and :class:`~django.contrib.postgres.search.TrigramDistance` expressions.
id: Itu juga sekarang menyertakan dukungan trigram, menggunakan pencarian :lookup:`trigram_similar`, dan pernyataan :class:`~django.contrib.postgres.search.TrigramSimilarity` dan :class:`~django.contrib.postgres.search.TrigramDistance`.
zh_hans: 它还现在包括 trigram 支持，使用 :lookup:`trigram_similar` 查找以及 :class:`~django.contrib.postgres.search.TrigramSimilarity` 和 :class:`~django.contrib.postgres.search.TrigramDistance` 表达式。

source: New-style middleware
id: Middleware gaya-baru
zh_hans: 新式中间件

source: :doc:`A new style of middleware is introduced </topics/http/middleware>` to solve the lack of strict request/response layering of the old-style of middleware described in `DEP 0005 <https://github.com/django/deps/blob/main/final/0005-improved-middleware.rst>`_. You'll need to :ref:`adapt old, custom middleware <upgrading-middleware>` and switch from the ``MIDDLEWARE_CLASSES`` setting to the new :setting:`MIDDLEWARE` setting to take advantage of the improvements.
zh_hans: :doc:`引入了一种新的中间件风格 </topics/http/middleware>`，以解决旧式中间件的请求/响应层次不严格的问题，这在 `DEP 0005 <https://github.com/django/deps/blob/main/final/0005-improved-middleware.rst>`_ 中有描述。您需要 :ref:`调整旧的自定义中间件 <upgrading-middleware>`，并从 ``MIDDLEWARE_CLASSES`` 设置切换到新的 :setting:`MIDDLEWARE` 设置以充分利用这些改进。

source: Official support for Unicode usernames
id: Dukungan resmi untuk nama pengguna Unicode
zh_hans: 官方支持 Unicode 用户名

source: The :class:`~django.contrib.auth.models.User` model in ``django.contrib.auth`` originally only accepted ASCII letters and numbers in usernames. Although it wasn't a deliberate choice, Unicode characters have always been accepted when using Python 3.
id: Model :class:`~django.contrib.auth.models.User` dalam ``django.contrib.auth``aslinya hanya menerima huruf ASCII dan angka dalam nama penggna. Meskipun itu bukan pilhan disengaja, karakter Unicode selalu diterima ketika menggunakan Python 3.
zh_hans: ``django.contrib.auth`` 中的 :class:`~django.contrib.auth.models.User` 模型最初只接受用户名中的 ASCII 字母和数字。尽管这不是一个故意的选择，在使用 Python 3 时，Unicode 字符一直都被接受。

source: The username validator now explicitly accepts Unicode characters by default on Python 3 only.
zh_hans: 用户名验证器现在默认情况下仅在 Python 3 上明确接受 Unicode 字符。

source: Custom user models may use the new :class:`~django.contrib.auth.validators.ASCIIUsernameValidator` or :class:`~django.contrib.auth.validators.UnicodeUsernameValidator`.
zh_hans: 自定义用户模型可以使用新的 :class:`~django.contrib.auth.validators.ASCIIUsernameValidator` 或 :class:`~django.contrib.auth.validators.UnicodeUsernameValidator`。

source: Minor features
id: Fitur kecil
zh_hans: 次要特性

source: For sites running on a subpath, the default :attr:`URL for the "View site" link <django.contrib.admin.AdminSite.site_url>` at the top of each admin page will now point to ``request.META['SCRIPT_NAME']`` if set, instead of ``/``.
id: Untuk situs-situs berjalan pada subjalur, :attr:`URL awal untuk tautan "View site" <django.contrib.admin.AdminSite.site_url>` pada atas dari setiap halaman admin akan sekarang menunjuk ke ``request.META['SCRIPT_NAME']`` jika disetel, daripada ``/``.
zh_hans: 对于运行在子路径上的站点，每个管理页面顶部的默认 :attr:`"查看站点"链接的 URL <django.contrib.admin.AdminSite.site_url>` 现在将指向 ``request.META['SCRIPT_NAME']`` （如果设置了），而不是 ``/``。

source: The success message that appears after adding or editing an object now contains a link to the object's change form.
id: Pesan berhasil yang muncul setelah menambahkan atau menyunting sebuah obyek sekarang mengandung sebuah tautan ke formulir rubah obyek.
zh_hans: 现在，在添加或编辑对象后出现的成功消息中包含到对象的更改表单的链接。

source: All inline JavaScript is removed so you can enable the ``Content-Security-Policy`` HTTP header if you wish.
id: Semua deretan JavaScript dipindahkan jadi anda dapat mengadakan kepala HTTP ``Content-Security-Policy`` jika anda ingin.
zh_hans: 所有内联 JavaScript 都已移除，因此您可以启用 ``Content-Security-Policy`` HTTP 标头（如果需要的话）。

source: The new :attr:`InlineModelAdmin.classes <django.contrib.admin.InlineModelAdmin.classes>` attribute allows specifying classes on inline fieldsets. Inlines with a ``collapse`` class will be initially collapsed and their header will have a small "show" link.
id: Atribut :attr:`InlineModelAdmin.classes <django.contrib.admin.InlineModelAdmin.classes>` baru mengizinkan menetapkan kelas-kelas pada deretam kumpulan bidang. Berderet dengan kelas ``collapse`` akan awalnya diruntuhkan dan kepala mereka akan mempunyai tautan "show" kecil.
zh_hans: 新的 :attr:`InlineModelAdmin.classes <django.contrib.admin.InlineModelAdmin.classes>` 属性允许在内联字段集上指定类。具有 ``collapse`` 类的内联将初始折叠，并且它们的标题将有一个小的 "显示" 链接。

source: If a user doesn't have the add permission, the ``object-tools`` block on a model's changelist will now be rendered (without the add button). This makes it easier to add custom tools in this case.
zh_hans: 如果用户没有添加权限，模型的更改列表上的 ``object-tools`` 区块现在将被呈现（没有添加按钮）。这在这种情况下更容易添加自定义工具。

source: The :class:`~django.contrib.admin.models.LogEntry` model now stores change messages in a JSON structure so that the message can be dynamically translated using the current active language. A new ``LogEntry.get_change_message()`` method is now the preferred way of retrieving the change message.
id: Model :class:`~django.contrib.admin.models.LogEntry` sekarang menyimpan pesan-pesan berubah di struktur JSON sehingga pesan dapat secara dinamis diterjemahkan menggunakan bahasa aktif saat ini. Metode ``LogEntry.get_change_message()`` baru sekarang dipilih dari mengambil pesan berubah.
zh_hans: :class:`~django.contrib.admin.models.LogEntry` 模型现在将更改消息存储在 JSON 结构中，以便可以使用当前活动的语言动态翻译消息。现在，首选的检索更改消息的方式是使用新的 ``LogEntry.get_change_message()`` 方法。

source: Selected objects for fields in ``ModelAdmin.raw_id_fields`` now have a link to object's change form.
id: Obyek terpilih untuk bidang di ``ModelAdmin.raw_id_fields`` sekarang mempunyai sebuah tautan ke formulir rubah obyek.
zh_hans: 在 ``ModelAdmin.raw_id_fields`` 中选定的字段的对象现在具有指向对象的更改表单的链接。

source: Added "No date" and "Has date" choices for ``DateFieldListFilter`` if the field is nullable.
id: Ditambahkan pilihan "No date" dan "Has date" untuk ``DateFieldListFilter`` jika bidang adalah nullable.
zh_hans: 如果字段可为空，为 ``DateFieldListFilter`` 添加了 "无日期" 和 "有日期" 选项。

source: The jQuery library embedded in the admin is upgraded from version 2.1.4 to 2.2.3.
id: Pustaka jQuery ditanam di admin ditingkatkan dari versi 2.1.4 ke 2.2.3.
zh_hans: 管理后台中嵌入的 jQuery 库已经从 2.1.4 版本升级到 2.2.3 版本。

source: Added support for the :ref:`Argon2 password hash <argon2_usage>`. It's recommended over PBKDF2, however, it's not the default as it requires a third-party library.
id: Ditambahkan dukungan untuk :ref:`Argon2 password hash <argon2_usage>`. Dianjurkan terhadap PBKDF2, bagaimanapun, itu bukan awal seperti itu membutuhkan pustaka pihak-ketiga.
zh_hans: 增加了对 :ref:`Argon2 密码哈希 <argon2_usage>` 的支持。它被推荐用于替代 PBKDF2，但不是默认选项，因为它需要一个第三方库。

source: The default iteration count for the PBKDF2 password hasher has been increased by 25%. This backwards compatible change will not affect users who have subclassed ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` to change the default value.
id: Perhitungan perulangan awal untuk pengacak sandi PBKDF2 telah ditingkatkan oleh 25%. Perubahan kesesuaian kebelakang tidak akan mempengaruhi pengguna yang mempunyai subkelas ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` untuk merubah nilai awal.
zh_hans: PBKDF2 密码哈希的默认迭代次数已增加 25%。这个向后兼容的更改不会影响那些已经子类化了 ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` 以更改默认值的用户。

source: The ``django.contrib.auth.views.logout()`` view sends "no-cache" headers to prevent an issue where Safari caches redirects and prevents a user from being able to log out.
id: Tampilan ``django.contrib.auth.views.logout()`` mengirim kepala "no-cache" untuk mencegah sebuah masalah dimana cache Safari pengalihan dan mencegah seorang pengguna menjadi dapat keluar.
zh_hans: ``django.contrib.auth.views.logout()`` 视图发送 "no-cache" 标头，以防止 Safari 缓存重定向并阻止用户注销的问题。

source: Added the optional ``backend`` argument to :func:`django.contrib.auth.login` to allow using it without credentials.
id: Ditambahkan argumen pilihan ``backend`` pada :func:`django.contrib.auth.login` untuk menggunakan itu tanpa without surat pengenal.
zh_hans: 新增了可选的 ``backend`` 参数以供 :func:`django.contrib.auth.login` 使用，允许在没有凭据的情况下使用它。

source: The new :setting:`LOGOUT_REDIRECT_URL` setting controls the redirect of the ``django.contrib.auth.views.logout()`` view, if the view doesn't get a ``next_page`` argument.
id: Pengaturan :setting:`LOGOUT_REDIRECT_URL` baru mengendalikan pengalihan dari tampilan :func:`~django.contrib.auth.views.logout()`, jika tampilan tidak mendapatkan argumen ``next_page``.
zh_hans: 新的 :setting:`LOGOUT_REDIRECT_URL` 设置控制了 ``django.contrib.auth.views.logout()`` 视图的重定向，如果视图没有得到一个 ``next_page`` 参数。

source: The new ``redirect_authenticated_user`` parameter for the ``django.contrib.auth.views.login()`` view allows redirecting authenticated users visiting the login page.
zh_hans: 新的 ``redirect_authenticated_user`` 参数用于 ``django.contrib.auth.views.login()`` 视图，允许重定向已经经过身份验证的用户访问登录页面。

source: The new :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` and :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` ignore the value of ``User.is_active``, while :class:`~django.contrib.auth.backends.ModelBackend` and :class:`~django.contrib.auth.backends.RemoteUserBackend` now reject inactive users.
id: :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` dan :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` baru mengabaikan nilai dari ``User.is_active``, selagi :class:`~django.contrib.auth.backends.ModelBackend` dan :class:`~django.contrib.auth.backends.RemoteUserBackend` sekarang menolak pengguna tidak aktif.
zh_hans: 新的 :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` 和 :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` 忽略了 ``User.is_active`` 的值，而 :class:`~django.contrib.auth.backends.ModelBackend` 和 :class:`~django.contrib.auth.backends.RemoteUserBackend` 现在拒绝不活动的用户。

source: :ref:`Distance lookups <distance-lookups>` now accept expressions as the distance value parameter.
id: :ref:`Distance lookups <distance-lookups>` sekarang menerima pernyataan sebagai jarak parameter nilai.
zh_hans: :ref:`距离查找 <distance-lookups>` 现在接受表达式作为距离值参数。

source: The new :attr:`GEOSGeometry.unary_union <django.contrib.gis.geos.GEOSGeometry.unary_union>` property computes the union of all the elements of this geometry.
id: Harta :attr:`GEOSGeometry.unary_union <django.contrib.gis.geos.GEOSGeometry.unary_union>` baru menghitung gabungan dari semua unsur dari geometri ini.
zh_hans: 新的 :attr:`GEOSGeometry.unary_union <django.contrib.gis.geos.GEOSGeometry.unary_union>` 属性计算了此几何对象的所有元素的并集。

source: Added the :meth:`GEOSGeometry.covers() <django.contrib.gis.geos.GEOSGeometry.covers>` binary predicate.
id: Ditambahkan sebutan biner :meth:`GEOSGeometry.covers() <django.contrib.gis.geos.GEOSGeometry.covers>`.
zh_hans: 新增了 :meth:`GEOSGeometry.covers() <django.contrib.gis.geos.GEOSGeometry.covers>` 二元谓词。

source: Added the :meth:`GDALBand.statistics() <django.contrib.gis.gdal.GDALBand.statistics>` method and :attr:`~django.contrib.gis.gdal.GDALBand.mean` and :attr:`~django.contrib.gis.gdal.GDALBand.std` attributes.
id: Ditambahkan metode :meth:`GDALBand.statistics() <django.contrib.gis.gdal.GDALBand.statistics>` dan atribut :attr:`~django.contrib.gis.gdal.GDALBand.mean` dan :attr:`~django.contrib.gis.gdal.GDALBand.std`.
zh_hans: 新增了 :meth:`GDALBand.statistics() <django.contrib.gis.gdal.GDALBand.statistics>` 方法以及 :attr:`~django.contrib.gis.gdal.GDALBand.mean` 和 :attr:`~django.contrib.gis.gdal.GDALBand.std` 属性。
