Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Django now offers password validation to help prevent the usage of weak passwords by users. The validation is integrated in the included password change and reset forms and is simple to integrate in any other code. Validation is performed by one or more validators, configured in the new :setting:`AUTH_PASSWORD_VALIDATORS` setting.
id: Django sekarang menawarkan pengesahan sandi untuk membantu mencegah penggunaan dari sandi lemah oleh pengguna. Pengesahan dipadaukan di perubahan sandi disertakan dan menyetel formulir dan cukup memadukan di kode lain apapum. Pengesahan dilakukan oleh satu atau lebih pengesah, dikonfigurasikan di pengaturan :setting:`AUTH_PASSWORD_VALIDATORS` baru.
zh_hans: Django 现在提供密码验证功能，以帮助防止用户使用弱密码。该验证已集成在包含的密码更改和重置表单中，并且可以简单地集成到任何其他代码中。验证由一个或多个验证器执行，可以在新的 :setting:`AUTH_PASSWORD_VALIDATORS` 设置中配置。

source: Four validators are included in Django, which can enforce a minimum length, compare the password to the user's attributes like their name, ensure passwords aren't entirely numeric, or check against an included list of common passwords. You can combine multiple validators, and some validators have custom configuration options. For example, you can choose to provide a custom list of common passwords. Each validator provides a help text to explain its requirements to the user.
id: Empat pengesah disertakan di Django, yang dapat memaksa panjang minimal, bandingkan sandi pada atribut pengguna seperti nama mereka, pastikan sandi tidak seluruhnya numerik, atau periksa kembali sebuah daftar disertakan dari sandi umum. Anda dapat memadukan banyak pengesah, dan beberapa pengesah mempunyai penyesuaian pilihan konfigurasi. Sebagai contoh, anda dapat memilih menyediakan sebuah daftar penyesuaian dari sandi umum. Setiap pengesah menyediakan sebuah teks bantuan untuk menjelaskan persyaratannya ke pengguna.
zh_hans: Django 中包含了四个验证器，可以强制实施最小长度、将密码与用户的属性进行比较（如姓名）、确保密码不全为数字，或者检查是否在包含的常见密码列表中。您可以组合多个验证器，并且某些验证器具有自定义配置选项。例如，您可以选择提供自定义的常见密码列表。每个验证器都提供帮助文本，向用户解释其要求。

source: By default, no validation is performed and all passwords are accepted, so if you don't set :setting:`AUTH_PASSWORD_VALIDATORS`, you will not see any change. In new projects created with the default :djadmin:`startproject` template, a simple set of validators is enabled. To enable basic validation in the included auth forms for your project, you could set, for example::
id: Secara awalan, tidak ada pengesahan dilakukan dan semua sandi diterima, jadi jika anda tidak menyetel :setting:`AUTH_PASSWORD_VALIDATORS`, anda tidak akan melihat perubahan apapun. Di proyek baru dibuat dengan cetakan :djadmin:`startproject` awalan, kumpulan sederhana dari pengesah diadakan. Untuk mengadakan pengesahan dasar di formulir autentifikasi yang disertakan untuk proyek anda, anda dapat menyetel, sebagai contoh::
zh_hans: 默认情况下，不执行任何验证，所有密码都会被接受，因此如果您不设置 :setting:`AUTH_PASSWORD_VALIDATORS`，您将不会看到任何更改。在使用默认 :djadmin:`startproject` 模板创建的新项目中，已启用一组简单的验证器。要在您的项目中为包含的认证表单启用基本验证，您可以设置如下配置，例如：

source: See :ref:`password-validation` for more details.
id: Lihat :ref:`password-validation` untuk lebih rinci.
zh_hans: 有关更多详细信息，请参阅 :ref:`password-validation`。

source: Permission mixins for class-based views
id: Perizinan mixin untuk tampilan berdasarkan-kelas
zh_hans: 用于基于类的视图的权限混合类

source: Django now ships with the mixins :class:`~django.contrib.auth.mixins.AccessMixin`, :class:`~django.contrib.auth.mixins.LoginRequiredMixin`, :class:`~django.contrib.auth.mixins.PermissionRequiredMixin`, and :class:`~django.contrib.auth.mixins.UserPassesTestMixin` to provide the functionality of the ``django.contrib.auth.decorators`` for class-based views. These mixins have been taken from, or are at least inspired by, the `django-braces`_ project.
id: Django sekarang dibekali dengan campuran :class:`~django.contrib.auth.mixins.AccessMixin`, :class:`~django.contrib.auth.mixins.LoginRequiredMixin`, :class:`~django.contrib.auth.mixins.PermissionRequiredMixin`, dan :class:`~django.contrib.auth.mixins.UserPassesTestMixin` untuk menyediakan kegunaan dari ``django.contrib.auth.decorators`` untuk tampilan berdasarkan-kelas. Campuran ini telah diambil dari, atau setidaknya diilhami oleh, proyek `django-braces`_.
zh_hans: Django 现在包含了一些 mixin 类，如 :class:`~django.contrib.auth.mixins.AccessMixin`、:class:`~django.contrib.auth.mixins.LoginRequiredMixin`、:class:`~django.contrib.auth.mixins.PermissionRequiredMixin` 和 :class:`~django.contrib.auth.mixins.UserPassesTestMixin`，用于为基于类的视图提供与 ``django.contrib.auth.decorators`` 相同的功能。这些 mixin 类来自或受到了 `django-braces`_ 项目的启发。

source: There are a few differences between Django's and ``django-braces``\' implementation, though:
id: Ada sedikit perbedaan diantara penerapan Django dan ``django-braces`, meskipun:
zh_hans: 尽管如此，在 Django 和 ``django-braces``\' 的实现之间存在一些差异：

source: The :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception` attribute can only be ``True`` or ``False``. Custom exceptions or callables are not supported.
id: Atribut :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception` hanya dapat menjadi ``True`` atau ``False``. Penyesuaian pengecualian atau callable tidak didukung.
zh_hans: :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception` 属性只能为 ``True`` 或 ``False``。不支持自定义异常或可调用对象。

source: The :meth:`~django.contrib.auth.mixins.AccessMixin.handle_no_permission` method does not take a ``request`` argument. The current request is available in ``self.request``.
id: Metode :meth:`~django.contrib.auth.mixins.AccessMixin.handle_no_permission` tidak mengambil argumen ``request``. Permintaan saat ini tersedia di ``self.request``.
zh_hans: :meth:`~django.contrib.auth.mixins.AccessMixin.handle_no_permission` 方法不接受 ``request`` 参数。当前请求可在 ``self.request`` 中获取。

source: The custom ``test_func()`` of :class:`~django.contrib.auth.mixins.UserPassesTestMixin` does not take a ``user`` argument. The current user is available in ``self.request.user``.
id: Penyesuaian ``test_func()`` dari :class:`~django.contrib.auth.mixins.UserPassesTestMixin` tidak mengambil sebuah argumen ``user``. Pengguna saat ini tersedia di ``self.request.user``.
zh_hans: :class:`~django.contrib.auth.mixins.UserPassesTestMixin` 的自定义 ``test_func()`` 不接受 ``user`` 参数。当前用户可在 ``self.request.user`` 中获取。

source: The :attr:`permission_required <django.contrib.auth.mixins.PermissionRequiredMixin>` attribute supports a string (defining one permission) or a list/tuple of strings (defining multiple permissions) that need to be fulfilled to grant access.
id: Atribut :attr:`permission_required <django.contrib.auth.mixins.PermissionRequiredMixin>` mendukung sebuah string (menentukan satu perizinan) atau sebuah daftar/tuple dari string (menentukan banyak perizinan) yang butuh dipenuhi untuk memberikan akses.
zh_hans: :attr:`permission_required <django.contrib.auth.mixins.PermissionRequiredMixin>` 属性支持一个字符串（定义一个权限）或一个字符串的列表/元组（定义多个权限），这些权限需要满足才能授予访问权限。

source: The new :attr:`~django.contrib.auth.mixins.AccessMixin.permission_denied_message` attribute allows passing a message to the ``PermissionDenied`` exception.
id: Atribut :attr:`~django.contrib.auth.mixins.AccessMixin.permission_denied_message` baru mengizinkan melewatkan sebuah pesan ke pengecualian ``PermissionDenied``.
zh_hans: 新的 :attr:`~django.contrib.auth.mixins.AccessMixin.permission_denied_message` 属性允许传递消息给 ``PermissionDenied`` 异常。

source: New styling for ``contrib.admin``
id: Gaya baru untuk ``contrib.admin``
zh_hans: ``contrib.admin`` 中的新样式

source: The admin sports a modern, flat design with new SVG icons which look perfect on HiDPI screens. It still provides a fully-functional experience to `YUI's A-grade`_ browsers. Older browser may experience varying levels of graceful degradation.
zh_hans: 管理员界面采用了现代的扁平设计，使用新的 SVG 图标，在高分辨率屏幕上效果非常好。它仍然在 `YUI's A-grade`_ 浏览器中提供了完全功能的体验。较旧的浏览器可能会有不同程度的优雅降级。

source: Running tests in parallel
id: Menjalankan percobaan secara sejalan
zh_hans: 并行运行测试

source: The :djadmin:`test` command now supports a :option:`--parallel <test --parallel>` option to run a project's tests in multiple processes in parallel.
id: Pilihan :djadmin:`test` command now supports a :option:`--parallel <test --parallel>` untuk menjalankan percobaan proyek di banyak pengolahan secara sejalan.
zh_hans: :djadmin:`test` 命令现在支持 :option:`--parallel <test --parallel>` 选项，可以并行运行项目的测试，使用多个进程。

source: Each process gets its own database. You must ensure that different test cases don't access the same resources. For instance, test cases that touch the filesystem should create a temporary directory for their own use.
id: Setiap pengolahan mendapatkan basisdatanya sendiri. Anda harus memastikan bahwa kasus-kasus percobaan berbeda tidak mengakses sumberdaya sama. Sebagai contoh, kasus-kasus percobaan yang menyentuh sistem berkas harus membuat direktori sementara untuk penggunaan mereka sendiri.
zh_hans: 每个进程都会得到它们自己的数据库。你必须确保不同的测试用例不会访问相同的资源。例如，接触文件系统的测试用例应该创建一个临时目录供自己使用。

source: This option is enabled by default for Django's own test suite provided:
id: Pilihan diadakan secara awalan untuk deretan percobaan sendiri Django disediakan:
zh_hans: 对于 Django 自身的测试套件，默认情况下启用了此选项。

source: the OS supports it (all but Windows)
id: SO mengukung itu (semua kecuali Windows)
zh_hans: 只要操作系统支持（除了 Windows），此选项就会默认启用。

source: the database backend supports it (all the built-in backends but Oracle)
id: backend basisdata mendukung itu (semua backend siap-pakai kecuali Oracle)
zh_hans: 只要数据库后端支持（除了 Oracle），此选项就会默认启用。

source: Admin views now have ``model_admin`` or ``admin_site`` attributes.
id: Tampilan admin sekarang mempunyai atribut ``model_admin`` atau ``admin_site``
zh_hans: 管理员视图现在具有 ``model_admin`` 或 ``admin_site`` 属性。

source: The URL of the admin change view has been changed (was at ``/admin/<app>/<model>/<pk>/`` by default and is now at ``/admin/<app>/<model>/<pk>/change/``). This should not affect your application unless you have hardcoded admin URLs. In that case, replace those links by :ref:`reversing admin URLs <admin-reverse-urls>` instead. Note that the old URL still redirects to the new one for backwards compatibility, but it may be removed in a future version.
id: URL dari tampilan rubah admin telah berubah (sebelumnya di ``/admin/<app>/<model>/<pk>/`` secara awalan dan sekarang di ``/admin/<app>/<model>/<pk>/change/``). Ini tidak harus mempengaruhi aplikasi anda meskipun anda mengkode keraskan URL admin. Dalam kasus itu, ganti tautan tersebut dengan :ref:`reversing admin URLs <admin-reverse-urls>` . Catat bahwa URL lama masih megnalihkan ke satu yang baru dari kesesuaian kebelakang, tetapi itu mungkin dipindahkan di versi akan datang.
zh_hans: 管理员更改视图的 URL 已更改（默认情况下是 ``/admin/<app>/<model>/<pk>/``，现在是 ``/admin/<app>/<model>/<pk>/change/``）。这不会影响您的应用程序，除非您已经硬编码了管理员的 URL。在这种情况下，建议使用 :ref:`反向管理员 URL <admin-reverse-urls>` 来替代这些链接。请注意，旧的 URL 仍然会重定向到新的 URL 以保持向后兼容，但它可能在将来的版本中被删除。

source: :meth:`ModelAdmin.get_list_select_related() <django.contrib.admin.ModelAdmin.get_list_select_related>` was added to allow changing the ``select_related()`` values used in the admin's changelist query based on the request.
id: :meth:`ModelAdmin.get_list_select_related() <django.contrib.admin.ModelAdmin.get_list_select_related>` telah ditambahkan untuk mengizinkan perubahan nilai-nilai ``select_related()`` di permintaan daftar rubah admin berdasarkan pada permintaan.
zh_hans: 添加了 :meth:`ModelAdmin.get_list_select_related() <django.contrib.admin.ModelAdmin.get_list_select_related>` 方法，允许根据请求更改管理员的变更列表查询中使用的 ``select_related()`` 值。

source: The ``available_apps`` context variable, which lists the available applications for the current user, has been added to the :meth:`AdminSite.each_context() <django.contrib.admin.AdminSite.each_context>` method.
id: Variabel konteks ``available_apps``, yang mendaftar aplikasi tersedia untuk pengguna saat ini, telah ditambahkan ke metode :meth:`AdminSite.each_context() <django.contrib.admin.AdminSite.each_context>`.
zh_hans: 已将 ``available_apps`` 上下文变量添加到 :meth:`AdminSite.each_context() <django.contrib.admin.AdminSite.each_context>` 方法中，该变量列出了当前用户可用的应用程序。

source: :attr:`AdminSite.empty_value_display <django.contrib.admin.AdminSite.empty_value_display>` and :attr:`ModelAdmin.empty_value_display <django.contrib.admin.ModelAdmin.empty_value_display>` were added to override the display of empty values in admin change list. You can also customize the value for each field.
id: :attr:`AdminSite.empty_value_display <django.contrib.admin.AdminSite.empty_value_display>` dan :attr:`ModelAdmin.empty_value_display <django.contrib.admin.ModelAdmin.empty_value_display>` telah ditambahkan untuk menimpa tampilan dari nilai-nilai kosong di daftar rubah admin. Anda dapat juga menyesuaikan nilai untuk setiap bidang.
zh_hans: 添加了 :attr:`AdminSite.empty_value_display <django.contrib.admin.AdminSite.empty_value_display>` 和 :attr:`ModelAdmin.empty_value_display <django.contrib.admin.ModelAdmin.empty_value_display>`，用于覆盖管理员更改列表中空值的显示。您还可以为每个字段自定义该值。

source: Added jQuery events :ref:`when an inline form is added or removed <admin-javascript-inline-form-events>` on the change form page.
id: Ditambahkan acara jQuery :ref:`when an inline form is added or removed <admin-javascript-inline-form-events>` pada perubahan halaman formulir.
zh_hans: 在更改表单页面上添加了 jQuery 事件，用于 :ref:`在添加或删除内联表单时 <admin-javascript-inline-form-events>`。

source: The time picker widget includes a '6 p.m' option for consistency of having predefined options every 6 hours.
id: Widget pengambil waktu menyertakan pilihan '6 p.m' untuk ketetapan dari memiliki pilihan yang telah ditetapkan setiap 6 jam.
zh_hans: 时间选择器小部件包括一个“下午 6 点”的选项，以保持每 6 小时预定义选项的一致性。

source: JavaScript slug generation now supports Romanian characters.
id: Pembangkitan keong JavaScript sekarang mendukung karakter Rumania.
zh_hans: 现在，JavaScript 的 slug 生成支持罗马尼亚字符。

source: The model section of the ``admindocs`` now also describes methods that take arguments, rather than ignoring them.
id: Bagian model dari ``admindocs`` sekarang juga menggambarkan metode yang mengambil argumen, daripada mengabaikan mereka.
zh_hans: ``admindocs`` 的模型部分现在还描述了接受参数的方法，而不是忽略它们。

source: The default iteration count for the PBKDF2 password hasher has been increased by 20%. This backwards compatible change will not affect users who have subclassed ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` to change the default value.
id: Perhitungan perulangan awal untuk pengacak sandi PBKDF2 telah ditingkatkan oleh 20%. Perubahan kesesuaian kebelakang tidak akan mempengaruhi pengguna yang mempunyai subkelas ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` untuk merubah nilai awal.
zh_hans: PBKDF2 密码哈希器的默认迭代次数增加了 20%。这个向后兼容的更改不会影响那些已经子类化了 ``django.contrib.auth.hashers.PBKDF2PasswordHasher`` 来更改默认值的用户。

source: The ``BCryptSHA256PasswordHasher`` will now update passwords if its ``rounds`` attribute is changed.
id: ``BCryptSHA256PasswordHasher`` akan sekarang memperbaharui sandi jika atribut ``rounds`` nya berubah.
zh_hans: 如果更改了 ``BCryptSHA256PasswordHasher`` 的 ``rounds`` 属性，它将更新密码。

source: ``AbstractBaseUser`` and ``BaseUserManager`` were moved to a new ``django.contrib.auth.base_user`` module so that they can be imported without including ``django.contrib.auth`` in :setting:`INSTALLED_APPS` (doing so raised a deprecation warning in older versions and is no longer supported in Django 1.9).
id: ``AbstractBaseUser`` dan ``BaseUserManager`` dipindahkan ke modul ``django.contrib.auth.base_user`` baru sehingga mereka dapat diimpor tanpa menyertakan ``django.contrib.auth`` di :setting:`INSTALLED_APPS` (melakukannya memunculkan peringatan pengusangan di versi terlama dan tidak lagi didukung di Django 1.9).
zh_hans: ``AbstractBaseUser`` 和 ``BaseUserManager`` 被移动到了新的 ``django.contrib.auth.base_user`` 模块，因此可以在不包括 ``django.contrib.auth`` 在 :setting:`INSTALLED_APPS` 中的情况下导入它们（在较旧的版本中，这样做会引发废弃警告，在 Django 1.9 中不再支持）。

source: The permission argument of :func:`~django.contrib.auth.decorators.permission_required()` accepts all kinds of iterables, not only list and tuples.
id: Argumen perizinan dari :func:`~django.contrib.auth.decorators.permission_required()` menerima semua macam dari perulangan, tidak hanya daftar dan tuple.
zh_hans: :func:`~django.contrib.auth.decorators.permission_required()` 的权限参数接受所有类型的可迭代对象，而不仅仅是列表和元组。

source: The new :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` makes it possible to use ``REMOTE_USER`` for setups where the header is only populated on login pages instead of every request in the session.
id: :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` baru membuat itu memungkinkan menggunakan ``REMOTE_USER`` untuk pengaturan dimana kepala hanya dikumpulkan pada halaman masuk daripada setiap permintaan di sesi.
zh_hans: 新的 :class:`~django.contrib.auth.middleware.PersistentRemoteUserMiddleware` 使得在仅在登录页面上填充标头的设置中使用 ``REMOTE_USER`` 成为可能，而不是在会话的每个请求中都填充。

source: The ``django.contrib.auth.views.password_reset()`` view accepts an ``extra_email_context`` parameter.
zh_hans: ``django.contrib.auth.views.password_reset()`` 视图接受一个 ``extra_email_context`` 参数。

source: It's now possible to use :attr:`~django.db.models.Options.order_with_respect_to` with a ``GenericForeignKey``.
id: Itu sekarang memungkinkan menggunakan :attr:`~django.db.models.Options.order_with_respect_to` dengan ``GenericForeignKey``.
zh_hans: 现在可以在 ``GenericForeignKey`` 中使用 :attr:`~django.db.models.Options.order_with_respect_to`。

source: All ``GeoQuerySet`` methods have been deprecated and replaced by :doc:`equivalent database functions </ref/contrib/gis/functions>`. As soon as the legacy methods have been replaced in your code, you should even be able to remove the special ``GeoManager`` from your GIS-enabled classes.
id: Semua metode ``GeoQuerySet`` telah diusangkan dan diganti oleh :doc:`equivalent database functions </ref/contrib/gis/functions>`. Segera setelah metode warisan telah diganti di kode anda, anda harus bahkan dapat memindahkan ``GeoManager`` khusus dari kelas-kelas diadakan-GIS anda.
zh_hans: 所有 ``GeoQuerySet`` 方法都已被废弃，并被 :doc:`等效的数据库函数 </ref/contrib/gis/functions>` 替代。一旦在您的代码中替换了这些旧方法，您甚至可以从启用 GIS 的类中删除特殊的 ``GeoManager``。

source: The GDAL interface now supports instantiating file-based and in-memory :ref:`GDALRaster objects <raster-data-source-objects>` from raw data. Setters for raster properties such as projection or pixel values have been added.
id: Antarmuka GDAL sekarang mendukung instansiasi berdasarkan-berkas dan :ref:`GDALRaster objects <raster-data-source-objects>` dalam-memori dari data mentah. Penyetel untuk sifat raster seperti proyeksi atau nilai-nilai pixel telah ditambahkan.
zh_hans: GDAL 接口现在支持从原始数据实例化基于文件和内存的 :ref:`GDALRaster 对象 <raster-data-source-objects>`。已添加了用于栅格属性（如投影或像素值）的设置器。

source: For PostGIS users, the new :class:`~django.contrib.gis.db.models.RasterField` allows :ref:`storing GDALRaster objects <creating-and-saving-raster-models>`. It supports automatic spatial index creation and reprojection when saving a model. It does not yet support spatial querying.
id: Untuk pengguna PostGIS, :class:`~django.contrib.gis.db.models.RasterField` baru mengizinkan :ref:`storing GDALRaster objects <creating-and-saving-raster-models>`. Itu mendukung pembuatan indeks spasial otomatis dan proyeksi ulang ketika menyimpan sebuah model. Itu belum mendukung permintaan spasial.
zh_hans: 对于 PostGIS 用户，新的 :class:`~django.contrib.gis.db.models.RasterField` 允许 :ref:`存储 GDALRaster 对象 <creating-and-saving-raster-models>`。它支持在保存模型时自动创建空间索引和重投影。但它目前还不支持空间查询。

source: The new :meth:`GDALRaster.warp() <django.contrib.gis.gdal.GDALRaster.warp>` method allows warping a raster by specifying target raster properties such as origin, width, height, or pixel size (among others).
zh_hans: 新的 :meth:`GDALRaster.warp() <django.contrib.gis.gdal.GDALRaster.warp>` 方法允许通过指定目标栅格属性（如原点、宽度、高度或像素大小等）来进行栅格重投影。

source: The new :meth:`GDALRaster.transform() <django.contrib.gis.gdal.GDALRaster.transform>` method allows transforming a raster into a different spatial reference system by specifying a target ``srid``.
id: Metode :meth:`GDALRaster.transform() <django.contrib.gis.gdal.GDALRaster.transform>` mengizinkan perubahan sebuah raster menjadi sebuah spasial berbeda mengacu sistem dengan menentukan sebuah sasaran ``srid``.
zh_hans: 新的 :meth:`GDALRaster.transform() <django.contrib.gis.gdal.GDALRaster.transform>` 方法允许通过指定目标 ``srid`` 来将栅格转换为不同的空间参考系统。

source: The new :class:`~django.contrib.gis.geoip2.GeoIP2` class allows using MaxMind's GeoLite2 databases which includes support for IPv6 addresses.
id: Kelas :class:`~django.contrib.gis.geoip2.GeoIP2` baru mengizinkan menggunakan basisdata GeoLite2 MaxMind yang menyertakan dukungan untuk alamat IPv6.
zh_hans: 新的 :class:`~django.contrib.gis.geoip2.GeoIP2` 类允许使用 MaxMind 的 GeoLite2 数据库，其中包括对 IPv6 地址的支持。

source: The default OpenLayers library version included in widgets has been updated from 2.13 to 2.13.1.
id: Versi pustaka OpenLayer awalan disertakan dalam widget telah diperbaharui dari 2.13 menjadi 2.13.1.
zh_hans: 包含在小部件中的默认 OpenLayers 库版本已从 2.13 更新为 2.13.1 。

source: Added support for the :lookup:`rangefield.contained_by` lookup for some built in fields which correspond to the range fields.
id: Ditambahkan dukungan untuk pencarian :lookup:`rangefield.contained_by` untuk beberapa bidang siap pakai yang berhubungan ke jangkauan bidang
zh_hans: 为一些内置字段添加了对 :lookup:`rangefield.contained_by` 查找的支持，这些字段对应于范围字段。

source: Added ``django.contrib.postgres.fields.JSONField``.
zh_hans: 添加了 ``django.contrib.postgres.fields.JSONField``。

source: Added :doc:`/ref/contrib/postgres/aggregates`.
id: Ditambahkan :doc:`/ref/contrib/postgres/aggregates`.
zh_hans: 添加了 :doc:`/ref/contrib/postgres/aggregates`。

source: Added the :class:`~django.contrib.postgres.functions.TransactionNow` database function.
id: Ditambahkan fungsi basisdata :class:`~django.contrib.postgres.functions.TransactionNow`.
zh_hans: 添加了 :class:`~django.contrib.postgres.functions.TransactionNow` 数据库函数。

source: The session model and ``SessionStore`` classes for the ``db`` and ``cached_db`` backends are refactored to allow a custom database session backend to build upon them. See :ref:`extending-database-backed-session-engines` for more details.
id: Model sesi dan kelas-kelas ``SessionStore`` untuk backend ``db`` dan ``cached_db`` direfaktor untuk mengizinkan penyesuaian backend basisdata untuk membangun atas mereka. Lihat :ref:`extending-database-backed-session-engines` untuk rincian lebih.
zh_hans: 会话模型和用于 ``db`` 和 ``cached_db`` 后端的 ``SessionStore`` 类已进行了重构，以允许自定义数据库会话后端基于它们构建。有关更多详细信息，请参阅 :ref:`extending-database-backed-session-engines`。

source: :func:`~django.contrib.sites.shortcuts.get_current_site` now handles the case where ``request.get_host()`` returns ``domain:port``, e.g. ``example.com:80``. If the lookup fails because the host does not match a record in the database and the host has a port, the port is stripped and the lookup is retried with the domain part only.
id: :func:`~django.contrib.sites.shortcuts.get_current_site` sekarang menangani kasus dimana ``request.get_host()`` mengembalikan ``domain:port``, sebagai contoh ``example.com:80``. Jika pencarian gagal karena rumah tidak cocok sebuah rekaman di basisdata dan rumah mempunyai sebuah port, port dilucuti dan pencarian dicoba dengan hanya sebagian ranah.
zh_hans: :func:`~django.contrib.sites.shortcuts.get_current_site` 现在处理了 ``request.get_host()`` 返回 ``domain:port`` 的情况，例如 ``example.com:80``。如果查找失败，因为主机在数据库中找不到记录并且主机有一个端口，端口会被剥离，然后使用仅包含域名的部分重试查找。
