Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Depending on the value of the :setting:`EMAIL_BACKEND` setting, this may not return an SMTP connection. If you explicitly require an SMTP connection with which to send email, you can explicitly request an SMTP connection::
id: Tergantung pada nilai dari pengaturan :setting:`EMAIL_BACKEND`, ini mungkin tidak mengembalikan hubungan SMTP. Jika anda secara eksplisit membutuhkan sebuah hubungan SMTP dengan yang mengirim surel, anda dapat secara eksplisit meminta sebuah hubungan SMTP::
zh_hans: 根据 :setting:`EMAIL_BACKEND` 设置的值，这可能不会返回一个 SMTP 连接。如果你明确需要一个用于发送电子邮件的 SMTP 连接，可以显式请求一个 SMTP 连接：

source: If your call to construct an instance of ``SMTPConnection`` required additional arguments, those arguments can be passed to the :meth:`~django.core.mail.get_connection()` call::
id: Jika panggilan anda untuk membangun sebuah instance dari ``SMTPConnection`` membutuhkan argumen tambahan, argumen-argumen itu dapat dilewatkan ke panggilan :meth:`~django.core.mail.get_connection()`::
zh_hans: 如果你构造 ``SMTPConnection`` 实例的调用需要额外的参数，这些参数可以传递给 :meth:`~django.core.mail.get_connection()` 调用：

source: User Messages API
id: API Pesan Pengguna
zh_hans: 用户消息 API

source: The API for storing messages in the user ``Message`` model (via ``user.message_set.create``) is now deprecated and will be removed in Django 1.4 according to the standard :doc:`release process </internals/release-process>`.
id: API untuk menyimpan pesan-pesan di model ``Message`` pengguna (melalui ``user.message_set.create``) sekarang diusangkan dan akan dipindahkan di Django 1.4 menurut ke standar :doc:`release process </internals/release-process>`.
zh_hans: 通过 ``user.message_set.create`` 在用户 ``Message`` 模型中存储消息的 API 已被弃用，并将根据标准的 :doc:`发布流程 </internals/release-process>` 在 Django 1.4 中移除。

source: To upgrade your code, you need to replace any instances of this::
id: Untuk meningkatkan kode anda, anda butuh mengganti instance dari ini::
zh_hans: 要升级你的代码，你需要替换所有这样的实例：

source: ...with the following::
id: ...dengan berikut::
zh_hans: ... 替换为以下内容：

source: Additionally, if you make use of the method, you need to replace the following::
id: Tambahan, jika anda menggunakan metode , anda butuh mengganti berikut::
zh_hans: 此外，如果你使用这个方法，你需要替换以下内容：

source: ...with::
id: ...dengan::
zh_hans: ... 替换为：

source: For more information, see the full :doc:`messages documentation </ref/contrib/messages>`. You should begin to update your code to use the new API immediately.
id: Untuk informasi lebih, lihat :doc:`messages documentation </ref/contrib/messages>` penuh. Anda harus mulai memperbaharui kode anda untuk menggunakan API baru segera mungkin.
zh_hans: 有关更多信息，请参阅完整的 :doc:`消息文档 </ref/contrib/messages>`。你应该立即开始更新你的代码以使用新的 API。

source: Date format helper functions
id: Fungsi pembantu bentuk tanggal
zh_hans: 日期格式辅助函数

source: ``django.utils.translation.get_date_formats()`` and ``django.utils.translation.get_partial_date_formats()`` have been deprecated in favor of the appropriate calls to ``django.utils.formats.get_format()``, which is locale-aware when ``USE_L10N`` is set to ``True``, and falls back to default settings if set to ``False``.
zh_hans: ``django.utils.translation.get_date_formats()`` 和 ``django.utils.translation.get_partial_date_formats()`` 已被弃用，推荐使用适当的调用 ``django.utils.formats.get_format()``，当 ``USE_L10N`` 设置为 ``True`` 时，它是区域感知的，并在设置为 ``False`` 时回退到默认设置。

source: To get the different date formats, instead of writing this::
id: Untuk mendapatkan bentuk tanggal berbeda, alih-alih menulis ini::
zh_hans: 要获得不同的日期格式，而不是编写这样的代码：

source: ...use::
id: ...gunakan::
zh_hans: ... 使用：

source: Or, when directly formatting a date value::
id: Atau, ketika secara langsung membentuk sebuah nilai tanggal::
zh_hans: 或者，在直接格式化日期值时：

source: The same applies to the globals found in ``django.forms.fields``:
id: Hal yang sama berlaku pada global ditemukan di ``django.forms.fields``:
zh_hans: 同样适用于 ``django.forms.fields`` 中找到的全局变量：

source: Use ``django.utils.formats.get_format()`` to get the appropriate formats.
id: Gunakan ``django.utils.formats.get_format()`` untuk mendapatkan bentuk yang sesuai.
zh_hans: 使用 ``django.utils.formats.get_format()`` 获取适当的格式。

source: Function-based test runners
id: Pejalan percobaan berdasarkan-fungsi
zh_hans: 基于函数的测试运行器

source: Django 1.2 changes the test runner tools to use a class-based approach. Old style function-based test runners will still work, but should be updated to use the new :ref:`class-based runners <topics-testing-test_runner>`.
id: Django 1.2 merubah alat pejalan percobaan untuk menggunakan pendekatan berdasarkan-kelas. Pejalan percobaan berdasarkan fungsi gaya lama akan masih bekerja, tetapi harus diperbaharui untuk menggunakan :ref:`class-based runners <topics-testing-test_runner>` baru.
zh_hans: Django 1.2 更改了测试运行工具以使用基于类的方法。旧式的基于函数的测试运行工具仍然可以工作，但应该更新为使用新的 :ref:`基于类的运行工具 <topics-testing-test_runner>`。

source: ``Feed`` in ``django.contrib.syndication.feeds``
id: ``Umpan balik`` di ``django.contrib.syndication.feeds``
zh_hans: ``django.contrib.syndication.feeds`` 中的 ``Feed``

source: The ``django.contrib.syndication.feeds.Feed`` class has been replaced by the :class:`django.contrib.syndication.views.Feed` class. The old ``feeds.Feed`` class is deprecated, and will be removed in Django 1.4.
id: Kelas ``django.contrib.syndication.feeds.Feed`` telah diganti oleh kelas :class:`django.contrib.syndication.views.Feed`. Kelas ``feeds.Feed`` lama diusangkan, dan akan dipindakan di Django 1.4.
zh_hans: ``django.contrib.syndication.feeds.Feed`` 类已被 :class:`django.contrib.syndication.views.Feed` 类替代。旧的 ``feeds.Feed`` 类已被弃用，并将在 Django 1.4 中移除。

source: The new class has an almost identical API, but allows instances to be used as views. For example, consider the use of the old framework in the following :doc:`URLconf </topics/http/urls>`::
id: Kelas baru mempunyai hampir API yang mirip, tetapi mengizinkan instance digunakan sebagai tampilan. Sebagai contoh, pertimbangkan menggunakna kerangka kerja lama di :doc:`URLconf </topics/http/urls>` berikut::
zh_hans: 新的类具有几乎相同的 API，但允许将实例用作视图。例如，考虑以下 :doc:`URLconf </topics/http/urls>` 中使用旧框架的示例：

source: Using the new Feed class, these feeds can be deployed directly as views::
id: Menggunakan kelas Feed, umpan ini dapat disebarkan secara langsung sebagai tampilan::
zh_hans: 使用新的 Feed 类，这些 feed 可以直接作为视图部署：

source: If you currently use the ``feed()`` view, the ``LatestEntries`` class would often not need to be modified apart from subclassing the new :class:`~django.contrib.syndication.views.Feed` class. The exception is if Django was automatically working out the name of the template to use to render the feed's description and title elements (if you were not specifying the ``title_template`` and ``description_template`` attributes). You should ensure that you always specify ``title_template`` and ``description_template`` attributes, or provide ``item_title()`` and ``item_description()`` methods.
id: Jika anda saat ini menggunakan tampilan ``feed()``, kelas ``LatestEntries`` akan sering tidak butuk dirubah sebagian dari mensubkelaskan kelas :class:`~django.contrib.syndication.views.Feed` baru. Pengecualian adalah jika Django otomatis bekerja dengan nama dari cetakan untuk digunakan membangun gambaran umpan dan judul unsur (jika anda tidak sedang menentukan atribut ``title_template`` dan ``description_template``). Anda harus memastikan bahwa anda selalu menentukan atribut ``title_template`` dan ``description_template``, atau menyediakan metode ``item_title()`` and ``item_description()``.
zh_hans: 如果你当前使用 ``feed()`` 视图，那么 ``LatestEntries`` 类通常不需要进行修改，除非它是新的 :class:`~django.contrib.syndication.views.Feed` 类的子类。唯一的例外是如果 Django 自动计算要用于渲染 feed 的描述和标题元素的模板名称（如果你没有指定 ``title_template`` 和 ``description_template`` 属性）。你应该确保始终指定 ``title_template`` 和 ``description_template`` 属性，或提供 ``item_title()`` 和 ``item_description()`` 方法。

source: However, ``LatestEntriesByCategory`` uses the ``get_object()`` method with the ``bits`` argument to specify a specific category to show. In the new :class:`~django.contrib.syndication.views.Feed` class, ``get_object()`` method takes a ``request`` and arguments from the URL, so it would look like this::
id: Bagaimanapun, ``LatestEntriesByCategory`` menggunakan metode ``get_object()`` dengan argumen ``bits`` untuk menentukan kategori khusus untuk ditampilkan. Di kelas :class:`~django.contrib.syndication.views.Feed` baru, metode ``get_object()`` mengambil sebuah ``request`` dan argumen dari URL, jadi itu akan terlihat seperti ini::
zh_hans: 然而，``LatestEntriesByCategory`` 使用了 ``get_object()`` 方法，并通过 ``bits`` 参数指定要显示的特定类别。在新的 :class:`~django.contrib.syndication.views.Feed` 类中，``get_object()`` 方法接受一个 ``request`` 和来自 URL 的参数，所以它会像这样：

source: Additionally, the ``get_feed()`` method on ``Feed`` classes now take different arguments, which may impact you if you use the ``Feed`` classes directly. Instead of just taking an optional ``url`` argument, it now takes two arguments: the object returned by its own ``get_object()`` method, and the current ``request`` object.
id: Tambahannya, metode ``get_feed()`` pada kelas-kelas ``Feed`` sekarang mengambil argumen berbeda, yang mungkin mempengaruhi anda jika anda menggunakan kelas-kelas ``Feed``. Daripada hanya mengambil sebuah pilihan argumen ``url``, itu sekarang dapat mengambil dua argumen: obyek dikembalikan oleh metode ``get_object()`` itu sendiri, dan obyek ``request`` saat ini.
zh_hans: 另外，``Feed`` 类上的 ``get_feed()`` 方法现在接受不同的参数，如果你直接使用 ``Feed`` 类，这可能会影响你。现在它不仅接受可选的 ``url`` 参数，还接受两个参数：它自己的 ``get_object()`` 方法返回的对象以及当前的 ``request`` 对象。

source: To take into account ``Feed`` classes not being initialized for each request, the ``__init__()`` method now takes no arguments by default. Previously it would have taken the ``slug`` from the URL and the ``request`` object.
id: Untuk memperhitungkan kelas-kelas ``Feed`` tidak sedang diinisialisasi untuk setiap permintaan, metode ``__init__()`` sekarang tidak mengambil argumen secara awalan. Sebelumnya itu akan mengambil ``slug`` dari URL dan obyek ``request``.
zh_hans: 为了考虑到 ``Feed`` 类不会为每个请求初始化，现在默认情况下 ``__init__()`` 方法不接受任何参数。以前它会接受来自 URL 的 ``slug`` 和 ``request`` 对象作为参数。

source: In accordance with `RSS best practices`_, RSS feeds will now include an ``atom:link`` element. You may need to update your tests to take this into account.
id: Sesuai dengan `RSS best practices`_, umpan RSSakan sekarang menyertakan sebuah unsur ``atom:link``. Anda mungkin butuh untuk memperbaharui percobaan anda untuk mengambil ini kedalam akun.
zh_hans: 根据 `RSS 最佳实践`_，RSS 订阅现在将包含一个 ``atom:link`` 元素。你可能需要更新你的测试以考虑这一点。

source: For more information, see the full :doc:`syndication framework documentation </ref/contrib/syndication>`.
id: Untuk informasi lebih, lihat :doc:`syndication framework documentation </ref/contrib/syndication>` penuh.
zh_hans: 有关更多信息，请参阅完整的 :doc:`syndication 框架文档 </ref/contrib/syndication>`。

source: Technical message IDs
id: ID pesan teknis
zh_hans: 技术性消息 ID

source: Up to version 1.1 Django used technical message IDs to provide localizers the possibility to translate date and time formats. They were translatable :term:`translation strings <translation string>` that could be recognized because they were all upper case (for example :setting:`DATETIME_FORMAT`, :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT`). They have been deprecated in favor of the new :doc:`/topics/i18n/formatting` infrastructure that allows localizers to specify that information in a ``formats.py`` file in the corresponding ``django/conf/locale/<locale name>/`` directory.
id: Sampai versi 1.1 Django menggunakan ID pesan teknis untuk menyediakan pelokalan kemungkinan untuk menterjemahkan bentuk tanggal dan waktu. Mereka dapat diterjemahkan :term:`translation strings <translation string>` yang dapat dikenali karena mereka semua huruf besar (sebagai contoh :setting:`DATETIME_FORMAT`, :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT`). Mereka telah diusangkan dalam mendukung infrastruktur :doc:`/topics/i18n/formatting` baru yang mengizinkan pelokal menentukan bahwa informasi di sebuah berkas ``formats.py`` di direktori ``django/conf/locale/<locale name>/`` sama.
zh_hans: 在版本 1.1 之前，Django 使用技术性的消息 ID 来提供本地化者翻译日期和时间格式的可能性。它们是可翻译的 :term:`翻译字符串 <translation string>`，可以通过它们都是大写字母来识别（例如 :setting:`DATETIME_FORMAT`, :setting:`DATE_FORMAT`, :setting:`TIME_FORMAT`）。它们已被弃用，推荐使用新的 :doc:`/topics/i18n/formatting` 基础设施，允许本地化者在相应的 ``django/conf/locale/<locale name>/`` 目录中的 ``formats.py`` 文件中指定这些信息。

source: To allow support for multiple databases, the GeoDjango database internals were changed substantially. The largest backwards-incompatible change is that the module ``django.contrib.gis.db.backend`` was renamed to :mod:`django.contrib.gis.db.backends`, where the full-fledged :ref:`spatial database backends <spatial-backends>` now exist. The following sections provide information on the most-popular APIs that were affected by these changes.
id: Untuk mengizinkan dukungan banyak basisdata, internal basisdata GeoDjango berubah secara mendasar. Perubahan terbesar ketidaksesuaian-kebelakang adalah bahwa modul ``django.contrib.gis.db.backend`` telah dinamai kembali menjadi :mod:`django.contrib.gis.db.backends`, dimana sepenuhnya :ref:`spatial database backends <spatial-backends>` sekarang ada. Bagian berikut menyediakan informasi pada PI paling-terkenal yang terpengaruhi oleh perubahan ini.
zh_hans: 为了支持多个数据库，GeoDjango 数据库内部进行了重大的更改。最大的向后不兼容性更改是模块 ``django.contrib.gis.db.backend`` 被重命名为 :mod:`django.contrib.gis.db.backends`，其中现在存在全功能的 :ref:`空间数据库后端 <spatial-backends>`。以下各节提供了关于受这些更改影响最大的 API 的信息。

source: Prior to the creation of the separate spatial backends, the ``django.contrib.gis.db.backend.SpatialBackend`` object was provided as an abstraction to introspect on the capabilities of the spatial database. All of the attributes and routines provided by ``SpatialBackend`` are now a part of the ``ops`` attribute of the database backend.
id: Sebelum pembuatan dari backend spasial terpisah, obyek ``django.contrib.gis.db.backend.SpatialBackend`` disediakan sebagai sebuah abstraksi untuk menginterospeksi pada kemampuan dari basisdata spasial. Semua atribut dan rutin disediakan oleh ``SpatialBackend`` sekarang bagian dari atribut ``ops`` dari backend basisdata.
zh_hans: 在创建单独的空间后端之前，提供了 ``django.contrib.gis.db.backend.SpatialBackend`` 对象，用于内省空间数据库的功能。``SpatialBackend`` 提供的所有属性和例程现在都是数据库后端的 ``ops`` 属性的一部分。

source: The old module ``django.contrib.gis.db.backend`` is still provided for backwards-compatibility access to a ``SpatialBackend`` object, which is just an alias to the ``ops`` module of the *default* spatial database connection.
id: Modul lama ``django.contrib.gis.db.backend`` masih disediakan untuk akses kesesuaian-kebelakang pada sebuah obyek ``SpatialBackend``, yang hanya sebuah nama lain pada modul ``ops`` dari *awalan* hubungan basisdata spasial.
zh_hans: 旧模块 ``django.contrib.gis.db.backend`` 仍然提供了向后兼容的访问 ``SpatialBackend`` 对象的方式，它只是默认空间数据库连接的 ``ops`` 模块的别名。

source: Users that were relying on undocumented modules and objects within ``django.contrib.gis.db.backend``, rather the abstractions provided by ``SpatialBackend``, are required to modify their code. For example, the following import which would work in 1.1 and below::
id: Pengguna yang bergantung pada modul tidak terdokumentasi dan obyek dalam ``django.contrib.gis.db.backend``, daripada abstraksi disediakan oleh ``SpatialBackend``, dibutuhkan untuk merubah kode mereka. Sebagai contoh, impor berikut akan bekerja di 1.1 dan dibawah::
zh_hans: 依赖于 ``django.contrib.gis.db.backend`` 中的未记录模块和对象，而不是 ``SpatialBackend`` 提供的抽象的用户需要修改他们的代码。例如，在 1.1 及以下版本中可以正常工作的以下导入：

source: Would need to be changed::
id: Akan perlu dirubah::
zh_hans: 需要进行更改：

source: ``SpatialRefSys`` and ``GeometryColumns`` models
id: Model ``SpatialRefSys`` dan ``GeometryColumns``.
zh_hans: ``SpatialRefSys`` 和 ``GeometryColumns`` 模型

source: In previous versions of GeoDjango, :mod:`django.contrib.gis.db.models` had ``SpatialRefSys`` and ``GeometryColumns`` models for querying the OGC spatial metadata tables ``spatial_ref_sys`` and ``geometry_columns``, respectively.
id: Di versi sebelumnya dari GeoDjango, :mod:`django.contrib.gis.db.models` mempunyai model ``SpatialRefSys`` dan ``GeometryColumns`` untuk meminta metadata spasial OGC tabel ``spatial_ref_sys`` dan ``geometry_columns``, masing-masing.
zh_hans: 在 GeoDjango 的早期版本中，:mod:`django.contrib.gis.db.models` 包含了用于查询 OGC 空间元数据表 ``spatial_ref_sys`` 和 ``geometry_columns`` 的 ``SpatialRefSys`` 和 ``GeometryColumns`` 模型。

source: While these aliases are still provided, they are only for the *default* database connection and exist only if the default connection is using a supported spatial database backend.
id: Selagi nama lain ini masih disediakan, mereka hanya untuk *awalan* hubungan basisdata dan hanya yang ada jika hubungan awalan menggunakan backend basisdata spasial terdukung.
zh_hans: 尽管仍然提供这些别名，但它们仅适用于 *默认* 数据库连接，并且仅在默认连接使用受支持的空间数据库后端时存在。

source: Because the table structure of the OGC spatial metadata tables differs across spatial databases, the ``SpatialRefSys`` and ``GeometryColumns`` models can no longer be associated with the ``gis`` application name. Thus, no models will be returned when using the ``get_models`` method in the following example:
zh_hans: 由于不同空间数据库的 OGC 空间元数据表的表结构不同，因此不能再将 ``SpatialRefSys`` 和 ``GeometryColumns`` 模型与 ``gis`` 应用程序名称关联。因此，在以下示例中使用 ``get_models`` 方法将不会返回任何模型：

source: To get the correct ``SpatialRefSys`` and ``GeometryColumns`` for your spatial database use the methods provided by the spatial backend:
zh_hans: 要获取与你的空间数据库匹配的正确的 ``SpatialRefSys`` 和 ``GeometryColumns``，请使用空间后端提供的方法：

source: When using the models returned from the ``spatial_ref_sys()`` and ``geometry_columns()`` method, you'll still need to use the correct database alias when querying on the non-default connection. In other words, to ensure that the models in the example above use the correct database::
id: Ketika menggunakan model dikembalikan dari metode ``spatial_ref_sys()`` dan ``geometry_columns()``, anda masih dapat menggunakan nama lain basisdata yang tepat ketika meminta pada hubungan bukan-awalan. Dengan kata lain, untuk memastikan bahwa model di contoh diatas menggunakan basisdata tepat::
zh_hans: 当使用从 ``spatial_ref_sys()`` 和 ``geometry_columns()`` 方法返回的模型时，仍然需要在查询非默认连接时使用正确的数据库别名。换句话说，为了确保上面示例中的模型使用正确的数据库：

source: Language code ``no``
id: Kode bahasa ``no``
zh_hans: 语言代码 ``no``

source: The currently used language code for Norwegian Bokmål ``no`` is being replaced by the more common language code ``nb``.
zh_hans: 目前使用的挪威博克马尔语的语言代码 ``no`` 正在被更常见的语言代码 ``nb`` 所取代。

source: Function-based template loaders
id: Pemuat cetakan berdasarkan fungsi
zh_hans: 基于函数的模板加载器

source: Django 1.2 changes the template loading mechanism to use a class-based approach. Old style function-based template loaders will still work, but should be updated to use the new class-based template loaders.
id: Django 1.2 merubah mekanisme pemuat cetakan untuk menggunakan pendekatan berdasarkan-kelas. Pemuat cetakan berdasarkan-fungsi gaya lama akan amsih bekerja, tetapi harus diperbaharui untuk menggunakan pemuat cetakan berdasarkan kelas yang baru.
zh_hans: Django 1.2 将模板加载机制更改为使用基于类的方法。旧式基于函数的模板加载器仍然可以工作，但应该更新为使用新的基于类的模板加载器。

source: Django 1.2.1 release notes
id: Catatan terbitan Django 1.2.1
zh_hans: Django 1.2.1 版本发行说明

source: Django 1.2.1 was released almost immediately after 1.2.0 to correct two small bugs: one was in the documentation packaging script, the other was a :ticket:`bug <13560>` that affected datetime form field widgets when localization was enabled.
zh_hans: Django 1.2.1 几乎在 1.2.0 发布后立即发布，用于修复两个小问题：一个在文档打包脚本中，另一个是在启用本地化时影响日期时间表单字段小部件的 :ticket:`错误 <13560>`。

source: Django 1.2.2 release notes
id: Catatan terbitan Django 1.2.2
zh_hans: Django 1.2.2 版本发行说明

source: Welcome to Django 1.2.2!
id: Selamat datang di Django 1.2.2!
zh_hans: 欢迎来到 Django 1.2.2 版本！

source: This is the second "bugfix" release in the Django 1.2 series, improving the stability and performance of the Django 1.2 codebase.
id: Ini adalah terbitan "bugfix" kedua di rangkaian Django 1.2, memperbaiki kestabilan dan penampilan dari basis kode Django 1.2.
zh_hans: 这是 Django 1.2 系列中的第二个“修复错误”的版本，提高了 Django 1.2 代码库的稳定性和性能。

source: Django 1.2.2 maintains backwards compatibility with Django 1.2.1, but contain a number of fixes and other improvements. Django 1.2.2 is a recommended upgrade for any development or deployment currently using or targeting Django 1.2.
id: Django 1.2.2 merawat kesesuaian kebelakang dengan Django 1.2.1, tetapi mengandung sejumlah perbaikan dan pembetulan lainnya. Django 1.2.2 adalah peningkatan yang dianjurkan untuk setiap pengembangan atau penyebaran saat ini menggunakan atau menyasar Django 1.2.
zh_hans: Django 1.2.2 保持了与 Django 1.2.1 的向后兼容性，但包含了许多修复和其他改进。对于当前使用或针对 Django 1.2 的任何开发或部署，建议升级到 Django 1.2.2 。

source: For full details on the new features, backwards incompatibilities, and deprecated features in the 1.2 branch, see the :doc:`/releases/1.2`.
id: Untuk rincian penuh pada fitur baru, ketidaksesuaian kebelakang, dan fitur diusangkan di cabang 1.2, lihat :doc:`/releases/1.2`.
zh_hans: 有关 1.2 分支的新功能、向后不兼容性和已弃用功能的详细信息，请参阅 :doc:`/releases/1.2`。

source: Ordinarily, a point release would not include new features, but in the case of Django 1.2.2, we have made an exception to this rule.
id: Aslinya, titik terbitan akan tidak menyertakan fitur baru, tetapi dalam kasus Django 1.2.2, kami telah membuat sebuah pengecualian pada aturan ini.
zh_hans: 通常情况下，一个小版本更新不会包含新功能，但在 Django 1.2.2 的情况下，我们对这个规则做了一个例外。

source: In order to test a bug fix that forms part of the 1.2.2 release, it was necessary to add a feature -- the ``enforce_csrf_checks`` flag -- to the :ref:`test client <test-client>`. This flag forces the test client to perform full CSRF checks on forms. The default behavior of the test client hasn't changed, but if you want to do CSRF checks with the test client, it is now possible to do so.
id: Untuk mencoba perbaikan kesalahan yang membentuk bagian dari terbitan 1.2.2, itu perlu untuk menambahkan sebuah fitur -- bendera ``enforce_csrf_checks`` -- pada :ref:`test client <test-client>`. Bendera ini memaksa klien percobaan untuk melakukan pemeriksaan CSRF pada formulir. Perilaku awalan dari percobaan klien belum berubah, tetapi jika anda ingin melakukan pemeriksaan CSRF dengan percobaan klien, sekarang memungkinkan melakukannya.
zh_hans: 为了测试 1.2.2 版本中的一个错误修复，必须添加一个功能——``enforce_csrf_checks`` 标志——到 :ref:`测试客户端 <test-client>`。这个标志强制测试客户端对表单执行完整的 CSRF 检查。测试客户端的默认行为没有改变，但如果你想使用测试客户端进行 CSRF 检查，现在是可以做到的。

source: Django 1.2.3 release notes
id: Catatan terbitan Django 1.2.3
zh_hans: Django 1.2.3 版本发行说明

source: Django 1.2.3 fixed a couple of release problems in the 1.2.2 release and was released two days after 1.2.2.
id: Django 1.2.3 diperbaiki sepasang dari masalah terbitan di terbitan 1.2.2 dan telah diterbitkan dua hari setelah 1.2.2.
zh_hans: Django 1.2.3 修复了 1.2.2 版本中的一些发布问题，并在 1.2.2 发布两天后发布。

source: This release corrects the following problems:
id: Terbitan ini memperbaiki masalah berikut:
zh_hans: 此版本纠正了以下问题：

source: The :commit:`patch <7f84657b6b2243cc787bdb9f296710c8d13ad0bd>` applied for the security issue covered in Django 1.2.2 caused issues with non-ASCII responses using CSRF tokens.
zh_hans: 应用于 Django 1.2.2 中涵盖的安全问题的 :commit:`补丁 <7f84657b6b2243cc787bdb9f296710c8d13ad0bd>` 导致在使用 CSRF 令牌的非 ASCII 响应时出现问题。

source: The patch also caused issues with some forms, most notably the user-editing forms in the Django administrative interface.
id: Tambalan juga menyebabkan masalah dengan beberapa formulir, terutama formulir penyuntingan-pengguna di antarmuka administratif Django.
zh_hans: 此补丁还导致了一些表单出现问题，尤其是 Django 管理界面中的用户编辑表单。
