Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: You can apply one of these via the :setting:`FORM_RENDERER` setting. For example::
zh_hans: 您可以通过 :setting:`FORM_RENDERER` 设置之一来应用其中之一。例如：

source: Once the ``<div>`` output style is the default, from Django 5.0, these transitional renderers will be deprecated, for removal in Django 6.0. The ``FORM_RENDERER`` declaration can be removed at that time.
zh_hans: 一旦 ``<div>`` 输出样式成为默认样式（从 Django 5.0 开始），这些过渡渲染器将被弃用，并计划在 Django 6.0 中移除。届时可以删除 ``FORM_RENDERER`` 声明。

source: If the new ``<div>`` output style is not appropriate for your project, you should define a renderer subclass specifying :attr:`~django.forms.renderers.BaseRenderer.form_template_name` and :attr:`~django.forms.renderers.BaseRenderer.formset_template_name` for your required style, and set :setting:`FORM_RENDERER` accordingly.
zh_hans: 如果新的 ``<div>`` 输出样式不适用于您的项目，您应该定义一个渲染器子类，指定 :attr:`~django.forms.renderers.BaseRenderer.form_template_name` 和 :attr:`~django.forms.renderers.BaseRenderer.formset_template_name` 以适应您所需的样式，并相应地设置 :setting:`FORM_RENDERER`。

source: For example, for the ``<p>`` output style used by :meth:`~.Form.as_p`, you would define a form renderer setting ``form_template_name`` to ``"django/forms/p.html"`` and ``formset_template_name`` to ``"django/forms/formsets/p.html"``.
zh_hans: 例如，对于 :meth:`~.Form.as_p` 使用的 ``<p>`` 输出样式，您可以定义一个表单渲染器设置，将 ``form_template_name`` 设置为 ``"django/forms/p.html"``，将 ``formset_template_name`` 设置为 ``"django/forms/formsets/p.html"``。

source: The new :meth:`~django.forms.BoundField.legend_tag` allows rendering field labels in ``<legend>`` tags via the new ``tag`` argument of :meth:`~django.forms.BoundField.label_tag`.
zh_hans: 新的 :meth:`~django.forms.BoundField.legend_tag` 允许通过 :meth:`~django.forms.BoundField.label_tag` 的新 ``tag`` 参数以 ``<legend>`` 标签方式呈现字段标签。

source: The new ``edit_only`` argument for :func:`.modelformset_factory` and :func:`.inlineformset_factory` allows preventing new objects creation.
zh_hans: 对于 :func:`.modelformset_factory` 和 :func:`.inlineformset_factory`，新的 ``edit_only`` 参数允许防止创建新对象。

source: The ``js`` and ``css`` class attributes of :doc:`Media </topics/forms/media>` now allow using hashable objects, not only path strings, as long as those objects implement the ``__html__()`` method (typically when decorated with the :func:`~django.utils.html.html_safe` decorator).
zh_hans: :doc:`媒体 </topics/forms/media>` 的 ``js`` 和 ``css`` 类属性现在允许使用可散列的对象，而不仅仅是路径字符串，只要这些对象实现了 ``__html__()`` 方法（通常在使用 :func:`~django.utils.html.html_safe` 装饰器时）。

source: The new :attr:`.BoundField.use_fieldset` and :attr:`.Widget.use_fieldset` attributes help to identify widgets where its inputs should be grouped in a ``<fieldset>`` with a ``<legend>``.
zh_hans: 新的 :attr:`.BoundField.use_fieldset` 和 :attr:`.Widget.use_fieldset` 属性有助于识别那些应该在 ``<fieldset>`` 中与 ``<legend>`` 一起分组的小部件。

source: The :ref:`formsets-error-messages` argument for :class:`~django.forms.formsets.BaseFormSet` now allows customizing error messages for invalid number of forms by passing ``'too_few_forms'`` and ``'too_many_forms'`` keys.
zh_hans: :class:`~django.forms.formsets.BaseFormSet` 的 :ref:`formsets-error-messages` 参数现在允许通过传递 ``'too_few_forms'`` 和 ``'too_many_forms'`` 键来自定义无效表单数量的错误消息。

source: :class:`~django.forms.IntegerField`, :class:`~django.forms.FloatField`, and :class:`~django.forms.DecimalField` now optionally accept a ``step_size`` argument. This is used to set the ``step`` HTML attribute, and is validated on form submission.
zh_hans: :class:`~django.forms.IntegerField`、:class:`~django.forms.FloatField` 和 :class:`~django.forms.DecimalField` 现在可以选择接受一个 ``step_size`` 参数。这用于设置 ``step`` HTML 属性，并在表单提交时进行验证。

source: The :func:`~django.conf.urls.i18n.i18n_patterns` function now supports languages with both scripts and regions.
zh_hans: :func:`~django.conf.urls.i18n.i18n_patterns` 函数现在支持同时包含脚本和区域的语言。

source: :option:`makemigrations --no-input` now logs default answers and reasons why migrations cannot be created.
zh_hans: :option:`makemigrations --no-input` 现在记录默认答案和无法创建迁移的原因。

source: The new :option:`makemigrations --scriptable` option diverts log output and input prompts to ``stderr``, writing only paths of generated migration files to ``stdout``.
zh_hans: 新的 :option:`makemigrations --scriptable` 选项将日志输出和输入提示重定向到 ``stderr``，仅将生成的迁移文件的路径写入 ``stdout``。

source: The new :option:`migrate --prune` option allows deleting nonexistent migrations from the ``django_migrations`` table.
zh_hans: 新的 :option:`migrate --prune` 选项允许从 ``django_migrations`` 表中删除不存在的迁移。

source: Python files created by :djadmin:`startproject`, :djadmin:`startapp`, :djadmin:`optimizemigration`, :djadmin:`makemigrations`, and :djadmin:`squashmigrations` are now formatted using the ``black`` command if it is present on your ``PATH``.
zh_hans: 由 :djadmin:`startproject`、:djadmin:`startapp`、:djadmin:`optimizemigration`、:djadmin:`makemigrations` 和 :djadmin:`squashmigrations` 创建的 Python 文件现在如果在您的 ``PATH`` 上存在 ``black`` 命令，将会使用它进行格式化。

source: The new :djadmin:`optimizemigration` command allows optimizing operations for a migration.
zh_hans: 新的 :djadmin:`optimizemigration` 命令允许优化迁移操作。

source: The migrations autodetector now generates :class:`~django.db.migrations.operations.RenameIndex` operations instead of ``RemoveIndex`` and ``AddIndex``, when renaming indexes defined in the :attr:`Meta.indexes <django.db.models.Options.indexes>`.
zh_hans: 迁移自动检测器现在在重命名 :attr:`Meta.indexes <django.db.models.Options.indexes>` 中定义的索引时，生成 :class:`~django.db.migrations.operations.RenameIndex` 操作，而不是 ``RemoveIndex`` 和 ``AddIndex``。

source: The ``order_by`` argument of the :class:`~django.db.models.expressions.Window` expression now accepts string references to fields and transforms.
zh_hans: :class:`~django.db.models.expressions.Window` 表达式的 ``order_by`` 参数现在可以接受对字段和转换的字符串引用。

source: The new :setting:`CONN_HEALTH_CHECKS` setting allows enabling health checks for :ref:`persistent database connections <persistent-database-connections>` in order to reduce the number of failed requests, e.g. after database server restart.
zh_hans: 新的 :setting:`CONN_HEALTH_CHECKS` 设置允许启用对 :ref:`持久数据库连接 <persistent-database-connections>` 进行健康检查，以减少失败的请求次数，例如在数据库服务器重新启动后。

source: :meth:`.QuerySet.bulk_create` now supports updating fields when a row insertion fails uniqueness constraints. This is supported on MariaDB, MySQL, PostgreSQL, and SQLite 3.24+.
zh_hans: 现在，当插入一行时违反唯一约束时，:meth:`.QuerySet.bulk_create` 支持更新字段。这在 MariaDB、MySQL、PostgreSQL 和 SQLite 3.24+ 上都受支持。

source: :meth:`.QuerySet.iterator` now supports prefetching related objects as long as the ``chunk_size`` argument is provided. In older versions, no prefetching was done.
zh_hans: :meth:`.QuerySet.iterator` 现在支持在提供了 ``chunk_size`` 参数的情况下预取相关对象。在旧版本中，不进行预取。

source: :class:`~django.db.models.Q` objects and querysets can now be combined using ``^`` as the exclusive or (``XOR``) operator. ``XOR`` is natively supported on MariaDB and MySQL. For databases that do not support ``XOR``, the query will be converted to an equivalent using ``AND``, ``OR``, and ``NOT``.
zh_hans: :class:`~django.db.models.Q` 对象和查询集现在可以使用 ``^`` 作为异或（``XOR``）运算符进行组合。``XOR`` 在 MariaDB 和 MySQL 上有本地支持。对于不支持 ``XOR`` 的数据库，查询将被转换为使用 ``AND``、``OR`` 和 ``NOT`` 的等效查询。

source: The new :ref:`Field.non_db_attrs <custom-field-non_db_attrs>` attribute allows customizing attributes of fields that don't affect a column definition.
zh_hans: 新的 :ref:`Field.non_db_attrs <custom-field-non_db_attrs>` 属性允许自定义不影响列定义的字段属性。

source: On PostgreSQL, ``AutoField``, ``BigAutoField``, and ``SmallAutoField`` are now created as identity columns rather than serial columns with sequences.
zh_hans: 在 PostgreSQL 上，``AutoField``、``BigAutoField`` 和 ``SmallAutoField`` 现在作为标识列（identity columns）创建，而不是带有序列的序列列（serial columns）。

source: :meth:`.HttpResponse.set_cookie` now supports :class:`~datetime.timedelta` objects for the ``max_age`` argument.
zh_hans: :meth:`.HttpResponse.set_cookie` 现在支持 :class:`~datetime.timedelta` 对象作为 ``max_age`` 参数。

source: The new :setting:`SECRET_KEY_FALLBACKS` setting allows providing a list of values for secret key rotation.
zh_hans: 新的 :setting:`SECRET_KEY_FALLBACKS` 设置允许提供一组值用于密钥轮换。

source: The :setting:`SECURE_PROXY_SSL_HEADER` setting now supports a comma-separated list of protocols in the header value.
zh_hans: :setting:`SECURE_PROXY_SSL_HEADER` 设置现在支持在头部值中以逗号分隔的协议列表。

source: The :data:`~django.db.models.signals.pre_delete` and :data:`~django.db.models.signals.post_delete` signals now dispatch the ``origin`` of the deletion.
zh_hans: :data:`~django.db.models.signals.pre_delete` 和 :data:`~django.db.models.signals.post_delete` 信号现在会分发删除的 ``origin``。

source: The HTML ``<script>`` element ``id`` attribute is no longer required when wrapping the :tfilter:`json_script` template filter.
zh_hans: 在包装 :tfilter:`json_script` 模板过滤器时，不再需要 HTML ``<script>`` 元素的 ``id`` 属性。

source: The :class:`cached template loader <django.template.loaders.cached.Loader>` is now enabled in development, when :setting:`DEBUG` is ``True``, and :setting:`OPTIONS['loaders'] <TEMPLATES-OPTIONS>` isn't specified. You may specify ``OPTIONS['loaders']`` to override this, if necessary.
zh_hans: 在开发环境中，当 :setting:`DEBUG` 为 ``True`` 且未指定 :setting:`OPTIONS['loaders'] <TEMPLATES-OPTIONS>` 时，现在会启用 :class:`cached template loader <django.template.loaders.cached.Loader>`。如果需要，您可以指定 ``OPTIONS['loaders']`` 来覆盖这个设置。

source: The :class:`.DiscoverRunner` now supports running tests in parallel on macOS, Windows, and any other systems where the default :mod:`multiprocessing` start method is ``spawn``.
zh_hans: :class:`.DiscoverRunner` 现在支持在 macOS、Windows 和任何默认 :mod:`multiprocessing` 启动方法为 ``spawn`` 的系统上并行运行测试。

source: A nested atomic block marked as durable in :class:`django.test.TestCase` now raises a ``RuntimeError``, the same as outside of tests.
zh_hans: :class:`django.test.TestCase` 中标记为持久的嵌套原子块现在会引发 ``RuntimeError``，与测试外部相同。

source: :meth:`.SimpleTestCase.assertFormError` and :meth:`assertFormsetError() <django.test.SimpleTestCase.assertFormSetError>` now support passing a form/formset object directly.
zh_hans: :meth:`.SimpleTestCase.assertFormError` 和 :meth:`assertFormsetError() <django.test.SimpleTestCase.assertFormSetError>` 现在支持直接传递表单/表单集对象。

source: The new :attr:`.ResolverMatch.captured_kwargs` attribute stores the captured keyword arguments, as parsed from the URL.
zh_hans: 新的 :attr:`.ResolverMatch.captured_kwargs` 属性存储了从 URL 解析的捕获的关键字参数。

source: The new :attr:`.ResolverMatch.extra_kwargs` attribute stores the additional keyword arguments passed to the view function.
zh_hans: 新的 :attr:`.ResolverMatch.extra_kwargs` 属性存储了传递给视图函数的额外关键字参数。

source: ``SimpleLazyObject`` now supports addition operations.
zh_hans: ``SimpleLazyObject`` 现在支持加法操作。

source: :func:`~django.utils.safestring.mark_safe` now preserves lazy objects.
zh_hans: :func:`~django.utils.safestring.mark_safe` 现在保留懒惰对象。

source: The new :class:`~django.core.validators.StepValueValidator` checks if a value is an integral multiple of a given step size. This new validator is used for the new ``step_size`` argument added to form fields representing numeric values.
zh_hans: 新的 :class:`~django.core.validators.StepValueValidator` 用于检查一个值是否是给定步长的整数倍。这个新的验证器用于表示数值的表单字段的新参数 ``step_size``。

source: Backwards incompatible changes in 4.1
zh_hans: 4.1 版本中的不兼容变更

source: ``BaseDatabaseFeatures.has_case_insensitive_like`` is changed from ``True`` to ``False`` to reflect the behavior of most databases.
zh_hans: ``BaseDatabaseFeatures.has_case_insensitive_like`` 从 ``True`` 改为 ``False``，以反映大多数数据库的行为。

source: ``DatabaseIntrospection.get_key_columns()`` is removed. Use ``DatabaseIntrospection.get_relations()`` instead.
zh_hans: ``DatabaseIntrospection.get_key_columns()`` 已被移除。请改用 ``DatabaseIntrospection.get_relations()``。

source: ``DatabaseOperations.ignore_conflicts_suffix_sql()`` method is replaced by ``DatabaseOperations.on_conflict_suffix_sql()`` that accepts the ``fields``, ``on_conflict``, ``update_fields``, and ``unique_fields`` arguments.
zh_hans: ``DatabaseOperations.ignore_conflicts_suffix_sql()`` 方法被替换为 ``DatabaseOperations.on_conflict_suffix_sql()``，它接受 ``fields``、``on_conflict``、``update_fields`` 和 ``unique_fields`` 参数。

source: The ``ignore_conflicts`` argument of the ``DatabaseOperations.insert_statement()`` method is replaced by ``on_conflict`` that accepts ``django.db.models.constants.OnConflict``.
zh_hans: ``DatabaseOperations.insert_statement()`` 方法的 ``ignore_conflicts`` 参数被替换为接受 ``django.db.models.constants.OnConflict`` 的 ``on_conflict`` 参数。

source: ``DatabaseOperations._convert_field_to_tz()`` is replaced by ``DatabaseOperations._convert_sql_to_tz()`` that accepts the ``sql``, ``params``, and ``tzname`` arguments.
zh_hans: ``DatabaseOperations._convert_field_to_tz()`` 被替换为 ``DatabaseOperations._convert_sql_to_tz()``，它接受 ``sql``、``params`` 和 ``tzname`` 参数。

source: Several date and time methods on ``DatabaseOperations`` now take ``sql`` and ``params`` arguments instead of ``field_name`` and return 2-tuple containing some SQL and the parameters to be interpolated into that SQL. The changed methods have these new signatures:
zh_hans: ``DatabaseOperations`` 上的多个日期和时间方法现在接受 ``sql`` 和 ``params`` 参数，而不再接受 ``field_name``，并返回包含一些 SQL 和要插入该 SQL 的参数的 2 元组。已更改的方法具有以下新签名：

source: Support for GDAL 2.1 is removed.
zh_hans: 移除对 GDAL 2.1 的支持。

source: Support for PostGIS 2.4 is removed.
zh_hans: 移除对 PostGIS 2.4 的支持。

source: Dropped support for PostgreSQL 10
zh_hans: 不再支持 PostgreSQL 10 。

source: Upstream support for PostgreSQL 10 ends in November 2022. Django 4.1 supports PostgreSQL 11 and higher.
zh_hans: PostgreSQL 10 的上游支持将在 2022 年 11 月结束。 Django 4.1 支持 PostgreSQL 11 及更高版本。

source: Dropped support for MariaDB 10.2
zh_hans: 不再支持 MariaDB 10.2

source: Upstream support for MariaDB 10.2 ends in May 2022. Django 4.1 supports MariaDB 10.3 and higher.
zh_hans: MariaDB 10.2 的上游支持将在 2022 年 5 月结束。 Django 4.1 支持 MariaDB 10.3 及更高版本。

source: Admin changelist searches spanning multi-valued relationships changes
zh_hans: 管理后台的变更列表搜索跨多值关系的变更

source: Admin changelist searches using multiple search terms are now applied in a single call to ``filter()``, rather than in sequential ``filter()`` calls.
zh_hans: 管理员 changelist 使用多个搜索词进行搜索现在在单个调用 ``filter()`` 中应用，而不是在连续的 ``filter()`` 调用中应用。

source: For multi-valued relationships, this means that rows from the related model must match all terms rather than any term. For example, if ``search_fields`` is set to ``['child__name', 'child__age']``, and a user searches for ``'Jamal 17'``, parent rows will be returned only if there is a relationship to some 17-year-old child named Jamal, rather than also returning parents who merely have a younger or older child named Jamal in addition to some other 17-year-old.
zh_hans: 对于多值关系，这意味着来自相关模型的行必须匹配所有词项，而不是任何词项。例如，如果 ``search_fields`` 设置为 ``['child__name', 'child__age']``，用户搜索 ``'Jamal 17'``，那么只有与一些名为 Jamal 的 17 岁孩子存在关系的父母行才会被返回，而不会返回仅仅因为有一个名为 Jamal 的更年轻或更年长的孩子以及其他一些 17 岁孩子的父母。

source: See the :ref:`spanning-multi-valued-relationships` topic for more discussion of this difference. In Django 4.0 and earlier, :meth:`~django.contrib.admin.ModelAdmin.get_search_results` followed the second example query, but this undocumented behavior led to queries with excessive joins.
zh_hans: 有关这种差异的更多讨论，请参阅 :ref:`spanning-multi-valued-relationships` 主题。在 Django 4.0 及更早版本中，:meth:`~django.contrib.admin.ModelAdmin.get_search_results` 遵循第二个示例查询，但这种未记录的行为导致了具有过多连接的查询。

source: Reverse foreign key changes for unsaved model instances
zh_hans: 未保存的模型实例的反向外键变更

source: In order to unify the behavior with many-to-many relations for unsaved model instances, a reverse foreign key now raises ``ValueError`` when calling :class:`related managers <django.db.models.fields.related.RelatedManager>` for unsaved objects.
zh_hans: 为了统一与未保存的模型实例的多对多关系的行为，反向外键现在在调用未保存对象的 :class:`related managers <django.db.models.fields.related.RelatedManager>` 时会引发 ``ValueError``。

source: Related managers for :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField`, and :class:`~django.contrib.contenttypes.fields.GenericRelation` are now cached on the :class:`~django.db.models.Model` instance to which they belong. *This change was reverted in Django 4.1.2.*
zh_hans: :class:`~django.db.models.ForeignKey`、:class:`~django.db.models.ManyToManyField` 和 :class:`~django.contrib.contenttypes.fields.GenericRelation` 的相关管理器现在被缓存在它们所属的 :class:`~django.db.models.Model` 实例上。*这个变更在 Django 4.1.2 中被撤销了。*

source: :class:`~django.middleware.csrf.CsrfViewMiddleware` no longer masks the CSRF cookie like it does the CSRF token in the DOM.
zh_hans: :class:`~django.middleware.csrf.CsrfViewMiddleware` 现在不再像在 DOM 中遮蔽 CSRF 令牌一样遮蔽 CSRF cookie。

source: :class:`~django.middleware.csrf.CsrfViewMiddleware` now uses ``request.META['CSRF_COOKIE']`` for storing the unmasked CSRF secret rather than a masked version. This is an undocumented, private API.
zh_hans: :class:`~django.middleware.csrf.CsrfViewMiddleware` 现在使用 ``request.META['CSRF_COOKIE']`` 来存储未遮蔽的 CSRF 密钥，而不是遮蔽版本。这是一个未记录的、私有的 API。

source: The :attr:`.ModelAdmin.actions` and :attr:`~django.contrib.admin.ModelAdmin.inlines` attributes now default to an empty tuple rather than an empty list to discourage unintended mutation.
zh_hans: :attr:`.ModelAdmin.actions` 和 :attr:`~django.contrib.admin.ModelAdmin.inlines` 属性现在默认为空元组，而不是空列表，以防止意外的变更。

source: The ``type="text/css"`` attribute is no longer included in ``<link>`` tags for CSS :doc:`form media </topics/forms/media>`.
zh_hans: 在 CSS :doc:`表单媒体 </topics/forms/media>` 的 ``<link>`` 标签中不再包含 ``type="text/css"`` 属性。

source: ``formset:added`` and ``formset:removed`` JavaScript events are now pure JavaScript events and don't depend on jQuery. See :ref:`admin-javascript-inline-form-events` for more details on the change.
zh_hans: ``formset:added`` 和 ``formset:removed`` JavaScript 事件现在是纯 JavaScript 事件，不依赖于 jQuery。有关此更改的更多详细信息，请参阅 :ref:`admin-javascript-inline-form-events`。

source: The ``exc_info`` argument of the undocumented ``django.utils.log.log_response()`` function is replaced by ``exception``.
zh_hans: 未记录的 ``django.utils.log.log_response()`` 函数的 ``exc_info`` 参数已被替换为 ``exception``。

source: The ``size`` argument of the undocumented ``django.views.static.was_modified_since()`` function is removed.
zh_hans: 未记录的 ``django.views.static.was_modified_since()`` 函数的 ``size`` 参数已被移除。

source: The admin log out UI now uses ``POST`` requests.
zh_hans: 管理员注销界面现在使用 ``POST`` 请求。

source: The undocumented ``InlineAdminFormSet.non_form_errors`` property is replaced by the ``non_form_errors()`` method. This is consistent with ``BaseFormSet``.
zh_hans: 未记录的 ``InlineAdminFormSet.non_form_errors`` 属性已被替换为 ``non_form_errors()`` 方法。这与 ``BaseFormSet`` 保持一致。

source: As per :ref:`above<templates-4.1>`, the cached template loader is now enabled in development. You may specify ``OPTIONS['loaders']`` to override this, if necessary.
zh_hans: 根据 :ref:`上面 <templates-4.1>`，在开发中现在启用了缓存模板加载器。如果有必要，你可以指定 ``OPTIONS['loaders']`` 来覆盖这个设置。

source: The undocumented ``django.contrib.auth.views.SuccessURLAllowedHostsMixin`` mixin is replaced by ``RedirectURLMixin``.
zh_hans: 未记录的 ``django.contrib.auth.views.SuccessURLAllowedHostsMixin`` 混合类已被替换为 ``RedirectURLMixin``。

source: :class:`~django.db.models.BaseConstraint` subclasses must implement :meth:`~django.db.models.BaseConstraint.validate` method to allow those constraints to be used for validation.
zh_hans: :class:`~django.db.models.BaseConstraint` 的子类必须实现 :meth:`~django.db.models.BaseConstraint.validate` 方法，以允许这些约束用于验证。

source: The undocumented ``URLResolver._is_callback()``, ``URLResolver._callback_strs``, and ``URLPattern.lookup_str()`` are moved to ``django.contrib.admindocs.utils``.
zh_hans: 未记录的 ``URLResolver._is_callback()``、``URLResolver._callback_strs`` 和 ``URLPattern.lookup_str()`` 已被移动到 ``django.contrib.admindocs.utils``。

source: The :meth:`.Model.full_clean` method now converts an ``exclude`` value to a ``set``. It’s also preferable to pass an ``exclude`` value as a ``set`` to the :meth:`.Model.clean_fields`, :meth:`.Model.full_clean`, :meth:`.Model.validate_unique`, and :meth:`.Model.validate_constraints` methods.
zh_hans: :meth:`.Model.full_clean` 方法现在将 ``exclude`` 值转换为一个 ``set``。最好将 ``exclude`` 值作为一个 ``set`` 传递给 :meth:`.Model.clean_fields`、:meth:`.Model.full_clean`、:meth:`.Model.validate_unique` 和 :meth:`.Model.validate_constraints` 方法。

source: The minimum supported version of ``asgiref`` is increased from 3.4.1 to 3.5.2.
zh_hans: ``asgiref`` 的最小支持版本从 3.4.1 提高到 3.5.2。

source: Combined expressions no longer use the error-prone behavior of guessing ``output_field`` when argument types match. As a consequence, resolving an ``output_field`` for database functions and combined expressions may now crash with mixed types. You will need to explicitly set the ``output_field`` in such cases.
zh_hans: 组合表达式不再在参数类型匹配时猜测 ``output_field`` 的不稳定行为。因此，解析数据库函数和组合表达式的 ``output_field`` 现在可能会在混合类型的情况下崩溃。在这种情况下，你需要明确设置 ``output_field``。

source: The :djadmin:`makemessages` command no longer changes ``.po`` files when up to date. In older versions, ``POT-Creation-Date`` was always updated.
zh_hans: :djadmin:`makemessages` 命令在不需要更新时不再更改 ``.po`` 文件。在旧版本中，``POT-Creation-Date`` 总是会被更新。

source: Features deprecated in 4.1
zh_hans: 4.1 版本中弃用的功能

source: Log out via GET
zh_hans: 通过 GET 方式注销登录

source: Logging out via ``GET`` requests to the :py:class:`built-in logout view <django.contrib.auth.views.LogoutView>` is deprecated. Use ``POST`` requests instead.
zh_hans: 通过 ``GET`` 请求注销到 :py:class:`内置的注销视图 <django.contrib.auth.views.LogoutView>` 已经不推荐使用。请改为使用 ``POST`` 请求。

source: If you want to retain the user experience of an HTML link, you can use a form that is styled to appear as a link:
zh_hans: 如果您想保留 HTML 链接的用户体验，可以使用一个被样式化为链接的表单：

source: The context for sitemap index templates of a flat list of URLs is deprecated. Custom sitemap index templates should be updated for the adjusted :ref:`context variables <sitemap-index-context-variables>`, expecting a list of objects with ``location`` and optional ``lastmod`` attributes.
zh_hans: 对于扁平化的 URL 列表的站点地图索引模板的上下文已被弃用。自定义站点地图索引模板应该根据调整后的 :ref:`上下文变量 <sitemap-index-context-variables>` 进行更新，期望一个具有 ``location`` 和可选 ``lastmod`` 属性的对象列表。

source: ``CSRF_COOKIE_MASKED`` transitional setting is deprecated.
zh_hans: ``CSRF_COOKIE_MASKED`` 过渡设置已移除。

source: The ``name`` argument of :func:`django.utils.functional.cached_property` is deprecated as it's unnecessary as of Python 3.6.
zh_hans: 在 Python 3.6 及更高版本中，:func:`django.utils.functional.cached_property` 的 ``name`` 参数已被弃用，因为它不再必要。

source: The ``opclasses`` argument of ``django.contrib.postgres.constraints.ExclusionConstraint`` is deprecated in favor of using :class:`OpClass() <django.contrib.postgres.indexes.OpClass>` in :attr:`.ExclusionConstraint.expressions`. To use it, you need to add ``'django.contrib.postgres'`` in your :setting:`INSTALLED_APPS`.
zh_hans: ``django.contrib.postgres.constraints.ExclusionConstraint`` 的 ``opclasses`` 参数已被弃用，而应使用 :attr:`.ExclusionConstraint.expressions` 中的 :class:`OpClass() <django.contrib.postgres.indexes.OpClass>`。要使用它，你需要在 :setting:`INSTALLED_APPS` 中添加 ``'django.contrib.postgres'``。
