Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Denial-of-service possibility by filling session store
id: Kemungkinan denial-of-service dengan mengisi sesi toko
zh_hans: 通过填充会话存储可能导致拒绝服务攻击。

source: In previous versions of Django, the session backends created a new empty record in the session storage anytime ``request.session`` was accessed and there was a session key provided in the request cookies that didn't already have a session record. This could allow an attacker to easily create many new session records simply by sending repeated requests with unknown session keys, potentially filling up the session store or causing other users' session records to be evicted.
id: Dalam versi sebelumnya Django, backend sesi membuat rekaman kosong baru di penyimpanan sesi kapanpun ``request.session`` diakses dan ada kunci sesi yang disediakan di permintaan kue yang tidak mempunyai rekaman sesi. Ini dapat mengizinkan seorang penyerang dengan mudah membuat banyak rekaman sesi baru cukup dengan mengirim permintaan berulang dengan kunci sesi yang tidak diketahui, kemungkinan mengisi penyimpanan sesi atau menyebabkan rekaman sesi pengguna lain dikeluarkan.
zh_hans: 在以前版本的 Django 中，会话后端在访问 ``request.session`` 时，如果请求的 cookies 中提供了一个没有会话记录的会话键，就会创建一个新的空记录在会话存储中。这可能允许攻击者通过发送带有未知会话键的重复请求来轻松创建许多新的会话记录，潜在地填满会话存储或导致其他用户的会话记录被逐出。

source: The built-in session backends now create a session record only if the session is actually modified; empty session records are not created. Thus this potential DoS is now only possible if the site chooses to expose a session-modifying view to anonymous users.
id: Backend sesi siap-pakai sekarang membuat sebuah sesi hanya merekam jika sesi sebenarnya dirubah; rekaman sesi kosong tidak dibuat. Demikian kemungkinan DoS ini sekarang memungkinkan jika situs memilih untuk membuka tampilan merubah-sesi pada pengguna anonim.
zh_hans: 内置的会话后端现在仅在会话实际修改时创建会话记录；不会创建空的会话记录。因此，只有在网站选择向匿名用户公开会话修改视图时，才可能发生这种潜在的 DoS 攻击。

source: As each built-in session backend was fixed separately (rather than a fix in the core sessions framework), maintainers of third-party session backends should check whether the same vulnerability is present in their backend and correct it if so.
id: Ketika setiap backend sesi siap-pakai telah diperbaiki terpisah (daripada memperbaiki kerangka kerja sesi inti), perawat dari backend sesi pihak-ketiga harus memeriksa apakah kerentanan yang sama hadir dalam backend mereka dan memperbaiki jika ada.
zh_hans: 由于每个内置会话后端都是单独修复的（而不是在核心会话框架中进行修复），第三方会话后端的维护者应检查他们的后端是否存在相同的漏洞，并在存在的情况下进行修正。

source: Header injection possibility since validators accept newlines in input
id: Kemunghinan suntikan kepala sejak pengesah menerima baris baru dalam masukan
zh_hans: 由于验证器接受换行符输入，可能导致头部注入。

source: Some of Django's built-in validators (:class:`~django.core.validators.EmailValidator`, most seriously) didn't prohibit newline characters (due to the usage of ``$`` instead of ``\Z`` in the regular expressions). If you use values with newlines in HTTP response or email headers, you can suffer from header injection attacks. Django itself isn't vulnerable because :class:`~django.http.HttpResponse` and the mail sending utilities in :mod:`django.core.mail` prohibit newlines in HTTP and SMTP headers, respectively. While the validators have been fixed in Django, if you're creating HTTP responses or email messages in other ways, it's a good idea to ensure that those methods prohibit newlines as well. You might also want to validate that any existing data in your application doesn't contain unexpected newlines.
id: Beberapa pengecek siap-pakai Django (:class:`~django.core.validators.EmailValidator`, paling serius) tidak melarang karakter baris baru (karena penggunaan dari ``$`` sebagai ganti dari``\Z`` di regular expression). Jika anda menggunakan nilai-nilai dengan baris baru di tanggapan HTTP atau kepala surel, anda dapat menderita dari serangan suntikan kepala. Django itu sendiri tidak rentan karena :class:`~django.http.HttpResponse` dan alat pengirim surat dalam :mod:`django.core.mail` melarang baris baru di kepala HTTP dan SMPT, masing-masing. Selagi pengecek telah diperbaiki di Django, jika anda sedang membuat tanggapan HTTP atau pesan surel di cara lain, itu adalah ide bagus untuk memastikan bahwa metode tersebut melarang baris baru juga. Anda mungkin juga ingin mengesahkan bahwa tiap data yang ada di aplikasi anda tidak mengandung baris baru yang tidak diharapkan.
zh_hans: Django 的一些内置验证器（尤其是 :class:`~django.core.validators.EmailValidator`）没有禁止换行字符（因为正则表达式中使用了 ``$`` 而不是 ``\Z``）。如果在 HTTP 响应或电子邮件头中使用带有换行符的值，可能会受到头部注入攻击的影响。Django 本身不会受到影响，因为 :class:`~django.http.HttpResponse` 和 :mod:`django.core.mail` 中的邮件发送工具在 HTTP 和 SMTP 头部中分别禁止了换行符。尽管验证器已经在 Django 中修复，但如果以其他方式创建 HTTP 响应或电子邮件消息，最好确保这些方法也禁止换行符。您还可以验证应用程序中的任何现有数据是否包含意外的换行符。

source: :func:`~django.core.validators.validate_ipv4_address`, :func:`~django.core.validators.validate_slug`, and :class:`~django.core.validators.URLValidator` and their usage in the corresponding form fields ``GenericIPAddresseField``, ``IPAddressField``, ``SlugField``, and ``URLField`` are also affected.
id: :func:`~django.core.validators.validate_ipv4_address`, :func:`~django.core.validators.validate_slug`, dan :class:`~django.core.validators.URLValidator` dan penggunaan mereka di bidang formulir terkait ``GenericIPAddresseField``, ``IPAddressField``, ``SlugField``, dan ``URLField`` juga berpengaruh.
zh_hans: :func:`~django.core.validators.validate_ipv4_address`、:func:`~django.core.validators.validate_slug` 和 :class:`~django.core.validators.URLValidator` 以及它们在相应的表单字段 ``GenericIPAddresseField``、``IPAddressField``、``SlugField`` 和 ``URLField`` 中的使用也受到影响。

source: The undocumented, internally unused ``validate_integer()`` function is now stricter as it validates using a regular expression instead of simply casting the value using ``int()`` and checking if an exception was raised.
id: Tidak terdokumentasi, secara internal tidak digunakan fungsi ``validate_integer()`` sekarang lebih ketat ketika itu mensahkan menggunakan regular expression daripada cukup memberikan nilai menggunakan ``int()`` dan memeriksa jika sebuah pengecualian telah dimunculkan.
zh_hans: 未记录的、内部未使用的 ``validate_integer()`` 函数现在更加严格，因为它使用正则表达式进行验证，而不仅仅是使用 ``int()`` 强制转换值并检查是否引发了异常。

source: Django 1.4.22 release notes
id: Catatan terbitan Django 1.4.22
zh_hans: Django 1.4.22 版本发行说明

source: *August 18, 2015*
id: *Agustus 18, 2015*
zh_hans: *2015 年 8 月 18 日*

source: Django 1.4.22 fixes a security issue in 1.4.21.
id: Django 1.4.22 memperbaiki masalah keamanan di 1.4.21.
zh_hans: Django 1.4.22 修复了 1.4.21 中的安全问题。

source: It also fixes support with pip 7+ by disabling wheel support. Older versions of 1.4 would silently build a broken wheel when installed with those versions of pip.
id: Itu juga memperbaiki dukungan dengan pip 7+ dengan meniadakan dukungan wheel. Versi terlama dari 1.4 akan secara diam membangun putaran rusak ketika dipasang dengan versi tersebut dari pip.
zh_hans: 它还通过禁用 wheel 支持来修复与 pip 7+ 的兼容问题。在使用这些版本的 pip 安装时，1.4 的旧版本会悄无声息地构建一个损坏的 wheel 。

source: Denial-of-service possibility in ``logout()`` view by filling session store
id: Kemungkinan denial-of-service dalam tampilan ``logout()`` dengan mengisi sesi toko
zh_hans: 在 ``logout()`` 视图中存在拒绝服务的可能性，因为会话存储被填满。

source: Previously, a session could be created when anonymously accessing the ``django.contrib.auth.views.logout()`` view (provided it wasn't decorated with :func:`~django.contrib.auth.decorators.login_required` as done in the admin). This could allow an attacker to easily create many new session records by sending repeated requests, potentially filling up the session store or causing other users' session records to be evicted.
zh_hans: 以前，在匿名访问 ``django.contrib.auth.views.logout()`` 视图时可以创建会话（前提是没有像在管理界面中那样使用 :func:`~django.contrib.auth.decorators.login_required` 进行装饰）。这可能允许攻击者通过发送重复的请求轻松创建许多新的会话记录，潜在地填满会话存储或导致其他用户的会话记录被逐出。

source: The :class:`~django.contrib.sessions.middleware.SessionMiddleware` has been modified to no longer create empty session records, including when :setting:`SESSION_SAVE_EVERY_REQUEST` is active.
id: :class:`~django.contrib.sessions.middleware.SessionMiddleware` telah dirubah menjadi tidak lagi membuat rekaman sesi kosong, termasuk ketika :setting:`SESSION_SAVE_EVERY_REQUEST` aktif.
zh_hans: :class:`~django.contrib.sessions.middleware.SessionMiddleware` 已经修改，不再创建空的会话记录，即使 :setting:`SESSION_SAVE_EVERY_REQUEST` 处于活动状态也是如此。

source: Additionally, the ``contrib.sessions.backends.base.SessionBase.flush()`` and ``cache_db.SessionStore.flush()`` methods have been modified to avoid creating a new empty session. Maintainers of third-party session backends should check if the same vulnerability is present in their backend and correct it if so.
id: Selain itu, metode ``contrib.sessions.backends.base.SessionBase.flush()`` dan ``cache_db.SessionStore.flush()`` telah dirubah untuk menghindari membuat sesi kosong baru. Perawat dari backend sesi pihak-ketiga harus memeriksa jika kerentanan sama hadir di backend mereka dan memperbaiki itu kalai demikian.
zh_hans: 此外，``contrib.sessions.backends.base.SessionBase.flush()`` 和 ``cache_db.SessionStore.flush()`` 方法已经修改，以避免创建新的空会话。第三方会话后端的维护者应检查他们的后端是否存在相同的漏洞，如果是的话，应该进行修复。

source: Django 1.4.3 release notes
id: Catatan terbitan Django 1.4.3
zh_hans: Django 1.4.3 版本发行说明

source: Django 1.4.3 addresses two security issues present in previous Django releases in the 1.4 series.
id: Django 1.4.3 mengalamatkan dua masalah keamanan yang hadir di terbitan Django sebelumnya di rangkaian 1.4.
zh_hans: Django 1.4.3 解决了 1.4 系列中之前 Django 版本存在的两个安全问题。

source: Django 1.4.4 release notes
id: Catatan terbitan Django 1.4.4
zh_hans: Django 1.4.4 版本发行说明

source: Django 1.4.4 fixes four security issues present in previous Django releases in the 1.4 series, as well as several other bugs and numerous documentation improvements.
id: Django 1.4.4 memperbaiki empat masalah keamanan hadir di terbitan Django sebelumnya di rangkaian 1.4.
zh_hans: Django 1.4.4 修复了 1.4 系列中之前 Django 版本存在的四个安全问题，以及其他一些错误和大量文档改进。

source: This is the fourth bugfix/security release in the Django 1.4 series.
id: Ini adalah terbitan keempat perbaikan kesalahan/keamanan di rangkaian Django 1.4.
zh_hans: 这是 Django 1.4 系列中的第四个错误修复/安全更新版本。

source: For this reason, Django 1.4.4 adds a new setting, ``ALLOWED_HOSTS``, containing an explicit list of valid host/domain names for this site. A request with a Host header not matching an entry in this list will raise ``SuspiciousOperation`` if ``request.get_host()`` is called. For full details see the documentation for the :setting:`ALLOWED_HOSTS` setting.
id: Untuk alasan ini, Django 1.4.4 menambahkan pengaturan baru, ``ALLOWED_HOSTS``, mengandung sebuah daftar eksplisit dari nama ranah/host sah untuk situs ini. Sebuah permintaan dengan kepala Host tidak mencocokkan sebuah masukan di daftar ini akan memunculkan ``SuspiciousOperation`` jika ``request.get_host()`` dipanggil. Untuk rincian penuh lihat dokumentasi untuk pengaturan :setting:`ALLOWED_HOSTS`.
zh_hans: 因此，Django 1.4.4 添加了一个新的设置，名为 ``ALLOWED_HOSTS``，其中包含了此站点的有效主机/域名的明确列表。如果请求的 Host 标头与此列表中的条目不匹配，那么如果调用了 ``request.get_host()``，将引发 ``SuspiciousOperation``。有关详细信息，请参阅 :setting:`ALLOWED_HOSTS` 设置的文档。

source: The default value for this setting in Django 1.4.4 is ``['*']`` (matching any host), for backwards-compatibility, but we strongly encourage all sites to set a more restrictive value.
id: Nilai awalan untuk pengaturan ini di Django 1.4.4 adalah ``['*']`` (mencocokkan tiap host), untuk kesesuaian-kebelakang, tetapi kami sangat menganjurkan semua situs untuk mensetel nilai lebih terbatas.
zh_hans: Django 1.4.4 中此设置的默认值是 ``['*']`` （匹配任何主机），出于向后兼容性考虑，但我们强烈建议所有站点设置一个更为限制性的值。

source: The XML parser in the Python standard library is vulnerable to a number of attacks via external entities and entity expansion. Django uses this parser for deserializing XML-formatted database fixtures. This deserializer is not intended for use with untrusted data, but in order to err on the side of safety in Django 1.4.4 the XML deserializer refuses to parse an XML document with a DTD (DOCTYPE definition), which closes off these attack avenues.
id: Pengurai XML di pustaka standar Python rentan pada sejumlah serangan melalui entitas luar dan perpanjangan entitas. Django menggunakan pengurai ini untuk deserialisasi perlengkapan basisdata berbentuk-XML. Perlengkapan pendeserialisasi ini tidak dimaksudkan untuk digunakan dengan data tidak dipercaya, tetapi untuk kesalahan pada sisi dari keamanan di Django 1.4.4 pendeserialisasi XML menolak untuk mengurai sebuah dokumen XML dengan DTD (pengertian DOCTYPE), yang menutup jalan serangan ini.
zh_hans: Python 标准库中的 XML 解析器容易受到外部实体和实体扩展攻击。 Django 使用此解析器对 XML 格式的数据库固件进行反序列化。这个反序列化器并不是为了处理不可信数据而设计的，但为了在 Django 1.4.4 中确保安全，XML 反序列化器拒绝解析带有 DTD（DOCTYPE 定义）的 XML 文档，从而阻止了这些攻击途径。

source: In Django 1.4.4, all formsets have a strictly-enforced maximum number of forms (1000 by default, though it can be set higher via the ``max_num`` formset factory argument).
id: Di Django 1.4.4, semua formset mempunyai angka maksimal dipaksakan-ketat dari formulir (1000 oleh awalan, meskipun itu dapat disetel lebih tinggi melalui argumen pabrik formset ``max_num``).
zh_hans: 在 Django 1.4.4 中，所有表单集都有一个严格执行的最大表单数限制（默认为 1000，尽管可以通过表单集工厂参数 ``max_num`` 设置更高的值）。

source: In previous versions of Django, an admin user without change permission on a model could still view the Unicode representation of instances via their admin history log. Django 1.4.4 now limits the admin history log view for an object to users with change permission for that model.
zh_hans: 在以前的 Django 版本中，没有模型更改权限的管理员用户仍然可以通过其管理历史记录查看实例的 Unicode 表示。现在，Django 1.4.4 将对象的管理历史记录视图限制为具有该模型更改权限的用户。

source: Prevented transaction state from leaking from one request to the next (#19707).
id: Dicegah keadaan transaksi dari membocorkan dari satu permintaan ke selanjutnya (#19707).
zh_hans: 防止事务状态从一个请求泄露到下一个请求（ #19707 ）。

source: Changed an SQL command syntax to be MySQL 4 compatible (#19702).
id: Dirubah sebuah sintaksis perintah SQL menjadi sesuai MySQL 4 (#19702).
zh_hans: 更改了 SQL 命令语法以实现 MySQL 4 兼容性（ #19702 ）。

source: Added backwards-compatibility with old unsalted MD5 passwords (#18144).
id: Ditambahkan kesesuaian-kebelakang dengan sandi MD5 lama tidak tergarami (#18144).
zh_hans: 增加了对旧版未加盐 MD5 密码的向后兼容性（ #18144 ）。

source: Django 1.4.5 release notes
id: Catatan terbitan Django 1.4.5
zh_hans: Django 1.4.5 版本发行说明

source: Django 1.4.5 corrects a packaging problem with yesterday's :doc:`1.4.4 release </releases/1.4.4>`.
id: Django 1.4.5 memperbaiki masalah pemaketan dengan :doc:`1.4.4 release </releases/1.4.4>` kemarin.
zh_hans: Django 1.4.5 修复了昨天发布的 :doc:`1.4.4 版本 </releases/1.4.4>` 中的打包问题。

source: Django 1.4.6 release notes
id: Catatan terbitan Django 1.4.6
zh_hans: Django 1.4.6 版本发行说明

source: *August 13, 2013*
id: *Agustus 13, 2013*
zh_hans: *2013 年 8 月 13 日*

source: Django 1.4.6 fixes one security issue present in previous Django releases in the 1.4 series, as well as one other bug.
id: Django 1.4.6 memperbaiki satu masalah keamanan yang hadir di terbitan Django sebelumnya di rangkaian 1.4, sama halnya satu kesalahan lainnya.
zh_hans: Django 1.4.6 修复了 1.4 系列中之前 Django 版本存在的一个安全问题，以及另一个错误。

source: This is the sixth bugfix/security release in the Django 1.4 series.
id: Ini adalah terbitan keenam perbaikan kesalahan/keamanan di rangkaian Django 1.4.
zh_hans: 这是 Django 1.4 系列中的第六个错误修复/安全发布。

source: Django relies on user input in some cases (e.g. ``django.contrib.auth.views.login()``, ``django.contrib.comments``, and :doc:`i18n </topics/i18n/index>`) to redirect the user to an "on success" URL. The security checks for these redirects (namely ``django.utils.http.is_safe_url()``) didn't check if the scheme is ``http(s)`` and as such allowed ``javascript:...`` URLs to be entered. If a developer relied on ``is_safe_url()`` to provide safe redirect targets and put such a URL into a link, they could suffer from a XSS attack. This bug doesn't affect Django currently, since we only put this URL into the ``Location`` response header and browsers seem to ignore JavaScript there.
zh_hans: Django 在某些情况下（例如，``django.contrib.auth.views.login()``、``django.contrib.comments`` 和 :doc:`i18n </topics/i18n/index>`）依赖于用户输入来将用户重定向到“成功”URL。这些重定向的安全检查（即 ``django.utils.http.is_safe_url()``）没有检查 URL 的协议是否为 ``http(s)``，因此允许输入 ``javascript:...`` 类型的 URL。如果开发人员依赖于 ``is_safe_url()`` 来提供安全的重定向目标，并将这样的 URL 放入链接中，他们可能会受到 XSS 攻击的影响。当前情况下，这个错误不会影响 Django，因为我们只将这个 URL 放入 ``Location`` 响应头中，而浏览器似乎会忽略其中的 JavaScript。

source: Fixed an obscure bug with the :func:`~django.test.override_settings` decorator. If you hit an ``AttributeError: 'Settings' object has no attribute '_original_allowed_hosts'`` exception, it's probably fixed (#20636).
id: Diperbaiki sebuah kesalahan mengaburkan dengan penghias :func:`~django.test.override_settings`. Jika anda mengenai sebuah pengecualian ``AttributeError: 'Settings' object has no attribute '_original_allowed_hosts'`, itu mungkin diperbaiki (#20636).
zh_hans: 修复了 :func:`~django.test.override_settings` 装饰器的一个晦涩 Bug。如果你遇到了 ``AttributeError: 'Settings' object has no attribute '_original_allowed_hosts'`` 异常，那么这个问题可能已经修复了（#20636）。

source: Django 1.4.7 release notes
id: Catatan terbitan Django 1.4.7
zh_hans: Django 1.4.7 版本发行说明

source: *September 10, 2013*
zh_hans: *2013 年 9 月 10 日*

source: Django 1.4.7 fixes one security issue present in previous Django releases in the 1.4 series.
id: Django 1.4.7 memperbaiki dua masalah keamanan yang hadir di terbitan Django sebelumnya di rangkaian 1.4.
zh_hans: Django 1.4.7 修复了 1.4 系列中之前 Django 版本存在的一个安全问题。

source: Directory traversal vulnerability in ``ssi`` template tag
id: Kerentanan lintasan direktori dalam etiket cetakan ``ssi``
zh_hans: ``ssi`` 模板标签中的目录遍历漏洞

source: In previous versions of Django it was possible to bypass the ``ALLOWED_INCLUDE_ROOTS`` setting used for security with the ``ssi`` template tag by specifying a relative path that starts with one of the allowed roots. For example, if ``ALLOWED_INCLUDE_ROOTS = ("/var/www",)`` the following would be possible:
id: Dalam versi sebelumnya Django itu telah memungkinkan melewatkan pengaturan ``ALLOWED_INCLUDE_ROOTS`` digunakan untuk keamanan dengan etiket cetakan ``ssi`` dengan menentukan jalur relatif yang dimulai dengan satu dari akar yang diizinkan. Sebagai contoh, jika ``ALLOWED_INCLUDE_ROOTS = ("/var/www",)`` berikutnya akan mungkin:
zh_hans: 在以前的 Django 版本中，可以通过指定以允许的根目录之一开头的相对路径来绕过 ``ssi`` 模板标签用于安全性的 ``ALLOWED_INCLUDE_ROOTS`` 设置。例如，如果 ``ALLOWED_INCLUDE_ROOTS = ("/var/www",)``，那么以下情况是可能的：

source: In practice this is not a very common problem, as it would require the template author to put the ``ssi`` file in a user-controlled variable, but it's possible in principle.
id: Dalam praktiknya ini bukan sangat masalah umum, ketika itu akan membutuhkan cetakan penulis untuk menaruh berkas ``ssi`` di variabel terkendali-pengguna, tetapi itu memungkinkan pada dasarnya.
zh_hans: 实际上，这并不是一个非常常见的问题，因为它需要模板作者将 ``ssi`` 文件放入用户可控制的变量中，但从原理上讲是可能的。

source: Django 1.4.8 release notes
id: Catatan terbitan Django 1.4.8
zh_hans: Django 1.4.8 版本发行说明

source: *September 14, 2013*
zh_hans: *2013 年 9 月 14 日*

source: Django 1.4.8 fixes two security issues present in previous Django releases in the 1.4 series.
id: Django 1.4.8 memperbaiki dua masalah keamanan yang hadir di terbitan Django sebelumnya di rangkaian 1.4.
zh_hans: Django 1.4.8 修复了 1.4 系列中之前 Django 版本存在的两个安全问题。

source: Denial-of-service via password hashers
id: Denial-of-service melalui pengacak sandi
zh_hans: 通过密码哈希器实现拒绝服务攻击

source: In previous versions of Django, no limit was imposed on the plaintext length of a password. This allowed a denial-of-service attack through submission of bogus but extremely large passwords, tying up server resources performing the (expensive, and increasingly expensive with the length of the password) calculation of the corresponding hash.
id: Di versi sebelumnya dari Django, tidak ada batasan dikenakan pada panjang teks polos dari sandi. Ini mengizinkan serangan denial-of-service melalui pengajuan dari tiruan tetapi sandi sangat besar, mengikat sumber daya peladen melakukan (mahal, dan meningkatkan mahal dengan panjang dari sandi) menghitung dari acakan berhubungan.
zh_hans: 在以前的 Django 版本中，没有对密码明文长度施加限制。这允许通过提交虚假但极大的密码进行拒绝服务攻击，耗费服务器资源执行相应散列的计算（随着密码长度的增加，计算越来越昂贵）。

source: As of 1.4.8, Django's authentication framework imposes a 4096-byte limit on passwords and will fail authentication with any submitted password of greater length.
id: Mulai 1.4.8, kerangka kerja autentifikasi Django menyebabkan sebuah batasan 4096 byte pada sandi dan akan gagal autentifikasi dengan apapun sandi yang diajukan dari lebih panjang.
zh_hans: 从 1.4.8 开始，Django 的身份验证框架对密码施加了 4096 字节的限制，并且对于提交的长度超过此限制的密码将无法进行身份验证。

source: Corrected usage of :func:`~django.views.decorators.debug.sensitive_post_parameters` in :mod:`django.contrib.auth`’s admin
zh_hans: 在 :mod:`django.contrib.auth` 的管理员界面中，修正了对 :func:`~django.views.decorators.debug.sensitive_post_parameters` 的使用

source: The decoration of the ``add_view`` and ``user_change_password`` user admin views with :func:`~django.views.decorators.debug.sensitive_post_parameters` did not include :func:`~django.utils.decorators.method_decorator` (required since the views are methods) resulting in the decorator not being properly applied. This usage has been fixed and :func:`~django.views.decorators.debug.sensitive_post_parameters` will now throw an exception if it's improperly used.
id: Penghias ``add_view`` dan ``user_change_password`` dari tampilan admin pengguna dengan :func:`~django.views.decorators.debug.sensitive_post_parameters` tidak menyertakan :func:`~django.utils.decorators.method_decorator` (diwajibkan sejak tampilan adalah metode) menghasilkan di penghias tidak secara benar diberlakukan. Penggunaan ini telah diperbaiki dan :func:`~django.views.decorators.debug.sensitive_post_parameters` akan melempar sebuah pengecualian jika itu tidak benar digunakan.
zh_hans: 对 ``add_view`` 和 ``user_change_password`` 用户管理视图的装饰使用 :func:`~django.views.decorators.debug.sensitive_post_parameters` 时没有包括 :func:`~django.utils.decorators.method_decorator` （因为这些视图是方法），导致装饰器未正确应用。这个使用已经被修复，现在如果不正确使用 :func:`~django.views.decorators.debug.sensitive_post_parameters`，将引发异常。

source: Django 1.4.9 release notes
id: Catatan terbitan Django 1.4.9
zh_hans: Django 1.4.9 版本发行说明

source: *October 23, 2013*
id: *Oktober 23, 2013*
zh_hans: *2013 年 10 月 23 日*

source: Django 1.4.9 fixes a security-related bug in the 1.4 series and one other data corruption bug.
id: Django 1.4.9 memperbaiki kesalahan terkait-keamanan di rangkaian 1.4 dan satu lainnya kesalahan kerusakan data.
zh_hans: Django 1.4.9 修复了 1.4 系列中的一个与安全相关的错误以及另一个数据损坏错误。

source: Readdressed denial-of-service via password hashers
id: Alamatkan kembali denial-of-service melalui pengacak sandi
zh_hans: 重新解决通过密码哈希器实现的拒绝服务攻击问题

source: Django 1.4.8 imposes a 4096-byte limit on passwords in order to mitigate a denial-of-service attack through submission of bogus but extremely large passwords. In Django 1.4.9, we've reverted this change and instead improved the speed of our PBKDF2 algorithm by not rehashing the key on every iteration.
id: Django 1.4.8 menyebabkan batasan 4096-byte pada sandi agar mengurangi serangan denial-of-service melalui pengajuan tiruan tetapi sandi sangat besar. Di Django 1.4.9, kami telah merubah perubahan ini dan malah memperbaiki kecepatan dari algoritma PBKDF2 kami dengan tidak mengacak kembali kunci pada setiap putaran.
zh_hans: Django 1.4.8 对密码施加了 4096 字节的限制，以减轻通过提交虚假但极大的密码进行拒绝服务攻击的风险。在 Django 1.4.9 中，我们撤销了这个更改，而是通过在每次迭代时不重新哈希密钥来提高 PBKDF2 算法的速度。
