Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Denial-of-service via pathological regular expression performance. `Full description <https://www.djangoproject.com/weblog/2009/oct/09/security/>`__
id: Denial-of-service melalui penampilan pernyataan regular patologi. `Full description <https://www.djangoproject.com/weblog/2009/oct/09/security/>`__
zh_hans: 通过缺陷正则表达性能拒绝服务。`完整说明 <https://www.djangoproject.com/weblog/2009/oct/09/security/>`__

source: Django 1.0 :commit:`(patch) <594a28a9044120bed58671dde8a805c9e0f6c79a>`
zh_hans: Django 1.0 :commit:`（补丁） <594a28a9044120bed58671dde8a805c9e0f6c79a>`

source: Django 1.1 :commit:`(patch) <e3e992e18b368fcd56aabafc1b5bf80a6e11b495>`
zh_hans: Django 1.1 :commit:`（补丁） <e3e992e18b368fcd56aabafc1b5bf80a6e11b495>`

source: July 28, 2009 - :cve:`2009-2659`
id: 28 Juli 2009 - :cve:`2009-2659`
zh_hans: 2009 年 7 月 28 日 - :cve:`2009-2659`

source: Directory-traversal in development server media handler. `Full description <https://www.djangoproject.com/weblog/2009/jul/28/security/>`__
id: Lintasan-direktori dalam penangan media peladen pengembangan. `Full description <https://www.djangoproject.com/weblog/2009/jul/28/security/>`__
zh_hans: 开发服务器媒体处理程序中的目录遍历。`完整说明 <https://www.djangoproject.com/weblog/2009/jul/28/security/>`__

source: Django 0.96 :commit:`(patch) <da85d76fd6ca846f3b0ff414e042ddb5e62e2e69>`
zh_hans: Django 0.96 :commit:`（补丁） <da85d76fd6ca846f3b0ff414e042ddb5e62e2e69>`

source: Django 1.0 :commit:`(patch) <df7f917b7f51ba969faa49d000ffc79572c5dcb4>`
zh_hans: Django 1.0 :commit:`（补丁） <df7f917b7f51ba969faa49d000ffc79572c5dcb4>`

source: September 2, 2008 - :cve:`2008-3909`
id: 2 September 2008 - :cve:`2008-3909`
zh_hans: 2008 年 9 月 2 日 - :cve:`2008-3909`

source: CSRF via preservation of POST data during admin login. `Full description <https://www.djangoproject.com/weblog/2008/sep/02/security/>`__
id: CSRF melalui pemeliharaan dari data POST selama masuk admin. `Full description <https://www.djangoproject.com/weblog/2008/sep/02/security/>`__
zh_hans: 在管理员登录时通过保存 POST 数据进行 CSRF。`完整说明 <https://www.djangoproject.com/weblog/2008/sep/02/security/>`__

source: Django 0.91 :commit:`(patch) <44debfeaa4473bd28872c735dd3d9afde6886752>`
zh_hans: Django 0.91 :commit:`（补丁） <44debfeaa4473bd28872c735dd3d9afde6886752>`

source: Django 0.95 :commit:`(patch) <aee48854a164382c655acb9f18b3c06c3d238e81>`
zh_hans: Django 0.95 :commit:`（补丁） <aee48854a164382c655acb9f18b3c06c3d238e81>`

source: Django 0.96 :commit:`(patch) <7e0972bded362bc4b851c109df2c8a6548481a8e>`
zh_hans: Django 0.96 :commit:`（补丁） <7e0972bded362bc4b851c109df2c8a6548481a8e>`

source: May 14, 2008 - :cve:`2008-2302`
id: 14 mei 2008 - :cve:`2008-2302`
zh_hans: 2008 年 5 月 14 日 - :cve:`2008-2302`

source: XSS via admin login redirect. `Full description <https://www.djangoproject.com/weblog/2008/may/14/security/>`__
id: XSS melalui pengalihan masuk admin. `Full description <https://www.djangoproject.com/weblog/2008/may/14/security/>`__
zh_hans: 通过管理员登录重定向进行 XSS。`完整说明 <https://www.djangoproject.com/weblog/2008/may/14/security/>`__

source: Django 0.91 :commit:`(patch) <6e657e2c404a96e744748209e896d8a69c15fdf2>`
zh_hans: Django 0.91 :commit:`（补丁） <6e657e2c404a96e744748209e896d8a69c15fdf2>`

source: Django 0.95 :commit:`(patch) <50ce7fb57d79e8940ccf6e2781f2f01df029b5c5>`
zh_hans: Django 0.95 :commit:`（补丁） <50ce7fb57d79e8940ccf6e2781f2f01df029b5c5>`

source: Django 0.96 :commit:`(patch) <7791e5c050cebf86d868c5dab7092185b125fdc9>`
zh_hans: Django 0.96 :commit:`（补丁） <7791e5c050cebf86d868c5dab7092185b125fdc9>`

source: October 26, 2007 - :cve:`2007-5712`
id: 26 Oktober 2007 - :cve:`2007-5712`
zh_hans: 2007 年 10 月 26 日 - :cve:`2007-5712`

source: Denial-of-service via arbitrarily-large ``Accept-Language`` header. `Full description <https://www.djangoproject.com/weblog/2007/oct/26/security-fix/>`__
id: Denial-of-service melalui kepala ``Accept-Language`` besar-berubah-ubah. `Full description <https://www.djangoproject.com/weblog/2007/oct/26/security-fix/>`__
zh_hans: 通过任意大的 ``Accept-Language`` 头拒绝服务。`完整说明 <https://www.djangoproject.com/weblog/2007/oct/26/security-fix/>`__

source: Django 0.91 :commit:`(patch) <8bc36e726c9e8c75c681d3ad232df8e882aaac81>`
zh_hans: Django 0.91 :commit:`（补丁） <8bc36e726c9e8c75c681d3ad232df8e882aaac81>`

source: Django 0.95 :commit:`(patch) <412ed22502e11c50dbfee854627594f0e7e2c234>`
zh_hans: Django 0.95 :commit:`（补丁） <412ed22502e11c50dbfee854627594f0e7e2c234>`

source: Django 0.96 :commit:`(patch) <7dd2dd08a79e388732ce00e2b5514f15bd6d0f6f>`
zh_hans: Django 0.96 :commit:`（补丁） <7dd2dd08a79e388732ce00e2b5514f15bd6d0f6f>`

source: Issues prior to Django's security process
id: Masalah-masalah pada sebelum pengolahan keamanan Django
zh_hans: Django 安全进程之前的问题

source: Some security issues were handled before Django had a formalized security process in use. For these, new releases may not have been issued at the time and CVEs may not have been assigned.
id: Beberapa masalah keamanan ditangani sebelum Django telah menyusun pengolahan keamanan yang digunakan. Untuk ini, terbitan baru mungkin tidak telah dikeluarkan pada saat itu dan CVE mungkin tidak telah ditentukan.
zh_hans: 有些安全问题是在 Django 还没有正式使用安全流程之前就已经处理好的。对于这些问题，当时可能还没有发布新的版本，可能还没有分配 CVE。

source: January 21, 2007 - :cve:`2007-0405`
id: 21 Januari 2007 - :cve:`2007-0405`
zh_hans: 2007 年 1 月 21 日 - :cve:`2007-0405`

source: Apparent "caching" of authenticated user. `Full description <https://www.djangoproject.com/weblog/2007/jan/21/0951/>`__
id: Kejelasan "caching" dari pengguna terautentifikasi. `Full description <https://www.djangoproject.com/weblog/2007/jan/21/0951/>`__
zh_hans: 对认证用户进行明显的 “缓存”。`完整说明 <https://www.djangoproject.com/weblog/2007/jan/21/0951/>`__

source: Django 0.95 :commit:`(patch) <e89f0a65581f82a5740bfe989136cea75d09cd67>`
zh_hans: Django 0.95 :commit:`（补丁） <e89f0a65581f82a5740bfe989136cea75d09cd67>`

source: August 16, 2006 - :cve:`2007-0404`
id: 16 Agustus 2006 - :cve:`2007-0404`
zh_hans: 2006 年 8 月 16 日 - :cve:`2007-0404`

source: Filename validation issue in translation framework. `Full description <https://www.djangoproject.com/weblog/2006/aug/16/compilemessages/>`__
id: Masalah pengesahan nama berkas di terjemahan kerangka kerja. `Full description <https://www.djangoproject.com/weblog/2006/aug/16/compilemessages/>`__
zh_hans: 翻译框架中的文件名验证问题。`完整说明 <https://www.djangoproject.com/weblog/2006/aug/16/compilemessages/>`__

source: Django 0.90 :commit:`(patch) <6eefa521be3c658dc0b38f8d62d52e9801e198ab>`
zh_hans: Django 0.90 :commit:`（补丁） <6eefa521be3c658dc0b38f8d62d52e9801e198ab>`

source: Django 0.91 :commit:`(patch) <d31e39173c29537e6a1613278c93634c18a3206e>`
zh_hans: Django 0.91 :commit:`（补丁） <d31e39173c29537e6a1613278c93634c18a3206e>`

source: Django 0.95 :commit:`(patch) <a132d411c6986418ee6c0edc331080aa792fee6e>` (released January 21 2007)
zh_hans: Django 0.95 :commit:`（补丁） <a132d411c6986418ee6c0edc331080aa792fee6e>` （2007 年 1 月 21 日发布）

source: It's now more explicit and natural to override save() and delete() methods on models, rather than needing to hook into the pre_save() and post_save() method hooks.
id: Sekarang lebih eksplisit dan alami untuk menimpa metode save() dan delete() pada model, daripada membutuhkan untuk mengaitkan kedalam metode kaitan pre_save() dan post_save().

source: Finally, for those who prefer the more immediate feedback offered by IRC, there's a `#django` channel on irc.freenode.net that is regularly populated by Django users and developers from around the world. Friendly people are usually available at any hour of the day -- to help, or just to chat.
id: Akhirnya, untuk mereka yang memilih umpan balik lebih cepat ditawarkan oleh IRC, ada sebuah saluran `#django` pada irc.freenode.net yaitu secara umum dikumpulkan oleh pengguna Django dan pengembang dari seluruh dunia. Orang bersahabat biasanya tersedia pada setiap jam dari hari -- untuk membantu, atau cukup mengobrol.

source: Everyone who submitted a bug report, patch or ticket comment. We can't possibly thank everyone by name -- over 200 developers submitted patches that went into 0.96 -- but everyone who's contributed to Django is listed in AUTHORS_.
id: Setiap orang yang mengajukan laoran kesalahan, tambalan, atau komentar tiket. Kami tidak mungkin berterima kasih semuanya berdasarkan nama -- lebih 200 pengembang mengajukan tambalan yang masuk ke 0.96 -- tetapi setiap orang yang menyumbang ke Django didaftarkan dalam AUTHORS_.

source: We've been looking forward to this moment for over three years, and it's finally here. Django 1.0 represents the largest milestone in Django's development to date: a Web framework that a group of perfectionists can truly be proud of.
id: Kami telah mencari kedepan untuk saat ini selama lebih tiga tahun, dan itu akhirnya disini. Django 1.0 mewakili batu peringatan terbesar di pengembangan Django pada hari: sebuah kerangka kerja Jaringan dari kesempurnaan dapat benar-benar dibanggakan.

source: Re-factored admin application
id: Refaktor aplikasi admin

source: See http://geodjango.org/ for details.
id: Lihat http://geodjango.org/ untuk rincian.

source: A number of features and methods which had previously been marked as deprecated, and which were scheduled for removal prior to the 1.0 release, are no longer present in Django. These include imports of the form library from ``django.newforms`` (now located simply at ``django.forms``), the ``form_for_model`` and ``form_for_instance`` helper functions (which have been replaced by ``ModelForm``) and a number of deprecated features which were replaced by the dispatcher, file-uploading and file-storage refactorings introduced in the Django 1.0 alpha releases.
id: Sejumlah fitur dan metode yang sebelumnya telah ditandai sebagai diusangkan, dan yang telah dijadwalkan untuk dipindahkan sebelumnya pada terbitan 1.1, tidak lagi hadir di Django. Ini termasuk impor dari pustaka formulir dari ``django.newforms`` (sekarang bertempat cukup di ``django.forms``), fungsi pembantu ``form_for_model`` dan ``form_for_instance`` (yang telah diganti oleh ``ModelForm``) dan sejumlah fitur diusangkan yang diganti oleh pengirim, pengunggahan berkas dan refaktor penyimpanan berkas diperkenalkan dalam terbitan alpha Django 1.0.

source: Practically, this means you'll need to rewrite all of your ``class Admin`` declarations. You've already seen in `models`_ above how to replace your ``class Admin`` with a ``admin.site.register()`` call in an ``admin.py`` file. Below are some more details on how to rewrite that ``Admin`` declaration into the new syntax.
id: Sebenarnya, ini berarti anda akan butuh menulis kembali semua pernyataan ``class Admin`` anda. Anda telah melihat di `models`_ diatas bagaimana mengganti ``class Admin`` anda dengan sebuah panggilan ``admin.site.register()`` dalam sebuah berkas ``admin.py``. Dibawah ini adalah beberapa lebih rinci pada bagimana menulis kembali pernyataan ``Admin`` itu kedalam sintaksis baru.

source: URLs
id: URL

source: For SQLite, this means making a copy of the single file that stores the database (the name of that file is the ``DATABASE_NAME`` in your settings.py file).
id: Untuk SQLite, ini berarti membuat sebuah salinan dari berkas tunggal yang menyimpan basisdata (nama dari berkas itu adalah ``DATABASE_NAME`` di berkas settings.py anda).

source: In the second step you will be asked to confirm that you are prepared to lose the data for the application(s) in question. Say yes; we'll restore this data in the third step, of course.
id: Di langkah kedua anda akan diminta menegaskan bahwa anda siap kehilangan data untuk aplikasi di pertanyaan. Katakan ya; kami akan menyimpan kembali data ini di langkah ketiga, tentu saja.

source: However, **users on 64-bit platforms may experience some problems** using the ``reset`` management command. Prior to this change, 64-bit platforms would generate a 64-bit, 16 character digest in the constraint name; for example::
id: Bagaimanapun, **pengguna pada serambi 64-bit mungkin mengalami beberapa masalah** menggunakan perintah pengelolaan ``reset``. Sebelum ke perubahan ini, serambi 64-bit akan membangkitkan 64-bit, perpendekan 16 karakter di nama batasan; sebagai contoh::

source: Following this change, all platforms, regardless of word size, will generate a 32-bit, 8 character digest in the constraint name; for example::
id: Mengikuti perubahan ini, semua serambi, tanpa memperhatikan ukuran kata, akan membangkitkan 32-bit, perpendekan 8 karakter di nama pembatasan; sebagai contoh::

source: In Django 1.1, GeoDjango_ (i.e. ``django.contrib.gis``) has several new features:
id: Di Django 1.1, GeoDjango_ (yaitu ``django.contrib.gis``) mempunyai beberapa fitur baru:

source: Django now can :doc:`easily delegate authentication to the Web server </howto/auth-remote-user>` via a new authentication backend that supports the standard ``REMOTE_USER`` environment variable used for this purpose.
id: Django sekarang dapat :doc:`easily delegate authentication to the Web server </howto/auth-remote-user>` melalui backend pengecekan baru yang mendukung standar variabel lingkungan ``REMOTE_USER`` digunakan untuk tujuan ini.

source: We'll take a short break, and then work on Django 1.2 will begin -- no rest for the weary! If you'd like to help, discussion of Django development, including progress toward the 1.2 release, takes place daily on the |django-developers| mailing list and in the ``#django-dev`` IRC channel on ``irc.freenode.net``. Feel free to join the discussions!
id: Kami akan mengambil istirahat pendek, dan kemudian kerja pada Django 1.2 akan dimulai -- tidak ada istirahat untuk lelah! Jika anda suka membantu, obrolan dari pengembangan Django, termasuk kemajuan terhadap terbitan 1.2, mengambil tempat harian pada daftar penyuratan |django-developers| dan di saluran IRC ``#django-dev`` pada ``irc.freenode.net``. Jangan ragu untuk bergabung di obrolan.

source: To remedy this, ``django.contrib.admin`` will now validate that querystring lookup arguments either specify only fields on the model being viewed, or cross relations which have been explicitly whitelisted by the application developer using the pre-existing mechanism mentioned above. This is backwards-incompatible for any users relying on the prior ability to insert arbitrary lookups.
id: Untuk memperbaiki ini, ``django.contrib.admin`` akan sekarang mensahkan argumen pencarian querystring itu antara menentukan hanya bidang pada model sedang ditampilkan, atau hubungan silang yang telah secara eksplisit didaftar putihkan dengan pengembang aplikasi menggunakan mekanisme sudah ada yang disebutkan ditas. Ini adalah bertentangan kebelakang untuk setiap pengguna bergantung pada kemampuan sebelumnya untuk memasukkan pencarian yang berubah-ubah.

source: :doc:`A new style of middleware is introduced </topics/http/middleware>` to solve the lack of strict request/response layering of the old-style of middleware described in `DEP 0005 <https://github.com/django/deps/blob/master/final/0005-improved-middleware.rst>`_. You'll need to :ref:`adapt old, custom middleware <upgrading-middleware>` and switch from the ``MIDDLEWARE_CLASSES`` setting to the new :setting:`MIDDLEWARE` setting to take advantage of the improvements.
id: :doc:`A new style of middleware is introduced </topics/http/middleware>` untuk menyelesaikan kurang ketatnya permintaan/tanggapan melapisi pada gaya lama dari middleware digambarkan di `DEP 0005 <https://github.com/django/deps/blob/master/final/0005-improved-middleware.rst>`_. Anda akan butuh :ref:`adapt old, custom middleware <upgrading-middleware>` dan mengganti dari pengaturan ``MIDDLEWARE_CLASSES`` ke pengaturan :setting:`MIDDLEWARE` baru untuk mengambil keuntungan dari perbaikan.

source: The username validator now explicitly accepts Unicode characters by default on Python 3 only. This default behavior can be overridden by changing the :attr:`~django.contrib.auth.models.User.username_validator` attribute of the ``User`` model, or to any proxy of that model, using either :class:`~django.contrib.auth.validators.ASCIIUsernameValidator` or :class:`~django.contrib.auth.validators.UnicodeUsernameValidator`. Custom user models may also use those validators.
id: Pengesah nama pengguna sekarang jelas menerima karakter Unicode secara awalan pada hanya Python 3. Perilaku awalan ini dapat ditimpa dengan merubah atribut :attr:`~django.contrib.auth.models.User.username_validator`dari model ``User``, atau ke proxy manapun dari model itu, menggunakan baik :class:`~django.contrib.auth.validators.ASCIIUsernameValidator` atau :class:`~django.contrib.auth.validators.UnicodeUsernameValidator`. Model pengguna penyesuaian mungkin juga menggunakan pengesah tersebut.

source: If a user doesn't have the add permission, the ``object-tools`` block on a model's changelist will now be rendered (without the add button, of course). This makes it easier to add custom tools in this case.
id: Jika pengguna tidak mempunyai perizinan tambah, ``object-tools`` menghalangi pada daftar perubahan model akan sekarang dibangun (tanpa tombol tambah, tentunya). Ini membuat itu lebih mudah menambahkan alat penyesuaian dalam kasus ini.

source: Django 1.8 added validation for non-relational fields in ``select_related()``::
id: Django 1.8 ditambahkan pengesahan untuk bidang bukan-hubungan di ``select_related()``::

source: But it didn't prohibit nested non-relation fields as it does now::
id: Tetapi dia tidak melarang bidang bukan-hubungan bersarang seperti yang dia lakukan sekarang::

source: :setting:`DATA_UPLOAD_MAX_MEMORY_SIZE` limits the size that a request body may be. File uploads don't count towards this limit.
id: :setting:`DATA_UPLOAD_MAX_MEMORY_SIZE` membatasi ukuran yang permintaan badan mungkin. Unggah berkas tidak menghitung menuju batasan ini.

source: The WSGI handler no longer removes content of responses from ``HEAD`` requests or responses with a ``status_code`` of 100-199, 204, or 304. Most Web servers already implement this behavior. Responses retrieved using the Django test client continue to have these "response fixes" applied.
id: Penangan WSGI tidak lagi memindahkan isi dari tanggapan dari permintaan ``HEAD`` atau tanggapan dengan ``status_code`` dari 100-199, 204, atau 304. Kebanyakan peladen Jaringan sudah menerapkan perilaku ini. Tanggapan diambil menggunakan klien percobaan Django untuk memiliki "response fixes" diberlakukan.

source: When :setting:`USE_L10N` is ``True``, localization is now applied for the :tfilter:`date` and :tfilter:`time` filters when no format string is specified. The ``DATE_FORMAT`` and ``TIME_FORMAT`` specifiers from the active locale are used instead of the settings of the same name.
id: Ketika :setting:`USE_L10N` adalah ``True``, lokalisasi sekarang berlaku untuk penyaring :tfilter:`date` dan :tfilter:`time` ketika tidak ada bentuk string ditentukan. Penentu ``DATE_FORMAT`` dan ``TIME_FORMAT`` dari lokal aktif digunakan daripada mengatur nama sama.

source: Instead of assigning related objects using direct assignment::
id: Daripada menugaskan obyek terhubung menggunakan penugasan langsung::

source: Use the :meth:`~django.db.models.fields.related.RelatedManager.set` method added in Django 1.9::
id: Penggunaan metode :meth:`~django.db.models.fields.related.RelatedManager.set` ditambahkan di Django 1.9::

source: In older versions, :attr:`~django.db.models.Options.default_related_name` couldn't be used as a query lookup. This is fixed and support for the old lookup name is deprecated. For example, since ``default_related_name`` is set in model ``Bar``, instead of using the model name ``bar`` as the lookup::
id: Di versi terlama, :attr:`~django.db.models.Options.default_related_name` tidak dapat digunakan sebagai pencarian permintaan, Ini diperbaiki dan dukungan untuk nama pencarian lama diusangkan. Sebagai contoh, sejak ``default_related_name`` disetel di model ``Bar``, daripada menggunakan nama model ``bar`` sebagai pencarian::

source: use the default_related_name ``bars``::
id: gunakan ``bars`` default_related_name::

source: Fixed ``ClearableFileInput``s "Clear" checkbox on model form fields where the model field has a ``default`` (:ticket:`27805`).
id: Diperbaiki kotak centang "Clear" ``ClearableFileInput`` pada bidang formulir model dimana bidang model mempunyai sebuah ``default`` (:ticket:`27805`).

source: Fixed a ``GDALException`` raised by ``GDALClose`` on GDAL 2.0 (:ticket:`27479`).
id: Diperbaiki ``GDALException`` dimunculkan oleh ``GDALClose`` pada GDAL 2.0 (:ticket:`27479`).

source: Django 1.11 is designated as a :term:`long-term support release`. It will receive security updates for at least three years after its release. Support for the previous LTS, Django 1.8, will end in April 2018.
id: Django 1.11 dirancang sebagai :term:`long-term support release`. Itu akan menerima pembaharuan keamanan untuk setidaknya tiga tahun setelah terbitannya. Dukungan untuk LTS sebelumnya, Django 1.8, akan berakhir di April 2018.

source: The :class:`~django.db.models.Index` class creates a b-tree index, as if you used :attr:`~django.db.models.Field.db_index` on the model field or :attr:`~django.db.models.Options.index_together` on the model ``Meta`` class. It can be subclassed to support different index types, such as :class:`~django.contrib.postgres.indexes.GinIndex`. It also allows defining the order (ASC/DESC) for the columns of the index.
id: Kelas :class:`~django.db.models.Index` membuat sebuah indeks b-tree, seolah-olah anda menggunakan :attr:`~django.db.models.Field.db_index` pada bidang model atau :attr:`~django.db.models.Options.index_together` pada model kelas ``Meta``. Itu dapat disubkelaskan untuk mendukung jenis-jenis indeks berbeda, seperti :class:`~django.contrib.postgres.indexes.GinIndex`. Itu juga mengizinkan menentukan urutan (ASC/DEC) untuk kolom-kolom dari indeks.

source: Added the ability to pass the `size`, `shape`, and `offset` parameter when creating :class:`~django.contrib.gis.gdal.GDALRaster` objects.
id: Ditambahkan kemampuan melewatkan parameter `size`, `shape`, dan `offset` ketika memuat obyek :class:`~django.contrib.gis.gdal.GDALRaster`.

source: :class:`~django.contrib.postgres.fields.JSONField` accepts a new ``encoder`` parameter to specify a custom class to encode data types not supported by the standard encoder.
id: :class:`~django.contrib.postgres.fields.JSONField` menerima sebuah parameter ``encoder`` baru untuk menentukan kelas penyesuaian untuk menyandikan jenis-jenis data tidak didukung oleh penyandi standar.

source: The new :class:`~django.contrib.postgres.fields.CIText` mixin and :class:`~django.contrib.postgres.operations.CITextExtension` migration operation allow using PostgreSQL's ``citext`` extension for case-insensitive lookups. Three fields are provided: :class:`.CICharField`, :class:`.CIEmailField`, and :class:`.CITextField`.
id: Mixin :class:`~django.contrib.postgres.fields.CIText` baru dan tindakan perpindahan :class:`~django.contrib.postgres.operations.CITextExtension` mengizinkan menggunakan tambahan ``citext`` PostgreSQL untuk pencarian kasus-tidak-sensitif. Tiga bidang disediakan: :class:`.CICharField`, :class:`.CIEmailField`, dan :class:`.CITextField`.

source: :meth:`.QuerySet.iterator()` now uses :ref:`server-side cursors <psycopg2:server-side-cursors>` on PostgreSQL. This feature transfers some of the worker memory load (used to hold query results) to the database and might increase database memory usage.
id: :meth:`.QuerySet.iterator()` sekarang menggunakan :ref:`server-side cursors <psycopg2:server-side-cursors>` pada PostgreSQL. Fitur ini mengirimkan beberapa dari pekerja memori muatan (digunakan untuk menampung hasil permintaan) ke basisdata dan mungkin meningkatkan penggunaan memori basisdata.
