Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/releases.po
Languages: id, zh_hans

source: Since ``django.contrib.contenttypes.generic`` defined both admin and model related objects, an import of this module could trigger unexpected side effects. As a consequence, its contents were split into :mod:`~django.contrib.contenttypes` submodules and the ``django.contrib.contenttypes.generic`` module is deprecated:
id: Sejak ``django.contrib.contenttypes.generic`` menentukan kedua admin dan obyek terkait model, sebuah impor dari modul ini dapat memicu efek samping yang tidak diharapkan. Sebagai sebuah konsekuensi, isinya dipisah menjadi submodul :mod:`~django.contrib.contenttypes` dan modul ``django.contrib.contenttypes.generic`` diusangkan.
zh_hans: 由于 ``django.contrib.contenttypes.generic`` 定义了与管理和模型相关的对象，导入该模块可能会触发意外的副作用。因此，其内容已被拆分为 :mod:`~django.contrib.contenttypes` 子模块，并且 ``django.contrib.contenttypes.generic`` 模块已被弃用：

source: :class:`~django.contrib.contenttypes.fields.GenericForeignKey` and :class:`~django.contrib.contenttypes.fields.GenericRelation` now live in :mod:`~django.contrib.contenttypes.fields`.
id: :class:`~django.contrib.contenttypes.fields.GenericForeignKey` dan :class:`~django.contrib.contenttypes.fields.GenericRelation` sekarang berada di :mod:`~django.contrib.contenttypes.fields`.
zh_hans: :class:`~django.contrib.contenttypes.fields.GenericForeignKey` 和 :class:`~django.contrib.contenttypes.fields.GenericRelation` 现在位于 :mod:`~django.contrib.contenttypes.fields` 中。

source: :class:`~django.contrib.contenttypes.forms.BaseGenericInlineFormSet` and :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` now live in :mod:`~django.contrib.contenttypes.forms`.
id: :class:`~django.contrib.contenttypes.forms.BaseGenericInlineFormSet` dan :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` sekarang berada di :mod:`~django.contrib.contenttypes.forms`.
zh_hans: :class:`~django.contrib.contenttypes.forms.BaseGenericInlineFormSet` 和 :func:`~django.contrib.contenttypes.forms.generic_inlineformset_factory` 现在位于 :mod:`~django.contrib.contenttypes.forms` 中。

source: :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`, :class:`~django.contrib.contenttypes.admin.GenericStackedInline` and :class:`~django.contrib.contenttypes.admin.GenericTabularInline` now live in :mod:`~django.contrib.contenttypes.admin`.
id: :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`, :class:`~django.contrib.contenttypes.admin.GenericStackedInline` dan :class:`~django.contrib.contenttypes.admin.GenericTabularInline` sekarang berada di :mod:`~django.contrib.contenttypes.admin`.
zh_hans: :class:`~django.contrib.contenttypes.admin.GenericInlineModelAdmin`、:class:`~django.contrib.contenttypes.admin.GenericStackedInline` 和 :class:`~django.contrib.contenttypes.admin.GenericTabularInline` 现在位于 :mod:`~django.contrib.contenttypes.admin` 中。

source: The ``syncdb`` command has been deprecated in favor of the new :djadmin:`migrate` command. ``migrate`` takes the same arguments as ``syncdb`` used to plus a few more, so it's safe to just change the name you're calling and nothing else.
id: Perintah ``syncdb`` telah diusangkan dalam mendukung dari perintah :djadmin:`migrate` baru. ``migrate`` mengambil argumen sama sebagai ``syncdb`` digunakan untuk menambah sedikit lagi, jadi itu aman untuk hanya merubah nama anda sedang panggil dan tidak ada lagi.
zh_hans: ``syncdb`` 命令已被弃用，推荐使用新的 :djadmin:`migrate` 命令。``migrate`` 命令接受与以前的 ``syncdb`` 相同的参数，还添加了一些额外的参数，因此只需更改调用的名称而不需要做其他更改。

source: ``util`` modules renamed to ``utils``
id: Modul ``util`` dinamai kembali menjadi ``utils``
zh_hans: ``util`` 模块已重命名为 ``utils``

source: The following instances of ``util.py`` in the Django codebase have been renamed to ``utils.py`` in an effort to unify all util and utils references:
id: Instance berikut dari ``util.py`` di kode dasar Django telah dinamai kembali menjadi ``utils.py`` di sebuah usaha untuk menyatukan semua acuan util dan utils:
zh_hans: 在 Django 代码库中，以下实例的 ``util.py`` 已重命名为 ``utils.py``，以统一所有 util 和 utils 的引用：

source: ``get_formsets`` method on ``ModelAdmin``
id: Metode ``get_formsets`` pada ``ModelAdmin``
zh_hans: 在 ``ModelAdmin`` 上的 ``get_formsets`` 方法

source: ``ModelAdmin.get_formsets`` has been deprecated in favor of the new :meth:`~django.contrib.admin.ModelAdmin.get_formsets_with_inlines`, in order to better handle the case of selectively showing inlines on a ``ModelAdmin``.
id: ``ModelAdmin.get_formsets`` telah diusangkan mendukung dari :meth:`~django.contrib.admin.ModelAdmin.get_formsets_with_inlines` baru, agar menjadi lebih baik menangani kasus dari memilih menampilkan berderet pada ``ModelAdmin``.
zh_hans: ``ModelAdmin.get_formsets`` 已弃用，推荐使用新的 :meth:`~django.contrib.admin.ModelAdmin.get_formsets_with_inlines`，以更好地处理在 ``ModelAdmin`` 上有选择地显示内联表单的情况。

source: The ``django.db.models.IPAddressField`` and ``django.forms.IPAddressField`` fields have been deprecated in favor of :class:`django.db.models.GenericIPAddressField` and :class:`django.forms.GenericIPAddressField`.
id: Bidang ``django.db.models.IPAddressField`` dan ``django.forms.IPAddressField`` telah diusangkan dalam mendukung :class:`django.db.models.GenericIPAddressField` dan :class:`django.forms.GenericIPAddressField`.
zh_hans: ``django.db.models.IPAddressField`` 和 ``django.forms.IPAddressField`` 字段已弃用，推荐使用 :class:`django.db.models.GenericIPAddressField` 和 :class:`django.forms.GenericIPAddressField`。

source: ``BaseMemcachedCache._get_memcache_timeout`` method
id: Metode ``BaseMemcachedCache._get_memcache_timeout``
zh_hans: ``BaseMemcachedCache._get_memcache_timeout`` 方法

source: The ``BaseMemcachedCache._get_memcache_timeout()`` method has been renamed to ``get_backend_timeout()``. Despite being a private API, it will go through the normal deprecation.
id: Metode ``BaseMemcachedCache._get_memcache_timeout()`` telah dinamai kembali menjadi ``get_backend_timeout()``. Meskipun menjadi sebuah API pribadi, itu akan melalui pengusangan biasa.
zh_hans: ``BaseMemcachedCache._get_memcache_timeout()`` 方法已重命名为 ``get_backend_timeout()``。尽管它是一个私有 API，但它将经历正常的弃用过程。

source: Natural key serialization options
id: Pilihan serialisasi kunci alami
zh_hans: 自然键序列化选项

source: The ``--natural`` and ``-n`` options for :djadmin:`dumpdata` have been deprecated. Use :option:`dumpdata --natural-foreign` instead.
id: Pilihan ``--natural`` dan ``-n`` untuk :djadmin:`dumpdata` telah diusangkan. Gunakan :option:`dumpdata --natural-foreign` sebagai gantinya.
zh_hans: ``--natural`` 和 ``-n`` 选项对于 :djadmin:`dumpdata` 已被弃用。请改用 :option:`dumpdata --natural-foreign`。

source: Similarly, the ``use_natural_keys`` argument for ``serializers.serialize()`` has been deprecated. Use ``use_natural_foreign_keys`` instead.
id: Demikian pula, argumen ``use_natural_keys`` untuk ``serializers.serialize()`` telah diusangkan. Gunakan ``use_natural_foreign_keys`` sebagai gantinya.
zh_hans: 类似地，对于 ``serializers.serialize()`` 的 ``use_natural_keys`` 参数已被弃用。请改用 ``use_natural_foreign_keys``。

source: Merging of ``POST`` and ``GET`` arguments into ``WSGIRequest.REQUEST``
id: Menggabungkan argumen ``POST`` dan ``GET`` kedalam ``WSGIRequest.REQUEST``
zh_hans: 将 ``POST`` 和 ``GET`` 参数合并到 ``WSGIRequest.REQUEST`` 中

source: It was already strongly suggested that you use ``GET`` and ``POST`` instead of ``REQUEST``, because the former are more explicit. The property ``REQUEST`` is deprecated and will be removed in Django 1.9.
id: Itu sudah sangat dianjurkan bahwa anda menggunakan ``GET`` dan ``POST`` daripada ``REQUEST``, karena yang terlebih dahulu lebih eksplisit. Sifat ``REQUEST`` diusangkan dan akan dipindahkan di Django 1.9.
zh_hans: 已经强烈建议使用 ``GET`` 和 ``POST`` 而不是 ``REQUEST``，因为前者更加明确。属性 ``REQUEST`` 已弃用，并将在 Django 1.9 中移除。

source: ``django.utils.datastructures.MergeDict`` class
id: Kelas ``django.utils.datastructures.MergeDict``
zh_hans: ``django.utils.datastructures.MergeDict`` 类

source: ``MergeDict`` exists primarily to support merging ``POST`` and ``GET`` arguments into a ``REQUEST`` property on ``WSGIRequest``. To merge dictionaries, use ``dict.update()`` instead. The class ``MergeDict`` is deprecated and will be removed in Django 1.9.
id: ``MergeDict`` ada utamanya untuk mendukung penggabungan argumen ``POST`` dan ``GET`` kedalam sebuah sifat ``REQUEST`` pada ``WSGIRequest``. Untuk menggabungkan kamus, gunakan ``dict.update()`` sebagai gantinya. Kelas ``MergeDict`` diusangkan dan akan dipindahkan di Django 1.9.
zh_hans: ``MergeDict`` 主要用于将 ``POST`` 和 ``GET`` 参数合并到 ``WSGIRequest`` 上的 ``REQUEST`` 属性中。要合并字典，请使用 ``dict.update()``。类 ``MergeDict`` 已被弃用，并将在 Django 1.9 中移除。

source: Language codes ``zh-cn``, ``zh-tw`` and ``fy-nl``
id: Kode bahasa ``zh-cn``, ``zh-tw`` dan ``fy-nl``
zh_hans: 语言代码 ``zh-cn``、``zh-tw`` 和 ``fy-nl``

source: The currently used language codes for Simplified Chinese ``zh-cn``, Traditional Chinese ``zh-tw`` and (Western) Frysian ``fy-nl`` are deprecated and should be replaced by the language codes ``zh-hans``, ``zh-hant`` and ``fy`` respectively. If you use these language codes, you should rename the locale directories and update your settings to reflect these changes. The deprecated language codes will be removed in Django 1.9.
id: Kode bahasa digunakan saat ini untuk China Disederhanakan ``zh-cn``, China Tradisional ``zh-tw`` dan (Barat) Frysian ``fy-nl`` diusangkan dan harus diganti dengan kode bahasa ``zh-hans``, ``zh-hant`` and ``fy`` masing-masing. Jika anda menggunakan kode bahasa ini, anda harus menamai kembali direktori lokal dan memperbaharui pengaturan anda untuk mencerminkan perubahan ini. Kode bahasa pengusangan akan diindahkan di Django 1.9.
zh_hans: 目前用于简体中文的语言代码 ``zh-cn``，繁体中文的语言代码 ``zh-tw`` 和 (西弗里西亚) 弗里西亚语的语言代码 ``fy-nl`` 已被弃用，应分别替换为语言代码 ``zh-hans``，``zh-hant`` 和 ``fy``。如果您使用这些语言代码，应重命名区域目录并更新您的设置以反映这些更改。弃用的语言代码将在 Django 1.9 中移除。

source: ``django.utils.functional.memoize`` function
id: Fungsi ``django.utils.functional.memoize``
zh_hans: ``django.utils.functional.memoize`` 函数

source: The function ``memoize`` is deprecated and should be replaced by the ``functools.lru_cache`` decorator (available from Python 3.2 onward).
zh_hans: 函数 ``memoize`` 已被弃用，应替换为 ``functools.lru_cache`` 装饰器（从 Python 3.2 开始可用）。

source: Django ships a backport of this decorator for older Python versions and it's available at ``django.utils.lru_cache.lru_cache``. The deprecated function will be removed in Django 1.9.
id: Django membekali sebuah backport dari penghias ini untuk versi Python lebih lama dan itu tersedia di ``django.utils.lru_cache.lru_cache``. Fungsi diusangkan akan dipindahkan di Django 1.9.
zh_hans: Django 在较旧的 Python 版本中附带了这个装饰器的后移版本，并且可以在 ``django.utils.lru_cache.lru_cache`` 中使用。弃用的函数将在 Django 1.9 中移除。

source: Geo Sitemaps
id: Peta situs Geo
zh_hans: 地理网站地图

source: Google has retired support for the Geo Sitemaps format. Hence Django support for Geo Sitemaps is deprecated and will be removed in Django 1.8.
id: Google telah berhenti mendukung untuk bentuk Geo Sitemap. Oleh karena itu Django mendukung untuk Geo Sitemap diusangkan dan akan dipindahkan di Django 1.8.
zh_hans: Google 已停止支持 Geo Sitemaps 格式。因此，Django 对 Geo Sitemaps 的支持已被弃用，并将在 Django 1.8 中移除。

source: Passing callable arguments to queryset methods
id: Melewatkan argumen dapat dipanggul pada metode queryset
zh_hans: 将可调用参数传递给查询集方法

source: Callable arguments for querysets were an undocumented feature that was unreliable. It's been deprecated and will be removed in Django 1.9.
id: Argumen dapat dipanggil untuk queryset adalah sebuah fitur yang tidak didokumentasikan yang telah tidak handal. Itu telah diusangkan dan akan dipindahkan di Django 1.9.
zh_hans: 查询集的可调用参数是一个未记录的功能，不可靠。已弃用，并将在 Django 1.9 中移除。

source: Callable arguments were evaluated when a queryset was constructed rather than when it was evaluated, thus this feature didn't offer any benefit compared to evaluating arguments before passing them to queryset and created confusion that the arguments may have been evaluated at query time.
id: Argumen dapat dipanggil telah dinilai ketika queryset telah dibangun daripada ketika itu telah dinilai, dengan demikian fitur ini tidak menawarkan keuntungan apapun dibandingkan pada menilai argumen sebelum melewatkan mereka ke queryset dan membuat kebingungan bahwa argumen mungkin telah dinilai pada waktu permintaan.
zh_hans: 可调用参数在构建查询集时被求值，而不是在查询集被评估时求值，因此与在传递参数之前对其进行求值相比，此功能并没有提供任何好处，并且会导致混淆，使人误以为参数可能在查询时被求值。

source: ``ADMIN_FOR`` setting
id: Pengaturan ``ADMIN_FOR``
zh_hans: ``ADMIN_FOR`` 设置

source: The ``ADMIN_FOR`` feature, part of the admindocs, has been removed. You can remove the setting from your configuration at your convenience.
id: Fitur ``ADMIN_FOR``, bagian dari admindoc, telah dipindahkan. Anda dapat memindahkan pengaturan untuk konfigurasi anda pada kenyamanan anda.
zh_hans: ``ADMIN_FOR`` 功能，是 admindocs 的一部分，已被移除。您可以根据需要从配置中移除此设置。

source: ``SplitDateTimeWidget`` with ``DateTimeField``
id: ``SplitDateTimeWidget`` dengan ``DateTimeField``
zh_hans: ``SplitDateTimeWidget`` 与 ``DateTimeField``

source: ``SplitDateTimeWidget`` support in :class:`~django.forms.DateTimeField` is deprecated, use ``SplitDateTimeWidget`` with :class:`~django.forms.SplitDateTimeField` instead.
id: Dukungan ``SplitDateTimeWidget`` di :class:`~django.forms.DateTimeField` diusangkan, gunakan ``SplitDateTimeWidget`` dengan :class:`~django.forms.SplitDateTimeField` sebagai gantinya.
zh_hans: ``SplitDateTimeWidget`` 在 :class:`~django.forms.DateTimeField` 上的支持已被弃用，请改用与 :class:`~django.forms.SplitDateTimeField` 一起使用的 ``SplitDateTimeWidget``。

source: The ``validate`` management command is deprecated in favor of the :djadmin:`check` command.
id: Perintah pengelolaan ``validate`` diusangkan dalam mendukung dari perintah :djadmin:`check`.
zh_hans: ``validate`` 管理命令已被弃用，推荐使用 :djadmin:`check` 命令。

source: ``requires_model_validation`` is deprecated in favor of a new ``requires_system_checks`` flag. If the latter flag is missing, then the value of the former flag is used. Defining both ``requires_system_checks`` and ``requires_model_validation`` results in an error.
id: ``requires_model_validation`` diusangkan dalam mendukung dari bendera ``requires_system_checks`` baru. Jika bendera terakhir hilang, kemudian nilai dari bendera awal digunakan. Menentukan kedua hasil ``requires_system_checks`` dan``requires_model_validation`` di kesalahan.
zh_hans: ``requires_model_validation`` 已被弃用，改为使用新的 ``requires_system_checks`` 标志。如果缺少后者标志，则将使用前者标志的值。定义同时 ``requires_system_checks`` 和 ``requires_model_validation`` 将导致错误。

source: The ``check()`` method has replaced the old ``validate()`` method.
id: Cara ``check()`` telah mengganti cara `validate()``.
zh_hans: ``check()`` 方法取代了旧的 ``validate()`` 方法。

source: ``ModelAdmin`` validators
id: Pengesah ``ModelAdmin``
zh_hans: ``ModelAdmin`` 验证器

source: The ``ModelAdmin.validator_class`` and ``default_validator_class`` attributes are deprecated in favor of the new ``checks_class`` attribute.
id: Atribut ``ModelAdmin.validator_class`` dan ``default_validator_class`` diusangkan dalam mendukung atribut ``checks_class`` baru.
zh_hans: ``ModelAdmin.validator_class`` 和 ``default_validator_class`` 属性已被弃用，推荐使用新的 ``checks_class`` 属性。

source: The ``ModelAdmin.validate()`` method is deprecated in favor of ``ModelAdmin.check()``.
id: Cara ``ModelAdmin.validate()`` diusangkan mendukung ``ModelAdmin.check()``.
zh_hans: ``ModelAdmin.validate()`` 方法已被弃用，推荐使用 ``ModelAdmin.check()``。

source: The ``django.contrib.admin.validation`` module is deprecated.
id: Modul ``django.contrib.admin.validation`` diusangkan.
zh_hans: ``django.contrib.admin.validation`` 模块已被弃用。

source: This method is deprecated in favor of a new ``check_field`` method. The functionality required by ``check_field()`` is the same as that provided by ``validate_field()``, but the output format is different. Third-party database backends needing this functionality should provide an implementation of ``check_field()``.
id: Metode ini diusangkan dalam mendukung dari cara ``check_field`` baru. Kegunaan dibutuhkan oleh ``check_field()`` adalah sama seperti yang disediakan oleh ``validate_field()``, tetapi bentuk keluaran adalah berbeda. Backend basisdata pihak-ketiga membutuhkan kegunaan ini harus menyediakan sebuah penerapan dari ``check_field()``.
zh_hans: 这个方法已被弃用，推荐使用新的 ``check_field`` 方法。``check_field()`` 所需的功能与 ``validate_field()`` 提供的相同，但输出格式不同。需要这种功能的第三方数据库后端应提供 ``check_field()`` 的实现。

source: Loading ``ssi`` and ``url`` template tags from ``future`` library
id: Memuat etiket cetakan ``ssi`` dan ``url`` dari pustaka ``future``
zh_hans: 从 ``future`` 库加载 ``ssi`` 和 ``url`` 模板标签

source: Django 1.3 introduced ``{% load ssi from future %}`` and ``{% load url from future %}`` syntax for forward compatibility of the ``ssi`` and :ttag:`url` template tags. This syntax is now deprecated and will be removed in Django 1.9. You can simply remove the ``{% load ... from future %}`` tags.
id: Django 1.3 memperkenalkan sintaksis ``{% load ssi from future %}`` and ``{% load url from future %}`` untuk kesesuaian kedepan dari etiket cetakan ``ssi`` dan :ttag:`url`. Sintaksis ini sekarang diusangkan dan akan dipindahkan di Django 1.9. Anda dapat dengan mudah memindahkan etiket ``{% load ... from future %}``.
zh_hans: Django 1.3 引入了 ``{% load ssi from future %}`` 和 ``{% load url from future %}`` 语法，用于前向兼容 ``ssi`` 和 :ttag:`url` 模板标签。这个语法现在已被弃用，并将在 Django 1.9 中移除。您可以简单地删除 ``{% load ... from future %}`` 标签。

source: ``javascript_quote()`` was an undocumented function present in ``django.utils.text``. It was used internally in the ``javascript_catalog()`` view whose implementation was changed to make use of ``json.dumps()`` instead. If you were relying on this function to provide safe output from untrusted strings, you should use ``django.utils.html.escapejs`` or the :tfilter:`escapejs` template filter. If all you need is to generate valid JavaScript strings, you can simply use ``json.dumps()``.
id: ``javascript_quote()`` adalah fungsi tidak didokumentasikan hadir di ``django.utils.text``. Itu digunakan secara internal di ``javascript_catalog()`` yang penerapannya telah berubah untuk memastikan penggunaan dari ``json.dumps()`` sebagai gantinya. Jika anda sedang bergantung pada fungsi ini untuk menyediakan keluaran aman dari deretan karakter tidak dipercaya, anda harus menggunakan penyaring cetakan ``django.utils.html.escapejs`` atau the :tfilter:`escapejs`. Jika semua anda butuhkan adalah untuk membangkitkan deretan karakter JavaScript sah, anda dapat dengan mudah menggunakan ``json.dumps()``.
zh_hans: ``javascript_quote()`` 是一个位于 ``django.utils.text`` 中的未记录函数。它在 ``javascript_catalog()`` 视图的内部使用，但该视图的实现已更改为使用 ``json.dumps()``。如果您依赖此函数来提供来自不受信任的字符串的安全输出，您应该使用 ``django.utils.html.escapejs`` 或 :tfilter:`escapejs` 模板过滤器。如果您只需要生成有效的 JavaScript 字符串，可以简单地使用 ``json.dumps()``。

source: ``fix_ampersands`` utils method and template filter
id: Metode kegunaan ``fix_ampersands`` dan penyaring cetakan
zh_hans: ``fix_ampersands`` 工具方法和模板过滤器

source: The ``django.utils.html.fix_ampersands`` method and the ``fix_ampersands`` template filter are deprecated, as the escaping of ampersands is already taken care of by Django's standard HTML escaping features. Combining this with ``fix_ampersands`` would either result in double escaping, or, if the output is assumed to be safe, a risk of introducing XSS vulnerabilities. Along with ``fix_ampersands``, ``django.utils.html.clean_html`` is deprecated, an undocumented function that calls ``fix_ampersands``. As this is an accelerated deprecation, ``fix_ampersands`` and ``clean_html`` will be removed in Django 1.8.
id: Metode ``django.utils.html.fix_ampersands`` dan penyaring cetakan ``fix_ampersands`` diusangkan, pelolosan dan sudah ditangani oleh fitur pelolosan HTML standar. Memadukan ini dengan ``fix_ampersands`` akan menghasilkan di pelolosan ganda, atau jika keluaran dianggap aman, sebuah resiko dari memperkenalkan kerentanan XSS. Bersama dengan ``fix_ampersands``, ``django.utils.html.clean_html`` diusangkan, sebuah fungsi tidak terdokumentasikan yang memanggil ``fix_ampersands``. Karena ini adalah pengusangan dipercepat, ``fix_ampersands`` dan ``clean_html`` akan dipindahkan di Django 1.8.
zh_hans: ``django.utils.html.fix_ampersands`` 方法和 ``fix_ampersands`` 模板过滤器已被弃用，因为 Django 的标准 HTML 转义功能已经处理了 ampersands 的转义。与 ``fix_ampersands`` 结合使用可能会导致重复转义，或者如果输出被视为安全，则存在引入 XSS 漏洞的风险。除了 ``fix_ampersands``，未记录的调用 ``fix_ampersands`` 的 ``django.utils.html.clean_html`` 也已被弃用。由于这是一项加速弃用，``fix_ampersands`` 和 ``clean_html`` 将在 Django 1.8 中移除。

source: Reorganization of database test settings
id: Reorganisasi dari pengaturan percobaan basisdata
zh_hans: 数据库测试设置的重新组织

source: All database settings with a ``TEST_`` prefix have been deprecated in favor of entries in a :setting:`TEST <DATABASE-TEST>` dictionary in the database settings. The old settings will be supported until Django 1.9. For backwards compatibility with older versions of Django, you can define both versions of the settings as long as they match.
id: Semua pengaturan basisdata dengan awalan ``TEST_`` telah diusangkan dalam mendukung masukan di kamus :setting:`TEST <DATABASE-TEST>` di pengaturan basisdata. Pengaturan lama akan didukung sampai Django 1.9. Untuk kesesuaian kebelakang dengan versi terlama dari Django, anda dapat menentukan kedua versi dari pengaturan selama mereka cocok.
zh_hans: 所有以 ``TEST_`` 前缀的数据库设置已被弃用，推荐使用数据库设置中的 :setting:`TEST <DATABASE-TEST>` 字典中的条目。旧设置将在 Django 1.9 之前受到支持。为了与较旧版本的 Django 向后兼容，您可以定义这两个版本的设置，只要它们匹配即可。

source: FastCGI support
id: Dukungan FastCGI
zh_hans: FastCGI 支持

source: FastCGI support via the ``runfcgi`` management command will be removed in Django 1.9. Please deploy your project using WSGI.
id: Dukungan FastCGI melalui perintah pengelolaan ``runfcgi`` akan dipindahkan di Django 1.9. Silahkan sebarkan proyek anda menggunakan WSGI.
zh_hans: 通过 ``runfcgi`` 管理命令提供的 FastCGI 支持将在 Django 1.9 中移除。请使用 WSGI 部署您的项目。

source: Moved objects in ``contrib.sites``
id: Memindahkan obyek di ``contrib.sites``
zh_hans: ``contrib.sites`` 中的对象已移动

source: Following the app-loading refactor, two objects in ``django.contrib.sites.models`` needed to be moved because they must be available without importing ``django.contrib.sites.models`` when ``django.contrib.sites`` isn't installed. Import ``RequestSite`` from ``django.contrib.sites.requests`` and ``get_current_site()`` from ``django.contrib.sites.shortcuts``. The old import locations will work until Django 1.9.
id: Refaktor memuat-aplikasi berikut, dua obyek di ``django.contrib.sites.models`` butuh dipindahkan karena mereka harus tersedia tanpa mengimpor ``django.contrib.sites.models`` ketika ``django.contrib.sites`` tidak terpasang. Impor ``RequestSite`` dari ``django.contrib.sites.requests`` dan ``get_current_site()`` dari ``django.contrib.sites.shortcuts``. Tempat impor lama akan bekerja sampai Django 1.9.
zh_hans: 在应用加载重构后，``django.contrib.sites.models`` 中的两个对象需要移动，因为它们在没有安装 ``django.contrib.sites`` 的情况下必须可用，而无需导入 ``django.contrib.sites.models``。从 ``django.contrib.sites.requests`` 导入 ``RequestSite``，从 ``django.contrib.sites.shortcuts`` 导入 ``get_current_site()``。旧的导入位置将在 Django 1.9 之前继续工作。

source: Django no longer uses this functional internally. Even though it's a private API, it'll go through the normal deprecation cycle.
id: Django tidak lagi menggunakan fungsi ini secara internal. Meskipun itu adalah API pribadi, itu akan pergi melalui siklus pengusangan biasa.
zh_hans: Django 不再在内部使用此功能。尽管它是一个私有 API，但它将按照正常的弃用周期进行处理。

source: Private Query Lookup APIs
id: API Pencarian Permintaan Pribadi
zh_hans: 私有查询查找 API
