Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Validates whether the password meets a minimum length. The minimum length can be customized with the ``min_length`` parameter.
id: Mengesahkan apakah sandi memenuhi panjang minimal. Panjang minimal dapat disesuaikan dengan parameter ``min_length``.

source: Validates whether the password is sufficiently different from certain attributes of the user.
id: Mengesahkan apakah sandi cukup berbeda dari atribut tertentu dari pengguna.

source: The ``user_attributes`` parameter should be an iterable of names of user attributes to compare to. If this argument is not provided, the default is used: ``'username', 'first_name', 'last_name', 'email'``. Attributes that don't exist are ignored.
id: Parameter ``user_attributes`` harus berupa sebuah perulangan dari nama-namad dari atribut pengguna untuk dibandingkan. Jika argumen ini tidak disediakan, awalan adalah digunakan: ``'username', 'first_name', 'last_name', 'email'``. Atribut-atribut yang tidak ada adalah diabaikan.

source: The minimum similarity of a rejected password can be set on a scale of 0 to 1 with the ``max_similarity`` parameter. A setting of 0 rejects all passwords, whereas a setting of 1 rejects only passwords that are identical to an attribute's value.
id: Kemiripan minimal dari sandi tertolak dapat disetel pada skala 0 sampai 1 dengan parameter ``max_similarity``. Pengaturan 0 menolak semua sandi, dimana pengaturan dari 1 hanya menolak sandi yang mirip pada sebuah nilai atribut.

source: The ``password_list_path`` can be set to the path of a custom file of common passwords. This file should contain one lowercase password per line and may be plain text or gzipped.
id: ``password_list_path`` dapat disetel ke jalur dari berkas penyesuaian dari sandi umum. Berkas ini harus mengandung sandi satu huruf kecil per baris dan mungkin berupa teks polos atau gzipped.

source: Validates whether the password is not entirely numeric.
id: Mengesahkan apakah sandi tidak sepenuhnya numerik.

source: Integrating validation
id: Memadukan pengesahan

source: There are a few functions in ``django.contrib.auth.password_validation`` that you can call from your own forms or other code to integrate password validation. This can be useful if you use custom forms for password setting, or if you have API calls that allow passwords to be set, for example.
id: Ada sedikit fungsi di ``django.contrib.auth.password_validation`` yang anda dapat memanggil dari formulir anda sendiri atau kode lain untuk memadukan pengesahan sandi. Ini dapat berguna jika anda menggunakan penyesuaian formulir untuk pengaturan sandi, atau jika anda mempunyai panggilan API yang mengizinkan sandi disetel, sebagai contoh.

source: Validates a password. If all validators find the password valid, returns ``None``. If one or more validators reject the password, raises a :exc:`~django.core.exceptions.ValidationError` with all the error messages from the validators.
id: Mengesahkan sebuah sandi. Jika semua pengesah menemukan sandi sah, mengembalikan ``None``. Jika satu atau lebih pengesah menolak sandi, memunculkan sebuah :exc:`~django.core.exceptions.ValidationError` dengan semua pesan-pesan kesalahan dari pengesah.

source: The ``user`` object is optional: if it's not provided, some validators may not be able to perform any validation and will accept any password.
id: Obyek ``user`` adalah pilihan: jika itu tidak disediakan, beberapa pengesah mungkin tidak dapat melakukan pengesahan apapun dan akan menerima sandi apapun.

source: Informs all validators that the password has been changed. This can be used by validators such as one that prevents password reuse. This should be called once the password has been successfully changed.
id: Menginformasikan semua pengesah yang sandi telah berubah. Ini dapat digunakan oleh pengesah seperti satu yang mencegah penggunaan kembali sandi. Ini harus dipanggil sekali sandi telah berhasil dirubah.

source: For subclasses of :class:`~django.contrib.auth.models.AbstractBaseUser`, the password field will be marked as "dirty" when calling :meth:`~django.contrib.auth.models.AbstractBaseUser.set_password` which triggers a call to ``password_changed()`` after the user is saved.
id: Untuk subkelas-subkelas dari :class:`~django.contrib.auth.models.AbstractBaseUser`, bidang sandi akan ditandai sebagai "dirty" ketika memanggil :meth:`~django.contrib.auth.models.AbstractBaseUser.set_password` yang memicu semua pada ``password_changed()`` setelah pengguna disimpan.

source: Returns a list of the help texts of all validators. These explain the password requirements to the user.
id: Mengembalikan daftar dari teks bantuan dari semua pengesah. Ini menjelaskan persyaratan sandi ke pengguna.

source: Returns an HTML string with all help texts in an ``<ul>``. This is helpful when adding password validation to forms, as you can pass the output directly to the ``help_text`` parameter of a form field.
id: Mengembalikan sebuah string HTML dengan semua bantuan teks di sebuah ``<ul>``. Ini sangat membantu ketika menambahkan pengesahan pada formulir, ketika anda dapat melewatkan keluaran secara langsung ke parameter ``help_text`` dari bidang formulir.

source: Returns a set of validator objects based on the ``validator_config`` parameter. By default, all functions use the validators defined in :setting:`AUTH_PASSWORD_VALIDATORS`, but by calling this function with an alternate set of validators and then passing the result into the ``password_validators`` parameter of the other functions, your custom set of validators will be used instead. This is useful when you have a typical set of validators to use for most scenarios, but also have a special situation that requires a custom set. If you always use the same set of validators, there is no need to use this function, as the configuration from :setting:`AUTH_PASSWORD_VALIDATORS` is used by default.
id: Mengembalikan sekelompok obyek pengesah berdasarkan pada parameter ``validator_config``. Secara awalan, semua fungsi menggunakan pengesah ditentukan di :setting:`AUTH_PASSWORD_VALIDATORS`, tetapi dengan memanggil fungsi ini dengan alternatif kumpulan dari pengesah dan kemudian melewatkan hasil kedalam parameter ``password_validators`` dari fungsi lain, kumpulan penyesuaian anda dari pengesah akan digunakan sebagai gantinya. Ini sangat berguna ketika anda mempunyai kumpulan khusus dari pengesah untuk menggunakan kebanyakan skenario, tetapi juga mempunyai keadaan khusus yang membutuhkan penyesuaian kumpulan. Jika anda selalu menggunakan kumpulan sama dari pengesah, tidak perlu menggunakan fungsi ini, ketika konfigurasi dari :setting:`AUTH_PASSWORD_VALIDATORS` digunakan secara awalan.

source: The structure of ``validator_config`` is identical to the structure of :setting:`AUTH_PASSWORD_VALIDATORS`. The return value of this function can be passed into the ``password_validators`` parameter of the functions listed above.
id: Struktur dari ``validator_config``mirip pada struktur dari :setting:`AUTH_PASSWORD_VALIDATORS`. Nilai kembalian dari fungsi ini dapat dilewatkan kedalam parameter ``password_validators`` dari fungsi-fungsi terdaftar diatas.

source: Note that where the password is passed to one of these functions, this should always be the clear text password - not a hashed password.
id: Catat bahwa dimana sandi dilewatkan ke satu dari fungsi-fungsi ini, ini harus selalu sandi teks jelas - bukan sebuah sandi dicampur.

source: Writing your own validator
id: Menulis pengesah anda sendiri

source: If Django's built-in validators are not sufficient, you can write your own password validators. Validators are fairly simple classes. They must implement two methods:
id: Jika pengesah siap-pakai Django tidak cukup, anda dapat menulis pengesah sandi anda sendiri. Pengesah adalah kelas-kelas cukup sederhana. Mereka harus menerapkan dua metode:

source: ``validate(self, password, user=None)``: validate a password. Return ``None`` if the password is valid, or raise a :exc:`~django.core.exceptions.ValidationError` with an error message if the password is not valid. You must be able to deal with ``user`` being ``None`` - if that means your validator can't run, simply return ``None`` for no error.
id: ``validate(self, password, user=None)``: sahkan sebuah sandi. Kembalikan ``None`` jika sandi adalah sah, arau munculkan sebuah :exc:`~django.core.exceptions.ValidationError` dengan pesan kesalahan jika sandi tidak sah. Anda harus dapat berhubungan dengan ``user`` menjadi ``None`` - jika itu berarti pengesah anda tidak dapat berjalan, cukup kembalikan ``None`` untuk tidak ada kesalahan.

source: ``get_help_text()``: provide a help text to explain the requirements to the user.
id: ``get_help_text()``: menyediakan teks bantuan untuk menjelaskan persyaratan ke pengguna.

source: Any items in the ``OPTIONS`` in :setting:`AUTH_PASSWORD_VALIDATORS` for your validator will be passed to the constructor. All constructor arguments should have a default value.
id: Barang apapun di ``OPTIONS`` di :setting:`AUTH_PASSWORD_VALIDATORS` untuk pengesah anda akan dilewatkan ke pembangun. Semua argumen pembangun harus memiliki nilai awalan.

source: Here's a basic example of a validator, with one optional setting::
id: Ini adalah contoh dasar dari pengecekan, dengan satu pilihan pengaturan::

source: You can also implement ``password_changed(password, user=None``), which will be called after a successful password change. That can be used to prevent password reuse, for example. However, if you decide to store a user's previous passwords, you should never do so in clear text.
id: Anda dapat juga menerapkan ``password_changed(password, user=None``), yang akan dipanggil setelah perubahan sandi berhasil. Itu dapat digunakan untuk mencegah penggunaan kembali sandi, sebagai contoh. Bagaimanapun, jika anda memutuskan menyimpan sandi pengguna sebelumnya, anda harus tidak pernah melakukannya di pembersihan teks.

source: Django's cache framework
id: Kerangka kerja penyimpanan Django

source: A fundamental trade-off in dynamic websites is, well, they're dynamic. Each time a user requests a page, the Web server makes all sorts of calculations -- from database queries to template rendering to business logic -- to create the page that your site's visitor sees. This is a lot more expensive, from a processing-overhead perspective, than your standard read-a-file-off-the-filesystem server arrangement.
id: Perjualan mendasar di situs jaringan dinamis adalah, baik, mereka adalah dinamis. Setiap kali seorang pengguna meminta sebuah halaman, peladen Jaringan membuat semua urutan perhitungan -- dari permintaan basisdata ke membangun cetakan ke logika bisnis -- untuk membuat halaman yang pengunjung situs anda lihat. Ini adalah sedikit mahal, dari pandangan pengolahan-atas, daripada pengaturan peladen baca-berkas-sitem-berkas standar anda.

source: For most Web applications, this overhead isn't a big deal. Most Web applications aren't ``washingtonpost.com`` or ``slashdot.org``; they're simply small- to medium-sized sites with so-so traffic. But for medium- to high-traffic sites, it's essential to cut as much overhead as possible.
id: Untuk kebanyakan aplikasi Jaringan, tambahan ini bukanlah hal yang besar. Kebanyakan aplikasi Jaringan bukan ``washingtonpost.com`` atau ``slashdot.org``; mereka hanya situs kecil- ke ukuran-menengah dengan lalu lintas biasa saja. Tetapi untuk situs-situs lalu lintas menengah- ke tinggi, itu adalah mendasar memotong pengeluaran sebanyak mungkin.

source: That's where caching comes in.
id: Itu adalah dimana cache datang.

source: To cache something is to save the result of an expensive calculation so that you don't have to perform the calculation next time. Here's some pseudocode explaining how this would work for a dynamically generated Web page::
id: Untuk cache sesuatu adalah menyimpan hasil dari perhitungan mahal sehingga anda tidak harus melakukan perhitungan lain kali. Ini adalah beberapa kode semu menjelaskan bagaimana ini akan bekerja untuk secara dinamis membangkitkan halaman Jaringan:

source: Django comes with a robust cache system that lets you save dynamic pages so they don't have to be calculated for each request. For convenience, Django offers different levels of cache granularity: You can cache the output of specific views, you can cache only the pieces that are difficult to produce, or you can cache your entire site.
id: Django datang dengan sistem cache kuat yang membiarkan anda mentimpan halaman-halaman dinamis sehingga mereka tidak harus dihitung untuk setiap permintaan. Untuk kenyamanan, Django menawarkan tingkatan berbeda dari butiran cache: Anda dapat cache keluaran dari tampilan khusus, anda dapat cache hanya potongan-potongan yang sulit dihasilkan, atau anda dapat cache kelesuruhan situs anda.

source: Django also works well with "downstream" caches, such as `Squid <http://www.squid-cache.org>`_ and browser-based caches. These are the types of caches that you don't directly control but to which you can provide hints (via HTTP headers) about which parts of your site should be cached, and how.
id: Django juga bekerja dengan cache "downstream", seperti `Squid <http://www.squid-cache.org>`_ dan cache berdasarkan-peramban. Ini adalah jenis-jenis dari cache yang anda tidak secara langsung kendalikan tetapi yang anda dapat sediakan petunjuk-petunjuk (melalui kepala HTTP) tentang bagian-bagian mana dari situs anda harus di cache, dan bagaimana.

source: The :ref:`Cache Framework design philosophy <cache-design-philosophy>` explains a few of the design decisions of the framework.
id: :ref:`Cache Framework design philosophy <cache-design-philosophy>` menjelaskan sedikit dari keputusan rancangan dari kerangka kerja.

source: Setting up the cache
id: Mengatur tembolok

source: The cache system requires a small amount of setup. Namely, you have to tell it where your cached data should live -- whether in a database, on the filesystem or directly in memory. This is an important decision that affects your cache's performance; yes, some cache types are faster than others.
id: Sistem cache membutuhkan sejumlah kecil pengaturan. Yaitu, anda harus memberitahu itu dimana data cache anda harus tinggal -- apakah di basisdata, pada sistem berkas atau langsung di memori. Ini adalah keputusan penting yang mempengaruhi penampilan cache anda; ya beberapa jenis cache adalah lebih cepat dari lainnya.

source: Your cache preference goes in the :setting:`CACHES` setting in your settings file. Here's an explanation of all available values for :setting:`CACHES`.
id: Pilihan cache anda masuk di pengaturan :setting:`CACHES` di berkas pengaturan anda. Ini adalah sebuah penjelasan dari semua nilai-nilai tersedia untuk :setting:`CACHES`.

source: Memcached
id: Memcache

source: The fastest, most efficient type of cache supported natively by Django, Memcached__ is an entirely memory-based cache server, originally developed to handle high loads at LiveJournal.com and subsequently open-sourced by Danga Interactive. It is used by sites such as Facebook and Wikipedia to reduce database access and dramatically increase site performance.
id: Tercepat, jenis paling efesien dari cache didukung alamiah oleh Django, Memcached__ adalah seluruhnya peladen cache berdasarkan-memori, aslinya dikembangkan untuk menangani pemuatan tinggi pada LiveJournal.com dan kemudian di sumber-terbukan oleh Danga Interactive. Itu digunakan oleh situs-situs seperti Facebook dan Wikipedia untuk mengurangi akses basisdata dan secara dramatis meningkatkan penampilan situs.

source: Memcached runs as a daemon and is allotted a specified amount of RAM. All it does is provide a fast interface for adding, retrieving and deleting data in the cache. All data is stored directly in memory, so there's no overhead of database or filesystem usage.
id: Memcached berjalan sebagai daemon dan memberikan sejumlah tertentu dari RAM. Semua itu lakukan adalah menyediakan antarmuka cepat untuk menambah, mengambil dan menghapus data di cache. Semua data disimpan secara langsung di memori, sehingga tidak ada kelebihan dari basisdata atau penggunaan sistem berkas.

source: After installing Memcached itself, you'll need to install a Memcached binding. There are several Python Memcached bindings available; the two most common are `python-memcached`_ and `pylibmc`_.
id: Setelah memasang Memcached itu sendiri, anda akan butuh memasang ikatan Memcached. Ada beberapa ikatan Memcached Python tersedia; dua paling umum adalah `python-memcached`_ dan `pylibmc`_.

source: To use Memcached with Django:
id: Untuk menggunakan Memcache dengan Django:

source: Set :setting:`BACKEND <CACHES-BACKEND>` to ``django.core.cache.backends.memcached.MemcachedCache`` or ``django.core.cache.backends.memcached.PyLibMCCache`` (depending on your chosen memcached binding)
id: Setel :setting:`BACKEND <CACHES-BACKEND>` menjadi ``django.core.cache.backends.memcached.MemcachedCache`` atau ``django.core.cache.backends.memcached.PyLibMCCache`` (tergantung pada pengikatan memcache anda pilih)

source: Set :setting:`LOCATION <CACHES-LOCATION>` to ``ip:port`` values, where ``ip`` is the IP address of the Memcached daemon and ``port`` is the port on which Memcached is running, or to a ``unix:path`` value, where ``path`` is the path to a Memcached Unix socket file.
id: Setel :setting:`LOCATION <CACHES-LOCATION>` menjadi nilai-nilai ``ip:port``, dimana ``ip`` adalah alamat IP dari daemon memcache dan ``port`` adalah pangkalan pada Memcache mana yang berjalan, atau menjadi nilai ``unix:path``, dimana ``path`` adalah jalur ke berkas soket Unix Memcache.

source: In this example, Memcached is running on localhost (127.0.0.1) port 11211, using the ``python-memcached`` binding::
id: Dalam contoh ini, Memcache berjalan pada localhost (127.0.0.1) pangkalan 11211, menggunakan pengikatan ``python-memcached``::

source: In this example, Memcached is available through a local Unix socket file :file:`/tmp/memcached.sock` using the ``python-memcached`` binding::
id: Dalam contoh ini, Memcache tersedia melalui berkas soket Unix lokal :file:`/tmp/memcached.sock` menggunakan pengikatan ``python-memcached``::

source: When using the ``pylibmc`` binding, do not include the ``unix:/`` prefix::
id: Ketika menggunakan mengikat ``pylibmc``, jangan menyertakan awalan `unix:/`` ::

source: One excellent feature of Memcached is its ability to share a cache over multiple servers. This means you can run Memcached daemons on multiple machines, and the program will treat the group of machines as a *single* cache, without the need to duplicate cache values on each machine. To take advantage of this feature, include all server addresses in :setting:`LOCATION <CACHES-LOCATION>`, either as a semicolon or comma delimited string, or as a list.
id: Satu fitur yg hebar dari Memcache adalah kemampuannya berbagi sebuah cache terhadap banyak peladen. Ini berarti anda dapat menjalankan daemon Memcache pada banyak mesin, dan program akan memperlakukan kelompok mesin sebagai cache *tunggal*, tanpa butuh menggandakan nilai-nilai cache pada setiap mesin. Untuk mengambil keuntungan fitur ini, sertakan semua alamat peladen dalam :setting:`LOCATION 1`,antara sebagai titik koma atau string dipisahkan koma, atau sebagai sebuah daftar.

source: In this example, the cache is shared over Memcached instances running on IP address 172.19.26.240 and 172.19.26.242, both on port 11211::
id: Di contoh ini, penyimpanan dibagi terhadao instance Memcache berjalan pada alamat IP 172.19.26.240 dan 172.19.26.242, keduanya di port 11211::

source: In the following example, the cache is shared over Memcached instances running on the IP addresses 172.19.26.240 (port 11211), 172.19.26.242 (port 11212), and 172.19.26.244 (port 11213)::
id: Di contoh berikut, cache dibagi terhadap instance Memcache berjalan pada alamat IP 172.19.26.240 (port 11211), 172.19.26.242 (port 11212), dan 172.19.26.244 (port 11213)::

source: A final point about Memcached is that memory-based caching has a disadvantage: because the cached data is stored in memory, the data will be lost if your server crashes. Clearly, memory isn't intended for permanent data storage, so don't rely on memory-based caching as your only data storage. Without a doubt, *none* of the Django caching backends should be used for permanent storage -- they're all intended to be solutions for caching, not storage -- but we point this out here because memory-based caching is particularly temporary.
id: Sebuah titik akhir tentang Memcached adalah cache berdasarkan-memori mempunyai kerugian: karena data cache disimpan di memori, data akan hilang jika peladen anda gagal. Jelasnya, memori tidak diperuntukkan untuk penyimpanan data tetap, jadi jangan bergantung oada cache berdasarkan-memori sebagai penyimpanan data anda satu-satunya -- mereka adalah diperuntukkan pemecahan untuk cache, bukan penyimpanan -- tetapi kami menitikkan ini disini karena cache berdasarkan-memori adalah khususnya sementara.

source: Database caching
id: Menembolok basisdata

source: Django can store its cached data in your database. This works best if you've got a fast, well-indexed database server.
id: Django dapat menyimpan data temboloknya dalam basisdata anda. Ini bekerja baik jika anda mendapatkan cepat, peladen basisdata diindeks baik.

source: To use a database table as your cache backend:
id: Untuk menggunakan tabel basisdata sebagai backend tembolok anda:

source: Set :setting:`BACKEND <CACHES-BACKEND>` to ``django.core.cache.backends.db.DatabaseCache``
id: Setel :setting:`BACKEND <CACHES-BACKEND>` menjadi ``django.core.cache.backends.db.DatabaseCache``

source: Set :setting:`LOCATION <CACHES-LOCATION>` to ``tablename``, the name of the database table. This name can be whatever you want, as long as it's a valid table name that's not already being used in your database.
id: Setel :setting:`LOCATION <CACHES-LOCATION>` menjadi ``tablename``, nama dari tabel basisdata. Nama ini dapat menjadi apapun anda inginkan, selama dia adalah nama tabel yang sah yang tidak sedang digunakan dalam basisdata anda.

source: In this example, the cache table's name is ``my_cache_table``::
id: Dalam contoh ini, nama tabel tembolok adalah ``my_cache_table``::

source: Creating the cache table
id: Membuat tabel tembolok

source: Before using the database cache, you must create the cache table with this command::
id: Sebelum menggunakan basisdata tembolok, anda harus membuat tabel tembolok dengan perintah ini::

source: This creates a table in your database that is in the proper format that Django's database-cache system expects. The name of the table is taken from :setting:`LOCATION <CACHES-LOCATION>`.
id: Ini membuat tabel di basisdata anda yaitu dalam bentuk sesuai yang sistem tembolok-basidata harapkan. Nama dari tabel diambil dari :setting:`LOCATION <CACHES-LOCATION>`.

source: If you are using multiple database caches, :djadmin:`createcachetable` creates one table for each cache.
id: Jika anda menggunakan banyak basisdata tembolok, :djadmin:`createcachetable` membuat satu tabel untuk setiap tembolok.

source: If you are using multiple databases, :djadmin:`createcachetable` observes the ``allow_migrate()`` method of your database routers (see below).
id: Jika anda menggunakan banyak basisdata, :djadmin:`createcachetable` mengamati cara ``allow_migrate()`` dari perute basisdata anda (lihat dibawah).

source: Like :djadmin:`migrate`, :djadmin:`createcachetable` won't touch an existing table. It will only create missing tables.
id: Seperti :djadmin:`migrate`, :djadmin:`createcachetable` tidak akan menyentuh tabel yang ada. Dia tidak akan membuat tabel-tabel hilang.
