Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: This document will get you up and running with Django.
id: Dokumen ini akan membangunkan anda dan berjalan dengan Django.

source: Install Python
id: Pasang Phyton

source: Get the latest version of Python at https://www.python.org/downloads/ or with your operating system's package manager.
id: Dapatkan versi terakhir dari Python pada https://www.python.org/downloads/ atau dengan pengelola paket sistem operasi anda.

source: Django on Jython
id: Django di Jython

source: Python on Windows
id: Phyton di Windows

source: If you are just starting with Django and using Windows, you may find :doc:`/howto/windows` useful.
id: Jika anda hanya memulai dengan Django dan menggunakan Windows, anda mungkin menemukan :doc:`/howto/windows` berguna.

source: Install Apache and ``mod_wsgi``
id: Pasang Apache dan ``mod_wsgi``

source: If you just want to experiment with Django, skip ahead to the next section; Django includes a lightweight web server you can use for testing, so you won't need to set up Apache until you're ready to deploy Django in production.
id: Jika anda hanya ingin melakukan percobaan dengan Django, lewati bagian selanjutnya; Django menyertakan peladen jaringan ringan anda dapat gunakan untuk percobaan, jadi anda tidak butuh menyetel Apache sampai anda siap menyebarkan Django dalam produksi.

source: See :doc:`How to use Django with mod_wsgi </howto/deployment/wsgi/modwsgi>` for information on how to configure mod_wsgi once you have it installed.
id: Lihat :doc:`How to use Django with mod_wsgi 1` untuk informasi bagaimana mengkonfigurasi mode_wsgi sekali anda telah memasang itu.

source: If you can't use mod_wsgi for some reason, fear not: Django supports many other deployment options. One is :doc:`uWSGI </howto/deployment/wsgi/uwsgi>`; it works very well with `nginx`_. Additionally, Django follows the WSGI spec (:pep:`3333`), which allows it to run on a variety of server platforms.
id: Jika anda tidak dapat menggunakan mod_wsgi untuk beberapa alasan, jangan takut: Django mendukung banyak pilihan penyebaran lain. Satu adalah :doc:`uWSGI </howto/deployment/wsgi/uwsgi>`; itu bekerja sangat baik dengan `nginx`_. Selain itu, Django mengikuti spesifikasi WSGI (:pep:`3333`), yang mengizinkannya untuk berjalan pada seragam serambi peladen.

source: Get your database running
id: Dapatkan basisdata anda berjalan

source: If you plan to use Django's database API functionality, you'll need to make sure a database server is running. Django supports many different database servers and is officially supported with PostgreSQL_, MySQL_, Oracle_ and SQLite_.
id: Jika anda berencana menggunakan kegunaan API basisdata Django, anda akan butuh memastikan peladen basisdata sedang berjalan. Django mendukung banyak peladen berbeda dan secara resmi didukung dengan PostgreSQL_, MySQL_, Oracle_ dan SQLite_.

source: In addition to the officially supported databases, there are :ref:`backends provided by 3rd parties <third-party-notes>` that allow you to use other databases with Django.
id: Sebagai tambahan ke basisdata didukung resmi, ada :ref:`backends provided by 3rd parties 1`yang mengizinkan anda menggunakan basisdata lain dengan Django.

source: In addition to a database backend, you'll need to make sure your Python database bindings are installed.
id: Sebagai tambahan ke backend basisdata, anda akan butuh memastikan pengikatan basisdata Python anda terpasang.

source: If you're using PostgreSQL, you'll need the `psycopg2`_ package. Refer to the :ref:`PostgreSQL notes <postgresql-notes>` for further details.
id: Jika anda sedang menggunakan PostgreSQL,anda akan butuh paket `psycopg2`_. Mengacu pada :ref:`PostgreSQL notes 1`untuk rincian lebih lanjut.

source: If you're using MySQL, you'll need a :ref:`DB API driver <mysql-db-api-drivers>` like ``mysqlclient``. See :ref:`notes for the MySQL backend <mysql-notes>` for details.
id: Jika anda sedang menggunakan MySQL, anda akan butuh :ref:`DB API driver 1` seperti ``mysqlclient``. Lihat :ref:`notes for the MySQL backend 2`untuk rincian.

source: If you're using SQLite you might want to read the :ref:`SQLite backend notes <sqlite-notes>`.
id: Jika anda sedang menggunakan SQLite anda mungkin ingin membaca :ref:`SQLite backend notes 1`.

source: If you're using Oracle, you'll need a copy of cx_Oracle_, but please read the :ref:`notes for the Oracle backend <oracle-notes>` for details regarding supported versions of both Oracle and ``cx_Oracle``.
id: Jika anda sedang menggunakan Oracle, anda akan butuh salinan dari cx_Oracle_,tetapi harap membaca :ref:`notes for the Oracle backend 1` untuk rincian mengenai versi didukung dari kedua Oracle dan ``cx_Oracle``.

source: If you're using an unofficial 3rd party backend, please consult the documentation provided for any additional requirements.
id: Jika anda sedang menggunakan backend pihak ke3 tidak resmi, harap konsultasikan dokumentasi disediakan untuk persyaratan tambahan apapun.

source: If you're using Django's :doc:`testing framework</topics/testing/index>` to test database queries, Django will need permission to create a test database.
id: Jika anda sedang menggunakan :doc:`testing framework1`Django untuk mencoba permintaan basisdata, Django akan butuh perizinan untuk membuat basisdata percobaan.

source: Install the Django code
id: Pasang kode Django

source: It's easy, no matter which way you choose.
id: Itu mudah, tidak peduli jalan mana anda pilih.

source: Installing an official release with ``pip``
id: Memasang terbitan resmi dengan ``pip``

source: This is the recommended way to install Django.
id: Ini adalah cara yang dianjurkan untuk memasang Django.

source: Install pip_. The easiest is to use the `standalone pip installer`_. If your distribution already has ``pip`` installed, you might need to update it if it's outdated. If it's outdated, you'll know because installation won't work.
id: Pasang pip_. Paling mudah adalah menggunakan `standalone pip installer`_. Jika penyaluran anda sudah mempunyai ``pip`` terpasang, anda mungkin butuh memperbaharui jika itu sudah usang. Jika itu sudah usang, anda akan tahu karena pemasangan tidak akan bekerja.

source: After you've created and activated a virtual environment, enter the command ``pip install Django`` at the shell prompt.
id: Setelah anda membuat dan mengaktifkan lingkungan maya, masukkan perintah ``pip install Django`` pada shell prompt.

source: Installing a distribution-specific package
id: Memasang paket penyebaran-tertentu

source: Check the :doc:`distribution specific notes </misc/distributions>` to see if your platform/distribution provides official Django packages/installers. Distribution-provided packages will typically allow for automatic installation of dependencies and easy upgrade paths; however, these packages will rarely contain the latest release of Django.
id: Periksa :doc:`distribution specific notes </misc/distributions>` untuk melihat jika serambi/penyaluran menyediakan paket/pemasang Django resmi. Paket disediakan-penyaluran akan secara khusus mengizinkan pemasangan otomatis dari ketergantungan dan jalur peningkatan yang mudah; bagaimanapun, paket-paket ini akan jarang mengandung terbitan terakhir dari Django.

source: Installing the development version
id: Memasang versi pengembangan

source: Tracking Django development
id: Melacak pengembangan Django

source: Make sure that you have Git_ installed and that you can run its commands from a shell. (Enter ``git help`` at a shell prompt to test this.)
id: Pastikan anda mempunyai Git_ terpasang dan anda dapat menjalankan perintah nya dari shell. (masukkan ``git help`` pada shell prompt untuk mencoba ini.)

source: Check out Django's main development branch like so:
id: Periksa cabang pengembangan Django seperti itu:

source: This will create a directory ``django`` in your current directory.
id: Ini akan membuat sebuah direktori ``django`` dalam direktori anda saat ini.

source: Logging
id: Pencatatan

source: Loggers
id: Pencatat

source: ``DEBUG``: Low level system information for debugging purposes
id: ``DEBUG``: Sistm informasi tingkat rendah untuk tujuan mencari kesalahan

source: ``INFO``: General system information
id: ``INFO``: Informasi Sistem Umum

source: ``WARNING``: Information describing a minor problem that has occurred.
id: ``PERINGATAN``: Informasi menggambarkan masalah kecil yang telah muncul.

source: ``ERROR``: Information describing a major problem that has occurred.
id: ``KESALAHAN``: Informasi menggambarkan masalah yang telah muncul.

source: ``CRITICAL``: Information describing a critical problem that has occurred.
id: ``KRITIS``: Informasi menggambarkan masalah kritis yang muncul.

source: Handlers
id: Penangan

source: Filters
id: Filter

source: A filter is used to provide additional control over which log records are passed from logger to handler.
id: Sebuah penyaring digunakan untuk menyediakan tambahan pengendali terhadap rekaman catatan dilewatkan dari pencatat ke penangan.

source: Formatters
id: Pembentuk

source: Using logging
id: Menggunakan pencatatan

source: Naming loggers
id: Menamai pencatat

source: There are two other logging calls available:
id: Ada dua catatan panggilan lain tersedia:

source: Configuring logging
id: Mengkonfigurasi catatan

source: Second, here's an example of how to make the logging system print Django's logging to the console. It may be useful during local development.
id: Kedua, ini adalah sebuah contoh dari bagaimana membuat sistem pencatatan mencetak penactatan Django ke konsol. Itu mungkin berguna selama pengembangan lokal.

source: Finally, here's an example of a fairly complex logging setup::
id: Akhirnya, ini adalah sebuah contoh dari penyetelan pencatatan cukup rumit::

source: This logging configuration does the following things:
id: Konfigurasi pencatatan ini melakukan hal-hal berikut::

source: Defines two formatters:
id: Menentukan dua pembentuk:

source: ``simple``, that just outputs the log level name (e.g., ``DEBUG``) and the log message.
id: ``simple``, itu hanya mengeluarkan catatan nama tingkat (sebagai contoh ``DEBUG``) dan catatan pesan.

source: Defines two filters:
id: Menentukan dua penyaring:

source: ``django.utils.log.RequireDebugTrue``, which passes on records when :setting:`DEBUG` is ``True``.
id: ``django.utils.log.RequireDebugTrue``, yang melewatkan pada rekaman-rekaman ketika :setting:`DEBUG` adalah ``True``.

source: Defines two handlers:
id: Menentukan dua penangan:

source: ``console``, a :class:`~logging.StreamHandler`, which prints any ``INFO`` (or higher) message to ``sys.stderr``. This handler uses the ``simple`` output format.
id: ``console``, sebuah :class:`~logging.StreamHandler`, yang mencetak pesan ``INFO`` apapun (atau lebih tinggi) ke ``sys.stderr``.Penangan ini menggunakan bentuk keluaran ``simple``.

source: ``mail_admins``, an :class:`AdminEmailHandler`, which emails any ``ERROR`` (or higher) message to the site :setting:`ADMINS`. This handler uses the ``special`` filter.
id: ``mail_admins``, sebuah :class:`AdminEmailHandler`, yang mensurelkan pesan ``ERROR`` apapun (atau lebih tinggi) ke situs :setting:`ADMINS`. Penangan ini menggunakan penyaring ``special``.

source: Configures three loggers:
id: Mengkonfigurasi tiga pencatat:

source: ``django``, which passes all messages to the ``console`` handler.
id: ``django``, yang melewatkan semua pesan-pesan ke penangan ``console``.

source: Custom logging configuration
id: Konfigurasi pencatatan penyesuaian

source: If you don't want to use Python's dictConfig format to configure your logger, you can specify your own configuration scheme.
id: Jika anda tidak ingin menggunakan bentuk dictConfigPython untuk mengkonfigurasi pencatat anda, anda dapat menentukan skema konfigurasi anda sendiri.

source: Disabling logging configuration
id: Meniadakan konfigurasi pencatatan

source: Django's logging extensions
id: Tambahan pencatatan Django

source: Django provides a number of utilities to handle the unique requirements of logging in Web server environment.
id: Django menyediakan sejumlah perlengkapan untuk menangani persyaratan unik dari pencatatan dalam lingkungan peladen Jaringan.

source: Django provides several built-in loggers.
id: Django menyediakan beberapa pencatat siap-pakai.

source: Messages to this logger have the following extra context:
id: Pesan-pesan ke pencatat ini mempunyai konteks tambahan berikut:

source: ``status_code``: The HTTP response code associated with the request.
id: ``status_code``: Kode tanggapan HTTP terkait dengan permintaan.

source: ``request``: The request object that generated the logging message.
id: ``request``: Obyek permintaan yang membangkitkan pesan pencatatan.

source: Log messages related to the rendering of templates.
id: Pesan-pesan catatan terkait pada membangun cetakan.

source: ``sql``: The SQL statement that was executed.
id: ``sql``: Pernyataan SQL yang telah dijalankan.

source: ``params``: The parameters that were used in the SQL call.
id: ``params``: Parameter yang telah digunakan dalam panggilan SQL.

source: Other ``django.security`` loggers not based on ``SuspiciousOperation`` are:
id: Pencatat ``django.security`` lain bukan berdasarkan pada ``SuspiciousOperation`` adalah:

source: ``django.security.csrf``: For :ref:`CSRF failures <csrf-rejected-requests>`.
id: ``django.security.csrf``: Untuk :ref:`CSRF failures 1`.

source: By default, an instance of the email backend specified in :setting:`EMAIL_BACKEND` will be used.
id: Secara awalan, sebuah instance dari backend surel ditentukan dalam :setting:`EMAIL_BACKEND` akan digunakan.

source: and then add it to your logging config:
id: dan kemudian tambah itu ke konfigurasi pencatatan anda:

source: This filter will only pass on records when settings.DEBUG is False.
id: Penyaring ini hanya akan dilewatkan pada rekaman ketika settings.DEBUG adalah False.

source: Django's default logging configuration
id: Konfigurasi pencatatan awalan Django

source: By default, Django configures the following logging:
id: Secara awalan, Django mengkonfigurasi pencatatan berikut:

source: When :setting:`DEBUG` is ``True``:
id: ketika :setting:`DEBUG` adalah ``True``:

source: When :setting:`DEBUG` is ``False``:
id: Ketika :setting:`DEBUG` adalah ``False``;

source: Migrations
id: Perpindahan

source: The Commands
id: Perintah

source: :djadmin:`migrate`, which is responsible for applying and unapplying migrations.
id: :djadmin:`migrate`, yang bertanggung jawab untuk memberlakukan dan tidak memberlakukan perpindahan.

source: :djadmin:`sqlmigrate`, which displays the SQL statements for a migration.
id: :djadmin:`sqlmigrate`, yang menampilan pernyataan SQL untuk perpindahan.

source: :djadmin:`showmigrations`, which lists a project's migrations and their status.
id: :djadmin:`showmigrations`, yang menampilan perpindahan proyek dan keadaan mereka.

source: Backend Support
id: Dukungan backend

source: Workflow
id: Alur kerja

source: Dependencies
id: Ketergantungan

source: Custom fields
id: Bidang penyesuaian

source: You can't modify the number of positional arguments in an already migrated custom field without raising a ``TypeError``. The old migration will call the modified ``__init__`` method with the old signature. So if you need a new argument, please create a keyword argument and add something like ``assert 'argument_name' in kwargs`` in the constructor.
id: Anda tidak dapat merubah argumen penempatan dalam bidang penyesuaian sudah diminta tanpa memunculkan sebuah ``TypeError``. Perpindahan lama akan memanggil metode ``__init__ yang telah dirubah dengan tanda tangan lama. Jadi jika anda butuh argumen baru, harap membuat sebuah argumen kata kunci dan menambahkan sesuatu seperti ``assert 'argument_name' in kwargs`` dalam pembangun.

source: When the :option:`migrate --fake-initial` option is used, these initial migrations are treated specially. For an initial migration that creates one or more tables (``CreateModel`` operation), Django checks that all of those tables already exist in the database and fake-applies the migration if so. Similarly, for an initial migration that adds one or more fields (``AddField`` operation), Django checks that all of the respective columns already exist in the database and fake-applies the migration if so. Without ``--fake-initial``, initial migrations are treated no differently from any other migration.
id: Ketika pilihan :option:`migrate --fake-initial` digunakan, perpindahan inisial ini diperlakukan khusus. Untuk sebuah perpindahan inisial yang membuat satu atau lebih tabel (tindakan ``CreateModel``), Django memeriksa bahwa semua dari tabel-table tersebut sudah ada dalam basisdata dan pemberlakukan-palsu perpindahan jika demikian. Demikian pula, untuk sebuah perpindahan inisial yang menambahkan satu atau lebih bidang-bidang (tindakan ``AddField``), Django memeriksa bahwa semua dari masing-masing kolom sudah ada dalam basisdata dan pemberlakukan-palsu perpindahan jika demikian. Tanpa ``--fake-initial``, perpindahan inisial diperlakukan tidak berbeda dari perpindahan lain.

source: As previously discussed, you may need to linearize migrations manually when two development branches are joined. While editing migration dependencies, you can inadvertently create an inconsistent history state where a migration has been applied but some of its dependencies haven't. This is a strong indication that the dependencies are incorrect, so Django will refuse to run migrations or make new migrations until it's fixed. When using multiple databases, you can use the :meth:`allow_migrate` method of :ref:`database routers <topics-db-multi-db-routing>` to control which databases :djadmin:`makemigrations` checks for consistent history.
id: Seperti sebelumnya diobrolkan, anda mungkin butuh melinerarkan perpindahan secara manual ketika dua cabang pengembangan digabungkan. Selagi menyunting ketergantungan perpindahan, anda dapat secara tidak sengaja membuat sebuah keadaan riwayat tidak tetap dimana sebuah perpindahan telah diberlakukan tetapi beberapa ketergantungannya belum. Ini adalah indikasi kuat yang ketergantungan adalah tidak benar, jadi Django akan menolak menjalankan perpindahan atau membuat perpindahan baru sampai itu diperbaiki. Ketika menggunakan banyak basisdata, anda dapat menggunakan metode :meth:`allow_migrate` dari :ref:`database routers <topics-db-multi-db-routing>` untuk mengendalikan pemeriksaan :djadmin:`makemigrations` basisdata mana untuk riwayat ketetapan.

source: Adding migrations to apps
id: Menambahkan perpindahan ke aplikasi

source: Note that this only works given two things:
id: Catat bahwa ini hanya bekerja memberikan dua hal:

source: Because it's impossible to serialize arbitrary Python code, these historical models will not have any custom methods that you have defined. They will, however, have the same fields, relationships, managers (limited to those with ``use_in_migrations = True``) and ``Meta`` options (also versioned, so they may be different from your current ones).
id: Karena itu tidak mungkin menserialisasikan kode Python berubah-ubah, model-model riwayat ini tidak akan mempunyai penyesuaian metode apapun yang anda telah tentukan. Mereka akan, bagaimanapun, mempunyai bidang-bidang sama, hubungan, pengelola (terbatas ke itu dengan ``use_in_migrations = True``) dan pilihan ``Meta`` (juga berversi, jadi mereka mungkin berbeda dari satu anda saat ini).

source: This means that you will NOT have custom ``save()`` methods called on objects when you access them in migrations, and you will NOT have any custom constructors or instance methods. Plan appropriately!
id: Ini berarti bahwa anda TIDAK akan mempunyai metode ``save()`` penyesuaian dipanggil ketika anda mengakses mereka dalam perpindahan, dan anda TIDAK akan mempunyai pembangun penyesuaian apapun atau metode instance. Rencanakan dengan tepat!

source: In addition, the base classes of the model are just stored as pointers, so you must always keep base classes around for as long as there is a migration that contains a reference to them. On the plus side, methods and managers from these base classes inherit normally, so if you absolutely need access to these you can opt to move them into a superclass.
id: Sebagai tambahan, kelas-kelas dasar dari model hanya disimpan sebagai petunjuk, jadi anda harus selalu menjaga kelas-kelas dasar disekitar selama ada sebuah perpindahan yang mengandung sebuah acuan ke mereka. Pada sisi tambahan, metode dan pengelola dari kelas-kelas dasar ini mewarisi secara biasa, jadi anda mutlak butuh mengakses ke ini anda dapat memilih memindahkan mereka menjadi sebuah super kelas.

source: To help with this situation, Django provides some model field attributes to assist with model field deprecation using the :doc:`system checks framework </topics/checks>`.
id: Untuk membantu dengan keadaan ini, Django menyediakan beberapa atribut bidang model untuk memandu dengan pengusangan bidang model menggunakan :doc:`system checks framework </topics/checks>`.

source: Data Migrations
id: Perpindahan Data

source: Then, open up the file; it should look something like this::
id: Lalu, buka berkas; dia seharusnya kelihatan sesuatu sepert ini::

source: Now, all you need to do is create a new function and have :class:`~django.db.migrations.operations.RunPython` use it. :class:`~django.db.migrations.operations.RunPython` expects a callable as its argument which takes two arguments - the first is an :doc:`app registry </ref/applications/>` that has the historical versions of all your models loaded into it to match where in your history the migration sits, and the second is a :doc:`SchemaEditor </ref/schema-editor>`, which you can use to manually effect database schema changes (but beware, doing this can confuse the migration autodetector!)
id: Sekarang, semua yang perlu anda lakukan adalah membuat sebuah fungsi baru dan memiliki :class:`~django.db.migrations.operations.RunPython` menggunakannya. :class:`~django.db.migrations.operations.RunPython` mengharapkan sebuah callable sebagai argumennya yang mengambil dua argumen - pertama adalah sebuah :doc:`app registry </ref/applications/>` yang mempunyai versi riwayat dari semua model anda dimuat kedalam itu untuk mencocokkan dimana riwayat perpindahan anda berada, dan kedua adalah :doc:`SchemaEditor </ref/schema-editor>`, yang dapat menggunakan secara manual mempengaruhi perubahan skema basisdata (tetapi hati-hati, melakukan ini dapat membingungkan pengenal otomatis perpindahan!)

source: Accessing models from other apps
id: Mengakses model dari aplikasi lain

source: More advanced migrations
id: Perpindahan lebih lanjut

source: Any Django field
id: Bidang Django Apapun

source: Django cannot serialize:
id: Django tidak dapat diserialkan:

source: Nested classes
id: Kelas bersarang

source: Adding a ``deconstruct()`` method
id: Menambahkan cara ``deconstruct()``

source: Supporting multiple Django versions
id: Mendukung banyak versi Django

source: :doc:`The Migrations Operations Reference </ref/migration-operations>`
id: :doc:`The Migrations Operations Reference 1`

source: Covers the schema operations API, special operations, and writing your own operations.
id: Menutupi skema API tindakan, tindakan khusus, dan menulis tindakan anda sendiri.

source: :doc:`The Writing Migrations "how-to" </howto/writing-migrations>`
id: :doc:`Menulis Perpindahan "how-to" </howto/writing-migrations>`

source: Pagination
id: Halaman

source: Using ``Paginator`` in a view
id: Menggunakan ``Paginator`` dalam sebuah tampilan

source: The view function looks like this::
id: Fungsi tampilan kelihatan seperi ini::

source: ``Paginator`` objects
id: Obyek ``Paginator``

source: The :class:`Paginator` class has this constructor:
id: Kelas :class:`Paginator` mempunyai pembangun ini:

source: Methods
id: Cara

source: Attributes
id: Atribut
