Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: These profile models are not special in any way - they are just Django models that happen to have a one-to-one link with a user model. As such, they aren't auto created when a user is created, but a :attr:`django.db.models.signals.post_save` could be used to create or update related models as appropriate.
id: Model profil ini tidak khusus dengan cara apapun - mereka hanya model Django yang terjadi untuk memiliki tautan one-to-one dengan model user. Dengan demikian, mereka tidak dibuat otomatis ketika pengguna dibuat, tetapi :attr:`django.db.models.signals.post_save` dapat digunakan untuk membuat atau memperbaharui model sewajarnya.

source: Using related models results in additional queries or joins to retrieve the related data. Depending on your needs, a custom user model that includes the related fields may be your better option, however, existing relations to the default user model within your project's apps may justify the extra database load.
id: menggunakan hasil model terkait di tambahan permintaan atau penggabungan untuk mendapatkan data terkait. Tergantung pada kebutuhan anda, penyesuaian model user yang menyertakan bidang terkait mungkin pilihan terbaik anda, bagaimanapun hubungan yang ada pada model user awalan dalam aplikasi proyek anda mungkin membenarkan muatan basisdata lebih.

source: Substituting a custom ``User`` model
id: Mengganti model ``User`` penyesuaian

source: Some kinds of projects may have authentication requirements for which Django's built-in :class:`~django.contrib.auth.models.User` model is not always appropriate. For instance, on some sites it makes more sense to use an email address as your identification token instead of a username.
id: Beberapa macam proyek mungkin mempunyai persyaratan pembuktian keaslian untuk dimana model :class:`~django.contrib.auth.models.User` siap-pakai Django tidak selalu sesuai. Sebagai contoh, pada beberapa situs akan masuk akal menggunakan sebuah alamat surel sebagai token pencirian daripada nama pengguna.

source: Django allows you to override the default user model by providing a value for the :setting:`AUTH_USER_MODEL` setting that references a custom model::
id: Django mengizinkan anda untuk menimpa model pengguna awalan dengan menyediakan nilai untuk pengaturan :setting:`AUTH_USER_MODEL` yang mengacu model penyesuaian::

source: This dotted pair describes the name of the Django app (which must be in your :setting:`INSTALLED_APPS`), and the name of the Django model that you wish to use as your user model.
id: Pasangan titik ini menggambarkan nama dari aplikasi Django (yang harus berada di :setting:`INSTALLED_APPS`), dan nama dari model Django yang anda harapkan untuk digunakan sebagai model user anda.

source: Using a custom user model when starting a project
id: Menggunakan model pengguna penyesuaian ketika memulai sebuah proyek

source: If you're starting a new project, it's highly recommended to set up a custom user model, even if the default :class:`~django.contrib.auth.models.User` model is sufficient for you. This model behaves identically to the default user model, but you'll be able to customize it in the future if the need arises::
id: Jika anda sedang memulai proyek baru, sangat dianjurkan mengatur penyesuaian model user, bahkan jika awalan model :class:`~django.contrib.auth.models.User` cukup untuk anda. Model kebiasaan ini mirip pada awalan model user, tetapi anda akan dapat menyesuaikan nya di masa depan jika kebutuhan muncul::

source: Don't forget to point :setting:`AUTH_USER_MODEL` to it. Do this before creating any migrations or running ``manage.py migrate`` for the first time.
id: Jangan lupa menunjuk :setting:`AUTH_USER_MODEL` ke itu. Lakukan ini sebelum membuat perpindahan apapun atau menjalankan ``manage.py migrate`` untuk pertama kalinya.

source: Also, register the model in the app's ``admin.py``::
id: Juga, daftar model dalam ``admin.py`` aplikasi::

source: Changing to a custom user model mid-project
id: Merubah ke proyek-tengah penyesuaian model user

source: Changing :setting:`AUTH_USER_MODEL` after you've created database tables is significantly more difficult since it affects foreign keys and many-to-many relationships, for example.
id: Merubah :setting:`AUTH_USER_MODEL` setelah anda membuat tabel-tabel basisdata adalah penting lebih sulit sejak itu mempengaruhi foreign key dan hubungan many-to-many, sebagai contoh.

source: This change can't be done automatically and requires manually fixing your schema, moving your data from the old user table, and possibly manually reapplying some migrations. See :ticket:`25313` for an outline of the steps.
id: Perubahan ini tidak dapat diselesaikan secara otomatis dan membutuhkan perbaikan secara manual skema anda, memindahkan data anda dari tabel user lama, dan kemungkinan secara manual memberlakukan kembali beberapa perpindahan. Lihat :ticket:`25313` untuk ringkasan dari langkah-langkah.

source: Due to limitations of Django's dynamic dependency feature for swappable models, the model referenced by :setting:`AUTH_USER_MODEL` must be created in the first migration of its app (usually called ``0001_initial``); otherwise, you'll have dependency issues.
id: Karena pembatasan dari fitur ketergantungan dinamis Django untuk model-model dapat ditukar, pengacuan model oleh :setting:`AUTH_USER_MODEL` harus dibuat di perpindahan pertama dari aplikasinya (biasanya dipanggil ``0001_initial``); sebaliknya, anda akan mempunyai masalah ketergantungan.

source: In addition, you may run into a ``CircularDependencyError`` when running your migrations as Django won't be able to automatically break the dependency loop due to the dynamic dependency. If you see this error, you should break the loop by moving the models depended on by your user model into a second migration. (You can try making two normal models that have a ``ForeignKey`` to each other and seeing how ``makemigrations`` resolves that circular dependency if you want to see how it's usually done.)
id: Sebagai tambahan, anda mungkin berjalan kedalam ``CircularDependencyError`` ketika menjalankan perpindahan anda sebagai Django tidak akan dapat secara otomatis memutus ketergantungan pada ketergantungan dinamis. Jika anda melihat kesalahan ini, anda harus memutuskan perulangan dengan memindahkan model bergantung pada model user anda kedalam perindahan kedua. (Anda dapat mencoba membuat dua model biasa yang memiliki ``ForeignKey`` ke setiap lainnya dan melihat bagaimana ``makemigrations`` mengatasi lingkaran ketergantungan jika anda ingin melihat bagaimana itu biasanya diselesaikan.)

source: Reusable apps and ``AUTH_USER_MODEL``
id: Aplikasi digunakan kembali ``AUTH_USER_MODEL``

source: Reusable apps shouldn't implement a custom user model. A project may use many apps, and two reusable apps that implemented a custom user model couldn't be used together. If you need to store per user information in your app, use a :class:`~django.db.models.ForeignKey` or :class:`~django.db.models.OneToOneField` to ``settings.AUTH_USER_MODEL`` as described below.
id: Aplikasi dapat digunakan kembali tidak harus menerapkan penyesuaian model user. Sebuah proyek mungkin menggunakan banyak aplikasi, dan dua aplikasi dapat digunakan kembali yang menerapkan penyesuaian model user tidak dapat digunakan bersama-sama. Jika anda butuh menyimpan per informasi pengguna di aplikasi anda, gunakan :class:`~django.db.models.ForeignKey` atau :class:`~django.db.models.OneToOneField` pada ``settings.AUTH_USER_MODEL`` seperti yang digambarkan dibawah.

source: Referencing the ``User`` model
id: Mengacu model ``User``

source: If you reference :class:`~django.contrib.auth.models.User` directly (for example, by referring to it in a foreign key), your code will not work in projects where the :setting:`AUTH_USER_MODEL` setting has been changed to a different user model.
id: Jika anda mengacu :class:`~django.contrib.auth.models.User` secara langsung (sebagai contoh, dengan mengacu ke itu di foreign key), kode anda tidak akan bekerja di proyek dimana pengaturan :setting:`AUTH_USER_MODEL` telah berubah ke model user berbeda.

source: Instead of referring to :class:`~django.contrib.auth.models.User` directly, you should reference the user model using ``django.contrib.auth.get_user_model()``. This method will return the currently active user model -- the custom user model if one is specified, or :class:`~django.contrib.auth.models.User` otherwise.
id: Daripada mengacu ke :class:`~django.contrib.auth.models.User` secara langsung, anda harus mengacu modl user menggunakan ``django.contrib.auth.get_user_model()``. Metode ini akan mengembalikan model user aktif saat ini -- penyesuaian model user jika satu adalah ditentukan, atau :class:`~django.contrib.auth.models.User` sebaliknya.

source: When you define a foreign key or many-to-many relations to the user model, you should specify the custom model using the :setting:`AUTH_USER_MODEL` setting. For example::
id: Ketika anda menentukan foreign key atau hubungan many-to-many pada model pengguna, anda harus menentukan model penyesuaian menggunakan pengaturan :setting:`AUTH_USER_MODEL`. Sebagai contoh::

source: When connecting to signals sent by the user model, you should specify the custom model using the :setting:`AUTH_USER_MODEL` setting. For example::
id: Ketika terhubung ke sinyal yang dikirim oleh model User. anda harus menentukan penyesuaian model menggunakan pengaturan :setting:`AUTH_USER_MODEL`. Sebagai contoh::

source: Generally speaking, it's easiest to refer to the user model with the :setting:`AUTH_USER_MODEL` setting in code that's executed at import time, however, it's also possible to call ``get_user_model()`` while Django is importing models, so you could use ``models.ForeignKey(get_user_model(), ...)``.
id: Secara umum, itu paling mudah mengacu ke model user dengan pengaturan :setting:`AUTH_USER_MODEL` dalam kode yang dijalankan pada waktu impor, bagaimanapun, itu juga memungkinkan memanggil ``get_user_model()`` selagi Django mengimpor model, jadi anda dapat menggunakan ``models.ForeignKey(get_user_model(), ...)``.

source: If your app is tested with multiple user models, using ``@override_settings(AUTH_USER_MODEL=...)`` for example, and you cache the result of ``get_user_model()`` in a module-level variable, you may need to listen to the :data:`~django.test.signals.setting_changed` signal to clear the cache. For example::
id: Jika aplikasi anda dicobakan dengan banyak model user, menggunakan ``@override_settings(AUTH_USER_MODEL=...)`` sebagai contoh, dan anda meng cache hasil dari ``get_user_model()`` dalam sebuah variabel tingkat-variabel, anda mungkin butuh mendengarkan pada sinyal :data:`~django.test.signals.setting_changed` untuk membersihkan cache. Sebagai contoh::

source: Specifying a custom user model
id: Menentukan model pengguna penyesuaian

source: Model design considerations
id: Pertimbangan rancangan model

source: Think carefully before handling information not directly related to authentication in your custom user model.
id: Berpikir hati-hati sebelum menangani informasi tidak langsung terkait ke otentifikasi di model pengguna penyesuaian anda.

source: It may be better to store app-specific user information in a model that has a relation with the user model. That allows each app to specify its own user data requirements without risking conflicts with other apps. On the other hand, queries to retrieve this related information will involve a database join, which may have an effect on performance.
id: Itu mungkin lebih baik untuk menyimpan aplikasi-khusus informasi pengguna dalam sebuah model yang mempunyai hubungan dengan model user. Itu mengizinkan setiap aplikasi menentukan persyaratan data pengguna miliknya tanpa mempertaruhkan pertentangan dengan aplikasi lain. Di sisi lain, permintaan untuk mengambil informasi terkait ini akan melibatkan peggabungan basisdata, yang akan mempunyai pengaruh pada penampilan.

source: Django expects your custom user model to meet some minimum requirements.
id: Django mengharapkan model pengguna penyesuaian anda memenuhi persyaratan minimal.

source: If you use the default authentication backend, then your model must have a single unique field that can be used for identification purposes. This can be a username, an email address, or any other unique attribute. A non-unique username field is allowed if you use a custom authentication backend that can support it.
id: Jika anda menggunakan backend pembuktian keaslian awal, kemudian model anda harus mempunyai bidang unik tunggal yang dapat digunakan untuk tujuan pencirian. Ini dapat berupa nama pengguna, sebuah alamat surel, atau atribut unik lainnya. Bidang nama pengguna tidak unik diizinkan jika anda menggunakan penyesuaian backend pembuktian keaslian yang dapat mendukungnya.

source: The easiest way to construct a compliant custom user model is to inherit from :class:`~django.contrib.auth.models.AbstractBaseUser`. :class:`~django.contrib.auth.models.AbstractBaseUser` provides the core implementation of a user model, including hashed passwords and tokenized password resets. You must then provide some key implementation details:
id: Cara termudah untuk membangun selalu tunduk penyesuaian model user adalah mewarisi dari :class:`~django.contrib.auth.models.AbstractBaseUser`. :class:`~django.contrib.auth.models.AbstractBaseUser` menyediakan inti penerapan dari model user, termasuk sandi bercampur dan setel kembali sandi token. Anda harus kemudian menyediakan beberapa kunci penerapan rincian:

source: A string describing the name of the field on the user model that is used as the unique identifier. This will usually be a username of some kind, but it can also be an email address, or any other unique identifier. The field *must* be unique (i.e., have ``unique=True`` set in its definition), unless you use a custom authentication backend that can support non-unique usernames.
id: Deretan karakter menggambarkan nama dari bidang pada model user yang digunakan sebagai penciri unik. Ini akan biasanya berupa nama pengguna dari beberapa macam, tetapi itu dapat juga berupa alamat surel, atau apapun penciri unik lainnya. Bidang *harus* berupa unik (yaitu, mempunyai setelan ``unique=True`` di pengertiannya), meskipun anda menggunakan penyesuaian backend otentifikasi yang dapat mendukung nama pengguna bukan unik.

source: In the following example, the field ``identifier`` is used as the identifying field::
id: Dalam contoh berikut, bidang ``identifier`` digunakan sebagai bidang pengenal::

source: A string describing the name of the email field on the ``User`` model. This value is returned by :meth:`~models.AbstractBaseUser.get_email_field_name`.
id: Sebuah string menggambarkan nama dari bidang surel pada model ``User``. Nilai ini dikembalikan oleh :meth:`~models.AbstractBaseUser.get_email_field_name`.

source: A list of the field names that will be prompted for when creating a user via the :djadmin:`createsuperuser` management command. The user will be prompted to supply a value for each of these fields. It must include any field for which :attr:`~django.db.models.Field.blank` is ``False`` or undefined and may include additional fields you want prompted for when a user is created interactively. ``REQUIRED_FIELDS`` has no effect in other parts of Django, like creating a user in the admin.
id: Sebuah daftar dari nama bidang yang akan diminta ketika membuat sebuah pengguna melalui perintah pengelolaan :djadmin:`createsuperuser`. Pengguna akan diminta untuk menyediakan nilai untuk setiap bidang ini. Itu harus menyertakan bidang apapun yang :attr:`~django.db.models.Field.blank` adalah ``False`` atau tidak menentukan dan mungkin disertakan bidang tambahan anda ingin minta ketika sebuah pengguna dibuat secara interaktif. ``REQUIRED_FIELDS`` tidak mempunyai efek di bagian lagi dari Django, seperti membuat sebuah pengguna di admin.

source: For example, here is the partial definition for a user model that defines two required fields - a date of birth and height::
id: Sebagai contoh, ini ada pengertian sebagian untuk model pengguna yang menentukan dua bidang wajib- tanggal lahir dan tinggi::

source: ``REQUIRED_FIELDS`` must contain all required fields on your user model, but should *not* contain the ``USERNAME_FIELD`` or ``password`` as these fields will always be prompted for.
id: ``REQUIRED_FIELDS`` harus mengandung semua bidang diwajibkan pada model pengguna anda, tetapi *tidak* mengandung ``USERNAME_FIELD`` atau ``password`` ketika bidang ini selalu diminta.

source: A boolean attribute that indicates whether the user is considered "active". This attribute is provided as an attribute on ``AbstractBaseUser`` defaulting to ``True``. How you choose to implement it will depend on the details of your chosen auth backends. See the documentation of the :attr:`is_active attribute on the built-in user model <django.contrib.auth.models.User.is_active>` for details.
id: Sebuah atribut boolean yang mengindikasikan apakah pengguna dianggap "aktif". Atribut ini disediakan sebagai sebuah atribut pada ``AbstractBaseUser`` awalan pada ``True``. Bagaimana anda memilih menerapkan itu akan tergantung pada rincian dari backend otentifikasi yang anda pilih. Lihat dokumentasi dari :attr:`is_active attribute on the built-in user model <django.contrib.auth.models.User.is_active>` untuk rincian.

source: Optional. A longer formal identifier for the user such as their full name. If implemented, this appears alongside the username in an object's history in :mod:`django.contrib.admin`.
id: Pilihan. Penciri resmi lebih panjang untuk pengguna seperti nama penuh mereka. Jika diterapkan, ini muncul disamping nama pengguna dalam riwayat obyek dalam :mod:`django.contrib.admin`.

source: Optional. A short, informal identifier for the user such as their first name. If implemented, this replaces the username in the greeting to the user in the header of :mod:`django.contrib.admin`.
id: Pilihan. Pendek, penciri tidak resmi untuk pengguna seperti nama pertama mereka. Jika diterapkan, ini mengganti nama pengguna dalam salam sapa ke pengguna di kepala dari :mod:`django.contrib.admin`.

source: In older versions, subclasses are required to implement ``get_short_name()`` and ``get_full_name()`` as ``AbstractBaseUser`` has implementations that raise ``NotImplementedError``.
id: Dalam versi terlama, subkelas-subkelas dibutuhkan untuk menerapkan ``get_short_name()`` dan ``get_full_name()`` sebagai ``AbstractBaseUser`` mempunyai penerapan yang memunculkan ``NotImplementedError``.

source: Importing ``AbstractBaseUser``
id: Mengimpor ``AbstractBaseUser``

source: ``AbstractBaseUser`` and ``BaseUserManager`` are importable from ``django.contrib.auth.base_user`` so that they can be imported without including ``django.contrib.auth`` in :setting:`INSTALLED_APPS`.
id: ``AbstractBaseUser`` dan ``BaseUserManager`` dapat diimpor dari ``django.contrib.auth.base_user`` sehingga mereka dapat diimpor tanpa menyertakan ``django.contrib.auth`` di :setting:`INSTALLED_APPS`.

source: The following attributes and methods are available on any subclass of :class:`~django.contrib.auth.models.AbstractBaseUser`:
id: Atribut dan cara berikut tersedia pada setiap subkelas dari :class:`~django.contrib.auth.models.AbstractBaseUser`:

source: Returns the value of the field nominated by ``USERNAME_FIELD``.
id: Mengembalikan nilai dari bidang dicalonkan oleh ``USERNAME_FIELD``.

source: Normalizes the username by calling :meth:`normalize_username`. If you override this method, be sure to call ``super()`` to retain the normalization.
id: Normalisasikan nama pengguna dengan memanggil :meth:`normalize_username`. Jika anda menimpa cara ini, pastikan memanggil ``super()`` untuk menahan normalisasi.

source: Returns the name of the email field specified by the :attr:`~models.CustomUser.EMAIL_FIELD` attribute. Defaults to ``'email'`` if ``EMAIL_FIELD`` isn't specified.
id: Mengembalikan nama dari bidang surel ditentukan oleh atribut :attr:`~models.CustomUser.EMAIL_FIELD`. Awalan pada ``'email'`` jika ``EMAIL_FIELD`` tidak ditentukan.

source: Applies NFKC Unicode normalization to usernames so that visually identical characters with different Unicode code points are considered identical.
id: Memberlakukan normalisasi Unicode NFKC pada nama pengguna sehingga nampak karakter mirip dengan titik kode Unicode berbeda dianggap mirip.

source: Read-only attribute which is always ``True`` (as opposed to ``AnonymousUser.is_authenticated`` which is always ``False``). This is a way to tell if the user has been authenticated. This does not imply any permissions and doesn't check if the user is active or has a valid session. Even though normally you will check this attribute on ``request.user`` to find out whether it has been populated by the :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` (representing the currently logged-in user), you should know this attribute is ``True`` for any :class:`~models.User` instance.
id: Atribut hanya-baca yang selalu ``True`` (sebagai lawan ``AnonymousUser.is_authenticated`` yang selalu ``False``). Ini adalah cara untuk memberitahu jika pengguna telah diotentifikasi. Ini tidak berarti perizinan apapun dan tidak memeriksa jika pengguna adalah aktif atau mempunyai sesi sah. Meskipun secara biasa anda akan memeriksa atribut ini pada ``request.user`` untuk menemukan apakah itu telah dikumpulkan oleh :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` (mewakili pengguna masuk saat ini), anda harus mengetahui atribut ini adalah ``True`` untuk tiap instance :class:`~models.User`.

source: Read-only attribute which is always ``False``. This is a way of differentiating :class:`~models.User` and :class:`~models.AnonymousUser` objects. Generally, you should prefer using :attr:`~models.User.is_authenticated` to this attribute.
id: Atribut hanya-baca yaitu selalu ``False``. Ini adalah jalan untuk membedakan obyek :class:`~models.User` and :class:`~models.AnonymousUser`. Umumnya, anda harus memilih menggunakan :attr:`~models.User.is_authenticated` pada atribut ini.

source: Sets the user's password to the given raw string, taking care of the password hashing. Doesn't save the :class:`~django.contrib.auth.models.AbstractBaseUser` object.
id: Setel sandi pengguna ke deretan karakter mentah yang diberikan, merawat has sandi. Tidak menyimpan obyek :class:`~django.contrib.auth.models.AbstractBaseUser`.

source: When the raw_password is ``None``, the password will be set to an unusable password, as if :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` were used.
id: Ketika sandi mentah adalah ``None``, sandi akan disetel ke sandi tidak biasa, seolah-olah :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` digunakan.

source: Returns ``True`` if the given raw string is the correct password for the user. (This takes care of the password hashing in making the comparison.)
id: Mengembalikan ``True`` jika deretan karakter mentah yang diberikan adalah sandi benar untuk pengguna. (Ini merawat hash sandi dalam membuat perbandingan.)

source: Marks the user as having no password set. This isn't the same as having a blank string for a password. :meth:`~django.contrib.auth.models.AbstractBaseUser.check_password()` for this user will never return ``True``. Doesn't save the :class:`~django.contrib.auth.models.AbstractBaseUser` object.
id: Tandai pengguna sebagai mempunyai sandi tidak disetel. Ini tidak sama seperti memiliki deretan karakter kosong untuk sebuah sandi. :meth:`~django.contrib.auth.models.AbstractBaseUser.check_password()` untuk pengguna ini tidak akan pernah mengembalikan ``True``. Tidak menyimpan obyek :class:`~django.contrib.auth.models.AbstractBaseUser`.
