Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Determine if the migration operation is allowed to run on the database with alias ``db``. Return ``True`` if the operation should run, ``False`` if it shouldn't run, or ``None`` if the router has no opinion.
id: Tentukan jika tindakan perpindahan diizinkan untuk menjalankan pada basisdata dengan nama lain ``db``. Mengembalikan ``True`` jika tindakan harus berjalan, ``False`` jika itu tidak harus berjalan, atau ``None`` jika perute tidak memiliki pendapat.

source: The ``app_label`` positional argument is the label of the application being migrated.
id: Argumen penempatan ``app_label`` adalah label untuk aplikasi sedang dipindahkan.

source: ``model_name`` is set by most migration operations to the value of ``model._meta.model_name`` (the lowercased version of the model ``__name__``) of the model being migrated. Its value is ``None`` for the :class:`~django.db.migrations.operations.RunPython` and :class:`~django.db.migrations.operations.RunSQL` operations unless they provide it using hints.
id: ``model_name`` disetel oleh kebanyakan tindakan perpindahan pada nilai dari ``model._meta.model_name``(versi huruf kecil dari model ``__name__``) dari model sedang dipindahkan. Nilai itu adalah ``None`` untuk tindakan :class:`~django.db.migrations.operations.RunPython` dan :class:`~django.db.migrations.operations.RunSQL` meskipun mereka menyediakan itu menggunakan petunjuk.

source: ``hints`` are used by certain operations to communicate additional information to the router.
id: ``hints`` digunakan oleh tindakan tertentu untuk berkomunikasi informasi tambahan ke perute.

source: When ``model_name`` is set, ``hints`` normally contains the model class under the key ``'model'``. Note that it may be a :ref:`historical model <historical-models>`, and thus not have any custom attributes, methods, or managers. You should only rely on ``_meta``.
id: Ketika ``hints``disetel, ``hints`` biasanya mengandung kelas model dibawah kunci ``'model'``. Catat bahwa itu mungkin berupa :ref:`historical model 1`, dan dengan demikian tidak mempunyai atribut penyesuaian apapun, metode, atau pengelola. Anda harus hanya bergantung pada ``_meta``.

source: This method can also be used to determine the availability of a model on a given database.
id: Metode ini dapat juga digunakan untuk menentukan ketersediaan dari sebuah model pada basisdata yang diberikan.

source: :djadmin:`makemigrations` always creates migrations for model changes, but if ``allow_migrate()`` returns ``False``, any migration operations for the ``model_name`` will be silently skipped when running :djadmin:`migrate` on the ``db``. Changing the behavior of ``allow_migrate()`` for models that already have migrations may result in broken foreign keys, extra tables, or missing tables. When :djadmin:`makemigrations` verifies the migration history, it skips databases where no app is allowed to migrate.
id: :djadmin:`makemigrations` selalu membuat perpindahan untuk perubahan model, tetapi jika ``allow_migrate()`` mengembalikan ``False``, tindakan perpindahan apapun untuk ``model_name`` akan secara diam dilewatkan ketika menjalankan :djadmin:`migrate` pada ``db``. Merubah perilaku dari ``allow_migrate()``untuk model yang sudah berpindah mungkin menghasilkan rusak dalam foreign key, tabel tambahan, atau tabel hilang. Ketika :djadmin:`makemigrations` memeriksa riwayat perpindahan, itu melewati basisdata dimana tidak ada aplikasi diizinkan berpindah.

source: A router doesn't have to provide *all* these methods -- it may omit one or more of them. If one of the methods is omitted, Django will skip that router when performing the relevant check.
id: Perute tidak harus menyediakan *semua* metode ini -- itu mungkin menghilangkan satu atau lebih dari mereka. Jika satu dari metode ini dihilangkan, Django akan melewati perute itu ketika melakukan pemeriksaan terkait.

source: Hints
id: Petunjuk

source: The hints received by the database router can be used to decide which database should receive a given request.
id: Petunjuk diterima oleh perute basisdata dapat digunakan untuk memutuskan basisdata mana harus menerima permintaan yang diberikan.

source: At present, the only hint that will be provided is ``instance``, an object instance that is related to the read or write operation that is underway. This might be the instance that is being saved, or it might be an instance that is being added in a many-to-many relation. In some cases, no instance hint will be provided at all. The router checks for the existence of an instance hint, and determine if that hint should be used to alter routing behavior.
id: Saat sekarang, petunjuk satu-satunya akan disediakan adalah ``instance``, sebuah instance obyek yang terkait ke tindakan baca atau tulis yang berlangsung. Ini mungkin instance yang sedang disimpan, atau itu mungkin berupa sebuah instance yang sedang ditambahkan dalam hubungan many-to-many. Dalam beberapa kasus, tidak ada petunjuk instance akan disediakan sama sekali. Perute memeriksa untuk kehadiran dari sebuah petunjuk instance, dan menentukan jika petunjuk itu harus digunakan untuk merubah perulaku perutean.

source: Using routers
id: Menggunakan router

source: Database routers are installed using the :setting:`DATABASE_ROUTERS` setting. This setting defines a list of class names, each specifying a router that should be used by the master router (``django.db.router``).
id: Perute basisdata dipasang menggunakan pengaturan :setting:`DATABASE_ROUTERS`. Pengaturan ini menentukan daftar dari nama-nama kelas, setiap menentukan perute harus digunakan dengan perute master (``django.db.router``).

source: The master router is used by Django's database operations to allocate database usage. Whenever a query needs to know which database to use, it calls the master router, providing a model and a hint (if available). Django then tries each router in turn until a database suggestion can be found. If no suggestion can be found, it tries the current ``_state.db`` of the hint instance. If a hint instance wasn't provided, or the instance doesn't currently have database state, the master router will allocate the ``default`` database.
id: Perute master digunakan oleh tindakan basisdata Django untuk memberikan penggunaan basisdata. Kapanpun sebuah permintaan membutuhkan untuk mengetahui basisdatamana digunakan, itu memanggil perute master, menyediakan sebuah model dan sebuah petunjuk (jika tersedia). Django kemudian mencoba setiap perute bergantian sampai saran basisdata dapat ditemukan. Jika tidak ada saran ditemukan, itu mencoba ``_state.db`` saat ini dari instance petunjuk. Jika sebuah instance petunjuk tidak disediakan, atau instance tidak saat ini mempunyai keadaan basisdata, perute master akan memperuntukkan basisdata ``default``.

source: An example
id: Sebuah contoh

source: Example purposes only!
id: Hanya bertujuan contoh!

source: This example is intended as a demonstration of how the router infrastructure can be used to alter database usage. It intentionally ignores some complex issues in order to demonstrate how routers are used.
id: Contoh ini dimaksudkan sebagai pertunjukan dari bagaimana infrastruktur perute dapat digunakan untuk mengubah penggunaan basisdata. Itu sengaja mengabaikan beberapa masalah rumit untuk mempertunjukkan bagaimana perute digunakan.

source: This example won't work if any of the models in ``myapp`` contain relationships to models outside of the ``other`` database. :ref:`Cross-database relationships <no_cross_database_relations>` introduce referential integrity problems that Django can't currently handle.
id: Contoh ini tidak akan bekerja jika apapun dari model dalam ``myapp`` mengandung hubungan pada model diluar dari basisdata ``other``. :ref:`Cross-database relationships 1`memperkenalkan masalah kesatuan referensial yang Django tidak dapat saat ini ditangani.

source: The primary/replica (referred to as master/slave by some databases) configuration described is also flawed -- it doesn't provide any solution for handling replication lag (i.e., query inconsistencies introduced because of the time taken for a write to propagate to the replicas). It also doesn't consider the interaction of transactions with the database utilization strategy.
id: Konfigurasi utama/tiruan (mengacu pada sebagai master/slave oleh beberapa basisdata) digambarkan juga cacat -- itu tidak menyediakan pemecahan apapun untuk menangani tiruan ketinggalan (yaitu permintaan ketidakkonsekuen diperkenalkan karena dari waktu diambil untuk menulis untuk disebarkan ke tiruan). Itu juga tidak mempertimbangkan timbal balik dari transaksi dengan strategi penggunaan basisdata.

source: So - what does this mean in practice? Let's consider another sample configuration. This one will have several databases: one for the ``auth`` application, and all other apps using a primary/replica setup with two read replicas. Here are the settings specifying these databases::
id: Jadi - apa ini artinya dalam praktik? Mari kita pertimbangkan konfigurasi contoh lain. Satu ini akan mempunyai beberapa basisdata: satu untuk aplikasi ``auth``, dan semua aplikasi lain menggunakan setelah utama/tiruan dengan duatiruan baca. Ini adalah pengaturan menentukan basisdata ini::

source: Now we'll need to handle routing. First we want a router that knows to send queries for the ``auth`` app to ``auth_db``::
id: Sekarang kami akan butug menangani perutean. Pertama kami ingin sebuah perute yang mengetahui bagaimana mengirim permintaan untuk aplikasi ``auth`` pada ``auth_db``::

source: And we also want a router that sends all other apps to the primary/replica configuration, and randomly chooses a replica to read from::
id: Dan kami juga ingin sebuah perute yang mengirim semua aplikasi lain semua ke konfigurasi utama/tiruan, dan secara acak memilih sebuah tiruan untuk dibaca::

source: Finally, in the settings file, we add the following (substituting ``path.to.`` with the actual Python path to the module(s) where the routers are defined)::
id: Akhirnya, dalam berkas pengaturan, kami menambahkan berikut (mengganti ``path.to.`` dengan jalur Python sebenarnya pada modul dimana perute ditentukan)::

source: The order in which routers are processed is significant. Routers will be queried in the order they are listed in the :setting:`DATABASE_ROUTERS` setting. In this example, the ``AuthRouter`` is processed before the ``PrimaryReplicaRouter``, and as a result, decisions concerning the models in ``auth`` are processed before any other decision is made. If the :setting:`DATABASE_ROUTERS` setting listed the two routers in the other order, ``PrimaryReplicaRouter.allow_migrate()`` would be processed first. The catch-all nature of the PrimaryReplicaRouter implementation would mean that all models would be available on all databases.
id: Urutan dimana perute diolah adalah penting. Perute akan diminta agar mereka didaftarkan dalam pengaturan :setting:`DATABASE_ROUTERS`. Dalam contoh ini, ``AuthRouter`` diolah sebelum ``PrimaryReplicaRouter``, dan sebagai hasil, keputusan tentang model-model dalam ``auth`` diolah sebelum keputusan lain apapun dibuat. Jika pengaturan :setting:`DATABASE_ROUTERS` mendaftarkan dua perute dalam urutan lain, ``PrimaryReplicaRouter.allow_migrate()`` akan diolah dahulu. Tangkap-semua alami dari penerapan PrimaryReplicaRouterakan berarti bahwa semua model-model akan tersedia pada semua basisdata.

source: With this setup installed, lets run some Django code::
id: Dengan pengaturan ini dipasang, mari kita jalankan beberapa kode Django::

source: This example defined a router to handle interaction with models from the ``auth`` app, and other routers to handle interaction with all other apps. If you left your ``default`` database empty and don't want to define a catch-all database router to handle all apps not otherwise specified, your routers must handle the names of all apps in :setting:`INSTALLED_APPS` before you migrate. See :ref:`contrib_app_multiple_databases` for information about contrib apps that must be together in one database.
id: Contoh ini menentukan sebuah perute untuk menangani interaksi dengan model-model dari aplikasi ``auth``, dan perute lain untuk mengangani interaksi dengan semua aplikasi lain. Jika anda membiarkan basisdata ``default`` anda kosong dan tidak ingin menentukan perute basisdata tangkap-semua untuk mengangani semua aplikasi tidak sebaliknya ditentukan, perute anda harus menangani nama-nama dari semua aplikasi dalam :setting:`INSTALLED_APPS` sebelum anda berpindah. Lihat :ref:`contrib_app_multiple_databases`untuk informasi tentang apliaksi bantuan yang harus bersama-sama dalam satu basisdata.

source: Manually selecting a database
id: Manual memilih basisdata

source: Django also provides an API that allows you to maintain complete control over database usage in your code. A manually specified database allocation will take priority over a database allocated by a router.
id: Django juga menyediakan sebuah API yang mengizinkan anda merawat kendali lengkap terhadap penggunaan basisdata dalam kode anda. Peruntukan basisdata ditentukan manual terhadap basisdata diperuntukkan oleh sebuah perute.

source: Manually selecting a database for a ``QuerySet``
id: Secara manual memilih basisdata untuk ``QuerySet``

source: You can select the database for a ``QuerySet`` at any point in the ``QuerySet`` "chain." Just call ``using()`` on the ``QuerySet`` to get another ``QuerySet`` that uses the specified database.
id: Anda dapat memilih basisdata untuk ``QuerySet``pada titik amnapun dalam rantai ``QuerySet``. Cukup panggil ``using()`` pada ``QuerySet``untuk mendapatkan ``QuerySet``lain yang menggunakan basisdata khusus.

source: ``using()`` takes a single argument: the alias of the database on which you want to run the query. For example::
id: ``using()`` mengambil argumen tunggal: nama lain dari basisdata pada dimana anda ingin menjalankan permintaan. Sebagai contoh::

source: Selecting a database for ``save()``
id: Memilih basisdata untuk ``save()``

source: Use the ``using`` keyword to ``Model.save()`` to specify to which database the data should be saved.
id: Gunakan kata kunci ``using`` pada ``Model.save()`` untuk menentukan pada basisdata mana data harus disimpan.

source: For example, to save an object to the ``legacy_users`` database, you'd use this::
id: Sebagai contoh, untuk menyimpan sebuah obyek pada basisdata ``legacy_users``, anda akan menggunakan ini::

source: If you don't specify ``using``, the ``save()`` method will save into the default database allocated by the routers.
id: Jika anda tidak menentukan `using``, metode ``save()`` kan menyimpan kedalam basisdata awalan ditempatkan oleh perute.

source: Moving an object from one database to another
id: Memindahkan sebuah obyek dari satu basisdata ke lainnya

source: If you've saved an instance to one database, it might be tempting to use ``save(using=...)`` as a way to migrate the instance to a new database. However, if you don't take appropriate steps, this could have some unexpected consequences.
id: Jika anda menyimpan sebuah instance pada satu basisdata, itu mungkin menggoda untuk menggunakan ``save(using=...)``sebagai sebuah cara berpindah instance ke basisdata baru. Bagaimanapun, jika anda tidak mengambil langkah-langkah yang sesuai, ini dapat memiliki beberapa konsekuensi tidak diharapkan.

source: Consider the following example::
id: Pertimbangkan contoh berikut ::

source: In statement 1, a new ``Person`` object is saved to the ``first`` database. At this time, ``p`` doesn't have a primary key, so Django issues an SQL ``INSERT`` statement. This creates a primary key, and Django assigns that primary key to ``p``.
id: Dalam pernyataan 1, sebuah obyek ``Person`` baru disimpan ke basisdata ``first``. Pada saat ini, ``p`` tidak memiliki primary key, jadi Django menerbitkan sebuah pernyataan SQL ``INSERT``. Ini membuat sebuah primary key, dan Django memberikan primary key itu ke ``p``.

source: When the save occurs in statement 2, ``p`` already has a primary key value, and Django will attempt to use that primary key on the new database. If the primary key value isn't in use in the ``second`` database, then you won't have any problems -- the object will be copied to the new database.
id: Ketika penyimpanan muncul dalam pernyataan 2, ``p`` sudah mempunyai nilai primary key, dan Django akan berusaha menggunakan primary key itu pada basisdata baru. Jika nilai primary key tidak digunakan dalam basisdata ``second``, kemudian akdan tidak mempunyai masalah apapun -- obyek akan disalin ke basisdata baru.

source: However, if the primary key of ``p`` is already in use on the ``second`` database, the existing object in the ``second`` database will be overridden when ``p`` is saved.
id: Bagaimanapun, jika primary key dari ``p`` sudah digunakan pada basisdata ``second``, obyek yang ada dalam basisdata ``second`` akan ditimpan ketika ``p`` disimpan.

source: You can avoid this in two ways. First, you can clear the primary key of the instance. If an object has no primary key, Django will treat it as a new object, avoiding any loss of data on the ``second`` database::
id: Anda dapat menghindari ini dalam dua cara. Pertama, anda dapat membersihkan primary key dari instance. Jika sebuah obyek tidak mempunyai primary key, Django akan memperlakukan itu sebagai sebuah obyek baru, menghindari kehilangan dari data pada basisdata ``second``::

source: The second option is to use the ``force_insert`` option to ``save()`` to ensure that Django does an SQL ``INSERT``::
id: Pilihan kedua adalah menggunakan pilihan ``force_insert`` pada ``save()`` untuk memastikan Django melakukan ``INSERT`` SQL::

source: This will ensure that the person named ``Fred`` will have the same primary key on both databases. If that primary key is already in use when you try to save onto the ``second`` database, an error will be raised.
id: Ini akan memastikan bahwa seseorang bernama ``Fred`` akan mempunyai primary key sama pada kedua basisdata. Jika primary key sudah digunakan ketika anda mencoba menyimpan kedalam basisdata ``kedua``, sebuah kesalahan akan dimunculkan.

source: Selecting a database to delete from
id: Memilih basisdata untuk menghapus dari

source: By default, a call to delete an existing object will be executed on the same database that was used to retrieve the object in the first place::
id: Secara awalan, sebuah panggilan untuk menghapus obyek yang ada akan dijalankan pada basisdata sama yang digunakan untuk mengambil obyek dalam tempat pertama::

source: To specify the database from which a model will be deleted, pass a ``using`` keyword argument to the ``Model.delete()`` method. This argument works just like the ``using`` keyword argument to ``save()``.
id: Untuk menentukan basisdata dari model mana akan dihapus, lewatkan sebuah argumen kata kunci ``using`` pada metode ``Model.delete()``. Argumen ini bekerja seperti argumen kata kunci ``using`` pada ``save()``.

source: For example, if you're migrating a user from the ``legacy_users`` database to the ``new_users`` database, you might use these commands::
id: Sebagai contoh, jika anda sedang memindahkan pengguna dari basisdata ``legacy_users`` ke basisdata ``new_users``, anda mungkin menggunakan perintah-perintah ini::

source: Using managers with multiple databases
id: Menggunakan pengelola dengan banyak basisdata

source: Use the ``db_manager()`` method on managers to give managers access to a non-default database.
id: Gunakan metode ``db_manager()`` pada pengelola untuk memberikan pengelola mengakses ke basisdata bukan-awalan.

source: For example, say you have a custom manager method that touches the database -- ``User.objects.create_user()``. Because ``create_user()`` is a manager method, not a ``QuerySet`` method, you can't do ``User.objects.using('new_users').create_user()``. (The ``create_user()`` method is only available on ``User.objects``, the manager, not on ``QuerySet`` objects derived from the manager.) The solution is to use ``db_manager()``, like this::
id: Sebagai contoh, katakan anda mempunyai metode pengelolaan penyesuaian yang menyentuh basisdata -- ``User.objects.create_user()``. Karena ``create_user()``adalah metode pengelola, bukan metode ``QuerySet``, anda tidak dapat melakukan ``User.objects.using('new_users').create_user()``. (Metode ``create_user()`` hanya tersedia pada ``User.objects``,pengelola, bukan pada obyek ``QuerySet`` diturunkan dari pengelola.) Pemecahannya adalah menggunakan ``db_manager()``,seperti ini::

source: ``db_manager()`` returns a copy of the manager bound to the database you specify.
id: ``db_manager()`` mengembalikan sebuah salinan dari ikatan pengelola pada basisdata anda tentukan.

source: Using ``get_queryset()`` with multiple databases
id: Menggunakan ``get_queryset()`` dengan basisdata banyak

source: If you're overriding ``get_queryset()`` on your manager, be sure to either call the method on the parent (using ``super()``) or do the appropriate handling of the ``_db`` attribute on the manager (a string containing the name of the database to use).
id: Jika anda menimpa ``get_queryset()`` pada pengelola anda, apstikan untuk antara memanggil metode pada induk (menggunakan ``super()``) atau melakukan penanganan sesuai dari atribut ``_db`` pada pengelola (sebuah string mengandung nama dari basisdata untuk digunakan).

source: For example, if you want to return a custom ``QuerySet`` class from the ``get_queryset`` method, you could do this::
id: Sebagai contoh, jika anda ingin mengembalikan penyesuaian kelas ``QuerySet`` dari metode ``get_queryset``, anda dapat melakukan ini::

source: Exposing multiple databases in Django's admin interface
id: Memamerkan basisdata banyak di antarmuka admin Django

source: Django's admin doesn't have any explicit support for multiple databases. If you want to provide an admin interface for a model on a database other than that specified by your router chain, you'll need to write custom :class:`~django.contrib.admin.ModelAdmin` classes that will direct the admin to use a specific database for content.
id: Admin Django tidak mempunyai dukungan jelas untuk banyak basisdata. Jika anda ingin menyediakan sebuah antarmuka admin untuk sebuah model pada sebuah basisdata daripada selain ditentukan oleh rantai peute anda, anda akan butuh menulis kelas-kelas :class:`~django.contrib.admin.ModelAdmin`penyesuaian yang akan langsung ke admin untuk menggunakan basisdata khusus untuk isi.

source: ``ModelAdmin`` objects have five methods that require customization for multiple-database support::
id: Obyek ``ModelAdmin`` mempunyai lima metode yang membutuhkan penyesuaian untuk dukungan banyak-basisdata::

source: The implementation provided here implements a multi-database strategy where all objects of a given type are stored on a specific database (e.g., all ``User`` objects are in the ``other`` database). If your usage of multiple databases is more complex, your ``ModelAdmin`` will need to reflect that strategy.
id: Penerapan disediakan disini menerapkan strategi banyak-basisdata dimana semua obyek dari jenis yang diberikan disimpan pada basisdata khusus (sebagai contoh, semua obyek ``User`` dalam basisdata ``lain``). Jika penggunaan anda dari banyak basisdata lebih rumit, ``ModelAdmin``anda akan butuh mencerminkan strategi itu.

source: :class:`~django.contrib.admin.InlineModelAdmin` objects can be handled in a similar fashion. They require three customized methods::
id: Obyek :class:`~django.contrib.admin.InlineModelAdmin` dapat ditangani di gaya yang mirip. Mereka membutuhkan tiga metode penyesuaian::

source: Once you've written your model admin definitions, they can be registered with any ``Admin`` instance::
id: Sekali anda telah menulis pengertian admin model anda, mereka dapat didaftarkan dengan instance ``Admin`` apapun::
