Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Consider a more useful form than our minimal example above, which we could use to implement "contact me" functionality on a personal website:
id: Pertimbangkan formulir lebih berguna dari contoh minimal kami diatas, yang kami dapat gunakan untuk menerapkan kegunaan "hubungi kami" pada situs jaringan pribadi:

source: Widgets
id: Widget

source: Each form field has a corresponding :doc:`Widget class </ref/forms/widgets/>`, which in turn corresponds to an HTML form widget such as ``<input type="text">``.
id: Setiap bidang formulir mempunyai :doc:`Widget class 1` sesuai, yang gilirannya sesuai pada sebuah widget formulir HMTL seperti ``2``.

source: Field data
id: Bidang data

source: You can still access the unvalidated data directly from ``request.POST`` at this point, but the validated data is better.
id: Anda masih dapat mengakses data tidak tersahkan langsung dari ``request.POST`` pada titik ini, tetapi data tersahkan adalah lebih baik.

source: Here's how the form data could be processed in the view that handles this form:
id: Ini adalah bagaimana formulir dapat dapat diolah dalam tampilan yang menangani formulir ini:

source: For more on sending email from Django, see :doc:`/topics/email`.
id: Untuk lebih pada mengirim surel dari Django, lihat :doc:`/topics/email`.

source: Working with form templates
id: Bekerja dengan cetakan formulir

source: Form rendering options
id: Formulir pilihan pembangunan

source: Additional form template furniture
id: Tambahan formulir cetakan mebel

source: There are other output options though for the ``<label>``/``<input>`` pairs:
id: Ada pilihan keluaran lain meskipun untuk pasangan ``1``/``2``:

source: ``{{ form.as_table }}`` will render them as table cells wrapped in ``<tr>`` tags
id: ``{{ form.as_table }}`` akan membangun mereka sebagai sel tabel terbungkus dalam etiket ``<tr>``

source: ``{{ form.as_p }}`` will render them wrapped in ``<p>`` tags
id: ``{{ form.as_p }}`` akan membangun mereka terbungkus dalam etiket ``<p>``

source: ``{{ form.as_ul }}`` will render them wrapped in ``<li>`` tags
id: ``{{ form.as_ul }}`` akan membangun mereka terbungkus dalam etiket ``<li>``

source: Note that you'll have to provide the surrounding ``<table>`` or ``<ul>`` elements yourself.
id: Catat bahwa anda harus menyediakan sekitarnya unsur ``1`` atau ``2`` anda sendiri.

source: Here's the output of ``{{ form.as_p }}`` for our ``ContactForm`` instance:
id: Ini adalah keluaran dari ``{{ form.as_p }}`` untuk instance ``ContactForm`` kami:

source: See :ref:`ref-forms-api-outputting-html` for more on this.
id: Lihat :ref:`ref-forms-api-outputting-html` untuk lebih pada ini.

source: Rendering fields manually
id: Membangun bidang manual

source: Rendering form error messages
id: Membangun formulir kesalahan pesan

source: See :doc:`/ref/forms/api` for more on errors, styling, and working with form attributes in templates.
id: Lihat :doc:`/ref/forms/api` untuk lebih pada kesalahan, gaya, dan bekerja dengan atribut formulir dalam cetakan-cetakan.

source: Looping over the form's fields
id: Memutar terhadap bidang-bidang formulir

source: If you're using the same HTML for each of your form fields, you can reduce duplicate code by looping through each field in turn using a ``{% for %}`` loop:
id: Jika anda sedang menggunakan HTML sama untuk setiap bidang formulir anda, anda dapat mengurangi kode ganda dengan memutari setiap bidang bergantian menggunakan putaran ``{% for %}``:

source: Useful attributes on ``{{ field }}`` include:
id: Atribut berguna pada ``{{ field }}`` termasuk:

source: The label of the field, e.g. ``Email address``.
id: Label dari bidang, sebagai contoh ``Alamat surel``.

source: The ID that will be used for this field (``id_email`` in the example above). If you are constructing the label manually, you may want to use this in lieu of ``label_tag``. It's also useful, for example, if you have some inline JavaScript and want to avoid hardcoding the field's ID.
id: ID yang akan digunakan untuk bidang ini (``id_email`` di contoh diatas). Jika anda sedang membangun label secara manual, anda mungkin ingin menggunakan ini sebagai pengganti ``label_tag``. Itu juga sangat berguna, sebagai contoh, jika anda mempunyai beberapa JavaScript berderet dan ingin menghindari kode keras ID bidang.

source: The value of the field. e.g ``someone@example.com``.
id: Nilai bidang sebagai contoh ``someone@example.com``.

source: Any help text that has been associated with the field.
id: Teks bantuan apapun yang telah dikaitkan dengan bidang.

source: Outputs a ``<ul class="errorlist">`` containing any validation errors corresponding to this field. You can customize the presentation of the errors with a ``{% for error in field.errors %}`` loop. In this case, each object in the loop is a simple string containing the error message.
id: Keluaran sebuah ``1`` mengandung pesan kesalahan apapun sesuai ke bidang ini. Anda dapat menyesuaikan bawaan dari kesalahan-kesalahan dengan sebuah ulangan ``{% for error in field.errors %}``. Dalam kasus ini, setiap obyek dalam ulangan adalah string sederhana mengandung pesan kesalahan.

source: For a complete list of attributes and methods, see :class:`~django.forms.BoundField`.
id: Untuk daftar lengkap dari atribut dan cara, lihat :class:`~django.forms.BoundField`.

source: Looping over hidden and visible fields
id: Berputar terhadap bidang-bdaing sembunyi dan tampak

source: Reusable form templates
id: Formulir cetakan-cetakan dapat digunakan kembali

source: If you find yourself doing this often, you might consider creating a custom :ref:`inclusion tag<howto-custom-template-tags-inclusion-tags>`.
id: Jika anda menemukan diri anda melakukan ini sering, anda mungkin mempertimbangkan membuat penyesuaian :ref:`inclusion tag1`.

source: Further topics
id: Topik lebih jauh

source: This covers the basics, but forms can do a whole lot more:
id: Ini mencangkup dasar, tetapi formulir dapat melakukan keseluruhan lebih banyak:

source: :doc:`The Forms Reference </ref/forms/index>`
id: :doc:`Acuan Formulir </ref/forms/index>`

source: Covers the full API reference, including form fields, form widgets, and form and field validation.
id: Mencangkup acuan API penuh, termasuk bidang formulir, widget formulir, dan pengesahan formulir dan bidang.

source: Form Assets (the ``Media`` class)
id: Aset Formulir (kelas ``Media``)

source: Assets and Django Admin
id: Admin Aset dan Django

source: If you like the widgets that the Django Admin application uses, feel free to use them in your own application! They're all stored in ``django.contrib.admin.widgets``.
id: Jika anda suka widget-widget yang aplikasi Admin Django gunakan, merasa bebas menggunakan mereka dalam aplikasi anda sendiri! Mereka semua disimpan dalam ``django.contrib.admin.widgets``.

source: Which JavaScript toolkit?
id: Kumpulan alat Javascript yang mana?

source: Assets as a static definition
id: Aset sebagai pengertian tetap

source: The easiest way to define assets is as a static definition. Using this method, the declaration is an inner ``Media`` class. The properties of the inner class define the requirements.
id: Cara termudah menentukan aset adalah sebagai definisi tetap. Menggunakan metode ini, pernyataan adalah sebuah kelas ``Media`` sebelah dalam. Sifat dari kelas sebelah dalam menentukan persyaratan.

source: Here's a simple example::
id: Ini adalah sebuah contoh sederhana::

source: Here's a list of all possible ``Media`` options. There are no required options.
id: Ini adalah daftar dari semua kemungkinan pilihan ``Media``. Tidak ada pilihan wajib.

source: If this last CSS definition were to be rendered, it would become the following HTML::
id: Jika pengertian CSS terakhir ini dibangun, itu akan menjadi HTML berikut::

source: ``Media`` as a dynamic property
id: ``Media`` sebagai sifat dinamis

source: But if :setting:`STATIC_URL` is ``'http://static.example.com/'``::
id: Tetapi jika :setting:`STATIC_URL` adalah ``'http://static.example.com/'``::

source: ``Media`` objects
id: Obyek ``Media``

source: However, ``Media`` objects have some other interesting properties.
id: Bagaimanapun, obyek ``Media`` mempunyai beberapa milik menarik lain.

source: Combining ``Media`` objects
id: Memadukan obyek ``Media``

source: ``Media`` on Forms
id: ``Media`` pada Form

source: Creating forms from models
id: Membuat formulir dari model

source: Each model field has a corresponding default form field. For example, a ``CharField`` on a model is represented as a ``CharField`` on a form. A model ``ManyToManyField`` is represented as a ``MultipleChoiceField``. Here is the full list of conversions:
id: Setiap bidang model mempunyai biadng formulir awalan sesuai. Sebagai contoh, sebuah ``CharField`` pada sebuah model adalah diwakili sebagai ``CharField`` pada formulir. Sebuah model ``ManyToManyField`` diwakilkan sebagai sebuah ``MultipleChoiceField``.Ini adalah daftar penuh dari perubahan:

source: Model field
id: Bidang Model

source: Form field
id: Bidang Formulir

source: Not represented in the form
id: Tidak muncul di formulir

source: :class:`~django.forms.IntegerField` with ``min_value`` set to -9223372036854775808 and ``max_value`` set to 9223372036854775807.
id: :class:`~django.forms.IntegerField` dengan ``min_value`` disetel ke -9223372036854775808 dan ``max_value`` disetel ke 9223372036854775807.

source: :class:`~django.forms.ModelChoiceField` (see below)
id: :class:`~django.forms.ModelChoiceField` (lihat dibawah)

source: :class:`~django.forms.ModelMultipleChoiceField` (see below)
id: :class:`~django.forms.ModelMultipleChoiceField` (lihat dibawah)

source: :class:`~django.forms.CharField` with ``widget=forms.Textarea``
id: :class:`~django.forms.CharField` dengan ``widget=forms.Textarea``

source: ``ForeignKey`` is represented by ``django.forms.ModelChoiceField``, which is a ``ChoiceField`` whose choices are a model ``QuerySet``.
id: ``ForeignKey`` diwakili oleh ``django.forms.ModelChoiceField``, yaitu sebuah ``ChoiceField`` yang pilihan-pilihan adalah sebuah model ``QuerySet``.

source: ``ManyToManyField`` is represented by ``django.forms.ModelMultipleChoiceField``, which is a ``MultipleChoiceField`` whose choices are a model ``QuerySet``.
id: ``ManyToManyField`` diwakili oleh ``django.forms.ModelMultipleChoiceField``, dimana ``MultipleChoiceField`` yang pilihan-pilihannya adalah sebuah model ``QuerySet``.

source: In addition, each generated form field has attributes set as follows:
id: Sebagai tambahan, setiap bidang formulir dibangkitkan mempunyai atribut disetel sebagai berikut:

source: If the model field has ``blank=True``, then ``required`` is set to ``False`` on the form field. Otherwise, ``required=True``.
id: Jika bidang model mempunyai ``blank=True``, maka ``required`` disetel ke ``False`` pada bidang formulir. Sebaliknya ``required=True``.

source: Consider this set of models::
id: Pertimbangkan kumpulan model ini::

source: Validation on a ``ModelForm``
id: Pengesahan pada sebuah ``ModelForm``

source: There are two main steps involved in validating a ``ModelForm``:
id: Terdapat dua langkah utama dilibatkan dalam ``ModelForm``:

source: :ref:`Validating the model instance <validating-objects>`
id: :ref:`Validating the model instance 1`

source: Overriding the clean() method
id: Menimpa metode clean()

source: Interaction with model validation
id: Interaksi dengan pengecekan model

source: As part of the validation process, ``ModelForm`` will call the ``clean()`` method of each field on your model that has a corresponding field on your form. If you have excluded any model fields, validation will not be run on those fields. See the :doc:`form validation </ref/forms/validation>` documentation for more on how field cleaning and validation work.
id: Sebagai bagian dari pengolahan pengesahan. ``ModelForm`` akan memanggil metode ``clean()`` untuk setiap bidang pada model anda yang mempunyai bidang sesuai pada formulir anda. Jika anda telah tidak menyertakan bidang model apapun, pengesahan tidak akan berjalan pada bidang-bidang tersebut. Lihat dokumentasi :doc:`form validation 1`untuk lebih pada bagimana bidang membersihkan dan pengesahan bekerja.

source: The model's ``clean()`` method will be called before any uniqueness checks are made. See :ref:`Validating objects <validating-objects>` for more information on the model's ``clean()`` hook.
id: Metode ``clean()`` model akan dipanggil sebelum pemeriksanaan keunikan apapun dibuat. Lihat :ref:`Validating objects <validating-objects>` untuk informasi lebih pada tautan ``clean()`` model.

source: Considerations regarding model's ``error_messages``
id: Pertimbangan mengenai ``error_messages`` model

source: Error messages defined on :attr:`model fields <django.db.models.Field.error_messages>` are only used when the ``ValidationError`` is raised during the :ref:`model validation <validating-objects>` step and no corresponding error messages are defined at the form level.
id: Pesan-pesan kesalahan ditentukan pada :attr:`model fields <django.db.models.Field.error_messages>`hanya digunakan ketika ``ValidationError`` dimunculkan selama langkah :ref:`model validation 1` dan tidak ada pesan kesalahan sesuai ditentukan pada tingkatan formulir.

source: The ``save()`` method
id: Cara ``save()``

source: To work around this problem, every time you save a form using ``commit=False``, Django adds a ``save_m2m()`` method to your ``ModelForm`` subclass. After you've manually saved the instance produced by the form, you can invoke ``save_m2m()`` to save the many-to-many form data. For example:
id: Untuk memecahkan masalah ini, setiap kali anda menyimpan sebuah formulir menggunakan ``commit=False``, Django menambahkan sebuah metode ``save_m2m()`` ke subkelas ``ModelForm``. Setelah anda telah secara manual menyimpan instance dihasilkan oleh formulir, anda dapat meminta ``save_m2m()`` untuk menyimpan data formulir many-to-many. Sebagai contoh:

source: Selecting the fields to use
id: Memilih bidang untuk digunakan

source: Set the ``fields`` attribute to the special value ``'__all__'`` to indicate that all fields in the model should be used. For example::
id: Setel atribut ``fields`` ke nilai khusus ``'__all__'`` untuk menunjukkan bahwa semua bidang-bidang dalam model harus digunakan. Sebagai contoh::

source: Set the ``exclude`` attribute of the ``ModelForm``s inner ``Meta`` class to a list of fields to be excluded from the form.
id: Setel atribut ``exclude`` dari kelas ``Meta`` sebelah dalam ``ModelForm`` pada daftar dari bidang untuk tidak disertakan dari formulir.

source: Alternatively, you can use ``save(commit=False)`` and manually set any extra required fields::
id: Cara lain, anda dapat menggunakan ``save(commit=False)`` dan secara manul menyetel bidang lain yang dibutuhkan::

source: Overriding the default fields
id: Mengesampingan nilai awal

source: To specify a custom widget for a field, use the ``widgets`` attribute of the inner ``Meta`` class. This should be a dictionary mapping field names to widget classes or instances.
id: Untuk menentukan widget penyesuaian untuk bidang, gunakan atribut ``widgets`` dari kelas ``Meta`` sebelah dalam. Ini harus berupa nama bidang pemetaan kamus pada kelas widget atau instance.

source: Similarly, you can specify the ``labels``, ``help_texts`` and ``error_messages`` attributes of the inner ``Meta`` class if you want to further customize a field.
id: Demikian pula, anda dapat menentukan atribut ``labels``, ``help_texts`` dan ``error_messages`` dari kelas ``Meta`` sebelah dalam jika anda ingin lebih lanjut menyesuaikan bidang.

source: Similarly, fields defined declaratively do not draw their attributes like ``max_length`` or ``required`` from the corresponding model. If you want to maintain the behavior specified in the model, you must set the relevant arguments explicitly when declaring the form field.
id: Mirip, bidang-bidang ditentukan menerangkan tidak menggambar atribut mereka seperti ``max_length`` atau ``required`` dari model sesuai Jika anda ingin merawat perilaku ditentukan dalam model, anda harus mensetel argumen terkait secara jelas ketika menyatakan bidang formulir.

source: For example, if the ``Article`` model looks like this::
id: Sebagai contoh, jika model ``Article`` kelihatan seperti ini::

source: You must ensure that the type of the form field can be used to set the contents of the corresponding model field. When they are not compatible, you will get a ``ValueError`` as no implicit conversion takes place.
id: Anda harus memastikan bahwa jenis dari biadng formulir dapat digunakan menyetel isi dari bidang model sesuai. Ketika mereka tidak sepadan, anda akan mendapatkan ``ValueError`` sebagai peruahan bukan tersirat berlangsung.

source: See the :doc:`form field documentation </ref/forms/fields>` for more information on fields and their arguments.
id: Lihat :doc:`dokumentasi bidang formulir </ref/forms/fields>` untuk lebih informasi pada bidang dan argumen mereka.

source: Form inheritance
id: Warisan formulir

source: You can also subclass the parent's ``Meta`` inner class if you want to change the ``Meta.fields`` or ``Meta.exclude`` lists::
id: Anda dapat juga mensubkelaskan kelas sebelah dalam ``Meta`` induk jika anda ingin merubah daftar ``Meta.fields`` atau ``Meta.exclude``::

source: There are a couple of things to note, however.
id: Terdapat sepasang hal untuk dicatat, bagaimanapun.

source: Providing initial values
id: Menyediakan nilai awal

source: ModelForm factory function
id: Fungsi pabrik ModelForm

source: You can create forms from a given model using the standalone function :func:`~django.forms.models.modelform_factory`, instead of using a class definition. This may be more convenient if you do not have many customizations to make::
id: Anda dapat membuat formulir dari model yang diberikan menggunakan fungsi berdiri sendiri :func:`~django.forms.models.modelform_factory`,daripada menggunakan pengertian kelas. Ini mungkin lebih nyaman jika anda tidak memiliki banyak penyesuaian untuk dibuat::

source: This can also be used to make simple modifications to existing forms, for example by specifying the widgets to be used for a given field::
id: Ini juga dapat digunakan untuk membuat perubahan sederhana pada formulir yang ada, sebagai contoh dengan menentukan widget untuk digunakan untuk bidang yang diberikan::

source: The fields to include can be specified using the ``fields`` and ``exclude`` keyword arguments, or the corresponding attributes on the ``ModelForm`` inner ``Meta`` class. Please see the ``ModelForm`` :ref:`modelforms-selecting-fields` documentation.
id: Bidang-bidang untuk disertakan dapat ditentukan menggunakan argumen katakunci ``fields`` dan ``exclude``, atau atribut-atribut sesuai pada ``ModelForm`` didalam kelas ``Meta``. Harap lihat dokumentasi :ref:`modelforms-selecting-fields` ``ModelForm``.

source: Changing the form
id: Merubah formulir

source: Then, pass your model form to the factory function::
id: Kemudian, lewati formulir model anda ke fungsi pabrik::

source: Limiting the number of editable objects
id: Membatasi angka dari obyek dapat di sunting

source: ``max_num`` does not prevent existing objects from being displayed::
id: ``max_num`` tidak mencegah obyek yang ada dari menjadi ditampilkan::

source: Overriding ``clean()`` on a ``ModelFormSet``
id: Menimpa ``clean()`` pada sebuah ``ModelFormSet``

source: Using a custom queryset
id: Menggunakan queryset penyesuaian

source: As stated earlier, you can override the default queryset used by the model formset::
id: Seperti dinyatakan sebelumnya, anda dapat menimpa queryset awalan digunakan oleh formset model::

source: Note that we pass the ``queryset`` argument in both the ``POST`` and ``GET`` cases in this example.
id: Catat bahwa kami melewatkan argumen ``queryset`` dalam kedua kasus ``POST`` dan ``GET`` dalam contoh ini.

source: Using the formset in the template
id: Menggunakan formset dalam cetakan

source: There are three ways to render a formset in a Django template.
id: Ada tiga cara untuk mengirim sebuah formset dalam sebuah cetakan Django.

source: First, you can let the formset do most of the work::
id: Pertama, anda dapat membiarkan formset melakukan sebagian besar pekerjaan::

source: Second, you can manually render the formset, but let the form deal with itself::
id: Kedua, anda dapat secara manual membangun formset, tetapi membiarkan formulir berurusan dengan itu sendiri::

source: Third, you can manually render each field::
id: Ketiga, anda dapat secara manual membangun setiap bidang::

source: Inline formsets
id: Formset berderet

source: Inline formsets is a small abstraction layer on top of model formsets. These simplify the case of working with related objects via a foreign key. Suppose you have these two models::
id: Formset berderet adalah lapisan abstraksi kecil pada atas formset model. Ini menyederhanakan kasus dari bekerja dengan obyek-obyek terkait melalui sebuah foreign key. Seandainya anda mempunyai dua model ini::

source: :func:`~django.forms.models.inlineformset_factory` uses :func:`~django.forms.models.modelformset_factory` and marks ``can_delete=True``.
id: :func:`~django.forms.models.inlineformset_factory` menggunakan :func:`~django.forms.models.modelformset_factory` dan menandai ``can_delete=True``.

source: Overriding methods on an ``InlineFormSet``
id: Metode menimpa pada ``InlineFormSet``

source: For example, if you want to override ``clean()``::
id: Sebagai contoh, jika anda ingin menimpa ``clean()``::

source: See also :ref:`model-formsets-overriding-clean`.
id: Lihat juga :ref:`model-formsets-overriding-clean`.

source: Then when you create your inline formset, pass in the optional argument ``formset``::
id: Kemudian ketika anda membuat formset berderet anda, lewatkan di argumen pilihan ``formset``::

source: More than one foreign key to the same model
id: Lebih dari satu foreign key pada model sama

source: To resolve this, you can use ``fk_name`` to :func:`~django.forms.models.inlineformset_factory`::
id: Untuk mengatasi ini, anda dapat menggunakan ``fk_name`` pada :func:`~django.forms.models.inlineformset_factory`::

source: Using an inline formset in a view
id: Menggunakan formset berderet di sebuah tampilan

source: Notice how we pass ``instance`` in both the ``POST`` and ``GET`` cases.
id: Perhatikan bagaimana kami melewatkan ``instance`` dalam kedua kasus ``POST`` dan ``GET``.

source: Specifying widgets to use in the inline form
id: Menentukan widget-widget untuk digunakan di formulir berderet

source: ``inlineformset_factory`` uses ``modelformset_factory`` and passes most of its arguments to ``modelformset_factory``. This means you can use the ``widgets`` parameter in much the same way as passing it to ``modelformset_factory``. See `Specifying widgets to use in the form with widgets`_ above.
id: ``inlineformset_factory`` menggunakan ``modelformset_factory`` dan melewatkan kebanyakan argumennya ke ``modelformset_factory``. Ini berarti anda dapat menggunakan parameter ``widgets`` dalam banyak cara yang sama ketika melewatkan itu ke ``modelformset_factory``. Lihat `Specifying widgets to use in the form with widgets`_ diatas.

source: Allowed HTTP methods
id: Cara HTTP yang diizinkan

source: Note that request methods should be in uppercase.
id: Catat bahwa cara diminta harus dalam huruf besar.

source: Conditional view processing
id: Pengolahan tampilan bersyarat

source: GZip compression
id: Pemampatan GZip

source: Vary headers
id: Beragam kepala

source: The decorators in :mod:`django.views.decorators.vary` can be used to control caching based on specific request headers.
id: Penghias dalam :mod:`django.views.decorators.vary` dapat digunakan untuk mengendalikan cache berdasarkan pada kepala permintaan khusus.
