Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: This example sets up two admin sites. On the first site, the ``Author`` and ``Publisher`` objects are exposed; ``Publisher`` objects have a tabular inline showing books published by that publisher. The second site exposes just publishers, without the inlines.
id: Contoh ini menyetel dua situs admin. Pada situs pertama, obyek-obyek ``Author`` dan ``Publisher`` dibuka; obyek-obyek ``Publisher`` mempunyai sebuah dibarisan datar menunjukkan buku-buku diterbitkan oleh penerbit. Situs kedua membuka hanya penerbit, tanpa barisan.

source: Using raw cursors with multiple databases
id: Menggunakan kursor mentah dengan banyak basisdata

source: If you are using more than one database you can use ``django.db.connections`` to obtain the connection (and cursor) for a specific database. ``django.db.connections`` is a dictionary-like object that allows you to retrieve a specific connection using its alias::
id: Jika anda menggunakan lebih dari satu basisdata anda dapat menggunakan ``django.db.connections`` untuk mengambil hubungan (dan kursor) untuk basisdata tertentu. ``django.db.connections`` adalah objek seperti-kamus yang mengizinkan anda mengambil hubungan tertentu menggunakan nama lainnya::

source: Limitations of multiple databases
id: Batasan dari banyak basisdata

source: Cross-database relations
id: Hubungan lintas-basisdata

source: Django doesn't currently provide any support for foreign key or many-to-many relationships spanning multiple databases. If you have used a router to partition models to different databases, any foreign key and many-to-many relationships defined by those models must be internal to a single database.
id: Django saat ini tidak menyediakan dukungan apapun untuk foreign key atau hubungan many-to-many menjangkau banyak basisdata. Jika anda telah menggunakan sebuah perute pada model sebagian ke basisdata berbeda, foreign key apapun dan hubungan many-to-many ditentukan oleh modek-model tersebut harus secara internal pada basisdata tunggal.

source: This is because of referential integrity. In order to maintain a relationship between two objects, Django needs to know that the primary key of the related object is valid. If the primary key is stored on a separate database, it's not possible to easily evaluate the validity of a primary key.
id: Ini karena dari kesatuan referensial. Untuk merawat hubungan diantara dua obyek, Django butuh mengetahui bahwa primary key dari obyek terkait adalah sah. Jika primary key disimpan pada basisdata terpisah, itu tidak mungkin dengan mudah menilai keabsahan primary key.

source: If you're using Postgres, Oracle, or MySQL with InnoDB, this is enforced at the database integrity level -- database level key constraints prevent the creation of relations that can't be validated.
id: Jika anda sedang menggunakan Postgres, Oracle, atau MySQL dengan InnoDB, ini dipaksa pada tingkat kesatuan basisdata -- batasan kunci tingkatan basisdata mencegah dari pembuatan dari hubungan yang tidak dapat disahkan.

source: However, if you're using SQLite or MySQL with MyISAM tables, there is no enforced referential integrity; as a result, you may be able to 'fake' cross database foreign keys. However, this configuration is not officially supported by Django.
id: Bagaimanapun, jika anda sedang menggunakan SQLite atay MySQL dengan tabel MyISAM, tidak ada pemaksaan kesatuan referensial; sebagai hasil, anda mungkin dapat me 'niru' foreign key basisdata. bagaimanapun, konfigurasi ini tidak secara resmi didukung oleh Django.

source: Behavior of contrib apps
id: Perilaku dari aplikasi bantuan

source: Several contrib apps include models, and some apps depend on others. Since cross-database relationships are impossible, this creates some restrictions on how you can split these models across databases:
id: Beberapa aplikasi bantuan termasuk model-model, dan beberapa aplikasi bergantung pada lainnya. Sejak hubungan silang-basisdata tidak dimungkinkan, ini membuat beberapa pembatasan pada bagaimana anda dapat memisahkan model-model ini terhadap basisdata:

source: each one of ``contenttypes.ContentType``, ``sessions.Session`` and ``sites.Site`` can be stored in any database, given a suitable router.
id: setiap satu dari ``contenttypes.ContentType``, ``sessions.Session`` dan ``sites.Site`` dapat disimpan dalam basisdata apapun, diberikan perute yang cocok.

source: ``auth`` models ``User``, ``Group`` and ``Permission`` are linked together and linked to ``ContentType``, so they must be stored in the same database as ``ContentType``.
id: Model-model ``auth`` ``User``, ``Group`` dan ``Permission`` dikaitkan bersama-sama dan dikaitkan pada ``ContentType``, sehingga mereka harus disimpan dalam basisdata sama sebagai ``ContentType``.

source: ``admin`` depends on ``auth``, so its models must be in the same database as ``auth``.
id: ``admin`` bergantung pada ``auth``, jadi modelnya harus di basisdata sama seperti ``auth``.

source: ``flatpages`` and ``redirects`` depend on ``sites``, so their models must be in the same database as ``sites``.
id: ``flatpages`` dan ``redirects`` bergantung pada ``sites``,jadi model-model mereka harus di basisdata yang sama seperti ``sites``.

source: In addition, some objects are automatically created just after :djadmin:`migrate` creates a table to hold them in a database:
id: Sebagai tambahan, beberapa obyek otomatis dibuat hanya setelah :djadmin:`migrate` membuat tabel untuk menahan mereka dalam basisdata:

source: a default ``Site``,
id: ``Site`` awal,

source: a ``ContentType`` for each model (including those not stored in that database),
id: sebuah ``ContentType`` untuk setiap model (termasuk itu tidak disimpan di basisdata itu),

source: three ``Permission`` for each model (including those not stored in that database).
id: tiga ``Permission`` untuk setiap model (termasuk itu tidak disimpan di basisdata itu),

source: For common setups with multiple databases, it isn't useful to have these objects in more than one database. Common setups include primary/replica and connecting to external databases. Therefore, it's recommended to write a :ref:`database router<topics-db-multi-db-routing>` that allows synchronizing these three models to only one database. Use the same approach for contrib and third-party apps that don't need their tables in multiple databases.
id: Untuk pengaturan umum dengan banyak basisdata, itu tidak berguna memiliki obyek-obyek ini dalam lebih dari satu basisdata. Pengaturan umum menyertakan utama/tiruan dan menghubungkan ke basisdata luar. Karena itu, itu dianjurkan untuk menulis :ref:`database router1` yang mengizinkan mensinkronkan ketiga model ini pada hanya satu basisdata. Gunakan pendekatan sama untuk aplikasi bantuan dan pihak-ketiga yang tidak butuh tabel mereka dalam banyak basisdata.

source: If you're synchronizing content types to more than one database, be aware that their primary keys may not match across databases. This may result in data corruption or data loss.
id: Jika anda sedang mensinkronkan jenis-jenis isi ke lebih dari satu basisdata, waspada bahwa primary key mereka mungkin tidak cocok terhadap basisdata. Ini mungkin menghasilkan kerusakan data atau kehilangan data.

source: Database access optimization
id: Optimisasi akses basisdata

source: Django's database layer provides various ways to help developers get the most out of their databases. This document gathers together links to the relevant documentation, and adds various tips, organized under a number of headings that outline the steps to take when attempting to optimize your database usage.
id: Lapisan basisdata Django menyediakan beragam cara membantu pengembang mendapatkan sebagian dari basisdata mereka. DOkumen ini mengumpulkan bersama-sama tautan ke dokumentasi bersangkutan, dan menambah beraagam tip, mengorganisasikan dibawah sejumlah dari kepala yang meringkaskan langkah-langkah diambil ketika berusaha mengoptimalkan penggunaan basisdata anda.

source: Profile first
id: Profil dahulu

source: Remember that you may be optimizing for speed or memory or both, depending on your requirements. Sometimes optimizing for one will be detrimental to the other, but sometimes they will help each other. Also, work that is done by the database process might not have the same cost (to you) as the same amount of work done in your Python process. It is up to you to decide what your priorities are, where the balance must lie, and profile all of these as required since this will depend on your application and server.
id: Ingat bahwa anda mungkin dioptimalkan untuk kecepatan atau memori atau keduanya, tergantung pada persyaraan anda. Terkadang mengoptimalkan untuk satu akan merugikan ke yang lain, tetapi terkadang mereka akan membantu satu sama lain. Juga, pekerjaan itu selesai oleh pengolahan basisdata mungkin tidak mempunyai biaya sama (kepada anda) seperti sama banyak dari pekerjaan selesai dalam pengolahan Python anda. Itu terserah anda memutuskan apa prioritas anda, dimana keseimbangan harus berbohong, dan profil semua dari ini seperti diwajibkan sejak ini akan bergantung pada aplikasi anda dan peladen.

source: With everything that follows, remember to profile after every change to ensure that the change is a benefit, and a big enough benefit given the decrease in readability of your code. **All** of the suggestions below come with the caveat that in your circumstances the general principle might not apply, or might even be reversed.
id: Dengan apapun yang mengikuti, ingat untuk menggambarkan raut muka setelah setiap perubahan untuk memastikan bahwa perubahan adalah menguntungkan, dan keuntungan cukup besar diberikan menurunkan dalam kesiapan kode anda. **Semua** dari saran-saran dibawah datang dengan surat keberatan yang dalam keadaan anda prinsip umum mungkin tidak berlaku, atau mungkin bahkan dibalikkan.

source: Use standard DB optimization techniques
id: Gunakan teknik-teknik optimalisasi DB standar

source: ...including:
id: ...termasuk:

source: Indexes_. This is a number one priority, *after* you have determined from profiling what indexes should be added. Use :attr:`Field.db_index <django.db.models.Field.db_index>` or :attr:`Meta.index_together <django.db.models.Options.index_together>` to add these from Django. Consider adding indexes to fields that you frequently query using :meth:`~django.db.models.query.QuerySet.filter()`, :meth:`~django.db.models.query.QuerySet.exclude()`, :meth:`~django.db.models.query.QuerySet.order_by()`, etc. as indexes may help to speed up lookups. Note that determining the best indexes is a complex database-dependent topic that will depend on your particular application. The overhead of maintaining an index may outweigh any gains in query speed.
id: Indexes_. Ini adalah prioritas nomor satu, *setelah* anda menentukan dari menggambarkan indeks apa harus ditambahkan. Gunakan :attr:`Field.db_index <django.db.models.Field.db_index>` atau :attr:`Meta.index_together <django.db.models.Options.index_together>` untuk menambah ini dari Django. Pertimbangkan menambahkan indeks ke bidang yang anda sangat sering meminta menggunakan :meth:`~django.db.models.query.QuerySet.filter()`, :meth:`~django.db.models.query.QuerySet.exclude()`, :meth:`~django.db.models.query.QuerySet.order_by()`, dll. ketika indeks mungkin membantu anda mempercepat pencarian. Catat bahwa menentukan indeks terbaik adalah topik berdiri-sendiri-basisdata rumit yang akan bergantung pada aplikasi tertentu anda. Diatas dari merawat sebuah indeks mungkin lebih penting dari keuntungan dalam kecepatan.

source: Appropriate use of field types.
id: Penggunaan sesuai dari jenis-jenis bidang

source: We will assume you have done the obvious things above. The rest of this document focuses on how to use Django in such a way that you are not doing unnecessary work. This document also does not address other optimization techniques that apply to all expensive operations, such as :doc:`general purpose caching </topics/cache>`.
id: Kami akan menganggap anda telah melakukan hal-hal tidak jelas diatas. Sisa dari dokumen ini fokus pada bagaimana menggunakan Django dalam seperti itu yang anda tidak melakukan pekerjaan tidak penting. Dokumen ini tidak mengalamatkan teknik-teknik optimalisasi lain yang berlaku ke semua tindakan, seperti :doc:`general purpose caching 1`.

source: Understand ``QuerySet``\s
id: Memahami ``QuerySet``

source: Understanding :doc:`QuerySets </ref/models/querysets>` is vital to getting good performance with simple code. In particular:
id: Memahami :doc:`QuerySets </ref/models/querysets>` adalah vital untuk mendapatkan penampilan baik dengan kode sederhana. Khususnya:

source: Understand ``QuerySet`` evaluation
id: Memahami penilaian ``QuerySet``

source: To avoid performance problems, it is important to understand:
id: Untuk menghindari masalah penampilan, sangatlah penting memahami:

source: that :ref:`QuerySets are lazy <querysets-are-lazy>`.
id: itu :ref:`QuerySets malas <querysets-are-lazy>`.

source: when :ref:`they are evaluated <when-querysets-are-evaluated>`.
id: ketika :ref:`mereka dinilai <when-querysets-are-evaluated>`.

source: how :ref:`the data is held in memory <caching-and-querysets>`.
id: bagaimana :ref:`data ditahan dalam memori <caching-and-querysets>`.

source: Understand cached attributes
id: Memahami atribut tembolok

source: As well as caching of the whole ``QuerySet``, there is caching of the result of attributes on ORM objects. In general, attributes that are not callable will be cached. For example, assuming the :ref:`example Weblog models <queryset-model-example>`::
id: Seperti menyimpan sementara keseluruhan ``QuerySet``, ada penyimpanan sementara dari hasil atribut pada obyek ORM. Secara umum, atribut-atribut tidak dapat dipanggil akan disimpan sementara. Sebagai contoh, menganggap :ref:`example Weblog models 1`::

source: But in general, callable attributes cause DB lookups every time::
id: Tetapi secara umum, atribut callable menyebabkan pencarian DB setiap waktu::

source: Be careful when reading template code - the template system does not allow use of parentheses, but will call callables automatically, hiding the above distinction.
id: Hati-hati ketika membaca kode cetakan - sistem cetakan tidak mengizinkan penggunaan tanda kurun, tetapi akan memanggil callable secara otomatis, memnyembunyikan perbedaan diatas.

source: Be careful with your own custom properties - it is up to you to implement caching when required, for example using the :class:`~django.utils.functional.cached_property` decorator.
id: Berhati-hatilan dengan sifat penyesuaian anda sendiri - itu terserah anda menerapkan cache ketika dibutuhkan, sebagai contoh menggunakan penghias :class:`~django.utils.functional.cached_property`.

source: Use the ``with`` template tag
id: Gunakan etiket cetakan ``with``

source: To make use of the caching behavior of ``QuerySet``, you may need to use the :ttag:`with` template tag.
id: Untuk menggunakan perilaku cache dari ``QuerySet``, anda mungkin butuh menggunakan etiket cetakan :ttag:`with`.

source: Use ``iterator()``
id: Gunakan ``iterator()``

source: When you have a lot of objects, the caching behavior of the ``QuerySet`` can cause a large amount of memory to be used. In this case, :meth:`~django.db.models.query.QuerySet.iterator()` may help.
id: Ketika anda mempunyai banyak obyek, perilaku cache dari ``QuerySet`` dapat menyebabkan sejumlah besar memori digunakan. Dalam kasus ini, :meth:`~django.db.models.query.QuerySet.iterator()` mungkin membantu.

source: Do database work in the database rather than in Python
id: Lakukan pekerjaan basisdata di basisdata daripada di Python

source: For instance:
id: Sebagai contoh:

source: At the most basic level, use :ref:`filter and exclude <queryset-api>` to do filtering in the database.
id: Pada paling tingkat dasar, gunakan :ref:`filter and exclude <queryset-api>` melakukan penyaringan di basisdata

source: Use :class:`F expressions <django.db.models.F>` to filter based on other fields within the same model.
id: Gunakan :class:`F expressions <django.db.models.F>` untukmenyaring berdasarkan pada bidang-bidang lain dalam model sama.

source: Use :doc:`annotate to do aggregation in the database </topics/db/aggregation>`.
id: Gunakan :doc:`annotate to do aggregation in the database </topics/db/aggregation>`.

source: If these aren't enough to generate the SQL you need:
id: Jika ini tidak cukup membangkitkan SQL yang anda butuhkan:

source: Use ``RawSQL``
id: Gunakan ``RawSQL``

source: A less portable but more powerful method is the :class:`~django.db.models.expressions.RawSQL` expression, which allows some SQL to be explicitly added to the query. If that still isn't powerful enough:
id: Sedikit ringan tetapi metode lebih kuat adalah pernyataan :class:`~django.db.models.expressions.RawSQL`, yangmengizinkan beberapa SQL secara jelas ditambahkan ke permintaan. Jika itu masih tidak cukup kuat:

source: Use raw SQL
id: Gunakan SQL mentah

source: Write your own :doc:`custom SQL to retrieve data or populate models </topics/db/sql>`. Use ``django.db.connection.queries`` to find out what Django is writing for you and start from there.
id: Tulis :doc:`custom SQL to retrieve data or populate models 1` anda sendiri. Gunakan ``django.db.connection.queries`` untuk menemukan apa yang Django sedang tulis untuk anda dan mulai dari sana.

source: Retrieve individual objects using a unique, indexed column
id: Mengambil obyek tersendiri menggukan sebuah unik, kolom indeks

source: There are two reasons to use a column with :attr:`~django.db.models.Field.unique` or :attr:`~django.db.models.Field.db_index` when using :meth:`~django.db.models.query.QuerySet.get` to retrieve individual objects. First, the query will be quicker because of the underlying database index. Also, the query could run much slower if multiple objects match the lookup; having a unique constraint on the column guarantees this will never happen.
id: Ada dua alasan untuk menggunakan kolom dengan :attr:`~django.db.models.Field.unique` atau :attr:`~django.db.models.Field.db_index`ketika menggunakan :meth:`~django.db.models.query.QuerySet.get` untuk mengambil obyek tersendiri. Pertama, permintaan akan lebih cepat karena indeks basisdata pokok. Juga, permintaan dapat berjalan lebih lambat jika banyak obyek mencocokan pencarian; memiliki batasan unik pada kolom menjamin ini tidak pernah terjadi.

source: So using the :ref:`example Weblog models <queryset-model-example>`::
id: Jadi menggunakan :ref:`example Weblog models <queryset-model-example>`::

source: will be quicker than:
id: akan lebih cepat daripada:

source: because ``id`` is indexed by the database and is guaranteed to be unique.
id: karena ``id`` diindeks oleh basisdata dan dijamin menjadi unik.

source: Doing the following is potentially quite slow:
id: Melakukan berikut berpotensi sangat lambat:

source: First of all, ``headline`` is not indexed, which will make the underlying database fetch slower.
id: Pertama-tama, ``headline`` tidak diindeks, yang akan membuat pengambilan pokok basisdata lebih lambat.

source: Second, the lookup doesn't guarantee that only one object will be returned. If the query matches more than one object, it will retrieve and transfer all of them from the database. This penalty could be substantial if hundreds or thousands of records are returned. The penalty will be compounded if the database lives on a separate server, where network overhead and latency also play a factor.
id: Kedua, pencarian tidak menjamin hanya satu obyek akan dikembalikan. Jika permintaan cocok lebih dari satu obyek, itu akan mengambil dan memindahkan semua dari mereka dari basisdata. Hukuman ini dapat besar jika ratusan atau ribuan dari rekaman dikembalikan. Hukuman akan digabungkan jika basisdata berada pada peladen berbeda, dimana overhead jaringan dan latensi memainkan faktor.

source: Retrieve everything at once if you know you will need it
id: Mengambil semuanya sekaligus jika anda mengetahui anda akan membutuhkannya

source: Hitting the database multiple times for different parts of a single 'set' of data that you will need all parts of is, in general, less efficient than retrieving it all in one query. This is particularly important if you have a query that is executed in a loop, and could therefore end up doing many database queries, when only one was needed. So:
id: Mengenai basisdata beberapa kali untuk bagian-bagian berbeda dari 'set' tunggal data yang anda akan butuh semua bagian, secara umum, kurang efisien dari mengambil itu semua dalam satu permintaan. Ini khususnya penting jika anda mempunyai sebuah permintaan yang dijalankan dalam putaran, dan dapat karena itu berakhir melakukan banyak permintaan basisdata, ketika hanya satu dibutuhkan. Jadi:

source: Use ``QuerySet.select_related()`` and ``prefetch_related()``
id: Gunakan ``QuerySet.select_related()`` dan ``prefetch_related()``

source: Understand :meth:`~django.db.models.query.QuerySet.select_related` and :meth:`~django.db.models.query.QuerySet.prefetch_related` thoroughly, and use them:
id: Memahami :meth:`~django.db.models.query.QuerySet.select_related` dan :meth:`~django.db.models.query.QuerySet.prefetch_related` sepenuhnya, dan menggunakan mereka:

source: in :doc:`managers and default managers </topics/db/managers>` where appropriate. Be aware when your manager is and is not used; sometimes this is tricky so don't make assumptions.
id: dalam :doc:`managers and default managers 1` dimana sesuai. Waspada ketika pengelola anda sedang dan tidak digunakan; terkadang ini rumit jadi jangan membuat prasangka.

source: in view code or other layers, possibly making use of :func:`~django.db.models.prefetch_related_objects` where needed.
id: dalam melihat kode atau lapisan-lapisan lain, kemungkinan membuat menggunaan dari :func:`~django.db.models.prefetch_related_objects` ketika dibutuhkan.

source: Don't retrieve things you don't need
id: Jangan mengambil hal yang tidak anda butuhkan

source: Use ``QuerySet.values()`` and ``values_list()``
id: Gunakan ``QuerySet.values()`` dan ``values_list()``

source: When you just want a ``dict`` or ``list`` of values, and don't need ORM model objects, make appropriate usage of :meth:`~django.db.models.query.QuerySet.values()`. These can be useful for replacing model objects in template code - as long as the dicts you supply have the same attributes as those used in the template, you are fine.
id: Ketika anda hanya ingin nilai-nilai ``dict`` atau ``list``, dan tidak butuh obyek model ORM, buat penggunaan sesuai dari :meth:`~django.db.models.query.QuerySet.values()`.Ini dapat berguna untuk mengganti obyek model dalam kode cetakan - selama dictionary anda sokong mempuyai atribut sama seperti itu digunakan dalam cetakan, anda baik-baik saja.

source: Use ``QuerySet.defer()`` and ``only()``
id: Gunakan ``QuerySet.defer()`` dan ``only()``

source: Use :meth:`~django.db.models.query.QuerySet.defer()` and :meth:`~django.db.models.query.QuerySet.only()` if there are database columns you know that you won't need (or won't need in most cases) to avoid loading them. Note that if you *do* use them, the ORM will have to go and get them in a separate query, making this a pessimization if you use it inappropriately.
id: Gunakan :meth:`~django.db.models.query.QuerySet.defer()` dan :meth:`~django.db.models.query.QuerySet.only()`jika ada kolom basisdata anda ketahui bahwa anda tidak butuh (atau tidak butuh dalam kebanyakan kasus) untuk menghindari memuatkan mereka. Catat bahwa jika anda *melakukan* menggunakan mereka, ORM akan harus pergi dan mendapatkan mereka dalam permintaan terpisah, membuat ini pesimis jika anda menggunakan itu secara tidak benar.
