Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: If you don't want to use the built-in views, but want the convenience of not having to write forms for this functionality, the authentication system provides several built-in forms located in :mod:`django.contrib.auth.forms`:
id: Jika anda tidak ingin menggunakan tampilan siap-pakai, tetapi ingin dengan meyakinkan tidak menulis formulir untuk kegunaan ini, sistem autentifikasi menyediakan beberapa formulir siap-pakai ditempatkan di :mod:`django.contrib.auth.forms`:

source: The built-in authentication forms make certain assumptions about the user model that they are working with. If you're using a :ref:`custom user model <auth-custom-user>`, it may be necessary to define your own forms for the authentication system. For more information, refer to the documentation about :ref:`using the built-in authentication forms with custom user models <custom-users-and-the-built-in-auth-forms>`.
id: Formulir autentifikasi siap-pakai membuat pendapat tertentu tentang model user yang mereka bekerja dengannya. Jika anda sedang menggunakan sebuah :ref:`custom user model <auth-custom-user>`, itu mungkin diperlukan menentukan formulir anda sendiri untuk sistem autentifikasi. Untuk informasi lebih, mengacu pada dokumentasi tentang :ref:`using the built-in authentication forms with custom user models <custom-users-and-the-built-in-auth-forms>`.

source: A form used in the admin interface to change a user's password.
id: Sebuah formulir digunakan di antarmuka admin untuk merubah sandi pengguna.

source: Takes the ``user`` as the first positional argument.
id: Mengambil argumen ``user`` sebagai argumen penempatan pertama.

source: A form for logging a user in.
id: Sebuah formulir untuk pengguna masuk.

source: Takes ``request`` as its first positional argument, which is stored on the form instance for use by sub-classes.
id: Mengambil ``request`` sebagai argumen penempatan pertama, yang disimpan pada instance formulir untuk digunakan oleh sub-kelas.

source: By default, ``AuthenticationForm`` rejects users whose ``is_active`` flag is set to ``False``. You may override this behavior with a custom policy to determine which users can log in. Do this with a custom form that subclasses ``AuthenticationForm`` and overrides the ``confirm_login_allowed()`` method. This method should raise a :exc:`~django.core.exceptions.ValidationError` if the given user may not log in.
id: Secara awalan, ``AuthenticationForm`` menolak pengguna yang bendera ``is_active`` disetel menjadi ``False``. Anda mungkin menimpa kebiasaan ini dengan kebijakan penyesuaian untuk menentukan pengguna mana dapat masuk. Lakukan ini dengan formulir penyesuaian yang mensubkelas ``AuthenticationForm`` dan menimpa metode ``confirm_login_allowed()``. Metode ini harus memunculkan :exc:`~django.core.exceptions.ValidationError` jika pengguna yang diberikan tidak masuk.

source: For example, to allow all users to log in regardless of "active" status::
id: Sebagai contoh, untuk mengizinkan semua pengguna masuk tanpa memperhatikan keadaan "active"::

source: Or to allow only some active users to log in::
id: Atau mengizinkan hanya beberapa pengguna aktif untuk masuk::

source: A form for allowing a user to change their password.
id: Sebuah formulir untuk mengizinkan seorang pengguna merubah sandi mereka.

source: A form for generating and emailing a one-time use link to reset a user's password.
id: Sebuah formulir untuk membangkitkan dan mensurelkan tautan penggunaan satu-kali untuk menyetel kembali sandi pengguna.

source: Uses the arguments to send an ``EmailMultiAlternatives``. Can be overridden to customize how the email is sent to the user.
id: Menggunakan argumen untuk mengirimkan sebuah ``EmailMultiAlternatives``. Dapat ditimpa untuk menyesuaikan bagaimana surel dikirim ke pengguna.

source: Parameters
id: Parameter

source: the template for the subject.
id: cetakan untuk subyek.

source: the template for the email body.
id: cetakan untuk badan surel.

source: context passed to the ``subject_template``, ``email_template``, and ``html_email_template`` (if it is not ``None``).
id: konteks dilewatkan ke ``subject_template``, ``email_template``, dan ``html_email_template`` (jika itu bukan ``None``).

source: the sender's email.
id: surel pengirim

source: the email of the requester.
id: surel dari peminta.

source: the template for the HTML body; defaults to ``None``, in which case a plain text email is sent.
id: cetakan untuk badan HTML; awalan menjadi ``None``, dimana kasus sebuah surel teks polos dikirim.

source: By default, ``save()`` populates the ``context`` with the same variables that :class:`~django.contrib.auth.views.PasswordResetView` passes to its email context.
id: Secara awalan, ``save()`` mengumpulkan ``context`` dengan variabel sama yang :class:`~django.contrib.auth.views.PasswordResetView` melewatkan ke konteks surelnya.

source: A form that lets a user change their password without entering the old password.
id: Formulir yang membiarkan pengguma merubah sandi mereka tanpa memasukkan sandi lama.

source: A form used in the admin interface to change a user's information and permissions.
id: Sebuah formulir digunakan di antarmuka admin untuk merubah infromasi dan perizinan pengguna.

source: A :class:`~django.forms.ModelForm` for creating a new user.
id: Sebuah :class:`~django.forms.ModelForm` untuk membuat pengguna baru.

source: It has three fields: ``username`` (from the user model), ``password1``, and ``password2``. It verifies that ``password1`` and ``password2`` match, validates the password using :func:`~django.contrib.auth.password_validation.validate_password`, and sets the user's password using :meth:`~django.contrib.auth.models.User.set_password()`.
id: Itu mempunyai tiga bidang: ``username`` (dari model user), ``password1``, dan ``password2``. Itu memeriksa bahwa ``password1`` dan ``password2`` cocok, mensahkan sandi menggunakan :func:`~django.contrib.auth.password_validation.validate_password`, dan menyetel sandi pengguna menggunakan :meth:`~django.contrib.auth.models.User.set_password()`.

source: Authentication data in templates
id: Pembuktian keaslian data di cetakan

source: The currently logged-in user and their permissions are made available in the :doc:`template context </ref/templates/api>` when you use :class:`~django.template.RequestContext`.
id: Pengguna masuk saat ini dan perizinan mereka dibuat tersedia di :doc:`template context </ref/templates/api>` ketika anda menggunakan :class:`~django.template.RequestContext`.

source: Technicality
id: Secara teknis

source: Technically, these variables are only made available in the template context if you use :class:`~django.template.RequestContext` and the ``'django.contrib.auth.context_processors.auth'`` context processor is enabled. It is in the default generated settings file. For more, see the :ref:`RequestContext docs <subclassing-context-requestcontext>`.
id: Secara teknis, variabel-variabel ini hanya dibuat tersedia di konteks cetakan jika anda menggunakan pengolah konteks :class:`~django.template.RequestContext` dan ``'django.contrib.auth.context_processors.auth'`` adalah diadakan. Itu berada di berkas pengaturan dibangkitkan awalan. Untuk lebih, lihat :ref:`RequestContext docs <subclassing-context-requestcontext>`.

source: Users
id: Pengguna

source: When rendering a template :class:`~django.template.RequestContext`, the currently logged-in user, either a :class:`~django.contrib.auth.models.User` instance or an :class:`~django.contrib.auth.models.AnonymousUser` instance, is stored in the template variable ``{{ user }}``:
id: Ketika membangun sebuah cetakan :class:`~django.template.RequestContext`, pengguna masuk saat ini, antara instance :class:`~django.contrib.auth.models.User` atau instance :class:`~django.contrib.auth.models.AnonymousUser`, disimpan di variabel cetakan ``{{ user }}``:

source: This template context variable is not available if a ``RequestContext`` is not being used.
id: Variabel konteks cetakan ini tidak tersedia jika sebuah ``RequestContext`` tidak sedang digunakan.

source: Permissions
id: Hak akses

source: The currently logged-in user's permissions are stored in the template variable ``{{ perms }}``. This is an instance of ``django.contrib.auth.context_processors.PermWrapper``, which is a template-friendly proxy of permissions.
id: Perizinan pengguna masuk saat ini disimpan di variabel cetakan ``{{ perms }}``. Ini adalah sebuah instance dari ``django.contrib.auth.context_processors.PermWrapper``, yaitu sebuah proxy cetakan-ramah dari perizinan.

source: Evaluating a single-attribute lookup of ``{{ perms }}`` as a boolean is a proxy to :meth:`User.has_module_perms() <django.contrib.auth.models.User.has_module_perms>`. For example, to check if the logged-in user has any permissions in the ``foo`` app::
id: Menilai pencarian atribut-tunggal dari ``{{ perms }}``sebagai boolean adalah wakil pada :meth:`User.has_module_perms() <django.contrib.auth.models.User.has_module_perms>`.Sebagai contoh, untuk memeriksa jika pengguna masuk mempunyai perizinan apapun dalam aplikasi ``foo``::

source: Evaluating a two-level-attribute lookup as a boolean is a proxy to :meth:`User.has_perm() <django.contrib.auth.models.User.has_perm>`. For example, to check if the logged-in user has the permission ``foo.can_vote``::
id: Menilai penacrian atribua-tingkat-dua sebagai boolean adalah wakil pada :meth:`User.has_perm() <django.contrib.auth.models.User.has_perm>`. Sebagai contoh, untuk memeriksa jika pengguna masuk mempunyai perizinan ``foo.can_vote``::

source: Here's a more complete example of checking permissions in a template:
id: Ini adalah beberapa contoh lengkap dari perizinan pemeriksaan dalam sebuah cetakan:

source: It is possible to also look permissions up by ``{% if in %}`` statements. For example:
id: Itu memungkinkan juga mencari perizinan dengan pernyataan ``{% if in %}``. Sebagai contoh:

source: Managing users in the admin
id: Mengelola pengguna di admin

source: When you have both ``django.contrib.admin`` and ``django.contrib.auth`` installed, the admin provides a convenient way to view and manage users, groups, and permissions. Users can be created and deleted like any Django model. Groups can be created, and permissions can be assigned to users or groups. A log of user edits to models made within the admin is also stored and displayed.
id: Ketika anda mempunyai kedua ``django.contrib.admin`` dan ``django.contrib.auth`` terpasang, admin menyediakan cara yang nyaman untuk menampilkan dan mengelola pengguna, kelompok, dan perizinan. Pengguna dapat dibuat dan dihapus seperti model Django apapun. Kelompok dapat dibuat, dan perizinan dapat diberikan ke pengguna atau kelompok. Sebuah catatan dari pengguna menyunting model dibuat dalam admin juga disimpan dan ditampilkan.

source: You should see a link to "Users" in the "Auth" section of the main admin index page. The "Add user" admin page is different than standard admin pages in that it requires you to choose a username and password before allowing you to edit the rest of the user's fields.
id: Anda harus melihat sebuah tautan pada "Users" di bagian "Auth" dari halaman indeks admin utama. Halaman admin "Add user" adalah berbeda dari halaman admin standar karena itu membutuhkan anda memilis sebuah nama pengguna dan sandi sebelum mengizinkan anda menyunting sisa dari bidang pengguna.

source: Also note: if you want a user account to be able to create users using the Django admin site, you'll need to give them permission to add users *and* change users (i.e., the "Add user" and "Change user" permissions). If an account has permission to add users but not to change them, that account won't be able to add users. Why? Because if you have permission to add users, you have the power to create superusers, which can then, in turn, change other users. So Django requires add *and* change permissions as a slight security measure.
id: Juga catat: jika anda ingin seorang akun pengguna dapat membuat pengguna menggunakan situs admin Django, anda akan butuh memberikan mereka perizinan untuk menambahkan pengguna *dan* merubah pengguna (yaitu, perizinan "Add user" dan "Change user"). Jika sebuah akun mempunyai perizinan untuk menambah pengguna tetapi tidak merubah mereka, yang akun tidak dapat menambah pengguna. Kenapa, Karena jika anda mempunyai perizinan menambahkan pengguna, anda mempunyai kekuasaan membuat superuser, yang dapat kemudian, di gilirannya, rubah pengguna lain. Sehingga Django membuatuhkan tambah *dan* merubah perizinan sebagai ukuran keamanan sedikit.

source: Be thoughtful about how you allow users to manage permissions. If you give a non-superuser the ability to edit users, this is ultimately the same as giving them superuser status because they will be able to elevate permissions of users including themselves!
id: Bijaksanalah tentang bagaimana anda mengizinkan pengguna mengelola perizinan. Jika anda memberikan bukan-superuser kemampuan menyunting pengguna, ini adalah akhirnya sama seperti memberikan mereka keadaan superuser karena mereka akan dapat memperbaiki perizinan dari pengguna menyertakan mereka sendiri!

source: User passwords are not displayed in the admin (nor stored in the database), but the :doc:`password storage details </topics/auth/passwords>` are displayed. Included in the display of this information is a link to a password change form that allows admins to change user passwords.
id: Sandi pengguna tidak diperlihatkan di admin (maupun disimpan di basisdata), tetapi :doc:`password storage details </topics/auth/passwords>` diperlihatkan. Disertakan di layar dari informasi ini adalah sebuah tautan pada sebuah formulir rubah sandi yang mengizinkan admin merubah sandi pengguna.

source: User authentication in Django
id: Otentifikasi pengguna di Django

source: Django comes with a user authentication system. It handles user accounts, groups, permissions and cookie-based user sessions. This section of the documentation explains how the default implementation works out of the box, as well as how to :doc:`extend and customize </topics/auth/customizing>` it to suit your project's needs.
id: Django datang dengan sistem otentifikasi pengguna. Dia menangani akun pengguna, kelompok, perizinan dan sesi pengguna berbasis-kue. Bagian ini dari dokumentasi menjelaskan bagaimana penerawan awal bekerja keluar dari kotak, sama halnya bagaimana :doc:`extend and customize </topics/auth/customizing>` dia untuk mencocokkan kebutuhan proyek anda.

source: Overview
id: Ikhtisar

source: The Django authentication system handles both authentication and authorization. Briefly, authentication verifies a user is who they claim to be, and authorization determines what an authenticated user is allowed to do. Here the term authentication is used to refer to both tasks.
id: Sistem autentifikasi Django menangani kedua autentifikasi dan otentifikasi. Secara singkat, autentifikasi memeriksa seorang pengguna yang menjadi tuntutan mereka, dan otorisasi menentukan apa seorang pengguna diautentifikasi diizinkan melakukan. Disini istilah autentifikasi digunakan untuk mengacu kedua tugas.

source: The auth system consists of:
id: Sistem autentifikasi terdiri dari:

source: Permissions: Binary (yes/no) flags designating whether a user may perform a certain task.
id: Perizinan: Bendera biner (ya/tidak) menandakan apakah seorang pengguna mungkin melakukan tugas tertentu.

source: Groups: A generic way of applying labels and permissions to more than one user.
id: Kelompok: Sebuah cara umum dari memberlakukan label dan perizinan pada lebih dari satu pengguna.

source: A configurable password hashing system
id: Sistem mencampur sandi dikonfigurasi

source: Forms and view tools for logging in users, or restricting content
id: Formulir dan alat-alat tampilan untuk pengguna masuk, atau membatasi isi

source: A pluggable backend system
id: Sistem backend tertanam

source: The authentication system in Django aims to be very generic and doesn't provide some features commonly found in web authentication systems. Solutions for some of these common problems have been implemented in third-party packages:
id: Sistem autentifikasi di Django bertujuan untuk sangat umum dan tidak menyediakan beberapa fitur umumnya ditemukan di sistem autentifikasi jaringan. Pemecahan untuk beberapa dari masalah umum telah diterapkan di paket-paket pihak-ketiga:

source: Password strength checking
id: Pemeriksaan kekuatan sandi

source: Throttling of login attempts
id: Mencengkik dari usaha masuk

source: Authentication against third-parties (OAuth, for example)
id: Autentifikasi terhadap pihak-ketiga (OAuth, sebagai contoh)

source: Installation
id: Pemasangan

source: Authentication support is bundled as a Django contrib module in ``django.contrib.auth``. By default, the required configuration is already included in the :file:`settings.py` generated by :djadmin:`django-admin startproject <startproject>`, these consist of two items listed in your :setting:`INSTALLED_APPS` setting:
id: Dukungan autentifikasi digabung sebagai modul bantuan Django di ``django.contrib.auth``. Secara awalan, konfigurasi yang dibutuhkan sudah termasuk di :file:`settings.py` dibangkitkan oleh :djadmin:`django-admin startproject <startproject>`, ini terdiri dari dua barang terdaftar di pengaturan :setting:`INSTALLED_APPS` anda:

source: ``'django.contrib.auth'`` contains the core of the authentication framework, and its default models.
id: ``'django.contrib.auth'`` mengandung inti dari kerangka kerja autentifikasi, dan model awalannya.

source: ``'django.contrib.contenttypes'`` is the Django :doc:`content type system </ref/contrib/contenttypes>`, which allows permissions to be associated with models you create.
id: ``'django.contrib.contenttypes'`` adalah :doc:`content type system </ref/contrib/contenttypes>` Django, yang mengizinkan perizinan untuk digabungkan dengan model anda buat.

source: and these items in your :setting:`MIDDLEWARE` setting:
id: dan barang-barang ini di pengaturan :setting:`MIDDLEWARE` anda:

source: :class:`~django.contrib.sessions.middleware.SessionMiddleware` manages :doc:`sessions </topics/http/sessions>` across requests.
id: :class:`~django.contrib.sessions.middleware.SessionMiddleware` mengelola :doc:`sessions </topics/http/sessions>` lintas permintaan.

source: :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` associates users with requests using sessions.
id: :class:`~django.contrib.auth.middleware.AuthenticationMiddleware` menggabungkan pengguna dengan permintaan menggunakan sesi.

source: With these settings in place, running the command ``manage.py migrate`` creates the necessary database tables for auth related models and permissions for any models defined in your installed apps.
id: Dengan pengaturan ini di tempat, menjalankan perintah ``manage.py migrate`` membuat tabel-tabel basisdata yang dibutuhkan untuk autentifikasi model terkait dan perizinan untuk model apapun ditentukan di aplikasi terpasang anda.

source: Usage
id: Penggunaan

source: :ref:`Working with User objects <user-objects>`
id: :ref:`Bekerja dengan Obyek Pengguna <user-objects>`

source: :ref:`Permissions and authorization <topic-authorization>`
id: :ref:`Perizinan dan pembuktian keaslian <topic-authorization>`

source: :ref:`Authentication in web requests <auth-web-requests>`
id: :ref:`Pembuktian keaslian di permintaan jaringan <auth-web-requests>`

source: :ref:`Managing users in the admin <auth-admin>`
id: :ref:`Mengelola pengguna di admin <auth-admin>`

source: Password management in Django
id: Pengelolaan sandi di Django

source: Password management is something that should generally not be reinvented unnecessarily, and Django endeavors to provide a secure and flexible set of tools for managing user passwords. This document describes how Django stores passwords, how the storage hashing can be configured, and some utilities to work with hashed passwords.
id: Pengelolaan sandi adalah sesuatu yang harus secara umum tidak dibuat kembali tida perlu, dan Django berusaha menyediakan kumpulan aman dan fleksibel dari alat-alat untuk mengelola sandi pengguna. Dokumen ini menggambarkan bagaimana Django menyimpan sandi, bagaimana campuran penyimpanan dapat dikonfigurasikan, dan beberapa peralatan untuk bekerja dengan sandi dicampur.

source: Even though users may use strong passwords, attackers might be able to eavesdrop on their connections. Use :ref:`HTTPS <security-recommendation-ssl>` to avoid sending passwords (or any other sensitive data) over plain HTTP connections because they will be vulnerable to password sniffing.
id: Meskipun pengguna mungkin menggunakan sandi kuat, penyerang mungkin dapat menguping pada hubungan mereka. Gunakan :ref:`HTTPS <security-recommendation-ssl>` untuk menghindari mengirim sandi (atau data sensitif lain apapun) terhadap hubungan HTTP polos karena merekan akan menjadi rentan pada penciuman sandi.

source: How Django stores passwords
id: Bagaimana Django menyimpan sandi

source: Django provides a flexible password storage system and uses PBKDF2 by default.
id: Django menyediakan sistem penyimpanan sandi fleksibel dan menggunakan PBKDF2 secara awalan.

source: The :attr:`~django.contrib.auth.models.User.password` attribute of a :class:`~django.contrib.auth.models.User` object is a string in this format::
id: Atribut :attr:`~django.contrib.auth.models.User.password` dari sebuah obyek :class:`~django.contrib.auth.models.User` adalah sebuah string di bentuk ini::

source: Those are the components used for storing a User's password, separated by the dollar-sign character and consist of: the hashing algorithm, the number of algorithm iterations (work factor), the random salt, and the resulting password hash. The algorithm is one of a number of one-way hashing or password storage algorithms Django can use; see below. Iterations describe the number of times the algorithm is run over the hash. Salt is the random seed used and the hash is the result of the one-way function.
id: Mereka adalah komponen digunakan untuk menyimpan sandi User, dipisahkan oleh karakter dolar dan terdiri dari campuran algoritma, sejumlah perulangan algoritma (faktor kerja), garam acak, dan menghasilkan campuran sandi. Algoritma adalah satu dari sejumlah dari campuran satu-cara atau algoritma penyimpanan sandi Django dapat digunakan, lihat dibawah. Perulangan menggambarkan sejumlah kali algoritma berjalan terhadap campuran. Garam adalah benih acak digunakan dan campuran adalah hasil dari fungsi satu-cara.

source: By default, Django uses the PBKDF2_ algorithm with a SHA256 hash, a password stretching mechanism recommended by NIST_. This should be sufficient for most users: it's quite secure, requiring massive amounts of computing time to break.
id: Secara awalan, Django menggunakan algoritma PBKDF2_ dengan campuran SHA256, sebuah mekanisme perentangan sandi dianjurkan oleh NIST_. Ini harus cukup untuk kebanyakan pengguna: itu sangat aman, membutuhkan jumlah besar waktu untuk merusak.

source: However, depending on your requirements, you may choose a different algorithm, or even use a custom algorithm to match your specific security situation. Again, most users shouldn't need to do this -- if you're not sure, you probably don't. If you do, please read on:
id: Bagaimapun, tergantung pada persyaratan anda, anda mungkin memilih algoritma berbeda, atau bahkan menggunakan penyesuaian algoritma untuk mencocokkan keadaan keamanan khusus. Kembali, kebanyakan pengguna tidak butuh melakukan ini -- jika anda tidak yakin, anda mungkin tidak. Jika anda melakukan, harap membaca:
