Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The total number of objects, across all pages.
id: Jumlah angka obyek, di semua halaman.

source: The total number of pages.
id: Jumlah angka halaman

source: ``InvalidPage`` exceptions
id: Pengecualian ``InvalidPage``

source: Raised when ``page()`` is given a value that isn't an integer.
id: DImunculkan ketika ``page()`` memberikan nilai yang bukan integer.

source: ``Page`` objects
id: Obyek ``Page``

source: Returns ``True`` if there's a next page.
id: Mengembalikan ``True`` jika ada halaman selanjutnya.

source: Returns ``True`` if there's a previous page.
id: Mengembalikan ``True`` jika ada halaman sebelumnya.

source: Returns ``True`` if there's a next *or* previous page.
id: Mengembalikan ``True`` jika ada selanjutnya halaman *atau* sebelumnya.

source: The list of objects on this page.
id: Daftar dari obyek-obyek pada halaman ini.

source: The associated :class:`Paginator` object.
id: Obyek :class:`Paginator` terkait.

source: Performance and optimization
id: Penampilan dan optimalisasi

source: General approaches
id: Pendekatan umum

source: Performance benchmarking
id: Penampilan pembandingan

source: Django tools
id: Alat-alat Django

source: Third-party services
id: Layanan pihak-ketiga

source: Get things right from the start
id: Mendapatkan hal yang benar dari awal

source: Work at the appropriate level
id: Bekerja pada tingkatan sesuai

source: The example above is merely illustrative.
id: Contoh di atas hanyalah ilustrasi.

source: :doc:`The caching framework </topics/cache>`
id: :doc:`The caching framework 1`

source: Understanding laziness
id: Memahami laziness

source: Laziness in Django
id: Laziness di Django

source: On the other hand, :ref:`certain operations will force the evaluation of a QuerySet <when-querysets-are-evaluated>`. Avoiding the premature evaluation of a ``QuerySet`` can save making an expensive and unnecessary trip to the database.
id: Di sisi lain, t:ref:`certain operations will force the evaluation of a QuerySet 1`. Mengindari penilaian sebelum waktunya dri ``QuerySet`` dapat menyimpan membuat perjalanan mahal dan tidak diperlukan pada basisdata.

source: Django also offers a :meth:`~django.utils.functional.keep_lazy` decorator. This allows a function that has been called with a lazy argument to behave lazily itself, only being evaluated when it needs to be. Thus the lazy argument - which could be an expensive one - will not be called upon for evaluation until it's strictly required.
id: Django juga menawarkan penghias :meth:`~django.utils.functional.keep_lazy`. Ini mengizinkan sebuah fungsi yang telah dipanggil dengan argumen lazy untuk berperilaku malas itu sendiri, hanya sedang dinilai ketika itu dibutuhkan. Dengan demikian argumen lazy - yang dapat sangat mahal - tidak akan dipanggil untuk penilaian sampai itu semata-mata diperlukan.

source: Databases
id: Basisdata

source: Database optimization
id: Optimasi basisdata

source: HTTP performance
id: Penampilan HTTP

source: Sessions
id: Sesi

source: Static files
id: Berkas statis

source: "Minification"
id: "Minifikasi"

source: Several third-party Django tools and packages provide the ability to "minify" HTML, CSS, and JavaScript. They remove unnecessary whitespace, newlines, and comments, and shorten variable names, and thus reduce the size of the documents that your site publishes.
id: Beberapa alat-alat pihak-ketiga Django dan peket-paket menyediakan kemampuan untuk "minify" HTML, CSS, dan JavaScript. Mereka memindahkan ruang kosong yang tidak diperlukan, baris baru, dan komentar, dan memperpendek nama-nama variabel, dan mengurangi ukuran dari dokumen-dokumen yang situs anda terbitkan.

source: Template performance
id: Penampilan cetakan

source: Note that:
id: Catat bahwa:

source: using ``{% block %}`` is faster than using ``{% include %}``
id: menggunakan ``{% block %}`` lebih cepat daripada menggunakan ``{% include %}``

source: Using different versions of available software
id: Menggunakan versi berbeda dari perangkat lunak tersedia

source: Newer is often - but not always - better
id: Terbaru adalah sering - tetapi tidak selalu - terbaik

source: Alternatives to Django's template language
id: Jalan lain ke bahasa cetakan Django

source: Alternative software implementations
id: Jalan lain penerapan perangkat lunak

source: C implementations of Python libraries
id: C menerapkan pustaka Python

source: Some Python libraries are also implemented in C, and can be much faster. They aim to offer the same APIs. Note that compatibility issues and behavior differences are not unknown (and not always immediately evident).
id: Beberapa pustaka Python juga menerapkan di C, dan dapat lebih cepat. Mereka bermaksud menawarkan API sama. Catat bahwa masalah kesesuaian dan perbedaan kebiasaan tidak diketahui (dan tidak selalu segera jelas).

source: Security in Django
id: Kemananan di Django

source: Cross site scripting (XSS) protection
id: Perlindungan cross site scripting (XSS)

source: Cross site request forgery (CSRF) protection
id: Perlindungan cross site request forgery (CSRF)

source: SQL injection protection
id: Perlindungan penyisipan SQL

source: Clickjacking protection
id: Perlindungan clickjacking

source: Use 'secure' cookies.
id: Gunakan 'secure' cookie

source: Use :ref:`http-strict-transport-security` (HSTS)
id: Gunakan :ref:`http-strict-transport-security` (HSTS)

source: For more details see the full :setting:`ALLOWED_HOSTS` documentation.
id: Untuk lebih rinci lihat dokumentasi penuh :setting:`ALLOWED_HOSTS`.

source: Additional security topics
id: Topik keamanan tambahan

source: Keep your :setting:`SECRET_KEY` a secret.
id: Jaga :setting:`SECRET_KEY` anda sebuah rahasia.

source: It is a good idea to limit the accessibility of your caching system and database using a firewall.
id: Itu adalah ide bagus untuk membatasi kemampuan akses dari sistem cache anda dan basisdata menggunakan sebuah dinding api.

source: If you just want to get some data from your tables into a serialized form, you could use the :djadmin:`dumpdata` management command.
id: Jika anda hanya ingin mendapatkan beberapa data dari tabel-tabel anda kedalam bentuk terserial, anda dapat menggunakan perintah pengelolaan :djadmin:`dumpdata`.

source: Serializing data
id: Menserialkan data

source: At the highest level, serializing data is a very simple operation::
id: Pada tingkat tertinggi, menserialkan data adalah tindakan sangat mudah::

source: You can also use a serializer object directly::
id: Anda dapat juga menserialkan obyek langsung::

source: This is useful if you want to serialize data directly to a file-like object (which includes an :class:`~django.http.HttpResponse`)::
id: Ini sangat berguna jika anda ingin menserialkan data langsung ke obyek seperti-berkas (yang menyertakan sebuah :class:`~django.http.HttpResponse`)::

source: Calling :func:`~django.core.serializers.get_serializer` with an unknown :ref:`format <serialization-formats>` will raise a ``django.core.serializers.SerializerDoesNotExist`` exception.
id: Memanggil :func:`~django.core.serializers.get_serializer`dengan :ref:`format 1` yang tidak diketahui akan memunculkan pengecualian ``django.core.serializers.SerializerDoesNotExist``.

source: Subset of fields
id: Subkumpulan dari bidang-bidang

source: If you only want a subset of fields to be serialized, you can specify a ``fields`` argument to the serializer::
id: Jika anda hanya ingin subkumpulan dari bidang-bidang untuk diserialkan, anda dapat menentukan argumen ``fields`` pada penserial::

source: Inherited models
id: Model yang diwarisi

source: Deserializing data
id: Deserialisasi data

source: Deserializing data is also a fairly simple operation::
id: Deserialisasi data juga tindakan cukup mudah::

source: As you can see, the ``deserialize`` function takes the same format argument as ``serialize``, a string or stream of data, and returns an iterator.
id: Seperti anda dapat lihat, fungsi ``deserialize`` mengambil bentuk argumen sala seperti ``serialize``, sebuah string atau aliran data, dan mengembalikan sebuah perulangan.

source: Calling ``DeserializedObject.save()`` saves the object to the database.
id: Memanggil ``DeserializedObject.save()`` menyimpan obyek ke basisdata.

source: Serialization formats
id: Bentuk-bentuk serialisasi

source: Django supports a number of serialization formats, some of which require you to install third-party Python modules:
id: Django mendukung sejumlah bentuk serialisasi, beberapa yang membutuhkan anda memasang modul Python pihak-ketiga:

source: Identifier
id: Penciri

source: Information
id: Informasi

source: Serializes to and from a simple XML dialect.
id: Menserialisasikan ke dan dari logat XML sederhana.

source: Serializes to and from JSON_.
id: Menserialisasikan ke dan dariJSON_.

source: Serializes to YAML (YAML Ain't a Markup Language). This serializer is only available if PyYAML_ is installed.
id: Menserialisasikan ke YAML (YAML Ain't a Markup Language). Penserial ini hanya tersedia jika PyYAML_terpasang.

source: The basic XML serialization format is quite simple::
id: Bentuk serialisasi XML dasar sangat sederhana::

source: Foreign keys and other relational fields are treated a little bit differently::
id: Foreign key dan bidang-bidang penghubung lain diperlakukan sedikit berbeda::

source: This example links the given user with the permission models with PKs 46 and 47.
id: Contoh tautan ini memberikan pengguna dengan model perizinan dengan PK 46 dan 47.

source: Control characters
id: Karakter kendali

source: You can then pass ``cls=LazyEncoder`` to the ``serializers.serialize()`` function::
id: Anda kemudian dapat melewatkan ``cls=LazyEncoder`` ke fungsi ``serializers.serialize()``::

source: Also note that GeoDjango provides a :doc:`customized GeoJSON serializer </ref/contrib/gis/serializers>`.
id: Juga catat bahwa GeoDjango menyediakan sebuah :doc:`customized GeoJSON serializer 1`.

source: A string of the form ``YYYY-MM-DDTHH:mm:ss.sssZ`` or ``YYYY-MM-DDTHH:mm:ss.sss+HH:MM`` as defined in `ECMA-262`_.
id: Sebuah string dari bentuk ``YYYY-MM-DDTHH:mm:ss.sssZ`` atau ``YYYY-MM-DDTHH:mm:ss.sss+HH:MM`` seeprti ditentukan dalam `ECMA-262`_.

source: A string of the form ``YYYY-MM-DD`` as defined in `ECMA-262`_.
id: Sebuah string dari bentuk `YYYY-MM-DD`` seperti ditentukan dalam `ECMA-262`_.

source: A string of the form ``HH:MM:ss.sss`` as defined in `ECMA-262`_.
id: Sebuah string dari bentuk ``HH:MM:ss.sss`` seperti ditentukan dalam `ECMA-262`_.

source: :class:`~decimal.Decimal`, ``Promise`` (``django.utils.functional.lazy()`` objects), :class:`~uuid.UUID`
id: :class:`~decimal.Decimal`, ``Promise`` (obyek ``django.utils.functional.lazy()``), :class:`~uuid.UUID`

source: A string representation of the object.
id: Sebuah string perwakilan dari obyek.

source: Natural keys
id: Kunci alami

source: Consider the following two models::
id: Pertimbangkan dua model berikut::

source: Now books can use that natural key to refer to ``Person`` objects::
id: Sekarang buku dapat menggunakan kunci alami untuk mengacu pada obyek ``Person``::

source: Dependencies during serialization
id: Ketergantungan selama serialisasi

source: Django settings
id: Pengaturan Django

source: The basics
id: Dasar

source: The ``django-admin`` utility
id: Kegunaan ``django-admin``

source: Example (Unix Bash shell)::
id: Contoh (Unix Bash shell)::

source: Example (Windows shell)::
id: Contoh (Windows shell)::

source: Default settings
id: Pengaturan awal

source: Load settings from ``global_settings.py``.
id: Memuat pengaturan dari ``global_settings.py``.

source: Seeing which settings you've changed
id: Melihat pengaturan mana anda telah rubah

source: For more, see the :djadmin:`diffsettings` documentation.
id: Untuk lebih, lihat dokumentasi :djadmin:`diffsettings`.

source: Using settings in Python code
id: Menggunakan pengaturan di kode Python

source: In your Django apps, use settings by importing the object ``django.conf.settings``. Example::
id: Di aplikasi Django anda, gunakan pengaturan dengan mengimpor obyek ``django.conf.settings``. Contoh::

source: Note that ``django.conf.settings`` isn't a module -- it's an object. So importing individual settings is not possible::
id: Catat bahwa ``django.conf.settings`` bukanlah modul -- dia adalah sebuah obyek. Jadi mengimpor pengaturan tunggal adalah tidak mungkin::

source: Security
id: Keamanan

source: Available settings
id: Pengaturan tersedia

source: Creating your own settings
id: Membuat pengaturan anda sendiri

source: There's nothing stopping you from creating your own settings, for your own Django apps. Just follow these guidelines:
id: Tidak ada yang menghentikan anda dari membuat pengaturan anda sendiri, untuk aplikasi Django anda sendiri. Cukup ikuti panduan ini:

source: After you've either set :envvar:`DJANGO_SETTINGS_MODULE` or called ``configure()``, you'll need to call :func:`django.setup()` to load your settings and populate Django's application registry. For example::
id: Setelah anda telah salah satu menyetel :envvar:`DJANGO_SETTINGS_MODULE` atau memanggil ``configure()``, anda akan butuh memanggil :func:`django.setup()` untuk memuat pengaturan anda dan mengumpulkan registrar aplikasi Django. Sebagai contoh::

source: ``django.setup()`` may only be called once.
id: ``django.setup()`` hanya boleh dipanggil sekali.

source: :doc:`The Settings Reference </ref/settings>`
id: :doc:`Acuan Pengaturan </ref/settings>`

source: Signals
id: Sinyal

source: Django includes a "signal dispatcher" which helps allow decoupled applications get notified when actions occur elsewhere in the framework. In a nutshell, signals allow certain *senders* to notify a set of *receivers* that some action has taken place. They're especially useful when many pieces of code may be interested in the same events.
id: Django menyertakan sebuah "signal dispatcher" yang membantu mengizinkan aplikasi dipisahkan mendapat pemberitahuan ketika tindakan muncul di tempat lain di kerangka kerja. Dalam kulit kacang, sinyal mengizinkan *pengirim* tertentu untuk memberitahu beberapa tindakan telah diambil. Mereka adalah khususnya berguna ketika banyak potongan dari kode mungkin tertarik di acara yang sama.

source: Sent before or after a model's :meth:`~django.db.models.Model.save` method is called.
id: Terkirim sebelum atau sesudah model cara :meth:`~django.db.models.Model.save` dipanggil.

source: Listening to signals
id: Mendengarkan ke sinyal

source: Receiver functions
id: Fungsi penerima

source: First, we need to define a receiver function. A receiver can be any Python function or method::
id: Pertama, kami butuh menentukan fungsi penerima. Penerima dapat menjadi fungsi Phyton apapun atau cara::

source: Connecting receiver functions
id: Menyambung fungsi penerima

source: Where should this code live?
id: Dimana seharusnya kode ini tinggal?

source: Preventing duplicate signals
id: Mencegah sinyal rangkap

source: If this behavior is problematic (such as when using signals to send an email whenever a model is saved), pass a unique identifier as the ``dispatch_uid`` argument to identify your receiver function. This identifier will usually be a string, although any hashable object will suffice. The end result is that your receiver function will only be bound to the signal once for each unique ``dispatch_uid`` value::
id: Jika perilaku ini bermasalah (seperti ketika menggunakan sinyal mengirim surel dimanapun model disimpan), lewati penciri unik sebagai argumen ``dispatch_uid`` untuk mencirikan fungsi penerima anda. Penciri ini akan biasanya berupa string, meskipun obyek apapun yang mampu akan cukup. Hasil akhir adalah fungsi penerima anda akan hanya diikatkan ke sinyal sekali untuk setiap nilai ``dispatch_uid`` unik::

source: Defining and sending signals
id: Menentukan dan mengirim sinyal

source: Your applications can take advantage of the signal infrastructure and provide its own signals.
id: Aplikasi anda dapat mengambil keuntungan dari infrastruktur sinyal dan menyediakan sinyal sendiri.

source: Defining signals
id: Menentukan sinyal

source: All signals are :class:`django.dispatch.Signal` instances. The ``providing_args`` is a list of the names of arguments the signal will provide to listeners. This is purely documentational, however, as there is nothing that checks that the signal actually provides these arguments to its listeners.
id: Semua sinyal adalah instance :class:`django.dispatch.Signal`. ``providing_args`` adalah daftar dari nama-nama dari argumen sinyal akan menyediakan ke pendengar. Ini murni dokumentasi, bagaimanapun, ketika tidak ada yang memeriksa sinyal itu sebenarnya menyediakan argumen ini ke pendengarnya.

source: This declares a ``pizza_done`` signal that will provide receivers with ``toppings`` and ``size`` arguments.
id: Ini menyatakan sebuah sinyal ``pizza_done`` yang akan menyediakan penerima dengan argumen ``toppings`` dan ``size``.

source: Sending signals
id: Mengirim sinyal

source: There are two ways to send signals in Django.
id: Terdapat dua jalan mengirim sinyal di Django.

source: For example, here's how sending our ``pizza_done`` signal might look::
id: Sebagai contoh, ini adalah bagaimana mengirim sinyal ``pizza_done`` kami mungkin terlihat::

source: Disconnecting signals
id: Memutus sambungan sinyal

source: The ``receiver`` argument indicates the registered receiver to disconnect. It may be ``None`` if ``dispatch_uid`` is used to identify the receiver.
id: Argumen ``receiver`` menunjukkan penerima terdaftar untuk tidak terhubung. Itu mungkin ``None`` jika ``dispatch_uid`` digunakan untuk mencirikan penerima.

source: Cryptographic signing
id: Penandatanganan Kriptrograpi

source: You may also find signing useful for the following:
id: Anda mungkin juga menemukan pensinyalan berguna untuk berikut:

source: Protecting the ``SECRET_KEY``
id: Melindungi the ``SECRET_KEY``

source: Using the low-level API
id: Menggunakan API tingkat-rendah

source: Using the ``salt`` argument
id: Menggunakan argumen ``salt``

source: Verifying timestamped values
id: Memeriksa nilai timestamp

source: Checks if ``value`` was signed less than ``max_age`` seconds ago, otherwise raises ``SignatureExpired``. The ``max_age`` parameter can accept an integer or a :py:class:`datetime.timedelta` object.
id: Memeriksa jika ``value`` telah ditandai kurang dari ``max_age`` detik lampau, sebalinya memunculkan ``SignatureExpired``. parameter ``max_age`` dapat menerima sebuah integer atau sebuah obyek :py:class:`datetime.timedelta`.

source: Protecting complex data structures
id: Melindungi struktur data rumit

source: Reverse of ``dumps()``, raises ``BadSignature`` if signature fails. Checks ``max_age`` (in seconds) if given.
id: Membalikkan ``dumps()``, memunculkan ``BadSignature`` jika tanda tangan gagal. memeriksa ``max_age`` (dalam detik) jika diberikan.

source: Templates
id: Cetakan

source: Support for template engines
id: Mendukung untuk mesin cetakan

source: Configuration
id: Pengaturan

source: This exception is raised when a template was found but contains errors.
id: Pengecualian ini muncul ketika sebuah cetakan telah ditemukan tetapi mengandung kesalahan.

source: If you call ``get_template('story_detail.html')``, here are the files Django will look for, in order:
id: Jika anda memanggil ``get_template('story_detail.html')``, ini adalah berkas Django akan mencari, agar:

source: ``/home/html/example.com/story_detail.html`` (``'django'`` engine)
id: ``/home/html/example.com/story_detail.html`` (mesin ``'django'``)

source: ``/home/html/default/story_detail.html`` (``'django'`` engine)
id: ``/home/html/default/story_detail.html`` (mesin ``'django'``)

source: ``/home/html/jinja2/story_detail.html`` (``'jinja2'`` engine)
id: ``/home/html/jinja2/story_detail.html`` (mesin ``'jinja2'``)

source: ``/home/html/example.com/story_253_detail.html`` (``'django'`` engine)
id: ``/home/html/example.com/story_253_detail.html`` (mesin ``'django'``)

source: ``/home/html/default/story_253_detail.html`` (``'django'`` engine)
id: ``/home/html/default/story_253_detail.html`` (mesin ``'django'``)

source: ``/home/html/jinja2/story_253_detail.html`` (``'jinja2'`` engine)
id: ``/home/html/jinja2/story_253_detail.html`` (mesin ``'jinja2'``)

source: When Django finds a template that exists, it stops looking.
id: Ketika Django menemukan cetakan yang ada, dia berhenti mencari.

source: Tip
id: Nasihat

source: ``/home/html/example.com/news/story_detail.html`` (``'django'`` engine)
id: ``/home/html/example.com/news/story_detail.html`` (mesin ``'django'``)

source: ``/home/html/default/news/story_detail.html`` (``'django'`` engine)
id: ``/home/html/default/news/story_detail.html`` (mesin ``'django'``)

source: ``/home/html/jinja2/news/story_detail.html`` (``'jinja2'`` engine)
id: ``/home/html/jinja2/news/story_detail.html`` (mesin ``'jinja2'``)

source: Template engines are available in ``django.template.engines``::
id: Mesin cetakan tersedia dalam ``django.template.engines``::

source: It defaults to ``True``.
id: Itu awalan untuk ``True``.

source: Only set it to ``False`` if you're rendering non-HTML templates!
id: Hanya disetel untuk ``False`` jika anda sedang membangun cetakan bukan-HTML!

source: It defaults to an empty list.
id: Itu awalan pada sebuah list kosong.

source: See :class:`~django.template.RequestContext` for more information.
id: Lihat :class:`~django.template.RequestContext` untuk informasi lebih.

source: See :ref:`template-loaders` for details.
id: Lihat :ref:`template-loaders` untuk lebih rinci.

source: ``'string_if_invalid'``: the output, as a string, that the template system should use for invalid (e.g. misspelled) variables.
id: ``'string_if_invalid'``: keluaran, sebagai sebuah string, yang sistem cetakan harus digunakan untuk varaibel tidak sah (sebagai contoh salah eja).

source: It defaults to an empty string.
id: Itu awalan pada sebuah string kosong.

source: See :ref:`invalid-template-variables` for details.
id: Lihat :ref:`invalid-template-variables` untuk rincian.

source: ``'file_charset'``: the charset used to read template files on disk.
id: ``'file_charset'``: charset digunakan untuk membaca cetakan berkas-berkas pada cakram.

source: It defaults to the value of :setting:`FILE_CHARSET`.
id: Itu awalan pada nilai dari :setting:`FILE_CHARSET`.

source: Libraries can be loaded by passing the corresponding dictionary key to the :ttag:`{% load %}<load>` tag.
id: Pustaka-pustaka dapat dimuat dengan melewatkan kunci dictionary sesuai ke etiket :ttag:`{% load %}1`.

source: Requires Jinja2_ to be installed:
id: Membutuhkan Jinja2_ untuk dipasang:

source: Set :setting:`BACKEND <TEMPLATES-BACKEND>` to ``'django.template.backends.jinja2.Jinja2'`` to configure a Jinja2_ engine.
id: Setel :setting:`BACKEND 1` pada ``'django.template.backends.jinja2.Jinja2'``untuk mengkonfigurasi mesin Jinja2_.

source: When :setting:`APP_DIRS <TEMPLATES-APP_DIRS>` is ``True``, ``Jinja2`` engines look for templates in the ``jinja2`` subdirectory of installed applications.
id: Ketika :setting:`APP_DIRS 1` adalah ``True``, mesin-mesin ``Jinja2`` mencari cetakan-cetakan dalam subdirektori ``jinja2``dari aplikasi terpasang.

source: See `DEP 182`_ for more information.
id: Lihat `DEP 182`_ untuk informasi lebih.

source: The Django template language
id: Bahasa cetakan Django

source: Syntax
id: Sintaksis

source: About this section
id: Tentang bagian ini

source: Variables
id: Variabel

source: Variables are surrounded by ``{{`` and ``}}`` like this::
id: Variabel dikelilingi oleh ``{{`` dan ``}}`` seperti ini::

source: Tags
id: Tag

source: Tags are surrounded by ``{%`` and ``%}`` like this::
id: Etiket dikelilingi oleh ``{%`` and ``%}`` seperti ini::

source: Most tags accept arguments::
id: Kebanyakan etiket menerima argumen::
