Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Internally, Django uses a :class:`django.core.files.File` instance any time it needs to represent a file.
id: Di bagian dalam, Django menggunakan sebuah instance :class:`django.core.files.File` kapanpun itu butuh untuk mewakili sebuah berkas.

source: Most of the time you'll simply use a ``File`` that Django's given you (i.e. a file attached to a model as above, or perhaps an uploaded file).
id: Kebanyakan waktu anda akan cukup menggunakan sebuah ``File`` yang Django berikan ke anda (yaitu dilampirkan pada model seperti diatas, atau mungkin sebuah berkas terunggah).

source: If you need to construct a ``File`` yourself, the easiest way is to create one using a Python built-in ``file`` object::
id: Jika anda butuh membangun sebuah ``File`` anda sendiri, cara termudah adalah membuat satu menggunakan Python obyek ``file`` siap-pakai::

source: Now you can use any of the documented attributes and methods of the :class:`~django.core.files.File` class.
id: Sekarang anda dapat menggunakan atribut-atribut terdokumentasi apapun dan metode-metode dari kelas :class:`~django.core.files.File`.

source: Be aware that files created in this way are not automatically closed. The following approach may be used to close files automatically::
id: Waspada bahwa berkas-berkas yang dibuat dalam cara ini tidak otomatis ditutup. Pendekatan berikut mungkin digunakan untuk menutup berkas-berkas otomatis::

source: File storage
id: Penyimpanan berkas

source: See below for details of the built-in default file storage system, and see :doc:`/howto/custom-file-storage` for information on writing your own file storage system.
id: Lihat dibawah untuk rincian dari sistem penyimpanan berkas awalan siap-pakai, dan lihat :doc:`/howto/custom-file-storage`untuk informasi pada menulis sistem penyimpanan berkas anda sendiri.

source: Storage objects
id: Obyek penyimpanan

source: Though most of the time you'll want to use a ``File`` object (which delegates to the proper storage for that file), you can use file storage systems directly. You can create an instance of some custom file storage class, or -- often more useful -- you can use the global default storage system::
id: Meskipun kebanyakan waktu anda akan ingin menggunakan sebuah obyek ``File`` (yang menunjukkan ke penyimpanan sesuai untuk berkas itu), anda dapat menggunakan sistem penyimpanan berkas langsung. Anda dapat membuat sebuah instance dari beberapa kelas penyimpanan berkas penyesuaian, atau -- sering lebih berguna -- anda dapat menggunakan sistem penyimpanan awalan global::

source: See :doc:`/ref/files/storage` for the file storage API.
id: Lihat :doc:`/ref/files/storage` untuk API penyimpanan berkas.

source: The built-in filesystem storage class
id: Kelas penyimpanan sistem berkas siap-pakai

source: Django ships with a :class:`django.core.files.storage.FileSystemStorage` class which implements basic local filesystem file storage.
id: Django dibekali dengan kelas :class:`django.core.files.storage.FileSystemStorage` yang menerapkan penyimpanan berkas sistem berkas lokal.

source: For example, the following code will store uploaded files under ``/media/photos`` regardless of what your :setting:`MEDIA_ROOT` setting is::
id: Sebagai contoh, kode berikut akan menyimpan berkas-berkas terunggah dibawah ``/media/photos`` meskipun dari apa pengaturan :setting:`MEDIA_ROOT`::

source: :doc:`Custom storage systems </howto/custom-file-storage>` work the same way: you can pass them in as the ``storage`` argument to a :class:`~django.db.models.FileField`.
id: :doc:`Custom storage systems 1` bekerja cara sama: anda dapat melewatkan mereka sebagai argumen ``storage`` pada sebuah :class:`~django.db.models.FileField`.

source: Formsets
id: Formset

source: You might want to allow the user to create several articles at once. To create a formset out of an ``ArticleForm`` you would do::
id: Anda mungkin mengizinkan pengguna membuat beberapa artikel sekaligus. untuk membuat sebuah formset diluar ``ArticleForm`` anda akan melakukan::

source: You now have created a formset named ``ArticleFormSet``. The formset gives you the ability to iterate over the forms in the formset and display them as you would with a regular form::
id: Anda sekarang telah membuat sebuah formset bernama ``ArticleFormSet``.Formset memberikan anda kemampuan untuk mengulang formulir dalam formset dan menampilkan mereka ketika anda ingin dengan bentuk regular::

source: Formsets can also be indexed into, which returns the corresponding form. If you override ``__iter__``, you will need to also override ``__getitem__`` to have matching behavior.
id: Formset juga dapat mengindeks, yang mengembalikan formulir sesuai. Jika ada menimpa ``__iter__``,anda akan juga butuh menimpa ``__getitem__``untuk memiliki perilaku cocok.

source: Using initial data with a formset
id: Menggunakan data awalan dengan formset

source: There are now a total of three forms showing above. One for the initial data that was passed in and two extra forms. Also note that we are passing in a list of dictionaries as the initial data.
id: Sekarang ada jumlah tiga formulir menampilkan diatas. Satu untuk data awalan yang dilewatkan dalam dan dua bentuk formulir tambahan. Juga catat bahwa kami meleeatkan dalam sebuah daftar dictionary sebagai data awalan.

source: If you use an ``initial`` for displaying a formset, you should pass the same ``initial`` when processing that formset's submission so that the formset can detect which forms were changed by the user. For example, you might have something like: ``ArticleFormSet(request.POST, initial=[...])``.
id: Jika anda menggunakan sebuah ``initial`` untuk menampilkan formset, anda harus melewatkan ``initial`` sama ketika mengolah pengajuan formset itu sehingga formset dapat mengenali formulir-formulir yang berubah oleh pengguna. Sebagai contoh, anda mungkin memiliki sesuatu seperti: ``ArticleFormSet(request.POST, initial=[...])``.

source: :ref:`Creating formsets from models with model formsets <model-formsets>`.
id: :ref:`Creating formsets from models with model formsets 1`.

source: Limiting the maximum number of forms
id: Membatasi nomor maksimal dari formulir

source: The ``max_num`` parameter to :func:`~django.forms.formsets.formset_factory` gives you the ability to limit the number of forms the formset will display::
id: Parameter ``max_num`` pada :func:`~django.forms.formsets.formset_factory` memberikan anda kemampuan membatasi jumlah formulir formset yang akan dimunculkan::

source: A ``max_num`` value of ``None`` (the default) puts a high limit on the number of forms displayed (1000). In practice this is equivalent to no limit.
id: Sebuah nilai ``max_num`` dari ``None`` (awalan) menaruh batasan tinggi pada sejumlah formulir-formulir ditampilkan (1000). Dalam praktiknya ini adalah setara pada tidak ada batasan.

source: Formset validation
id: Pengesahan formset

source: To check how many errors there are in the formset, we can use the ``total_error_count`` method::
id: Untuk memerika seberapa banyak kesalahan ada dalam formset, kami dapat menggunakan metode ``total_error_count``::

source: We can also check if form data differs from the initial data (i.e. the form was sent without any data)::
id: Kami dapat juga memeriksa jika formulir data berbeda dari data awalan (yaitu formulir dikirim tanpa data apapun)::

source: Understanding the ``ManagementForm``
id: Memahami ``ManagementForm``

source: ``total_form_count`` and ``initial_form_count``
id: ``total_form_count`` dan ``initial_form_count``

source: ``BaseFormSet`` has a couple of methods that are closely related to the ``ManagementForm``, ``total_form_count`` and ``initial_form_count``.
id: ``BaseFormSet`` mempunyai sepasang metode yang erat terkait pada ``ManagementForm``, ``total_form_count`` dan ``initial_form_count``.

source: Custom formset validation
id: Penyesuaian pengesahan formset

source: Validating the number of forms in a formset
id: Mensahkan sejumlah formulir dalam formset

source: Django provides a couple ways to validate the minimum or maximum number of submitted forms. Applications which need more customizable validation of the number of forms should use custom formset validation.
id: Django menyediakan sepasang cara untuk mensahkan angka minimal dan maksimal dari formulir diajukan. Aplikasi yang butuh lebih pengesahan penyesuaian dari sejumlah formulir harus menggunakan pengesahan formset penyesuaian.

source: If ``validate_max=True`` is passed to :func:`~django.forms.formsets.formset_factory`, validation will also check that the number of forms in the data set, minus those marked for deletion, is less than or equal to ``max_num``.
id: Jika `Documentation <https://django-formtools.readthedocs.io/>`__ dilewatkan ke :func:`~django.forms.formsets.formset_factory`,pengesahan akan juga memeriksa itu sejumlah formulir dalam kumpulan data, dikurangi itu yang ditandai untuk penghapusan, adalah kurang dari atau setara pada ``max_num``.

source: ``validate_max=True`` validates against ``max_num`` strictly even if ``max_num`` was exceeded because the amount of initial data supplied was excessive.
id: ``validate_max=True`` mensahkan terhadap ``max_num`` dengan ketat bahkan jika ``max_num`` telah melampaui karena sejumlah data pertama disokong telah berlebihan.

source: Dealing with ordering and deletion of forms
id: Berurusan dengan pengurutan dan penghapusan formulir

source: Default: ``False``
id: Awal: ``False``

source: Lets you create a formset with the ability to order::
id: Mari anda membuat sebuah formset dengan memampuan mengurutkan::

source: Lets you create a formset with the ability to select forms for deletion::
id: Mari anda membuat sebuah formset dengan kemampuan memilih formulir untuk penghapusan::

source: Adding additional fields to a formset
id: Menambahkan bidang-bidang tambahan pada sebuah formset

source: Passing custom parameters to formset forms
id: Melewatkan parameter penyesuaian pada formulir formset

source: Sometimes your form class takes custom parameters, like ``MyArticleForm``. You can pass this parameter when instantiating the formset::
id: Terkadang kelas formulir anda mengambil parameter penyesuaian, seperti ``MyArticleForm``.Anda dapat melewatkan parameter ini ketika menginstasiasi formset::

source: Using a formset in views and templates
id: Menggunakan sebuah formset dalam tampilan dan cetakan

source: The ``manage_articles.html`` template might look like this:
id: Cetakan ``manage_articles.html`` mungkin kelihatan seperti ini:

source: However there's a slight shortcut for the above by letting the formset itself deal with the management form:
id: Bagaimanapun ada sedikit jalan pintas untuk diatas dengan membiarkan formset itu sendiri berurusan dengan formulir pengelolaan:

source: The above ends up calling the ``as_table`` method on the formset class.
id: Diatas berakhir memanggil metode ``as_table`` pada kelas formset.

source: Manually rendered ``can_delete`` and ``can_order``
id: Secara manual membangun ``can_delete`` dan ``can_order``

source: If you manually render fields in the template, you can render ``can_delete`` parameter with ``{{ form.DELETE }}``:
id: Jika anda secara manual membangun bidang dalam cetakan, anda dapat membangun parameter ``can_delete`` dengan ``{{ form.DELETE }}``:

source: Using more than one formset in a view
id: Menggunakan lebih dari satu formset dalam sebuah tampilan

source: Working with forms
id: Bekerja dengan formulir

source: About this document
id: Tentang dokumen ini

source: HTML forms
id: Formulir HTML

source: As well as its ``<input>`` elements, a form must specify two things:
id: Sama halnya dengan unsur ``<input>``, sebuah formulir harus menentukan dua hal:

source: *where*: the URL to which the data corresponding to the user's input should be returned
id: *dimana* URL dimana data sesuai ke masukan pengguna harus kembali

source: *how*: the HTTP method the data should be returned by
id: *bagaimana*: Metode HTTP data harus kembali

source: When the ``<input type="submit" value="Log in">`` element is triggered, the data is returned to ``/admin/``.
id: Ketika unsur ``1``dipicu, data dikembalikan ke ``/admin``.

source: ``GET`` and ``POST``
id: ``GET`` dan ``POST``

source: ``GET`` and ``POST`` are the only HTTP methods to use when dealing with forms.
id: ``GET`` dan ``POST`` adalah hanya cara HTTP digunakan untuk berhubungan dengan formulir.

source: ``GET`` and ``POST`` are typically used for different purposes.
id: ``GET`` and ``POST`` adalah khususnya digunakan untuk tujuan berbeda.

source: Django's role in forms
id: Peran Django di formulir

source: Django handles three distinct parts of the work involved in forms:
id: Django menangani tiga bagian berbeda dari pekerjaan melibatkan dalam formulir-formulir:

source: preparing and restructuring data to make it ready for rendering
id: mempersiapkan dan menyusun kembali data untuk membuat itu untuk pengiriman

source: creating HTML forms for the data
id: membuat formulir HTML untuk data

source: receiving and processing submitted forms and data from the client
id: menerima dan mengolah formulir-formulir diajukan dan data dari klien

source: It is *possible* to write code that does all of this manually, but Django can take care of it all for you.
id: Itu *memungkinkan* menulis kode yang melakukan semua ini secara manual, tetapi Django dapat merawat itu semua untuk anda.

source: Forms in Django
id: Formulir di Django

source: We've described HTML forms briefly, but an HTML ``<form>`` is just one part of the machinery required.
id: Kami telah menggambarkan formulir HTML dengan ringkas, tetapi sebuah HTML ``1`` hanya satu bagian dari mesin yang dibutuhkan.

source: The Django :class:`Form` class
id: Kelas :class:`Form` Django

source: When rendering an object in Django, we generally:
id: Ketika membangun sebuah obyek di Django, kami umumnya:

source: pass it to the template context
id: lewatkan ke konteks cetakan

source: expand it to HTML markup using template variables
id: perluas itu pada markah HTML menggunakan variabel cetakan

source: Rendering a form in a template involves nearly the same work as rendering any other kind of object, but there are some key differences.
id: Membangun formulir dalam cetakan melibatkan hampir pekerjaan sama seperti membangun jenis lain dari obyek, tetapi ada beberapa kunci perbedaan.

source: So when we handle a model instance in a view, we typically retrieve it from the database. When we're dealing with a form we typically instantiate it in the view.
id: Jadi ketika kami menangani instance model dalam tampilan, kami khususnya mengambil itu dari basisdata. Ketika kami sedang berhubungan dengan seuah formulir kami khususnya menginstansiasi itu dalam tampilan.

source: When we instantiate a form, we can opt to leave it empty or pre-populate it, for example with:
id: Ketika kami menginstansiasi sebuah formulir, kami dapat memilih meninggalkan itu kosong atau itu sudah-terisi, sebagai contoh dengan:

source: data from a saved model instance (as in the case of admin forms for editing)
id: data dari instance model tersimpan (seperti dalam kasus dari formulir admin untuk penyuntingan).

source: data that we have collated from other sources
id: data yang kami telah kumpulkan dari sumber lain

source: data received from a previous HTML form submission
id: data diterima dari pengajuan formulir HTML sebelumnya

source: The last of these cases is the most interesting, because it's what makes it possible for users not just to read a website, but to send information back to it too.
id: Kasus terakhir ini paling menarik, karena itu memungkinkan untuk pengguna tidak hanya membaca jaringan situs, tetapi juga mengirim informasi kembali ke jaringan situs.

source: Building a form
id: Membangun formulir

source: The work that needs to be done
id: Pekerjaan yang butuh diselesaikan

source: Suppose you want to create a simple form on your website, in order to obtain the user's name. You'd need something like this in your template:
id: Misalnya anda ingin membuat sebuah formulir sederhana pada situs jaringan anda, untuk mendapatkan nama pengguna, anda akan butuh sesuatu seperti ini di cetakan anda:

source: This tells the browser to return the form data to the URL ``/your-name/``, using the ``POST`` method. It will display a text field, labeled "Your name:", and a button marked "OK". If the template context contains a ``current_name`` variable, that will be used to pre-fill the ``your_name`` field.
id: Ini memberitahukan perambah untuk mengembalikan data formulir ke URL ``/your-name/``, menggunakan cara ``POST``. Dia akan menampilkan bidang teks, label "Nama anda:", dan tombol ditandai "OK". Jika konteks cetakan mengandung variabel ``current_name``, yang akan digunakan untuk pra-isian bidang ``your_name``.

source: You'll need a view that renders the template containing the HTML form, and that can supply the ``current_name`` field as appropriate.
id: Anda akan butuh sebuah tampilan yang membangun cetakan mengandung formulir HTML, dan dapat mendukung bidang ``current_name`` sewajarnya.

source: When the form is submitted, the ``POST`` request which is sent to the server will contain the form data.
id: Ketika formulir diajukan, permintaan ``POST`` yang dikirim ke peladen akan mengandung data formulir.

source: Now you'll also need a view corresponding to that ``/your-name/`` URL which will find the appropriate key/value pairs in the request, and then process them.
id: Sekarang anda akan juga butuh sebuah tampilan sesuai ke URL ``/your-name/`` yang akan menemukan pasangan kunci/nilai yang sesuai di permintaan, dan kemudian mengolah mereka.

source: This is a very simple form. In practice, a form might contain dozens or hundreds of fields, many of which might need to be pre-populated, and we might expect the user to work through the edit-submit cycle several times before concluding the operation.
id: Ini adalah formulir sangat sederhana. Dalam praktiknya, sebuah formulir mungkin mengandung lusinan atau ratusan bidang, banyak yang mungkin butuh untuk di pra-kumpulkan, dan kami mungkin mengharapkan pengguna untuk bekerja melalui lingkaran ajukan-sunting beberapa kali sebelum menutup tindakan.

source: We might require some validation to occur in the browser, even before the form is submitted; we might want to use much more complex fields, that allow the user to do things like pick dates from a calendar and so on.
id: Kami mungkin membutuhkan beberapa pengesahan untuk muncul dalam peramban, bahkan sebelum formulir diajukan; kami mungkin ingin menggunakan bidang-bdiang lebih rumit, yang mengizinkan pengguna melakukan hal-hal seperti mengambil tanggal dari kalender dan seterusnya.

source: At this point it's much easier to get Django to do most of this work for us.
id: Pada titik ini itu lebih mudah mendapatkan Django melakukan kebanyakan dari pekerjaan ini untuk kita.

source: Building a form in Django
id: Membangun formulir di Django

source: The :class:`Form` class
id: Kelas :class:`Form`

source: We already know what we want our HTML form to look like. Our starting point for it in Django is this:
id: Kami sudah mengetahui apa kami inginkan formulir HTML kami terlihat seperti. Titik mulai kami untuk itu di Django adalah ini:

source: This defines a :class:`Form` class with a single field (``your_name``). We've applied a human-friendly label to the field, which will appear in the ``<label>`` when it's rendered (although in this case, the :attr:`~Field.label` we specified is actually the same one that would be generated automatically if we had omitted it).
id: Ini menentukan kelas :class:`Form` dengan bidang tunggal (``your_name``). Kami telah berlakukan label ramah-manusia pada bidang, yang akan muncul dalam ``1`` ketika itu dibangun (meskipun dalam kasus ini, :attr:`~Field.label`kami tentukan sebenarnya sama satu yang akan dibangkitkan otomatis jika kami telah menghilangkan itu).

source: The field's maximum allowable length is defined by :attr:`~CharField.max_length`. This does two things. It puts a ``maxlength="100"`` on the HTML ``<input>`` (so the browser should prevent the user from entering more than that number of characters in the first place). It also means that when Django receives the form back from the browser, it will validate the length of the data.
id: Panjang masimal bidang diizinkan ditentukan oleh :attr:`~CharField.max_length`. Ini melakukan dua hal. Itu menaruh ``maxlength="100"``pada HTML ``1`` (jadi peramban harus mencegah pengguna dari memasuki ebih dari sejumlah karakter dalam tempat pertama). Itu juga berarti bahwa ketika Django menerima formulir kembali dari peramban, itu akan mensahkan panjang dari data.

source: A :class:`Form` instance has an :meth:`~Form.is_valid()` method, which runs validation routines for all its fields. When this method is called, if all fields contain valid data, it will:
id: Sebuah instance :class:`Form` mempunyai sebuah metode :meth:`~Form.is_valid()`, yang menjalankan fungsi untuk semua bidang-bidangnya. Ketika metode ini dipanggil, jika semua bidang mengadnung data sah, itu akan:

source: return ``True``
id: kembali ``True``

source: place the form's data in its :attr:`~Form.cleaned_data` attribute.
id: tempatkan data formulir dalam atribut :attr:`~Form.cleaned_data` nya.

source: The whole form, when rendered for the first time, will look like:
id: Formulir keseluruhan, ketika dibangun untuk pertama kali, akan kelihatan seperti:

source: The view
id: Tampilan

source: The template
id: Cetakan

source: We don't need to do much in our ``name.html`` template. The simplest example is:
id: Kami tidak butuh melakukan banyak dalam cetakan ``name.html`` kami. Contoh paling sederhana adalah:

source: All the form's fields and their attributes will be unpacked into HTML markup from that ``{{ form }}`` by Django's template language.
id: Semua bidang formulir dan atribut mereka akan dikeluarkan kedalam markah HTML dari ``{{ form }}`` itu dengan bahasa cetakan Django.

source: Forms and Cross Site Request Forgery protection
id: Perlindungan formulir dan pemalsuan Cross Site Request

source: HTML5 input types and browser validation
id: jenis masukan HTML5 dan pengesahan perambah

source: More about Django :class:`Form` classes
id: Lebih tentang kelas Django :class:`Form`.

source: Models and Forms
id: Model dan Formulir

source: Bound and unbound form instances
id: Instance formulir terikat dan tidak terikat

source: The distinction between :ref:`ref-forms-api-bound-unbound` is important:
id: Perbedaan diantara :ref:`ref-forms-api-bound-unbound` adalah penting:

source: An unbound form has no data associated with it. When rendered to the user, it will be empty or will contain default values.
id: Sebuah formulir tidak terikat tidak mempunyai data terkait dengan itu. Ketika dibanguk ke pengguna, itu akan kosong atau mengandung nilai awalan.

source: A bound form has submitted data, and hence can be used to tell if that data is valid. If an invalid bound form is rendered, it can include inline error messages telling the user what data to correct.
id: Sebuah formulir ikatan telah mengajukan data, dan kemudian dapat digunakan untuk memberitahu jika data adalah sah. Jika sebuah ikatan tidak sah dibangun, itu dapat menyertakan pesan-pesan kesalahan berderet mengatakan pengguna apa yang data untuk diperbaiki.

source: The form's :attr:`~Form.is_bound` attribute will tell you whether a form has data bound to it or not.
id: Atribut formulir :attr:`~Form.is_bound` akan memberitahu anda apakah sebuah formulir mempunyai data terikat ke itu atau tidak.

source: More on fields
id: Lebih pada bidang
