Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Things get more complicated if you use inheritance. Consider a subclass of ``Blog``::
id: Hal-hal dapat lebih rumit jika anda menggunakan warisan. Pertimbangkan subkelas dari ``Blog``::

source: Due to how inheritance works, you have to set both ``pk`` and ``id`` to None::
id: Disebabkan oleh bagaimana warisan bekerja, anda harus menyetel kedua ``pk`` dan ``id`` menjadi None::

source: This process doesn't copy relations that aren't part of the model's database table. For example, ``Entry`` has a ``ManyToManyField`` to ``Author``. After duplicating an entry, you must set the many-to-many relations for the new entry::
id: Pengolahan ini tidak menyalin hubungan yang bukan bagian dari tabel basisdata model. Sebagai contoh, ``Entry`` mempunyai ``ManyToManyField`` terhadap ``Author``. Setelah menggandakan sebuah masukan, anda harus menyetel hubungan many-to-many untuk masukan baru::

source: For a ``OneToOneField``, you must duplicate the related object and assign it to the new object's field to avoid violating the one-to-one unique constraint. For example, assuming ``entry`` is already duplicated as above::
id: Untuk ``OneToOneField``, anda harus menggandakan obyek terkait dan memberikan itu ke bidang obyek baru untuk menghindari melanggar batasan untuk one-to-one. Sebagai contoh, menganggap ``entry`` sudah digandakan seperti diatas::

source: Updating multiple objects at once
id: Memperbaharui banyak obyek sekaligus

source: Sometimes you want to set a field to a particular value for all the objects in a :class:`~django.db.models.query.QuerySet`. You can do this with the :meth:`~django.db.models.query.QuerySet.update` method. For example::
id: Terkadang anda ingin menyetel sebuah bidang ke nilai tertentu untuk semua obyek dalam :class:`~django.db.models.query.QuerySet`. Anda dapat melakukan ini dengan cara :meth:`~django.db.models.query.QuerySet.update`. Sebagai contoh::

source: You can only set non-relation fields and :class:`~django.db.models.ForeignKey` fields using this method. To update a non-relation field, provide the new value as a constant. To update :class:`~django.db.models.ForeignKey` fields, set the new value to be the new model instance you want to point to. For example::
id: Anda dapat hanya menyetel bidang-bidang bukan-hubungan dan bidang-bidang :class:`~django.db.models.ForeignKey` menggunakan metode ini. Untuk memperbaharui bidang-bidang :class:`~django.db.models.ForeignKey`, setel nilai baru ke instance model baru anda ingin tunjuk. Sebagai contoh::

source: The ``update()`` method is applied instantly and returns the number of rows matched by the query (which may not be equal to the number of rows updated if some rows already have the new value). The only restriction on the :class:`~django.db.models.query.QuerySet` being updated is that it can only access one database table: the model's main table. You can filter based on related fields, but you can only update columns in the model's main table. Example::
id: Metode ``update()`` diberlakukan segera dan mengembalikan sejumlah baris cocok oleh permintaan (yang mungkin tidak setara pada sejumlah baris diperbaharui jika baris sudah mempunyai nilai baru). Hanya batasan pada :class:`~django.db.models.query.QuerySet` sedang diperbaharui adalah itu dapat hanya diakses pada tabel basisdata: tabel utama model. Anda dapat menyaring pada bidang-bidang terkait, tetapi anda dapat hanya memperbaharui kolom dalam tabel utama model. Contoh::

source: Be aware that the ``update()`` method is converted directly to an SQL statement. It is a bulk operation for direct updates. It doesn't run any :meth:`~django.db.models.Model.save` methods on your models, or emit the ``pre_save`` or ``post_save`` signals (which are a consequence of calling :meth:`~django.db.models.Model.save`), or honor the :attr:`~django.db.models.DateField.auto_now` field option. If you want to save every item in a :class:`~django.db.models.query.QuerySet` and make sure that the :meth:`~django.db.models.Model.save` method is called on each instance, you don't need any special function to handle that. Just loop over them and call :meth:`~django.db.models.Model.save`::
id: Waspada bahwa metode ``update()`` dirubah secara langsung ke sebuah pernyataan SQL. Itu adalah tindakan pengumpulan untuk pembaharuan langsung. Itu tidak menjalankan metode :meth:`~django.db.models.Model.save` apapun pada model-model anda, atau mengeluarkan sinyal ``pre_save`` atau ``post_save`` (yang akibat dari memanggil :meth:`~django.db.models.Model.save`),atau menerima pilihan bidang :attr:`~django.db.models.DateField.auto_now`. Jika anda ingin mentimpan setiap barang dalam :class:`~django.db.models.query.QuerySet` dan pastikan bahwa metode :meth:`~django.db.models.Model.save` dipanggil pada setiap instance, anda tidak butuh fungsi khusus apapun untuk mengangani itu. Cukup putarkan terhadap mereka dan panggil :meth:`~django.db.models.Model.save`::

source: Calls to update can also use :class:`F expressions <django.db.models.F>` to update one field based on the value of another field in the model. This is especially useful for incrementing counters based upon their current value. For example, to increment the pingback count for every entry in the blog::
id: Panggilan untuk memperbaharui juga menggunakan :class:`F expressions <django.db.models.F>` untuk memperbaharui satu bidang berdasarkan pada nilai dari bidang lain dalam model. Ini adalah khususnya berguna untuk meningkatkan hitungan berdasarkan pada nilai saat ini mereka. Sebagai contoh, untuk menaikkan hitungan pingback untuk setiap masukan dalam blog::

source: However, unlike ``F()`` objects in filter and exclude clauses, you can't introduce joins when you use ``F()`` objects in an update -- you can only reference fields local to the model being updated. If you attempt to introduce a join with an ``F()`` object, a ``FieldError`` will be raised::
id: Bagaimanapun, tidak seperti obyek ``F()`` dalam penyaringan dan tidak menyertakan klausa-klausa, anda tidak dapat memperkenalkan penggabungan ketika anda menggunakan obyek ``F()`` dalam sebuah pembaharuan -- anda hanya dapat mengacu bidang-bidang lokal ke model sedang diperbaharui. Jika anda berusaha memperkenalkan penggabungan dengan sebuah obyek ``F()``, sebuah ``FieldError`` akan dimunculkan::

source: Related objects
id: Obyek terkait

source: When you define a relationship in a model (i.e., a :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.OneToOneField`, or :class:`~django.db.models.ManyToManyField`), instances of that model will have a convenient API to access the related object(s).
id: Ketika anda menentukan hubungan dalam sebuah model (yaitu, sebuah :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.OneToOneField`, atau :class:`~django.db.models.ManyToManyField`),instance-instance dari model itu akan mempunyai API cocok untuk mengakses obyek terkait.

source: Using the models at the top of this page, for example, an ``Entry`` object ``e`` can get its associated ``Blog`` object by accessing the ``blog`` attribute: ``e.blog``.
id: Menggunakan model-model diatas dari halaman ini, sebagai contoh, sebuah obyek ``Entry`` ``c`` dapat mendapatkan obyek ``Blog`` berhubungan dengan mengakses atribut ``blog``: ``e.blog``.

source: (Behind the scenes, this functionality is implemented by Python descriptors_. This shouldn't really matter to you, but we point it out here for the curious.)
id: (Dibelakang layar, kegunaan ini diterapkan oleh descriptors_ Python. Ini tidak tidak masalah buat anda, tetapi kami menunjuk disini untuk keganjilan.)

source: Django also creates API accessors for the "other" side of the relationship -- the link from the related model to the model that defines the relationship. For example, a ``Blog`` object ``b`` has access to a list of all related ``Entry`` objects via the ``entry_set`` attribute: ``b.entry_set.all()``.
id: Django juga membuat pengakses API untuk sisi "lain" dari hubungan -- tautan dari model terkait ke model yang menentukan hubungan. Sebagai contoh, obyek ``Blog`` ``b`` mempunyai akses ke daftar dari semua obyek ``Entry`` terkait melalui atribut ``entry_set``: ``b.entry_set.all()``.

source: All examples in this section use the sample ``Blog``, ``Author`` and ``Entry`` models defined at the top of this page.
id: Semua contoh dalam bagian ini menggunakan contoh model ``Blog``, ``Author`` and ``Entry`` ditentukan pada atas dari halaman ini.

source: One-to-many relationships
id: Hubungan satu-ke-banyak

source: Forward
id: Meneruskan

source: If a model has a :class:`~django.db.models.ForeignKey`, instances of that model will have access to the related (foreign) object via a simple attribute of the model.
id: Jika sebuah model mempunyai :class:`~django.db.models.ForeignKey`, instance dari model tersebut akan mempunyai akses ke obyek (asing) terkait melalui atribut sederhana dari model.

source: You can get and set via a foreign-key attribute. As you may expect, changes to the foreign key aren't saved to the database until you call :meth:`~django.db.models.Model.save`. Example::
id: Anda daat mendapatkan dan menyetel melalui atribut foreign-key. Seperti anda mungkin harapkan, perubahan pada foreign key tidak disimpan ke basisdata sampai anda memanggil :meth:`~django.db.models.Model.save`. Contoh::

source: If a :class:`~django.db.models.ForeignKey` field has ``null=True`` set (i.e., it allows ``NULL`` values), you can assign ``None`` to remove the relation. Example::
id: Jika sebuah bidang :class:`~django.db.models.ForeignKey` mempunyai ``null=True`` disetel (yaitu nilai ``NULL``), anda dapat memberikan ``None`` untuk memindahkan hubungan. Contoh::

source: Forward access to one-to-many relationships is cached the first time the related object is accessed. Subsequent accesses to the foreign key on the same object instance are cached. Example::
id: Akses mengirimkan ke hubungan one-to-many disimpan sementara pada kali pertama obyek terkait diakses. Akses selanjutnya ke foreign key pada instance obyek sama disimpan sementara. Contoh::

source: Note that the :meth:`~django.db.models.query.QuerySet.select_related` :class:`~django.db.models.query.QuerySet` method recursively prepopulates the cache of all one-to-many relationships ahead of time. Example::
id: Catat bahwa :meth:`~django.db.models.query.QuerySet.select_related` metode :class:`~django.db.models.query.QuerySet` berulang mengisi dimuka cache dari semua hubungan one-to-many sebelumnya. Contoh::

source: Following relationships "backward"
id: Mengikuti hubungan ""ke belakang"

source: If a model has a :class:`~django.db.models.ForeignKey`, instances of the foreign-key model will have access to a :class:`~django.db.models.Manager` that returns all instances of the first model. By default, this :class:`~django.db.models.Manager` is named ``FOO_set``, where ``FOO`` is the source model name, lowercased. This :class:`~django.db.models.Manager` returns ``QuerySets``, which can be filtered and manipulated as described in the "Retrieving objects" section above.
id: Jika model mempunyai :class:`~django.db.models.ForeignKey`,instance-instance dari model foreign-key akan mempunyai akses ke :class:`~django.db.models.Manager`yang mengembalikan semua instance dari model pertama. Secara awalan, :class:`~django.db.models.Manager` ini dinamai ``FOO_set``, dimana ``FOO``adalah nama model sumber, huruf kecil. :class:`~django.db.models.Manager` ini mengembalikan ``QuerySets``, yang dapat disaring dan dirubah seperti digambarkan dalam bagian "Mengambil obyek" diatas.

source: You can override the ``FOO_set`` name by setting the :attr:`~django.db.models.ForeignKey.related_name` parameter in the :class:`~django.db.models.ForeignKey` definition. For example, if the ``Entry`` model was altered to ``blog = ForeignKey(Blog, on_delete=models.CASCADE, related_name='entries')``, the above example code would look like this::
id: Anda dapat menimpa nama ``FOO_set`` dengan mengatur parameter :attr:`~django.db.models.ForeignKey.related_name` dalam penentuan :class:`~django.db.models.ForeignKey`. Sebagai contoh, jika model ``Entry`` telah diubah pada ``blog = ForeignKey(Blog, on_delete=models.CASCADE, related_name='entries')``, contoh kode diatas akan terlihat seperti ini::

source: Using a custom reverse manager
id: Menggunakan sebuah penyesuaian pengelola membalikkan

source: By default the :class:`~django.db.models.fields.related.RelatedManager` used for reverse relations is a subclass of the :ref:`default manager <manager-names>` for that model. If you would like to specify a different manager for a given query you can use the following syntax::
id: Secara awalan :class:`~django.db.models.fields.related.RelatedManager` digunakan untuk hubungan balikan adalah sebuah subkelas dari :ref:`default manager 1` untuk model itu. Jika anda ingin menentukan pengelola berbeda untuk permintaan yang diberikan anda dapat menggunakan sintaksis berikut::

source: If ``EntryManager`` performed default filtering in its ``get_queryset()`` method, that filtering would apply to the ``all()`` call.
id: Jika ``EntryManager`` melakukan penyaringan awalan dalam metode ``get_queryset()`` nya, bahwa penyaring akan berlaku ke panggilan ``all()``.

source: Of course, specifying a custom reverse manager also enables you to call its custom methods::
id: Tentu saja, menentukan pengelola balikan penyesuaian juga mengadakan anda memanggil metode penyesuaiannya::

source: Additional methods to handle related objects
id: Cara tambahan untuk menangani obyek terkait

source: In addition to the :class:`~django.db.models.query.QuerySet` methods defined in "Retrieving objects" above, the :class:`~django.db.models.ForeignKey` :class:`~django.db.models.Manager` has additional methods used to handle the set of related objects. A synopsis of each is below, and complete details can be found in the :doc:`related objects reference </ref/models/relations>`.
id: Sebagai tambahan pada metode :class:`~django.db.models.query.QuerySet` ditentukan dalam "Mengambil obyek" diatas, :class:`~django.db.models.ForeignKey` :class:`~django.db.models.Manager` mempunyai metode-metode tambahan digunakan untuk menangangi kumpulan dari obyek-obyek terkait. Sebuah ringkasan dari masing-masing dibawah, dan rincian lengkap dapat ditemukan dalam :doc:`related objects reference 1`.

source: ``add(obj1, obj2, ...)``
id: ``tambah(obj1, obj2, ...)``

source: Adds the specified model objects to the related object set.
id: Menambahkan obyek model ditentukan ke kumpulan obyek terkait.

source: ``create(**kwargs)``
id: ``buat(**kwargs)``

source: Creates a new object, saves it and puts it in the related object set. Returns the newly created object.
id: Membuat obyek baru, menyimpannya dan menaruhnya dalam kumpulan obyek terkait. Mengembalikan obyek dibuat terbaru.

source: ``remove(obj1, obj2, ...)``
id: ``pindahkan(obj1, obj2, ...)``

source: Removes the specified model objects from the related object set.
id: Pindahkan obyek model ditentukan dari kumpulan obyek terkait.

source: Removes all objects from the related object set.
id: Pindahkan semua obyek dari kumpulan obyek terkait.

source: Replace the set of related objects.
id: Ganti kumpulan dari obyek terkait.

source: If the ``clear()`` method is available, any pre-existing objects will be removed from the ``entry_set`` before all objects in the iterable (in this case, a list) are added to the set. If the ``clear()`` method is *not* available, all objects in the iterable will be added without removing any existing elements.
id: Jika metode ``clear()`` tersedia, apapun obyek pra-ada akan dipindahkan dari ``entry_set`` sebelum semua obyek dalam perulangan (dalam kasus ini, sebuah daftar) ditambahkan ke kumpulan. Jika metode ``clear()`` *tidak* tersedia, semua obyek dalam perulangan akan ditambahan tanpa memindahkan unsur-unsur apapun yang ada.

source: Each "reverse" operation described in this section has an immediate effect on the database. Every addition, creation and deletion is immediately and automatically saved to the database.
id: Setiap tindakan "reverse" digambarkan dalam bagian ini mempunyai pengaruh segera pada basisdata. Setiap penambahan, pembuatan dan penghapusan segera dan otomatis disimpan ke basisdata.

source: An example makes this easier to understand::
id: Sebuah contoh membuatnya mudah untuk dipahami::

source: Like :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` can specify :attr:`~django.db.models.ManyToManyField.related_name`. In the above example, if the :class:`~django.db.models.ManyToManyField` in ``Entry`` had specified ``related_name='entries'``, then each ``Author`` instance would have an ``entries`` attribute instead of ``entry_set``.
id: Seeprti :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField`dapat menentukan :attr:`~django.db.models.ManyToManyField.related_name`. Dalam contoh diatas, jika :class:`~django.db.models.ManyToManyField` di ``Entry`` telah menentukan ``related_name='entries'``,kemudian setiap instance ``Author`` akan memiliki sebuah atribut ``entries`` daripada ``entry_set``.

source: One-to-one relationships are very similar to many-to-one relationships. If you define a :class:`~django.db.models.OneToOneField` on your model, instances of that model will have access to the related object via a simple attribute of the model.
id: Hubungan one-to-one sangat mirip ke hubungan many-to-one. Jika anda menentukan :class:`~django.db.models.OneToOneField` di model anda, instance-instance dari model itu akan mempunyai akses ke obyek terkait melalui atribut sederhana dari model.

source: The difference comes in "reverse" queries. The related model in a one-to-one relationship also has access to a :class:`~django.db.models.Manager` object, but that :class:`~django.db.models.Manager` represents a single object, rather than a collection of objects::
id: Perbedaan datang dalam permintaan "reverse". Model terkait dalam hubungan one-to-one juga mempunyai akses ke obyek :class:`~django.db.models.Manager`, tetapi :class:`~django.db.models.Manager`itu mewakili obyek tunggal, daripada sebuah kumpulan obyek-obyek::

source: If no object has been assigned to this relationship, Django will raise a ``DoesNotExist`` exception.
id: Jika tidak ada obyek diberikan ke hubungan ini, Django akan memunculkan pengecualian ``DoesNotExist``.

source: Instances can be assigned to the reverse relationship in the same way as you would assign the forward relationship::
id: Instance-instance dapat diberikan ke hubungan balikan dalam cara sama seperti anda akan memberikan meneruskan hubungan::

source: How are the backward relationships possible?
id: Bagaimana hubungan kebelakang dimungkinkan?

source: Other object-relational mappers require you to define relationships on both sides. The Django developers believe this is a violation of the DRY (Don't Repeat Yourself) principle, so Django only requires you to define the relationship on one end.
id: Pemeta hubungan-obyek lainnya membutuhkan anda menentukan hubungan pada kedua sisi. Pengembang Django percaya ini adalah pelanggaran dari prinsip DRY (Don't Repeat Yourself), jadi Django hanya membutuhkan anda menentukan hubungan pada satu akhiran.

source: But how is this possible, given that a model class doesn't know which other model classes are related to it until those other model classes are loaded?
id: Tetapi bagaimana ini mungkin, memberikan itu kelas model yang tidak mengetahui mana kelas-kelas model lain terkait ke itu sampai kelas-kelas model lain tersebut dimuat?

source: The answer lies in the :data:`app registry <django.apps.apps>`. When Django starts, it imports each application listed in :setting:`INSTALLED_APPS`, and then the ``models`` module inside each application. Whenever a new model class is created, Django adds backward-relationships to any related models. If the related models haven't been imported yet, Django keeps tracks of the relationships and adds them when the related models eventually are imported.
id: Jawaban terletak di :data:`app registry <django.apps.apps>`. Ketika Django mulai, itu mengimpor setiap aplikasi terdaftar di :setting:`INSTALLED_APPS`, dan kemudian modul ``models`` didalam setiap aplikasi. Kapanpun sebuah kelas model dibuat, Django menambahkan hubungan-kebelakang ke setiap model terkait. Jika model terkait belum diimpor, Django menjaga jalur dari hubungan dan menambahkan mereka ketika model terkait akhirnya diimpor.

source: For this reason, it's particularly important that all the models you're using be defined in applications listed in :setting:`INSTALLED_APPS`. Otherwise, backwards relations may not work properly.
id: Untuk alasan ini, itu adalah khususnya penting bahwa semua model anda sedang gunakan ditentukan dalam aplikasi terdaftar dalam :setting:`INSTALLED_APPS`. Sebaliknya, hubungan kebelakang mungkin tidak bekerja dengan benar.

source: Queries over related objects
id: Meminta terhadap obyek terkait

source: Queries involving related objects follow the same rules as queries involving normal value fields. When specifying the value for a query to match, you may use either an object instance itself, or the primary key value for the object.
id: Permintaan melibatkan obyek-obyek terkait mengikuti aturan sama seperti permintaan melibatkan bidang-bidang nilai biasa. Ketika menentukan nilai untuk permintaan untuk pencocokan, anda mungkin menggunakan salah satu instance obyek itu sendiri, atau nilai primary key untuk obyek.

source: For example, if you have a Blog object ``b`` with ``id=5``, the following three queries would be identical::
id: Sebagai contoh, jika anda mempunyai sebuah obyek Blog ``b`` dengan ``id=5``, tiga permintaan berikut akan mirip::

source: Falling back to raw SQL
id: Kembali ke mentah SQL

source: If you find yourself needing to write an SQL query that is too complex for Django's database-mapper to handle, you can fall back on writing SQL by hand. Django has a couple of options for writing raw SQL queries; see :doc:`/topics/db/sql`.
id: Jika anda menemukan anda sendiri butuh menulis permintaan SQL yang terlalu rumit untuk pemetaan-basisdata Django untuk ditangani, anda dapat kembali menulis SQL dengan tangan. Django mempunyai sepasang pilihan untuk menulis permintaan SQL mentah; lihat :doc:`/topics/db/sql`.

source: Finally, it's important to note that the Django database layer is merely an interface to your database. You can access your database via other tools, programming languages or database frameworks; there's nothing Django-specific about your database.
id: Akhirnya, itu penting dicatat bahwa lapisan basisdata Django hanya antarmuka ke basisdata anda. Anda dapat mengakses basisdata anda melalui alat-alat lain, bahasa pemrograman atau kerangka basisdata; tidak ada spesifik-Django tentang basisdata anda.

source: Search
id: Cari

source: A common task for web applications is to search some data in the database with user input. In a simple case, this could be filtering a list of objects by a category. A more complex use case might require searching with weighting, categorization, highlighting, multiple languages, and so on. This document explains some of the possible use cases and the tools you can use.
id: Sebuah tugas umum untuk aplikasi jaringan adalah untuk mencari beberapa data dalam basisdata dengan masukan pengguna. Dalam sebuah kasus sederhana, ini dapat menyaring daftar dari obyek berdasarkan sebuah kategori. Kasus penggunaan lebih rumit mungkin membutuhkan pencarian dengan berat, kategori, penyorotan, banyak bahasa, dan seterusnya. Dokumen ini menjelaskan beberapa dari kemungkinan kasus penggunaan dan alat-alat anda dapat gunakan.
