Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Aggregating annotations
id: Pengumpulan catatan

source: You can also generate an aggregate on the result of an annotation. When you define an ``aggregate()`` clause, the aggregates you provide can reference any alias defined as part of an ``annotate()`` clause in the query.
id: Anda dapat juga membangkitkan sebuah pengumpulan pada hasil dari sebuah catatan. Ketika anda menentukan sebuah klausa ``aggregate()``, pengumpulan anda sediakan dapat mengacu setiap nama lain ditentukan sebagai bagian dari sebuah klausa ``annotated()`` dalam permintaan.

source: For example, if you wanted to calculate the average number of authors per book you first annotate the set of books with the author count, then aggregate that author count, referencing the annotation field::
id: Sebagai contoh, jika anda ingin menjumlahkan angka rata-rata dari penulis per buku anda pertama membubuhi catatan kumpulan buku dengan jumlah penulis, lalu kumpulkan jumlah penulis itu, mengacu bidang membubuhi catatan ::

source: Examples of model relationship API usage
id: Contoh-contoh dari hubungan model penggunaan API

source: Many-to-many relationships
id: Hubungan banyak-ke-banyak

source: To define a many-to-many relationship, use :class:`~django.db.models.ManyToManyField`.
id: Untuk menentukan hubungan many-to-many, gunakan :class:`~django.db.models.ManyToManyField`.

source: In this example, an ``Article`` can be published in multiple ``Publication`` objects, and a ``Publication`` has multiple ``Article`` objects:
id: Dalam contoh ini, sebuah ``Article`` dapat diterbitkan dalam banyak obyek ``Publication``, dan sebuah ``Publication`` mempunyai banyak obyek ``Article``:

source: What follows are examples of operations that can be performed using the Python API facilities. Note that if you are using :ref:`an intermediate model <intermediary-manytomany>` for a many-to-many relationship, some of the related manager's methods are disabled, so some of these examples won't work with such models.
id: Berikut ini adalah contoh-contoh dari tindakan yang dapat dilakukan menggunakan fasilitas API Python. Catat bahwa jika anda sedang menggunakan :ref:`an intermediate model <intermediary-manytomany>` untuk hubungan many-to-many, beberapa dari metode pengelola terkait ditiadakan, jadi beberapa dari contoh-contoh ini tidak akan bekerja dengan model-model seperti itu.

source: Create an ``Article``::
id: Buat sebuah ``Artikel``::

source: You can't associate it with a ``Publication`` until it's been saved::
id: Anda tidak dapat mengkaitkan itu dengan ``Publication`` sampai itu telah disimpan::

source: Save it! ::
id: Simpan itu! ::

source: Associate the ``Article`` with a ``Publication``::
id: Kaitkan ``Article`` dengan ``Publication``::

source: Adding an object of the wrong type raises :exc:`TypeError`::
id: Menambahkan sebuah obyek dari jenis salah memunculkan :exc:`TypeError`::

source: Create and add a ``Publication`` to an ``Article`` in one step using :meth:`~django.db.models.fields.related.RelatedManager.create`::
id: Buat dan tambah sebuah ``Publication`` pada sebuah ``Article`` di satu langkah menggunakan :meth:`~django.db.models.fields.related.RelatedManager.create`::

source: ``Article`` objects have access to their related ``Publication`` objects::
id: Obyek ``Article`` telah mengakses ke obyek ``Publication`` terhubung mereka::

source: ``Publication`` objects have access to their related ``Article`` objects::
id: Obyek ``Publication`` telah mengakses ke obyek ``Article`` terhubung mereka::

source: Many-to-many relationships can be queried using :ref:`lookups across relationships <lookups-that-span-relationships>`::
id: Hubungan many-to-many dapat diminta menggunakan :ref:`lookups across relationships <lookups-that-span-relationships>`::

source: The :meth:`~django.db.models.query.QuerySet.count` function respects :meth:`~django.db.models.query.QuerySet.distinct` as well::
id: Fungsi :meth:`~django.db.models.query.QuerySet.count` menghormati :meth:`~django.db.models.query.QuerySet.distinct` juga::

source: Reverse m2m queries are supported (i.e., starting at the table that doesn't have a :class:`~django.db.models.ManyToManyField`)::
id: Membalikkan permintaan m2m didukung (yaitu, dimulai pada tabel yang tidak mempunyai sebuah :class:`~django.db.models.ManyToManyField`)::

source: Excluding a related item works as you would expect, too (although the SQL involved is a little complex)::
id: Tidak termasuk barang terkait bekerja ketika anda akan mengharapkan, terlalu (meskipun SQL terlibat adalah sedikit rumit)::

source: If we delete a ``Publication``, its ``Articles`` won't be able to access it::
id: Jika kami menghapus ``Publication``, ``Articles`` nya tidak akan dapat mengaksesnya::

source: If we delete an ``Article``, its ``Publications`` won't be able to access it::
id: Jika kami menghapus sebuah ``Article``, ``Publications`` nya tidak akan dapat mengakses itu::

source: Adding via the 'other' end of an m2m::
id: Menambahkan melalui akhiran 'other' dari sebuah m2m::

source: Adding via the other end using keywords::
id: Menambahkan melalui akhiran lain menggunakan kata kunci::

source: Removing ``Publication`` from an ``Article``::
id: Memindahkan ``Publication`` dari sebuah ``Article``::

source: And from the other end::
id: Dan dari akhiran lain::

source: Relation sets can be set::
id: Kumpulan hbungan dapat disetel::

source: Relation sets can be cleared::
id: Kumpulan hubungan dapat dibersihkan::

source: And you can clear from the other end::
id: Dan anda dapat membersihkan dari akhiran lain::

source: Recreate the ``Article`` and ``Publication`` we have deleted::
id: Membuat kembali ``Article`` dan ``Publication`` kami telah hapus::

source: Bulk delete some ``Publications`` - references to deleted publications should go::
id: Menghapus massal beberaoa ``Publications`` - acuan pada untuk menghapus penerbitan harus pergi::

source: Bulk delete some articles - references to deleted objects should go::
id: Menghapus massal beberapa artikel - acuan pada menghapus obyek harus pergi::

source: After the :meth:`~django.db.models.query.QuerySet.delete`, the :class:`~django.db.models.query.QuerySet` cache needs to be cleared, and the referenced objects should be gone::
id: Setelah :meth:`~django.db.models.query.QuerySet.delete`, cache :class:`~django.db.models.query.QuerySet` butuh dibersihkan, obyek acuan harus hilang::

source: Many-to-one relationships
id: Hubungan banyak-ke-satu

source: To define a many-to-one relationship, use :class:`~django.db.models.ForeignKey`::
id: Untuk menentukan hubungan many-to-one, gunakan :class:`~django.db.models.ForeignKey`::

source: What follows are examples of operations that can be performed using the Python API facilities.
id: Apa yang mengikuti adalah contoh-contoh dari tindakan yang dapat dilakukan menggunakan fasilitas API Python.

source: Create a few Reporters::
id: Buat sedikir Reporter::

source: Create an Article::
id: Buat sebuah Artikel::

source: Note that you must save an object before it can be assigned to a foreign key relationship. For example, creating an ``Article`` with unsaved ``Reporter`` raises ``ValueError``::
id: Catat bahwa anda harus menyimpan sebuah obyek sebelum itu dapat diberikan ke hubungan foreign key. Sebagai contoh, membuat ``Article`` dengan ``Reporter`` tidak disimpan memunculkan ``ValueError``::

source: Article objects have access to their related Reporter objects::
id: Obyek artikel mempunyai akses ke obyek Reporter terkait::

source: Create an Article via the Reporter object::
id: Buat sebuah Article melalui obyek Reporter::

source: Add the same article to a different article set - check that it moves::
id: Tambah artikel sama ke kumpulan artikel berbeda - periksa bahwa itu berpindah::

source: Adding an object of the wrong type raises TypeError::
id: Menambahkan sebuah obyek dari jenis salah memunculkan TypeError::

source: Note that in the last example the article has moved from John to Paul.
id: Catat bahwa di contoh terakhir artikel telah dipindahkan dari John ke Paul.

source: Related managers support field lookups as well. The API automatically follows relationships as far as you need. Use double underscores to separate relationships. This works as many levels deep as you want. There's no limit. For example::
id: Pengelola terkait mendukung pencarian bidang-bidang juga. API otomatis mengikuti hubungan sejauh anda butuhkan. Gunakan garis bawah ganda untuk memisahkan hubungan. Ini bekerja sebanyak tingkatan yang anda inginkan. Tidak ada batasan. Sebagai contoh::

source: Exact match is implied here::
id: Benar-benar cocok tersirat disini::

source: Query twice over the related field. This translates to an AND condition in the WHERE clause::
id: Permintaan dua kali lebih bidang terkait. Ini menterjemahkan pada sebuah keadaan AND dalam klausa WHERE::

source: For the related lookup you can supply a primary key value or pass the related object explicitly::
id: Untuk pencarian terkait anda dapat menyediakan sebuah nilai primary key atau lewatkan obyek terkait dengan tegas::

source: You can also use a queryset instead of a literal list of instances::
id: Anda dapat juga menggunakan queryset daripada daftar harfiah dari instance::

source: Querying in the opposite direction::
id: Meminta di arah berlawanan:

source: Counting in the opposite direction works in conjunction with distinct()::
id: Menghitung dalam arah berlawanan bekerja dalam hubungan dengan distinct()::

source: Queries can go round in circles::
id: Permintaan dapat berputar seperti lingkaran::

source: If you delete a reporter, his articles will be deleted (assuming that the ForeignKey was defined with :attr:`django.db.models.ForeignKey.on_delete` set to ``CASCADE``, which is the default)::
id: Jika anda menghapus sebuah reporter, artikel dia akan dihapus (menganggap bahwa ForeignKey telah ditentukan dengan :attr:`django.db.models.ForeignKey.on_delete` setel menjadi ``CASCADE``, yang merupakan awalan)::

source: You can delete using a JOIN in the query::
id: Anda dapat menghapus menggunakan JOIN di permintaan::

source: One-to-one relationships
id: Hubungan satu-ke-satu

source: To define a one-to-one relationship, use :class:`~django.db.models.OneToOneField`.
id: Untuk menentukan hubungan satu-ke-satu, gunakan :class:`~django.db.models.OneToOneField`.

source: In this example, a ``Place`` optionally can be a ``Restaurant``::
id: Dalam contoh ini, sebuah pilihan ``Place`` dapat menjadi sebuah ``Restaurant``::

source: Create a couple of Places::
id: Buat sepasang Place::

source: Create a Restaurant. Pass the ID of the "parent" object as this object's ID::
id: Buat sebuah restoran. Lewatkan ID dari obyek "parent" seperti ini ID obyek::

source: A Restaurant can access its place::
id: Sebuah Restaurant dapat mengakses tempatnya::

source: A Place can access its restaurant, if available::
id: Sebuah Place dapat mengakses restorannya, jika tersedia::

source: p2 doesn't have an associated restaurant::
id: p2 tidak mempunyai restoran terkait::

source: You can also use ``hasattr`` to avoid the need for exception catching::
id: Anda dapat juga menggunakan ``hasattr`` untuk menghindari kebutuhan untuk menangkap pengecualian::

source: Set the place using assignment notation. Because place is the primary key on Restaurant, the save will create a new restaurant::
id: Setel tempat menggunakan penugasan catatan. Karena tempat adalah primary key pada Restaurant, penyimpanan akan membuat sebuah restoran baru::

source: Set the place back again, using assignment in the reverse direction::
id: Setel tempat kembali lagi, menggunakan penugasan dalam membalikkan arah::

source: Note that you must save an object before it can be assigned to a one-to-one relationship. For example, creating a ``Restaurant`` with unsaved ``Place`` raises ``ValueError``::
id: Catat bahwa anda harus menyimpan sebuah obyek sebelum itu dapat diberikan ke hubungan one-to-one. Sebagai contoh, membuat ``Restaurant`` dengan ``Place`` tidak disimpan memunculkan ``ValueError``::

source: Restaurant.objects.all() just returns the Restaurants, not the Places. Note that there are two restaurants - Ace Hardware the Restaurant was created in the call to r.place = p2::
id: Restaurant.objects.all() hanya mengembalikan Restaurants, bukan the Places. Catat bahwa ada dua restoran - Ace Hardware Restaurant telah dibuat di panggilan pada r.place = p2::

source: Place.objects.all() returns all Places, regardless of whether they have Restaurants::
id: Place.objects.all() mengembalikan semua Places, tanpa memperhatikan apakah mereka mempunyai Restaurants::

source: You can query the models using :ref:`lookups across relationships <lookups-that-span-relationships>`::
id: Anda dapat meminta model menggunakan :ref:`lookups across relationships <lookups-that-span-relationships>`::

source: This of course works in reverse::
id: Perjalanan ini bekerja dalam membalikkan::

source: Add a Waiter to the Restaurant::
id: Tambah Waiter ke Restaurant::

source: Query the waiters::
id: Meminta pelayan::

source: Models and databases
id: Model dan basisdata

source: A model is the single, definitive source of data about your data. It contains the essential fields and behaviors of the data you're storing. Generally, each model maps to a single database table.
id: Sebuah model adalah tunggal, sumber pasti dari data tentang data anda. Itu mengandung bidang penting dan perilaku dari data anda sedang simpan. Umumnya, setiap model memetakan ke tabel basisdata tunggal.

source: Database instrumentation
id: Peralatan basisdata

source: To help you understand and control the queries issued by your code, Django provides a hook for installing wrapper functions around the execution of database queries. For example, wrappers can count queries, measure query duration, log queries, or even prevent query execution (e.g. to make sure that no queries are issued while rendering a template with prefetched data).
id: Untuk membantu anda memahami dan mengendalikan permintaan dengan kode anda, Django menyediakan sebuah kaitan untuk memasang fungsi pembungkus disekitar penjalanan dari permintaan basisdata. Sebagai contoh, pembungkus dapat menghitung permintaan, mengukur lama permintaan, mencatat permintaan, atau bahkan mencegah penjalanan permintaan (sebagai contoh memastikan bahwa tidak ada permintaan diterbitkan selagi membangun cetakan dengan data pra pengambilan).

source: The wrappers are modeled after :doc:`middleware </topics/http/middleware>` -- they are callables which take another callable as one of their arguments. They call that callable to invoke the (possibly wrapped) database query, and they can do what they want around that call. They are, however, created and installed by user code, and so don't need a separate factory like middleware do.
id: Pembungkus-pembungkus dimodelkan setelah :doc:`middleware 1` --mereka adalah callable yang mengambil callable lain sebagai argumen mereka. Mereka memanggil bahwa callable untuk meminta (kemungkinan dibungkus) permintaan basisdata, dan mereka dapat melakukan apa mereka ingin disekitaran panggilan itu. Mereka adalah, bagaimanapun, dibuat dan dipasang oleh kode pengguna, dan jadi tidak butuh memisahkan factory seperti middleware lakukan.

source: Installing a wrapper is done in a context manager -- so the wrappers are temporary and specific to some flow in your code.
id: Memasang sebuah pembungkus selesai dalam sebuah pengelola konteks -- jadi pembungkus adalah sementara dan tertentu pada beberapa alur di kode anda.

source: As mentioned above, an example of a wrapper is a query execution blocker. It could look like this::
id: Seperti disebutkan diatas, sebuah contoh dari sebuah pembungkus adalah penghadang penjalanan permintaan. Itu dapat terlihat seperti ini::

source: And it would be used in a view to block queries from the template like so::
id: Dan itu akan digunakan dalam sebauh tampilan untuk menghadang permintaan dari cetakan seperti berikut::

source: The parameters sent to the wrappers are:
id: Parameter dikirim ke pembungkus adalah:

source: ``execute`` -- a callable, which should be invoked with the rest of the parameters in order to execute the query.
id: :doc:`middleware 1` -- sebuah callable, yang harus diminta dengan sisa dari parameter untuk menjalankan permintaan.

source: ``sql`` -- a ``str``, the SQL query to be sent to the database.
id: ``sql`` -- sebuah ``str``, permintaan SQL dikirim ke basisdata.

source: ``params`` -- a list/tuple of parameter values for the SQL command, or a list/tuple of lists/tuples if the wrapped call is ``executemany()``.
id: ``params`` -- sebuah list/tuple dari nilai-nilai parameter untuk perintah SQL, atau list/tuple dari list/tuple jika panggilan dibungkus adalah ``executemany()``.

source: ``many`` -- a ``bool`` indicating whether the ultimately invoked call is ``execute()`` or ``executemany()`` (and whether ``params`` is expected to be a sequence of values, or a sequence of sequences of values).
id: ``many`` -- sebuah ``bool`` menunjukkan akhirnya panggilan dipangil adalah ``execute()`` atau ``executemany()``(dan apakah ``params`` diharapkan menjadi berurut dari nilai-nilai, atau urutan dari urutan-urutan dari nilai-nilai).

source: ``context`` -- a dictionary with further data about the context of invocation. This includes the connection and cursor.
id: ``context`` -- sebuah dictionary dengan data lebih lanjut tentang konteks dari permohonan. Ini menyertakan hubungan dan kursor.

source: Using the parameters, a slightly more complex version of the blocker could include the connection name in the error message::
id: Menggunakan parameter, versi sedikit lebih rumit dari penghadang dapat menyertakan nama hubungan dalam pesan kesalahan::

source: For a more complete example, a query logger could look like this::
id: Untuk contoh lebih lengkap, sebuah pencatat permintaan dapat terlihat seperti ini::

source: To use this, you would create a logger object and install it as a wrapper::
id: Untuk menggunakan ini, anda dapat membuat sebuah obyek pencatat dan memasang itu sebagai pembungkus::

source: Returns a context manager which, when entered, installs a wrapper around database query executions, and when exited, removes the wrapper. The wrapper is installed on the thread-local connection object.
id: Mengembalikan pengeola konteks yang, ketika dimasukkan, memasang sebuah pembungkus disekitar penjalanan permintaan basisdata, dan ketika keluar, memindahkan pembungkus. Pembungkus dipasang pada obyek hubungan lokal-thread.

source: ``wrapper`` is a callable taking five arguments. It is called for every query execution in the scope of the context manager, with arguments ``execute``, ``sql``, ``params``, ``many``, and ``context`` as described above. It's expected to call ``execute(sql, params, many, context)`` and return the return value of that call.
id: ``wrapper`` adalah sebuah callable mengambil lima argumen. Itu dipanggil untuk setiap penjalanan permintaan dalam cakupan dari pengelola konteks, dengan argumen ``execute``, ``sql``, ``params``, ``many``, dan ``context``sebagai digambarkan diatas. Itu diharapkan memanggil ``execute(sql, params, many, context)``dan mengembalikan nilai balikan dari panggilan itu.

source: Managers
id: Pengelola

source: A ``Manager`` is the interface through which database query operations are provided to Django models. At least one ``Manager`` exists for every model in a Django application.
id: Sebuah ``manager`` adalah antarmuka melalui mana tindakan permintaan basisdata disediakan pada model Django. Setidaknya satu ``Manager`` ada untuk setiap model dalam sebuah apliaksi Django.

source: The way ``Manager`` classes work is documented in :doc:`/topics/db/queries`; this document specifically touches on model options that customize ``Manager`` behavior.
id: Cara kelas-kelas ``Manager`` bekerja didokumentasikan dalam :doc:`/topics/db/queries`; dokumen ini secara khusus menyentuh pada pilihan model yang menyesuaikan perilaku ``Manager``.

source: Manager names
id: Nama pengelola

source: By default, Django adds a ``Manager`` with the name ``objects`` to every Django model class. However, if you want to use ``objects`` as a field name, or if you want to use a name other than ``objects`` for the ``Manager``, you can rename it on a per-model basis. To rename the ``Manager`` for a given class, define a class attribute of type ``models.Manager()`` on that model. For example::
id: Secara awalan, Django menambah sebuah ``Manager`` dengan nama ``objects`` pada setiap kelas model Django. Bagaimanapun, jika anda ingin menggunakan ``objects`` sebagai sebuah nama bidang, atau jika anda ingin menggunakan sebuah nama selain dari ``objects`` untuk ``Manager``, anda dapat menamai kembali itu pada berdasarkan per-model. Untuk menamai kembali ``Manager`` untuk kelas diberikan, tentukan sebuah atribut kelas dari jenis ``models.Manager()`` pada model itu. Sebagai contoh::

source: Using this example model, ``Person.objects`` will generate an ``AttributeError`` exception, but ``Person.people.all()`` will provide a list of all ``Person`` objects.
id: Menggunakan model contoh ini, ``Person.objects`` akanmembangkitkan sebuah pengecualian ``AttributeError``, tetapi ``Person.people.all()`` akan menyediakan daftar dari semua obyek ``Person``.

source: Custom managers
id: Pengelolaan penyesuaian

source: You can use a custom ``Manager`` in a particular model by extending the base ``Manager`` class and instantiating your custom ``Manager`` in your model.
id: Anda dapat menggunakan sebuah penyesuaian ``Manager`` dalam model tertentu dengan memperpanjang kelas ``Manager`` dasar dan menginstansiasi penyesuaian ``Manager`` anda dalam model anda.

source: There are two reasons you might want to customize a ``Manager``: to add extra ``Manager`` methods, and/or to modify the initial ``QuerySet`` the ``Manager`` returns.
id: Ada dua alasan anda mungkin ingin menyesuaikan sebuah ``Manager``: untuk menambah metode ``Manager`` tambahan, dan/atau merubah ``QuerySet`` awal kembalian ``Manager``.

source: Adding extra manager methods
id: Menambahkan metode pengelolaan tambahan

source: Adding extra ``Manager`` methods is the preferred way to add "table-level" functionality to your models. (For "row-level" functionality -- i.e., functions that act on a single instance of a model object -- use :ref:`Model methods <model-methods>`, not custom ``Manager`` methods.)
id: Menambahkan metode ``Manager`` tambahan adalah cara disukai untuk menambah fungsionalitas "table-level" pada model anda. (Untuk fungsionalitas "row-level" -- yaitu yang bertindak pada sebuah instance tunggal dari sebuah obyek model -- gunakan :ref:`Model methods <model-methods>`, bukan penyesuaian metode ``Manager``.)

source: A custom ``Manager`` method can return anything you want. It doesn't have to return a ``QuerySet``.
id: Sebuah metode ``Manager`` penyesuaian dapat mengembalikan apapun anda inginkan. Itu tidak harus mengembalikan sebuah ``QuerySet``.

source: For example, this custom ``Manager`` offers a method ``with_counts()``, which returns a list of all ``OpinionPoll`` objects, each with an extra ``num_responses`` attribute that is the result of an aggregate query::
id: Sebagai contoh, ``Manager`` penyesuaian ini menawarkan sebuah metode ``with_counts()``, yang mengembalikan sebuah daftar dari semua obyek ``OpinionPoll``, setiap dengan sebuah atribut ``num_responses`` tambahan yaitu hasil dari sebuah pengumpulan permintaan::

source: With this example, you'd use ``OpinionPoll.objects.with_counts()`` to return that list of ``OpinionPoll`` objects with ``num_responses`` attributes.
id: Dengan contoh ini, anda akan menggunakan ``OpinionPoll.objects.with_counts()`` untuk mengembalikan daftar itu dari obyek ``OpinionPoll`` dengan atribut ``num_responses``.
