Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The script runs over your project source tree or your application source tree and pulls out all strings marked for translation (see :ref:`how-django-discovers-translations` and be sure :setting:`LOCALE_PATHS` is configured correctly). It creates (or updates) a message file in the directory ``locale/LANG/LC_MESSAGES``. In the ``de`` example, the file will be ``locale/de/LC_MESSAGES/django.po``.
id: Tulisan berjalan terhadap pohon sumber proyek anda atau pohon sumber aplikasi anda dan menarik semua string ditandai untuk terjemahan (lihat :ref:`how-django-discovers-translations` dan pastikan :setting:`LOCALE_PATHS` dikonfigurasi dengan benar). Itu membuat (atau memperbaharui) sebuah berkas pesan dalam direktori ``locale/LANG/LC_MESSAGES``. Dalam contoh ``de``, berkas akan berupa ``locale/de/LC_MESSAGES/django.po``.

source: When you run ``makemessages`` from the root directory of your project, the extracted strings will be automatically distributed to the proper message files. That is, a string extracted from a file of an app containing a ``locale`` directory will go in a message file under that directory. A string extracted from a file of an app without any ``locale`` directory will either go in a message file under the directory listed first in :setting:`LOCALE_PATHS` or will generate an error if :setting:`LOCALE_PATHS` is empty.
id: Ketika anda menjalankan ``makemessages``dari direktori akar dari proyek anda, string dikeluarkan akan secara otomatis disebarkan pada berkas-berkas pesan yang sesuai. Yaitu, string dikeluarkan dari sebuah berkas dari sebuah aplikasi mengandung direktori ``locale`` akan masuk dalam berkas pesan dibawah direktori itu. Sebuah string dikeluarkan dari sebuah berkas dari sebuah aplikasi tanpa direktori ``locale`` akan salah satu masuk dalam berkas pesan dibawah direktori didaftar pertama dalam :setting:`LOCALE_PATHS` atau akan membangkitkan sebuah kesalahan jika :setting:`LOCALE_PATHS` adalah kosong.

source: By default :djadmin:`django-admin makemessages <makemessages>` examines every file that has the ``.html``, ``.txt`` or ``.py`` file extension. If you want to override that default, use the :option:`--extension <makemessages --extension>` or ``-e`` option to specify the file extensions to examine::
id: Secara awalan :djadmin:`django-admin makemessages 1` menguji setiap berkas yang mempunyai ekstensi berkas ``.html``, ``.txt`` atau ``.py``. Jika anda ingin menimpa awalan itu, gunakan pilihan :option:`--extension 2` atau ``-e`` untuk menentukan ekstensi berkas untuk diuji::

source: Separate multiple extensions with commas and/or use ``-e`` or ``--extension`` multiple times::
id: Mmeisahkan banyak ekstensi dengan koma dan/atau menggunakan ``-e`` atau ``--extension`` berkali-kali::

source: Using Jinja2 templates?
id: Menggunakan cetakan Jinja2?

source: :djadmin:`makemessages` doesn't understand the syntax of Jinja2 templates. To extract strings from a project containing Jinja2 templates, use `Message Extracting`_ from Babel_ instead.
id: :djadmin:`makemessages` tidak memahami sintaksis dari cetakan-cetakan Jinja2. Untuk mengeluarkan string dari sebuah proyek mengandung cetakan-cetakan Jinja2, gunakan `Message Extracting`_ dari Babel_ sebagai gantinya.

source: Here's an example ``babel.cfg`` configuration file::
id: Ini adalah contoh berkas konfigurasi ``babel.cfg``::

source: Make sure you list all extensions you're using! Otherwise Babel won't recognize the tags defined by these extensions and will ignore Jinja2 templates containing them entirely.
id: Pastikan anda mendaftarkan semua ekstensi anda sedang gunakan! Sebaliknya Babel tidak akan mengenali etiket-etiket ditentukan oleh ekstensi-ekstensi ini dan akan mengabaikan cetakan-cetakan Jinja2 mengandung mereka sepenuhnya.

source: Babel provides similar features to :djadmin:`makemessages`, can replace it in general, and doesn't depend on ``gettext``. For more information, read its documentation about `working with message catalogs`_.
id: Babel menyediakan fitur-fitur mirip pada :djadmin:`makemessages`, dapat mengganti itu secara umum, dan tidak bergantung pada ``gettext``. Untuk informasi lebih, baca dokumentasinya tentang `working with message catalogs`_.

source: No gettext?
id: Tidak ada gettext?

source: If you don't have the ``gettext`` utilities installed, :djadmin:`makemessages` will create empty files. If that's the case, either install the ``gettext`` utilities or just copy the English message file (``locale/en/LC_MESSAGES/django.po``) if available and use it as a starting point; it's just an empty translation file.
id: Jika anda tidak mempunyai utilitas ``gettext`` terpasang, :djadmin:`makemessages` akan membuat berkas-berkas kosong. Jika itu adalah kasus, salah satu pasang utilitas ``gettext`` atau cukup salin berkas pesan Inggris (``locale/en/LC_MESSAGES/django.po``)jika tersedia dan menggunakan itu sebagai titik permulaan; itu hanya sebuah berkas terjemahan kosong.

source: Working on Windows?
id: Bekerja pada WIndows?

source: If you're using Windows and need to install the GNU gettext utilities so :djadmin:`makemessages` works, see :ref:`gettext_on_windows` for more information.
id: Jika anda sedang menggunakan Windows dan butuh memasang utilitas gettext GNU sehingga :djadmin:`makemessages` bekerja, lihat :ref:`gettext_on_windows` untuk informasi lebih.

source: For example, if your Django app contained a translation string for the text ``"Welcome to my site."``, like so::
id: Sebagai contoh, jika aplikasi Django anda mengandung string terjemahan untuk teks ``"Welcome to my site."``,seperti itu::

source: ...then :djadmin:`django-admin makemessages <makemessages>` will have created a ``.po`` file containing the following snippet -- a message:
id: ...kemudian :djadmin:`django-admin makemessages 1` akan membuat sebuah berkas ``.po`` mengandung potongan berikut -- sebuah pesan:

source: A quick explanation:
id: Penjelasan cepat:

source: ``msgid`` is the translation string, which appears in the source. Don't change it.
id: ``msgid`` adalah string terjemahan, yang muncul dalam sumber. Jangan rubah itu.

source: ``msgstr`` is where you put the language-specific translation. It starts out empty, so it's your responsibility to change it. Make sure you keep the quotes around your translation.
id: ``msgstr`` adalah dimana anda menaruh terjemahan bahasa-khusus. Itu mulai kosong, jadi itu adalah tanggungjawab anda merubah itu. pastikan anda menjaga kutipan disekitar terjemahan anda.

source: As a convenience, each message includes, in the form of a comment line prefixed with ``#`` and located above the ``msgid`` line, the filename and line number from which the translation string was gleaned.
id: Sebagai sebuah kenyamanan, setiap pesan termasuk, dalam bentuk dari baris komentar diawali dengan ``#`` dan bertempat diatas baris ``msgid``, nama berkas dan nomor baris dari mana string terjemahan telah dikumpulkan sedikit demi sedikit.

source: Long messages are a special case. There, the first string directly after the ``msgstr`` (or ``msgid``) is an empty string. Then the content itself will be written over the next few lines as one string per line. Those strings are directly concatenated. Don't forget trailing spaces within the strings; otherwise, they'll be tacked together without whitespace!
id: Pesan-pesan panjang adalah kasus khusus. Ada, string pertama secara langsung setelah ``msgstr`` (atau ``msgid``) adalah string kosong. Kemudian isi itu sendiri akan ditulis terhadap sedikit baris selanjutnya sebagai satu string per baris. String-string tersebut secara langsung disatukan. Jangan lupa buntutan ruang kosong dalam string; jika tidak, mereka akan dilekatkan bersama-sama tanpa ruang kosong!

source: Mind your charset
id: Pikirkan charset anda

source: To reexamine all source code and templates for new translation strings and update all message files for **all** languages, run this::
id: Untuk menguji kembali semua kode sumber da cetakan untuk string terjemahan baru dan memperbaharui semua berkas pesan untuk *semua* bahasa, jalankan ini::

source: Compiling message files
id: Menyusun berkas-berkas pesan

source: After you create your message file -- and each time you make changes to it -- you'll need to compile it into a more efficient form, for use by ``gettext``. Do this with the :djadmin:`django-admin compilemessages <compilemessages>` utility.
id: Setelah anda membuat berkas pesan anda -- dan setiap kali anda membuat perubahan ke itu -- anda akan butuh menyusun itu menjadi bentuk lebih efesien, untuk digunakan oleh ``gettext``. Lakukan ini dengan alat :djadmin:`django-admin compilemessages 1`.

source: This tool runs over all available ``.po`` files and creates ``.mo`` files, which are binary files optimized for use by ``gettext``. In the same directory from which you ran :djadmin:`django-admin makemessages <makemessages>`, run :djadmin:`django-admin compilemessages <compilemessages>` like this::
id: Alat ini berjalan terhadap semua berkas ``.po`` tersedia dan membuat berkas ``.mo``, yang adalah berkas biner dioptimalkan untu digunakan oleh ``gettext``. Dalam direktori sama dari mana anda menjalankan :djadmin:`django-admin makemessages 1`,jalankan :djadmin:`django-admin compilemessages 2` seperti ini::

source: That's it. Your translations are ready for use.
id: Itu dia, terjemahan anda siap digunakan.

source: If you're using Windows and need to install the GNU gettext utilities so :djadmin:`django-admin compilemessages <compilemessages>` works see :ref:`gettext_on_windows` for more information.
id: Jika anda sedang menggunakan Windows dan butuh memasang alat gettext GNU sehingga :djadmin:`django-admin compilemessages 1` bekerja lihat :ref:`gettext_on_windows` untuk informasi lebih.

source: .po files: Encoding and BOM usage.
id: berkas-berkas .po: Penggunaan penyandian dan BOM.

source: Troubleshooting: ``gettext()`` incorrectly detects ``python-format`` in strings with percent signs
id: Pemecahan masalah: ``gettext()`` tidak benar mengenali ``python-format``dalam string-string dengan tanda persen

source: To workaround this, you can escape percent signs by adding a second percent sign::
id: Untuk memecahkan ini, anda dapat meloloskan tanda persen dengan menambahkan tanda persen kedua::

source: Or you can use ``no-python-format`` so that all percent signs are treated as literals::
id: Atau anda dapat menggunakan ``no-python-format`` sehingga semua tanda persen diperlakukan sebagai harfiah.

source: Creating message files from JavaScript source code
id: Membuat berkas pesan dari kode sumber JavaScript

source: ``gettext`` on Windows
id: ``gettext`` pada Windows

source: Customizing the ``makemessages`` command
id: Menyesuaikan perintah ``makemessages``

source: If you want to pass additional parameters to ``xgettext``, you need to create a custom :djadmin:`makemessages` command and override its ``xgettext_options`` attribute::
id: Jika anda ingin melewatkan parameter tambahan pada ``xgettext``, anda butuh membuat perintah :djadmin:`makemessages` penyesuaian dan menimpa atribut ``xgettext_options`` nya::

source: If you need more flexibility, you could also add a new argument to your custom :djadmin:`makemessages` command::
id: Jika anda butuh lebih keluwesan, anda dapat juga menambahkan argumen baru ke perintah perintah :djadmin:`makemessages` anda::

source: Miscellaneous
id: Bermacam-macam

source: The ``set_language`` redirect view
id: Tampilan mengalihkan ``set_language``

source: Activate this view by adding the following line to your URLconf::
id: Aktifkan tampilan ini dengan menambahkan baris berikut ke URLconf anda::

source: (Note that this example makes the view available at ``/i18n/setlang/``.)
id: (Catat bahwa contoh ini membuat tampilan tersedia pada ``/i18n/setlang/``.)

source: Make sure that you don't include the above URL within :func:`~django.conf.urls.i18n.i18n_patterns` - it needs to be language-independent itself to work correctly.
id: pastikan bahwa anda tidak menyertakan URL diatas dalam :func:`~django.conf.urls.i18n.i18n_patterns` - itu butuh menjadi bahasa-berdiri-sendiri untuk bekerja dengan benar.

source: For AJAX requests, the fallback will be performed only if the ``next`` parameter was set. Otherwise a 204 status code (No Content) will be returned.
id: Untuk permintaan AJAX, fallback akan dialkukan hanya jika parameter ``next`` telah disetel. Sebaliknya sebuah kode keadaan 204 (Tidak ada Isi) akan dikembalikan.

source: For non-AJAX requests, the fallback will always be performed.
id: Untuk permintaan bukan-AJAX, fallback akan selalu dilakukan.

source: Here's example HTML template code:
id: Ini adalah contoh kode cetakan HTML:

source: In this example, Django looks up the URL of the page to which the user will be redirected in the ``redirect_to`` context variable.
id: Dalam contoh ini, Django mencari URL dari halaman pada dimana pengguna akan dialihkan dalam variabel konteks ``redirect_to``.

source: Explicitly setting the active language
id: Secara jelas mengatur bahasa aktif

source: You may want to set the active language for the current session explicitly. Perhaps a user's language preference is retrieved from another system, for example. You've already been introduced to :func:`django.utils.translation.activate()`. That applies to the current thread only. To persist the language for the entire session, also modify :data:`~django.utils.translation.LANGUAGE_SESSION_KEY` in the session::
id: Anda mungkin ingin menyetel bahasa aktif untuk sesi saat ini secara jelas. Mungkin pilihan bahasa pengguna diambil dari sistem lain, sebagai contoh. Anda telah diperkenalkan pada :func:`django.utils.translation.activate()`. Yang memberlakukan ke hanya rangkaian saat ini. Untuk bertahan bahasa untuk seluruh sesi, juga rubah :data:`~django.utils.translation.LANGUAGE_SESSION_KEY`dalam sesi::

source: You would typically want to use both: :func:`django.utils.translation.activate()` will change the language for this thread, and modifying the session makes this preference persist in future requests.
id: Anda biasaya ingin melakukan menggunakan kedua: :func:`django.utils.translation.activate()` akan merubah bahasa ke rangkaian ini, dan merubah sesi membuat pilihan ini tetap ada di permintaan akan datang.

source: If you are not using sessions, the language will persist in a cookie, whose name is configured in :setting:`LANGUAGE_COOKIE_NAME`. For example::
id: Jika anda tidak menggunakan sesi, bahasa akan terus ada dalam sebuah cookie, yang namanya dikonfigurasi dalam :setting:`LANGUAGE_COOKIE_NAME`.Sebagai contoh::

source: Using translations outside views and templates
id: Menggunakan terjemahan diluar tampilan dan cetakan

source: Functions of particular interest are :func:`django.utils.translation.get_language()` which returns the language used in the current thread, :func:`django.utils.translation.activate()` which activates a translation catalog for the current thread, and :func:`django.utils.translation.check_for_language()` which checks if the given language is supported by Django.
id: Fungsi-fungsi untuk minat tertentu adalah :func:`django.utils.translation.get_language()` yang mengembalikan bahasa digunakan dalam thread saat ini, :func:`django.utils.translation.activate()` yang mengaktifkan sebuah katalog terjemahan untuk thread saat ini, dan :func:`django.utils.translation.check_for_language()` yang akan memeriksa jika bahasa diberikan adalah didukung oleh Django.

source: To help write more concise code, there is also a context manager :func:`django.utils.translation.override()` that stores the current language on enter and restores it on exit. With it, the above example becomes::
id: Untuk membantu menulis lebih kode ringkas, ada juga sebuah pengelola konteks :func:`django.utils.translation.override()`yang menyimpan bahasa sat ini pada saat masuk dan menyimpan kembali itu pada saat keluar. Dengan itu, contoh diatas menjadi::

source: Language cookie
id: Cookie bahasa

source: A number of settings can be used to adjust language cookie options:
id: Sejumlah pengatuan dapat digunakan untuk menyesuaikan pilihan cookie bahasa:

source: Implementation notes
id: Catatan penerapan

source: Specialties of Django translation
id: Keahlian khusus dari terjemahan Django

source: Django doesn't use ``xgettext`` alone. It uses Python wrappers around ``xgettext`` and ``msgfmt``. This is mostly for convenience.
id: Django tidak menggunakan ``xgettext`` sendiri. Itu menggunakan Python dibungkus disekitar ``xgettext`` dan ``msgfmt``.Ini kebanyakan untuk kenyamanan.

source: How Django discovers language preference
id: Bagaimana Django menemukan pilihan bahasa

source: Once you've prepared your translations -- or, if you just want to use the translations that come with Django -- you'll just need to activate translation for your app.
id: Ketika anda telah menyiapkan terjemahan anda -- atau, jika anda hanya ingin menggunakan terjemahan yang datang dengan Django -- anda hanya butuh mengaktifkan terjemahan untuk aplikasi anda.

source: Behind the scenes, Django has a very flexible model of deciding which language should be used -- installation-wide, for a particular user, or both.
id: Dbelakang layar, Django mempunyai model yang sagat elastis dari memutuskan bahasa mana harus digunakan -- pemasangan-lebar, untuk pengguna tertentu, atau keduanya.

source: To set an installation-wide language preference, set :setting:`LANGUAGE_CODE`. Django uses this language as the default translation -- the final attempt if no better matching translation is found through one of the methods employed by the locale middleware (see below).
id: Untuk menyetel sebuah pilihan bahasa pemasangan-luas, setel :setting:`LANGUAGE_CODE`. Django menggunakan bahasa ini sebagai terjemahan awalan -- usaha akhir jika tidak ada terjemahan yang cocok ditemukan melalui satu dari metode-metode dengan middleware lokal (lihat dibawah).

source: If all you want is to run Django with your native language all you need to do is set :setting:`LANGUAGE_CODE` and make sure the corresponding :term:`message files <message file>` and their compiled versions (``.mo``) exist.
id: Jika yang anda inginkan adalah menjalankan Django dengan bahasa asli anda semua anda butuhkan untuk lakukan adalah menyetel :setting:`LANGUAGE_CODE`dan memastikan :term:`message files 1` sesuai dan versi tersusun mereka (``.mo``) ada.

source: If you want to let each individual user specify which language they prefer, then you also need to use the ``LocaleMiddleware``. ``LocaleMiddleware`` enables language selection based on data from the request. It customizes content for each user.
id: Jika anda ingin membiarkan setiap pengguna perorangan menentukan bahasa mana mereka pilih, kemudian anda juga butuh menggunakan ``LocaleMiddleware``. ``LocaleMiddleware``mengadakan pilihan bahasa berdasarkan pada data dari permintaan. Itu menyesuaikan isi untuk setiap pengguna.

source: To use ``LocaleMiddleware``, add ``'django.middleware.locale.LocaleMiddleware'`` to your :setting:`MIDDLEWARE` setting. Because middleware order matters, follow these guidelines:
id: Untuk menggunakan ``LocaleMiddleware``, tambah ``'django.middleware.locale.LocaleMiddleware'`` ke pengaturan :setting:`MIDDLEWARE` anda. Karena urutan middleware penting, ikuti panduan berikut:

source: Make sure it's one of the first middleware installed.
id: Pastikan itu adalah satu dari middleware pertama dipasang.

source: If you use ``CacheMiddleware``, put ``LocaleMiddleware`` after it.
id: Jika anda menggunakan ``CacheMiddleware``, taruh ``LocaleMiddleware`` setelah itu.

source: For example, your :setting:`MIDDLEWARE` might look like this::
id: Sebagai contoh, :setting:`MIDDLEWARE` anda mungkin terlihat seperti ini::

source: (For more on middleware, see the :doc:`middleware documentation </topics/http/middleware>`.)
id: (Untuk lebih pada middleware, lihat :doc:`middleware documentation 1`.)

source: ``LocaleMiddleware`` tries to determine the user's language preference by following this algorithm:
id: ``LocaleMiddleware`` mencoba menentukan pilihan bahasa pengguna dengan mengikuti algoritma ini:

source: The name of the cookie used is set by the :setting:`LANGUAGE_COOKIE_NAME` setting. (The default name is ``django_language``.)
id: Nama dari cookie digunakan adalah disetel oleh pengaturan :setting:`LANGUAGE_COOKIE_NAME`. (Nama awalan adalah ``django_language``.)

source: Here's a sample settings file::
id: Ini adalah contoh sebuah berkas pengaturan::

source: Note that, with static (middleware-less) translation, the language is in ``settings.LANGUAGE_CODE``, while with dynamic (middleware) translation, it's in ``request.LANGUAGE_CODE``.
id: Catat bahwa, dengan terjemahan tetap (tanpa-middleware), bahasa di ``settings.LANGUAGE_CODE``, selagi dengan terjemahan dinamis (middleware), itu di ``request.LANGUAGE_CODE``.

source: How Django discovers translations
id: Bagaimana Django menemukan terjemahan

source: Finally, the Django-provided base translation in ``django/conf/locale`` is used as a fallback.
id: Akhirnya, terjemahan dasar disediakan-Django dalam ``django/conf/locale`` digunakan sebagai sebuah fallback.

source: This way, you can write applications that include their own translations, and you can override base translations in your project. Or, you can just build a big project out of several apps and put all translations into one big common message file specific to the project you are composing. The choice is yours.
id: Cara ini, anda dapat menulis aplikasi yang menyertakan terjemahan mereka sendiri, dan anda dapat menimpa terjemahan dasar dalam proyek anda. Atau, anda dapat cukup membangun proyek besar dari beberapa aplikasi dan menaruh semua terjemahan kedalam berkas pesan umum besar ke proyek anda susun. Pilihan ada di anda.

source: All message file repositories are structured the same way. They are:
id: Semua gudang berkas pesan tersusun cara sama. Mereka adalah:

source: All paths listed in :setting:`LOCALE_PATHS` in your settings file are searched for ``<language>/LC_MESSAGES/django.(po|mo)``
id: Semua jalur-jalur terdaftar dalam :setting:`LOCALE_PATHS` di berkas pengaturan anda adalah dicari untuk ``1/LC_MESSAGES/django.(po|mo)``

source: To create message files, you use the :djadmin:`django-admin makemessages <makemessages>` tool. And you use :djadmin:`django-admin compilemessages <compilemessages>` to produce the binary ``.mo`` files that are used by ``gettext``.
id: Untuk membuat berkas pesan, anda menggunakan , anda menggunakan alat :djadmin:`django-admin makemessages <makemessages>` . Dan anda menggunakan :djadmin:`django-admin compilemessages <compilemessages>` untuk menghasilkan berkas-berkas biner ``.mo`` yang digunakan oleh ``gettext``.

source: You can also run :djadmin:`django-admin compilemessages --settings=path.to.settings <compilemessages>` to make the compiler process all the directories in your :setting:`LOCALE_PATHS` setting.
id: Anda dapat juga menjalankan :djadmin:`django-admin compilemessages --settings=path.to.settings 1` untuk membuat penyusun mengolah semua direktori dalam pengaturan :setting:`LOCALE_PATHS` anda.

source: Using a non-English base language
id: Menggunakan bahasa dasar bukan-Inggris

source: Django makes the general assumption that the original strings in a translatable project are written in English. You can choose another language, but you must be aware of certain limitations:
id: Django membuat anggapan umum bahwa string asli dalam proyek terjemahan ditulis dalam Inggris. Anda dapat memilih bahasa lain, tetapi harus waspada dari batasan tertentu:

source: Using Django
id: Menggunakan Django

source: Introductions to all the key parts of Django you'll need to know:
id: Perkenalan ke semua bagian kunci dari Django anda akan butuh ketahui:

source: How to install Django
id: Bagaimana memasang Django
