Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Then we just need to add this new view into our URLconf. :class:`~django.views.generic.base.TemplateView` is a class, not a function, so we point the URL to the :meth:`~django.views.generic.base.View.as_view` class method instead, which provides a function-like entry to class-based views::
id: Kemudian kami hanya butuh menambah video baru ini kedalam URLconf kami. :class:`~django.views.generic.base.TemplateView` adalah sebuah kelas, bukan sebuah fungsi, jadi kami menunjuk URL ke metode kelas :meth:`~django.views.generic.base.View.as_view` sebagai gantinya, yang menyediakan sebuah seperti-fungsi masukan pada tampilan berdasarkan-kelas::

source: For more information on how to use the built in generic views, consult the next topic on :doc:`generic class-based views</topics/class-based-views/generic-display>`.
id: Untuk informasi lebih pada bagaimana menggunakan tampilan umum siap pakai, obrolkan topik selanjutnya di :doc:`generic class-based views</topics/class-based-views/generic-display>`.

source: Supporting other HTTP methods
id: mendukung cara HTTP lain

source: Suppose somebody wants to access our book library over HTTP using the views as an API. The API client would connect every now and then and download book data for the books published since last visit. But if no new books appeared since then, it is a waste of CPU time and bandwidth to fetch the books from the database, render a full response and send it to the client. It might be preferable to ask the API when the most recent book was published.
id: Misalkan seseorang ingin mengakses pustaka buku kami terhadap HTTP menggunakan tampilan sebagai sebuah klien API akan terhubung setiap sekarang kemudian dan mengunduh buku untuk buku diterbitkan sejak kunjugan terakhir. Tetapi jika tidak ada buku baru muncul sejak itu, itu adalah pembuangan dari waktu CPU dan lebar pita untuk mengambil buku-buku dari basisdata, mengirim tanggapan penuh dan mengirim itu ke klien. Itu mungkin lebih baik untuk menanyakan API ketika kebanyakan buku saat ini telah diterbitkan.

source: We map the URL to book list view in the URLconf::
id: Kami memetakan UTL pada tampilan daftar buku di URLconf::

source: And the view::
id: Dan tampilan::

source: If the view is accessed from a ``GET`` request, a plain-and-simple object list is returned in the response (using ``book_list.html`` template). But if the client issues a ``HEAD`` request, the response has an empty body and the ``Last-Modified`` header indicates when the most recent book was published. Based on this information, the client may or may not download the full object list.
id: Jika tampilan diakses dari sebuah permintaan ``GET``, daftar obyek polos-dan-sederhana dikembalikan di tanggapan (menggunakan cetakan ``book_list.html``). Tetapi jika klien menerbitkan sebuah permintaan ``HEAD``, tanggapan mempunyai badan kosong dan kepala ``Last-Modified`` menunjukkan ketika buku paling akhir telah diterbitkan. Berdasarkan pada informasi ini, klien mungkin atau tidak mungkin mengunduh daftar obyek penuh.

source: Introduction to class-based views
id: Perkenalan ke tampilan berdasarkan-kelas

source: Class-based views provide an alternative way to implement views as Python objects instead of functions. They do not replace function-based views, but have certain differences and advantages when compared to function-based views:
id: Tampilan berdasarkan-kelas menyediakan cara alternatif untuk menerapkan tampilan sebagai obyek Python daripada fungsi. Mereka tidak mengganti tampilan berdasarkan-fungsi, tetapi mempunyai perbedaan dan keuntungan tertentu ketika dibandingkan pada tampilan berdasarkan-fungsi:

source: Organization of code related to specific HTTP methods (``GET``, ``POST``, etc.) can be addressed by separate methods instead of conditional branching.
id: Kode organisasi terkait pada metode HTTP tertentu (``GET``, ``POST``, dll.) dapat dialamatkan oleh metode terpisah sebagai gantinya dari percabangan bersyarat.

source: Object oriented techniques such as mixins (multiple inheritance) can be used to factor code into reusable components.
id: Teknik-teknik berorientasi obyek seperti mixin (banyak warisan) dapat digunakan pada kode faktor kedalam komponen digunakan kembali.

source: The relationship and history of generic views, class-based views, and class-based generic views
id: Hubungan dan riwayat dari tampilan umum, tampilan berdasarkan-kelas, dan tampilan umum berdasarkan-kelas

source: In the beginning there was only the view function contract, Django passed your function an :class:`~django.http.HttpRequest` and expected back an :class:`~django.http.HttpResponse`. This was the extent of what Django provided.
id: Dalam permulaan ada hanya kontrak fungsi tampilan, Django melewatkan fungsi anda sebuah :class:`~django.http.HttpRequest` dan berharap kembali sebuah :class:`~django.http.HttpResponse`. Ini adalah perpanjangan dari apa Django sediakan.

source: Early on it was recognized that there were common idioms and patterns found in view development. Function-based generic views were introduced to abstract these patterns and ease view development for the common cases.
id: Lebih awal pada itu telah dikenali dimana ada dialek umum dan pola ditemukan di pengembangan tampilan. Tampilan umum berdasarkan-fungsi telah diperkenalkan untuk meringkas pola ini dan pengembangan tampilan mudah untuk kasus-kasus umum.

source: The problem with function-based generic views is that while they covered the simple cases well, there was no way to extend or customize them beyond some simple configuration options, limiting their usefulness in many real-world applications.
id: Masalah dengan tampilan umum berdasarkan-fungsi adalah bahwa selagi mereka mencangkupi kasus-kasus kecil juga, tidak ada cara memperpanjang atau menyesuaikan mereka diluar beberapa pilihan konfigurasi sederhana, membatasi kegunaan mereka di banyak aplikasi dunia-sebenarnya.

source: Class-based generic views were created with the same objective as function-based generic views, to make view development easier. However, the way the solution is implemented, through the use of mixins, provides a toolkit that results in class-based generic views being more extensible and flexible than their function-based counterparts.
id: Tampilan umum berdasarkan-kelas telah dibuat dengan tujuan sama sebagai tampilan umum berdasarkan-fungsi, untuk membuat tampilan pengembangan lebih mudah. Bagaimanapun, cara pemecahan diterapkan, melalui penggunaan dari mixin, menyediakan sebuah alat bantu yang menghasilkan di tampilan umum berdasarkan-kelas menjadi lebih diperpanjang dan lentur daripada pasangan berdasarkan-fungsi mereka.

source: If you have tried function based generic views in the past and found them lacking, you should not think of class-based generic views as simply a class-based equivalent, but rather as a fresh approach to solving the original problems that generic views were meant to solve.
id: Jika anda telah mencoba tampilan umum berdasarkan fungsi di waktu lampau dan menemukan kekurangan mereka, anda tidak harus memikirkan tampilan umum berdasarkan-kelas sebagai setara berdasarkan-kelas sederhana, melainkan sebagai pendekatan segar untuk mengatasi masalah asli yang tampilan umum dimaksud untuk memecahkan.

source: The toolkit of base classes and mixins that Django uses to build class-based generic views are built for maximum flexibility, and as such have many hooks in the form of default method implementations and attributes that you are unlikely to be concerned with in the simplest use cases. For example, instead of limiting you to a class-based attribute for ``form_class``, the implementation uses a ``get_form`` method, which calls a ``get_form_class`` method, which in its default implementation just returns the ``form_class`` attribute of the class. This gives you several options for specifying what form to use, from a simple attribute, to a fully dynamic, callable hook. These options seem to add hollow complexity for simple situations, but without them, more advanced designs would be limited.
id: Alat bantu dari kelas-kelas dasar dan mixin yang Django gunakan untuk membangun tampilan umum berdsarkan-kelas dibangun untuk kemudahan maksimal, dan dengan demikian mempunyai banyak kaitan di formulir dari penerapan metode awalan dan atribut dimana yang tidak mungkin bersangkutan dengan penggunaan kasus termudah. Sebagai contoh, daripada membatasi anda pada atribut berdasarkan-kelas untuk ``form_class``, penerapan menggunakan metode ``get_form``, yang memanggil metode ``get_form_class``, yang di penerapan awalannya hanya mengembalikan atribut ``form_class`` dari kelas. Ini memberikan anda beberapa pilihan untuk menentukan formulir apa yang digunakan, dari atribut sederhana, ke sepenuhnya dinamis, kaitan callable . Pilihan ini terlihat menambahkan lubang kerumitan untuk keadaan sederhana, tetapi tanpa mereka, rancangan lebih lanjut akan menjadi terbatas.

source: Using class-based views
id: Menggunakan tampilan berdasarkan-kelas

source: At its core, a class-based view allows you to respond to different HTTP request methods with different class instance methods, instead of with conditionally branching code inside a single view function.
id: Pada intinya, tampilan berdasarkan-kelas mengizinkan anda menanggapi ke permintaan HTTP berbeda dengan metode instance kelas berbeda, daripada dengan kode cabang bersyarat didalam fungsi tampilan tunggal.

source: So where the code to handle HTTP ``GET`` in a view function would look something like::
id: Jadi dimana kode untuk menangani HTTP ``GET`` di sebuah fungsi tampilan akan terlihat seperti::

source: In a class-based view, this would become::
id: Di tampilan berdasarkan-kelas, ini akan menjadi::

source: Because Django's URL resolver expects to send the request and associated arguments to a callable function, not a class, class-based views have an :meth:`~django.views.generic.base.View.as_view` class method which returns a function that can be called when a request arrives for a URL matching the associated pattern. The function creates an instance of the class and calls its :meth:`~django.views.generic.base.View.dispatch` method. ``dispatch`` looks at the request to determine whether it is a ``GET``, ``POST``, etc, and relays the request to a matching method if one is defined, or raises :class:`~django.http.HttpResponseNotAllowed` if not::
id: Karena penyelesai URL Django berharap mengirim permintaan dan argumen terkait ke fungsi callable, bukan kelas, tampilan berdasarkan-kelas mempunyai sebuah metode kelas :meth:`~django.views.generic.base.View.as_view` yang mengembalikan fungsi yang dapat dipanggil ketika permintaan tiba untuk URL mencocokkan corak terkait. Fungsi membuat sebuah instance dari kelas dan memanggil metode meth:`~django.views.generic.base.View.dispatch` nya. Tampilan 11dispatch`` pada permintaan menentukan apakah itu adalah ``GET``, ``POST``, dll, dan menyampaikan permintaan pada metode pencocokan jika satu ditentukan, atau muncul :class:`~django.http.HttpResponseNotAllowed` jika tidak::

source: It is worth noting that what your method returns is identical to what you return from a function-based view, namely some form of :class:`~django.http.HttpResponse`. This means that :doc:`http shortcuts </topics/http/shortcuts>` or :class:`~django.template.response.TemplateResponse` objects are valid to use inside a class-based view.
id: Itu perlu dicatat bahwa apa metode anda kembalikan mirip ke apa anda kembalikan dari tampilan berdasarkan-fungsi, yaitu beberapa formulir dari :class:`~django.http.HttpResponse`. Ini berarti bahwa obyek :doc:`http shortcuts </topics/http/shortcuts>` atau :class:`~django.template.response.TemplateResponse` sah digunakan didalam tampilan berdasarkan-kelas.

source: While a minimal class-based view does not require any class attributes to perform its job, class attributes are useful in many class-based designs, and there are two ways to configure or set class attributes.
id: Selagi tampilan berdasarkan-kelas paling rendah tidak membutuhkan atribut kelas apapun untuk melakukan pekerjaannya, atribut kelas berguna di banyak perancangan berdasarkan-kelas, dan ada dua cara mengkonfigurasi atau mensetel atribut kelas.

source: The first is the standard Python way of subclassing and overriding attributes and methods in the subclass. So that if your parent class had an attribute ``greeting`` like this::
id: Pertama adalah cara Python standar dari mensubkelaskan dan menimpa atribut dan metode di subkelas. Sehingga jika induk anda mempunyai sebuah atribut ``greeting`` seperti ini::

source: You can override that in a subclass::
id: Anda dapat menimpa itu di subkelas::

source: Another option is to configure class attributes as keyword arguments to the :meth:`~django.views.generic.base.View.as_view` call in the URLconf::
id: Pilihan lain adalah mengkonfigurasi atribut kelas sebagai argumen kata kunci pada panggailan :meth:`~django.views.generic.base.View.as_view` di URLconf::

source: While your class is instantiated for each request dispatched to it, class attributes set through the :meth:`~django.views.generic.base.View.as_view` entry point are configured only once at the time your URLs are imported.
id: Selagi kelas anda diinstasiasikan untuk setiap permintaan dikirimkan ke itu, atribut kelas menyetel melalui titik masukan :meth:`~django.views.generic.base.View.as_view` dikonfigurasikan hanya sekali pada waktu URL anda diimpor.

source: Using mixins
id: Menggunakan mixin

source: Mixins are a form of multiple inheritance where behaviors and attributes of multiple parent classes can be combined.
id: Mixin adalah sebuah formulit dari banyak warisan dimana perilaku dan atribut dari banyak kelas-kelas induk dapat dipadukan

source: For example, in the generic class-based views there is a mixin called :class:`~django.views.generic.base.TemplateResponseMixin` whose primary purpose is to define the method :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response`. When combined with the behavior of the :class:`~django.views.generic.base.View` base class, the result is a :class:`~django.views.generic.base.TemplateView` class that will dispatch requests to the appropriate matching methods (a behavior defined in the ``View`` base class), and that has a :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response` method that uses a :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` attribute to return a :class:`~django.template.response.TemplateResponse` object (a behavior defined in the ``TemplateResponseMixin``).
id: Sebagai contoh, di tampilan berdasarkan-kelas umum adalah sebuah mixin dipanggil :class:`~django.views.generic.base.TemplateResponseMixin` yang tujuan utamanya adalah menentukan metode :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response`. Ketika memadukan dengan perilaku dari kelas dasar :class:`~django.views.generic.base.View`, hasil adalah kelas :class:`~django.views.generic.base.TemplateView` yang akan mengirim permintaan ke metode pencocokan sesuai (sebuah perilaku ditentukan di kelas dasar ``View``), dan itu mempunyai sebuah metode :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response` yang menggunakan sebuah atribut :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` untuk mengembalikan sebuah obyek :class:`~django.template.response.TemplateResponse` (sebuah perilaku ditentukan di ``TemplateResponseMixin``).

source: Mixins are an excellent way of reusing code across multiple classes, but they come with some cost. The more your code is scattered among mixins, the harder it will be to read a child class and know what exactly it is doing, and the harder it will be to know which methods from which mixins to override if you are subclassing something that has a deep inheritance tree.
id: Mixin adalah sebuah cara istimewa dari menggunakan kembali kode terhadap banyak kelas, tetapi mereka datang dengan beberapa biaya. Semakin kode anda tersebar diantara mixin, semakin keras itu akan dibaca kelas anak dan mengetahui apa yang sebenarnya itu lakukan, dan semakin keras itu akan diketahui metode mana dari mixin mana untuk ditimpa jika anda mensubkelaskan sesuatu yang mempunyai pohon warisan dalam.

source: Note also that you can only inherit from one generic view - that is, only one parent class may inherit from :class:`~django.views.generic.base.View` and the rest (if any) should be mixins. Trying to inherit from more than one class that inherits from ``View`` - for example, trying to use a form at the top of a list and combining :class:`~django.views.generic.edit.ProcessFormView` and :class:`~django.views.generic.list.ListView` - won't work as expected.
id: Catat juga bahwa anda dapat hanya mewarisi dari satu tampilan umum - yaitu, hanya satu kelas induk mungkin mewarisi dari :class:`~django.views.generic.base.View` dan sisa (jika ada) harus berupa mixin. Mencoba mewarisi lebih dari satu kelas yang mewarisi dari ``View`` - sebagai contoh, mencoba menggunakan sebuah formulir pada atas dari daftar dan memadukan :class:`~django.views.generic.edit.ProcessFormView` dan :class:`~django.views.generic.list.ListView` - tidak bekerja sesuai harapan.

source: Handling forms with class-based views
id: Menangani formulir dengan tampilan berdasarkan-kelas

source: A basic function-based view that handles forms may look something like this::
id: Sebuah dasar tampilan berdasarkan-fungsi yang menangani formulir mungkin terlihat sesuatu seperti ini::

source: A similar class-based view might look like::
id: Tampilan berdasarkan-kelas yang mirip mungkin terlihat seperti::

source: This is a very simple case, but you can see that you would then have the option of customizing this view by overriding any of the class attributes, e.g. ``form_class``, via URLconf configuration, or subclassing and overriding one or more of the methods (or both!).
id: Ini adalah kasus sangat mudah, tetapi anda dapat melihat bahwa anda akan kemudian memiliki pilihan dari penyesuaian tampilan ini dengan menimpa setiap dari atribut kelas, sebagai contoh ``form_class``, melalui konfigurasi URLconf, atau mensubkelaskan dan menimpa satu atau lebih metode (atau keduanya!).

source: Decorating class-based views
id: Menghias tampilan berdasarkan-kelas

source: The extension of class-based views isn't limited to using mixins. You can also use decorators. Since class-based views aren't functions, decorating them works differently depending on if you're using ``as_view()`` or creating a subclass.
id: Tambahan dari tampilan berdasarkan-kelas tidak terbatas menggunakan mixin. Anda dapat juga menggunakan penghias. Sejak tampilan berdasarkan-kelas bukan fungsi, mengias mereka bekerja secara berbeda tergantung pada jika anda sedang menggunakan ``as_view()`` atau membuat sebuah subkelas.

source: Decorating in URLconf
id: Menghias URLconf

source: The simplest way of decorating class-based views is to decorate the result of the :meth:`~django.views.generic.base.View.as_view` method. The easiest place to do this is in the URLconf where you deploy your view::
id: Cara termudah dari menghias tampilan berdasarkan-kelas adalah menghias hasil dari metode :meth:`~django.views.generic.base.View.as_view`. Tempat termudah untuk melakukan ini adalah di URLconf dimana anda menyebarkan tampilan anda::

source: This approach applies the decorator on a per-instance basis. If you want every instance of a view to be decorated, you need to take a different approach.
id: Pendekatan ini memberlakukan penghias pada dasar per-instance. Jika anda ingin setiap instance dari tampilan dihias, anda butuh mengambil pendekatan berbeda.

source: Decorating the class
id: Menghias kelas

source: To decorate every instance of a class-based view, you need to decorate the class definition itself. To do this you apply the decorator to the :meth:`~django.views.generic.base.View.dispatch` method of the class.
id: Untuk menghias setiap instance dari tampilan berdasarkan-kelas, anda butuh menghias pengertian kelas itu sendiri. Untuk melakukan ini anda berlakukan penghias ke metode :meth:`~django.views.generic.base.View.dispatch` dari kelas.

source: A method on a class isn't quite the same as a standalone function, so you can't just apply a function decorator to the method -- you need to transform it into a method decorator first. The ``method_decorator`` decorator transforms a function decorator into a method decorator so that it can be used on an instance method. For example::
id: Sebuah metode pada sebuah kelas tidak agak sama seperti fungsi berdiri sendiri, jadi anda tidak hanya memberlakukan penghias fungsi ke metode -- anda butuh merubah itu menjadi penghias metode dahulu. Penghias ``method_decorator`` merubah sebuah penghias fungsi kedalam penghias metode sehingga itu dapat digunakan pada metode instance. Sebagai contoh::

source: Or, more succinctly, you can decorate the class instead and pass the name of the method to be decorated as the keyword argument ``name``::
id: Atau, lebih ringkas, anda dapat menghias kelas dan melewatkan nama dari metode untuk di hias sebagai argumen kata kunci ``name``::

source: If you have a set of common decorators used in several places, you can define a list or tuple of decorators and use this instead of invoking ``method_decorator()`` multiple times. These two classes are equivalent::
id: Jika anda mempunyai sekumpulan penghias umum digunakan di beberapa tempat, anda dapat menentukan daftar atau tuple dari penghias dan menggunakan ini sebagai gantinya meminta ``method_decorator()`` berulang kali. Kedua kelas ini adalah setara::

source: The decorators will process a request in the order they are passed to the decorator. In the example, ``never_cache()`` will process the request before ``login_required()``.
id: Penghias akan mengolah sebuah permintaan dalam urutan mereka dilewatkan ke penghias. Dalam contoh, ``never_cache()`` akan mengolah permintaan sebelum ``login_required()``.

source: In this example, every instance of ``ProtectedView`` will have login protection.
id: Di contoh ini, setiap instance dari ``ProtectedView`` akan mempunyai perlindungan masuk.

source: ``method_decorator`` passes ``*args`` and ``**kwargs`` as parameters to the decorated method on the class. If your method does not accept a compatible set of parameters it will raise a ``TypeError`` exception.
id: ``method_decorator`` melewatkan ``*args`` dan ``**kwargs`` sebagai parameter untuk menghiasi metode pada kelas. Jika metode anda tidak menerima sekumpulan cocok dari parameter itu akan memunculkan sebuah pengecualian ``TypeError``.

source: Using mixins with class-based views
id: Menggunakan mixin dengan tampilan berdasarkan-kelas

source: This is an advanced topic. A working knowledge of :doc:`Django's class-based views<index>` is advised before exploring these techniques.
id: Ini adalah sebuah topik lanjut. Sebuah pengetahuan dari :doc:`Django's class-based views<index>` disarankan sebelum menjelajahi teknik-teknis ini.
