Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Django does not store raw (clear text) passwords on the user model, but only a hash (see :doc:`documentation of how passwords are managed </topics/auth/passwords>` for full details). Because of this, do not attempt to manipulate the password attribute of the user directly. This is why a helper function is used when creating a user.
id: Django tidak menyimpan sandi (teks bersih) mentah pada model user, tetapi hanya campuran (lihat :doc:`documentation of how passwords are managed </topics/auth/passwords>` untuk rincian penuh). Karena dari ini, jangan mencoba untuk mengubah atribut sanddi dari pengguna secara langsung. Ini adalah mengapa fungsi pembantu digunakan ketika membuat pengguna.

source: To change a user's password, you have several options:
id: Untuk merubah sandi pengguna, anda mempunyai beebrapa pilihan:

source: :djadmin:`manage.py changepassword *username* <changepassword>` offers a method of changing a user's password from the command line. It prompts you to change the password of a given user which you must enter twice. If they both match, the new password will be changed immediately. If you do not supply a user, the command will attempt to change the password whose username matches the current system user.
id: :djadmin:`manage.py changepassword *username* <changepassword>` menawarkan metode dari merubah sandi pengguna dari baris perintah. Itu mendorong anda merubah sandi dari pengguna yang diberikan yang anda harus masukkan dua kali. Jika mereka kedua cocok, sandi baru akan berubah segera. Jika anda tidak memasok pengguna, perintah akan berusaha merubah sandi yang nama pengguna cocok dengan pengguna sistem saat ini.

source: You can also change a password programmatically, using :meth:`~django.contrib.auth.models.User.set_password()`:
id: Anda dapat juga merubah sandi secara program, menggunakan :meth:`~django.contrib.auth.models.User.set_password()`:

source: If you have the Django admin installed, you can also change user's passwords on the :ref:`authentication system's admin pages <auth-admin>`.
id: Jika anda mempunyai admin Django terpasang, anda dapat juga merubah sandi pengguna pada :ref:`halaman admin sistem pembuktian keaslian <auth-admin>`.

source: Django also provides :ref:`views <built-in-auth-views>` and :ref:`forms <built-in-auth-forms>` that may be used to allow users to change their own passwords.
id: Django juga menyediakan :ref:`views <built-in-auth-views>` dan :ref:`forms <built-in-auth-forms>` yang mungkin digunakan untuk mengizinkan pengguna merubah sandi mereka sendiri.

source: Changing a user's password will log out all their sessions. See :ref:`session-invalidation-on-password-change` for details.
id: Merubah sandi pengguna akan keluar semua sesi mereka. Lihat :ref:`session-invalidation-on-password-change` untuk rincian.

source: Authenticating users
id: Pembuktian keaslian pengguna

source: Use :func:`~django.contrib.auth.authenticate()` to verify a set of credentials. It takes credentials as keyword arguments, ``username`` and ``password`` for the default case, checks them against each :ref:`authentication backend <authentication-backends>`, and returns a :class:`~django.contrib.auth.models.User` object if the credentials are valid for a backend. If the credentials aren't valid for any backend or if a backend raises :class:`~django.core.exceptions.PermissionDenied`, it returns ``None``. For example::
id: Gunakan :func:`~django.contrib.auth.authenticate()` untuk memeriksa kumpulan dari mandat. Itu mengambil mandat sebagai argumen kata kunci, ``username`` dan ``password`` untuk kasus awal, periksa mereka kembali setiap :ref:`authentication backend <authentication-backends>`, dan kembalikan obyek :class:`~django.contrib.auth.models.User` jika mandat sah untuk backend. Jika mandat tidak sah untuk setiap backend atau jika backend menampilkan :class:`~django.core.exceptions.PermissionDenied`, itu mengembalikan ``None``. Sebagai contoh::

source: ``request`` is an optional :class:`~django.http.HttpRequest` which is passed on the ``authenticate()`` method of the authentication backends.
id: ``request`` adalah sebuah pilihan :class:`~django.http.HttpRequest` yang dilewatkan pada metode ``authenticate()`` dari backend autentifikasi.

source: This is a low level way to authenticate a set of credentials; for example, it's used by the :class:`~django.contrib.auth.middleware.RemoteUserMiddleware`. Unless you are writing your own authentication system, you probably won't use this. Rather if you're looking for a way to login a user, use the :class:`~django.contrib.auth.views.LoginView`.
id: Ini adalah cara tingkat bawah untuk mengautentifikasi kumpulan dari kepercayaan; sebagai contoh, itu digunakan oleh :class:`~django.contrib.auth.middleware.RemoteUserMiddleware`.Meskipun anda sedang menulis sisten autentifikasi anda sendiri, anda mungkin tidak menggunakan ini. Daripada jika anda sedang mencari cara untuk masuk seorang pengguna, gunakan :class:`~django.contrib.auth.views.LoginView`.

source: Permissions and Authorization
id: Perizinan dan Pembuktian keaslian

source: Django comes with a simple permissions system. It provides a way to assign permissions to specific users and groups of users.
id: Django datang dengan sistem perizinan sederhana. Dia menyediakan jalan memberikan perizinan ke pengguna dan kelompok khusus dari pengguna.

source: It's used by the Django admin site, but you're welcome to use it in your own code.
id: Digunakan oleh situs admin Django, tetapi anda dipersilahkan menggunakannya di kode anda sendiri.

source: The Django admin site uses permissions as follows:
id: Situs admin Django menggunakan perizinan sebagai berikut:

source: Access to view the "add" form and add an object is limited to users with the "add" permission for that type of object.
id: Akses ke tampilan formulir "add" dan menambah sebuah obyek adalah terbatas untuk pengguna dengan perizinan "add" untuk jenis itu dari obyek.

source: Access to view the change list, view the "change" form and change an object is limited to users with the "change" permission for that type of object.
id: Akses ke tampilan daftar perubahan, tampilan formulir "change" dan merubah sebuah obyek adalah terbatas untuk pengguna dengan perizinan "change" untuk jenis obyek itu.

source: Access to delete an object is limited to users with the "delete" permission for that type of object.
id: Akses untuk menghapus sebuah obyek adalah terbatas pada pengguna dengan perizinan "hapus" untuk jenis itu dari obyek.

source: :class:`~django.contrib.auth.models.User` objects have two many-to-many fields: ``groups`` and ``user_permissions``. :class:`~django.contrib.auth.models.User` objects can access their related objects in the same way as any other :doc:`Django model </topics/db/models>`::
id: Obyek :class:`~django.contrib.auth.models.User` mempunyai dua bidang many-to-many: ``groups`` dan ``user_permissions``. Obyek :class:`~django.contrib.auth.models.User` dapat mengakses obyek terkait mereka di cara yang sama seperti yang :doc:`Django model </topics/db/models>` lain::

source: Default permissions
id: Perizinan pertama

source: These permissions will be created when you run :djadmin:`manage.py migrate <migrate>`; the first time you run ``migrate`` after adding ``django.contrib.auth`` to :setting:`INSTALLED_APPS`, the default permissions will be created for all previously-installed models, as well as for any new models being installed at that time. Afterward, it will create default permissions for new models each time you run :djadmin:`manage.py migrate <migrate>` (the function that creates permissions is connected to the :data:`~django.db.models.signals.post_migrate` signal).
id: Perizinan ini akan dibuat ketika anda menjalankan :djadmin:`manage.py migrate <migrate>`; pertama kali anda menjalankan ``migrate`` setelah menambahkan ``django.contrib.auth`` pada :setting:`INSTALLED_APPS`, perizinan awalan akan dibuat untuk semua model sebelumnya-terpasang, sama halnya untuk tiap model baru sedang dipasang pada waktu itu. Kemudian, itu akan membuat perizinan awalan untuk model baru setiap kali anda menjalankan :djadmin:`manage.py migrate <migrate>` (fungsi yang membuat perizinan adalah terhubung ke sinyal :data:`~django.db.models.signals.post_migrate`).

source: Assuming you have an application with an :attr:`~django.db.models.Options.app_label` ``foo`` and a model named ``Bar``, to test for basic permissions you should use:
id: Menganggap anda memiliki sebuah aplikasi dengan :attr:`~django.db.models.Options.app_label` ``foo`` dan model bernama ``Bar``, pada percobaan untuk perizinan dasar anda harus gunakan:

source: add: ``user.has_perm('foo.add_bar')``
id: tambah: ``user.has_perm('foo.add_bar')``

source: change: ``user.has_perm('foo.change_bar')``
id: rubah: ``user.has_perm('foo.change_bar')``

source: delete: ``user.has_perm('foo.delete_bar')``
id: hapus: ``user.has_perm('foo.delete_bar')``

source: The :class:`~django.contrib.auth.models.Permission` model is rarely accessed directly.
id: Model :class:`~django.contrib.auth.models.Permission` jarang diakses secara langsung.

source: Groups
id: Kelompok

source: :class:`django.contrib.auth.models.Group` models are a generic way of categorizing users so you can apply permissions, or some other label, to those users. A user can belong to any number of groups.
id: Model :class:`django.contrib.auth.models.Group` adalah cara umum dari mengkategorikan pengguna sehingga anda dapat memberlakukan perizinan, atau beberapa label lain, ke penggun tersebut. Seorang pengguna dapat milik ke tiap sejumlah kelompok.

source: A user in a group automatically has the permissions granted to that group. For example, if the group ``Site editors`` has the permission ``can_edit_home_page``, any user in that group will have that permission.
id: Seorang pengguna di kelompok secara otomatis mempunyai perizinan diberikan ke kelompok itu. Sebagai contoh, jika kelompok ``Site editors`` mempunyai perizinan ``can_edit_home_page``, tiap pengguna di kelompok itu akan mempunyai perizinan itu.

source: Beyond permissions, groups are a convenient way to categorize users to give them some label, or extended functionality. For example, you could create a group ``'Special users'``, and you could write code that could, say, give them access to a members-only portion of your site, or send them members-only email messages.
id: Diluar perizinan, kelompok adalah cara nyaman untuk mengkategorikan pengguna untuk memberikan mereka beberapa label, atau memperpanjang kegunaan. Sebagai contoh, anda dapat membuat kelompok ``'Special users'``, dan anda dapat menulis kode yang dapat, katakan, memberikan mereka akses ke bagian hanya-anggota dari situs anda, atau mengirim mereka pesan surel hanya-pesan.

source: Programmatically creating permissions
id: Pemrograman membuat perizinan

source: While :ref:`custom permissions <custom-permissions>` can be defined within a model's ``Meta`` class, you can also create permissions directly. For example, you can create the ``can_publish`` permission for a ``BlogPost`` model in ``myapp``::
id: Selagi :ref:`custom permissions <custom-permissions>` dapat ditentukan dalam kelas ``Meta`` model, anda dapat juga membuat perizinan secara langsung. Sebagai contoh, anda dapat membuat perizinan ``can_publish`` untuk model ``BlogPost`` di ``myapp``::

source: The permission can then be assigned to a :class:`~django.contrib.auth.models.User` via its ``user_permissions`` attribute or to a :class:`~django.contrib.auth.models.Group` via its ``permissions`` attribute.
id: Perizinan dapat kemudian diberikan pada :class:`~django.contrib.auth.models.User` melalui atribut ``user_permissions`` nya atau ke :class:`~django.contrib.auth.models.Group` melalui atribut ``permissions`` nya.

source: Permission caching
id: Perizinan penyimpanan sementara

source: The :class:`~django.contrib.auth.backends.ModelBackend` caches permissions on the user object after the first time they need to be fetched for a permissions check. This is typically fine for the request-response cycle since permissions aren't typically checked immediately after they are added (in the admin, for example). If you are adding permissions and checking them immediately afterward, in a test or view for example, the easiest solution is to re-fetch the user from the database. For example::
id: Perizinan tembolok :class:`~django.contrib.auth.backends.ModelBackend` pada obyek user setelah pertama kali mereka butuh diambil untuk pemeriksaan perizinan. Ini adalah khususnya baik untuk siklus tanggapan-permintaan sejak perizinan tidak secara khusus memeriksa segera setelah mereka sitambahkan (dalam admin, sebagai contoh). Jika anda menambahkan perizinan dan memeriksa mereka segera setelahnya, dalam percobaan atau tampilan sebagai contoh, pemecahan termudah adalah mengambil kembali dari basisdata. Sebagai contoh::

source: Authentication in Web requests
id: Pembuktian keaslian di permintaan Jaringan

source: Django uses :doc:`sessions </topics/http/sessions>` and middleware to hook the authentication system into :class:`request objects <django.http.HttpRequest>`.
id: Django menggunakan :doc:`sessions </topics/http/sessions>` dan middleware untuk menghubungkan sitem otentifikasi kedalam :class:`request objects <django.http.HttpRequest>`.

source: These provide a :attr:`request.user <django.http.HttpRequest.user>` attribute on every request which represents the current user. If the current user has not logged in, this attribute will be set to an instance of :class:`~django.contrib.auth.models.AnonymousUser`, otherwise it will be an instance of :class:`~django.contrib.auth.models.User`.
id: Ini menyediakan sebuah atribut :attr:`request.user <django.http.HttpRequest.user>` pada setiap permintaan yang mewakili pengguna saat ini. Jika pengguna saat ini belum masuk, atribut ini akan disetel ke sebuah instance dari :class:`~django.contrib.auth.models.AnonymousUser`, sebaliknya itu akan berupa sebuah instance dari :class:`~django.contrib.auth.models.User`.

source: You can tell them apart with :attr:`~django.contrib.auth.models.User.is_authenticated`, like so::
id: Anda dapat memberitahu mereka selain dengan :attr:`~django.contrib.auth.models.User.is_authenticated`, seperti begitu ::

source: How to log a user in
id: Bagaimana cara masuk pengguna

source: If you have an authenticated user you want to attach to the current session - this is done with a :func:`~django.contrib.auth.login` function.
id: Jika anda mempunyai pengguna terotentifikasi anda ingin lampirkan ke sesi saat ini - ini dilakukan dengan fungsi :func:`~django.contrib.auth.login`.

source: To log a user in, from a view, use :func:`~django.contrib.auth.login()`. It takes an :class:`~django.http.HttpRequest` object and a :class:`~django.contrib.auth.models.User` object. :func:`~django.contrib.auth.login()` saves the user's ID in the session, using Django's session framework.
id: Untuk pengguna masuk, dari tampilan, gunakan :func:`~django.contrib.auth.login()`. Itu mengambil sebuah obyek :class:`~django.http.HttpRequest` dan sebuah obyek :class:`~django.contrib.auth.models.User`. :func:`~django.contrib.auth.login()` menyimpan ID pengguna di sesi, menggunakan kerangka kerja sesi Django.

source: Note that any data set during the anonymous session is retained in the session after a user logs in.
id: Catat bahwa tiap data disetel selama sesi anonim dipertahankan di sesi setelah pengguna masuk.

source: This example shows how you might use both :func:`~django.contrib.auth.authenticate()` and :func:`~django.contrib.auth.login()`::
id: Contoh ini menunjukkan bagaimana anda mungkin menggunakan kedua :func:`~django.contrib.auth.authenticate()` dan :func:`~django.contrib.auth.login()`::

source: Selecting the authentication backend
id: Memilih backend otentifikasi

source: When a user logs in, the user's ID and the backend that was used for authentication are saved in the user's session. This allows the same :ref:`authentication backend <authentication-backends>` to fetch the user's details on a future request. The authentication backend to save in the session is selected as follows:
id: Ketika seorang pengguna masuk, ID pengguna dan backend yang telah digunakan untuk autentifikasi disimpan dalam sesi pengguna. Ini mengizinkan :ref:`authentication backend <authentication-backends>` sama untuk mengambil rincian pengguna pada permintaan akan datang. Backend autentifikasi untuk menyimpan sesi dipilih sebagai berikut:

source: Use the value of the optional ``backend`` argument, if provided.
id: Gunakan nilai dai argumen ``backend`` pilihan, jika disediakan.

source: Use the value of the ``user.backend`` attribute, if present. This allows pairing :func:`~django.contrib.auth.authenticate()` and :func:`~django.contrib.auth.login()`: :func:`~django.contrib.auth.authenticate()` sets the ``user.backend`` attribute on the user object it returns.
id: Gunakan nilai dari atribut ``user.backend``, jika hadir. Ini mengizinkan memasangkan :func:`~django.contrib.auth.authenticate()` dan :func:`~django.contrib.auth.login()`: :func:`~django.contrib.auth.authenticate()` menyetel atribut ``user.backend`` pada obyek user dia kembalikan.

source: Use the ``backend`` in :setting:`AUTHENTICATION_BACKENDS`, if there is only one.
id: Gunakan ``backend`` dalam :setting:`AUTHENTICATION_BACKENDS`, jika hanya ada satu.

source: Otherwise, raise an exception.
id: Sebaliknya, munculkan sebuah pengecualian.

source: In cases 1 and 2, the value of the ``backend`` argument or the ``user.backend`` attribute should be a dotted import path string (like that found in :setting:`AUTHENTICATION_BACKENDS`), not the actual backend class.
id: Di kasus 1 dan 2, nilai dari argumen ``backend`` atau atribut ``user.backend`` harus di impor bertitik jalur deretan karakter (seperti yang ditemukan di :setting:`AUTHENTICATION_BACKENDS`), bukan kelas backend sebenarnya.

source: How to log a user out
id: Bagaimana cara pengguna keluar

source: To log out a user who has been logged in via :func:`django.contrib.auth.login()`, use :func:`django.contrib.auth.logout()` within your view. It takes an :class:`~django.http.HttpRequest` object and has no return value. Example::
id: Untuk keluar pengguna yang telah masuk melalui :func:`django.contrib.auth.login()`, gunakan :func:`django.contrib.auth.logout()` dalam tampilan anda. Itu mengambil sebuah obyek :class:`~django.http.HttpRequest` dan tidak nilai mempunyai kembalian. Contoh::

source: Note that :func:`~django.contrib.auth.logout()` doesn't throw any errors if the user wasn't logged in.
id: Catat bahwa :func:`~django.contrib.auth.logout()` tidak melempar kesalahan apapun jika pengguna tidak masuk.

source: When you call :func:`~django.contrib.auth.logout()`, the session data for the current request is completely cleaned out. All existing data is removed. This is to prevent another person from using the same Web browser to log in and have access to the previous user's session data. If you want to put anything into the session that will be available to the user immediately after logging out, do that *after* calling :func:`django.contrib.auth.logout()`.
id: Ketika anda memanggil :func:`~django.contrib.auth.logout()`, data sesi untuk permintaan saat ini sepenuhnya dibersihkan. Semua data yang ada dipindahkan. Ini adalah untuk mencegah orang lain dari menggunakan peramban Jaringan sama untuk masuk dan memiliki akses ke data sesi pengguna sebelumnya. Jika anda ingin menaruh apapun kedalam sesi yang akan tersedia ke pengguna segera setelah keluar, lakukan itu *setelah* memanggil :func:`django.contrib.auth.logout()`.

source: Limiting access to logged-in users
id: Membatasi akses ke pengguna masuk

source: The raw way
id: Cara mentah

source: The simple, raw way to limit access to pages is to check :attr:`request.user.is_authenticated <django.contrib.auth.models.User.is_authenticated>` and either redirect to a login page::
id: Sederhana, cara mentah untuk membatasi akses ke halaman adalah memeriksa :attr:`request.user.is_authenticated <django.contrib.auth.models.User.is_authenticated>` dan antara mengalihkan ke halaman masuk::

source: ...or display an error message::
id: ...atau menampilkan pesan kesalahan::

source: The ``login_required`` decorator
id: Penghias ``login_required``

source: As a shortcut, you can use the convenient :func:`~django.contrib.auth.decorators.login_required` decorator::
id: Sebagai jalan pintas, anda dapat menggunakan penghias :func:`~django.contrib.auth.decorators.login_required` yang cocok.

source: :func:`~django.contrib.auth.decorators.login_required` does the following:
id: :func:`~django.contrib.auth.decorators.login_required` melakukan berikut:

source: If the user isn't logged in, redirect to :setting:`settings.LOGIN_URL <LOGIN_URL>`, passing the current absolute path in the query string. Example: ``/accounts/login/?next=/polls/3/``.
id: Jika pengguna tidak masuk, alihkan ke :setting:`settings.LOGIN_URL <LOGIN_URL>`, melewati jalur mutlak saat ini di permintaan deretan karakter. Contoh: ``/accounts/login/?next=/polls/3/``.

source: If the user is logged in, execute the view normally. The view code is free to assume the user is logged in.
id: Jika pengguna masuk, jalankan tampilan secara biasa. Kode tampilan adalah bebas untuk menganggap pengguna adalah masuk.

source: By default, the path that the user should be redirected to upon successful authentication is stored in a query string parameter called ``"next"``. If you would prefer to use a different name for this parameter, :func:`~django.contrib.auth.decorators.login_required` takes an optional ``redirect_field_name`` parameter::
id: Secara awalan, jalur yang pengguna harus dialihkan untuk atas keberhasilan otentifikasi adalah disimpan di permintaan parameter deretan karakter disebut ``"next"``. Jika anda akan memilih menggunakan nama berbeda untuk parameter ini, :func:`~django.contrib.auth.decorators.login_required` mengambil sebuah pilihan parameter ``redirect_field_name``.

source: Note that if you provide a value to ``redirect_field_name``, you will most likely need to customize your login template as well, since the template context variable which stores the redirect path will use the value of ``redirect_field_name`` as its key rather than ``"next"`` (the default).
id: Catat bahwa jika anda menyediakan nilai pada ``redirect_field_name``, anda akan paling disukai butuh menyesuaikan cetakan masuk anda juga, sejak cetakan varaibel konteks yang menyimpan jalur pengalihan akan menggunakan nilai dari ``redirect_field_name``sebagai kuncinya daripada ``"next"`` (awalan).

source: :func:`~django.contrib.auth.decorators.login_required` also takes an optional ``login_url`` parameter. Example::
id: :func:`~django.contrib.auth.decorators.login_required` juga mengambil sebuah pilihan parameter ``login_url``. Contoh::

source: Note that if you don't specify the ``login_url`` parameter, you'll need to ensure that the :setting:`settings.LOGIN_URL <LOGIN_URL>` and your login view are properly associated. For example, using the defaults, add the following lines to your URLconf::
id: Catat bahwa jika anda tidak menentukan parameter ``login_url``, anda akan butuh memastikan bahwa :setting:`settings.LOGIN_URL <LOGIN_URL>` dan tampilan masuk anda benar terhubung. Sebagai contoh, menggunakan awalan, tambah baris berikut ke URLconf anda::
