Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: If you wanted to add a new manager to the Proxy, without replacing the existing default, you can use the techniques described in the :ref:`custom manager <custom-managers-and-inheritance>` documentation: create a base class containing the new managers and inherit that after the primary base class::
id: Jika anda ingin menambahkan sebuah pengelola baru pada Proxy, tanpa mengganti awalan yang ada, anda dapat menggunakan teknik-teknik digambarkan dalam dokumentasi :ref:`custom manager <custom-managers-and-inheritance>` : buat sebuah kelas dasar mengandung pengelola baru dan mewarisi itu setelah kelas dasar utama::

source: You probably won't need to do this very often, but, when you do, it's possible.
id: Anda mungkin tidak butuh melakukan ini terlalu sering, tetapi, ketika anda melakukan, sangat memungkinkan.

source: Differences between proxy inheritance and unmanaged models
id: Perbedaan diantara warisan proxy dan model tidak dikendalikan

source: Proxy model inheritance might look fairly similar to creating an unmanaged model, using the :attr:`~django.db.models.Options.managed` attribute on a model's ``Meta`` class.
id: Warisan model proxy mungkin terlihat cukup mirip untuk membuat sebuah model tidak dikendalikan, menggunakan atribut :attr:`~django.db.models.Options.managed` pada kelas ``Meta`` model.

source: With careful setting of :attr:`Meta.db_table <django.db.models.Options.db_table>` you could create an unmanaged model that shadows an existing model and adds Python methods to it. However, that would be very repetitive and fragile as you need to keep both copies synchronized if you make any changes.
id: Dengan pengaturan hati-hati dari :attr:`Meta.db_table <django.db.models.Options.db_table>` anda dapat membuat sebuah model tidak dikendalikan yang membayangi sebuah model yang ada dan menambahkan metode-metode Python pada itu. Bagaimanapun, bahwa akan menjadi berulang dan rentan ketika anda butuh menjaga kedua salinan sinkronisasi jika anda membuat perubahan apapun.

source: On the other hand, proxy models are intended to behave exactly like the model they are proxying for. They are always in sync with the parent model since they directly inherit its fields and managers.
id: Di sisi lain, model-model proxy berusaha untuk berperilaku tepatnya seperti model mereka sedang memproxikan. Mereka selalu dalam sinkronisasi dengan model induk sejak mereka langsung mewarisi bidang-bidang dan pengelolanya.

source: The general rules are:
id: Aturan-aturan umum adalah:

source: If you are mirroring an existing model or database table and don't want all the original database table columns, use ``Meta.managed=False``. That option is normally useful for modeling database views and tables not under the control of Django.
id: Jika anda sedang mencerminkan model yang ada atau tabel basisdata dan tidak ingin semua kotom tabel basisdata asli, gunakan ``Meta.managed=False``. Pilihan itu biasanya berguna untuk permodelan tampilan basisdata dan tabel tidak dibawah kendali Django.

source: If you are wanting to change the Python-only behavior of a model, but keep all the same fields as in the original, use ``Meta.proxy=True``. This sets things up so that the proxy model is an exact copy of the storage structure of the original model when data is saved.
id: Jika anda ingin merubah perilaku hanya-Python dari sebuah model, tetapi menjaga semua bidang sama sebagai dalam aslinya, gunakan ``Meta.proxy=True``.Ini menyetel sehingga model proxy adalah sebuah salinan tepat dari struktur penyimpanan dari model asli ketika data disimpan.

source: Multiple inheritance
id: Banyak warisan

source: Just as with Python's subclassing, it's possible for a Django model to inherit from multiple parent models. Keep in mind that normal Python name resolution rules apply. The first base class that a particular name (e.g. :ref:`Meta <meta-options>`) appears in will be the one that is used; for example, this means that if multiple parents contain a :ref:`Meta <meta-options>` class, only the first one is going to be used, and all others will be ignored.
id: Sama seperi pensubkelasan Python, itu memungkinkan untuk model Django untuk mewarisi dari banyak model induk. Mengingat bahwa aturan keputusan nama Python biasa berlaku. Kelas dasar pertama yang nama tertentu (sebagai contoh :ref:`Meta 1`)muncul akan menjadi satu yang digunakan; sebagai contoh, ini berarti bahwa jika banyak induk mengandung kelas :ref:`Meta 2`, hanya satu pertama yang akan digunakan, dan semua lainnya akan diabaikan.

source: Generally, you won't need to inherit from multiple parents. The main use-case where this is useful is for "mix-in" classes: adding a particular extra field or method to every class that inherits the mix-in. Try to keep your inheritance hierarchies as simple and straightforward as possible so that you won't have to struggle to work out where a particular piece of information is coming from.
id: Umumnya, anda tidak akan butuh mewarisi banyak induk. Kasus-kegunaan utama dimana ini berguna adalah untuk kelas "mix-in": menambahkan bidang ekstra tertentu atau metode pada setiap kelas yang mewarisi mix-in. Coba untuk menjaga hirarki warisan anda sesederhana dan semudah mungkin sehingga anda tidak harus berjuang bekerja diluar dimana potongan tertentu dari informasi berasal.

source: Note that inheriting from multiple models that have a common ``id`` primary key field will raise an error. To properly use multiple inheritance, you can use an explicit :class:`~django.db.models.AutoField` in the base models::
id: Catat bahwa mewarisi dari banyak model yang mempunyai primary key ``id`` umum akan memunculkan sebuah kesalahan. Untuk penggunaan benar warisan banyak, anda dapat menggunakan :class:`~django.db.models.AutoField` jelas dalam model dasar.

source: Or use a common ancestor to hold the :class:`~django.db.models.AutoField`. This requires using an explicit :class:`~django.db.models.OneToOneField` from each parent model to the common ancestor to avoid a clash between the fields that are automatically generated and inherited by the child::
id: Atau gunakan leluhur paling umum untuk menahan :class:`~django.db.models.AutoField`. Ini mewajibkan menggunakan sebuah :class:`~django.db.models.OneToOneField` secara jelas dari setiap model induk pada leluhur umum untuk menghindari bentrokan diantara bidang yang otomatis dibangkitkan dan diwarisi oleh anak::

source: Field name "hiding" is not permitted
id: Nama bidang "hiding" tidak diizinkan

source: In normal Python class inheritance, it is permissible for a child class to override any attribute from the parent class. In Django, this isn't usually permitted for model fields. If a non-abstract model base class has a field called ``author``, you can't create another model field or define an attribute called ``author`` in any class that inherits from that base class.
id: Dalam warisan kelas Python biasan itu diizinkan untuk kelas anak menimpa atribut apapun dari kelas induk. Dalam Django, ini tidak biasanya diizinkan untuk bidang model. Jika kelas dasar model bukan-abstrak mempunyai sebuah bidang disebut ``author``, anda tidak dapat membuat bidang model lain atau menentukan sebuah atribut disebut ``author`` dalam kelas apapun yang mewarisi dari kelas dasar.

source: This restriction doesn't apply to model fields inherited from an abstract model. Such fields may be overridden with another field or value, or be removed by setting ``field_name = None``.
id: Batasan ini tidak berlaku ke bidang model diwarisi dari sebuah model abstrak. Bidang itu mungkin ditimpa dengan bidang atau nilai lain, atau dipindahkan dengan mengatur ``field_name = None``.

source: Model managers are inherited from abstract base classes. Overriding an inherited field which is referenced by an inherited :class:`~django.db.models.Manager` may cause subtle bugs. See :ref:`custom managers and model inheritance <custom-managers-and-inheritance>`.
id: Pengelola model diwarisi dari kelas-kelas dasar abstrak. menimpa sebuah bidang warisan yang diacukan oleh sebuah :class:`~django.db.models.Manager` warisan mungkin menyebabkan kesalahan halus. Lihat :ref:`custom managers and model inheritance 1`.

source: Some fields define extra attributes on the model, e.g. a :class:`~django.db.models.ForeignKey` defines an extra attribute with ``_id`` appended to the field name, as well as ``related_name`` and ``related_query_name`` on the foreign model.
id: Beberapa bidang-bidang menentukan tambahan atribut pada model, sebagai contoh sebuah :class:`~django.db.models.ForeignKey` menentukan sebuah tambahan atribut dengan ``_id`` ditambahkan pada nama bidang, sama halnya ``related_name`` dan ``related_query_name`` pada model asing.

source: These extra attributes cannot be overridden unless the field that defines it is changed or removed so that it no longer defines the extra attribute.
id: Atribut-atribut tambahan ini tidak dapat ditambahkan meskipun bidang yang menentukan itu berubah atau dipindahkan sehingga itu tidak lagi menentukan atribut tambahan.

source: Overriding fields in a parent model leads to difficulties in areas such as initializing new instances (specifying which field is being initialized in ``Model.__init__``) and serialization. These are features which normal Python class inheritance doesn't have to deal with in quite the same way, so the difference between Django model inheritance and Python class inheritance isn't arbitrary.
id: Menimpa bidang-bidang dalam model induk membawa ke kesulitan dalam kawasan seperti pengawalan instance baru (menentukan bidang mana sedang diawalkan dalam ``Model.__init__``)dan serialisasi. Ini adalah fitur-fitur yang warisan kelas Python biasa tidak harus berurusan dengan cara yang sama, jadi perbedaan diantara kelas warisan model Django tidak berubah-ubah.

source: This restriction only applies to attributes which are :class:`~django.db.models.Field` instances. Normal Python attributes can be overridden if you wish. It also only applies to the name of the attribute as Python sees it: if you are manually specifying the database column name, you can have the same column name appearing in both a child and an ancestor model for multi-table inheritance (they are columns in two different database tables).
id: Pembatasan ini hanya berlaku pada atribut-atribut yang adalah instance :class:`~django.db.models.Field`. Atribut Python biasa dapat ditimpa jika anda harapkan. Itu juga hanya berlaku pada nama dari atribut seperti Python lihat: jika anda sedang secara manual menentukan nama kolom basisdata, anda dapat mempunyai nama kolom sama muncul di kedua model anak dan leluhur untuk warisan banyak-tabel (mereka adalah kolom-kolom dalam dua tabel-tabel basisdata berbeda).

source: Django will raise a :exc:`~django.core.exceptions.FieldError` if you override any model field in any ancestor model.
id: Django akan memunculkan sebuah :exc:`~django.core.exceptions.FieldError` jika anda menimpa bidang model apapun dalam model pendahulu apapun.

source: Organizing models in a package
id: Mengorganisasikan model-model dalam sebuah paket

source: The :djadmin:`manage.py startapp <startapp>` command creates an application structure that includes a ``models.py`` file. If you have many models, organizing them in separate files may be useful.
id: Perintah :djadmin:`manage.py startapp <startapp>` membuat sebuah struktur aplikasi yang menyertakan sebuah berkas ``models.py``. Jika anda mempunyai banyak model, mengorganisasikan mereka dalam berkas-berkas terpisah mungkin membantu.

source: To do so, create a ``models`` package. Remove ``models.py`` and create a ``myapp/models/`` directory with an ``__init__.py`` file and the files to store your models. You must import the models in the ``__init__.py`` file.
id: Untuk melakukannya, buat sebuah paket ``models``. Pindahkan ``models.py`` dan buat sebuah direktori ``myapp/models/`` dengan sebuah berkas ``__init__.py`` dan berkas-berkas untuk menyimpan model-model anda. Anda harus mengimpor model-model dalam berkas ``__init__.py``.

source: For example, if you had ``organic.py`` and ``synthetic.py`` in the ``models`` directory:
id: Sebagai contoh, jika anda mempunyai ``organic.py`` dan ``synthetic.py`` dalam direktori ``models``:

source: Explicitly importing each model rather than using ``from .models import *`` has the advantages of not cluttering the namespace, making code more readable, and keeping code analysis tools useful.
id: Jelas mengimpor setiap model daripada menggunakan ``from .models import *`` mempunyai keuntungan dari tidak berantakan namespace, membuat kode lebih dapat dibaca, dan menjaga alat analisa kode berguna.

source: :doc:`The Models Reference </ref/models/index>`
id: :doc:`Acuan Model </ref/models/index>`

source: Covers all the model related APIs including model fields, related objects, and ``QuerySet``.
id: Meliputi semua API terkait model termasuk bidang-bidang model, obyek terkait, dan ``QuerySet``.

source: This topic guide describes Django's support for interacting with multiple databases. Most of the rest of Django's documentation assumes you are interacting with a single database. If you want to interact with multiple databases, you'll need to take some additional steps.
id: Panduan topik ini menggambarkan dukungan Django untuk interaksi dengan banyak basisdata. Kebanyakan dari sisa dokumentasi Djangomenganggap anda berinteraksi dengan basisdata tunggal. Jika anda ingin berinteraksi dengan banyak basisdata, anda akan butuh mengambil beberapa langkah-langkah tambahan.

source: Defining your databases
id: Menentukan basisdata anda

source: The first step to using more than one database with Django is to tell Django about the database servers you'll be using. This is done using the :setting:`DATABASES` setting. This setting maps database aliases, which are a way to refer to a specific database throughout Django, to a dictionary of settings for that specific connection. The settings in the inner dictionaries are described fully in the :setting:`DATABASES` documentation.
id: Langkah pertama untuk menggunakan lebih dari satu basisdata dengan Django adalah memberitahu Django tentang peladen basisdata anda akan gunakan. Ini dilakukan menggunakan pengaturan :setting:`DATABASES`. Pengaturan ini memetakan nama lain basisdata, yang adalah cara mengacu ke basisdata tertentu sepanjang Django, ke sebuah kamus dari pengaturan untuk hubungan tertentu itu. Pengaturan di sebelah dalam kamus digambarkan sepenuhnya dalam dokumentasi :setting:`DATABASES`.

source: Databases can have any alias you choose. However, the alias ``default`` has special significance. Django uses the database with the alias of ``default`` when no other database has been selected.
id: Basisdata dapat mempunyai nama lain apapun anda pilih. Bagaimanapun, nama lain ``default`` mempunyai makna khusus. Django menggunakan basisdata dengan nama lain dari ``default`` ketika tidak ada lagi basisdata telah dipilih.

source: The following is an example ``settings.py`` snippet defining two databases -- a default PostgreSQL database and a MySQL database called ``users``::
id: Berikut adalah sebuah contoh potongan ``settings.py`` menentukan dua basisdata -- sebuah awalan basisdata PostgreSQL dan basisdata MySQL disebut ``users``::

source: If the concept of a ``default`` database doesn't make sense in the context of your project, you need to be careful to always specify the database that you want to use. Django requires that a ``default`` database entry be defined, but the parameters dictionary can be left blank if it will not be used. To do this, you must set up :setting:`DATABASE_ROUTERS` for all of your apps' models, including those in any contrib and third-party apps you're using, so that no queries are routed to the default database. The following is an example ``settings.py`` snippet defining two non-default databases, with the ``default`` entry intentionally left empty::
id: Jika konsep dari basisdata ``default`` tidak masuk akal dalam konteks proyek anda, anda butuh berhati-hati untuk selalu menentukan basisdata anda ingin gunakan. Django membutuhkan masukan basisdata ``default`` untuk ditentukan, tetapi parameter dictionary dapat berupa kosong jika itu akan tidak digunakan. Untuk melakkukan ini, anda harus menyetel :setting:`DATABASE_ROUTERS` untuk semua dari model aplikasi anda, termasuk itu dalam bantuan dan aplikasi pihak-ketiga apapun anda sedang gunakan, sehingga tidak ada permintaan ke basisdata awalan. Berikut adalah contoh potongan ``settings.py`` menentukan basisdata dua bukan-awalan, dengan masukan ``default`` sengaja dibiarkan kosong::

source: If you attempt to access a database that you haven't defined in your :setting:`DATABASES` setting, Django will raise a ``django.db.utils.ConnectionDoesNotExist`` exception.
id: Jika anda berusaha mengakses basisdata yang anda belum menentukan dalam pengaturan setting:`DATABASES` anda, Django akan memunculkan sebuah pengecualian ``django.db.utils.ConnectionDoesNotExist``.

source: Synchronizing your databases
id: Sinkronisasi basisdata anda

source: The :djadmin:`migrate` management command operates on one database at a time. By default, it operates on the ``default`` database, but by providing the :option:`--database <migrate --database>` option, you can tell it to synchronize a different database. So, to synchronize all models onto all databases in the first example above, you would need to call::
id: Perintah pengelolaan :djadmin:`migrate` berjalan pada satu basisdata pada satu waktu. Secara awalan, itu berjalan pada basisdata ``default``, tetapi dengan menyediakan pilihan :option:`--database 1`, anda dapat memberitahu itu untuk mensinkronkan basisdata berbeda. Jadi, untuk mensinkronkan semua kedalam semua basisdata dalam contoh pertama diatas, anda akan butuh memanggil::

source: If you don't want every application to be synchronized onto a particular database, you can define a :ref:`database router<topics-db-multi-db-routing>` that implements a policy constraining the availability of particular models.
id: Jika anda tidak ingin setiap aplikasi disinkronkan kedalam basisdata tertentu, anda dapat menentukan :ref:`database router1` yang menerapkan batasan kebijakan ketersediaan dari model tertentu.

source: If, as in the second example above, you've left the ``default`` database empty, you must provide a database name each time you run :djadmin:`migrate`. Omitting the database name would raise an error. For the second example::
id: Jika, seperti dalam contoh kedua diatas, anda telah meninggalkan basisdata ``default`` kosong, anda harus menyediakan sebuah nama basisdata setiap waktu anda menjalankan :djadmin:`migrate`. Menghilangkan nama basisdata akan memunculkan sebuah kesalahan. Untuk contoh kedua::

source: Using other management commands
id: Menggunakan perintah pengelolaan lain

source: Most other ``django-admin`` commands that interact with the database operate in the same way as :djadmin:`migrate` -- they only ever operate on one database at a time, using ``--database`` to control the database used.
id: Kebanyakan perintah ``django-admin`` lain yang berinteraksi dengan basisdata berjalan dalam cara sama seperti :djadmin:`migrate` --mereka hanya berjalan pada satu basisdata pada satu waktu, menggunakan ``--database``untuk mengendalikan penggunaan basisdata.

source: An exception to this rule is the :djadmin:`makemigrations` command. It validates the migration history in the databases to catch problems with the existing migration files (which could be caused by editing them) before creating new migrations. By default, it checks only the ``default`` database, but it consults the :meth:`allow_migrate` method of :ref:`routers <topics-db-multi-db-routing>` if any are installed.
id: Sebuah pengecualian pada aturan ini adalah perintah :djadmin:`makemigrations`. Itu mengecek riwayat perpindahan di basisdata untuk menangkap masalah dengan berkas perpindahan yang ada (yang dapat disebabkan dengan menyunting mereka) sebelum membuat perpindahan baru. Secara awalan, itu memeriksa hanya basisdata ``default``, tetapi itu merundingkan metode :meth:`allow_migrate` dari :ref:`routers <topics-db-multi-db-routing>` jika apapun terpasang.

source: Automatic database routing
id: Perute basisdata otomatis

source: The easiest way to use multiple databases is to set up a database routing scheme. The default routing scheme ensures that objects remain 'sticky' to their original database (i.e., an object retrieved from the ``foo`` database will be saved on the same database). The default routing scheme ensures that if a database isn't specified, all queries fall back to the ``default`` database.
id: Cara termudah menggunakan banyak basisdata adalah menyetel skema perutean basisdata. Skema perutean awalan memastikan bahwa obyek tetap 'sticky' ke basisdata aslinya (yaitu, obyek diambil dari basisdata ``foo`` akan disimpan pada basisdata sama). Skema perute awalan memastikan bahwa jika sebuah absisdata tidak ditentukan, semua permintaan kembali ke basisdata ``default``.

source: You don't have to do anything to activate the default routing scheme -- it is provided 'out of the box' on every Django project. However, if you want to implement more interesting database allocation behaviors, you can define and install your own database routers.
id: Anda tidak perlu melakukan apapun untuk mengaktifkan skema perutean awalan -- itu disediakan 'beda dari biasanya' pada setiap proyek Django. Bagaimanapun, jika anda ingin menerapkan lebih menarik perilaku peruntukan basisdata, anda dapat menentukan dan memasang perute basisdata anda sendiri.

source: Database routers
id: Router basisdata

source: A database Router is a class that provides up to four methods:
id: Perute basisdata adalah kelas yang menyediakan sampai empat metode:

source: Suggest the database that should be used for read operations for objects of type ``model``.
id: Sarankan basisdata yang harus digunakan untuk membaca tindakan-tindakan untuk obyek dari jenis ``model``.

source: If a database operation is able to provide any additional information that might assist in selecting a database, it will be provided in the ``hints`` dictionary. Details on valid hints are provided :ref:`below <topics-db-multi-db-hints>`.
id: Jika tindakan basisdata dapat menyediakan informasi tambahan apapun yang mungkin membantu dalam memilih basisdata, itu akan menyediakan dalam dictionary ``hints``. Rincian pada peunjuk sah disediakan :ref:`below 1`.

source: Returns ``None`` if there is no suggestion.
id: Mengembalikan ``None`` jika tidak ada saran.

source: Suggest the database that should be used for writes of objects of type Model.
id: Sarankan basisdata yang harus digunakan untuk menulis dari obyek dari jenis Model.

source: Return ``True`` if a relation between ``obj1`` and ``obj2`` should be allowed, ``False`` if the relation should be prevented, or ``None`` if the router has no opinion. This is purely a validation operation, used by foreign key and many to many operations to determine if a relation should be allowed between two objects.
id: Mengembalikan ``True`` jika sebuah hubungan diantara ``obj1`` dan ``obj2`` harus diizinkan, ``False`` jika hubungan harus dicegah, atau ``None`` jika perute tidak memiliki pendapat. Ini adalah murni tindakan pengesahan, digunakan oleh foreign key dan tindakan many to many untuk menentukan jika hubungan harus diizinkan diantara dua obyek.
