Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Specifying ``model = Publisher`` is really just shorthand for saying ``queryset = Publisher.objects.all()``. However, by using ``queryset`` to define a filtered list of objects you can be more specific about the objects that will be visible in the view (see :doc:`/topics/db/queries` for more information about :class:`~django.db.models.query.QuerySet` objects, and see the :doc:`class-based views reference </ref/class-based-views/index>` for the complete details).
id: Menentukan `model = Publisher`` adalah hanya tulisan cepat untuk mengatakan ``queryset = Publisher.objects.all()``. Bagaimanapun, dengan menggunakan ``queryset`` untuk menentukan daftar disaring dari obyek anda dapat lebih khususkan tentang obyek yang akan muncul di tampilan (lihat :doc:`/topics/db/queries` untuk informasi lebih tentang obyek :class:`~django.db.models.query.QuerySet`, dan lihat :doc:`class-based views reference </ref/class-based-views/index>` untuk rincian lengkap).

source: To pick a simple example, we might want to order a list of books by publication date, with the most recent first::
id: Untuk mengambil sebuah contoh sederhana, kami mungkin ingin mengurutkan daftar dari buku-buku dari tanggal terbit, dengan pertama paling terbaru::

source: That's a pretty simple example, but it illustrates the idea nicely. Of course, you'll usually want to do more than just reorder objects. If you want to present a list of books by a particular publisher, you can use the same technique::
id: Itu adalah contoh sederhana cantik, tetapi itu menggambarkan ide sangat bagus. Tentu saja, anda akan biasanya ingin melakukan lebih daripada mengurutkan kembali obyek. Jika anda ingin menghadirkan daftar buku oleh penerbit tertentu, anda dapat menggunakan teknis sama::

source: Notice that along with a filtered ``queryset``, we're also using a custom template name. If we didn't, the generic view would use the same template as the "vanilla" object list, which might not be what we want.
id: ikan bahwa selama dengan ``queryset`` disaring, kami juga menggunakan nama cetakan penyesuaian. Jika kami tidak, tampilan umum akan menggunakan cetakan sama seperti daftar obyek "vanilla", yang mungkin tidak kita inginkan.

source: Also notice that this isn't a very elegant way of doing publisher-specific books. If we want to add another publisher page, we'd need another handful of lines in the URLconf, and more than a few publishers would get unreasonable. We'll deal with this problem in the next section.
id: Juga perharikan bahwa ini bukan cara sangat elegan dari melakukan buku khusus-penerbit. Jika kami ingin menambah halaman penerbit lain, kami butuh bantuan lain dari baris di URLconf, dan lebih dari sedikit penerbit akan mendapatkan alasan tidak masuk akal. Kami akan berurusan dengan masalah ini di bagian selanjutnya.

source: If you get a 404 when requesting ``/books/acme/``, check to ensure you actually have a Publisher with the name 'ACME Publishing'. Generic views have an ``allow_empty`` parameter for this case. See the :doc:`class-based-views reference</ref/class-based-views/index>` for more details.
id: Jika anda mendapatkan sebuah 404 ketika meminta ``/books/acme/``, periksa untuk memastikan anda sebenarnya mempunyai sebuah Publisher dengan nama 'ACME Publishing'. Tampilan umum mempunyai sebuah parameter ``allow_empty`` untuk kasus ini. Lihat :doc:`class-based-views reference</ref/class-based-views/index>` untuk rincian.

source: Dynamic filtering
id: Menyaring dinamis

source: Another common need is to filter down the objects given in a list page by some key in the URL. Earlier we hard-coded the publisher's name in the URLconf, but what if we wanted to write a view that displayed all the books by some arbitrary publisher?
id: Kebutuhan umum lain adalah menyaring kebawah obyek yang diberikan di halaman daftar dengan beberapa kunci di URL. Awalnya kami mengkode-keraskan nama penerbit di URLconf, tetapi apa jika kami ingin menulis sebuah tampilan yang menampilkan semua buku oleh beberapa penerbit berubah-ubah?

source: Handily, the ``ListView`` has a :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` method we can override. Previously, it has just been returning the value of the ``queryset`` attribute, but now we can add more logic.
id: Dengan mudah, ``ListView`` mempunyai sebuah metode :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` kami dapat timpa. Sebelumnya, itu telah mengembalikan nilai dari atribut ``queryset``, tetapi sekarang kami dapat menambah lebih logika.

source: The key part to making this work is that when class-based views are called, various useful things are stored on ``self``; as well as the request (``self.request``) this includes the positional (``self.args``) and name-based (``self.kwargs``) arguments captured according to the URLconf.
id: Bagian kunci membiat ini bekerja adalah bahwa ketika tampilan berdasarkan-kelas dipanggil, beragam hal-hal berguna disimpan di ``self``; sama halnya permintaan (``self.request``) ini menyertakan penempatan (``self.args``) dan argumen (``self.kwargs``) berdasarkan-nama menurut URLconf.

source: Here, we have a URLconf with a single captured group::
id: Disini, kami mempunyai URLconf dengan kelompok ditangkap tunggal::

source: Next, we'll write the ``PublisherBookList`` view itself::
id: Selanjutnya, kami akan menulis tampilan ``PublisherBookList`` sendiri::

source: As you can see, it's quite easy to add more logic to the queryset selection; if we wanted, we could use ``self.request.user`` to filter using the current user, or other more complex logic.
id: Seperti anda dapat lihat, itu adalah sangat mudah menambah logika lebih pada pemilihan queryset; jika kami ingin, kami dapat menggunakan ``self.request.user`` pada penyaring menggunakan pengguna saat ini, atau lebih logika rumit lain.

source: We can also add the publisher into the context at the same time, so we can use it in the template::
id: Kami dapat juga menambahkan penerbit kedalam konteks pada waktu bersamaan, jadi kami dapat menggunakannya di cetakan::

source: Performing extra work
id: Melakukan pekerjaan tambahan

source: The last common pattern we'll look at involves doing some extra work before or after calling the generic view.
id: Pola umum terakhir kami akan lihat pada melibatkan melakukan beberapa pekerjaan tambahan sebelum atau sesudah memanggil tampilan umum.

source: Imagine we had a ``last_accessed`` field on our ``Author`` model that we were using to keep track of the last time anybody looked at that author::
id: Bayangkan kami mempunyai sebuah bidang `last_accessed`` di model `Author`` kami yang kami sedang gunakanuntuk menjaga lintas dari waktu terakhir siapapun mencari penulis itu::

source: The generic ``DetailView`` class, of course, wouldn't know anything about this field, but once again we could easily write a custom view to keep that field updated.
id: Kelas ``DetailView`` umum, tentu saja, kami tidak akan mengetahui apapun tentang bidang ini, tetapi sekali lagi kami dapat dengan menudah menulis tampilan penyesuaian untuk menjaga bidang itu terperbaharui.

source: First, we'd need to add an author detail bit in the URLconf to point to a custom view::
id: Pertama, kami butuh menambah rincian seorang penulis sedikit dalam URLconf untuk menunjuk pada tampilan penyesuaian::

source: Then we'd write our new view -- ``get_object`` is the method that retrieves the object -- so we simply override it and wrap the call::
id: Kemudian kami akan menulis tampilan baru kami -- ``get_object`` adalah metode yang mengambil obyek -- jadi kami cukup menimpanya dan membungkus panggilan::

source: The URLconf here uses the named group ``pk`` - this name is the default name that ``DetailView`` uses to find the value of the primary key used to filter the queryset.
id: URLconf disini menggunakan kelompok bernama ``pk`` - nama ini adalah nama awalan yang ``DetailView`` menggunakan untuk menemukan nilai dari primary key digunakan untuk menyaring queryset.

source: If you want to call the group something else, you can set ``pk_url_kwarg`` on the view. More details can be found in the reference for :class:`~django.views.generic.detail.DetailView`
id: Jika anda ingin memanggil kelompok sesuatu lain, anda dapat menyetel ``pk_url_kwarg`` pada tampilan. Rincian lebih dapat ditemukan di acuan untuk :class:`~django.views.generic.detail.DetailView`

source: Form handling with class-based views
id: Menangani formulir dengan tampilan berdasarkan-kelas

source: Form processing generally has 3 paths:
id: Pengolahan formulir umumnya mempunyai 3 jalur:

source: Initial GET (blank or prepopulated form)
id: Inisial GET (kosong atau formulir diisi dimuka)

source: POST with invalid data (typically redisplay form with errors)
id: POST dengan data tidak sah (khususnya memperlihatkan kembali formulir dengan kesalahan)

source: POST with valid data (process the data and typically redirect)
id: POST dengan data sah (pengolahan data dan khususnya pengalihan)

source: Implementing this yourself often results in a lot of repeated boilerplate code (see :ref:`Using a form in a view<using-a-form-in-a-view>`). To help avoid this, Django provides a collection of generic class-based views for form processing.
id: Menerapkan ini anda sendiri sering menghasilkan banyak perulangan kode boilerplate (lihat :ref:`Using a form in a view<using-a-form-in-a-view>`). Untuk menghindai ini, Django menyediakan kumpulan dari tampilan berdasarkan-kelas umum untuk pengolahan formulir.

source: Basic forms
id: Formulir dasar

source: Given a simple contact form:
id: Diberikan formulir kontak sederhana:

source: The view can be constructed using a ``FormView``:
id: Tampilan dapat dibangun menggunakan ``FormView``:

source: Notes:
id: Catatan:

source: FormView inherits :class:`~django.views.generic.base.TemplateResponseMixin` so :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` can be used here.
id: FormView mewarisi :class:`~django.views.generic.base.TemplateResponseMixin` jadi :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` dapat digunakan disini.

source: The default implementation for :meth:`~django.views.generic.edit.FormMixin.form_valid` simply redirects to the :attr:`~django.views.generic.edit.FormMixin.success_url`.
id: Penerapan awalan untuk :meth:`~django.views.generic.edit.FormMixin.form_valid` cukup mengalihkan ke :attr:`~django.views.generic.edit.FormMixin.success_url`.

source: Model forms
id: Formulir model

source: Generic views really shine when working with models. These generic views will automatically create a :class:`~django.forms.ModelForm`, so long as they can work out which model class to use:
id: Tampilan umum bersinar ketika bekerja dengan model. Tampilan umum ini akan secara otomatis membuat sebuah :class:`~django.forms.ModelForm`, selama mereka dapat bekerya kelas model mana digunakan:

source: If the :attr:`~django.views.generic.edit.ModelFormMixin.model` attribute is given, that model class will be used.
id: Jika atribut :attr:`~django.views.generic.edit.ModelFormMixin.model` diberikan, kelas model itu akan digunakan.

source: If :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` returns an object, the class of that object will be used.
id: Jika :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()` mengembalikan sebuah obyek, kelas dari obyek akan digunakan.

source: If a :attr:`~django.views.generic.detail.SingleObjectMixin.queryset` is given, the model for that queryset will be used.
id: Jika sebuah :attr:`~django.views.generic.detail.SingleObjectMixin.queryset` diberikan, model untuk queryset itu akan digunakan.

source: Model form views provide a :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` implementation that saves the model automatically. You can override this if you have any special requirements; see below for examples.
id: Tampilan formulir model menyediakan sebuah penerapan :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` yang menyimpan model secara otomatis. Anda dapat menimpa ini jika anda mempunyai persyaratan khusus lainnya; lihat dibawah untuk contoh.

source: You don't even need to provide a ``success_url`` for :class:`~django.views.generic.edit.CreateView` or :class:`~django.views.generic.edit.UpdateView` - they will use :meth:`~django.db.models.Model.get_absolute_url()` on the model object if available.
id: Anda tidak perlu menyediakan sebuah ``success_url`` untuk :class:`~django.views.generic.edit.CreateView` atau :class:`~django.views.generic.edit.UpdateView` - mereka akan menggunakan :meth:`~django.db.models.Model.get_absolute_url()` pada obyek model jika tersedia.

source: If you want to use a custom :class:`~django.forms.ModelForm` (for instance to add extra validation) simply set :attr:`~django.views.generic.edit.FormMixin.form_class` on your view.
id: Jika anda ingin menggunakan penyesuaian :class:`~django.forms.ModelForm` (sebagai contoh untuk menambah pengesahan tambahan) cukup setel :attr:`~django.views.generic.edit.FormMixin.form_class` pada tampilan anda.

source: When specifying a custom form class, you must still specify the model, even though the :attr:`~django.views.generic.edit.FormMixin.form_class` may be a :class:`~django.forms.ModelForm`.
id: Ketika menentukan sebuah penyesuaian kelas formulir, anda harus masih menentukan model, meskipun :attr:`~django.views.generic.edit.FormMixin.form_class` mungkin berupa sebuah :class:`~django.forms.ModelForm`.

source: First we need to add :meth:`~django.db.models.Model.get_absolute_url()` to our ``Author`` class:
id: Pertama kami butuh menambahkan :meth:`~django.db.models.Model.get_absolute_url()` ke kelas ``Author`` kami:

source: Then we can use :class:`CreateView` and friends to do the actual work. Notice how we're just configuring the generic class-based views here; we don't have to write any logic ourselves:
id: Kemudian kami dapat menggunakan :class:`CreateView` dan teman-teman untuk melakukan pekerjaan sebenarnya. Perhatikan bagaimana kami hanya mengkonfigurasi tampilan berdasarkan-kelas umum disini; kami tidak harus menulis logika apapun kami sendiri:

source: We have to use :func:`~django.urls.reverse_lazy` here, not just ``reverse()`` as the urls are not loaded when the file is imported.
id: Kami harus menggunakan :func:`~django.urls.reverse_lazy` disini, tidak hanya ``reverse()`` sebagai url tidak dimuat ketika berkas diimpor.

source: The ``fields`` attribute works the same way as the ``fields`` attribute on the inner ``Meta`` class on :class:`~django.forms.ModelForm`. Unless you define the form class in another way, the attribute is required and the view will raise an :exc:`~django.core.exceptions.ImproperlyConfigured` exception if it's not.
id: Atribut ``fields`` bekerja cara sama seperti atribut ``fields`` pada kelas ``Meta`` sebelah dalam pada :class:`~django.forms.ModelForm`. Meskipun anda menentukan kelas formulir di cara lain, atribut dibutuhkan dan tampilan akan munculkan sebuah pengecualian :exc:`~django.core.exceptions.ImproperlyConfigured` jika itu tidak.

source: If you specify both the :attr:`~django.views.generic.edit.ModelFormMixin.fields` and :attr:`~django.views.generic.edit.FormMixin.form_class` attributes, an :exc:`~django.core.exceptions.ImproperlyConfigured` exception will be raised.
id: Jika anda menentukan kedua atribut :attr:`~django.views.generic.edit.ModelFormMixin.fields` dan :attr:`~django.views.generic.edit.FormMixin.form_class`, sebuah pengecualian :exc:`~django.core.exceptions.ImproperlyConfigured` akan dimunculkan.

source: Finally, we hook these new views into the URLconf:
id: Akhirnya, kami mengaitkan tampilan baru ini kedalam URLconf:

source: These views inherit :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` which uses :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` to construct the :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` based on the model.
id: Tampilan ini mewarisi class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` yang menggunakan :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` untuk membangun :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` berdasarkan pada model.

source: In this example:
id: Di contoh ini:

source: :class:`CreateView` and :class:`UpdateView` use ``myapp/author_form.html``
id: :class:`CreateView` dan :class:`UpdateView` menggunakan ``myapp/author_form.html``

source: :class:`DeleteView` uses ``myapp/author_confirm_delete.html``
id: :class:`DeleteView` menggunakan ``myapp/author_confirm_delete.html``

source: If you wish to have separate templates for :class:`CreateView` and :class:`UpdateView`, you can set either :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` or :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` on your view class.
id: Jika anda berharap untuk mempunyai cetakan terpisah untuk :class:`CreateView` dan :class:`UpdateView`, anda dapat menyetel antara :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` atau :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` pada kelas tampilan anda.

source: Models and ``request.user``
id: Models dan ``request.user``

source: To track the user that created an object using a :class:`CreateView`, you can use a custom :class:`~django.forms.ModelForm` to do this. First, add the foreign key relation to the model:
id: Untuk melacak pengguna yang membuat sebuah obyek menggunakan sebuah :class:`CreateView`, anda dapat menggunakan sebuah penyesuaian :class:`~django.forms.ModelForm` untuk melakukan ini. Pertama, tambah hubungan foreign key pada model:

source: In the view, ensure that you don't include ``created_by`` in the list of fields to edit, and override :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` to add the user:
id: Di tampilan, pastikan bahwa anda tidak menyertakan ``created_by`` di daftar dari bidang untuk menyunting, dan menimpa :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()` untuk menambah pengguna:

source: Note that you'll need to :ref:`decorate this view<decorating-class-based-views>` using :func:`~django.contrib.auth.decorators.login_required`, or alternatively handle unauthorized users in the :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()`.
id: Catata bahwa anda akan butuh :ref:`decorate this view<decorating-class-based-views>` menggunakan :func:`~django.contrib.auth.decorators.login_required`, atau cara lain menangani pengguna tidak berhak di :meth:`~django.views.generic.edit.ModelFormMixin.form_valid()`.

source: AJAX example
id: Contoh AJAX

source: Here is a simple example showing how you might go about implementing a form that works for AJAX requests as well as 'normal' form POSTs::
id: Ini adalah contoh sederhana menunjukkan bagaimana anda mungkin pergi tentang menerapkan sebuah formulir yang bekerja untuk permintaan AJAX sama seperti formulir POST 'normal'::

source: Class-based views
id: Tampilan berdasarkan-kelas

source: A view is a callable which takes a request and returns a response. This can be more than just a function, and Django provides an example of some classes which can be used as views. These allow you to structure your views and reuse code by harnessing inheritance and mixins. There are also some generic views for simple tasks which we'll get to later, but you may want to design your own structure of reusable views which suits your use case. For full details, see the :doc:`class-based views reference documentation</ref/class-based-views/index>`.
id: Sebuah tampilan callable yang mengambil sebuah permintaan dan mengembalikan sebuah tanggapan. Ini dapat lebih dari sekedar fungsi, dan Django menyediakan sebuah contoh dari beberapa kelas yang dapat digunakan sebagai tampilan. Ini mengizinkan anda untuk membentuk tampilan anda dan menggunakan kembali kode dengan memanfaatkan warisan dan mixin. Ada juga beberapa tampilan umum untuk tugas sederhana yang akan bisa kemudian, tetpai anda mungkin ingin merancang bentuk anda sendiri dari tampilan digunakan kembali yang cocok dengan kasus anda. Untuk rincian penuh, lihat :doc:`class-based views reference documentation</ref/class-based-views/index>`.

source: Basic examples
id: Contoh dasar

source: Django provides base view classes which will suit a wide range of applications. All views inherit from the :class:`~django.views.generic.base.View` class, which handles linking the view in to the URLs, HTTP method dispatching and other simple features. :class:`~django.views.generic.base.RedirectView` is for a simple HTTP redirect, and :class:`~django.views.generic.base.TemplateView` extends the base class to make it also render a template.
id: Django menyediakan kelas-kelas tampilan dasar yang akan cocok jangkauan lebar dari aplikasi. Semua tampilan warisan dari kelas :class:`~django.views.generic.base.View`, yang menangani penautan tampilan kedalam URL, mengirimkan metode HTTP dan fitur-fitur sederhana lainnya. :class:`~django.views.generic.base.RedirectView` adalah untuk pengalihan HTTP sederhana, dan :class:`~django.views.generic.base.TemplateView` memperpanjang kelas dasar untuk membuat itu juga membangun sebuah cetakan.

source: Simple usage in your URLconf
id: Penggunaan sederhana di URLconf anda

source: The simplest way to use generic views is to create them directly in your URLconf. If you're only changing a few simple attributes on a class-based view, you can simply pass them into the :meth:`~django.views.generic.base.View.as_view` method call itself::
id: Cara termudah menggunakan tampilan umum adalah membuat mereka langsung di URLconf anda. Jika anda hanya merubah sedikit atribut sederhana pada sebuah tampilan berdasarkan-kelas, anda dapat cukup melewatkan mereka kedalam pemanggilan metode :meth:`~django.views.generic.base.View.as_view` itu sendiri::

source: Any arguments passed to :meth:`~django.views.generic.base.View.as_view` will override attributes set on the class. In this example, we set ``template_name`` on the ``TemplateView``. A similar overriding pattern can be used for the ``url`` attribute on :class:`~django.views.generic.base.RedirectView`.
id: Apapun argumen dilewatkan ke :meth:`~django.views.generic.base.View.as_view` akan menimpa atribut disetel pada kelas. Dalam contoh ini, kami menyetel `template_name`` pada ``TemplateView``. Pola penibanan mirip dapat digunakan untuk atribut ``url`` pada :class:`~django.views.generic.base.RedirectView`.

source: Subclassing generic views
id: Mensubkelaskan tampilan umum

source: The second, more powerful way to use generic views is to inherit from an existing view and override attributes (such as the ``template_name``) or methods (such as ``get_context_data``) in your subclass to provide new values or methods. Consider, for example, a view that just displays one template, ``about.html``. Django has a generic view to do this - :class:`~django.views.generic.base.TemplateView` - so we can just subclass it, and override the template name::
id: Kedua, cara lebih kuat menggunakan tampilan umum adalah mewarisi dari tampilan yang sudah ada dan menimpa atribut (seperti ``template_name``) atau metode (seperti ``get_context_data``) di subeklas anda untuk menyediakan nilai atau metode baru. Pertimbangkan, sebagai contoh, sebuah tampilan yang hanya memperlihatkan satu cetakan, ``about.html``. Django mempunyai tampilan umum untuk melakukan ini - :class:`~django.views.generic.base.TemplateView` - jadi kami dapat hanya mensubkelaskan itu, dan menimpa nama cetakan::
