Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The ``Vary`` header defines which request headers a cache mechanism should take into account when building its cache key.
id: Kepala ``Vary`` menentukan kepala permintaan mana sebuah mekanisme cache harus diperhitungkan ketika membangun kunci cachenya.

source: See :ref:`using vary headers <using-vary-headers>`.
id: Lihat :ref:`menggunaan beragam kepala <using-vary-headers>`.

source: Caching
id: Menembolok

source: The decorators in :mod:`django.views.decorators.cache` control server and client-side caching.
id: Penghias dalam :mod:`django.views.decorators.cache`mengendalikan cache peladen dan sisi-klien.

source: File Uploads
id: Unggah Berkas

source: Basic file uploads
id: Unggah berkas dasar

source: Here's a common way you might handle an uploaded file::
id: Ini adalah cara umum anda mungkin menangani sebuah berkas terunggah::

source: Handling uploaded files with a model
id: Penanganan berkas terunggah dengan model

source: If you're saving a file on a :class:`~django.db.models.Model` with a :class:`~django.db.models.FileField`, using a :class:`~django.forms.ModelForm` makes this process much easier. The file object will be saved to the location specified by the :attr:`~django.db.models.FileField.upload_to` argument of the corresponding :class:`~django.db.models.FileField` when calling ``form.save()``::
id: Jika anda sedang menyimpan sebuah berkas pada :class:`~django.db.models.Model` dengan :class:`~django.db.models.FileField`, menggunakan :class:`~django.forms.ModelForm` memuat pengolahan ini lebih mudah. byek berkas akan disimpan ke tempat ditentukan oleh argumen :attr:`~django.db.models.FileField.upload_to`dari :class:`~django.db.models.FileField` sesuai ketika memanggil ``form.save()``::

source: Upload Handlers
id: Penanganan Unggah

source: Where uploaded data is stored
id: Dimana data terunggah disimpan

source: Before you save uploaded files, the data needs to be stored somewhere.
id: Sebelum anda menyimpan berkas terunggah, data butuh disimpan di suatu tempat.

source: However, if an uploaded file is too large, Django will write the uploaded file to a temporary file stored in your system's temporary directory. On a Unix-like platform this means you can expect Django to generate a file called something like ``/tmp/tmpzfp6I6.upload``. If an upload is large enough, you can watch this file grow in size as Django streams the data onto disk.
id: Bagaimanapun, jika sebuah berkas terunggah terlalu besar, Django akan menulis berkas terunggah ke berkas sementara disimpan di sistem direktori sementara. Pada serambi seperti-Unix ini berarti anda dapat mengharap Django membangkitkan sebuah berkas dipanggil seperti sesuatu ``/tmp/tmpzfp6I6.upload``. Jika sebuah unggahan cukup besar, anda dapat melihat berkas ini tumbuh dalam ukuran seperti Django mengalirkan data ke cakram.

source: Changing upload handler behavior
id: Merubah perilaku penanganan unggah

source: There are a few settings which control Django's file upload behavior. See :ref:`File Upload Settings <file-upload-settings>` for details.
id: Ada sedikit pengaturan yang mengendalikan perilaku unggah berkas Django. Lihat :ref:`File Upload Settings 1` untuk rincian.

source: Modifying upload handlers on the fly
id: Merubah penanganan unggah dengan cepat

source: If you want to replace the upload handlers completely, you can just assign a new list::
id: Jika anda ingin mengganti penanganan unggah secara lengkap, anda dapat cukup memberikan daftar baru::

source: Thus, you should always modify uploading handlers as early in your view as possible.
id: Dengan demikian, anda harus selalu merubah penanganan unggahan sedini mungkin dalam tampilan anda.

source: Also, ``request.POST`` is accessed by :class:`~django.middleware.csrf.CsrfViewMiddleware` which is enabled by default. This means you will need to use :func:`~django.views.decorators.csrf.csrf_exempt` on your view to allow you to change the upload handlers. You will then need to use :func:`~django.views.decorators.csrf.csrf_protect` on the function that actually processes the request. Note that this means that the handlers may start receiving the file upload before the CSRF checks have been done. Example code::
id: Juga, ``request.POST`` diakses oleh :class:`~django.middleware.csrf.CsrfViewMiddleware` yang diadakan secara awalan. Ini berarti anda akan butuh menggunakan :func:`~django.views.decorators.csrf.csrf_exempt` pada tampilan anda untuk mengizinkan anda merubah penangan unggahan. Anda kemudian akan butuh menggunakan :func:`~django.views.decorators.csrf.csrf_protect` pada fungsi yang sebenarnya mengolah permintaan. Catat bahwa ini berarti bahwa penangan mungkin mulai menerima berkas unggahan sebelum CSRF pemeriksaan telah diselesaikan. Kode contoh::

source: Generic views
id: Tampilan umum

source: See :doc:`/ref/class-based-views/index`.
id: Lihat :doc:`/ref/class-based-views/index`.

source: Handling HTTP requests
id: Penanganan permintaan HTTP

source: Information on handling HTTP requests in Django:
id: Informasi pada penanganan permintaan HTTP di Django:

source: Writing your own middleware
id: Menulis middleware anda sendiri

source: A middleware factory is a callable that takes a ``get_response`` callable and returns a middleware. A middleware is a callable that takes a request and returns a response, just like a view.
id: Pabrik middleware adalah sebuah callable yang mengambil callable ``get_response`` dan mengembalikan middleware. Middleware adalah callable yang mengambil permintaan dan mengembalikan tanggapan, seperti tampilan.

source: A middleware can be written as a function that looks like this::
id: Sebuah middleware dapat ditulis sebagai sebuah fungsi yang terlihat seperti ini::

source: Or it can be written as a class whose instances are callable, like this::
id: Atau itu dapat ditulis sebagai sebuah kelas yang instancenya callable, seperti ini::

source: The ``get_response`` callable provided by Django might be the actual view (if this is the last listed middleware) or it might be the next middleware in the chain. The current middleware doesn't need to know or care what exactly it is, just that it represents whatever comes next.
id: Callable ``get_response`` disediakan oleh Django mungkin tampilan sebenarnya (jika ini adalah middleware terdaftar terakhir) atau itu mungkin menjadi middleware selanjutnya di rantai. Middleware sekarang tidak butuh mengetahui atau peduli apa sebenarnya itu, cukup bahwa itu mewakili apapun datang selanjutnya.

source: The above is a slight simplification -- the ``get_response`` callable for the last middleware in the chain won't be the actual view but rather a wrapper method from the handler which takes care of applying :ref:`view middleware <view-middleware>`, calling the view with appropriate URL arguments, and applying :ref:`template-response <template-response-middleware>` and :ref:`exception <exception-middleware>` middleware.
id: Diatas adalah sedikit penyerdahanaan -- callable ``get_response``utnuk middleware akhir dalam rantai tidak akan berupa tampilan sebenarnya tetapi daripada sebuah metode pembungkus dari penangan yang menangani dari memberlakukan :ref:`view middleware 1`, memanggil tampilan dengan argumen-argumen URL sesuai, dan memberlakukan middleware :ref:`template-response 2` dan :ref:`exception 3`.

source: Middleware can live anywhere on your Python path.
id: Middleware dapat tinggal dimanapun pada jalur Python anda.

source: Marking middleware as unused
id: Menandai middleware sebagai tidak digunakan

source: Activating middleware
id: Mengaktivasi middleware

source: To activate a middleware component, add it to the :setting:`MIDDLEWARE` list in your Django settings.
id: Untuk mengaktifkan komponen middleware, tambah itu ke list :setting:`MIDDLEWARE` dalam pengaturan Django anda.

source: ``process_view()`` is called just before Django calls the view.
id: ``process_view()`` dipanggil sebelum Django memanggil tampilan.

source: Dealing with streaming responses
id: Berurusan dengan aliran tanggapan

source: This conversion takes place before and after each middleware (you can think of it as the thin film in between each layer of the onion), so that every middleware can always rely on getting some kind of HTTP response back from calling its ``get_response`` callable. Middleware don't need to worry about wrapping their call to ``get_response`` in a ``try/except`` and handling an exception that might have been raised by a later middleware or the view. Even if the very next middleware in the chain raises an :class:`~django.http.Http404` exception, for example, your middleware won't see that exception; instead it will get an :class:`~django.http.HttpResponse` object with a :attr:`~django.http.HttpResponse.status_code` of 404.
id: Perubahan ini mengambil tempat sebelum dan setelah setiap middleware (anda dapat berpikir itu seperti film tipis dalam diantara setiap lapisan dari onion), sehingga setiap middleware dapat selalu bergantung pada mendapatkan sejenis tanggapan HTTP dari memanggil callable ``get_response`` nya. Middleware tidak butuh khawatir tentang membungkus panggilan mereka pada ``get_response`` dalam sebuah ``try/except`` dan menangani sebuah pengecualian yang mungkin dimunculkan ole middleware akhir atau tampilan. Bahkan jika middleware berikutnya dalam rantai memunculkan sebuah pengecualian :class:`~django.http.Http404`, sebagai contoh, middleware anda tidak melihat pengecualian itu; bahkan itu akan mendapatkan sebuah obyek :class:`~django.http.HttpResponse` dengan sebuah :attr:`~django.http.HttpResponse.status_code`dari 404.

source: The ``__call__()`` method:
id: Metode ``__call__()``:

source: Calls ``self.process_request(request)`` (if defined).
id: Memanggil ``self.process_request(request)`` (jika ditentukan).

source: Calls ``self.process_response(request, response)`` (if defined).
id: Memanggil ``self.process_response(request, response)`` (jika ditentukan).

source: Returns the response.
id: Mengembalikan tanggapan

source: How to use sessions
id: Bagaimana menggunakan sesi

source: Enabling sessions
id: Mengadakan sesi

source: Sessions are implemented via a piece of :doc:`middleware </ref/middleware>`.
id: Sesi diterapkan melalui potongan :doc:`middleware 1`.

source: To enable session functionality, do the following:
id: Untuk mengadakan fungsi sesi, lakukan berikut:

source: If you don't want to use sessions, you might as well remove the ``SessionMiddleware`` line from :setting:`MIDDLEWARE` and ``'django.contrib.sessions'`` from your :setting:`INSTALLED_APPS`. It'll save you a small bit of overhead.
id: Jika anda tidak ingin menggunakan sesi, anda mungkin akan memindahkan baris ``SessionMiddleware`` dari :setting:`MIDDLEWARE` dan ``'django.contrib.sessions'`` dari :setting:`INSTALLED_APPS` anda. Itu akan menyimpan anda sedikit diatas.

source: Configuring the session engine
id: Konfigurasi mesin sesi

source: Using database-backed sessions
id: Menggunakan sesi didukung-basisdata

source: Using cached sessions
id: Menggunakan sesi tembolok

source: If you have multiple caches defined in :setting:`CACHES`, Django will use the default cache. To use another cache, set :setting:`SESSION_CACHE_ALIAS` to the name of that cache.
id: Jika anda mempunyai banyak tembolok ditentukan di :setting:`CACHES`,Django akan menggunakan tembolok awalan. Untuk menggunakan tembolok lain, setel :setting:`SESSION_CACHE_ALIAS` ke nama dari tembolok tersebut.

source: Once your cache is configured, you've got two choices for how to store data in the cache:
id: Sekali tembolok anda dikonfigurasi, anda telah mendapatkan dua pilihan untuk bagaimana menyimpan data dalam tembolok:

source: Using cookie-based sessions
id: Menggunakan sesi berdasarkan-kue

source: It's recommended to leave the :setting:`SESSION_COOKIE_HTTPONLY` setting on ``True`` to prevent access to the stored data from JavaScript.
id: Sangat dianjurkan meninggalkan pengaturan :setting:`SESSION_COOKIE_HTTPONLY` pada ``True`` untuk mencegah akses ke data tersimpan dari JavaScript.

source: **The session data is signed but not encrypted**
id: **Data sesi ditandatangi tetapi tidak disandikan**

source: **No freshness guarantee**
id: **Tidak ada jaminan kesegaran**

source: **Performance**
id: **Penampilan**

source: Finally, the size of a cookie can have an impact on the `speed of your site`_.
id: Akhirnya, ukuran kue dapat berdampak pada `kecepatan situs anda`_.

source: Using sessions in views
id: Menggunakan sesi dalam tampilan

source: Example: ``fav_color = request.session['fav_color']``
id: Contoh: ``fav_color = request.session['fav_color']``

source: Example: ``request.session['fav_color'] = 'blue'``
id: Contoh: ``request.session['fav_color'] = 'blue'``

source: Example: ``'fav_color' in request.session``
id: Contoh: ``'fav_color' dalam request.session``

source: Example: ``fav_color = request.session.get('fav_color', 'red')``
id: Contoh: ``fav_color = request.session.get('fav_color', 'red')``

source: Example: ``fav_color = request.session.pop('fav_color', 'blue')``
id: Contoh: ``fav_color = request.session.pop('fav_color', 'blue')``

source: It also has these methods:
id: Dia juga mempunyai cara ini:

source: Deletes the test cookie. Use this to clean up after yourself.
id: Menghapus kue percobaan. Gunakan ini untuk membersihkan diri anda sendiri.

source: Sets the expiration time for the session. You can pass a number of different values:
id: Setel waktu kadaluarsa untuk sesi. Anda dapat melewatkan sejumlah nilai berbeda:

source: This function accepts two optional keyword arguments:
id: Fungsi ini menerima dua pilihan argumen katakunci:

source: This function accepts the same keyword arguments as :meth:`get_expiry_age`.
id: Fungsi ini menerima argumen kata kunci sama seperti :meth:`get_expiry_age`.

source: Removes expired sessions from the session store. This class method is called by :djadmin:`clearsessions`.
id: Memindahkan sesi kadaluarsa dari penyimpanan sesi. Metode kelas ini dipanggil oleh :djadmin:`clearsessions`.

source: Session serialization
id: Serialisasi sesi

source: Write your own serializer
id: Tulis serialisasi anda sendiri

source: Session object guidelines
id: Panduan obyek sesi

source: Session dictionary keys that begin with an underscore are reserved for internal use by Django.
id: Kunci dictionary sesi yang dimulai dengan garis bawah adalah dipesan untuk penggunaan dalam oleh Django.

source: Don't override ``request.session`` with a new object, and don't access or set its attributes. Use it like a Python dictionary.
id: Jangan menimpa ``request.session`` dengan obyek baru, dan jangan mengakses atau menyetel atributnya. Gunakan itu seperti dictionary Python.

source: This simplistic view sets a ``has_commented`` variable to ``True`` after a user posts a comment. It doesn't let a user post a comment more than once::
id: Tampilan sederhana ini menyetel sebuah variabel ``has_commented`` menjadi ``True`` setelah pengguna menempatkan sebuah komentar. Itu tidak membuat pengguna menempatkan komentar lebih dari satu::

source: ...And this one logs a member out, according to ``login()`` above::
id: ...Dan satu ini mencatat anggota keluar, menurut pada ``login()`` diatas::

source: Setting test cookies
id: Mengatur kue percobaan

source: Here's a typical usage example::
id: Ini adalah contoh penggunaan khas::

source: An API is available to manipulate session data outside of a view::
id: Sebuah API tersedia untuk merubah data sesi diluar tampilan::

source: When sessions are saved
id: Ketika sesi disimpan

source: The session is not saved if the response's status code is 500.
id: Sesi tidak disimpan jika kode keadaan tanggapan adalah 500.

source: Clearing the session store
id: Membersihkan toko sesi

source: Settings
id: Pengaturan

source: A few :ref:`Django settings <settings-sessions>` give you control over session behavior:
id: Sedikit :ref:`Django settings 1` memberikan anda mengendalikan terhadap perilaku sesi:

source: Session security
id: Keamanan sesi

source: Technical details
id: Rincian teknik

source: Session data is stored in a database table named ``django_session`` .
id: Data sesi disimpan dalam tabel basisdata bernama ``django_session`` .

source: Django only sends a cookie if it needs to. If you don't set any session data, it won't send a session cookie.
id: Django hanya mengirim kue jika itu dibutuhkan. Jika anda tidak menyetel data sesi, itu tidak akan mengirim kue sesi.

source: The ``SessionStore`` object
id: Obyek ``SessionStore``

source: When working with sessions internally, Django uses a session store object from the corresponding session engine. By convention, the session store object class is named ``SessionStore`` and is located in the module designated by :setting:`SESSION_ENGINE`.
id: Ketika bekerja dengan sesi di dalam, Django menggunakan sebuah sesi menyimpan obyek dari mesin sesi sesuai. Secara kebiasaan, sesi menyimpan kelas obyek dinamai ``SessionStore`` dan ditempatkan dalam model dirancang oleh :setting:`SESSION_ENGINE`.

source: Extending database-backed session engines
id: Memperpanjang mesin sesi didukung-basisdata

source: A string containing an encoded and serialized session dictionary.
id: String mengandung sebyag dictionary sesi disandikan dan diserialisasikan.

source: A datetime designating when the session expires.
id: Menunjuk datetime ketika sesi kadaluarsa.

source: Expired sessions are not available to a user, however, they may still be stored in the database until the :djadmin:`clearsessions` management command is run.
id: Sesi kadaluarsa tidak tersedia ke seorang pengguna, bagaimanapun, mereka masih disimpan dalam basisdata sampai perintah pengelolaan :djadmin:`clearsessions` berjalan.

source: Returns a session store class to be used with this session model.
id: Mengembalikan kelas penyimpanan sesi untuk digunakan dengan model sesi ini.

source: Returns decoded session data.
id: Mengembalikan data sesi diterjemahkan.

source: Decoding is performed by the session store class.
id: Penterjemahan dilakukan oleh kelas penyimpanan sesi.

source: You can also customize the model manager by subclassing :class:`~django.contrib.sessions.base_session.BaseSessionManager`:
id: Anda dapat juga menyesuaikan pengelola model dengan mensubkelaskan :class:`~django.contrib.sessions.base_session.BaseSessionManager`:

source: Returns the given session dictionary serialized and encoded as a string.
id: Mengembalikan dictionary sesi diberikan terserialisasi dan disandikan sebagai sebuah string.

source: Encoding is performed by the session store class tied to a model class.
id: Penyandian dialkukan oleh kelas penyimpanan sesi diikat ke kelas model.

source: Implements database-backed session store.
id: Menerapkan penyimpanan sesi backend-basisdata.

source: Override this method to return a custom session model if you need one.
id: Kesampingkan metode ini untuk mengembalikan sebuah penyesuaian model sesi jika anda butuh satu.

source: Returns a new instance of the session model object, which represents the current session state.
id: Mengembalikan sebuah instance baru dari obyek model sesi, yang mewakili keadaan sesi saat ini.

source: Overriding this method provides the ability to modify session model data before it's saved to database.
id: Kesampingkan metode ini menyediakan kemampuan merubah data model sesi sebelum itu disimpan ke basisdata.

source: A prefix added to a session key to build a cache key string.
id: Sebuah awalan ditambahkan ke kunci sesi untuk membangun string kunci cache.

source: Example
id: Contoh

source: If you are migrating from the Django's built-in ``cached_db`` session store to a custom one based on ``cached_db``, you should override the cache key prefix in order to prevent a namespace clash::
id: Jika anda sedang berpindah dari sesi ``cached_db`` siap-pakai Django ke satu penyesuaian berdasarkan pada ``cached_db``, anda harus menimpa awalan kunci cache untuk mencegah bentrokan namespace::

source: Session IDs in URLs
id: ID Sesi dalam URL

source: Django shortcut functions
id: Fungsi jalan pintas Django

source: Required arguments
id: Argumen dibutuhkan

source: Optional arguments
id: Argumen pilihan

source: A dictionary of values to add to the template context. By default, this is an empty dictionary. If a value in the dictionary is callable, the view will call it just before rendering the template.
id: Nilai kamus untuk ditambah ke konteks cetakan. Secara awalan, ini adalah kamus kosong. Jika nilai di kamus adalah callable, tampilan akan memanggilnya sesaat sebelum membangun cetakan.

source: This example is equivalent to::
id: Contoh ini setara pada::

source: The arguments could be:
id: Argumen dapat menjadi:

source: This also works with full URLs::
id: Ini juga bekerja dengan URL penuh::

source: You can also use :class:`related managers<django.db.models.fields.related.RelatedManager>`::
id: Anda dapat juga menggunakan :class:`related managers<django.db.models.fields.related.RelatedManager>`::

source: URL dispatcher
id: Pengirim URL

source: How Django processes a request
id: Bagaimana Django mengolah permintaan

source: Django runs through each URL pattern, in order, and stops at the first one that matches the requested URL.
id: Django berjalan melalui setiap corak URL, berurutan, dan berhenti pada satu yang pertama yang cocok dengan URL diminta.

source: An instance of :class:`~django.http.HttpRequest`.
id: Sebuah instance dari :class:`~django.http.HttpRequest`.

source: Here's a sample URLconf::
id: Ini adalah contoh URLconf::

source: To capture a value from the URL, use angle brackets.
id: Untuk menangkap nilai dari URL, gunakan kurung sudut.

source: Example requests:
id: Contoh permintaan:

source: A ``regex`` class attribute, as a string.
id: Atribut kelas ``regex``, sebagai string.

source: Nested arguments
id: Penjelasan bersarang

source: Performance
id: Penampilan

source: Syntax of the ``urlpatterns`` variable
id: Sintaksis dari variabel ``urlpatterns``

source: Error handling
id: Penanganan kesalahan

source: See the documentation on :ref:`customizing error views <customizing-error-views>` for the full details.
id: Lihat dokumentasi pada :ref:`customizing error views 1` untuk rincian penuh.

source: Such values can be set in your root URLconf. Setting these variables in any other URLconf will have no effect.
id: Nilai-nilai itu dapat disetel dalam URLconf akar anda. Pengaturan variabel-variabel ini dalam URLconf lain apapun tidak mempunyai pengaruh.

source: Values must be callables, or strings representing the full Python import path to the view that should be called to handle the error condition at hand.
id: Nilai-nilai harus callable, atau deretan karakter mewakili jalur impor Pythn penuh pada tampilan yang harus dipanggil untuk menangani kondisi kesalahan di tangan.

source: The variables are:
id: Variabel nya adalah:

source: ``handler400`` -- See :data:`django.conf.urls.handler400`.
id: ``handler400`` -- Lihat :data:`django.conf.urls.handler400`.

source: ``handler403`` -- See :data:`django.conf.urls.handler403`.
id: ``handler403`` -- Lihat :data:`django.conf.urls.handler403`.

source: ``handler404`` -- See :data:`django.conf.urls.handler404`.
id: ``handler404`` -- Lihat :data:`django.conf.urls.handler404`.

source: ``handler500`` -- See :data:`django.conf.urls.handler500`.
id: ``handler500`` -- Lihat :data:`django.conf.urls.handler500`.

source: Including other URLconfs
id: Menyertakan URLconf lain

source: We can improve this by stating the common path prefix only once and grouping the suffixes that differ::
id: Kami dapat meningkatkan dengan menyatakan awalan jalur umum hanya sekali dan mengelompokkan akhiran yang beda::

source: Captured parameters
id: Parameter tertangkap

source: Passing extra options to view functions
id: Melewatkan pilihan tambahan untuk melihat fungsi
