Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Django chooses the algorithm to use by consulting the :setting:`PASSWORD_HASHERS` setting. This is a list of hashing algorithm classes that this Django installation supports. The first entry in this list (that is, ``settings.PASSWORD_HASHERS[0]``) will be used to store passwords, and all the other entries are valid hashers that can be used to check existing passwords. This means that if you want to use a different algorithm, you'll need to modify :setting:`PASSWORD_HASHERS` to list your preferred algorithm first in the list.
id: Django memilih algoritma untuk digunakan dengan berkonsultasi pengaturan :setting:`PASSWORD_HASHERS`. Ini adalah daftar dari campuran kelas-kelas algoritma yang mendukung pemasangan Django ini. Masukan pertama di daftar (yaitu, ``settings.PASSWORD_HASHERS[0]``) akan digunakan menyimpan sandi, dan semua masukan lain adalah pencampur sah yang dapat digunakan memeriksa sandi yang ada. Ini berarti bahwa anda ingin menggunakan algoritma berbeda, anda akan butuh merubah :setting:`PASSWORD_HASHERS` ke daftar anda pertama algoritma dipilih di daftar.

source: The default for :setting:`PASSWORD_HASHERS` is::
id: Nilai awal untuk :setting:`PASSWORD_HASHERS` adalah::

source: This means that Django will use PBKDF2_ to store all passwords but will support checking passwords stored with PBKDF2SHA1, argon2_, and bcrypt_.
id: Ini berarti bahwa Django akan menggunakan PBKDF2_ menyimpan semua sandi tetapi akan mendukung pemeriksaan sandi disimpan dengan PBKDF2SHA1, argon2_, dan bcrypt_.

source: The next few sections describe a couple of common ways advanced users may want to modify this setting.
id: Sedikit bagian selanjutnya menggambarkan sepasang cara umum pengguna tingkat lanjut mungkin ingin merubah pengaturan ini.

source: Using Argon2 with Django
id: Menggunakan Argon2 dengan Django

source: Argon2_ is the winner of the 2015 `Password Hashing Competition`_, a community organized open competition to select a next generation hashing algorithm. It's designed not to be easier to compute on custom hardware than it is to compute on an ordinary CPU.
id: Argon2_ adalah pemenang dari `Password Hashing Competition`_ 2015, sebuah komunitas mengorganisasikan pertandingan terbuka untuk memilih algoritma campuran generasi selanjutnya. Itu dirancang tidak mudah dihitung pada perangkat keras penyesuaian daripada itu dihitung pada CPU biasa.

source: Argon2_ is not the default for Django because it requires a third-party library. The Password Hashing Competition panel, however, recommends immediate use of Argon2 rather than the other algorithms supported by Django.
id: Argon2_ bukan awalan untuk Django karena itu membutuhkan pustaka pihak-ketiga. Juri Password Hashing Competition, bagaimanapun, menganjurkan penggunaan segera dari Argon2 daripada algoritma lain didukung oleh Django.

source: To use Argon2 as your default storage algorithm, do the following:
id: Untuk menggunakan Argon2 sebagai algoritma penyimpanan awalan anda, lakukan berikut:

source: Install the `argon2-cffi library`_. This can be done by running ``pip install django[argon2]``, which is equivalent to ``pip install argon2-cffi`` (along with any version requirement from Django's ``setup.py``).
id: Pasang `argon2-cffi library`_. Ini dapat diselesaikan dengan menjalankan ``pip install django[argon2]``, yang setara pada ``pip install argon2-cffi`` (bersama dengan persyaratan versi apapun dari ``setup.py`` Django).

source: Modify :setting:`PASSWORD_HASHERS` to list ``Argon2PasswordHasher`` first. That is, in your settings file, you'd put::
id: Rubah :setting:`PASSWORD_HASHERS` pada daftar ``Argon2PasswordHasher`` pertama. Yaitu, di berkas pengaturan anda, anda telah taruh::

source: Keep and/or add any entries in this list if you need Django to :ref:`upgrade passwords <password-upgrades>`.
id: Jaga dan/atau tambah masukan apapun di daftar ini jika anda butuh Django untuk :ref:`upgrade passwords <password-upgrades>`.

source: Using ``bcrypt`` with Django
id: Menggunakan ``bcrypt`` dengan Django

source: Bcrypt_ is a popular password storage algorithm that's specifically designed for long-term password storage. It's not the default used by Django since it requires the use of third-party libraries, but since many people may want to use it Django supports bcrypt with minimal effort.
id: Bcrypt_ adalah algoritma penyimpanan sandi terkenal yang khususnya dirancang untuk penyimpanan sandi jangka-panjang. Itu bukan awalan digunakan oleh Django sejak itu membutuhkan menggunakan pustaka pihak-ketiga, tetapi sejak banyak orang mungkin ingin menggunakan itu Django mendukung bcrypt dengan usaha minimal.

source: To use Bcrypt as your default storage algorithm, do the following:
id: Untuk menggunakan Bcrypt sebagai algoritma penyimpanan awalan anda, lakukan berikut:

source: Install the `bcrypt library`_. This can be done by running ``pip install django[bcrypt]``, which is equivalent to ``pip install bcrypt`` (along with any version requirement from Django's ``setup.py``).
id: Pasang `bcrypt library`_. Ini dapat diselesaikan dengan menjalankan ``pip install django[bcrypt]``, yang setara pada ``pip install bcrypt`` (bersama dengan persyaratan versi apapun dari ``setup.py`` Django).

source: Modify :setting:`PASSWORD_HASHERS` to list ``BCryptSHA256PasswordHasher`` first. That is, in your settings file, you'd put::
id: Rubah :setting:`PASSWORD_HASHERS` pada daftar ``BCryptSHA256PasswordHasher`` pertama. Yaitu, di berkas pengaturan anda, anda telah taruh::

source: That's it -- now your Django install will use Bcrypt as the default storage algorithm.
id: Yaitu -- sekarang Django memasang dengan menggunakan Bcrypt sebagai algoritma penyimpanan awalan.

source: Increasing the work factor
id: Meningkatkan faktor kerja

source: PBKDF2 and bcrypt
id: PBKDF2 dan bcrypt

source: The PBKDF2 and bcrypt algorithms use a number of iterations or rounds of hashing. This deliberately slows down attackers, making attacks against hashed passwords harder. However, as computing power increases, the number of iterations needs to be increased. We've chosen a reasonable default (and will increase it with each release of Django), but you may wish to tune it up or down, depending on your security needs and available processing power. To do so, you'll subclass the appropriate algorithm and override the ``iterations`` parameters. For example, to increase the number of iterations used by the default PBKDF2 algorithm:
id: Algoritma PBKDF2 dan bcrypt menggunakan sejumlah perulangan arau pemutaran dari campuran. Ini sengaja memperlambat penyerang, membuat serangan terhadap sandi campuran lebih keras. Bagaimanapun, seiring kekuatan komputer meningkat, sejumlah perulangan butuh ditingkatkan. Kami telah memilih awalan yang masuk akal (dan akan meningkatkannya dengan setiap tetbitan dari Django), tetapi anda mungkin berharap untuk menyetem keatas dan kebawah, tergantung pada kebutuhan keamanan anda dan kekuatan pengolahan yang tersedia. Untuk melakukannya, anda akan mensubkelaskan algoritma yang sesuai dan menimpa parameter ``iterations``. Sebagai contoh, untuk meningkatkan sejumlah perulangan digunakan oleh awalan algoritma PBKDF2:

source: Create a subclass of ``django.contrib.auth.hashers.PBKDF2PasswordHasher``::
id: Membuat sebuah subkelas dari ``django.contrib.auth.hashers.PBKDF2PasswordHasher``::

source: Save this somewhere in your project. For example, you might put this in a file like ``myproject/hashers.py``.
id: Simpan ini disuatu tempat di proyek anda. Sebagai contoh, anda mungkin menaruh ini di sebuah berkas seperti ``myproject/hashers.py``.

source: Add your new hasher as the first entry in :setting:`PASSWORD_HASHERS`::
id: Tambah pencampur baru anda sebagai masukan pertama di :setting:`PASSWORD_HASHERS`::

source: That's it -- now your Django install will use more iterations when it stores passwords using PBKDF2.
id: Itu dia -- sekarang pemasangan Django anda akan menggunakan perulangan lebih ketika itu menyimpan sandi menggunakan PBKDF2.

source: Argon2 has three attributes that can be customized:
id: Argon2 mempunyai tiga atribut yang dapat disesuaikan:

source: ``time_cost`` controls the number of iterations within the hash.
id: ``time_cost`` mengendalikan sejumlah perulangan dalam campuran.

source: ``memory_cost`` controls the size of memory that must be used during the computation of the hash.
id: ``memory_cost`` mengendalikan ukuran memori yang harus digunakan selama perhitungan dari campuran.

source: ``parallelism`` controls how many CPUs the computation of the hash can be parallelized on.
id: ``parallelism`` mengendalikan berapa banyak CPU perhitungan dari campuran dapat diparalelkan.

source: The default values of these attributes are probably fine for you. If you determine that the password hash is too fast or too slow, you can tweak it as follows:
id: Nilai-nilai awalan dari atribut ini mungkin baik untuk anda. Jika anda menentukan bahwa campuran sandi terlalu cepat atau terlalu lambat, anda dapat mengutik itu sebagai berikut:

source: Choose ``parallelism`` to be the number of threads you can spare computing the hash.
id: Pilih ``parallelism`` untuk menjadi angka dari thread anda dapat hemat menghitung campuran.

source: Choose ``memory_cost`` to be the KiB of memory you can spare.
id: Pilih ``memory_cost`` menjadi KiB dari memori anda dapat hemat.

source: Adjust ``time_cost`` and measure the time hashing a password takes. Pick a ``time_cost`` that takes an acceptable time for you. If ``time_cost`` set to 1 is unacceptably slow, lower ``memory_cost``.
id: Menyesuaikan ``time_cost`` dan ukuran waktu mencampur sebuah sandi yang diambil. Ambil sebuah ``time_cost`` yang mengambil sebuah waktu yang dapat diterima untuk anda. Jika ``time_cost`` disetel menjadi ` adalah tidak dapat diterima lambat, ``memory_cost`` lebih rendah.

source: ``memory_cost`` interpretation
id: tafsiran ``memory_cost``

source: The argon2 command-line utility and some other libraries interpret the ``memory_cost`` parameter differently from the value that Django uses. The conversion is given by ``memory_cost == 2 ** memory_cost_commandline``.
id: Kegunaan baris-perintah dan beberapa pustaka lain menafsirkan parameter ``memory_cost`` berbeda dari nilai yang Django gunakan. Perubahan yang diberikan oleh ``memory_cost == 2 ** memory_cost_commandline``.

source: Password upgrading
id: Peningkatan sandi

source: When users log in, if their passwords are stored with anything other than the preferred algorithm, Django will automatically upgrade the algorithm to the preferred one. This means that old installs of Django will get automatically more secure as users log in, and it also means that you can switch to new (and better) storage algorithms as they get invented.
id: Ketika pengguna masuk, jika sandi mereka disimpan dengan apapun lain dari algoritma yang dipilih, Django akan secara otomatis meningkatkan algoritma ke satu yang dipilih. Ini berarti bahwa pemasangan lama dari Django akan mendapatkan otomatis lebih aman ketika pengguna masuk, dan itu juga berarti bahwa anda dapat berganti ke algoritma pentimpanan (dan lebih baik) baru ketika mereka dibuat.

source: However, Django can only upgrade passwords that use algorithms mentioned in :setting:`PASSWORD_HASHERS`, so as you upgrade to new systems you should make sure never to *remove* entries from this list. If you do, users using unmentioned algorithms won't be able to upgrade. Hashed passwords will be updated when increasing (or decreasing) the number of PBKDF2 iterations or bcrypt rounds.
id: Bagaimanapun, Django hanya dapat meningkatkan sandi yang menggunakan algoritma disebutkan di :setting:`PASSWORD_HASHERS`, jadi ketika anda meningkatkan ke sistem baru anda harus memastikan tidak pernah *memindahkan* masukan dari daftar ini. Jika anda melakukan, pengguna menggunakan algoritma tidak disebutkan tidak dapat ditingkatkan. Sandi dicampur akan diperbaharui ketika meningkatkan (atau menurunkan) sejumlah perulangan PBKDF2 atau lingkaran bcrypt.

source: Be aware that if all the passwords in your database aren't encoded in the default hasher's algorithm, you may be vulnerable to a user enumeration timing attack due to a difference between the duration of a login request for a user with a password encoded in a non-default algorithm and the duration of a login request for a nonexistent user (which runs the default hasher). You may be able to mitigate this by :ref:`upgrading older password hashes <wrapping-password-hashers>`.
id: Waspada bahwa jika semua sandi di basisdata anda tidak dikodekan di algoritma pencampur awalan, anda mungkin rentan pada serangan pewaktu pencacahan pengguna karena perbedaan diantara lamanya dari permintaan masuk untuk pengguna dengan sandi terkodekan di algoritma bukan-awalan dan lamanya dari permintaan masuk untuk pengguna tidak ada (yang menjalankan pencampur awalan). Anda mungkin dapat memperbaiki ini dengan :ref:`upgrading older password hashes <wrapping-password-hashers>`.

source: Password upgrading without requiring a login
id: Meningkatkan sandi tanpa membutuhkan masuk

source: If you have an existing database with an older, weak hash such as MD5 or SHA1, you might want to upgrade those hashes yourself instead of waiting for the upgrade to happen when a user logs in (which may never happen if a user doesn't return to your site). In this case, you can use a "wrapped" password hasher.
id: Jika anda mempunyai basisdata yang ada dengan yang terlama, campuran lemah seperti MD5 atau SHA1, anda mungkin ingin meningkatkan campuran tersebut anda sendiri daripada menunggu peninggkatan terjadi ketika pengguna masuk (yang mungkin tidak pernah terjadi jika pengguna tidak kembali ke situs anda). Di kasus ini, anda dapat menggunakan pencampur sandi "wrapped".

source: For this example, we'll migrate a collection of SHA1 hashes to use PBKDF2(SHA1(password)) and add the corresponding password hasher for checking if a user entered the correct password on login. We assume we're using the built-in ``User`` model and that our project has an ``accounts`` app. You can modify the pattern to work with any algorithm or with a custom user model.
id: Untuk contoh ini, kami akan memindahkan kumpulan dari campuran SHA1 untuk menggunakan PBKDF2(SHA1(password)) dan menambah pencampur sandi sesuai untuk memeriksa jika pengguna memasukkan sandi benar pada masuk. Kami menganggap kami sedang menggunakan model ``User`` siap-pakai dan bahwa proyek kami mempunyai sebuah aplikasi ``accounts``. Anda dapat merubah pola untuk bekerja dengan algoritma apapun atau dengan penyesuaian model user.

source: First, we'll add the custom hasher:
id: Pertama, kami akan menambah penyesuaian pencampur:

source: The data migration might look something like:
id: Perpindahan data mungkin terlihat seperti:

source: Be aware that this migration will take on the order of several minutes for several thousand users, depending on the speed of your hardware.
id: Waspada bahwa perpindahan ini akan mengambil urutan dari beberapa menit untuk beberapa ribuan pengguna, tergantung pada kecepatan perangkat keras anda.

source: Finally, we'll add a :setting:`PASSWORD_HASHERS` setting:
id: Akhirya, kami akan menambah sebuah pengaturan :setting:`PASSWORD_HASHERS`:

source: Include any other hashers that your site uses in this list.
id: Sertakan pencampur lain apapun yang situs anda gunakan di daftar ini.

source: Included hashers
id: Disertakan pencampur

source: The full list of hashers included in Django is::
id: Daftar penuh dari pencampur disertakan di Django adalah::

source: The corresponding algorithm names are:
id: Nama-nama algoritma sesuai adalah:

source: Writing your own hasher
id: Menulis pencampur anda sendiri

source: If you write your own password hasher that contains a work factor such as a number of iterations, you should implement a ``harden_runtime(self, password, encoded)`` method to bridge the runtime gap between the work factor supplied in the ``encoded`` password and the default work factor of the hasher. This prevents a user enumeration timing attack due to difference between a login request for a user with a password encoded in an older number of iterations and a nonexistent user (which runs the default hasher's default number of iterations).
id: Jika anda menulis pencampur sandi anda sendiri yang mengandung faktor kerja seperti sejumlah perulangan, anda harus menerapkan sebuah metode ``harden_runtime(self, password, encoded)`` untuk menjembatani celah waktu jalan diantara faktor kerja disokong di sandi ``encoded`` dan faktor kerja awalan dari pencampur. Ini mencegah serangan pewaktu pencacahan pengguna pada perbedaan diantara permintaan masuk untuk pengguna baru dengan sandi dikodekan di nomor terlama dari perulangan dan pengguna tidak ada (yang menjalankan nomor awalan pencampur bawaan dari perulangan).

source: Taking PBKDF2 as example, if ``encoded`` contains 20,000 iterations and the hasher's default ``iterations`` is 30,000, the method should run ``password`` through another 10,000 iterations of PBKDF2.
id: Mengambil PBKDF2 sebagai contoh, jika ``encoded`` mengandung 20,000 perputaran dan ``iterations`` awalan pencampur adalah 30,000, metode harus menjalankan ``password`` melalui perputaran 10,000 lain dari PBKDF2.

source: If your hasher doesn't have a work factor, implement the method as a no-op (``pass``).
id: Jika pencampur anda tidak mempunyai faktor kerja, terapkan metode sebagai no-op (``pass``).

source: Manually managing a user's password
id: Manual mengelola sandi pengguna

source: If you'd like to manually authenticate a user by comparing a plain-text password to the hashed password in the database, use the convenience function :func:`check_password`. It takes two arguments: the plain-text password to check, and the full value of a user's ``password`` field in the database to check against, and returns ``True`` if they match, ``False`` otherwise.
id: Jika anda suka secara manual autentifikasi pengguna dengan membandingkan sandi teks-polos pada sandi dicampur di basisdata, gunakan fungsi nyaman :func:`check_password`. Itu mengambil dua argumen: sandi teks-polos untuk memeriksa, dan nilai penuh dari bidang ``password`` pengguna di basisdata untuk memeriksa terhadap, dan mengembalikan ``True`` jika mereka cocok, ``False`` sebaliknya.

source: Password validation
id: Pengesahan sandi

source: Users often choose poor passwords. To help mitigate this problem, Django offers pluggable password validation. You can configure multiple password validators at the same time. A few validators are included in Django, but it's simple to write your own as well.
id: Pengguna sering memilih sandi miskin. Untuk membantu memperbaiki masalah ini, Django menawarkan pengesahan sandi tertanam. Anda dapat mengkonfigurasi banyak pengesah sandi pada waktu bersamaan. Sedikit pengesah disertakan di Django, tetapi itu cukup menulis anda sendiri juga.

source: Each password validator must provide a help text to explain the requirements to the user, validate a given password and return an error message if it does not meet the requirements, and optionally receive passwords that have been set. Validators can also have optional settings to fine tune their behavior.
id: Setiap pengesah sandi harus menyediakan teks bantuan untuk menjelaskan persyaratan ke pengguna, mensahkan sandi diberikan dan mengembalikan sebuah pesan kesalahan jika itu tidak memenuhi persyaratan, dan pilihannya menerima sandi yang telah disetel. Pengesah dapat juga mempunyai pengaturan pilihan untuk mendenda menyesuaikan perilaku mereka.

source: Validation is controlled by the :setting:`AUTH_PASSWORD_VALIDATORS` setting. The default for the setting is an empty list, which means no validators are applied. In new projects created with the default :djadmin:`startproject` template, a simple set of validators is enabled.
id: Pengesahan dikendalikan dengan pengaturan :setting:`AUTH_PASSWORD_VALIDATORS`. Awalan untuk pengaturan adalah sebuah daftar kosong, yang berarti tidak ada pengesah diberlakukan. Dalam proyek baru dibuat dengan cetakan :djadmin:`startproject` awalan, sekumpulan sederhana dari pengesah diadakan.

source: By default, validators are used in the forms to reset or change passwords and in the :djadmin:`createsuperuser` and :djadmin:`changepassword` management commands. Validators aren't applied at the model level, for example in ``User.objects.create_user()`` and ``create_superuser()``, because we assume that developers, not users, interact with Django at that level and also because model validation doesn't automatically run as part of creating models.
id: Secara awalan, pengesah digunakan dalam formulir untuk menyetel kembali atau merubah sandi dan di perintah pengelolaan :djadmin:`createsuperuser` dan :djadmin:`changepassword`. Pengesah tidak diberlakukan pada tingkat model, sebagai contoh di `User.objects.create_user()`` dan ``create_superuser()``, karena kami mengaggap bahwa pengembang, bukan pengguna, interaksi dengan Django pada tingkat itu dan juga karena pengesahan model tidak secara otomatis berjalan sebagai bagian dari membuat model.

source: Password validation can prevent the use of many types of weak passwords. However, the fact that a password passes all the validators doesn't guarantee that it is a strong password. There are many factors that can weaken a password that are not detectable by even the most advanced password validators.
id: Pengesah sandi dapat mencegah penggunaan dari banyak jenis dari sandi lemah. Bagaimanapun, fakta bahwa sandi melewatkan semua pengesah tidak menjami bahwa itu adalah sandi kuat. Ada banyak faktor yang dapat memperlemah sebuah sandi yang tidak dikenali oleh bahkan pengesah sandi paling tingkat lanjut.

source: Enabling password validation
id: Adakan pengesahan sandi

source: Password validation is configured in the :setting:`AUTH_PASSWORD_VALIDATORS` setting::
id: Pengesahan sandi dikonfigurasikan di pengaturan :setting:`AUTH_PASSWORD_VALIDATORS`::

source: This example enables all four included validators:
id: Contoh ini mengadakan semua empat pengesah disertakan:

source: ``UserAttributeSimilarityValidator``, which checks the similarity between the password and a set of attributes of the user.
id: ``UserAttributeSimilarityValidator``, yang memeriksa kemiripan diantara sandi dan sekumpulan dari atribut dari pengguna.

source: ``MinimumLengthValidator``, which simply checks whether the password meets a minimum length. This validator is configured with a custom option: it now requires the minimum length to be nine characters, instead of the default eight.
id: ``MinimumLengthValidator``, yang cukup memeriksa apakah sandi memenuhi panjang minimal. Pengesah ini dikonfigurasikan dengan penyesuaian pilihan: itu sekarang membutuhkan panjang minimal untuk menjadi 9 karakter, daripada awalan delapan.

source: ``NumericPasswordValidator``, which checks whether the password isn't entirely numeric.
id: ``NumericPasswordValidator``, yang memeriksa apakah sandi tidak sepenuhnya numerik.

source: For ``UserAttributeSimilarityValidator`` and ``CommonPasswordValidator``, we're simply using the default settings in this example. ``NumericPasswordValidator`` has no settings.
id: Untuk ``UserAttributeSimilarityValidator`` dan ``CommonPasswordValidator``, kami cukup menggunakan pengaturan awalan di contoh ini. ``NumericPasswordValidator`` tidak mempunyai pengaturan.

source: The help texts and any errors from password validators are always returned in the order they are listed in :setting:`AUTH_PASSWORD_VALIDATORS`.
id: Teks bantuan dan kesalahan apapun dari pengesah sandi selalu dikembalikan agar mereka didaftarkan di :setting:`AUTH_PASSWORD_VALIDATORS`.

source: Included validators
id: Disertakan pengesah

source: Django includes four validators:
id: Django menyertakan empat pengesah:
