Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: ``redirect_authenticated_user``: A boolean that controls whether or not authenticated users accessing the login page will be redirected as if they had just successfully logged in. Defaults to ``False``.
id: ``redirect_authenticated_user``: Sebuah boolean yang mengendalikan apakah atau tidak pengguna terotentifikasi mengakses halaman login akan dialihkan ketika mereka telah berhasil masuk. Awalan ke ``False``.

source: If you enable ``redirect_authenticated_user``, other websites will be able to determine if their visitors are authenticated on your site by requesting redirect URLs to image files on your website. To avoid this "`social media fingerprinting <https://robinlinus.github.io/socialmedia-leak/>`_" information leakage, host all images and your favicon on a separate domain.
id: Jika anda mengadakan ``redirect_authenticated_user``, jaringan situs lainnya akan dapat menentukan jika pengunjung mereka adalah terotentifikasi pada situs anda dengan meminta pengalihan URL ke berkas gambar pada situs jaringan anda. Untuk menghindari ini "`social media fingerprinting <https://robinlinus.github.io/socialmedia-leak/>`_" kebocoran informasi, simpan semua gambar dan favicon anda pada ranah terpisah.

source: ``success_url_allowed_hosts``: A :class:`set` of hosts, in addition to :meth:`request.get_host() <django.http.HttpRequest.get_host>`, that are safe for redirecting after login. Defaults to an empty :class:`set`.
id: `success_url_allowed_hosts``: :class:`set`dari rumah, sebagai tambahan pada :meth:`request.get_host() <django.http.HttpRequest.get_host>`,yang aman untuk pengalihan setelah masuk. Awalan ke :class:`set` kosong.

source: Here's what ``LoginView`` does:
id: Ini adalah apa ``LoginView`` lakukan:

source: If called via ``GET``, it displays a login form that POSTs to the same URL. More on this in a bit.
id: Jika dipanggil melalui ``GET``, itu menampilkan formulir masuk yang POST ke URL sama.Lebih dari ini dalam bit.

source: If called via ``POST`` with user submitted credentials, it tries to log the user in. If login is successful, the view redirects to the URL specified in ``next``. If ``next`` isn't provided, it redirects to :setting:`settings.LOGIN_REDIRECT_URL <LOGIN_REDIRECT_URL>` (which defaults to ``/accounts/profile/``). If login isn't successful, it redisplays the login form.
id: Jika dipanggil melalui ``POST`` dengan pengguna mengajukan surat kepercayaan, itu mencoba untuk masuk pengguna. Jika masuk berhasil, tampilan mengalihkan ke URL ditentukan di ``next`` tidak menyediakan, itu mengalihkan ke :setting:`settings.LOGIN_REDIRECT_URL <LOGIN_REDIRECT_URL>` (yang awalan menjadi ``/accounts/profile/``). Jika masuk tidak berhasil, itu menampilkan kembali formulir masuk.

source: It's your responsibility to provide the html for the login template , called ``registration/login.html`` by default. This template gets passed four template context variables:
id: Itu adalah tanggung jawab anda untuk menyediakan html untuk cetakan masuk, dipanggil ``registration/login.html`` secara awalan. Cetakan ini dilewatkan empat cetakan variabel konteks:

source: ``form``: A :class:`~django.forms.Form` object representing the :class:`~django.contrib.auth.forms.AuthenticationForm`.
id: ``form``: Sebuah obyek :class:`~django.forms.Form` mewakili :class:`~django.contrib.auth.forms.AuthenticationForm`.

source: ``next``: The URL to redirect to after successful login. This may contain a query string, too.
id: ``next``: URL untuk dialihkan setelah berhasil masuk. Ini mungkin mengandung permintaan string, juga.

source: ``site``: The current :class:`~django.contrib.sites.models.Site`, according to the :setting:`SITE_ID` setting. If you don't have the site framework installed, this will be set to an instance of :class:`~django.contrib.sites.requests.RequestSite`, which derives the site name and domain from the current :class:`~django.http.HttpRequest`.
id: ``site``: :class:`~django.contrib.sites.models.Site`saat ini, menurut pengaturan :setting:`SITE_ID`. Jika anda tidak mempunyai kerangka kerja situs terpasang, ini akan disetel ke sebuah instance dari :class:`~django.contrib.sites.requests.RequestSite`, yang memperoleh nama situs dan ranah dari :class:`~django.http.HttpRequest` saat ini.

source: ``site_name``: An alias for ``site.name``. If you don't have the site framework installed, this will be set to the value of :attr:`request.META['SERVER_NAME'] <django.http.HttpRequest.META>`. For more on sites, see :doc:`/ref/contrib/sites`.
id: ``site_name``: Sebuah nama lain untuk ``site.name``. Jika anda tidak mempunyai kerangka kerja situs terpasang, ini akan disetel ke nilai dari :attr:`request.META['SERVER_NAME'] <django.http.HttpRequest.META>`. Untuk lebih di situs, lihat :doc:`/ref/contrib/sites`.

source: If you'd prefer not to call the template :file:`registration/login.html`, you can pass the ``template_name`` parameter via the extra arguments to the ``as_view`` method in your URLconf. For example, this URLconf line would use :file:`myapp/login.html` instead::
id: Jika anda memilih tidak memanggil cetakan :file:`registration/login.html`, anda dapat melewatkan parameter ``template_name`` melalui argumen tambahan pada metode ``as_view`` dalam URLConf anda. Sebagai contoh, baris URLconf ini akan menggunakan :file:`myapp/login.html` sebagai gantinya.

source: You can also specify the name of the ``GET`` field which contains the URL to redirect to after login using ``redirect_field_name``. By default, the field is called ``next``.
id: Anda dapat juga menentukan nama dari bidang ``GET`` yang mengandung URL untuk mengalihkan setelah masuk menggunakan ``redirect_field_name``. Secara awalan, bidang dipanggil ``next``.

source: Here's a sample :file:`registration/login.html` template you can use as a starting point. It assumes you have a :file:`base.html` template that defines a ``content`` block:
id: Ini adalah sebuah contoh cetakan :file:`registration/login.html` anda dapat gunakan sebagai titik awalan. Itu menganggap anda memiliki sebuah cetakan :file:`base.html` yang menentukan sebuah blok ``content``.

source: If you have customized authentication (see :doc:`Customizing Authentication </topics/auth/customizing>`) you can use a custom authentication form by setting the ``authentication_form`` attribute. This form must accept a ``request`` keyword argument in its ``__init__()`` method and provide a ``get_user()`` method which returns the authenticated user object (this method is only ever called after successful form validation).
id: Jika anda telah menyesuaiakan autentifikasi (lihat :doc:`Customizing Authentication 1`)anda dapat menggunakan formulir autentifikasi penyesuaian dengan mengatur atribut ``authentication_form``. Formulir ini harus menerima sebuah argumen katakunci ``request`` dalam metode ``__init__()`` nya dan menyediakan metode ``get_user()`` yang mengembalikan obyek pengguna terautentifikasi (metode ini hanya dipanggil setelah keberhasilan formulir pengesahan).

source: Logs a user out.
id: Pengguna keluar

source: **URL name:** ``logout``
id: **Nama URL:** ``logout``

source: ``next_page``: The URL to redirect to after logout. Defaults to :setting:`settings.LOGOUT_REDIRECT_URL <LOGOUT_REDIRECT_URL>`.
id: ``next_page``: URL untuk mengalihkan setelah keluar. Awalan menjadi :setting:`settings.LOGOUT_REDIRECT_URL <LOGOUT_REDIRECT_URL>`.

source: ``template_name``: The full name of a template to display after logging the user out. Defaults to :file:`registration/logged_out.html`.
id: ``template_name``: Nama penuh dari sebuah cetakan setelah pengguna keluar. Awalan menjadi :file:`registration/logged_out.html`.

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after log out. Defaults to ``next``. Overrides the ``next_page`` URL if the given ``GET`` parameter is passed.
id: ``redirect_field_name``: Nama dari bidang ``GET`` mengandung URL untuk mengalihkan ke setelah keluar. Awalan pada ``next``. Menimpa URL ``next_page`` jika parameter ``GET`` yang diberikan lolos.

source: ``success_url_allowed_hosts``: A :class:`set` of hosts, in addition to :meth:`request.get_host() <django.http.HttpRequest.get_host>`, that are safe for redirecting after logout. Defaults to an empty :class:`set`.
id: ``success_url_allowed_hosts``: :class:`set` dari rumah, sebagai tambahan pada :meth:`request.get_host() <django.http.HttpRequest.get_host>`,yang aman untuk pengelihan setelah keluar. Awalan pada :class:`set` kosong.

source: **Template context:**
id: **Kontek cetakan**

source: ``title``: The string "Logged out", localized.
id: ``title``: String "Logged out", lokalisasi.

source: Logs a user out, then redirects to the login page.
id: Pengguna keluar, kemudian mengalihkan ke halaman masuk.

source: **URL name:** No default URL provided
id: **Nama URL:** Tidak ada URL awal disediakan

source: **Optional arguments:**
id: **Argumen pilihan**

source: ``login_url``: The URL of the login page to redirect to. Defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>` if not supplied.
id: ``login_url``: URL dari halaman masuk untuk mengalihkan. Awalan menjadi :setting:`settings.LOGIN_URL <LOGIN_URL>` jika tidak diberikan.

source: **URL name:** ``password_change``
id: **Nama URL:** ``password_change``

source: Allows a user to change their password.
id: Izinkan pengguna merubah sandi mereka.

source: ``template_name``: The full name of a template to use for displaying the password change form. Defaults to :file:`registration/password_change_form.html` if not supplied.
id: ``template_name``: Nama penuh dari cetakan untuk digunakan untuk menampilkan formulir rubah sandi. Awalan menjadi :file:`registration/password_change_form.html` jika tidak diberikan.

source: ``success_url``: The URL to redirect to after a successful password change.
id: ``success_url``: URL untuk mengalihkan setelah perubahan sandi berhasil.

source: ``form_class``: A custom "change password" form which must accept a ``user`` keyword argument. The form is responsible for actually changing the user's password. Defaults to :class:`~django.contrib.auth.forms.PasswordChangeForm`.
id: `form_class``: Formulir "rubah sandi" penyesuaian yang harus menerima sebuah argumen katakunci. Formulir bertanggungjawab untuk sebenarnya merubah sandi pengguna. Awalan pada :class:`~django.contrib.auth.forms.PasswordChangeForm`.

source: ``form``: The password change form (see ``form_class`` above).
id: ``form``: Formulir rubah sandi (lihat ``form_class`` diatas).

source: **URL name:** ``password_change_done``
id: **Nama URL:** ``password_change_done``

source: The page shown after a user has changed their password.
id: Halaman muncul setelah pengguna telah merubah sandi mereka.

source: ``template_name``: The full name of a template to use. Defaults to :file:`registration/password_change_done.html` if not supplied.
id: ``template_name``: Nama penuh dari cetakan untuk digunakan. Awalan menjadi :file:`registration/password_change_done.html` jika tidak diberikan.

source: **URL name:** ``password_reset``
id: **Nama URL:** ``password_reset``

source: Allows a user to reset their password by generating a one-time use link that can be used to reset the password, and sending that link to the user's registered email address.
id: Mengizinkan seorang pengguna menyetel kembali sandi dengan membangkitkan satu-kali penggunaan tautan yang dapat digunakan untuk menyetel kembali sandi, dan mengirim tautan itu ke alamat surel pengguna terdaftar.

source: If the email address provided does not exist in the system, this view won't send an email, but the user won't receive any error message either. This prevents information leaking to potential attackers. If you want to provide an error message in this case, you can subclass :class:`~django.contrib.auth.forms.PasswordResetForm` and use the ``form_class`` attribute.
id: Jika alamat sandi disediakan tidak ada dalam sistem, tampilan ini tidak akan mengirim sebuah surel, tetapi pengguna tidak akan menerima pesan kesalahan apapun juga. Ini mencegah kebocoran informasi pada penyerang potensial. Jika anda ingin menyediakan sebuah pesan kesalahan dalam kasus ini, anda dapat mensubkelaskan :class:`~django.contrib.auth.forms.PasswordResetForm` dan menggunakan atribut ``form_class``.

source: Users flagged with an unusable password (see :meth:`~django.contrib.auth.models.User.set_unusable_password()` aren't allowed to request a password reset to prevent misuse when using an external authentication source like LDAP. Note that they won't receive any error message since this would expose their account's existence but no mail will be sent either.
id: Pengguna ditandai dengan sandi tidak digunakan (lihat :meth:`~django.contrib.auth.models.User.set_unusable_password()` tidak diizinkan untuk meminta menyetel kembali sandi untuk mencegah penyalahgunaan ketika menggunakan sumber autentifikasi luar seperti LDAP. Catat bahwa mereka tidak akan menerima pesan kesalahan apapun sejak ini akan membuat wujud akun mereka tetapi tidak ada surat akan dikirim juga.

source: ``template_name``: The full name of a template to use for displaying the password reset form. Defaults to :file:`registration/password_reset_form.html` if not supplied.
id: ``template_name``: Nama penuh dari cetakan untuk digunakan untuk menampilkan formulir setel kembali sandi. Awalan menjadi :file:`registration/password_reset_form.html` jika tidak diberikan.

source: ``form_class``: Form that will be used to get the email of the user to reset the password for. Defaults to :class:`~django.contrib.auth.forms.PasswordResetForm`.
id: ``form_class``: Formulir yang akan digunakan mendapatkan surel dari pengguna untuk menyetel kembali sandi. Awalan pada :class:`~django.contrib.auth.forms.PasswordResetForm`.

source: ``email_template_name``: The full name of a template to use for generating the email with the reset password link. Defaults to :file:`registration/password_reset_email.html` if not supplied.
id: ``email_template_name``: Nama penuh dari cetakan untuk digunakan untuk membangkitkan surel dengan tautan sandi setel kembali. Awalan menjadi :file:`registration/password_reset_email.html` jika tidak diberikan.

source: ``subject_template_name``: The full name of a template to use for the subject of the email with the reset password link. Defaults to :file:`registration/password_reset_subject.txt` if not supplied.
id: ``subject_template_name``: Nama penuh dari cetakan untuk digunakan untuk subyek dari surel dengan tautan sandi setel kembali. Awalan menjadi :file:`registration/password_reset_subject.txt` jika tidak diberikan.

source: ``token_generator``: Instance of the class to check the one time link. This will default to ``default_token_generator``, it's an instance of ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.
id: ``token_generator``: Instance dari kelas untuk memeriksa tautan satu waktu. Ini akan awalan menjadi ``default_token_generator``, itu adalah sebuah instance dari ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.

source: ``success_url``: The URL to redirect to after a successful password reset request.
id: ``success_url``: URL dialihkan setelah berhasil permintaan setel kembali sandi.

source: ``from_email``: A valid email address. By default Django uses the :setting:`DEFAULT_FROM_EMAIL`.
id: ``from_email``: Sebuah alamat surel sah. Secara awalan Django menggunakan :setting:`DEFAULT_FROM_EMAIL`.

source: ``html_email_template_name``: The full name of a template to use for generating a ``text/html`` multipart email with the password reset link. By default, HTML email is not sent.
id: ``html_email_template_name``: Nama penuh dari cetakan untuk digunakan untuk membangkitkan sebuah surel banyak bagian ``text/html`` dengan tautan menyetel kembali sandi. Secara awalan, surel HTML tidak dikirim.

source: ``extra_email_context``: A dictionary of context data that will be available in the email template.
id: ``extra_email_context``: Sebuah kamus dari data konteks yang akan tersedia di cetakan surel.

source: ``form``: The form (see ``form_class`` above) for resetting the user's password.
id: ``form``: Formulir (lihat ``form_class`` diatas) untuk mengatur kembali sandi pengguna.

source: **Email template context:**
id: **Konteks cetakan surel:**

source: ``email``: An alias for ``user.email``
id: ``email``: Sebuah nama lain untuk ``user.email``

source: ``user``: The current :class:`~django.contrib.auth.models.User`, according to the ``email`` form field. Only active users are able to reset their passwords (``User.is_active is True``).
id: ``user``: :class:`~django.contrib.auth.models.User` saat ini, menurut pada bidang formulir ``email``. Hanya pengguna aktif yang dapa menyetel kembali sandi mereka (``User.is_active adalah True``).

source: ``domain``: An alias for ``site.domain``. If you don't have the site framework installed, this will be set to the value of ``request.get_host()``.
id: ``domain``: Sebuah nama lain untuk ``site.domain``. Jika anda tidak mempunyai kerangka kerja situs terpasang, ini akan disetel ke nilai dari ``request.get_host()``.

source: ``protocol``: http or https
id: ``protocol``: http atau https

source: ``uid``: The user's primary key encoded in base 64.
id: ``uid``: Primary key pengguna disandikan dalam base 64.

source: ``token``: Token to check that the reset link is valid.
id: ``token``: Token untuk memeriksa bahwa tautan menyetel kembali adalah sah.

source: Sample ``registration/password_reset_email.html`` (email body template):
id: Contoh ``registration/password_reset_email.html`` (cetakan badan email):

source: The same template context is used for subject template. Subject must be single line plain text string.
id: Konteks cetakan sama digunakan untuk cetakan subyek. Subyek harus berupa strng teks polosbaris tunggal.

source: **URL name:** ``password_reset_done``
id: **Nama URL:** ``password_reset_done``

source: The page shown after a user has been emailed a link to reset their password. This view is called by default if the :class:`PasswordResetView` doesn't have an explicit ``success_url`` URL set.
id: Halaman muncul setelah pengguna telah disurelkan sebuah tautan untuk menyetel kembali sandi mereka. Tampilan ini dipanggil sebagai awalan jika :class:`PasswordResetView` tidak mempunyai kumpulan URL ``success_url`` yang jelas.

source: If the email address provided does not exist in the system, the user is inactive, or has an unusable password, the user will still be redirected to this view but no email will be sent.
id: Jika alamat surel disediakan tidak ada di sistem, pengguna adalah tidak aktif, atau mempunyai sebuah sandi tidak berguna, pengguna akan masih dialihkan ke tampilan ini tetapi tidak ada surel yang akan dikirim.

source: ``template_name``: The full name of a template to use. Defaults to :file:`registration/password_reset_done.html` if not supplied.
id: ``template_name``: Nama penuh dari cetakan untuk digunakan. Awalan menjadi :file:`registration/password_reset_done.html` jika tidak diberikan.

source: **URL name:** ``password_reset_confirm``
id: **Nama URL:** ``password_reset_confirm``

source: Presents a form for entering a new password.
id: Mengajukan sebuah formulir untuk memasukkan sebuah sandi baru.

source: **Keyword arguments from the URL:**
id: **Argumen katakunci dari URL:**

source: ``uidb64``: The user's id encoded in base 64.
id: ``uidb64``: id pengguna disandikan dalam base 64.

source: ``token``: Token to check that the password is valid.
id: ``token``: Token untuk memeriksa bahwa sandi adalah sah.

source: ``template_name``: The full name of a template to display the confirm password view. Default value is :file:`registration/password_reset_confirm.html`.
id: ``template_name``: Nama penuh dari cetakan untuk memperlihatkan penegasan tampilan sandi. Nilai awalan adalah :file:`registration/password_reset_confirm.html`.

source: ``token_generator``: Instance of the class to check the password. This will default to ``default_token_generator``, it's an instance of ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.
id: ``token_generator``: Instance dari kelas untuk memeriksa sandi. Ini akan awalan menjadi ``default_token_generator``, itu adalah sebuah instance dari ``django.contrib.auth.tokens.PasswordResetTokenGenerator``.

source: ``post_reset_login``: A boolean indicating if the user should be automatically authenticated after a successful password reset. Defaults to ``False``.
id: ``post_reset_login``: Boolean menunjukkan jika pengguna harus otomatis diatutentifikasi setelah setel kembali sandi berhasil. Awalan pada ``False``.

source: ``post_reset_login_backend``: A dotted path to the authentication backend to use when authenticating a user if ``post_reset_login`` is ``True``. Required only if you have multiple :setting:`AUTHENTICATION_BACKENDS` configured. Defaults to ``None``.
id: ``post_reset_login_backend``: Jalur bertitik pada backend autentifikasi untuk menggunakan ketika mengautentifikasi pengguna jika ``post_reset_login`` adalah ``True``. Dibutuhkan hanya jika anda mempunyai banyak :setting:`AUTHENTICATION_BACKENDS` dikonfigurasi. Awalan pada ``None``.

source: ``form_class``: Form that will be used to set the password. Defaults to :class:`~django.contrib.auth.forms.SetPasswordForm`.
id: ``form_class``: Formulir yang akan digunakan menyetel sandi. Awalan pada :class:`~django.contrib.auth.forms.SetPasswordForm`.

source: ``success_url``: URL to redirect after the password reset done. Defaults to ``'password_reset_complete'``.
id: ``success_url``: URL untuk mengalihkan setelah penyetelan kembali sandi selesai. Awalan pada ``'password_reset_complete'``.

source: ``form``: The form (see ``set_password_form`` above) for setting the new user's password.
id: ``form``: Formulir (lihat ``set_password_form`` diatas) untuk mengatur sandi pengguna baru

source: ``validlink``: Boolean, True if the link (combination of ``uidb64`` and ``token``) is valid or unused yet.
id: ``validlink``: Boolean, True jika tautan (perpaduan dari ``uidb64`` dan ``token``) adalah sah atau tidak digunakan.

source: **URL name:** ``password_reset_complete``
id: **Nama URL:** ``password_reset_complete``

source: Presents a view which informs the user that the password has been successfully changed.
id: Menghadirkan sebuah tampilan yang menginformasikan pengguna bahwa sandi telah berhasil dirubah.

source: ``template_name``: The full name of a template to display the view. Defaults to :file:`registration/password_reset_complete.html`.
id: ``template_name``: Nama penuh dari cetakan untuk memperlihatkan tampilan. Nilai awalan menjadi :file:`registration/password_reset_complete.html`.

source: Helper functions
id: Fungsi pembantu

source: Redirects to the login page, and then back to another URL after a successful login.
id: Dialihkan ke halaman masuk, dan kemudian kembali ke URL lain setelah berhasil masuk.

source: **Required arguments:**
id: **Argumen diwajibkan:**

source: ``next``: The URL to redirect to after a successful login.
id: ``next``: URL untuk mengalihkan setelah berhasil masuk.

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after log out. Overrides ``next`` if the given ``GET`` parameter is passed.
id: ``redirect_field_name``: Nama dari bidang ``GET`` mengandung URL untuk mengalihkan ke setelah keluar. Menimpa ``next`` jika parameter ``GET`` yang diberikan lolos.

source: Built-in forms
id: Formulir siap pakai
