Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The behavior of :meth:`~django.db.models.query.QuerySet.filter` for queries that span multi-value relationships, as described above, is not implemented equivalently for :meth:`~django.db.models.query.QuerySet.exclude`. Instead, the conditions in a single :meth:`~django.db.models.query.QuerySet.exclude` call will not necessarily refer to the same item.
id: Perilaku dari :meth:`~django.db.models.query.QuerySet.filter`untuk permintaan yang menjangkau hubungan banyak-nilai, seperti digambarkan diatas, tidak diterapkan setara untuk :meth:`~django.db.models.query.QuerySet.exclude`.Malahan, keadaan dalam panggilan :meth:`~django.db.models.query.QuerySet.exclude`tunggal tidak akan butuh mengacu ke barang sama.

source: For example, the following query would exclude blogs that contain *both* entries with *"Lennon"* in the headline *and* entries published in 2008::
id: Sebagai contoh, permintaan berikut akan tidak menyertakan blog-blog yang mengandung *kedua* masukan dengan *"Lennon"* di judul *dan* masukan diterbitkan di 2008::

source: However, unlike the behavior when using :meth:`~django.db.models.query.QuerySet.filter`, this will not limit blogs based on entries that satisfy both conditions. In order to do that, i.e. to select all blogs that do not contain entries published with *"Lennon"* that were published in 2008, you need to make two queries::
id: Bagaimanapun, tidak seperti perilaku ketika menggunakan :meth:`~django.db.models.query.QuerySet.filter`,ini tidak akan membatasi blog-blog berdasarkan pada masukan yang memuaskan kedua keadaan. Untuk melakukan itu, yaitu untuk memilih semua blog yang tidak mengandung masukan diterbitkan dengan *"Lennon"* yang telah diterbitkan di 2008, anda butuh membuat dua permintaan::

source: Filters can reference fields on the model
id: Penyaring dapat mengacu bidang pada model

source: In the examples given so far, we have constructed filters that compare the value of a model field with a constant. But what if you want to compare the value of a model field with another field on the same model?
id: Dalam contoh yang diberikan sejauh ini, kami telah membangun berkas-berkas penyaring yang membandingkan nilai dari bidang model dengan ketetapan. Tetapi apa jika anda ingin membandingkan nilai dai bidang model dengan bidang lain pada model sama?

source: Django provides :class:`F expressions <django.db.models.F>` to allow such comparisons. Instances of ``F()`` act as a reference to a model field within a query. These references can then be used in query filters to compare the values of two different fields on the same model instance.
id: Django menyediakan :class:`F expressions <django.db.models.F>` untuk mengizinkan perbandingan. Instance dari ``F()`` bertindak sebagai sebuah acuan pada model dalam permintaan. Acuan ini kemudian dapat digunakan dalam penyaring permintaan untuk membandingkan nilai-nilai dari dua bidang berbeda pada instance model sama.

source: For example, to find a list of all blog entries that have had more comments than pingbacks, we construct an ``F()`` object to reference the pingback count, and use that ``F()`` object in the query::
id: Sebagai contoh, untuk menemukan daftar dari semua masukan blog yang telah mempunyai komentar lebih dari pingback, kami membangun obyek ``F()`` untuk mengacu jumlah pingback, dan menggunakan obyek ``F()`` itu dalam permintaan::

source: Django supports the use of addition, subtraction, multiplication, division, modulo, and power arithmetic with ``F()`` objects, both with constants and with other ``F()`` objects. To find all the blog entries with more than *twice* as many comments as pingbacks, we modify the query::
id: Django mendukung penggunaan aritmatika penambahan, pengurangan, perkalian, pembagian modulus, dan power dengan obyek ``F()``, kedua dengan ketetapan dan dengan obyek ``F()`` lain. Untuk menemukan semua masukan blog dengan lebih dari *dua kali* sebanyak komentar seperti pingback, kami merubah permintaan::

source: To find all the entries where the rating of the entry is less than the sum of the pingback count and comment count, we would issue the query::
id: Untuk menemukan semua masukan dimana penilaian dari masukan sedikit dari penjumlahan hitungan pingback dan hitungan komentar, kami akan menerbitkan permintaan::

source: You can also use the double underscore notation to span relationships in an ``F()`` object. An ``F()`` object with a double underscore will introduce any joins needed to access the related object. For example, to retrieve all the entries where the author's name is the same as the blog name, we could issue the query::
id: Anda dapat juga menggunakan pernyataan garis bawah untuk menjangkau hubungan dalam sebuah obyek ``F()``. Sebuah obyek ``F()`` dengan garis bawah ganda akan memperkenalkan join apapun dibutuhkan untuk mengakses obyek terkait. Sebagai contoh, untuk mengambil semua masukan dimana nama penulis sama seperti nama blog, kami dapat menerbitkan permintaan::

source: For date and date/time fields, you can add or subtract a :class:`~datetime.timedelta` object. The following would return all entries that were modified more than 3 days after they were published::
id: Untuk bidang-bidang tanggal dan tanggal/waktu, anda dapat menambah atau mengurangi obyek :class:`~datetime.timedelta`. Berikut akan mengembalikan semua masukan yang telah diubah lebih dari 3 hari setelah mereka diterbitkan.

source: The ``F()`` objects support bitwise operations by ``.bitand()``, ``.bitor()``, ``.bitrightshift()``, and ``.bitleftshift()``. For example::
id: Obyek ``F()`` mendukung tindakan bitwise dengan `.bitand()``, ``.bitor()``, ``.bitrightshift()``, dan ``.bitleftshift()``. Sebagai contoh::

source: The ``pk`` lookup shortcut
id: Jalan pintas pencarian ``pk``

source: For convenience, Django provides a ``pk`` lookup shortcut, which stands for "primary key".
id: Untuk kemudahan, Django menyediakan jalan pintas pencarian ``pk``, yang berdiri untuk "primary key".

source: In the example ``Blog`` model, the primary key is the ``id`` field, so these three statements are equivalent::
id: Dalam contoh model ``Blog``, primary key adalah bidang ``id``, jadi pernyataan ini adalah setara::

source: The use of ``pk`` isn't limited to ``__exact`` queries -- any query term can be combined with ``pk`` to perform a query on the primary key of a model::
id: Penggunaan ``pk`` tidak terbatas pada permintaan ``__exact`` -- apapun istilah permintaan dapat dipadukan dengan ``pk`` untuk melakukan sebuah permintaan pada primary key pada model::

source: ``pk`` lookups also work across joins. For example, these three statements are equivalent::
id: Pencarian ``pk`` juga bekerja liintas join. Sebagai contoh, tiga pernyataan ini adalah setara::

source: Escaping percent signs and underscores in ``LIKE`` statements
id: Meloloskan tanda persen dan garis bawah dalam pernyataan ``LIKE``

source: The field lookups that equate to ``LIKE`` SQL statements (``iexact``, ``contains``, ``icontains``, ``startswith``, ``istartswith``, ``endswith`` and ``iendswith``) will automatically escape the two special characters used in ``LIKE`` statements -- the percent sign and the underscore. (In a ``LIKE`` statement, the percent sign signifies a multiple-character wildcard and the underscore signifies a single-character wildcard.)
id: Pencarian bidang yang menyerupai pernyataan SQL ``LIKE`` (``iexact``, ``contains``, ``icontains``, ``startswith``, ``istartswith``, ``endswith`` dan ``iendswith``)akan otomatis meloloskan dua karakter khusus digunakan dalam pernyataan ``LIKE`` -- tanda persen dan garis bawah. (Dalam sebuah pernyataan ``Like``, tanda persen menandakan wildcard banyak-karakter dan garis bawah menandakan wildcard karakter-tunggal.)

source: This means things should work intuitively, so the abstraction doesn't leak. For example, to retrieve all the entries that contain a percent sign, just use the percent sign as any other character::
id: Ini berarti hal-hal harus bekerja secara intuitif, jadi abstraksi tidak bocor. Sebagai contoh, untuk mengambil semua masukan yang mengandung tanda persen, cukup gunakan tanda persen sebagai katakter lain::

source: Django takes care of the quoting for you; the resulting SQL will look something like this:
id: Django menangani dari pengutipan untuk anda; menghasilkan SQL akan mencari sesuatu seperti ini:

source: Same goes for underscores. Both percentage signs and underscores are handled for you transparently.
id: Sama seperti garis bawah. Kedua tanda persen dan garis bawag ditangani untuk anda secara transparan.

source: Caching and ``QuerySet``\s
id: Cache dan ``QuerySet``

source: Each :class:`~django.db.models.query.QuerySet` contains a cache to minimize database access. Understanding how it works will allow you to write the most efficient code.
id: Setiap :class:`~django.db.models.query.QuerySet` mengandung sebuah tembolok untuk meminimalkan akses basisdata. Pahami bagaimana dia bekerja akan mengizinkan anda menulis kode paling efisien.

source: In a newly created :class:`~django.db.models.query.QuerySet`, the cache is empty. The first time a :class:`~django.db.models.query.QuerySet` is evaluated -- and, hence, a database query happens -- Django saves the query results in the :class:`~django.db.models.query.QuerySet`s cache and returns the results that have been explicitly requested (e.g., the next element, if the :class:`~django.db.models.query.QuerySet` is being iterated over). Subsequent evaluations of the :class:`~django.db.models.query.QuerySet` reuse the cached results.
id: Dalam :class:`~django.db.models.query.QuerySet` baru dibuat, cache kosong. Pertama kali sebuah :class:`~django.db.models.query.QuerySet` dinilai -- dan, karena itu, sebuah permintaan basisdata terjadi -- Django menyimpan hasil permintaan dalam cache :class:`~django.db.models.query.QuerySet` dan mengembalikan hasil yang telah secara jelas diminta (sebagai contoh, unsur selanjutnya, jika ada :class:`~django.db.models.query.QuerySet` sedang diulang). Penilaian selanjutnya dari :class:`~django.db.models.query.QuerySet` menggunakan hasil ter cache.

source: Keep this caching behavior in mind, because it may bite you if you don't use your :class:`~django.db.models.query.QuerySet`\s correctly. For example, the following will create two :class:`~django.db.models.query.QuerySet`\s, evaluate them, and throw them away::
id: Jaga perilaku cache ini dalam pikiran, karena itu mungkin mengigit anda jika anda tidak menggunakan :class:`~django.db.models.query.QuerySet` anda dengan benar. Sebagai contoh, berikut akan membuat dua :class:`~django.db.models.query.QuerySet`, nilai mereka, dan lemparkan mereka::

source: That means the same database query will be executed twice, effectively doubling your database load. Also, there's a possibility the two lists may not include the same database records, because an ``Entry`` may have been added or deleted in the split second between the two requests.
id: Itu berarti permintaan absisdata sama akan dijalankan dua kali, berhasil menggandakan muatan basisdata anda. Juga, ada kemungkinan dua daftar mungkin tidak meneyrtakan rekaman basisdata sama, karena ``Entry`` telah ditambahkan atau dihapus dalam pembagian kedua diantara dua permintaan.

source: To avoid this problem, simply save the :class:`~django.db.models.query.QuerySet` and reuse it::
id: Untuk menghindari masalah ini, cukup simpan :class:`~django.db.models.query.QuerySet` dan gunakan kembali ::

source: When ``QuerySet``\s are not cached
id: Ketika ``QuerySet`` tidak di cache

source: Querysets do not always cache their results. When evaluating only *part* of the queryset, the cache is checked, but if it is not populated then the items returned by the subsequent query are not cached. Specifically, this means that :ref:`limiting the queryset <limiting-querysets>` using an array slice or an index will not populate the cache.
id: Queryset tidak selalu cache hasil mereka. Ketika menilai hanya *bagian* dari queryset, cache diperiksa, tetapi jika tidak dikumpulkan kemudian barang-barang dikembalikan oleh permintaan selanjutnya tidak di cache. Secara khusus, ini berarti bahwa :ref:`limiting the queryset 1` menggunakan potongan senarai atau sebuah indeks tidak akan dikumpulkan cache.

source: For example, repeatedly getting a certain index in a queryset object will query the database each time::
id: Sebagi contoh, secara berulang mendapatkan indeks tertentu di queryset obyek akan meminta basisdata setiap waktu::

source: However, if the entire queryset has already been evaluated, the cache will be checked instead::
id: Bagaimanapun, jika keseluruhan queryset sudah dinilai, tembolok akan diperiksa sebagai gantinya::

source: Here are some examples of other actions that will result in the entire queryset being evaluated and therefore populate the cache::
id: Ini adalah beberapa contoh dari tindakan lain yang akan menghasilkan keseluruhan queryset yang sedang dinilai dan karena itu dikumpulkan tembolok::

source: Simply printing the queryset will not populate the cache. This is because the call to ``__repr__()`` only returns a slice of the entire queryset.
id: Mencetak sederhana queryset tidak akan mengumpulkan tembolok. Ini dikarenakan panggilan pada ``__repr__()`` hanya mengembalikan potongan dari keseluruhan queryset.

source: Complex lookups with ``Q`` objects
id: Pencarian rumit dengan obyek ``Q``

source: Keyword argument queries -- in :meth:`~django.db.models.query.QuerySet.filter`, etc. -- are "AND"ed together. If you need to execute more complex queries (for example, queries with ``OR`` statements), you can use :class:`Q objects <django.db.models.Q>`.
id: Permintaan argumen katakunci -- dalam :meth:`~django.db.models.query.QuerySet.filter`, dll. -- adalah "AND" bersama-sama. Jika anda buth menjalankan permintaan lebih rumit (sebagai contoh, permintaan dengan pernyataan ``OR``), anda dapat menggunakan :class:`Q objects <django.db.models.Q>`.

source: A :class:`Q object <django.db.models.Q>` (``django.db.models.Q``) is an object used to encapsulate a collection of keyword arguments. These keyword arguments are specified as in "Field lookups" above.
id: :class:`Q object <django.db.models.Q>` (``django.db.models.Q``) adalah sebuah obyek digunakan untuk membungkus koleksi dari argumen katakunci. Argumen katakunci ini ditentukan seperti dalam "Pencarian bidang" diatas.

source: For example, this ``Q`` object encapsulates a single ``LIKE`` query::
id: Sebagai contoh, obyek ``Q`` ini membungkus permintaan ``LIKE`` tunggal::

source: ``Q`` objects can be combined using the ``&`` and ``|`` operators. When an operator is used on two ``Q`` objects, it yields a new ``Q`` object.
id: Obyek ``Q`` dapat dipadukan menggunakan penghubung ``&`` dan ``|``. Ketika sebuah penghubung digunakan pada dua obyek ``Q``, itu menghasilkan obyek ``Q`` baru.

source: For example, this statement yields a single ``Q`` object that represents the "OR" of two ``"question__startswith"`` queries::
id: Sebagai contoh, pernyataan ini menghasilkan obyek ``Q`` tunggal yang mewakili "OR" atau dua permintaan ``"question__startswith"`` ::

source: This is equivalent to the following SQL ``WHERE`` clause::
id: Ini sama pada klausa SQL ``WHERE`` berikut::

source: You can compose statements of arbitrary complexity by combining ``Q`` objects with the ``&`` and ``|`` operators and use parenthetical grouping. Also, ``Q`` objects can be negated using the ``~`` operator, allowing for combined lookups that combine both a normal query and a negated (``NOT``) query::
id: Anda dapat menyusun pernyataan dari kerumitan yang berubah-ubah dengan memadukan obyek ``Q`` dengan penghubung ``&`` and ``|`` dan gunakan pengelompokan yang disipkan. Juga, obyek ``Q`` dapat ditugaskan menggunakan penghubung ``~``, mengizinkan perpaduan pencarian yang memadukan kedua permintaan normal dan meniadakan permintaan (``NOT``)::

source: Each lookup function that takes keyword-arguments (e.g. :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude`, :meth:`~django.db.models.query.QuerySet.get`) can also be passed one or more ``Q`` objects as positional (not-named) arguments. If you provide multiple ``Q`` object arguments to a lookup function, the arguments will be "AND"ed together. For example::
id: Setiap fungsi pencarian yang mengambil argumen-kata kunci (sebagai contoh :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude`, :meth:`~django.db.models.query.QuerySet.get`) dapat juga melewatkan satu atau lebih obyek ``Q`` sebagai argumen (tidak-dinamai) kedudukan. Jika anda menyediakan banyak argumen obyek ``Q`` pada fungsi pencarian, argumen akan di "AND"kan bersama-sama. Sebagai contoh::

source: ... roughly translates into the SQL::
id: ... kurang lebih menterjemahkan ke dalam SQL::

source: Lookup functions can mix the use of ``Q`` objects and keyword arguments. All arguments provided to a lookup function (be they keyword arguments or ``Q`` objects) are "AND"ed together. However, if a ``Q`` object is provided, it must precede the definition of any keyword arguments. For example::
id: Fungsi pencarian dapat mencampurkan penggunaan obyek ``Q`` dan argumen kata kunci. Semua argumen disediakan untuk fungsi pencarian (menjadi mereka argumen kata kunci atau obyek ``Q``) di "AND"kan bersama-sama. Bagaimanapun, jika obyek ``Q`` disediakan, dia harus mendahului pengertian dari argumen kata kunci apapun. Sebagai contoh::

source: ... would be a valid query, equivalent to the previous example; but::
id: ... akan menjadi permintaan sah, sama pada contoh sebelumnya; tetapi::

source: ... would not be valid.
id: ... tidak akan menjadi sah.

source: The `OR lookups examples`_ in the Django unit tests show some possible uses of ``Q``.
id: `OR lookups examples`_ dalam satuan percobaan Django menampilkan beberapa kemungkinan penggunaan dari ``Q``.

source: Comparing objects
id: Membandingkan obyek

source: To compare two model instances, just use the standard Python comparison operator, the double equals sign: ``==``. Behind the scenes, that compares the primary key values of two models.
id: Untuk membandingkan dua model instance, cukup gunakan penghubung perbandingan standar Python, tanda sama dengan ganda: ``==``. Dibelakang layar, yang membandingkan nilai primary key dari dua model.

source: Using the ``Entry`` example above, the following two statements are equivalent::
id: Menggunakan contoh ``Entry`` diatas, dua pernyataan berikut adalah setara::

source: If a model's primary key isn't called ``id``, no problem. Comparisons will always use the primary key, whatever it's called. For example, if a model's primary key field is called ``name``, these two statements are equivalent::
id: Jika sebuah primary key model tidak memanggil ``id``, tidak masalah. Perbandingan akan selalu menggunakan primary key, apapun itu memanggilnya. Sebagai contoh, jika sebuah primary key model dipanggil ``name``, dua pernyataan ini adalah setara::

source: Deleting objects
id: menghapus obyek

source: The delete method, conveniently, is named :meth:`~django.db.models.Model.delete`. This method immediately deletes the object and returns the number of objects deleted and a dictionary with the number of deletions per object type. Example::
id: Untuk menghapus metode, mudah, adalah bernama :meth:`~django.db.models.Model.delete`. Metode ini segera menghapus obyek dan mengembalikan sejumlah obyek yang dihapus dan sebuah kamus dengan sejumlah penghapusan per jenis obyek. Contoh::

source: You can also delete objects in bulk. Every :class:`~django.db.models.query.QuerySet` has a :meth:`~django.db.models.query.QuerySet.delete` method, which deletes all members of that :class:`~django.db.models.query.QuerySet`.
id: Anda dapat juga menghapus obyek dalam jumlah besar. Setiap :class:`~django.db.models.query.QuerySet` mempunyai sebuah :meth:`~django.db.models.query.QuerySet.delete` method, yang menghapus semua anggota dari :class:`~django.db.models.query.QuerySet` tersebut.

source: For example, this deletes all ``Entry`` objects with a ``pub_date`` year of 2005::
id: Sebagai contoh, ini menghapus semua obyek ``Entry`` dengan tahun ``pub-date`` dari 2005::

source: Keep in mind that this will, whenever possible, be executed purely in SQL, and so the ``delete()`` methods of individual object instances will not necessarily be called during the process. If you've provided a custom ``delete()`` method on a model class and want to ensure that it is called, you will need to "manually" delete instances of that model (e.g., by iterating over a :class:`~django.db.models.query.QuerySet` and calling ``delete()`` on each object individually) rather than using the bulk :meth:`~django.db.models.query.QuerySet.delete` method of a :class:`~django.db.models.query.QuerySet`.
id: Ingat bahwa ini akan, ketika memungkinkan, akan dijalankan murni dalam SQL, dan juga cara ``delete()`` dari instance tidak akan perlu dipanggil selama pengolahan. Jika anda telah menyediakan cara ``delete()`` disesuaikan pada sebuah kelas model dan ingin memastikan bahwa dia dipanggil, anda akan butuh "secara manual" menghapus instance dari model tersebut (sebagai contoh, dengan perulangan terhadap :class:`~django.db.models.query.QuerySet` dan memanggil ``delete()`` pada setiap obyek secara tersendiri) daripada menggunakan dalam jumlah besar cara :meth:`~django.db.models.query.QuerySet.delete` dari sebuah :class:`~django.db.models.query.QuerySet`.

source: When Django deletes an object, by default it emulates the behavior of the SQL constraint ``ON DELETE CASCADE`` -- in other words, any objects which had foreign keys pointing at the object to be deleted will be deleted along with it. For example::
id: Ketika DJANGO menghapus sebuah obyek, secara awal dia meniru kebiasaan batasan SQL ``ON DELETE CASCADE`` -- dalam kata lain, obyek apapun yang mempunyai foreign key menunjuk pada obyek yang akan dihapus akan dihapus bersama dengannya. Sebagai contoh::

source: This cascade behavior is customizable via the :attr:`~django.db.models.ForeignKey.on_delete` argument to the :class:`~django.db.models.ForeignKey`.
id: Kebiasaan turunan ini dapat di sesuaikan melalui argumen :attr:`~django.db.models.ForeignKey.on_delete` ke :class:`~django.db.models.ForeignKey`.

source: Note that :meth:`~django.db.models.query.QuerySet.delete` is the only :class:`~django.db.models.query.QuerySet` method that is not exposed on a :class:`~django.db.models.Manager` itself. This is a safety mechanism to prevent you from accidentally requesting ``Entry.objects.delete()``, and deleting *all* the entries. If you *do* want to delete all the objects, then you have to explicitly request a complete query set::
id: Catat bahwa :meth:`~django.db.models.query.QuerySet.delete` adalah hanya cara :class:`~django.db.models.query.QuerySet` yang tidak ditunjukkan pada :class:`~django.db.models.Manager` itu sendiri. Ini adalah mekanisme aman untuk mencegah anda dari kecelakaan permintaan ``Entry.objects.delete()``, dan menghapus *semua* masukan. Jika anda ingin *melakukan* menghapus semua obyek, kemudian anda harus secara jelas meminta kumpulan permintaan lengkap::

source: Copying model instances
id: Menyalin instance model

source: Although there is no built-in method for copying model instances, it is possible to easily create new instance with all fields' values copied. In the simplest case, you can just set ``pk`` to ``None``. Using our blog example::
id: Meskipun tidak ada metode siap-pakai untuk menyalin instance model, itu memungkinkan untuk dengan mudah membuat instance baru dengan semua nilai-nilai bidang disalin. Dalam kasus termudah, anda dapat cukup menyetel ``pk`` menjadi ``None``. Menggunakan contoh blog kami::
