Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: You may need this if authentication for your application takes place against an existing external source such as an LDAP directory.
id: Anda mungkin butuh ini jika otentifikasi untuk aplikasi anda memakan tempat terhadap sumber luar yang ada seperti pelipat LDAP.

source: Returns ``False`` if :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` has been called for this user.
id: Mengembalikan ``False`` jika :meth:`~django.contrib.auth.models.AbstractBaseUser.set_unusable_password()` telah dipanggil untuk pengguna ini.

source: Returns an HMAC of the password field. Used for :ref:`session-invalidation-on-password-change`.
id: Mengembalikan nilai HMAC dari kolom kata sandi. Digunakan untuk :ref:`session-invalidation-on-password-change`.

source: :class:`~models.AbstractUser` subclasses :class:`~models.AbstractBaseUser`:
id: :class:`~models.AbstractUser` subkelas :class:`~models.AbstractBaseUser`:

source: Normalizes the email by calling :meth:`.BaseUserManager.normalize_email`. If you override this method, be sure to call ``super()`` to retain the normalization.
id: Normalisasikan surel dengan memanggil :meth:`BaseUserManager.normalize_email`. Jika anda menimpa cara ini, pastikan memanggil ``super()`` untuk menahan normalisasi.

source: You should also define a custom manager for your user model. If your user model defines ``username``, ``email``, ``is_staff``, ``is_active``, ``is_superuser``, ``last_login``, and ``date_joined`` fields the same as Django's default user, you can just install Django's :class:`~django.contrib.auth.models.UserManager`; however, if your user model defines different fields, you'll need to define a custom manager that extends :class:`~django.contrib.auth.models.BaseUserManager` providing two additional methods:
id: Anda harus juga menentukan penyesuaian pengelola untuk model user anda. Jika model user anda menentukan bidang ``username``, ``email``, ``is_staff``, ``is_active``, ``is_superuser``, ``last_login``, dan ``date_joined`` sama seperti pengguna awalan Django, anda dapat cukup memasang :class:`~django.contrib.auth.models.UserManager` Django; bagaimanapun, jika model user anda menentukan bidang berbeda, anda akan butuh menentukan penyesuaian pengelola yang memperpanjang :class:`~django.contrib.auth.models.BaseUserManager` menyediakan dua metode tambahan:

source: The prototype of ``create_user()`` should accept the username field, plus all required fields as arguments. For example, if your user model uses ``email`` as the username field, and has ``date_of_birth`` as a required field, then ``create_user`` should be defined as::
id: Sifat dari ``create_user()`` harus menerima bidang nama pengguna, ditambah semua bidang wajib sebagai argumen. Sebagai contoh, jika model pengguna anda menggunakan ``email`` sebagai bidang nama pengguna, dan mempunyai ``date_of_birth`` sebagai bidang wajib, kemudian ``create_user`` harus ditentukan sebagai::

source: The prototype of ``create_superuser()`` should accept the username field, plus all required fields as arguments. For example, if your user model uses ``email`` as the username field, and has ``date_of_birth`` as a required field, then ``create_superuser`` should be defined as::
id: Sifat dari ``create_superuser()`` harus menerima bidang nama pengguna, ditambah semua bidang wajib sebagai argumen. Sebagai contoh, jika model pengguna anda menggunakan ``email`` sebagai bidang nama pengguna, dan mempunyai ``date_of_birth`` sebagai bidang wajib, kemudian ``create_superuser`` harus ditentukan sebagai::

source: Unlike ``create_user()``, ``create_superuser()`` *must* require the caller to provide a password.
id: Tidak seperti ``create_user()``, ``create_superuser()`` *harus* membutuhkan pemanggil untuk menyedianan sebuah sandi.

source: :class:`~django.contrib.auth.models.BaseUserManager` provides the following utility methods:
id: :class:`~django.contrib.auth.models.BaseUserManager` menyediakan cara kegunaan berikut:

source: Normalizes email addresses by lowercasing the domain portion of the email address.
id: Menormalkan alamat surel dengan menghuruf kecilkan bagian ranah dari alamat surel.

source: Retrieves a user instance using the contents of the field nominated by ``USERNAME_FIELD``.
id: Mengambil instance pengguna menggunakan isi dari bidang dicalonkan oleh ``USERNAME_FIELD``.

source: Returns a random password with the given length and given string of allowed characters. Note that the default value of ``allowed_chars`` doesn't contain letters that can cause user confusion, including:
id: Mengembalikan sandi acak dengan panjang yang diberikan dan deretan karakter yang diberikan dari karakter yang diizinkan. Catat bahwa nilai awal dari ``allowed_chars`` tidak mengandung huruf yang dapat menyebabkan pengguna bingung, termasuk:

source: ``i``, ``l``, ``I``, and ``1`` (lowercase letter i, lowercase letter L, uppercase letter i, and the number one)
id: ``i``, ``l``, ``I``, and ``1`` (huruf kecil i, huruf kecil L, huruf besar i, dan angka satu)

source: ``o``, ``O``, and ``0`` (lowercase letter o, uppercase letter o, and zero)
id: ``o``, ``O``, and ``0`` (huruf kecil o, huruf besar o, dan nol)

source: Extending Django's default ``User``
id: Memperpanjang ``User`` awal Django

source: If you're entirely happy with Django's :class:`~django.contrib.auth.models.User` model and you just want to add some additional profile information, you could simply subclass :class:`django.contrib.auth.models.AbstractUser` and add your custom profile fields, although we'd recommend a separate model as described in the "Model design considerations" note of :ref:`specifying-custom-user-model`. ``AbstractUser`` provides the full implementation of the default :class:`~django.contrib.auth.models.User` as an :ref:`abstract model <abstract-base-classes>`.
id: Jika anda sepenuhnya senang dengan model :class:`~django.contrib.auth.models.User` Django dan anda hanya ingin menambahkan beberapa informasi profil tambahan, anda dapat mensubkelaskan :class:`django.contrib.auth.models.AbstractUser` dan menambah penyesuaian bidang profil anda, meskipun kami telah menganjurkan model terpisah seperti digambarkan di catatan "Model design considerations" dari :ref:`specifying-custom-user-model`. ``AbstractUser`` menyediakan penerapan penuh dari awalan :class:`~django.contrib.auth.models.User` sebagai sebuah :ref:`abstract model <abstract-base-classes>`.

source: Custom users and the built-in auth forms
id: Penyesuaian pengguna dan formulir otentifikasi siap-pakai

source: Django's built-in :ref:`forms <built-in-auth-forms>` and :ref:`views <built-in-auth-views>` make certain assumptions about the user model that they are working with.
id: SIap-pakai Django :ref:`forms <built-in-auth-forms>` dan :ref:`views <built-in-auth-views>` membuat pendapat tertentu tentang model user yang mereka bekerja dengannya.

source: The following forms are compatible with any subclass of :class:`~django.contrib.auth.models.AbstractBaseUser`:
id: Bentuk berikut cocok dengan subkelas apapun dari :class:`~django.contrib.auth.models.AbstractBaseUser`:

source: :class:`~django.contrib.auth.forms.AuthenticationForm`: Uses the username field specified by :attr:`~models.CustomUser.USERNAME_FIELD`.
id: :class:`~django.contrib.auth.forms.AuthenticationForm`: Menggunakan bidang nama pengguna ditentukan oleh :attr:`~models.CustomUser.USERNAME_FIELD`.

source: The following forms make assumptions about the user model and can be used as-is if those assumptions are met:
id: Formulir berikut membuat pendapat tentang model user dan dapat digunakan dengan adanya jika pendapat tersebut dipenuhi:

source: :class:`~django.contrib.auth.forms.PasswordResetForm`: Assumes that the user model has a field that stores the user's email address with the name returned by :meth:`~models.AbstractBaseUser.get_email_field_name` (``email`` by default) that can be used to identify the user and a boolean field named ``is_active`` to prevent password resets for inactive users.
id: :class:`~django.contrib.auth.forms.PasswordResetForm`: Beranggapan bahwa model user mempunyai sebuah bidang yang menyimpan alamat surel pengguna dengan nama dikembalikan oleh :meth:`~models.AbstractBaseUser.get_email_field_name` (``email`` secara awalan) yang dapat digunakan untuk mencirikan pengguna dan bidang boolean bernama ``is_active`` untuk mencegah penyetelan kembali sandi untuk pengguna tidak aktif.

source: Finally, the following forms are tied to :class:`~django.contrib.auth.models.User` and need to be rewritten or extended to work with a custom user model:
id: Akhirnya, formulir berikut diikat pada :class:`~django.contrib.auth.models.User` dan butuh ditulis kembali atau diperpanjang untuk bekerja dengan penyesuaian model user:

source: If your custom user model is a simple subclass of ``AbstractUser``, then you can extend these forms in this manner::
id: Jika penyesuaian model user anda adalah subkelas sederhana dari ``AbstractUser``, kemudian anda dapat memperpanjang formulir ini di sikap ini::

source: Custom users and :mod:`django.contrib.admin`
id: Penyesuaian pengguna dan :mod:`django.contrib.admin`

source: If you want your custom user model to also work with the admin, your user model must define some additional attributes and methods. These methods allow the admin to control access of the user to admin content:
id: Jika anda ingin penyesuaian model user anda juga bekerja dengan admin, model user anda harus menentukan beberapa atribut dan metode tambahan. Cara ini mengizinkan admin mengendalikan akses user ke isi admin:

source: Returns ``True`` if the user is allowed to have access to the admin site.
id: Mengembalikan ``True`` jika pengguna diizinkan mempunyai akses ke situs admin

source: Returns ``True`` if the user account is currently active.
id: Mengembalikan ``True`` jika akun pengguna saat ini aktif.

source: Returns ``True`` if the user has the named permission. If ``obj`` is provided, the permission needs to be checked against a specific object instance.
id: Mengembalikan ``True`` jika pengguna mempunyai perizinan nama. Jika ``obj`` disediakan, perizinan butuh diperiksa terhadap instace obyek tertentu.

source: Returns ``True`` if the user has permission to access models in the given app.
id: Mengembalikan ``True`` jika pengguna mempunyai perizinan untuk mengakses model pada aplikasi yang diberikan.

source: You will also need to register your custom user model with the admin. If your custom user model extends ``django.contrib.auth.models.AbstractUser``, you can use Django's existing ``django.contrib.auth.admin.UserAdmin`` class. However, if your user model extends :class:`~django.contrib.auth.models.AbstractBaseUser`, you'll need to define a custom ``ModelAdmin`` class. It may be possible to subclass the default ``django.contrib.auth.admin.UserAdmin``; however, you'll need to override any of the definitions that refer to fields on ``django.contrib.auth.models.AbstractUser`` that aren't on your custom user class.
id: Anda akan juga butuh mendaftarkan model pengguna penyesuaian anda dengan admin. Jika model pengguna penyesuaian anda memperpanjang ``django.contrib.auth.models.AbstractUser``, anda dapat menggunakan kelas ``django.contrib.auth.admin.UserAdmin`` yang ada dari Django. Bagaimanapun, jika model pengguna anda memperpanjang :class:`~django.contrib.auth.models.AbstractBaseUser`, anda akan butuh menentukan kelas ``ModelAdmin`` penyesuaian. Itu memungkinkan untuk mensubkelaskan awalan ``django.contrib.auth.admin.UserAdmin``; bagaimanapun, anda akan butuh menimpa tiap pengertian yang mengacu ke bidang pada ``django.contrib.auth.models.AbstractUser`` yang tidak pada kelas pengguna penyesuaian anda.

source: Custom users and permissions
id: Penyesuaian pengguna dan perizinan

source: To make it easy to include Django's permission framework into your own user class, Django provides :class:`~django.contrib.auth.models.PermissionsMixin`. This is an abstract model you can include in the class hierarchy for your user model, giving you all the methods and database fields necessary to support Django's permission model.
id: Untuk membuatnya lebih mudah untuk menyertakan kerangka kerja perizinan Django kedalam kelas user anda sendiri, Django menyediakan :class:`~django.contrib.auth.models.PermissionsMixin`. Ini adalah model abstrak anda dapat sertakan di susunan tingkat kelas untuk model user anda. memberikan anda semua metode dan bidang basisdata yang diperlukan untuk mendukung model perizinan Django.

source: :class:`~django.contrib.auth.models.PermissionsMixin` provides the following methods and attributes:
id: :class:`~django.contrib.auth.models.PermissionsMixin` menyediakan cara dan atribut berikut:

source: Boolean. Designates that this user has all permissions without explicitly assigning them.
id: Boolean. Menunjuk bahwa pengguna ini mempunyai semua perizinan tanpa secara jelas menetapkan mereka.

source: Returns a set of permission strings that the user has, through their groups.
id: Mengembalikan deretan karakter kumpulan perizinan yang pengguna punyai, melalui kelompok mreka.

source: If ``obj`` is passed in, only returns the group permissions for this specific object.
id: Jika ``obj`` diloloskan, hanya mengembalikan perizinan kelompok untuk obyek tertentu ini.

source: Returns a set of permission strings that the user has, both through group and user permissions.
id: Mengembalikan sekumpulan deretan karakter perizinan yang pengguna punyai, kedua melalui perizinan kelompok dan pengguna.

source: If ``obj`` is passed in, only returns the permissions for this specific object.
id: Jika ``obj`` diloloskan. hanya mengembalikan perizinan untuk obyek tertentu ini.

source: Returns ``True`` if the user has the specified permission, where ``perm`` is in the format ``"<app label>.<permission codename>"`` (see :ref:`permissions <topic-authorization>`). If the user is inactive, this method will always return ``False``.
id: Mengembalikan ``True`` jika pengguna mempunyai perizinan tertentu, dimana ``perm`` dalam bentuk ``"<app label>.<permission codename>"`` (lihat :ref:`permissions <topic-authorization>`). Jika pengguna tidak aktif, metode ini akan selalu mengembalikan ``False``.

source: If ``obj`` is passed in, this method won't check for a permission for the model, but for this specific object.
id: Jika ``obj`` diloloskan, metode ini tidak akan memeriksa untuk sebuah perizinan untuk model, tetapi untuk obyek tertentu ini.

source: Returns ``True`` if the user has each of the specified permissions, where each perm is in the format ``"<app label>.<permission codename>"``. If the user is inactive, this method will always return ``False``.
id: Mengembalikan ``True`` jika pengguna mempunyai setiap perizinan tertentu, dimana setiap perizinan dalam bentuk ``"<app label>.<permission codename>"``. Jika pengguna tidak aktif, metode ini akan selalu mengembalikan ``False``.

source: If ``obj`` is passed in, this method won't check for permissions for the model, but for the specific object.
id: Jika ``obj`` diloloskan, metode ini tidak akan memeriksa untuk perizinan-perizinan untuk model, tetapi untuk obyek tertentu.

source: Returns ``True`` if the user has any permissions in the given package (the Django app label). If the user is inactive, this method will always return ``False``.
id: Mengembalikan ``True`` jika pengguna mempunyai perizinan apapun di paket yang diberikan (label aplikasi Django). Jika pengguna tidak aktif, cara ini akan selalu mengembalikan ``False``.

source: ``PermissionsMixin`` and ``ModelBackend``
id: ``PermissionsMixin`` dan ``ModelBackend``

source: If you don't include the :class:`~django.contrib.auth.models.PermissionsMixin`, you must ensure you don't invoke the permissions methods on ``ModelBackend``. ``ModelBackend`` assumes that certain fields are available on your user model. If your user model doesn't provide those fields, you'll receive database errors when you check permissions.
id: Jika anda tidak menyertakan :class:`~django.contrib.auth.models.PermissionsMixin`, anda harus memastikan anda tidak meminta metode perizinan pada ``ModelBackend``. ``ModelBackend`` menggangap bahwa bidang tertentu itu tersedia di model user anda. Jika model user anda tidak menyediakan bidang tersebut, anda akan menerima kesalahan basisdata ketika anda memeriksa perizinan.

source: Custom users and proxy models
id: Penyesuaian pengguna dan model proxy

source: One limitation of custom user models is that installing a custom user model will break any proxy model extending :class:`~django.contrib.auth.models.User`. Proxy models must be based on a concrete base class; by defining a custom user model, you remove the ability of Django to reliably identify the base class.
id: Satu batasan dari penyesuaian model user adalah bahwa memasang penyesuaian model user akan memutus tiap model proxy memperpanjang :class:`~django.contrib.auth.models.User`. Model proxy harus berdasarkan pada kelas dasar nyata; dengan menentukan penyesuaian model user, anda memindah kemampuan dari Django untuk menciri yang handal kelas dasar.

source: If your project uses proxy models, you must either modify the proxy to extend the user model that's in use in your project, or merge your proxy's behavior into your :class:`~django.contrib.auth.models.User` subclass.
id: Jika proyek anda menggunakan model proxy, anda harus salah satu merubah proxy untuk memperpanjang model yser yang digunakan di proyek anda, atau menggabungkan kebiasaan proxy anda kedalam subkelas :class:`~django.contrib.auth.models.User`.

source: A full example
id: Sebuah contoh penuh

source: Here is an example of an admin-compliant custom user app. This user model uses an email address as the username, and has a required date of birth; it provides no permission checking, beyond a simple ``admin`` flag on the user account. This model would be compatible with all the built-in auth forms and views, except for the user creation forms. This example illustrates how most of the components work together, but is not intended to be copied directly into projects for production use.
id: Ini adalah sebuah contoh dari admin-compliant aplikasi pengguna penyesuaian. Model pengguna ini menggunakan sebuah alamat surel sebagai nama pengguna, dan mempunyai tanggal lahir wajib; itu tidak menyediakan pemeriksaan perizinan, diluar bendera ``admin`` sederhana pada akun pengguna. Modl ini akan cocok dengan semua formulir otentifikasi pasang-tetap, kecuali untuk formulir pembuatan pengguna. Contoh ini menggambarkan bagaimana kebanyakan komponen bekerja bersama-sama, tetapi tidak cenderung menyalin secara langsung kedalam proyej untuk penggunaan produksi.

source: This code would all live in a ``models.py`` file for a custom authentication app::
id: Kode ini akan semua tinggal di berkas ``models.py`` untuk aplikasi otentifikasi penyesuaian::

source: Then, to register this custom user model with Django's admin, the following code would be required in the app's ``admin.py`` file::
id: Kemudian, untuk mendaftar model pengguna penyesuaian dengan admin Django, kode berikut akan diwajibkan di berkas ``admin.py`` aplikasi::

source: Finally, specify the custom model as the default user model for your project using the :setting:`AUTH_USER_MODEL` setting in your ``settings.py``::
id: Akhirnya, tentukan model penyesuaian sebagai model pengguna awal untuk proyek anda menggunakan pengaturan :setting:`AUTH_USER_MODEL` di ``settings.py`` anda::

source: Using the Django authentication system
id: Menggunakan sistem pembuktian keaslian Django

source: This document explains the usage of Django's authentication system in its default configuration. This configuration has evolved to serve the most common project needs, handling a reasonably wide range of tasks, and has a careful implementation of passwords and permissions. For projects where authentication needs differ from the default, Django supports extensive :doc:`extension and customization </topics/auth/customizing>` of authentication.
id: Dokumen ini menjelaskan penggunaan dari sistem otentifikasi Django di konfigurasi awalannya. Konfigurasi ini telah berkembang untuk melayani kebutuhan proyek paling umum, menangani jangkauan luas beralasan dari tugas, dan mempunyai penerapan cermat dari sandi dan perizinan. Untuk proyek dimana otentifikasi butuh berbeda dari awalan, Django mendukung :doc:`extension and customization </topics/auth/customizing>` luas dari otentifikasi.

source: Django authentication provides both authentication and authorization together and is generally referred to as the authentication system, as these features are somewhat coupled.
id: Otentifikasi Django menyediakan kedua otentifikasi dan otorisasi bersama-sama dan umumnya mengacu pada sebagai sistem otentifikasi, ketika fitur ini agak digabungkan.

source: ``User`` objects
id: Obyek ``User``

source: :class:`~django.contrib.auth.models.User` objects are the core of the authentication system. They typically represent the people interacting with your site and are used to enable things like restricting access, registering user profiles, associating content with creators etc. Only one class of user exists in Django's authentication framework, i.e., :attr:`'superusers' <django.contrib.auth.models.User.is_superuser>` or admin :attr:`'staff' <django.contrib.auth.models.User.is_staff>` users are just user objects with special attributes set, not different classes of user objects.
id: Obyek :class:`~django.contrib.auth.models.User` adalah inti dari sistem autentifikasi. Mereka khususnya mewakili orang berinteraksi dengan situs anda dan digunakan untuk mengadakan hal-hal seperti membatasi akses, mendaftarkan profil pengguna, menyatukan isi dengan pembuat dll. Hanya satu kelas dari pengguna yang ada di otentifikasi kerangka kerja Django, yaitu, :attr:`'superusers' <django.contrib.auth.models.User.is_superuser>` atau admin pengguna :attr:`'staff' <django.contrib.auth.models.User.is_staff>` hanya obyek user dengan sekumpulan atribut khusus, bukan kelas-kelas berbeda dari obyek user.

source: The primary attributes of the default user are:
id: Atribut utama dari pengguna awal adalah:

source: See the :class:`full API documentation <django.contrib.auth.models.User>` for full reference, the documentation that follows is more task oriented.
id: Lihat :class:`full API documentation <django.contrib.auth.models.User>`untuk acuan penuh, dokumentasi yang mengikuti lebih berorientasi tugas.

source: Creating users
id: Membuat pengguna

source: The most direct way to create users is to use the included :meth:`~django.contrib.auth.models.UserManager.create_user` helper function::
id: Cara paling langsung untuk membuat pengguna adalah menggunakan fungsi pembantu :meth:`~django.contrib.auth.models.UserManager.create_user` yang disertakan::

source: If you have the Django admin installed, you can also :ref:`create users interactively <auth-admin>`.
id: Jika anda mempunai admin Django dipasang, anda dapat juga :ref:`create users interactively <auth-admin>`.

source: Creating superusers
id: Membuat pengguna hebat

source: Create superusers using the :djadmin:`createsuperuser` command::
id: Membuat pengguna hebat menggunakan perintah :djadmin:`createsuperuser`::

source: You will be prompted for a password. After you enter one, the user will be created immediately. If you leave off the :option:`--username <createsuperuser --username>` or :option:`--email <createsuperuser --email>` options, it will prompt you for those values.
id: Anda akan diminta untuk sandi. Setelah anda memasukkan satu, pengguna akan membuat dengan segera. Jika anda membiarkan mati pilihan :option:`--username <createsuperuser --username>` atau :option:`--email <createsuperuser --email>`, itu akan meminta anda untuk nilai-nilai tersebut.

source: Changing passwords
id: Merubah sandi
