Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The framework is flexible and allows you to write functions that perform any other kind of check you may require. The following is an example stub check function::
id: Kerangka kerja fleksibel dan mengizinkan anda menulis fungsi-fungsi yang melakukan jenis lain pemeriksaan anda mungkin butuhkan. Berikut adalah sebuah contoh potongan fungsi pemeriksaan::

source: The check function *must* accept an ``app_configs`` argument; this argument is the list of applications that should be inspected. If None, the check must be run on *all* installed apps in the project. The ``**kwargs`` argument is required for future expansion.
id: Fungsi pemeriksaan *harus* menerima sebuah argumen ``app_configs``; argumen ini adalah daftar dari aplikasi yang harus diperiksa. Jika None, pemeriksaan harus berjalan pada *semua* aplikasi terpasang di proyek. Argumen ``**kwargs`` diwajibkan untuk perluasan masa depan.

source: Messages
id: Pesan

source: The function must return a list of messages. If no problems are found as a result of the check, the check function must return an empty list.
id: Fungsi harus mengembalikan sebuah daftar pesan. Jika tidak ada masalah ditemukan sebagai hasil dari pemeriksaan, fungsi pemeriksaaan harus mengembalikan sebuah daftar kosong.

source: The warnings and errors raised by the check method must be instances of :class:`~django.core.checks.CheckMessage`. An instance of :class:`~django.core.checks.CheckMessage` encapsulates a single reportable error or warning. It also provides context and hints applicable to the message, and a unique identifier that is used for filtering purposes.
id: Peringatan dan kesalahan dimunculkan oleh metode pemeriksaan harus berupa instance dari :class:`~django.core.checks.CheckMessage`. Sebuah instance dari :class:`~django.core.checks.CheckMessage` membungkus kesalahan tunggal dilaporkan atau peringatan. Itu juga menyediakan konteks dan petunjuk dapat diterapkan ke pesan, dan penciri unik yang digunakan untuk tujuan penyaringan.

source: The concept is very similar to messages from the :doc:`message framework </ref/contrib/messages>` or the :doc:`logging framework </topics/logging>`. Messages are tagged with a ``level`` indicating the severity of the message.
id: Konsep sangat mirip ke pasan dari :doc:`message framework </ref/contrib/messages>` atau the :doc:`logging framework </topics/logging>`. Pesan-pesan dietiket dengan ``level`` menunjukkan kekerasan pesan.

source: There are also shortcuts to make creating messages with common levels easier. When using these classes you can omit the ``level`` argument because it is implied by the class name.
id: Ada juga jalan pintas untuk membuat pesan dengan tingkatan umum lebih mudah. Ketika menggunakan kelas-kelas ini anda dapat menghilangkan argumen ``level`` karena itu disisipkan oleh nama kelas.

source: Registering and labeling checks
id: Mendaftarkan dan melabeli pemeriksaan

source: Lastly, your check function must be registered explicitly with system check registry. Checks should be registered in a file that's loaded when your application is loaded; for example, in the :meth:`AppConfig.ready() <django.apps.AppConfig.ready>` method.
id: Akhirnya, fungsi pemeriksaan anda harus terdaftar jelas dengan sistem pemeriksaan regristrar. Pemeriksaan harus didaftarkan dalam sebuah berkas yang dimuat ketika aplikasi anda dimuat; sebagai contoh, di metode :meth:`AppConfig.ready() <django.apps.AppConfig.ready>`.

source: You can pass as many tags to ``register`` as you want in order to label your check. Tagging checks is useful since it allows you to run only a certain group of checks. For example, to register a compatibility check, you would make the following call::
id: Anda dapat melewatkan sebanyak etiket ke ``register`` seperti anda inginkan untuk melabelkan pemeriksaan anda. Pemeriksaan etiket sangat berguna sejak itu mengizinkan anda menjalankan hanya kelompok tertentu dari pemeriksaan. Sebagai contoh, untuk mendaftar pemeriksaan kesesuaian, anda akan membuat panggilan berikut::

source: You can register "deployment checks" that are only relevant to a production settings file like this::
id: Anda dapat mendaftar "deployment checks" yang hanya bersangkutan pada berkas pengaturan produksi seperti ini::

source: These checks will only be run if the :option:`check --deploy` option is used.
id: Pemeriksaan ini hanya akan dijalankan jika pilihan :option:`check --deploy` digunakan.

source: You can also use ``register`` as a function rather than a decorator by passing a callable object (usually a function) as the first argument to ``register``.
id: Anda dapat juga menggunakan ``register`` sebagai sebuah fungsi daripada sebuah penghias dengan melewatkan obyek callable (biasanya sebuah fungsi) sebagai argumen pertama pada ``register``

source: The code below is equivalent to the code above::
id: Kode dibawah ini setara dengan kode diatas::

source: Field, model, manager, and database checks
id: Pemeriksaan bidang, model, pengelola, dan basisdata.

source: In some cases, you won't need to register your check function -- you can piggyback on an existing registration.
id: Dalam beberapa kasus, anda tidak butuh mendaftar fungsi pemeriksaan anda -- anda dapat mendukung pada pendaftaran yang ada.

source: Fields, models, model managers, and database backends all implement a ``check()`` method that is already registered with the check framework. If you want to add extra checks, you can extend the implementation on the base class, perform any extra checks you need, and append any messages to those generated by the base class. It's recommended that you delegate each check to separate methods.
id: Bidang, model, pengeloal model, dan backend basisdata semua menerapkan metode ``check()`` yang sudah terdaftar dengan kerangka kerja pemeriksaan. Jika anda ingin menambahkan pemeriksaan tambahan, anda dapat memperpanjang penerapan pada berdasarkan kelas, lakukan pemeriksaan tambahan apapun anda butuh, dan tambahkan pesan apapun ke itu dibangkitkan oleh kelas dasar. Itu dianjurkan bahwa anda menugaskan setiap pemeriksaan untuk memisahkan metode.

source: Consider an example where you are implementing a custom field named ``RangedIntegerField``. This field adds ``min`` and ``max`` arguments to the constructor of ``IntegerField``. You may want to add a check to ensure that users provide a min value that is less than or equal to the max value. The following code snippet shows how you can implement this check::
id: Pertimbangkan sebuah contoh dimana anda sedang menerapkan bidang penyesuaian bernama ``RangedIntegerField``. Bidang ini menambahkan argumen ``min`` dan ``max`` pada pembangun dari ``IntegerField``. Anda mungkin ingin menambah sebuah pemeriksaan untuk memastikan bahwa pengguna menyediakan nilai minimal yang kurang atau setara pada nilai maksimal. Potongan kode berikut menunjukkan anda dapat menerapkan pemeriksaan ini::

source: If you wanted to add checks to a model manager, you would take the same approach on your subclass of :class:`~django.db.models.Manager`.
id: Jika anda ingin menambah pemeriksaan pada pengelola model, anda akan mengambil pendekatan sama pada subkelas anda dari :class:`~django.db.models.Manager`.

source: If you want to add a check to a model class, the approach is *almost* the same: the only difference is that the check is a classmethod, not an instance method::
id: Jika anda ingin menambah sebuah pemeriksaan pada kelas model, pendekatan adalah *hampir* sama: perbedaan hanya bahwa pemeriksaan adalah metode kelas, bukan metode instance::

source: Writing tests
id: Menulis percobaan

source: Messages are comparable. That allows you to easily write tests::
id: Pesan dapat dibandingkan. Itu mengizinakan anda dengan mudah menulis percobaan::

source: Built-in class-based generic views
id: Tampilan umum berdasarkan kelas siap-pakai

source: Writing Web applications can be monotonous, because we repeat certain patterns again and again. Django tries to take away some of that monotony at the model and template layers, but Web developers also experience this boredom at the view level.
id: Menulis aplikasi Jaringan dapat menjadi membosankan, karena kami mengulangi pola tertentu lagi dan lagi. Django mencoba mengambil beberapa dari kebosanan pada model dan lapisan cetakan, tetapi pengembang Jaringan juga mengalami kebosanan ini pada tingkat tampilan.

source: Django's *generic views* were developed to ease that pain. They take certain common idioms and patterns found in view development and abstract them so that you can quickly write common views of data without having to write too much code.
id: *tampilan umum* Django dikembangkan untuk memudahkan sakit itu. Mereka mengambil dialek umum tertentu dan pola ditemukan di pengembangan tampilan dan meringkaskan mereka sehingga anda dapat dengan cepat menulis tampilan umum dari data tanpa harus menulis kode terlalu banyak.

source: We can recognize certain common tasks, like displaying a list of objects, and write code that displays a list of *any* object. Then the model in question can be passed as an extra argument to the URLconf.
id: Kami dapat mengenali tugas-tugas umum, seperti memperlihatkan daftar dari obyek, dan menulis kode yang memperlihatkan daftar dari obyek *apapun*. Kemudian model di pertanyaan dapat dilewatkan sebagai sebuah argumen tambahan pada URLconf.

source: Django ships with generic views to do the following:
id: Django dibungkus dengan tampilan umum untuk melakukan berikut:

source: Display list and detail pages for a single object. If we were creating an application to manage conferences then a ``TalkListView`` and a ``RegisteredUserListView`` would be examples of list views. A single talk page is an example of what we call a "detail" view.
id: Memperlihatkan daftar dan halaman rincian untuk obyek tunggal. Jika kami sedang membuat sebuah aplikasi untuk mengelola pertemuan kemudian ``TalkListView`` dan ``RegisteredUserListView`` akan menjadi contoh dari daftar tampilan. Halaman percakapan tunggal adalah sebuah contoh dari apa kami sebut tampilan "detail".

source: Present date-based objects in year/month/day archive pages, associated detail, and "latest" pages.
id: Obyek berdasarkan-tanggal sekarang di halaman arsip tahun/bulan/hari, rincian terkait, dan halaman "latest".

source: Allow users to create, update, and delete objects -- with or without authorization.
id: Mengizinkan untuk membuat, memperbaharui, dan menghapus obyek -- dengan atau tanpa otorisasi.

source: Taken together, these views provide easy interfaces to perform the most common tasks developers encounter.
id: Diambil bersama-sama, tampilan ini menyediakan antarmuka mudah untuk melakukan tugas-tugas paling umum pengembang hadapi.

source: Extending generic views
id: Memperpanjang tampilan umum

source: There's no question that using generic views can speed up development substantially. In most projects, however, there comes a moment when the generic views no longer suffice. Indeed, the most common question asked by new Django developers is how to make generic views handle a wider array of situations.
id: Tidak ada pertanyaan yang menggunakan tampilan umum yang dapat mempercepat pengembangan besar. Dalam kebanyakan proyek, bagaimanapun, ada datang saat ketika tampilan umum tidak lagi cukup. Memang, pertanyaan paling umum ditanyakan oleh pengembang Django baru adalah bagaimana membuat tampilan umum menangangi larik lebih lebar dari keadaan.

source: This is one of the reasons generic views were redesigned for the 1.3 release - previously, they were just view functions with a bewildering array of options; now, rather than passing in a large amount of configuration in the URLconf, the recommended way to extend generic views is to subclass them, and override their attributes or methods.
id: Ini adalah satu dari alasan umtum tampilan dirancang kembali untuk terbitan 1.3 - sebelumnya, mereka hanya fungsi tampilan dengan membingungkan dari pilihan; sekarang daripada melewatkan di sejumlah besar konfigurasi di URLconf, cara dianjurkan untuk memperpanjang tampilan umum adalah dengan mensubkelaskan mereka, dan menimpa atribut dan metodenya.

source: That said, generic views will have a limit. If you find you're struggling to implement your view as a subclass of a generic view, then you may find it more effective to write just the code you need, using your own class-based or functional views.
id: Itu dikatakan, tampilan umum akan mempunyai sebuah batasan. Jika anda menemukan anda sedang berjuang menerapkan tampilan anda sebagai sebuah subkelas dari tampilan umum, kemudian anda mungkin menemukan itu lebih efektif untuk menulis hanya kode anda butuhkan, menggunakan berdasarkan-kelas anda sendiri atau tampilan kegunaan.

source: More examples of generic views are available in some third party applications, or you could write your own as needed.
id: Contoh-contoh lebih dari tampilan umum tersedia di beberapa aplikasi pihak ketiga, atau anda dapat menulis anda sendiri sesuai kebutuhan.

source: Generic views of objects
id: Tampilan umum dari obyek

source: :class:`~django.views.generic.base.TemplateView` certainly is useful, but Django's generic views really shine when it comes to presenting views of your database content. Because it's such a common task, Django comes with a handful of built-in generic views that make generating list and detail views of objects incredibly easy.
id: :class:`~django.views.generic.base.TemplateView` pasti sangat berguna, tetapi tampilan umum Django sangat bersinar ketika itu datang untuk membawakan tampilan dari isi basisdata anda. Karena itu adalah tugas umum, Django datang dengan sejumlah tampilan umum siap-pakai yang membuat membangkitkan daftar dan rincian tampilan dari obyek sangat mudah.

source: Let's start by looking at some examples of showing a list of objects or an individual object.
id: Mari kita mulai dengan mencari beberapa contoh dari menunjukkan daftar dari obyek atau obyek tersendiri.

source: We'll be using these models::
id: Kami akan menggunakan model ini ::

source: Now we need to define a view::
id: Sekarang kami butuh menentukan sebuah tampilan::

source: Finally hook that view into your urls::
id: Akhirnya kaitkan tampilan itu kedalam url anda ::

source: That's all the Python code we need to write. We still need to write a template, however. We could explicitly tell the view which template to use by adding a ``template_name`` attribute to the view, but in the absence of an explicit template Django will infer one from the object's name. In this case, the inferred template will be ``"books/publisher_list.html"`` -- the "books" part comes from the name of the app that defines the model, while the "publisher" bit is just the lowercased version of the model's name.
id: Itu saja semua kode Python kami butuh tulis. Kami masih butuh menulis sebuah cetakan, bagaimanapun. Kami dapat dengan jelas memberitahu tampilan cetakan mana untuk digunakan dengan menambahkan atribut ``template_name``, tetapi di kehadiran dari Django cetakan jelas akan mengambil kesimpulan satu dari nama obyek. Dalam kasus ini, cetakan kesimpulan akan menjadi ``"books/publisher_list.html"`` -- bagian "books" berasal dari nama dari aplikasi yang menentukan model, selagi sedikit "publisher" hanya versi huruf kecil dari nama model.

source: Thus, when (for example) the ``APP_DIRS`` option of a ``DjangoTemplates`` backend is set to True in :setting:`TEMPLATES`, a template location could be: /path/to/project/books/templates/books/publisher_list.html
id: Dengan demikian, ketika (sebagai contoh) pilihan ``APP_DIRS`` dari backend ``DjangoTemplates`` disetel menjadi True di :setting:`TEMPLATES`, tempat cetakan dapat berupa: /path/to/project/books/templates/books/publisher_list.html

source: This template will be rendered against a context containing a variable called ``object_list`` that contains all the publisher objects. A very simple template might look like the following:
id: Cetakan ini akan dibangun terhadap konteks mengandung sebuah variabel disebut ``object_list`` yang mengandung semua obyek penerbit. Cetakan sangat sederhana mungkin terlihat seperti berikut:

source: That's really all there is to it. All the cool features of generic views come from changing the attributes set on the generic view. The :doc:`generic views reference</ref/class-based-views/index>` documents all the generic views and their options in detail; the rest of this document will consider some of the common ways you might customize and extend generic views.
id: Itu semua benar-benar ada adalah pada itu. Semua fitur-fitur keren dari tampilan umum datang dari merubah atribut disetel pada tampilan umum. :doc:`generic views reference</ref/class-based-views/index>` mendokumentasikan semua tampilan umum dan pilihan mereka di rincian; sisa dari dokumen ini akan dianggap beberapa dari cara umum anda mungkin menyesuaikan dan memperpanjang tampilan umum.

source: Making "friendly" template contexts
id: Membuat konteks cetakan "friendly"

source: You might have noticed that our sample publisher list template stores all the publishers in a variable named ``object_list``. While this works just fine, it isn't all that "friendly" to template authors: they have to "just know" that they're dealing with publishers here.
id: Anda mungkin telah memperhatikan bahwa contoh cetakan daftar penerbit kami menyimpan semua penerbit dalam sebuah variabel bernama ``object_list``. Selagi ini bekerja baik, itu tidak semua yang "friendly" pada cetakan penulis: mereka harus "just know" bahwa mereka sedang berurusan dengan penerbit disini.

source: Well, if you're dealing with a model object, this is already done for you. When you are dealing with an object or queryset, Django is able to populate the context using the lower cased version of the model class' name. This is provided in addition to the default ``object_list`` entry, but contains exactly the same data, i.e. ``publisher_list``.
id: Baik, jika anda sedang berurusan dengan sebuah obyek model, ini sudah selesai untuk anda. Ketika anda sedang berurusan dengan sebuah obyek atau queryset, Django dapat mengumpulkan konteks menggunakan versi huruf kecil dari nama kelas model. Ini disediakan sebagai tambahan pada masukan ``object_list`` awalan, tetapi mengandung persisnya data sama, yaitu ``publisher_list``.

source: If this still isn't a good match, you can manually set the name of the context variable. The ``context_object_name`` attribute on a generic view specifies the context variable to use::
id: Jika ini masih tidak kecocokan baik, anda dapat manual menyetel nama dari variabel konteks. Atribut ``context_object_name`` pada tampilan umum menentukan variabel konteks untuk digunakan::

source: Providing a useful ``context_object_name`` is always a good idea. Your coworkers who design templates will thank you.
id: Menyediakan sebuah ``context_object_name`` berguna selalu ide bagus. Rekan kerja anda yang merancang cetakan akan berterima kasih.

source: Adding extra context
id: Menambahkan konteks tambahan

source: Often you simply need to present some extra information beyond that provided by the generic view. For example, think of showing a list of all the books on each publisher detail page. The :class:`~django.views.generic.detail.DetailView` generic view provides the publisher to the context, but how do we get additional information in that template?
id: Sering anda cukup butuh menghadirkan beberapa informasi tambahan yang disediakan oleh tampilan umum. Sebagai contoh, berpikir dari menunjukkan daftar semua buku pada setiap halaman rincian penerbit. Tampilan umum :class:`~django.views.generic.detail.DetailView` menyediakan penerbit ke konteks, tetapi bagaimana kami mendapatkan informasi tambahan di cetakan itu?

source: The answer is to subclass :class:`~django.views.generic.detail.DetailView` and provide your own implementation of the ``get_context_data`` method. The default implementation simply adds the object being displayed to the template, but you can override it to send more::
id: Jawabannya adalah untuk mensubkelaskan :class:`~django.views.generic.detail.DetailView` dan menyediakan penerapan milik anda sendiri dari metode ``get_context_data``. Penerapan awalan cukup menambahkan obyek sedang ditampilkan pada cetakan, tetapi anda dapat menimpanya untuk mengirim lagi::

source: Generally, ``get_context_data`` will merge the context data of all parent classes with those of the current class. To preserve this behavior in your own classes where you want to alter the context, you should be sure to call ``get_context_data`` on the super class. When no two classes try to define the same key, this will give the expected results. However if any class attempts to override a key after parent classes have set it (after the call to super), any children of that class will also need to explicitly set it after super if they want to be sure to override all parents. If you're having trouble, review the method resolution order of your view.
id: Umumnya, ``get_context_data`` akan menggabungkan data konteks dari semua induk kelas dengan mereka dari kelas saat ini. Untuk mempertahankan kebiasaan ini di kelas milik anda sendiri dimana anda ingin merubah konteks, anda harus pasti memanggil ``get_context_data`` pada super kelas. Ketika tidak ada dua kelas mencoba menentukan kunci yang sama, ini akan memberikan hasil yang diharapkan. Bagaimanapun jika tiap kelas mencoba menimpa kunci setelah kelas induk menyetelnya (setelah panggilan pada super), tiap anak dari kelas akan juga butuh secara eksplisit menyetelnya setelah super jika mereka ingin memastikan untuk menimpa semua induk. Jika anda mempunyai masalah, tinjau kembali urutan pemecahan metode dari tampilan anda.

source: Another consideration is that the context data from class-based generic views will override data provided by context processors; see :meth:`~django.views.generic.detail.SingleObjectMixin.get_context_data` for an example.
id: Pertimbangan lain adalah bahwa data konteks dari tampilan umum berdasarkan-kelas akan menimpa data disediakan oleh pengolah konteks; lihat :meth:`~django.views.generic.detail.SingleObjectMixin.get_context_data` untuk sebuah contoh.

source: Viewing subsets of objects
id: Menampilkan subkumpulan dari obyek

source: Now let's take a closer look at the ``model`` argument we've been using all along. The ``model`` argument, which specifies the database model that the view will operate upon, is available on all the generic views that operate on a single object or a collection of objects. However, the ``model`` argument is not the only way to specify the objects that the view will operate upon -- you can also specify the list of objects using the ``queryset`` argument::
id: Sekarang mari kita lebih dekat melihat pada argumen ``model`` kami telah sepanjang gunakan. Argumen ``model``, yang menentukan model basisdata yang tampilan akan beroperasi, tersedia pada seua tampilan umum yang beroperasi pada obyek tunggal atau kumpulan dari obyek. Bagaimanapun, argumen ``model`` tidak hanya cara untuk menentukan obyek yang tampilan akan beroperasi -- anda dapat juga menentukan daftar dari obyek menggunakan argumen ``queryset``::
