Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: When the client next requests the same resource, it might send along a header such as either `If-modified-since`_ or `If-unmodified-since`_, containing the date of the last modification time it was sent, or either `If-match`_ or `If-none-match`_, containing the last ``ETag`` it was sent. If the current version of the page matches the ``ETag`` sent by the client, or if the resource has not been modified, a 304 status code can be sent back, instead of a full response, telling the client that nothing has changed. Depending on the header, if the page has been modified or does not match the ``ETag`` sent by the client, a 412 status code (Precondition Failed) may be returned.
id: Ketika klien selanjutnya meminta sumber daya sama, itu mungkin mengirim sepanjang kepala seperti antara `If-modified-since`_ atau `If-unmodified-since`_, mengandung tanggal dari waktu perubahan terakhir itu telah kirim, atau antara `If-match`_ atau `If-none-match`_, mengandung ``ETag`` terkahir itu telah kirim. Jika versi saat ini dari halaman cocok ``ETag`` dikirim oleh klien, atau jika sumber daya belum dirubah, sebuah kode keadaan 304 dapat dikirm kembali, sebagai ganti dari tanggapan penuh, memberitahu klien bahwa tidak ada yang berubah. Bergantung pada kepala, jika halaman telah dirubah atau tidak cocok ``ETAG`` dikirim oleh klien, sebuah kode keadaan 412 (Kegagalan Prakondisi) mungkin dikembalikan.

source: When you need more fine-grained control you may use per-view conditional processing functions.
id: Ketika anda butuh lebih kendali lebih-halus anda mungkin menggunakan fungsi pengolahan bersyarat per-tampilan.

source: The ``condition`` decorator
id: Penggias ``condition``

source: Sometimes (in fact, quite often) you can create functions to rapidly compute the ETag_ value or the last-modified time for a resource, **without** needing to do all the computations needed to construct the full view. Django can then use these functions to provide an "early bailout" option for the view processing. Telling the client that the content has not been modified since the last request, perhaps.
id: Terkadang (faktanya, sangat sering) anda dapat membuat fungsi dengan cepat menghitung nilai ETag_ atau waktu perubahan-terakhir untuk sebuah sumber daya, **tanpa** membutuhkanmelakukan semua perhitungan dibutuhkan untuk membangun tampilan penuh. Django dapat kemudian menggunakan fungsi-fungsi ini untuk menyediakan sebuah pilihan "early bailout" untuk pengolahan tampilan. Memberitahu klien bahwa isi belum dirubah sejak permintaan terakhir, mungkin.

source: These two functions are passed as parameters to the ``django.views.decorators.http.condition`` decorator. This decorator uses the two functions (you only need to supply one, if you can't compute both quantities easily and quickly) to work out if the headers in the HTTP request match those on the resource. If they don't match, a new copy of the resource must be computed and your normal view is called.
id: Dua fungsi ini dilewatkan sebagai parameter pada penghias ``django.views.decorators.http.condition``. Penghias ini menggunakan dua fungsi (anda hanya butuh menyokong satu, jika anda tidak dapat menghitung kedua jumlah dengan mudah dan cepat) untuk bekerja jika kepala dalam permintaan HTTP cocok dengan itu pada sumber daya. Jika mereka tidak cocok, sebuah salinan baru dari sumber daya harus dihitung dan tampilan biasa anda dipanggil.

source: The ``condition`` decorator's signature looks like this::
id: Tanda tangan penghias ``condition`` terlihat seperti ini::

source: The two functions, to compute the ETag and the last modified time, will be passed the incoming ``request`` object and the same parameters, in the same order, as the view function they are helping to wrap. The function passed ``last_modified_func`` should return a standard datetime value specifying the last time the resource was modified, or ``None`` if the resource doesn't exist. The function passed to the ``etag`` decorator should return a string representing the `ETag`_ for the resource, or ``None`` if it doesn't exist.
id: Dua fungsi, untuk menghitung ETag dan waktu terkahir dirubah, akan dilewatkan obyek ``request`` datang dan parameter sama, dalam urutan sama, ketika fungsi tampilan mereka bantu untuk membungkus. Fungsi dilewatkan ``last_modified_func`` harus mengembalikan sebuah nilai datetime standar menentukan waktu terakhir sumber daya telah dirubah, atau ``None`` jika sumber daya tidak ada. Fungsi dilewatkan ke penghias ``etag`` harus mengembalikan sebuah string mewakili `ETag_` untuk sumber daya, atau ``None`` jika itu tidak ada.

source: The decorator sets the ``ETag`` and ``Last-Modified`` headers on the response if they are not already set by the view and if the request's method is safe (``GET`` or ``HEAD``).
id: Penghias menyetel kepala ``ETag`` dan ``Last-Modified`` pada tanggapan jika mereka tidak disetel oleh tampilan dan jika metode permintaan adalah aman (``GET`` or ``HEAD``).

source: Using this feature usefully is probably best explained with an example. Suppose you have this pair of models, representing a simple blog system::
id: Menggunakan fitur berguna ini mungkin dijelaskan terbaik dengan sebuah contoh. Kiranya anda mempunyai pasangan model ini, mewakili sebuah sistem blog sederhana::

source: If the front page, displaying the latest blog entries, only changes when you add a new blog entry, you can compute the last modified time very quickly. You need the latest ``published`` date for every entry associated with that blog. One way to do this would be::
id: Jika halaman depan, menampilkan masukan blog terakhir, hanya perubahan ketika anda menambah masukan blog baru, anda dapat menghitung waktu terakhir dirubah sangat cepat. Anda butuh tanggal ``published`` terakhir untuk setiap masukan terkait dengan blog itu. Satu cara melakukan ini adalah::

source: You can then use this function to provide early detection of an unchanged page for your front page view::
id: Anda lalu dapat menggunakan fungsi ini untuk menyediakan pengenalan awal dari halaman tidak berubah untuk tampilan halaman depan anda::

source: Be careful with the order of decorators
id: Hati-hati dengan urutan dari penghias

source: When ``condition()`` returns a conditional response, any decorators below it will be skipped and won't apply to the response. Therefore, any decorators that need to apply to both the regular view response and a conditional response must be above ``condition()``. In particular, :func:`~django.views.decorators.vary.vary_on_cookie`, :func:`~django.views.decorators.vary.vary_on_headers`, and :func:`~django.views.decorators.cache.cache_control` should come first because :rfc:`RFC 7232 <7232#section-4.1>` requires that the headers they set be present on 304 responses.
id: Ketika ``condition()`` mengembalikan tanggapan keadaan, penghias apapun dibawah itu akan dilewati dan tidak akan diberlakukan ke tanggapan. Karena itu, penghias apapun yang butuh diberlakukan ke kedua tanggapan tampilan biasa dan tanggapan keadaan harus diatas ``condition()``. Khususnya, :func:`~django.views.decorators.vary.vary_on_cookie`, :func:`~django.views.decorators.vary.vary_on_headers`, dan :func:`~django.views.decorators.cache.cache_control` harus datang pertama karena :rfc:`RFC 7232 <7232#section-4.1>` membutuhkan yang kepala mereka set hadir pada 304 tanggapan.

source: Shortcuts for only computing one value
id: Jalan pintas untuk hanya menghitung satu nilai

source: As a general rule, if you can provide functions to compute *both* the ETag and the last modified time, you should do so. You don't know which headers any given HTTP client will send you, so be prepared to handle both. However, sometimes only one value is easy to compute and Django provides decorators that handle only ETag or only last-modified computations.
id: Sebagai aturan umum, jika anda dapat menyediakan fngsi untuk menghitung *kedua* ETag dan waktu perubahan terakhir, anda harus melakukannya. Anda tidak mengetahui kepala klien HTTP diberikan akan mengirim anda, jadi bersiap-siap untuk menangani keduanya, terkadang hanya satu nilai adalah mudah untuk dihitung dan Django menyediakan penghias yang menangani hanya ETag atau hanya perhitungan dirubah-terakhir.

source: The ``django.views.decorators.http.etag`` and ``django.views.decorators.http.last_modified`` decorators are passed the same type of functions as the ``condition`` decorator. Their signatures are::
id: Penghias ``django.views.decorators.http.etag`` dan ``django.views.decorators.http.last_modified`` dilewatkan jenis sama dari fungsi seperti penghias ``condition``. Tanda tangan mereka adalah::

source: We could write the earlier example, which only uses a last-modified function, using one of these decorators::
id: Kami dapat menulis contoh paling awal, yang hanya menggunakan fungsi dirubah-terakhir, menggunakan satu dari penghias ini::

source: ...or::
id: ...atau::

source: Use ``condition`` when testing both conditions
id: Gunakan ``kondisi`` ketika menguji kedua kondisi

source: It might look nicer to some people to try and chain the ``etag`` and ``last_modified`` decorators if you want to test both preconditions. However, this would lead to incorrect behavior.
id: Itu mungkin terlihat lebih baik bagi beberapa orang mencoba dan mengikat penghias ``etag`` dan ``last_modified`` jika anda ingin mencoba kedua prakeadaan. bagaimanapun, ini akan membawa perilaku tidak benar.

source: The first decorator doesn't know anything about the second and might answer that the response is not modified even if the second decorators would determine otherwise. The ``condition`` decorator uses both callback functions simultaneously to work out the right action to take.
id: Penghias pertama tidak mengetahui apapun tentang kedua dan mungkin menjawab tanggapan itu tidak dirubah meskipun jika penghias kedua akan menentukan sebaliknya. Penghias ``condition`` menggunakan kedua fugnsi callback secara terus menerus untuk bekerja tindakan tepat diambil.

source: Using the decorators with other HTTP methods
id: Menggunakan penghias dengan metode HTTP lain

source: The ``condition`` decorator is useful for more than only ``GET`` and ``HEAD`` requests (``HEAD`` requests are the same as ``GET`` in this situation). It can also be used to provide checking for ``POST``, ``PUT`` and ``DELETE`` requests. In these situations, the idea isn't to return a "not modified" response, but to tell the client that the resource they are trying to change has been altered in the meantime.
id: Penghias ``condition`` berguna untuk lebih dari hanya permintaan ``GET`` dan ``HEAD`` (permintaan ``HEAD`` adalah sama seperti ``GET`` dalam keadaan ini). Itu dapat juga digunakan untuk menyediakan pemeriksaan untuk perintaan ``POST``, ``PUT`` dan ``DELETE``. Dalam keadaan ini, ide bukan mengembalikan sebuah tanggapan "not modified", tetapi memberitahu klien yang sumber daya mereka sedang mencoba telah dirubah dalam sementara itu.

source: For example, consider the following exchange between the client and server:
id: Sebagai contoh, pertimbangkan pertukaran berikut diantara klien dan peladen:

source: Client requests ``/foo/``.
id: Permintaan klien ``/foo/``.

source: Server responds with some content with an ETag of ``"abcd1234"``.
id: Tanggapan peladen dengan beberapa isi dengan sebuah ETag dari ``"abcd1234"``.

source: Client sends an HTTP ``PUT`` request to ``/foo/`` to update the resource. It also sends an ``If-Match: "abcd1234"`` header to specify the version it is trying to update.
id: Klien mengirim sebuah permintaan ``PUT`` HTTP pada ``/foo/`` untuk memperbaharui sumber daya. Itu juga mengirim sebuah kepala ``If-Match: "abcd1234"`` untuk menentukan versi itu coba memperbaharui.

source: Server checks to see if the resource has changed, by computing the ETag the same way it does for a ``GET`` request (using the same function). If the resource *has* changed, it will return a 412 status code, meaning "precondition failed".
id: Peladen memeriksa untuk melihat jika sumber daya telah berubah, dengan menghitung ETag cara sama itu lakukan untuk permintaan ``GET`` (menggunakan fungsi sama). Jika sumber data *telah* berubah, itu akan mengembalikan kode keadaan 412, berarti "Prasyarat gagal".

source: Client sends a ``GET`` request to ``/foo/``, after receiving a 412 response, to retrieve an updated version of the content before updating it.
id: Klien mengirim sebuah permintaan ``GET`` pada ``/foo/``, setelah menerima tanggapan 412, untuk mengambil sebuah versi terperbaharui dari isi sebelum memperbaharui itu.

source: The important thing this example shows is that the same functions can be used to compute the ETag and last modification values in all situations. In fact, you **should** use the same functions, so that the same values are returned every time.
id: Hal terpenting contoh ini menunjukkan bahwa fungsi sama dapat digunakan untuk menghitung ETAg dan nilai perubahan terakhir dalam semua keadaan. Faktanya, anda *harus* menggunakan fungsi sama, sehingga nilai sama dikembalikan setiap waktu.

source: Validator headers with non-safe request methods
id: Kepala-kepala pengesah dengan metode permintaan tidak-aman

source: The ``condition`` decorator only sets validator headers (``ETag`` and ``Last-Modified``) for safe HTTP methods, i.e. ``GET`` and ``HEAD``. If you wish to return them in other cases, set them in your view. See :rfc:`7231#section-4.3.4` to learn about the distinction between setting a validator header in response to requests made with ``PUT`` versus ``POST``.
id: Penghias ``condition`` hanya menyetel kepala-kepala pengesah (``ETag`` dan ``Last-Modified``) untuk metode-metode HTTP aman, yaitu ``GET`` and ``HEAD``. Jika anda berharap mengembalikan mereka di kasus lain, setel mereka dalam tampilan anda. Lihat :rfc:`7231#section-4.3.4` untuk mempelajari tentang perbedaan diantara menyetel sebuah kepala pengesah dalam tanggapan pada permintaan dibuat dengan ``PUT`` lawan ``POST``.

source: Comparison with middleware conditional processing
id: Perbandingan dengan pengolahan bersyarat middleware

source: Django provides simple and straightforward conditional ``GET`` handling via :class:`django.middleware.http.ConditionalGetMiddleware`. While being easy to use and suitable for many situations, the middleware has limitations for advanced usage:
id: Django menyediakan penanganan ``GET`` bersyarat yang sederhana dan mudah melalui :class:`django.middleware.http.ConditionalGetMiddleware`. Selagi mudah digunakan dan cocok untuk banyak keadaan, middleware mempunyai batasan untuk penggunaan lanjutan:

source: It's applied globally to all views in your project.
id: Itu diberlakukan secara global pada semua tampilan dalam proyek anda.

source: It doesn't save you from generating the response, which may be expensive.
id: Itu tidak menyimpan anda dari membangkitkan tanggapan, yang mungkin mahal.

source: It's only appropriate for HTTP ``GET`` requests.
id: Itu hanya sesuai untuk permintaan ``GET`` HTTP.

source: You should choose the most appropriate tool for your particular problem here. If you have a way to compute ETags and modification times quickly and if some view takes a while to generate the content, you should consider using the ``condition`` decorator described in this document. If everything already runs fairly quickly, stick to using the middleware and the amount of network traffic sent back to the clients will still be reduced if the view hasn't changed.
id: Anda harus memilih alat paling sesuai untuk masalah tertentu anda disini. Jika anda mempunyai cara menghitung ETags dan waktu perubahan sangat cepat dan jika beberapa tampilan perlu waktu untuk membangkitkan isi, anda harus mempertimbangkan menggunakan penghias ``decorator`` digambarkan dalam dokumen ini. Jika semuanya sudah berjalan cukup cepat, lekatkan menggunakan middleware dan sejumlah lalu lintas jaringan dikirim kembali ke klien akan masih dikurangi jika tampilan belum berubah.

source: Aggregation
id: Pengumpulan

source: The topic guide on :doc:`Django's database-abstraction API </topics/db/queries>` described the way that you can use Django queries that create, retrieve, update and delete individual objects. However, sometimes you will need to retrieve values that are derived by summarizing or *aggregating* a collection of objects. This topic guide describes the ways that aggregate values can be generated and returned using Django queries.
id: Panduan topik pada :doc:`Django's database-abstraction API </topics/db/queries>` menggambarkan cara dimana anda dapat menggunakan permintaan Django yang membuat, mengambil, memperbaharui dan menghapus obyek tersendiri. Bagaimanapun, terkadang anda akan butuh mengambil nilai yang berasal oleh meringkas atau*mengumpulkan* kumpulan dari obyek. Topik panduan ini menggambarkan cara yang mengumpulkan nilai-nilai dapat dibangkitkan dan dikembalikan menggunakan permintaan Django.

source: Throughout this guide, we'll refer to the following models. These models are used to track the inventory for a series of online bookstores:
id: Sepanjang panduan ini, kami akan mengacu ke model berikut. Model-model ini digunakan untuk melacak inventaris untuk rangkaian dari toko buku daring:

source: Cheat sheet
id: Lembar curang

source: In a hurry? Here's how to do common aggregate queries, assuming the models above:
id: Terburu-buru? Ini adalah bagaimana melakukan permintaan pengumpulan umum, menganggap model diatas:

source: Generating aggregates over a ``QuerySet``
id: Membangkitkan pengumpulan terhadap ``QuerySet``

source: Django provides two ways to generate aggregates. The first way is to generate summary values over an entire ``QuerySet``. For example, say you wanted to calculate the average price of all books available for sale. Django's query syntax provides a means for describing the set of all books::
id: Django menyediakan dua cara membangkitkan pengumpulan. Cara pertama adalah membangkitkan nilai ringkasan terhadap keseluruhan ``QuerySet``. Sebagai contoh, katakan anda ingin menghitung rata-rata harga dari semua buku tersedia untuk dijual. Sintaksis permintaan Django menyediakan sarana untuk menggambarkan kumpulan dari semua buku::

source: What we need is a way to calculate summary values over the objects that belong to this ``QuerySet``. This is done by appending an ``aggregate()`` clause onto the ``QuerySet``::
id: Apa kami butuhkan adalah cara menghitung ringkasan nilai terhadap obyek yang memiliki ``QuerySet`` ini. Ini diselesaikan dengan menambah sebuah klausa ``aggregate()`` kedalam ``QuerySet``::

source: The ``all()`` is redundant in this example, so this could be simplified to::
id: ``all()`` berulang di contoh ini, jadi ini dapat disederhanakan menjadi::

source: The argument to the ``aggregate()`` clause describes the aggregate value that we want to compute - in this case, the average of the ``price`` field on the ``Book`` model. A list of the aggregate functions that are available can be found in the :ref:`QuerySet reference <aggregation-functions>`.
id: Argumen pada klausa ``aggregate()`` menggambarkan nilai pengumpulan yang kami ingin hitung - dalam kasus ini, rata-rata dari bidang ``price`` pada model ``Book``. Sebuah daftar dari fungsi pengumpulan yang tersedia dapat ditemukan di :ref:`QuerySet reference <aggregation-functions>`.

source: ``aggregate()`` is a terminal clause for a ``QuerySet`` that, when invoked, returns a dictionary of name-value pairs. The name is an identifier for the aggregate value; the value is the computed aggregate. The name is automatically generated from the name of the field and the aggregate function. If you want to manually specify a name for the aggregate value, you can do so by providing that name when you specify the aggregate clause::
id: ``aggregate()`` adalah klausa terminal untuk sebuah ``QuerySet`` yang, ketika dipanggil, mengembalikan sebuah kamus dari pasangan nama-nilai. Nama adalah sebuah penciri untuk nilai pengumpulan; nilai adalah pengumpulan yang dihitung. Nama adalah otomatis dibangkitkan dari nama dari bidang dan fungsi pengumpulan. Jika anda ingin manual menentukan nama untuk nilai pengumpulan, anda dapat melakukannya dengan menyediakan nama itu ketika anda menentukan klausa pengumpulan::

source: If you want to generate more than one aggregate, you just add another argument to the ``aggregate()`` clause. So, if we also wanted to know the maximum and minimum price of all books, we would issue the query::
id: Jika anda ingin membangkitkan lebih dari satu pengumpulan, anda hanya menambah argumen lain ke klusa ``aggregate()``. Jadi, jika kami juga ingin mengetahui harga maksimal dan minimal dari semua buku, kami akan menerbitkan permintaan::

source: Generating aggregates for each item in a ``QuerySet``
id: Membangkitkan pengumpulan untuk setiap barang di ``QuerySet``

source: As with ``aggregate()``, the name for the annotation is automatically derived from the name of the aggregate function and the name of the field being aggregated. You can override this default name by providing an alias when you specify the annotation::
id: Seperti ``aggregate()``, nama untuk catatan otomatis berasal dari nama dari fungsi pengumpulan dan nama dari bidang sedang dikumpulkan. Anda dapat menimpa nama awalan ini dengan menyediakan sebuah nama lain ketika anda menentukan catatan::

source: Unlike ``aggregate()``, ``annotate()`` is *not* a terminal clause. The output of the ``annotate()`` clause is a ``QuerySet``; this ``QuerySet`` can be modified using any other ``QuerySet`` operation, including ``filter()``, ``order_by()``, or even additional calls to ``annotate()``.
id: Tidak seperti ``aggregate()``, ``annotate()`` adalah *bukan* klausa terminal. Keluaran dari klausa ``annotate()`` adalah sebuah ``QuerySet``; ``QuerySet`` ini dapat dirubah menggunakan apapun selain operasi ``QuerySet``, termasuk ``filter()``, ``order_by()``, atau bahkan tambahan panggilan pada ``annotate()``.

source: Combining multiple aggregations
id: Memadukan banyak pengumpulan

source: Combining multiple aggregations with ``annotate()`` will `yield the wrong results <https://code.djangoproject.com/ticket/10060>`_ because joins are used instead of subqueries:
id: Memadukan banyak pengumpulan dengan ``annotate()`` akan `yield the wrong results <https://code.djangoproject.com/ticket/10060>`_ karena join digunakan daripada sub permintaan:

source: For most aggregates, there is no way to avoid this problem, however, the :class:`~django.db.models.Count` aggregate has a ``distinct`` parameter that may help:
id: Untuk kebanyakan pengumpulan, tidak ada jalan menghindari masalah ini, bagaimanapun, pengumpulan :class:`~django.db.models.Count` mempunai sebuah parameter ``distinct`` yang mungkin membantu:

source: If in doubt, inspect the SQL query!
id: Jika ragu, periksa permintaan SQL!

source: In order to understand what happens in your query, consider inspecting the ``query`` property of your ``QuerySet``.
id: Untuk memahami apa yang terjadi di permintaan anda, pertimbangkan memeriksa sifat ``query`` dari ``QuerySet`` anda.

source: Joins and aggregates
id: Gabung dan kumpulkan

source: So far, we have dealt with aggregates over fields that belong to the model being queried. However, sometimes the value you want to aggregate will belong to a model that is related to the model you are querying.
id: Sejauh ini, kami telah berurusan dengan pengumpulan terhadap bidang yang milik ke model sedang diminta. Bagaimanapun, terkadang nilai anda ingin kumpulkan akan milik ke model yang terkait ke model anda sedang meminta.
