Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Dealing with conflicts
id: Berurusan dengan pertentangan

source: Passing extra options to ``include()``
id: Melewatkan pilihan tambahan untuk ``include()``

source: For example, these two URLconf sets are functionally identical:
id: Sebagai contoh, kumpulan URLcond dua ini adalah kegunaannya mirip:

source: Set one::
id: Setel satu::

source: Set two::
id: Setel dua::

source: In other words, what's needed is a DRY mechanism. Among other advantages it would allow evolution of the URL design without having to go over all the project source code to search and replace outdated URLs.
id: Dengan kata lain, apa yang dibutuhkan adalah mekanisme DRY. Diantara keuntungan lain itu akan mengizinkan evolusi dari rancangan URL tanpa harus pergi ke semua kode sumber proyek untuk mencari dan mengganti URL usang.

source: Starting with the identification of the corresponding Django view plus the values of arguments that would be passed to it, obtain the associated URL.
id: Dimulai dengan pencirian dari tampilan Django sesuai ditambah nilai-nilai dari argumen yang akan dilewatkan ke itu, ambil URL terkait.

source: In templates: Using the :ttag:`url` template tag.
id: Dalam cetakan: Menggunakan etiket cetakan :ttag:`url`.

source: In Python code: Using the :func:`~django.urls.reverse` function.
id: Dalam kode Python: Menggunakan fungsi :func:`~django.urls.reverse`.

source: Consider again this URLconf entry::
id: Pertimbangkan kembali masukan URLconf ini::

source: You can obtain these in template code by using:
id: Anda dapat mendapatkan ini dalam kode cetakan dengan menggunakan:

source: Or in Python code::
id: Atau di kode Phyton ::

source: Naming URL patterns
id: Menamai pola URL

source: URL namespaces
id: Namespace URL

source: Introduction
id: Kata Pengantar

source: A URL namespace comes in two parts, both of which are strings:
id: Sebuah namespace URL datang dalam dua bagian, keduanya adalah string:

source: application namespace
id: namespace aplikasi

source: instance namespace
id: namespace instance

source: This identifies a specific instance of an application. Instance namespaces should be unique across your entire project. However, an instance namespace can be the same as the application namespace. This is used to specify a default instance of an application. For example, the default Django admin instance has an instance namespace of ``'admin'``.
id: Ini mencirikan instance khusus dari sebuah aplikasi. Namespace-namespace instance harus unik terhadap keseluruhan proyen anda. Bagaimanapun, sebuah namespace instance dapat berupa sama seperti namespace aplikasi. Ini digunakan untuk menentukan instance awalan dari sebuah aplikasi. Sebagai contoh, instance admin Django awalan mempunyai sebuah namespace instance dari ``'admin'``.

source: Namespaced URLs are specified using the ``':'`` operator. For example, the main index page of the admin application is referenced using ``'admin:index'``. This indicates a namespace of ``'admin'``, and a named URL of ``'index'``.
id: URL namespace ditentukan menggunakan penghubung ``':'``. Sebagai contoh, halaman indeks utama dari aplikasi admin diacukan menggunakan ``'admin:index'``. Ini menunjukkan sebuah namespace dari ``'admin'``,dan sebuah URL bernama dari ``'index'``.

source: Namespaces can also be nested. The named URL ``'sports:polls:index'`` would look for a pattern named ``'index'`` in the namespace ``'polls'`` that is itself defined within the top-level namespace ``'sports'``.
id: Namespace juga dapat bersarang. URL bernama ``'sports:polls:index'`` akan terlihat untuk sebuah pola bernama ``'index'`` dalam namespace ``'polls'`` yag itu sendiri ditentukan dalam namespace tingkat-atas ``'sports'``.

source: First, Django looks for a matching :term:`application namespace` (in this example, ``'polls'``). This will yield a list of instances of that application.
id: Pertama, Django mencari untuk kecocokan :term:`application namespace` (dalam contoh ini, ``'polls'``). Ini akan menghasilkan daftar dari instance dari aplikasi itu.

source: If there is a current application defined, Django finds and returns the URL resolver for that instance. The current application can be specified with the ``current_app`` argument to the :func:`~django.urls.reverse()` function.
id: Jika ada aplikasi saat ini ditentukan, Django menemukan dan mengembalikan penyelesai URL untuk instance itu. Aplikasi saat ini dapat ditentukan dengan argumen ``current_app`` ke fungsi :func:`~django.urls.reverse()`.

source: Using this setup, the following lookups are possible:
id: Menggunakan pengaturan ini, pencarian berikut adalah mungkin:

source: In the method of a class-based view::
id: Dalam metode dari tampilan berdasarkan-kelas::

source: and in the template:
id: dan di cetakan:

source: URL namespaces and included URLconfs
id: Namespace URL dan URLconf disertakan

source: Application namespaces of included URLconfs can be specified in two ways.
id: Namespace-namespace aplikasi dari URLconf disertakan dapat ditentukan dalam dua cara.

source: The URLs defined in ``polls.urls`` will have an application namespace ``polls``.
id: URL ditentukan dalam ``polls.urls`` akan memiliki sebuah namespace aplikasi ``polls``.

source: This will include the nominated URL patterns into the given application namespace.
id: Ini akan menyertakan pola URL ditunjuk kedalam namespace aplikasi diberikan.

source: Writing views
id: Menulis tampilan

source: A simple view
id: Tampilan sederhana

source: Here's a view that returns the current date and time, as an HTML document::
id: Disini adalah tampilan yang mengembalikan data dan waktu saat ini, sebagai sebuah dokumen HTML::

source: Let's step through this code one line at a time:
id: Mari kita melangkah melalui kode ini satu baris pada saat bersamaan:

source: First, we import the class :class:`~django.http.HttpResponse` from the :mod:`django.http` module, along with Python's ``datetime`` library.
id: Pertama, kami impor kelas :class:`~django.http.HttpResponse` dari modul :mod:`django.http`, bersama dengan pustaka ``datetime`` Python.

source: The view returns an :class:`~django.http.HttpResponse` object that contains the generated response. Each view function is responsible for returning an :class:`~django.http.HttpResponse` object. (There are exceptions, but we'll get to those later.)
id: Tampilan mengembalikan sebuah obyek :class:`~django.http.HttpResponse`yang mengandung tanggapan dibangkitkan. Setiap fungsi tampilan bertanggungjawab untuk mengembalikan sebuah obyek :class:`~django.http.HttpResponse`. (ada pengecualian, tetapi kita akan kesana nanti.)

source: Django's Time Zone
id: Zona Waktu Django

source: Django includes a :setting:`TIME_ZONE` setting that defaults to ``America/Chicago``. This probably isn't where you live, so you might want to change it in your settings file.
id: Django menyertakan sebuah pengaturan :setting:`TIME_ZONE` yang awalan pada ``America/Chicago``.Ini mungkin bukan dimana anda tinggal, jadi anda mungkin ingin merubah itu dalam berkas pengaturan anda.

source: Mapping URLs to views
id: Memetakan URL ke tampilan

source: So, to recap, this view function returns an HTML page that includes the current date and time. To display this view at a particular URL, you'll need to create a *URLconf*; see :doc:`/topics/http/urls` for instructions.
id: Jadi, untuk mengikhtisarkan, fungsi tampilan ini mengembalikan sebuah halaman HTML yang menyertakan tanggal dan waktu saat ini. Untuk menampilkan tampilan ini pada URL tertentu, anda akan butuh membuat sebuah *URLconf*; lihat :doc:`/topics/http/urls` untuk petunjuk.

source: Returning errors
id: Mengembalikan kesalahan

source: Returning HTTP error codes in Django is easy. There are subclasses of :class:`~django.http.HttpResponse` for a number of common HTTP status codes other than 200 (which means *"OK"*). You can find the full list of available subclasses in the :ref:`request/response <ref-httpresponse-subclasses>` documentation. Just return an instance of one of those subclasses instead of a normal :class:`~django.http.HttpResponse` in order to signify an error. For example::
id: Mengembalikan kode-kode kesalahan HTTP dalam Django adalah mudah. Ada subkelas-subkelas dari :class:`~django.http.HttpResponse` untuk sejumlah kode-kode keadaan HTTP umum selain dari 200 (yang berarti *"OK"*).Anda dapat menemukan daftar penuh dari subkelas-subkelas tersedia dalam dokumentasi :ref:`request/response 1`. Cukup mengembalikan satu dari subkelas-subkelas tersebut daripada :class:`~django.http.HttpResponse` biasa untuk menandakan sebuah kesalahan. Sebagai contoh::

source: There isn't a specialized subclass for every possible HTTP response code, since many of them aren't going to be that common. However, as documented in the :class:`~django.http.HttpResponse` documentation, you can also pass the HTTP status code into the constructor for :class:`~django.http.HttpResponse` to create a return class for any status code you like. For example::
id: Tidak ada subkelas khusus untuk setiap kemungkinan kode tanggapan HTTP, sejak banyak dari mereka tidak akan menjadi yang umum. Bagaimanapun, seperti didokumentasikan dalam dokumentasi :class:`~django.http.HttpResponse`, anda dapat juga melewatkan kode keadaan HTTP kedalam pembangun untuk :class:`~django.http.HttpResponse` untuk membuat kelas kembalian untuk kode keadaan apapun anda sukai. Sebagai contoh::

source: Because 404 errors are by far the most common HTTP error, there's an easier way to handle those errors.
id: Karena kesalahan 404 sejauh ini paling umum kesalahan HTTP, ada sebuah cara paling mudah untuk menangani kesalahan-kesalahan tersebut.

source: The ``Http404`` exception
id: Pengecualian ``Http404``

source: When you return an error such as :class:`~django.http.HttpResponseNotFound`, you're responsible for defining the HTML of the resulting error page::
id: Ketika anda mengembalikan sebuah kesalahan seperti :class:`~django.http.HttpResponseNotFound`, anda bertanggung jawab untuk menentukan HTML dari menghasilkan halaman kesalahan::

source: For convenience, and because it's a good idea to have a consistent 404 error page across your site, Django provides an ``Http404`` exception. If you raise ``Http404`` at any point in a view function, Django will catch it and return the standard error page for your application, along with an HTTP error code 404.
id: Untuk kenyamanan, dan karena itu adalah ide bagus untuk memiliki halaman kesalahan 404 tetap terhadap situs anda, Django menyediakan sebuah pengecualian ``Http404`` pada titik apapun dalam fungsi tampilan, Django akan menangkap itu dan mengembalikan halaman kesalahan standar untuk aplikasi anda, bersama dengan sebuah kode kesalahan HTTP 404.

source: In order to show customized HTML when Django returns a 404, you can create an HTML template named ``404.html`` and place it in the top level of your template tree. This template will then be served when :setting:`DEBUG` is set to ``False``.
id: Untuk menampilkan HTML disesuaikan ketika Django mengembalikan sebuah 404, anda dapat membuat sebuah cetakan HTML bernama ``404.html`` dan menempatkan itu dalam tingkat atas dari pohon cetakan anda. Cetakan anda kemudian akan dilayani ketika :setting:`DEBUG`disetel menjadi ``False``.

source: When :setting:`DEBUG` is ``True``, you can provide a message to ``Http404`` and it will appear in the standard 404 debug template. Use these messages for debugging purposes; they generally aren't suitable for use in a production 404 template.
id: Ketika :setting:`DEBUG` adalah ``True``, anda dapat menyediakan sebuah pesan pada ``Http404``dan itu akan muncul dalam cetakan mencari kesalahan 404 standar. Gunakan pesan-pesan ini untuk tujuan mencari kesalahan; mereka umumnya tidak cocok untuk digunakan dalam produksi cetakan 404.

source: Customizing error views
id: Menyesuaikan tampilan kesalahan

source: The default error views in Django should suffice for most Web applications, but can easily be overridden if you need any custom behavior. Simply specify the handlers as seen below in your URLconf (setting them anywhere else will have no effect).
id: Tampilan-tampilan kesalahan awalan dalam Django harus cukup untuk kebanyakan aplikasi Jaringan, tetapi dapat dengan mudan ditimpa jika anda butuh penyesuaian perilaku apapun. Cukup menentukan penangan seperti dilihat dibawah dalam URLconf (mengatur mereka dimanapun tidak akan mempunyai pengaruh).

source: The :func:`~django.views.defaults.page_not_found` view is overridden by :data:`~django.conf.urls.handler404`::
id: Tampilan :func:`~django.views.defaults.page_not_found` ditimpa oleh :data:`~django.conf.urls.handler404`::

source: The :func:`~django.views.defaults.server_error` view is overridden by :data:`~django.conf.urls.handler500`::
id: Tampilan :func:`~django.views.defaults.server_error` ditimpa oleh :data:`~django.conf.urls.handler500`::

source: The :func:`~django.views.defaults.permission_denied` view is overridden by :data:`~django.conf.urls.handler403`::
id: Tampilan :func:`~django.views.defaults.permission_denied` ditimpa oleh :data:`~django.conf.urls.handler403`::

source: The :func:`~django.views.defaults.bad_request` view is overridden by :data:`~django.conf.urls.handler400`::
id: Tampilan :func:`~django.views.defaults.bad_request` ditimpa oleh :data:`~django.conf.urls.handler400`::

source: Use the :setting:`CSRF_FAILURE_VIEW` setting to override the CSRF error view.
id: Gunakan pengaturan :setting:`CSRF_FAILURE_VIEW` untuk menimpa tampilan kesalahan CSRF.

source: When it's enabled, two users accessing the same content may see dates, times and numbers formatted in different ways, depending on the formats for their current locale.
id: Ketika itu diadakan, dua pengguna mengakses isi sama mungkin melihat tanggal, waktu dan ang berbentuk dalam cara berbeda, tergantung pada bentuk untuk lokal saat ini.

source: The formatting system is disabled by default. To enable it, it's necessary to set :setting:`USE_L10N = True <USE_L10N>` in your settings file.
id: Sistem pembentukan ditiadakan secara awalan. Untuk mengadakan itu, itu diperlukan untuk mengatur :setting:`USE_L10N = True 1` dalam berkas pengaturan anda.

source: The default :file:`settings.py` file created by :djadmin:`django-admin startproject <startproject>` includes :setting:`USE_L10N = True <USE_L10N>` for convenience. Note, however, that to enable number formatting with thousand separators it is necessary to set :setting:`USE_THOUSAND_SEPARATOR = True <USE_THOUSAND_SEPARATOR>` in your settings file. Alternatively, you could use :tfilter:`intcomma` to format numbers in your template.
id: Berkas :file:`settings.py` awalan dibuat oleh :djadmin:`django-admin startproject 1` menyertakan :setting:`USE_L10N = True 2` untuk kenyamanan. Catat, bagaimanapun, bahwa untuk mengadakan sejumlah pembentukan dengan pemisah ribuan itu diperlukan menyetel :setting:`USE_THOUSAND_SEPARATOR = True 3`dalam berkas pengaturan anda. Cara lain, anda dapat menggunakan :tfilter:`intcomma` untuk membentuk sejumlah dalam cetakan anda.

source: There is also an independent but related :setting:`USE_I18N` setting that controls if Django should activate translation. See :doc:`/topics/i18n/translation` for more details.
id: Ada juga berdiri sendiri tetapi terkait pengaturan :setting:`USE_I18N` yang mengendalikan jika Django harus aktif terjemahan. Lihat :doc:`/topics/i18n/translation`untuk rincian lebih.

source: When formatting is enabled, Django can use localized formats when parsing dates, times and numbers in forms. That means it tries different formats for different locales when guessing the format used by the user when inputting data on forms.
id: Ketika pembentukan diadakan, Django menggunakan bentuk lokalisasi ketika mengurai tanggal, waktu dan sejumlah dalam formulir. Itu berarti itu mencoba bentuk berbeda untuk lokal-lokal berbeda ketika menebak bentuk digunakan oleh pengguna ketika memasukkan data pada formulir.

source: Django uses different formats for displaying data to those it uses for parsing data. Most notably, the formats for parsing dates can't use the ``%a`` (abbreviated weekday name), ``%A`` (full weekday name), ``%b`` (abbreviated month name), ``%B`` (full month name), or ``%p`` (AM/PM).
id: Django menggunakan bentuk-bentuk berbeda untuk menampilkan data pada itu digunakan untuk mengurai data. Kebanyakan terutama, bentuk-bentuk untuk mengurai tanggal tidak dapat menggunakan ``%a`` (nama hari kerja disingkat), ``%A`` (nama hari kerja penuh), ``%b`` (nama bulan disingkat), ``%B`` (nama bulan penuh), atau ``%p`` (AM/PM).

source: To enable a form field to localize input and output data simply use its ``localize`` argument::
id: Untuk mengadakan bidang formulir untuk melokalkan data masukan dan keluaran cukup gunakan argumen ``localize``::

source: Controlling localization in templates
id: Mengendalikan lokalisasi dalam cetakan-cetakan

source: When you have enabled formatting with :setting:`USE_L10N`, Django will try to use a locale specific format whenever it outputs a value in a template.
id: Ketika anda mengadakan pembentukan dengan :setting:`USE_L10N`, Django akan mencoba menggunakan bentuk khusus lokal kapanpun itu mengeluarkan sebuah nilai dalam sebuah cetakan.

source: However, it may not always be appropriate to use localized values -- for example, if you're outputting JavaScript or XML that is designed to be machine-readable, you will always want unlocalized values. You may also want to use localization in selected templates, rather than using localization everywhere.
id: Bagaimanapun, itu mungkin tidak selalu sesuai untuk menggunakan nilai-nilai lokal -- sebagai contoh, jika anda sedang mengeluarkan JavaScript atau XML yang dirancang untuk menjadi dapat-dibaca-mesin, anda akan selalu ingin nilai-nilai tidak terlokalisasi. Anda mungkin ingin juga menggunakan lokalisasi dalam cetakan-cetakan terpilih, daripada menggunakan lokalisasi dimanapun,

source: To allow for fine control over the use of localization, Django provides the ``l10n`` template library that contains the following tags and filters.
id: Untuk mengizinkan pengendalian baik terhadap penggunaan lokalisasi, Django menyediakan pustaka cetakan ``l10n`` yang mengandung etiket-etiket dan penyaring-penyaring berikut

source: Template tags
id: Etiket cetakan

source: Enables or disables localization of template variables in the contained block.
id: Mengadakan atau meniadakan lokalisasi dari variabel-variabel cetakan dalam blok terkandung.

source: This tag allows a more fine grained control of localization than :setting:`USE_L10N`.
id: Etiket ini mengizinkan pengendalian berkurai baik dari lokalisasi daripada :setting:`USE_L10N`.

source: To activate or deactivate localization for a template block, use::
id: Untuk mengaktifkan atau menonaktifkan lokalisasi untuk sebuah blok cetakan, gunakan::

source: The value of :setting:`USE_L10N` isn't respected inside of a ``{% localize %}`` block.
id: Nilai dari :setting:`USE_L10N` tidak dihormati dalam dari blok ``{% localize %}``.

source: See :tfilter:`localize` and :tfilter:`unlocalize` for template filters that will do the same job on a per-variable basis.
id: Lihat :tfilter:`localize` dan :tfilter:`unlocalize`untuk penyaring cetakan yang akan melakukan pekerjaan sama pada dasar per-variabel.

source: Template filters
id: Filter templat

source: Forces localization of a single value.
id: memaksa lokalisasi pada sebuah nilai tunggal.

source: To disable localization on a single value, use :tfilter:`unlocalize`. To control localization over a large section of a template, use the :ttag:`localize` template tag.
id: Untuk meniadakan lokalisasi pada sebuah nilai tunggal, gunakan :tfilter:`unlocalize`. Untuk mengendalikan lokalisasi terhadap bagian besar dari sebuah cetakan, gunakan etiket cetakan :ttag:`localize`.

source: Forces a single value to be printed without localization.
id: Memaksa sebuah nilai tunggal untuk dicetak tanpa lokalisasi.

source: To force localization of a single value, use :tfilter:`localize`. To control localization over a large section of a template, use the :ttag:`localize` template tag.
id: Untuk memaksa lokalisasi pada sebuah nilai tunggal, gunakan :tfilter:`localize`. Untuk mengendalikan lokalisasi terhadap bagian besar dari sebuah cetakan, gunakan etiket cetakan :ttag:`localize`.

source: Creating custom format files
id: Membuat berkas bentuk disesuaikan

source: Django provides format definitions for many locales, but sometimes you might want to create your own, because a format files doesn't exist for your locale, or because you want to overwrite some of the values.
id: Django menyediakan pengertian bentuk untuk banyak lokal-lokal, tetapi terkadang anda mungkin ingin membuat anda sendiri, karena berkas-berkas bentuk tidak ada untuk lokal anda, atau karena anda ingin menimpa beberapa dari nilai-nilai.

source: To use custom formats, specify the path where you'll place format files first. To do that, just set your :setting:`FORMAT_MODULE_PATH` setting to the package where format files will exist, for instance::
id: Untuk menggunakan bentuk penyesuaian, tentukan jalur dimana anda akan menempatkan berkas-berkas bentuk dahulu. Untuk melakukan itu, cukup setel pengaturan :setting:`FORMAT_MODULE_PATH` anda pada paket dimana berkas-berkas bentuk akan ada, sebagai contoh::

source: Files are not placed directly in this directory, but in a directory named as the locale, and must be named ``formats.py``. Be careful not to put sensitive information in these files as values inside can be exposed if you pass the string to ``django.utils.formats.get_format()`` (used by the :tfilter:`date` template filter).
id: Berkas-berkas tidak ditempatkan langsung dalam direktori ini, tetapi dalam sebuah direktori bernama seperti lokal, dan harus dinamai ``formats.py``. Waspadalah tidak menaruh informasi sensitif dalam berkas-berkas ini didalam dapat dikeluarkan jika anda melewatkan string ``django.utils.formats.get_format()`` (digunakan oleh penyaring cetakan :tfilter:`date`).

source: To customize the English formats, a structure like this would be needed::
id: Untuk menyesuaikan bentuk Inggris, sebuah struktur seperti ini akan diperlukan::

source: where :file:`formats.py` contains custom format definitions. For example::
id: Selagi :file:`formats.py` mengandung pengertian bentuk penyesuaian. Sebagai contoh::

source: Limitations of the provided locale formats
id: Batasan-batasan dari bentuk lokal disediakan.

source: Switzerland (German)
id: Swis (Jerman)

source: Internationalization and localization
id: Internasionalisasi dan lokalisasi

source: The goal of internationalization and localization is to allow a single Web application to offer its content in languages and formats tailored to the audience.
id: Tujuan dari internasionalisasi dan lokalisasi adalah mengizinkan aplikasi Jaringan tunggal menawarkan isinya dalam bahasa dan bentuk disesuaikan ke hadirin.

source: Essentially, Django does two things:
id: Pada dasarnya, Django melakukan dua hal:

source: Definitions
id: Penentuan

source: internationalization
id: internasionalisasi

source: localization
id: pelokalan

source: Here are some other terms that will help us to handle a common language:
id: Disini adalah beberapa ketentuan lain yang akan membantu kami menangani bahasa umum:

source: locale name
id: nama lokal

source: language code
id: kode bahasa
