Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: To print the SQL that would be run, rather than run it, use the :option:`createcachetable --dry-run` option.
id: Untuk mencetak SQL yang akan menjalankan, daripada menjalankannya, gunakan pilihan :option:`createcachetable --dry-run`.

source: Multiple databases
id: Basisdata banyak

source: If you use database caching with multiple databases, you'll also need to set up routing instructions for your database cache table. For the purposes of routing, the database cache table appears as a model named ``CacheEntry``, in an application named ``django_cache``. This model won't appear in the models cache, but the model details can be used for routing purposes.
id: Jika anda menggunakan penembolokan basisdata dengan banyak basisdata, anda akan juga butuh menyetel perintah perutean untuk tabel tembolok basisdata anda. Untuk tujuan perutean, tabel tembolok basisdata muncul sebagai model dinamai ``CacheEntry``, di aplikasi dinamai ``django_cache``. Model ini tidak akan muncul dalam model tembolok, tetapi rincian model dapat digunakan untuk tujuan perutean.

source: For example, the following router would direct all cache read operations to ``cache_replica``, and all write operations to ``cache_primary``. The cache table will only be synchronized onto ``cache_primary``::
id: Sebagai contoh, perute berikut akan melangsungkan semua tindakan pembacaan tembolok ke ``cache_replica``, dan semua tindakan penulisan ke ``cache_primary``. Tabel tembolok hanya disinkronisasikan kedalam ``cache_primary``::

source: If you don't specify routing directions for the database cache model, the cache backend will use the ``default`` database.
id: Jika anda tidak menentukan arah perute untuk model cache basisdata, backend cache akan menggunakan basisdata ``default``.

source: Of course, if you don't use the database cache backend, you don't need to worry about providing routing instructions for the database cache model.
id: Tentu saja, jika anda tidak menggunakan backend cache basisdata, anda tidak perlu khawatir tentang menyediakan petunjuk perutean untuk model cache basisdata.

source: Filesystem caching
id: Cache sistem berkas

source: The file-based backend serializes and stores each cache value as a separate file. To use this backend set :setting:`BACKEND <CACHES-BACKEND>` to ``"django.core.cache.backends.filebased.FileBasedCache"`` and :setting:`LOCATION <CACHES-LOCATION>` to a suitable directory. For example, to store cached data in ``/var/tmp/django_cache``, use this setting::
id: Serial backend berdasarkan-berkas dan menyimpan setiap nilai cache sebagai berkas terpisah. Untuk menggunakan backend ini setel :setting:`BACKEND <CACHES-BACKEND>` menjadi ``"django.core.cache.backends.filebased.FileBasedCache"`` dan :setting:`LOCATION <CACHES-LOCATION>` menjadi direktori yang cocok. Sebagai contoh, untuk menyimpan data di ``/var/tmp/django_cache``, gunakan pengaturan ini::

source: If you're on Windows, put the drive letter at the beginning of the path, like this::
id: Jika anda berada di Windows, taruh huruf drive pada awal jalur, seperti ini::

source: The directory path should be absolute -- that is, it should start at the root of your filesystem. It doesn't matter whether you put a slash at the end of the setting.
id: Jalur direktori harus mutlak -- yaitu, itu harus dimulai pada induk dari sistem berkas anda. Itu tidak mengapa apakah anda menaruh sebuah garis miring pada akhir pengaturan.

source: Make sure the directory pointed-to by this setting exists and is readable and writable by the system user under which your Web server runs. Continuing the above example, if your server runs as the user ``apache``, make sure the directory ``/var/tmp/django_cache`` exists and is readable and writable by the user ``apache``.
id: Pastikan direktori menunjuk-ke oleh pengaturan ini ada dan dapat dibaca dan ditulis oleh pengguna sistem dibawah dimana peladen Jaringan anda berjalan. Melanjutkan contoh diatas, jika peladen anda berjalan sebagai pengguna ``apache``, pastikan direktori ``/var/tmp/django_cache`` ada dan dapat dibaca dan ditulis oleh pengguna ``apache``.

source: Local-memory caching
id: Cache memori-lokal

source: This is the default cache if another is not specified in your settings file. If you want the speed advantages of in-memory caching but don't have the capability of running Memcached, consider the local-memory cache backend. This cache is per-process (see below) and thread-safe. To use it, set :setting:`BACKEND <CACHES-BACKEND>` to ``"django.core.cache.backends.locmem.LocMemCache"``. For example::
id: Ini adalah cache awalan jika lainnya tidak ditentukan di berkas pengaturan anda. Jika anda ingin mempercepat keuntungan dari cace di-memori tetapi tidak mempunyai kemampuan dari menjalankan Memcached, perimbangkan backend cache memori-lokal. Cache ini adalah per-pengolahan (lihat dibawah) dan thread-safe. Untuk menggunakan itu, setel :setting:`BACKEND <CACHES-BACKEND>` menjadi ``"django.core.cache.backends.locmem.LocMemCache"``. Sebagai contoh::

source: The cache :setting:`LOCATION <CACHES-LOCATION>` is used to identify individual memory stores. If you only have one ``locmem`` cache, you can omit the :setting:`LOCATION <CACHES-LOCATION>`; however, if you have more than one local memory cache, you will need to assign a name to at least one of them in order to keep them separate.
id: Cache :setting:`LOCATION <CACHES-LOCATION>` digunakan untuk mencirikan penyimpanan memori tersendiri. Jika anda hanya mempunyai satu cache ``locmem``, anda dapat mengabaikan :setting:`LOCATION <CACHES-LOCATION>`; bagaimanapun, jikla anda mempunyai lebih dari satu cache memori lokal, anda akan butuh memberikan sebuah nama pada setidaknya satu dari mereka agar menjaga mereka terpisah.

source: Note that each process will have its own private cache instance, which means no cross-process caching is possible. This obviously also means the local memory cache isn't particularly memory-efficient, so it's probably not a good choice for production environments. It's nice for development.
id: Catat bahwa setiap pengolahan akan mempunyai instance cache pribadi sendiri, yang berarti tidak ada cache lintas-pengolahan dimungkinkan. Ini jelas juga berarti cache memori lokal tidak secara khusus efesien-memori, jadi itu kemungkinan bukan pilihan bagus untuk lingkungan produksi. Itu adalah bagus untuk pengembangan.

source: Dummy caching (for development)
id: Cache tiruan (untuk pengembangan)

source: Finally, Django comes with a "dummy" cache that doesn't actually cache -- it just implements the cache interface without doing anything.
id: Akhirnya, Django datang dengan cache "dummy" yang tidak sebenarnya cache -- itu hanya menerapkan antarmuka cache tanpa melakukan apapun.

source: This is useful if you have a production site that uses heavy-duty caching in various places but a development/test environment where you don't want to cache and don't want to have to change your code to special-case the latter. To activate dummy caching, set :setting:`BACKEND <CACHES-BACKEND>` like so::
id: Ini adalah sangat berguna jika anda mempunyai situs produksi yang menggunakan cache pekerjaan-berat di beragam tempat tetapi lingkungan pengembangan/percobaan dimana anda tidak ingin cache dan tidak ingin merubah kode anda pada kasus-khusus terakhir. Untuk mengaktifkan cache dummy, setel :setting:`BACKEND <CACHES-BACKEND>` seperti begitu::

source: Using a custom cache backend
id: Menggunakan backend cache penyesuaian

source: While Django includes support for a number of cache backends out-of-the-box, sometimes you might want to use a customized cache backend. To use an external cache backend with Django, use the Python import path as the :setting:`BACKEND <CACHES-BACKEND>` of the :setting:`CACHES` setting, like so::
id: Selagi Django menyertakan dukungan untuk sejumlah backend cache keluar-dari-kotak, terkadang anda mungkin ingin menggunakan backend cache disesuaikan. Untuk menggunakan backend cache luar dengan Django, gunakan jalur impor Python sebagai :setting:`BACKEND <CACHES-BACKEND>` dari :setting:`CACHES` setting, seperti begitu::

source: If you're building your own backend, you can use the standard cache backends as reference implementations. You'll find the code in the ``django/core/cache/backends/`` directory of the Django source.
id: Jika anda sedang membangun backend anda sendiri, anda dapat menggunakan backend cache standar sebagai acuan penerapan. Anda akan menemukan kode di direktori ``django/core/cache/backends/`` dari sumber Django.

source: Note: Without a really compelling reason, such as a host that doesn't support them, you should stick to the cache backends included with Django. They've been well-tested and are easy to use.
id: Catat: tanpa alasan yang sangat menarik, seperti sebuah rumah yang tidak mendukung mereka, anda harus menancapkan ke backend cache disertakan dengan Django. Mereka telah dicoba-baik dan mudah digunakan.

source: Cache arguments
id: Argumen cache

source: Each cache backend can be given additional arguments to control caching behavior. These arguments are provided as additional keys in the :setting:`CACHES` setting. Valid arguments are as follows:
id: Setiap backend cache dapat memberikan argumen tambahan untuk mengendalikan perilaku cache. Argumen-argumen ini disediakan sebagai kunci-kunci tambahan di pengaturan :setting:`CACHES`. Argumen-argumen sah seperti berikut:

source: :setting:`TIMEOUT <CACHES-TIMEOUT>`: The default timeout, in seconds, to use for the cache. This argument defaults to ``300`` seconds (5 minutes). You can set ``TIMEOUT`` to ``None`` so that, by default, cache keys never expire. A value of ``0`` causes keys to immediately expire (effectively "don't cache").
id: :setting:`TIMEOUT <CACHES-TIMEOUT>`: Awalan waktu habis, dalam detik, untuk digunakan untuk cache. Awalan argumen ini pada ``300`` detik (5 menit). Anda dapat mensetel ``TIMEOUT`` menjadi ``None`` sehingga, secara awalan, kunci-kunci cache tidak pernah kadaluarsa. Sebuah nilai ``0`` menyebabkan kunci segera kadaluarsa (efektifnya "don't cache").

source: :setting:`OPTIONS <CACHES-OPTIONS>`: Any options that should be passed to the cache backend. The list of valid options will vary with each backend, and cache backends backed by a third-party library will pass their options directly to the underlying cache library.
id: :setting:`OPTIONS <CACHES-OPTIONS>`: Pilihan apapun yang harus dilewatkan ke backend cache. Daftar dari pilihan sah akan beragam dengan setiap backend, dan backend cache oleh pustaka pihak-ketiga akan melewatkan pilihan mereka langsung ke pustaka cache pokok.

source: Cache backends that implement their own culling strategy (i.e., the ``locmem``, ``filesystem`` and ``database`` backends) will honor the following options:
id: Backend cache yang menerapkan strategi pemusnahan mereka sendiri (yaitu, backend `locmem``, ``filesystem`` dan ``database``) akan menghormati pilihan-pilihan berikut:

source: ``MAX_ENTRIES``: The maximum number of entries allowed in the cache before old values are deleted. This argument defaults to ``300``.
id: ``MAX_ENTRIES``: Nomor maksimal dari masukan diizinkan di cache sebelum nilai-nilai lama dihapus. Argumen ini awalan pada ``300``.

source: ``CULL_FREQUENCY``: The fraction of entries that are culled when ``MAX_ENTRIES`` is reached. The actual ratio is ``1 / CULL_FREQUENCY``, so set ``CULL_FREQUENCY`` to ``2`` to cull half the entries when ``MAX_ENTRIES`` is reached. This argument should be an integer and defaults to ``3``.
id: `CULL_FREQUENCY``: Pecahan masukan yang dimusnahkan ketika ``MAX_ENTRIES`` dicapai. Rasio sebenarnya adalah ``1 / CULL_FREQUENCY``, jadi menyetel ``CULL_FREQUENCY`` menjadi ``2`` pada pemusnahan setengah masukan ketika ``MAX_ENTRIES``dicapai. Argumen ini harus berupa integer dan awalan pada ``3``.

source: A value of ``0`` for ``CULL_FREQUENCY`` means that the entire cache will be dumped when ``MAX_ENTRIES`` is reached. On some backends (``database`` in particular) this makes culling *much* faster at the expense of more cache misses.
id: Sebuah nilai dari ``0`` untuk ``CULL_FREQUENCY`` berarti bahwa keseluruhan cache akan dibuang ketika ``MAX_ENTRIES`` dicapai. Pada beberapa backend (``database`` khususnya) ini membuat pemusnahan *jauh* lebih cepat pada pengeluaran dari lebih cache luput.

source: Memcached backends pass the contents of :setting:`OPTIONS <CACHES-OPTIONS>` as keyword arguments to the client constructors, allowing for more advanced control of client behavior. For example usage, see below.
id: Backend memcache melewatkan isi dari :setting:`OPTIONS 1` sebagai argumen katakunci pada pembangun klien, mengizinkan untuk lebih lanjut mengendalikan perilaku klien. Sebagai contoh penggunaan, lihat dibawah.

source: :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`: A string that will be automatically included (prepended by default) to all cache keys used by the Django server.
id: :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`: Sebuah string yang akan otomatis disertakan (ditambahkan secara awalan) ke semua kunci-kunci cache digunakan oleh peladen Django.

source: See the :ref:`cache documentation <cache_key_prefixing>` for more information.
id: Lihat :ref:`cache documentation <cache_key_prefixing>` untuk informasi lebih.

source: :setting:`VERSION <CACHES-VERSION>`: The default version number for cache keys generated by the Django server.
id: :setting:`VERSION <CACHES-VERSION>`: Nomor versi awalan untuk kunci-kunci cache dibangkitkan oleh peladen Django.

source: See the :ref:`cache documentation <cache_versioning>` for more information.
id: Lihat the :ref:`cache documentation <cache_versioning>` untuk informasi lebih.

source: :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` A string containing a dotted path to a function that defines how to compose a prefix, version and key into a final cache key.
id: :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` Sebuah string mengandung jalur bertitik pada sebuah fungsi yang menentukan bagaimana menyusun sebuah awalan, versi dan kunci kedalam kunci cache akhir.

source: See the :ref:`cache documentation <cache_key_transformation>` for more information.
id: Lihat :ref:`cache documentation <cache_key_transformation>` untuk informasi lebih.

source: In this example, a filesystem backend is being configured with a timeout of 60 seconds, and a maximum capacity of 1000 items::
id: Di contoh ini, backend sistem berkas sedang dikonfigurasikan dengan waktu habis dari 60 detik, dan kapasitas maksimal dari 1000 barang::

source: Here's an example configuration for a ``python-memcached`` based backend with an object size limit of 2MB::
id: Ini adalah sebuah contoh konfigurasi untuk backend berdasarkan ``python-memcached`` dengan batasan sebuah ukuran obyek dari 2 MB::

source: Here's an example configuration for a ``pylibmc`` based backend that enables the binary protocol, SASL authentication, and the ``ketama`` behavior mode::
id: Ini adalah sebuah contoh konfigurasi untuk backend berdasarkan ``pylibmc`` yang mengadakan protokol biner, autentifikasi SASL, dan suasana perilaku ``ketama``::

source: The per-site cache
id: Cache per-site

source: Once the cache is set up, the simplest way to use caching is to cache your entire site. You'll need to add ``'django.middleware.cache.UpdateCacheMiddleware'`` and ``'django.middleware.cache.FetchFromCacheMiddleware'`` to your :setting:`MIDDLEWARE` setting, as in this example::
id: Sekali cache disetel, cara termudah menggunakan cacge adalah cache situs anda seluruhnya. Anda akan butuh menambahkan ``'django.middleware.cache.UpdateCacheMiddleware'`` dan ``'django.middleware.cache.FetchFromCacheMiddleware'`` ke pengaturan :setting:`MIDDLEWARE` anda, seperti di contoh ini::

source: No, that's not a typo: the "update" middleware must be first in the list, and the "fetch" middleware must be last. The details are a bit obscure, but see `Order of MIDDLEWARE`_ below if you'd like the full story.
id: Tidak, itu bukan salah ketik: middleware "update" harus pertama di daftar, dan middleware "fetch" harus di terakhir. Rincian sedikit mengaburkan, tetapi lihat `Order of MIDDLEWARE`_ dibawah jika anda ingin cerita penuh.

source: Then, add the following required settings to your Django settings file:
id: Kemudian, tambah pengaturan dibutuhkan berikut ke berkas pengaturan Django anda:

source: :setting:`CACHE_MIDDLEWARE_ALIAS` -- The cache alias to use for storage.
id: :setting:`CACHE_MIDDLEWARE_ALIAS` -- nama lain tembolok untuk digunakan untuk penyimpanan.

source: :setting:`CACHE_MIDDLEWARE_SECONDS` -- The number of seconds each page should be cached.
id: :setting:`CACHE_MIDDLEWARE_SECONDS` -- Jumlah dari detik setiap halaman harus disimpan.

source: :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` -- If the cache is shared across multiple sites using the same Django installation, set this to the name of the site, or some other string that is unique to this Django instance, to prevent key collisions. Use an empty string if you don't care.
id: :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` -- jika cacge dibagi lintas banyak situs menggunakan pemasangan Django sama, setel ke nama dari situs, atau beberapa string lain yang unik pada instance Django ini, untuk mencegah tabrakan kunci. Gunakan sebuah string kosong jika anda tidak peduli.

source: ``FetchFromCacheMiddleware`` caches GET and HEAD responses with status 200, where the request and response headers allow. Responses to requests for the same URL with different query parameters are considered to be unique pages and are cached separately. This middleware expects that a HEAD request is answered with the same response headers as the corresponding GET request; in which case it can return a cached GET response for HEAD request.
id: ``FetchFromCacheMiddleware`` cache tanggapan GET dan HEAD dengan keadaan 200, dimana kepala permintaan dan tanggapan diizinkan. Tanggapan pada permintaan untuk URL sama dengan parameter permintaan berbeda dianggap menjadi halaman unik dan di cache terpisah. Middleware ini mengharapkan bahwa sebuah permintaan HEAD dijawab dengan kepala tanggapan sesuai seperti permintaan GET berkaitan; dalam hal ini itu dapat mengembalikan sebuah tanggapan GET cache untuk permintaan HEAD.

source: Additionally, ``UpdateCacheMiddleware`` automatically sets a few headers in each :class:`~django.http.HttpResponse`:
id: Tambahannya, ``UpdateCacheMiddleware`` otomatis menyetel sedikit kepala di setiap :class:`~django.http.HttpResponse`:

source: Sets the ``Expires`` header to the current date/time plus the defined :setting:`CACHE_MIDDLEWARE_SECONDS`.
id: Setel kepala ``Expires`` ke tanggal/waktu saat ini ditambah menentukan :setting:`CACHE_MIDDLEWARE_SECONDS`.

source: Sets the ``Cache-Control`` header to give a max age for the page -- again, from the :setting:`CACHE_MIDDLEWARE_SECONDS` setting.
id: Setel kepala ``Cache-Control`` untuk memberikan umur maksimal untuk halaman -- kembali, dari pengaturan :setting:`CACHE_MIDDLEWARE_SECONDS`.

source: See :doc:`/topics/http/middleware` for more on middleware.
id: Lihat :doc:`/topics/http/middleware` untuk lebih pada middleware

source: If a view sets its own cache expiry time (i.e. it has a ``max-age`` section in its ``Cache-Control`` header) then the page will be cached until the expiry time, rather than :setting:`CACHE_MIDDLEWARE_SECONDS`. Using the decorators in ``django.views.decorators.cache`` you can easily set a view's expiry time (using the :func:`~django.views.decorators.cache.cache_control` decorator) or disable caching for a view (using the :func:`~django.views.decorators.cache.never_cache` decorator). See the `using other headers`__ section for more on these decorators.
id: Jika sebuah tampilan menyetel waktu kadaluarsa cache nya sendiri (yaitu itu mempunyai bagian ``max-age`` di kepala ``Cache-Control`` nya) kemudian halaman akan di cache sampai waktu kadaluarsa, daripada :setting:`CACHE_MIDDLEWARE_SECONDS`. menggunakan penghias di ``django.views.decorators.cache`` anda dapat dengan mudah mensetel sebuah waktu kadaluarsa tampilan (menggunakan penghias :func:`~django.views.decorators.cache.cache_control`) atau meniadakan cache untuk sebuah tampilan (menggunakan penghias :func:`~django.views.decorators.cache.never_cache` decorator). Lihat bagian `using other headers`__ pada penghias ini.

source: If :setting:`USE_I18N` is set to ``True`` then the generated cache key will include the name of the active :term:`language<language code>` -- see also :ref:`how-django-discovers-language-preference`). This allows you to easily cache multilingual sites without having to create the cache key yourself.
id: Jika :setting:`USE_I18N`disetel menjadi ``True`` kemudian membangkitkan kunci cache akan menyertakan nama dari :term:`language<language code>` aktif -- lihat juga :ref:`how-django-discovers-language-preference`). Ini mengizinkan anda dengan mudah cache situs banyak bahasa tanpa harus membuat kunci cache anda sendiri.

source: Cache keys also include the active :term:`language <language code>` when :setting:`USE_L10N` is set to ``True`` and the :ref:`current time zone <default-current-time-zone>` when :setting:`USE_TZ` is set to ``True``.
id: Kunci-kunci cache juga menyertakan :term:`language <language code>` aktif ketika :setting:`USE_L10N` disetel menjadi ``True`` dan :ref:`current time zone <default-current-time-zone>` ketika :setting:`USE_TZ` disetel menjadi ``True``.

source: The per-view cache
id: Cache per-tampilan

source: A more granular way to use the caching framework is by caching the output of individual views. ``django.views.decorators.cache`` defines a ``cache_page`` decorator that will automatically cache the view's response for you. It's easy to use::
id: Sebuah cara lebih rinci menggunakan kerangka kerja cache adalah dengan cache keluaran dari tampilan tersendiri. ``django.views.decorators.cache`` menentukan sebuah penghias ``cache_page`` yang akan secara otomatis cache tanggapan tampilan untuk anda. Itu mudah digunakan::

source: ``cache_page`` takes a single argument: the cache timeout, in seconds. In the above example, the result of the ``my_view()`` view will be cached for 15 minutes. (Note that we've written it as ``60 * 15`` for the purpose of readability. ``60 * 15`` will be evaluated to ``900`` -- that is, 15 minutes multiplied by 60 seconds per minute.)
id: ``cache_page`` mengambil argumen tunggal: waktu habis cacge, dalam detik. Di contoh diatas, hasil dari tampilan ``my_view()`` akan di cache untuk 15 menit. (catah bahwa kami telah menulis itu sebagai ``60 * 15`` untuk tujuan dapat dibaca. ``60 * 15`` akan di nilai menjadi ``900`` -- yaitu, 15 menit dikalikan oleh 60 detik per menit.)

source: The per-view cache, like the per-site cache, is keyed off of the URL. If multiple URLs point at the same view, each URL will be cached separately. Continuing the ``my_view`` example, if your URLconf looks like this::
id: Cache per-tampilan, seperti cache per-site, adalah diambil sebagai datum masukan kendali dari URL. Jika banyak titik URL pada tampilan sama, setiap URL akan di cache terpisah. Melanjutkan contoh ``my_view``, jika URLconf anda terlihat seperti ini::

source: then requests to ``/foo/1/`` and ``/foo/23/`` will be cached separately, as you may expect. But once a particular URL (e.g., ``/foo/23/``) has been requested, subsequent requests to that URL will use the cache.
id: kemudian permintaan pada ``/foo/1/`` dan ``/foo/23/`` akan di cache terpisah, seprti anda mungkin harapkan. Tetapi sekali URL tertentu (sebagai contoh, ``/foo/23/``) telah diminta, permintaan berikut ke URL itu akan menggunakan cache.
