Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: If you want to combine the parts in different ways, or apply other processing to the final key (e.g., taking a hash digest of the key parts), you can provide a custom key function.
id: Jika anda ingin memadukan bagian-bagian di cara berbeda, atau memberlakukan pengolahan lain menjadi kunci akhir (sebagai contoh, mengambil campuran inti dari bagian-bagian kunci), anda daat menyediakan sebuah fungsi kunci penyesuaian.

source: The :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` cache setting specifies a dotted-path to a function matching the prototype of ``make_key()`` above. If provided, this custom key function will be used instead of the default key combining function.
id: Pengaturan cache :setting:`KEY_FUNCTION <CACHES-KEY_FUNCTION>` menentukan jalur-bertitik pada sebuah fungsi mencocokan purwa-rupa dari ``make_key()`` diatas. Jika disediakan, fungsi kunci penyesuaian ini akan digunakan sebagai gantia dari kunci awalan memadukan fungsi.

source: Cache key warnings
id: Peringatan kunci cache

source: Memcached, the most commonly-used production cache backend, does not allow cache keys longer than 250 characters or containing whitespace or control characters, and using such keys will cause an exception. To encourage cache-portable code and minimize unpleasant surprises, the other built-in cache backends issue a warning (``django.core.cache.backends.base.CacheKeyWarning``) if a key is used that would cause an error on memcached.
id: Memcache, backend cache paling digunakan-umum produksi, tidak mengizinkan kunci cache lebih panjang dari 250 karakter atau mengandung ruang kosong atau kendali karakter, dan menggunakan kunci seperti itu akan menyebabkan sebuah pengecualian. Untuk mendorong kode ringan-cache menerbitkan sebuah peringatan (``django.core.cache.backends.base.CacheKeyWarning``) jika sebuah kecil yang dapat menyebabkan sebuah kesalahan pada memcache.

source: If you are using a production backend that can accept a wider range of keys (a custom backend, or one of the non-memcached built-in backends), and want to use this wider range without warnings, you can silence ``CacheKeyWarning`` with this code in the ``management`` module of one of your :setting:`INSTALLED_APPS`::
id: Jika anda sedang menggunakan backend produksi yang dapat menerima jangkauan lebih luas dari kunci (backend penyesuaian, atau satu dari bukan-memcache backend siap-pakai), dan ingin menggunakan jangkauan luas ini tanpa peringatan, anda dapat mendiamkan ``CacheKeyWarning`` dengan kode ini di modul ``management`` dari satu dari :setting:`INSTALLED_APPS` anda::

source: If you want to instead provide custom key validation logic for one of the built-in backends, you can subclass it, override just the ``validate_key`` method, and follow the instructions for `using a custom cache backend`_. For instance, to do this for the ``locmem`` backend, put this code in a module::
id: Jika anda ingin daripada menyediakan penyesuaian logika pengecekan kunci untuk satu dari backend pasang-tetap, anda dapat mensubkelaskannya, timpa hanya metode ``validate_key``, dan ikuti petunjuk untuk `using a custom cache backend`_. Sebagai contoh, untuk melakukan ini untuk backend ``locmem``, taruh kode ini di modul::

source: ...and use the dotted Python path to this class in the :setting:`BACKEND <CACHES-BACKEND>` portion of your :setting:`CACHES` setting.
id: ...dan menggunakan jalur Python bertitik pada kelas ini di bagain :setting:`BACKEND <CACHES-BACKEND>` dari pengaturan :setting:`CACHES`.

source: Downstream caches
id: Cache hilir

source: So far, this document has focused on caching your *own* data. But another type of caching is relevant to Web development, too: caching performed by "downstream" caches. These are systems that cache pages for users even before the request reaches your website.
id: Sejauh ini, dokumen ini telah memfokuskan pada cache data anda *sendiri*. Tetapi jenis lain dari cache adalah berhubungan pada pengembangan Jaringan, juga: penampilan cache oleh cache "downstream". Ada sistem yang halaman cache untuk pengguna bahkan sebelum permintaan mencapai situs jaringan anda.

source: Here are a few examples of downstream caches:
id: Ini adalah sedikit contoh dari cache hilir:

source: Your ISP may cache certain pages, so if you requested a page from https://example.com/, your ISP would send you the page without having to access example.com directly. The maintainers of example.com have no knowledge of this caching; the ISP sits between example.com and your Web browser, handling all of the caching transparently.
id: ISP anda mungkin cache halaman tertentu, jadi jika anda diminta sebuah halaman dari https://example.com/, ISP anda akan mengirim anda halaman tanpa mengakses example.com langsung. Perawat dari example.com tidak mempunyai pengetahuan dari cache ini; ISP duduk diantara example.com dan peramban Jaringan anda, menangani semua cache secara transparan.

source: Your Django website may sit behind a *proxy cache*, such as Squid Web Proxy Cache (http://www.squid-cache.org/), that caches pages for performance. In this case, each request first would be handled by the proxy, and it would be passed to your application only if needed.
id: Situs jaringan Django anda mungkin duduk dibelakang *cache proxy*, seperti Squid Web Proxy Cache (http://www.squid-cache.org/), yang cache halaman untuk penampilan. Dalam kasus ini, setiap permintaan pertama akan ditangani oleh proxy, dan itu akan dilewatkan ke aplikasi anda jika dibutuhkan.

source: Your Web browser caches pages, too. If a Web page sends out the appropriate headers, your browser will use the local cached copy for subsequent requests to that page, without even contacting the Web page again to see whether it has changed.
id: Peramban Jaringan anda cache halaman, juga. jika halaman Jaringan mengirim kepala sesuai, peramban anda akan menggunakan salinan cache lokal untuk permintaan berikutnya ke halaman itu, tanpa bahkan menghubungi halaman jaringan kembali untuk melihat apakah itu telah berubah.

source: Downstream caching is a nice efficiency boost, but there's a danger to it: Many Web pages' contents differ based on authentication and a host of other variables, and cache systems that blindly save pages based purely on URLs could expose incorrect or sensitive data to subsequent visitors to those pages.
id: Cache hilir adalah tambahan efesiensi yang bagus, tetapi ada bahaya terhadap itu: Banyak isi halaman Jaringan dibedakan berdasarkan pada autentifikasi dan rumah dari variabel lain, dan sistem cache yang dengan buta menyimpan halaman berdasarkan semata-mata pada URL dapat di membongkar data tidak benar atai sensitif ke pengungjung selanjutnya ke halaman-halaman itu.

source: For example, say you operate a Web email system, and the contents of the "inbox" page obviously depend on which user is logged in. If an ISP blindly cached your site, then the first user who logged in through that ISP would have their user-specific inbox page cached for subsequent visitors to the site. That's not cool.
id: Sebagai contoh, katakan anda mengoperasikan sistem surel jaringan, dan isi dari halaman "inbox" dengan jelas bergantung pada pengguna mana masuk. Jika sebuah ISP membabi buta cache situs anda, kemudian pengguna eprtama yang masuk melalui ISP itu akan mempunyai halaman inbox pengguna-tertentu mereka cache untuk pengguna berikutnya pada situs. Itu tidak keren.

source: Fortunately, HTTP provides a solution to this problem. A number of HTTP headers exist to instruct downstream caches to differ their cache contents depending on designated variables, and to tell caching mechanisms not to cache particular pages. We'll look at some of these headers in the sections that follow.
id: Untungnya, HTTP menyediakan sebuah pemecahan pada masalah ini. Sejumlah kepala HTTP ada untuk memberikan petunjuk cache hilir untuk membedakan isi cache mereka bergantung pada variabel-variabel ditunjuk, dan memberitahu mekanisme cache tidak meng cache halaman tertentu. Kami akan mencari beberapa kepala ini di bagian-bagian yang mengikuti.

source: Using ``Vary`` headers
id: Menggunakan kepala ``Vary``

source: The ``Vary`` header defines which request headers a cache mechanism should take into account when building its cache key. For example, if the contents of a Web page depend on a user's language preference, the page is said to "vary on language."
id: Kepala ``Vary`` menentukan permintaan mana kepala sebuah mekanisme cache harus diambil kedalam akun ketika membangun kunci cachenya. Sebagai contoh, jika isi dari halaman Jaringan bergantung pada pilihan bahasa pengguna, halaman dikatakan "vary on language."

source: By default, Django's cache system creates its cache keys using the requested fully-qualified URL -- e.g., ``"https://www.example.com/stories/2005/?order_by=author"``. This means every request to that URL will use the same cached version, regardless of user-agent differences such as cookies or language preferences. However, if this page produces different content based on some difference in request headers -- such as a cookie, or a language, or a user-agent -- you'll need to use the ``Vary`` header to tell caching mechanisms that the page output depends on those things.
id: Secara awalan, sistem cache Django membuat kunci cache nya menggunakan URL sepenuhnya-memenuhi syarat diminta -- sebagai contoh, ``"https://www.example.com/stories/2005/?order_by=author"``. Ini berarti setiap permintaan ke URL itu akan menggunakan versi cache sama, tanpa memperhatikan dari perbedaan agen-pengguna seperti kue atau pilihan bahasa. Bagaimanapun, jika halaman ini menghasilkan isi berbeda berdasarkan pada beberapa perbedaan di kepala permintaan -- seperti sebuah kue, atau sebuah bahasa, atau agen-pengguna -- anda akan butuh menggunakan kepala ``Vary`` untuk memberitahu mekanisme cache yang keluaran halaman bergantung pada hal-hal tersebut.

source: To do this in Django, use the convenient :func:`django.views.decorators.vary.vary_on_headers` view decorator, like so::
id: Untuk melakukan ini di Django, gunakan penghias tampilan :func:`django.views.decorators.vary.vary_on_headers` nyaman, seperti begitu::

source: In this case, a caching mechanism (such as Django's own cache middleware) will cache a separate version of the page for each unique user-agent.
id: Di kasus ini, mekanisme cache (seperti middleware cache sendiri Django) akan cache sebuah versi terpisah dari halaman untuk setiap agen-pengguna unik.

source: The advantage to using the ``vary_on_headers`` decorator rather than manually setting the ``Vary`` header (using something like ``response['Vary'] = 'user-agent'``) is that the decorator *adds* to the ``Vary`` header (which may already exist), rather than setting it from scratch and potentially overriding anything that was already in there.
id: Keuntungan menggunakan penghias ``vary_on_headers`` daripada secara manual mengatur kepala ``Vary`` (menggunakan sesuatu seperti ``response['Vary'] = 'user-agent'``) adalah bahwa penghias *adds* pada kepala ``Vary`` (yang mungkin sudah ada), daripada mengatur itu dari goresan dan berpeluang mengutamakan apapun yang telah ada disana.

source: You can pass multiple headers to ``vary_on_headers()``::
id: Anda dapat melewatkan banyak kepala pada ``vary_on_headers()``::

source: This tells downstream caches to vary on *both*, which means each combination of user-agent and cookie will get its own cache value. For example, a request with the user-agent ``Mozilla`` and the cookie value ``foo=bar`` will be considered different from a request with the user-agent ``Mozilla`` and the cookie value ``foo=ham``.
id: Ini memberitahukan cache hilir untuk vary pada *kedua*, yang berarti setiap perpaduan dari agen-pengguna dan kue akan mendapatkan nilai cache nya sendiri. Sebagai contoh, sebuah permintaan dengan agen-pengguna ``Mozilla`` dan nilai kue ``foo=bar`` akan dianggap berbeda dari permintaan dengan agen-pengguna ``Mozilla`` dan nilai kue ``foo=ham``.

source: Because varying on cookie is so common, there's a :func:`django.views.decorators.vary.vary_on_cookie` decorator. These two views are equivalent::
id: Karena beragam pada kue adalah sangat umum, ada sebuah penghias :func:`django.views.decorators.vary.vary_on_cookie`. Kedua tampilan ini adalah setara::

source: The headers you pass to ``vary_on_headers`` are not case sensitive; ``"User-Agent"`` is the same thing as ``"user-agent"``.
id: Kepala anda lewatkan ke ``vary_on_headers`` tidak hal-hal sensitif; ``"User-Agent"`` adalah hal sama seperti ``"user-agent"``.

source: You can also use a helper function, :func:`django.utils.cache.patch_vary_headers`, directly. This function sets, or adds to, the ``Vary header``. For example::
id: Anda dapat juga menggunakan fungsi pembantu, :func:`django.utils.cache.patch_vary_headers`, secara langsung. Fungsi ini menyetel, atau menambah ke, ``Vary header``. Sebagai contoh::

source: ``patch_vary_headers`` takes an :class:`~django.http.HttpResponse` instance as its first argument and a list/tuple of case-insensitive header names as its second argument.
id: ``patch_vary_headers`` mengambil sebuah instance :class:`~django.http.HttpResponse` sebagai argumen pertamanya dan sebuah list/tuple dari nama-nama kepala kasus-tidak-peka sebagai argumen keduanya.

source: For more on Vary headers, see the :rfc:`official Vary spec <7231#section-7.1.4>`.
id: Untuk lebih pada kepala Vary, lihat :rfc:`official Vary spec <7231#section-7.1.4>`.

source: Controlling cache: Using other headers
id: Mengendalikan tembolok: Menggunakan kepala lainnya

source: Other problems with caching are the privacy of data and the question of where data should be stored in a cascade of caches.
id: Masalah lain dengan cache adalah pribadi dari data dan pertanyaan dari dimana data harus disimpan di cache urutan kebawah.

source: A user usually faces two kinds of caches: their own browser cache (a private cache) and their provider's cache (a public cache). A public cache is used by multiple users and controlled by someone else. This poses problems with sensitive data--you don't want, say, your bank account number stored in a public cache. So Web applications need a way to tell caches which data is private and which is public.
id: Seorang pengguna biasanya menghadapi dua hal dari cache: cache perambannya mereka (sebuah cache pribadi) dan cache penyedia mereka (sebuah cache umum). Sebuah cache umum digunakan oleh banyak pengguna dan dikendalikan oleh seseorang lain. Sikap ini masalah dengan data sensitif--anda tidak ingin mengatakan, katakan, nomor akun bank anda disimpan di cache umum. Sehingga aplikasi Jaringan butuh cara memberitahu cache yang data adalah pribadi dan mana yang umum.

source: The solution is to indicate a page's cache should be "private." To do this in Django, use the :func:`~django.views.decorators.cache.cache_control` view decorator. Example::
id: Pemecahannya adalah menunjukkan cache halaman harus berupa "private". Untuk melakukan ini di Django, gunakan penghias tampilan :func:`~django.views.decorators.cache.cache_control`. Contoh::

source: This decorator takes care of sending out the appropriate HTTP header behind the scenes.
id: Penghias ini merawat dari mengirim keluar kepala HTTP sesuai dibelakang layar.

source: Note that the cache control settings "private" and "public" are mutually exclusive. The decorator ensures that the "public" directive is removed if "private" should be set (and vice versa). An example use of the two directives would be a blog site that offers both private and public entries. Public entries may be cached on any shared cache. The following code uses :func:`~django.utils.cache.patch_cache_control`, the manual way to modify the cache control header (it is internally called by the :func:`~django.views.decorators.cache.cache_control` decorator)::
id: Catat bahwa pengaturan kendali cache "pribadi" and "umum" adalah saling eksklusif. Penghias memastikan bahwa petunjuk "umum: dipindahkan jika "pribadi" harus disetel (dan sebaliknya). Sebuah contoh penggunaan daro dua petunjuk akan menjadi sebuah situs blog yang menawarkan kedua masukan pribadi dan umum. Masukan umum mungkin di cache pada cache berbagi apapun. Kode berikut menggunakan :func:`~django.utils.cache.patch_cache_control`, cara manual untuk merubah kepala kendali cache (itu adalah secara internal dipanggil oleh penghias :func:`~django.views.decorators.cache.cache_control`)::

source: You can control downstream caches in other ways as well (see :rfc:`7234` for details on HTTP caching). For example, even if you don't use Django's server-side cache framework, you can still tell clients to cache a view for a certain amount of time with the :rfc:`max-age <7234#section-5.2.2.8>` directive::
id: Anda dapat mengendalikan cache hilir di cara lain demukian juga (lihat :rfc:`7234` untuk rincian pada cache HTTP). Sebagai contoh, bahkan jika anda tidak menggunakan kerangka kerja cache sisi-peladen, anda dapat masih meberitahu klien untuk cache sebuah tampilan untuk sejumlah waktu tertentu dengan petunjuk :rfc:`max-age <7234#section-5.2.2.8>`::

source: (If you *do* use the caching middleware, it already sets the ``max-age`` with the value of the :setting:`CACHE_MIDDLEWARE_SECONDS` setting. In that case, the custom ``max_age`` from the :func:`~django.views.decorators.cache.cache_control` decorator will take precedence, and the header values will be merged correctly.)
id: (Jika anda *melakukan* menggunakan middleware cache, itu sudah disetel ``max-age`` dengan nilai dari pengaturan :setting:`CACHE_MIDDLEWARE_SECONDS`. Dalam kasus itu, penyesuaian ``max-age`` dari penghias :func:`~django.views.decorators.cache.cache_control` akan mengambil hak lebih tinggi, dan nilai-nlai kepala akan digabung dengan benar.)

source: Any valid ``Cache-Control`` response directive is valid in ``cache_control()``. Here are some more examples:
id: ``Cache-Control`` sah apapun menangganpi petunjuk adalah sah di ``cache_control()``. Ini adalah beberapa contoh lebih:

source: The full list of known directives can be found in the `IANA registry`_ (note that not all of them apply to responses).
id: Daftar penuh dari arahan dikenal dapat ditemukan di `IANA registry`_ (catat bahwa tidak semua dari mereka memberlakukan terhadap tanggapan).

source: If you want to use headers to disable caching altogether, :func:`~django.views.decorators.cache.never_cache` is a view decorator that adds headers to ensure the response won't be cached by browsers or other caches. Example::
id: Jika anda ingin menggunakan kepala untuk meniadakan cache sama sekali, :func:`~django.views.decorators.cache.never_cache` adalah tampilan penghias yang menambahkan kepala-kepala untuk memastikan tanggapan tidak akan di cache oleh peramban atau cache lain. Contoh::

source: Order of ``MIDDLEWARE``
id: urutan dari ``MIDDLEWARE``

source: If you use caching middleware, it's important to put each half in the right place within the :setting:`MIDDLEWARE` setting. That's because the cache middleware needs to know which headers by which to vary the cache storage. Middleware always adds something to the ``Vary`` response header when it can.
id: Jika anda menggunakan middleware cache, itu adalah penting untuk menaruh setiap setengah di tempat kanan dalam pengaturan :setting:`MIDDLEWARE`, Itu karena middleware cache butuh mengetahui kepala-kepala mana yang digunakan oleh cary pentimpan cache. Middleware selau menambahkan sesuatu ke kepala tanggapan ``Vary`` ketika itu dapat.

source: ``UpdateCacheMiddleware`` runs during the response phase, where middleware is run in reverse order, so an item at the top of the list runs *last* during the response phase. Thus, you need to make sure that ``UpdateCacheMiddleware`` appears *before* any other middleware that might add something to the ``Vary`` header. The following middleware modules do so:
id: ``UpdateCacheMiddleware`` berjalan selama fase tanggapan, dimana middleware berjalan di membalikkan urutan, jadi sebuah barang pada teratas dari daftar menjalankan *terakhir* selama fase tanggapan. Dengan demikian, anda butuh memastikan bahwa ``UpdateCacheMiddleware`` muncul *sebelum* middleware lain apapun yang mungkin menambahkan sesuatu ke kepala ``Vary``. Modul middleware berikut melakukannya:

source: ``SessionMiddleware`` adds ``Cookie``
id: ``SessionMiddleware`` menambah ``Cookie``

source: ``GZipMiddleware`` adds ``Accept-Encoding``
id: ``GZipMiddleware`` menambah ``Accept-Encoding``

source: ``LocaleMiddleware`` adds ``Accept-Language``
id: ``LocaleMiddleware`` menambah ``Accept-Language``

source: ``FetchFromCacheMiddleware``, on the other hand, runs during the request phase, where middleware is applied first-to-last, so an item at the top of the list runs *first* during the request phase. The ``FetchFromCacheMiddleware`` also needs to run after other middleware updates the ``Vary`` header, so ``FetchFromCacheMiddleware`` must be *after* any item that does so.
id: ``FetchFromCacheMiddleware``, di sisi lain, berjalan selama fase permintaan, dimana middleware diberlakukan pertama-ke-terakhir, jadi sebuah barang pada teratas dari daftar berjalan *pertama* selama fase permintaan. ``FetchFromCacheMiddleware`` juga butuh menjalankan setelah middleware lain memperbaharui kepala ``vary``, jadi ``FetchFromCacheMiddleware`` harus berupa *setelah* barang apapun yang melakukannya.

source: System check framework
id: Kerangka sistem pemeriksaan

source: The system check framework is a set of static checks for validating Django projects. It detects common problems and provides hints for how to fix them. The framework is extensible so you can easily add your own checks.
id: Kerangka sistem pemeriksaan adalah kumpulan dari pemeriksaan tetap untuk memeriksa kebenaran proyek Django. Dia menemukan masalah umum dan menyediakan petunjuk untuk bagaimana memperbaiki mereka. Kerangka ini dapat diperpanjang sehingga anda dapat dengan mudah menambahkan pemeriksaan anda sendiri.

source: Checks can be triggered explicitly via the :djadmin:`check` command. Checks are triggered implicitly before most commands, including :djadmin:`runserver` and :djadmin:`migrate`. For performance reasons, checks are not run as part of the WSGI stack that is used in deployment. If you need to run system checks on your deployment server, trigger them explicitly using :djadmin:`check`.
id: Pemeriksaan dapat dibangkitkan jelas melalui perintah :djadmin:`check`. Pemeriksaan dipicu tidak langsung sebelum kebanyakan perintah, termasuk :djadmin:`runserver` dan :djadmin:`migrate`. Untuk alasan penampilan, pemeriksaan tidak berjalan sebagai bagian dari tumpukan WSGI yang digunakan dalam pengembangan. Jika anda butuh menjalankan pemeriksaan sistem pada peladen pengembangan anda, picu mereka dengan jelas menggunakan :djadmin:`check`.

source: Serious errors will prevent Django commands (such as :djadmin:`runserver`) from running at all. Minor problems are reported to the console. If you have inspected the cause of a warning and are happy to ignore it, you can hide specific warnings using the :setting:`SILENCED_SYSTEM_CHECKS` setting in your project settings file.
id: Kesalahan-kesalahan serius akan mencegah perintah Django (seperti :djadmin:`runserver`) dari menjalankan sama sekali. Masalah-masalah dilaporkan ke konsol. Jika anda telah memeriksa penyebab dari peringatan dan senang mengabaikan itu, anda dapat memyembunyikan peringatan khusus menggunakan pengaturan :setting:`SILENCED_SYSTEM_CHECKS` di berkas pengaturan proyek anda.

source: A full list of all checks that can be raised by Django can be found in the :doc:`System check reference </ref/checks>`.
id: Sebuah daftar penuh dari semua pemeriksaan yang dapat dimunculkan oleh Django dapat ditemukan di :doc:`System check reference </ref/checks>`.

source: Writing your own checks
id: Menulis pemeriksaan anda sendiri
