Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: One way to do this is to combine :class:`ListView` with :class:`~django.views.generic.detail.SingleObjectMixin`, so that the queryset for the paginated list of books can hang off the publisher found as the single object. In order to do this, we need to have two different querysets:
id: Satu cara melakukan ini adalah memadukan :class:`ListView` dengan :class:`~django.views.generic.detail.SingleObjectMixin`, sehingga queryset untuk memberi nomor halaman dari buku dapat menggantung penerbit ditemukan sebagai obyek tunggal. Untuk melakukan ini, kami butuh memiliki dua queryset berbeda:

source: ``Book`` queryset for use by :class:`~django.views.generic.list.ListView`
id: Queryset ``Book`` untuk digunakan oleh :class:`~django.views.generic.list.ListView`

source: Since we have access to the ``Publisher`` whose books we want to list, we simply override ``get_queryset()`` and use the ``Publisher``s :ref:`reverse foreign key manager<backwards-related-objects>`.
id: Karena kami mempunyai akses ke ``Publisher`` yang bukunya kami ingin daftar, kami cukup menimpa ``get_queryset()`` dan menggunakan :ref:`reverse foreign key manager<backwards-related-objects>` ``Publisher``.

source: ``Publisher`` queryset for use in :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()`
id: Queryset ``Publisher`` untuk digunakan di :meth:`~django.views.generic.detail.SingleObjectMixin.get_object()`

source: We'll rely on the default implementation of ``get_object()`` to fetch the correct ``Publisher`` object. However, we need to explicitly pass a ``queryset`` argument because otherwise the default implementation of ``get_object()`` would call ``get_queryset()`` which we have overridden to return ``Book`` objects instead of ``Publisher`` ones.
id: Kami akan bergantung pada penerapan awalan dari ``get_object()`` untuk mengambil obyek ``Publisher`` benar. Bagaimanapun, kami butuh jelas melewatkan sebuah argumen ``queryset`` karena jika tidak penerapan awalan dari ``get_object()`` akan memanggil ``get_queryset()`` yang kami telah timpa untuk mengembalikan obyek ``Book`` daripada ``Publisher``.

source: We have to think carefully about ``get_context_data()``. Since both :class:`~django.views.generic.detail.SingleObjectMixin` and :class:`ListView` will put things in the context data under the value of ``context_object_name`` if it's set, we'll instead explicitly ensure the ``Publisher`` is in the context data. :class:`ListView` will add in the suitable ``page_obj`` and ``paginator`` for us providing we remember to call ``super()``.
id: Kami harus berpikir hati-hati tentang ``get_context_data()``. Sejak kedua :class:`~django.views.generic.detail.SingleObjectMixin` dan :class:`ListView` akan menaruh hal-hal dalam data konteks dibawah nilai dari ``context_object_name`` jika itu disetel, kami akan jelas memastikan ``Publisher`` adalah dalam data konteks. :class:`ListView` akan menambah dalam ``page_obj`` dan ``paginator`` cocok untuk kami menyediakan kami ingat memanggil ``super()``.

source: Now we can write a new ``PublisherDetail``::
id: Sekarang kami dapat menulis ``PublisherDetail`` baru::

source: Notice how we set ``self.object`` within ``get()`` so we can use it again later in ``get_context_data()`` and ``get_queryset()``. If you don't set ``template_name``, the template will default to the normal :class:`ListView` choice, which in this case would be ``"books/book_list.html"`` because it's a list of books; :class:`ListView` knows nothing about :class:`~django.views.generic.detail.SingleObjectMixin`, so it doesn't have any clue this view is anything to do with a ``Publisher``.
id: Perhatikan bagaimana kami menyetel ``self.object`` dalam ``get()`` jadi kami dapat menggunakan itu kembali kemudian dalam ``get_context_data()`` dan ``get_queryset()``. Jika anda tidak menyetel ``template_name``, cetakan akan awalan menjadi pilihan :class:`ListView` biasa, yang dalam kasus ini akan menjadi ``"books/book_list.html"`` karena itu adalah daftar dari buku-buku; :class:`ListView` tidak mengetahui apapun tentang :class:`~django.views.generic.detail.SingleObjectMixin`, jadi itu tidak mempunyai petunjuk tampilan ini adalah hubungannya dengan ``Publisher``.

source: The ``paginate_by`` is deliberately small in the example so you don't have to create lots of books to see the pagination working! Here's the template you'd want to use:
id: ``paginate_by`` sengaja kecil dalam contoh sehingga anda tidak perlu membuat banyak buku untuk melihat penomoran halaman bekerja! Ini adalah cetakan anda ingin gunakan:

source: Avoid anything more complex
id: Hindari apapun lebih rumit

source: Generally you can use :class:`~django.views.generic.base.TemplateResponseMixin` and :class:`~django.views.generic.detail.SingleObjectMixin` when you need their functionality. As shown above, with a bit of care you can even combine ``SingleObjectMixin`` with :class:`~django.views.generic.list.ListView`. However things get increasingly complex as you try to do so, and a good rule of thumb is:
id: Umumnya anda dapat gunakan :class:`~django.views.generic.base.TemplateResponseMixin` dan :class:`~django.views.generic.detail.SingleObjectMixin` ketika anda butuh fungsionalitas mereka. Seperti ditunjukkan diatas, dengan sedikit perawatan anda dapat bahkan memadukan ``SingleObjectMixin`` dengan :class:`~django.views.generic.list.ListView`. Bagaimanapun hal-hal meningkat semakin rumit ketika anda mencoba melakukannya, dan aturan bagus dari ibu jari adalah:

source: Each of your views should use only mixins or views from one of the groups of generic class-based views: :doc:`detail, list<generic-display>`, :doc:`editing<generic-editing>` and date. For example it's fine to combine :class:`TemplateView` (built in view) with :class:`~django.views.generic.list.MultipleObjectMixin` (generic list), but you're likely to have problems combining ``SingleObjectMixin`` (generic detail) with ``MultipleObjectMixin`` (generic list).
id: Setiap tampilan anda harus menggunakan hanya mixin atau tampilan dari saru dari kelompok dari tampilan berdasarkan-kelas umum: :doc:`detail, list<generic-display>`, :doc:`editing<generic-editing>` dan tanggal. Sebagai contoh itu adalah baik memadukan :class:`TemplateView` (tampilan siap pakai) dengan :class:`~django.views.generic.list.MultipleObjectMixin` (daftar umum), tetapi anda mungkin memiliki masalah memadukan ``SingleObjectMixin`` (rincian umum) dengan ``MultipleObjectMixin`` (daftar umum).

source: To show what happens when you try to get more sophisticated, we show an example that sacrifices readability and maintainability when there is a simpler solution. First, let's look at a naive attempt to combine :class:`~django.views.generic.detail.DetailView` with :class:`~django.views.generic.edit.FormMixin` to enable us to ``POST`` a Django :class:`~django.forms.Form` to the same URL as we're displaying an object using :class:`DetailView`.
id: Untuk menunjukkan apa yang terjadi ketika anda mencoba mendapatkan lebih mutakhir, kami menunjukkan sebuah contoh yang mengorbankan kesiapan dan rawatan ketika ada pemecahan termudah. Pertama, mari kita lihat usaha naif untuk memadukan :class:`~django.views.generic.detail.DetailView` dengan :class:`~django.views.generic.edit.FormMixin` untuk mengadakan kami pada ``POST`` sebuah :class:`~django.forms.Form` Django ke URL sama ketika kami sedang memperlihatkan sebuah obyek menggunakan :class:`DetailView`.

source: Using ``FormMixin`` with ``DetailView``
id: Menggunakan ``FormMixin`` dengan ``DetailView``

source: Think back to our earlier example of using :class:`View` and :class:`~django.views.generic.detail.SingleObjectMixin` together. We were recording a user's interest in a particular author; say now that we want to let them leave a message saying why they like them. Again, let's assume we're not going to store this in a relational database but instead in something more esoteric that we won't worry about here.
id: Berpikir kembali ke contoh paling awal dari menggunakan :class:`View` dan :class:`~django.views.generic.detail.SingleObjectMixin` bersama-sama. Kami sedang merekam sebuah minat pengguna dalam penulis tertentu; katakan sekarang yang kami ingin membiarkan mereka meninggalkan pesan mengatakan mengapa mereka menyukainya. Kembali, mari kita anggap tidak menyimpan ini dalam basisdata hubungan tetapi sebagai gantinya di lebih esoterik yang kami tidak akan khawatir disini.

source: At this point it's natural to reach for a :class:`~django.forms.Form` to encapsulate the information sent from the user's browser to Django. Say also that we're heavily invested in `REST`_, so we want to use the same URL for displaying the author as for capturing the message from the user. Let's rewrite our ``AuthorDetailView`` to do that.
id: Pada titik ini itu adalah alamiah mencapai untuk :class:`~django.forms.Form` untuk mengenkapsulasi informasi dikirim dari peramban pengguna pada Django. Katakan juga bahwa kami melakukan investasi di `REST`_, jadi kami ingin menggunakan URL sama untuk memperlihatkan penulis sebagai untuk menangkap pesan dar pengguna. Mari kita menulis kembali ``AuthorDetailView`` kami untuk melakukan itu.

source: We'll keep the ``GET`` handling from :class:`DetailView`, although we'll have to add a :class:`~django.forms.Form` into the context data so we can render it in the template. We'll also want to pull in form processing from :class:`~django.views.generic.edit.FormMixin`, and write a bit of code so that on ``POST`` the form gets called appropriately.
id: Kami akan menjaga penanganan ``GET`` dari :class:`DetailView`, meskipun kami akan harus menambah :class:`~django.forms.Form` kedalam data konteks jadi kami dapat mengirim itu dalam cetakan. Kami akan juga ingin menarik dalam pengolahan formulir :class:`~django.views.generic.edit.FormMixin`, dan menulis sedikit kode sehingga pada ``POST`` formulir mendapatkan panggilan yang sesuai.

source: We use :class:`~django.views.generic.edit.FormMixin` and implement ``post()`` ourselves rather than try to mix :class:`DetailView` with :class:`FormView` (which provides a suitable ``post()`` already) because both of the views implement ``get()``, and things would get much more confusing.
id: Kami menggunakan :class:`~django.views.generic.edit.FormMixin` dan menerapkan ``post()`` kami sendiri daripada mencoba mencampur :class:`DetailView` dengan :class:`FormView` (yang menyediakan sudah ``post()`` cocok) karena kedua dari tampilan menerapkan ``get()``, dan hal-hal akan menjadi lebih membingungkan.

source: Our new ``AuthorDetail`` looks like this::
id: ``AuthorDetail`` baru kami seperti ini::

source: ``get_success_url()`` is just providing somewhere to redirect to, which gets used in the default implementation of ``form_valid()``. We have to provide our own ``post()`` as noted earlier, and override ``get_context_data()`` to make the :class:`~django.forms.Form` available in the context data.
id: ``get_success_url()`` hanya menyediakan entah dimana untuk mengalihkan, yang akan digunakan dalam penerapan awalan dari ``form_valid()``. Kami harus menyediakan ``post()`` kami sendiri seperti dicatat terdahulu, dan menimpa ``get_context_data()`` utuk membuat :class:`~django.forms.Form` tersedia dalam data konteks.

source: A better solution
id: Pemecahan terbaik

source: It should be obvious that the number of subtle interactions between :class:`~django.views.generic.edit.FormMixin` and :class:`DetailView` is already testing our ability to manage things. It's unlikely you'd want to write this kind of class yourself.
id: Itu harus jelas bahwa nomor dari interaksi halus diantara :class:`~django.views.generic.edit.FormMixin` dan :class:`DetailView` sudah mencoba kemampuan kami untuk mengelola hal-hal. Itu tidak sepertinya anda ingin menulis hal ini dari kelas anda sendiri.

source: In this case, it would be fairly easy to just write the ``post()`` method yourself, keeping :class:`DetailView` as the only generic functionality, although writing :class:`~django.forms.Form` handling code involves a lot of duplication.
id: Dalam kasus ini, itu akan sangat mudah hanya menulis metode ``post()`` anda sendiri, menjaga :class:`DetailView` seperti fungsionalitas umum, meskipun menulis :class:`~django.forms.Form` penanganan kode melibatkan banyak penggandaan.

source: Alternatively, it would still be easier than the above approach to have a separate view for processing the form, which could use :class:`~django.views.generic.edit.FormView` distinct from :class:`DetailView` without concerns.
id: Cara lain, itu akan masih lebih mudah daripada pendekatan diatas untuk memiliki tampilan terpisah untuk pengolahan formulir, yang dapat menggunakan :class:`~django.views.generic.edit.FormView` berbeda dari :class:`DetailView` tanpa kepentingan.

source: An alternative better solution
id: Sebuah pilihan lain pemecahan terbaik

source: What we're really trying to do here is to use two different class based views from the same URL. So why not do just that? We have a very clear division here: ``GET`` requests should get the :class:`DetailView` (with the :class:`~django.forms.Form` added to the context data), and ``POST`` requests should get the :class:`FormView`. Let's set up those views first.
id: Apa kami sedang coba lakukan disini adalah menggunakan dua kelas bebeda berdasarkan tampilan dari URL sama. Jadi mengapa tidak lakukan hal itu? Kami mempunyai pembagian sangat jelas disini: permintaan ``GET`` harus mendapatkan :class:`DetailView` (dengan :class:`~django.forms.Form` ditambahkan ke data konteks), dan permintaan ``POST`` harus mendapatkan :class:`FormView`. Mari kita menyetek tampilan tersebut dahulu.

source: The ``AuthorDisplay`` view is almost the same as :ref:`when we first introduced AuthorDetail<generic-views-extra-work>`; we have to write our own ``get_context_data()`` to make the ``AuthorInterestForm`` available to the template. We'll skip the ``get_object()`` override from before for clarity::
id: Tampilan ``AuthorDisplay`` hampir sama seperti :ref:`when we first introduced AuthorDetail<generic-views-extra-work>`; kami harus menulis ``get_context_data()`` kami sendiri untuk membuat ``AuthorInterestForm`` tersedia pada cetakan. Kami akan melewati ``get_object()`` menimpa dari sebelumnya untuk kejelasan::

source: Then the ``AuthorInterest`` is a simple :class:`FormView`, but we have to bring in :class:`~django.views.generic.detail.SingleObjectMixin` so we can find the author we're talking about, and we have to remember to set ``template_name`` to ensure that form errors will render the same template as ``AuthorDisplay`` is using on ``GET``::
id: Kemudian ``AuthorInterest`` adalah :class:`FormView` sederhana, tetapi kami harus membawa kedalam :class:`~django.views.generic.detail.SingleObjectMixin` sehingga kami dapat menemukan penulis kami sedang bicarakan, dan kami harus mengingat menyetel ``template_name`` memastikan bahwa kesalahan formulir akan membangun cetakan sama seperti ``AuthorDisplay`` sedang gunakan pada ``GET``::

source: Finally we bring this together in a new ``AuthorDetail`` view. We already know that calling :meth:`~django.views.generic.base.View.as_view()` on a class-based view gives us something that behaves exactly like a function based view, so we can do that at the point we choose between the two subviews.
id: Akhirnya kami membawa ini bersama-sama dalam sebuah tampilan ``AuthorDetail`` baru. Kami sudah mengetahui bahwa memanggil :meth:`~django.views.generic.base.View.as_view()` pada sebuah tampilan berdasarkan-kelas memberikan kami sesuatu yang berperilaku persis seperti sebuah tampilan berdasarkan fungsi, jadi kami dapat melakukan itu pada titik kami pilih diantara dua sub tampilan.

source: You can of course pass through keyword arguments to :meth:`~django.views.generic.base.View.as_view()` in the same way you would in your URLconf, such as if you wanted the ``AuthorInterest`` behavior to also appear at another URL but using a different template::
id: Anda dapat melewatkan perjalanan melalui argumen kata kunci pada :meth:`~django.views.generic.base.View.as_view()` dalam cara sama anda akan dalam URLconf anda, seperti jika anda ingin perilaku ``AuthorInterest`` untuk juga muncul pada URL lain tetapi menggunakan cetakan berbeda::

source: This approach can also be used with any other generic class-based views or your own class-based views inheriting directly from :class:`View` or :class:`TemplateView`, as it keeps the different views as separate as possible.
id: Pendekatan ini dapat juga digunakan dengan tampilan berdasarkan-kelas umum lainnya diwarisi langsung dari :class:`View` or :class:`TemplateView`, ketika itu menjaga tampilan berbeda sebagai terpisah mungkin.

source: More than just HTML
id: Lebih dari hanya HTML

source: Where class-based views shine is when you want to do the same thing many times. Suppose you're writing an API, and every view should return JSON instead of rendered HTML.
id: Dimana bersinar tampilan berdasarkan-kelas adalah ketika anda ingin melakukan hal sama sebanyak kali. Kiranya anda sedang menulis sebuah API, dan setiap tampilan harus mengembalikan JSON daripada membangun HTML.

source: We can create a mixin class to use in all of our views, handling the conversion to JSON once.
id: Kami dapat membuat sebuah kelas mixin untuk digunakan di semua dari tampilan kami, menangani perubahan pada JSON sekali.

source: For example, a simple JSON mixin might look something like this::
id: Sebagai contoh, mixin JSON sederhana mungkin terlihat seperti ini::

source: Check out the :doc:`/topics/serialization` documentation for more information on how to correctly transform Django models and querysets into JSON.
id: Periksa dokumentasi :doc:`/topics/serialization` untuk informasi lebih pada bagaimana dengan benar merubah model Django dan queryset menjadi JSON.

source: This mixin provides a ``render_to_json_response()`` method with the same signature as :func:`~django.views.generic.base.TemplateResponseMixin.render_to_response()`. To use it, we simply need to mix it into a ``TemplateView`` for example, and override ``render_to_response()`` to call ``render_to_json_response()`` instead::
id: Mixin ini menyediakan sebuah metode ``render_to_json_response()`` dengan tanda tangan sama seperti :func:`~django.views.generic.base.TemplateResponseMixin.render_to_response()`. Untuk menggunakan itu, kami cukup butuh mencampur itu kedalam sebuah ``TemplateView`` sebagai contoh, dan menimpa ``render_to_response()`` untuk memanggil ``render_to_json_response()`` sebagai gantinya::

source: Equally we could use our mixin with one of the generic views. We can make our own version of :class:`~django.views.generic.detail.DetailView` by mixing ``JSONResponseMixin`` with the ``django.views.generic.detail.BaseDetailView`` -- (the :class:`~django.views.generic.detail.DetailView` before template rendering behavior has been mixed in)::
id: Sama kami dapat menggunakan mixin kami dengan satu dari tampilan umum. Kami dapat membuat versi kami sendiri dari :class:`~django.views.generic.detail.DetailView` dengan mencampur ``JSONResponseMixin`` dengan ``django.views.generic.detail.BaseDetailView`` -- (:class:`~django.views.generic.detail.DetailView` sebelum perilaku membangun cetakan telah dicampur)::

source: This view can then be deployed in the same way as any other :class:`~django.views.generic.detail.DetailView`, with exactly the same behavior -- except for the format of the response.
id: Tampilan ini dapat kemudian disebarkan dalam cara sama seperti lainnya :class:`~django.views.generic.detail.DetailView`, dengan persi perilaku sama -- kecuali untuk bentuk dari tanggapan.

source: If you want to be really adventurous, you could even mix a :class:`~django.views.generic.detail.DetailView` subclass that is able to return *both* HTML and JSON content, depending on some property of the HTTP request, such as a query argument or a HTTP header. Just mix in both the ``JSONResponseMixin`` and a :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin`, and override the implementation of :func:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` to defer to the appropriate rendering method depending on the type of response that the user requested::
id: Jika anda ingin harus benar-benar berpetulangan, anda dapat bahkan mencampur subkelas :class:`~django.views.generic.detail.DetailView` yang dapat megnembalikan *kedua* isi HTML dan JSON, bergantung pada beberapa sifat dari permintaan HTTP, seperti sebuah argumen permintaan atau kepala HTTP. Hanya mencampur dalam kedua ``JSONResponseMixin`` dan sebuah :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin`, dan menimpa penerapan dari :func:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` ke metode pembangunan sesuai tergantung pada jenis dari tanggapan yang pengguna minta::

source: Because of the way that Python resolves method overloading, the call to ``super().render_to_response(context)`` ends up calling the :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` implementation of :class:`~django.views.generic.base.TemplateResponseMixin`.
id: Karena cara bahwa Python menyelesaikan metode melebihi batas, panggilan pada ``super().render_to_response(context)``mengakhiri panggilan penerapan :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` dari :class:`~django.views.generic.base.TemplateResponseMixin`.

source: Conditional View Processing
id: Pengolahan Tampilan Bersyarat

source: HTTP clients can send a number of headers to tell the server about copies of a resource that they have already seen. This is commonly used when retrieving a Web page (using an HTTP ``GET`` request) to avoid sending all the data for something the client has already retrieved. However, the same headers can be used for all HTTP methods (``POST``, ``PUT``, ``DELETE``, etc.).
id: Klien HTTP dapat mengirim sejumlah kepala untuk memberitahu peladen tentang salinan dari sumber daya yang mereka sudah lihat. Ini adalah umumnya digunakan ketika mengambil sebuah halaman Jaringan (menggunakan sebuah permintaan ``GET`` HTTP) untuk menghidnari mengirim semua data untuk sesuatu klien sudah ambil. Bagaimanapun, kepala sama dapat digunakan untuk semua metode HTTP (``POST``, ``PUT``, ``DELETE``, dll.).

source: For each page (response) that Django sends back from a view, it might provide two HTTP headers: the ``ETag`` header and the ``Last-Modified`` header. These headers are optional on HTTP responses. They can be set by your view function, or you can rely on the :class:`~django.middleware.http.ConditionalGetMiddleware` middleware to set the ``ETag`` header.
id: Untuk setiap halaman (tanggapan) yang Django kirim kembali dari tampilan, itu mungkin menyediakan dua kepala HTTP: kepala ``ETag`` dan ``Last-Modified``. Kepala-kepala ini pilihan pada tanggapan HTTP. Mereka dapat disetel dengan fungsi tampilan anda, anda dapat bergantung pada middleware :class:`~django.middleware.http.ConditionalGetMiddleware` untuk menyetel kepala ``ETag``.
