Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Another thing to note about this example is that ``Manager`` methods can access ``self.model`` to get the model class to which they're attached.
id: Hal lain untuk dicatat tentang contoh ini adalah bahwa metode ``Manager`` dapat mengakses ``self.model`` untuk mendapatkan kelas model dimana mereka dilampirkan.

source: Modifying a manager's initial ``QuerySet``
id: Merubah ``QuerySet`` awal pengelolaan

source: A ``Manager``s base ``QuerySet`` returns all objects in the system. For example, using this model::
id: Dasar ``Manager`` ``QuerySet`` mengembalikan semua obyek-obyek di sistem. Sebagai contoh, menggunakan model ini::

source: ...the statement ``Book.objects.all()`` will return all books in the database.
id: ...pernyataan ``Book.objects.all()`` akan mengembalikan semua buku-buku di basisdata.

source: You can override a ``Manager``s base ``QuerySet`` by overriding the ``Manager.get_queryset()`` method. ``get_queryset()`` should return a ``QuerySet`` with the properties you require.
id: Anda dapat menimpa ``QuerySet`` dasar ``Manager`` dengan menimpa metode ``Manager.get_queryset()``. ``get_queryset()`` harus mengembalikan sebuah ``QuerySet`` dengan sifat-sifat anda butuhkan.

source: For example, the following model has *two* ``Manager``\s -- one that returns all objects, and one that returns only the books by Roald Dahl::
id: Sebagai contoh, model berikut mempunyai *dua* ``Manager`` -- satu yang mengembalikan semua obyek, dan satu yang mengembalikan hanya buku-buku oleh Roald Dahl::

source: With this sample model, ``Book.objects.all()`` will return all books in the database, but ``Book.dahl_objects.all()`` will only return the ones written by Roald Dahl.
id: Dengan model contoh ini, ``Book.objects.all()`` akan mengembalikan semua buku-buku di basisdata, tetapi ``Book.dahl_objects.all()`` akan hanya mengembalikan satu yang ditulis oleh Roald Dahl.

source: Of course, because ``get_queryset()`` returns a ``QuerySet`` object, you can use ``filter()``, ``exclude()`` and all the other ``QuerySet`` methods on it. So these statements are all legal::
id: Tentu saja, karena ``get_queryset()`` mengembalikan sebuah obyek ``QuerySet``, anda dapat menggunakan ``filter()``, ``exclude()`` dan semua dari metode ``QuerySet`` lain pada itu. Jadi pernyataan ini adalah semua sah::

source: This example also pointed out another interesting technique: using multiple managers on the same model. You can attach as many ``Manager()`` instances to a model as you'd like. This is an easy way to define common "filters" for your models.
id: Contoh ini juga menunjuk teknik menarik lainnya: menggunakan banyak pengelola pada model sama. Anda dapat melampirkan sebanyak instance ``Manager()`` pada sebuah model sesuka anda. Ini adalah cara mudah untuk menentukan "filters" umum untuk model anda.

source: This example allows you to request ``Person.authors.all()``, ``Person.editors.all()``, and ``Person.people.all()``, yielding predictable results.
id: Contoh ini mengizinkan anda meminta `Person.authors.all()``, ``Person.editors.all()``, dan ``Person.people.all()``, menghasilkan hasil dapat diramalkan.

source: Default managers
id: Pengelola awal

source: If you use custom ``Manager`` objects, take note that the first ``Manager`` Django encounters (in the order in which they're defined in the model) has a special status. Django interprets the first ``Manager`` defined in a class as the "default" ``Manager``, and several parts of Django (including :djadmin:`dumpdata`) will use that ``Manager`` exclusively for that model. As a result, it's a good idea to be careful in your choice of default manager in order to avoid a situation where overriding ``get_queryset()`` results in an inability to retrieve objects you'd like to work with.
id: Jika anda menggunakan obyek ``Manager`` penyesuaian, ambil catatan bahwa ``Manager`` Django pertama hadapi (dalam urutan dimana mereka ditentukan dalam model) mempunyai sebuah keadaan khusus. Django menafsirkan ``Manager`` pertama ditentukan dalam sebuah kelas sebagai ``Manager`` "default", dan beberapa bagian dari Django (termasuk :djadmin:`dumpdata`) akan menggunakan yang ``Manager`` khusus untuk model itu. Sebagai sebuah hasil, itu adalah ide bagus untuk hati-hati dalam pilihan anda dari pengelola awalan untuk menghindari keadan dimana menimpa hasil ``get_queryset()`` dalam sebuah ketidakmampuan mengambil obyek-obyek anda sukai bekerja dengannya.

source: You can specify a custom default manager using :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>`.
id: Anda dapat menentukan sebuah penyesuaian pengelolaan awalan menggunakan :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>`.

source: If you're writing some code that must handle an unknown model, for example, in a third-party app that implements a generic view, use this manager (or :attr:`~Model._base_manager`) rather than assuming the model has an ``objects`` manager.
id: Jika anda sedang menulis beberapa kode yang harus menangani sebuah model tidak dikenal, sebagai contoh, dalam sebuah aplikasi pihak-ketiga yang menerapkan sebuah tampilan umum, gunakan pengelola ini (atau :attr:`~Model._base_manager`) daripada beranggapan model mempunyai sebuah pengelola ``objects``.

source: Base managers
id: Pengelolaan dasar

source: Using managers for related object access
id: Menggunakan pengelola untuk akses obyek terkait

source: By default, Django uses an instance of the ``Model._base_manager`` manager class when accessing related objects (i.e. ``choice.question``), not the ``_default_manager`` on the related object. This is because Django needs to be able to retrieve the related object, even if it would otherwise be filtered out (and hence be inaccessible) by the default manager.
id: Secara awalan, Django menggunakan sebuah instance dari kelas pengelola ``Model._base_manager`` ketika mengakses obyek terkait (yaitu ``choice.question``), bukan ``_default_manager`` pada obyek terkait. Ini karena Django butuh dapat mengambil obyek terkait, bahkan jika itu akan sebaliknya disaring (dan karenanya tidak dapat diakses) oleh pengelola awalan.

source: If the normal base manager class (:class:`django.db.models.Manager`) isn't appropriate for your circumstances, you can tell Django which class to use by setting :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>`.
id: Jika kelas pengelola dasar biasa (:class:`django.db.models.Manager`) tidak sesuai untuk keadaan anda, anda dapat memberitahu Django kelas mana digunakan oleh pengaturan :attr:`Meta.base_manager_name <django.db.models.Options.base_manager_name>`.

source: Don't filter away any results in this type of manager subclass
id: Jangan menyaring hasil apapun dalam jenis ini dari pengelola subkelas

source: This manager is used to access objects that are related to from some other model. In those situations, Django has to be able to see all the objects for the model it is fetching, so that *anything* which is referred to can be retrieved.
id: Pengelola ini digunakan untuk mengakses obyek yang terkait pada dari beberapa model lain. Dalam keadaan tersebut, Django harus dapat melihat semua obyek untuk model itu sedang diambil, sehingga *apapun* yang mengacu dapat diambil.

source: If you override the ``get_queryset()`` method and filter out any rows, Django will return incorrect results. Don't do that. A manager that filters results in ``get_queryset()`` is not appropriate for use as a base manager.
id: Jika anda menimpa metode ``get_queryset()`` dan menyaring setiap baris, Django akan mengembalikan hasil salah. Jangan lakukan itu, Sebuah pengelola yang menyaring hasil dalam ``get_queryset()`` tidak sesuai untuk digunakan sebagai pengelola dasar.

source: Calling custom ``QuerySet`` methods from the manager
id: Memanggil metode ``QuerySet`` penyesuaian dari pengelola

source: While most methods from the standard ``QuerySet`` are accessible directly from the ``Manager``, this is only the case for the extra methods defined on a custom ``QuerySet`` if you also implement them on the ``Manager``::
id: Selagi kebanyakan metode dari ``QuerySet`` standar dapat diakses langsung dari ``Manager``, ini hanya kasus untuk metode tambahan ditentukan pada sebuah penyesuaian ``QuerySet`` jika anda juga menerapkan mereka pada ``Manager``::

source: This example allows you to call both ``authors()`` and ``editors()`` directly from the manager ``Person.people``.
id: Contoh ini mengizinkan anda memanggil kedua ``authors()`` dan ``editors()`` secara langsung dari pengelola ``Person.people``.

source: Creating a manager with ``QuerySet`` methods
id: Membuat pengelola dengan cara ``QuerySet``

source: In lieu of the above approach which requires duplicating methods on both the ``QuerySet`` and the ``Manager``, :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` can be used to create an instance of ``Manager`` with a copy of a custom ``QuerySet``s methods::
id: Sebagai pengganti dari pendekatan diatas yang membutuhkan metode penggandaan pada kedua ``QuerySet`` dan ``Manager``, :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` dapat digunakan untuk membuat sebuah instance dari ``Manager`` dengan salinan dari sebuah metode ``QuerySet`` penyesuaian::

source: The ``Manager`` instance created by :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` will be virtually identical to the ``PersonManager`` from the previous example.
id: Instance ``Manager`` dibuat oleh :meth:`QuerySet.as_manager() <django.db.models.query.QuerySet.as_manager>` akan secara virtual mirip pada ``PersonManager`` dari contoh sebelumnya.

source: Not every ``QuerySet`` method makes sense at the ``Manager`` level; for instance we intentionally prevent the :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` method from being copied onto the ``Manager`` class.
id: Tidak setiap metode ``QuerySet`` masuk akal pada tingkat ``Manager``; sebagai contoh kami sengaja mencegah metode :meth:`QuerySet.delete() <django.db.models.query.QuerySet.delete>` dari menjadi disalin ke atas kelas ``Manager``.

source: Methods are copied according to the following rules:
id: Cara disalin berdasarkan aturan berikut:

source: Public methods are copied by default.
id: Cara umum disalin secara awal.

source: Private methods (starting with an underscore) are not copied by default.
id: Metode pribadi (mulai dengan sebuah garis bawah) tidak disalin secara awalan.

source: Methods with a ``queryset_only`` attribute set to ``False`` are always copied.
id: Metode dengan atribut ``queryset_only`` disetel menjadi ``False`` adalah selalu disalin.

source: Methods with a ``queryset_only`` attribute set to ``True`` are never copied.
id: Metode dengan atribut ``queryset_only`` disetel menjadi ``True`` adalah tidak pernah disalin.

source: For advanced usage you might want both a custom ``Manager`` and a custom ``QuerySet``. You can do that by calling ``Manager.from_queryset()`` which returns a *subclass* of your base ``Manager`` with a copy of the custom ``QuerySet`` methods::
id: Untuk penggunaan lanjutan anda mungkin ingin kedua penyesuaian ``Manager`` dan penyesuaian ``QuerySet``. Anda dapat melakukan itu dengan memanggil ``Manager.from_queryset()`` yang mengembalikan sebuah *subkelas* dari dasar ``Manager`` anda dengan salinan dari metode ``QuerySet`` penyesuaian::

source: You may also store the generated class into a variable::
id: Anda mungkin juga menyimpan kelas dibangkitkan kedalam sebuah variabel::

source: Custom managers and model inheritance
id: Pengelolaan penyesuaian dan warisan model

source: Here's how Django handles custom managers and :ref:`model inheritance <model-inheritance>`:
id: Ini adalah bagaimana Django menangani pengelolaan penyesuaian dan :ref:`model inheritance <model-inheritance>`:

source: Managers from base classes are always inherited by the child class, using Python's normal name resolution order (names on the child class override all others; then come names on the first parent class, and so on).
id: Pengelola dari kelas-kelas dasar selalu diwarisi oleh anak kelas, menggunakan urutan resolusi nama biasa Python (nama pada kelas anan menimpa semua lainnya; kemudian datang nama pada kelas induk pertama, dan seterusnya).

source: If no managers are declared on a model and/or its parents, Django automatically creates the ``objects`` manager.
id: Jika tidak ada pengelola dinyatakan pada model dan/atau induknya, Django secara otomatis membuat pengelola ``objects``.

source: The default manager on a class is either the one chosen with :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>`, or the first manager declared on the model, or the default manager of the first parent model.
id: Pengelola awalan pada sebuah kelas adalah antara satu dipilih dengan :attr:`Meta.default_manager_name <django.db.models.Options.default_manager_name>`, atau pengelola pertama dinyatakan pada model, atau pengelola awalan dari model induk pertama.

source: These rules provide the necessary flexibility if you want to install a collection of custom managers on a group of models, via an abstract base class, but still customize the default manager. For example, suppose you have this base class::
id: Aturan-aturan ini menyediakan keluwesan yang dibutuhkan jika anda ingin memasang sebuah kumpulan dari penyesuaian pengelola pada sekelompok model, melalui sebuah kelas dasar, tetapi masih menyesuaikan pengelola awalan. Sebagai contoh, misalkan anda mempunyai kelas dasar ini::

source: If you use this directly in a subclass, ``objects`` will be the default manager if you declare no managers in the base class::
id: Jika anda menggunakan ini langsung di sebuah subkelas, ``objects`` akan berupa pengelola awalan jika anda menyatakan tidak ada pengelola di kelas dasar::

source: If you want to inherit from ``AbstractBase``, but provide a different default manager, you can provide the default manager on the child class::
id: Jika anda ingin mewarisi dari ``AbstractBase``, tetapi menyediakan pengelola awalan berbeda, anda dapat menyediakan pengelola awalan pada kelas anak::

source: Here, ``default_manager`` is the default. The ``objects`` manager is still available, since it's inherited. It just isn't used as the default.
id: Disini, ``default_manager`` adalah awalan. Pengelola ``objects`` masih tersedia, sejak itu diwarisi. Itu hanya tidak digunakan sebagai awalan.

source: Finally for this example, suppose you want to add extra managers to the child class, but still use the default from ``AbstractBase``. You can't add the new manager directly in the child class, as that would override the default and you would have to also explicitly include all the managers from the abstract base class. The solution is to put the extra managers in another base class and introduce it into the inheritance hierarchy *after* the defaults::
id: Akhirnya untuk contoh ini, misalkan anda ingin menambah pengelola tambahan pada kelas anak, tetapi masih menggunakan awalan dari ``AbstractBase``. Anda tidak dapat menambah pengelola baru langsung dalam kelas anak, seperti itu akan menimpa awalan dan anda akan juga jelas menyertakan semua pengelola dari kelas dasar abstrak. Pemecahannya adalah menaruh pengelola tambahan dalam kelas dasar lain dan memperkenalkan itu kedalam hirarki warisan *setelah* awalan::

source: Note that while you can *define* a custom manager on the abstract model, you can't *invoke* any methods using the abstract model. That is::
id: Catat bahwa selagi anda dapat *menentukan* pengelolaan penyesuaian pada model abstrak, anda tidak dapat *meminta* metode apapun menggunakan model abstrak. Yaitu::

source: is legal, but::
id: legal, tetapi::

source: will raise an exception. This is because managers are intended to encapsulate logic for managing collections of objects. Since you can't have a collection of abstract objects, it doesn't make sense to be managing them. If you have functionality that applies to the abstract model, you should put that functionality in a ``staticmethod`` or ``classmethod`` on the abstract model.
id: akan memunculkan sebuah pengecualian. Ini karena pengelola bermaksud untuk mengenkapsulasi logika untuk mengelola kumpulan dari obyek. Sejak anda tidak dapat mempunyai sebuah kumpulan dari obyek-obyek abstrak, itu tidak masuk akal untuk mengelola mereka. Jika anda mempunyai fungsionalitas yang berlaku pada model abstrak, anda harus menaruh fungsionalitas itu dalam sebuah ``staticmethod`` atau ``classmethod`` pada model abstrak.

source: Implementation concerns
id: Perhatian penerapan

source: Whatever features you add to your custom ``Manager``, it must be possible to make a shallow copy of a ``Manager`` instance; i.e., the following code must work::
id: Fitur-fitur apapun anda tambahkan ke ``Manager`` penyesuaian anda, itu harus mungkin untuk membuat salinan dangkal dari sebuah instance ``Manager``; yaitu, kode berikut harus bekerja::

source: Django makes shallow copies of manager objects during certain queries; if your Manager cannot be copied, those queries will fail.
id: Django membuat salinan dangkal dari obyek-obyek pengelola selama permintaan tertentu; jika Manager anda tidak dapat disalin, permintaan itu akan gagal.

source: This won't be an issue for most custom managers. If you are just adding simple methods to your ``Manager``, it is unlikely that you will inadvertently make instances of your ``Manager`` uncopyable. However, if you're overriding ``__getattr__`` or some other private method of your ``Manager`` object that controls object state, you should ensure that you don't affect the ability of your ``Manager`` to be copied.
id: Ini tidak akan menjadi sebuah masalah untuk kebanyakan pengelola penyesuaian. Jika anda hanya menambahkan metode sederhana ke ``Manager`` anda, itu tidak mungkin bahwa anda akan secara tidak sengaja membuat instance-instance dari tidak dapat disalin ``Manager`` anda. Bagaimanapun, jika anda menimpa ``__getattr__`` atau beberapa metode pribadi lain dari obyek ``Manager`` anda yang mengendalikan keadaan obyek, anda harus memastikan bahwa anda tidak mempengaruhi kemampuan dari ``Manager`` anda untuk disalin.

source: Models
id: Model

source: A model is the single, definitive source of information about your data. It contains the essential fields and behaviors of the data you're storing. Generally, each model maps to a single database table.
id: Sebuah model adalah tunggal, sumber pasti dari informasi tentang data anda. Itu mengandung bidang-bdiang penting dan perilaku dari data anda masih sedang menyimpan. Umumnya, stiap model memetakan pada sebuah tabel basisdata tunggal.

source: The basics:
id: Dasar:

source: Each model is a Python class that subclasses :class:`django.db.models.Model`.
id: Setiap model adalah kelas Python yang subkelas :class:`django.db.models.Model`.

source: Each attribute of the model represents a database field.
id: Setiap atribut dari model mewakili bidang basisdata.

source: With all of this, Django gives you an automatically-generated database-access API; see :doc:`/topics/db/queries`.
id: Dengan semua ini, Django memberikan API akses-basisdata dibangkitkan-otomatis; lihat :doc:`/topics/db/queries`.

source: Quick example
id: Contoh cepat

source: This example model defines a ``Person``, which has a ``first_name`` and ``last_name``::
id: Model contoh ini menentukan ``Person``, yang mempunyai ``first_name`` dan ``last_name``::

source: ``first_name`` and ``last_name`` are fields_ of the model. Each field is specified as a class attribute, and each attribute maps to a database column.
id: ``first_name`` dan ``last_name`` adalah fields_ dari model. Setiap bidang ditentukan sebagai atribut kelas, dan setiap atribut memetakan pada sebuah kolom basisdata.

source: The above ``Person`` model would create a database table like this:
id: Model ``Person`` diatas akan membuat sebuah tabel basisdata seperti ini::

source: Some technical notes:
id: Beberapa catatan teknis:

source: The name of the table, ``myapp_person``, is automatically derived from some model metadata but can be overridden. See :ref:`table-names` for more details.
id: Nama dari tabel, ``myapp_person``, otomatis berasal dari beberapa metadata model tetapi dapat ditimpa. Lihat :ref:`table-names` untuk rincian lebih.

source: An ``id`` field is added automatically, but this behavior can be overridden. See :ref:`automatic-primary-key-fields`.
id: Sebuah bidang ``id`` ditambahkan secara otomatis, tetapi perilaku ini dapat dikesampingkan. Lihat :ref:`automatic-primary-key-fields`.

source: The ``CREATE TABLE`` SQL in this example is formatted using PostgreSQL syntax, but it's worth noting Django uses SQL tailored to the database backend specified in your :doc:`settings file </topics/settings>`.
id: SQL ``CREATE TABLE`` dalam contoh ini dibentuk menggunakan sintaksis PostgreSQL, tetapi itu perlu dicatat Django menggunakan SQL disesuaikan pada backend basisdata ditentukan dalam :doc:`settings file </topics/settings>` anda.

source: Using models
id: Menggunakan model

source: Once you have defined your models, you need to tell Django you're going to *use* those models. Do this by editing your settings file and changing the :setting:`INSTALLED_APPS` setting to add the name of the module that contains your ``models.py``.
id: Sekali anda telah menentukan model anda, anda butuh memberitahu Django anda sedang akan *menggunakan* model-model tersebut. Lakukan ini dengan menyunting berkas pengaturan anda dan merubah pengaturan :setting:`INSTALLED_APPS` untuk menambah nama dari modul yang mengandung ``models.py`` anda.

source: For example, if the models for your application live in the module ``myapp.models`` (the package structure that is created for an application by the :djadmin:`manage.py startapp <startapp>` script), :setting:`INSTALLED_APPS` should read, in part::
id: Sebagai contoh, jika model-model untuk aplikasi anda tinggal dalam modul ``myapp.models`` (struktur paket yang dibuat untuk sebuah aplikasi oleh tulisan :djadmin:`manage.py startapp <startapp>`), :setting:`INSTALLED_APPS` harus membaca, dalam bagian::

source: When you add new apps to :setting:`INSTALLED_APPS`, be sure to run :djadmin:`manage.py migrate <migrate>`, optionally making migrations for them first with :djadmin:`manage.py makemigrations <makemigrations>`.
id: Ketika anda menambah aplikasi baru pada :setting:`INSTALLED_APPS`, pastikan menjalankan :djadmin:`manage.py migrate <migrate>`, pilihannya membuat perpindahan untuk mereka dahulu dengan :djadmin:`manage.py makemigrations <makemigrations>`.

source: Fields
id: Bidang

source: The most important part of a model -- and the only required part of a model -- is the list of database fields it defines. Fields are specified by class attributes. Be careful not to choose field names that conflict with the :doc:`models API </ref/models/instances>` like ``clean``, ``save``, or ``delete``.
id: Bagian paling penting dari sebuah model -- dan hanya membutuhkan bagian dari sebah model -- adalah daftar bidang basisdata itu tentukan. Bidang-bidang ditentukan oleh atribut kelas. Hati-hati tidak memilih nama bidang yang bertentangan dengan :doc:`models API </ref/models/instances>` seperti ``clean``, ``save``, atau ``delete``.

source: Example::
id: Contoh::

source: Field types
id: Jenis bidang

source: Each field in your model should be an instance of the appropriate :class:`~django.db.models.Field` class. Django uses the field class types to determine a few things:
id: Setiap bidang dalam model anda harus berupa sebuah instance dari kelas :class:`~django.db.models.Field` sesuai. Django menggunakan jenis kelas bidang untuk menentukan sedikit hal:
