Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Represents the name of a language. Browsers send the names of the languages they accept in the ``Accept-Language`` HTTP header using this format. Examples: ``it``, ``de-at``, ``es``, ``pt-br``. Language codes are generally represented in lower-case, but the HTTP ``Accept-Language`` header is case-insensitive. The separator is a dash.
id: Mewakili nama dari bahasa. Peramban mengirim nama-nama dari bahasa mereka terima dalam kepala HTTP ``Accept-Language`` menggunakan bentuk ini. Contoh: ``it``, ``de-at``, ``es``, ``pt-br``. Kode-kode bahasa umumnya diwakili dalam huruf-kecil, tetapi kepala ``Accept-Language`` HTTP adalah kasus-tidak-peka. Pemisahnya adalah sebuah tanda garis.

source: message file
id: berkas pesan

source: translation string
id: deretan kalimat terjemahan

source: format file
id: bentuk berkas

source: Time zones
id: Zona waktu

source: Concepts
id: Konsep

source: Default time zone and current time zone
id: Zona waktu awal dan zona waktu saat ini

source: Selecting the current time zone
id: Memilih zona waktu saat ini

source: Create a view that can set the current timezone::
id: Buat tampilan yang dapat mengatur zona waktu saat ini ::

source: Migration guide
id: Panduan perpindahan

source: Database
id: Basisdata

source: Other databases
id: Basisdata lain

source: Code
id: Kode

source: During development, you can turn such warnings into exceptions and get a traceback by adding the following to your settings file::
id: Selama pengembangan, anda dapat merubah peringatan itu kedalam pengecualian dan mendapatkan melacak kembali dengan menambahkan berikut pada berkas pengaturan anda::

source: Fixtures
id: Perlengkapan

source: For a naive datetime, it obviously isn't::
id: Untuk datetime tidak dibuat-buat, itu jelas tidak::

source: Setup
id: Pengaturan

source: **I don't need multiple time zones. Should I enable time zone support?**
id: **Saya tidak butuh banyak zona waktu. Haruskah saya mengadakan dukungan zona waktu?**

source: **I've enabled time zone support. Am I safe?**
id: **Saya telah mengadakan dukungan zona waktu. Apakah Saya aman?**

source: **How do I interact with a database that stores datetimes in local time?**
id: **Bagaimana Saya berinteraksi dengan basisdata yang menyimpan datetime dalam waktu lokal?**

source: Set the :setting:`TIME_ZONE <DATABASE-TIME_ZONE>` option to the appropriate time zone for this database in the :setting:`DATABASES` setting.
id: Setel pilihan :setting:`TIME_ZONE 1` pada zona waktu yang sesuai untuk basisdata ini dalam pengaturan :setting:`DATABASES`.

source: This is useful for connecting to a database that doesn't support time zones and that isn't managed by Django when :setting:`USE_TZ` is ``True``.
id: Ini berguna untuk menghubungkan ke basisdata yang tidak mendukung zona waktu dan yang tidak dikelola oleh Django ketika :setting:`USE_TZ` adalah ``True``.

source: Troubleshooting
id: Menyelesaikan masalah

source: ``now.date()`` **is yesterday! (or tomorrow)**
id: ``now.date()`` ** adalah kemarin! (atau besok)**

source: Well, the first question is, do you really need to?
id: Baik, pertanyaan pertama adalah, apakah anda sangat membutuhkannya?

source: **How can I see all available time zones?**
id: **Bagaimana dapat Saya melihat semua zona waktu?**

source: Translation
id: Terjemahan

source: Standard translation
id: Terjemahan standar

source: What functions may be aliased as ``_``?
id: Fungsi-fungsi apa mungkin dinama lainkan sebagai ``_``?

source: In this example, the text ``"Welcome to my site."`` is marked as a translation string::
id: Di contoh ini, teks ``"Welcome to my site."`` ditandai sebagai deretan karakter terjemahan::

source: Translation works on variables. Again, here's an identical example::
id: Terjemahan bekerja pada variabel. Kembali, ini adalah contoh yang mirip::

source: Comments for translators
id: Komentar untuk penterjemah

source: Just for completeness, this is the corresponding fragment of the resulting ``.po`` file:
id: Hanya untuk kelengkapan, ini adalah fragmen sesuai dari menghasikan berkas ``.po``:

source: You would get an error when running :djadmin:`django-admin compilemessages <compilemessages>`::
id: Anda akan mendapatkan sebuah kesalahan ketika menjalankan :djadmin:`django-admin compilemessages 1`::

source: or::
id: atau::

source: will appear in the ``.po`` file as:
id: akan muncul di berkas ``.po`` sebagai:

source: Lazy translation
id: Terjemahan lazy

source: Formatting strings: ``format_lazy()``
id: Membentuk string: ``format_lazy()``

source: And then later::
id: Dan lalu kemudian::

source: The ``get_language_info()`` function provides detailed information about languages::
id: Fungsi ``get_language_info()`` menyediakan informasi rinci tentang bahasa::

source: ``trans`` template tag
id: Etiket cetakan ``trans``

source: ``blocktrans`` template tag
id: Etiket cetakan ``blocktrans``

source: Another feature ``{% blocktrans %}`` supports is the ``trimmed`` option. This option will remove newline characters from the beginning and the end of the content of the ``{% blocktrans %}`` tag, replace any whitespace at the beginning and end of a line and merge all lines into one using a space character to separate them. This is quite useful for indenting the content of a ``{% blocktrans %}`` tag without having the indentation characters end up in the corresponding entry in the PO file, which makes the translation process easier.
id: Dukungan ``{% blocktrans %}`` fitur lain adalah pilihan ``trimmed``. Pilihan ini akan memindahkan karakter baris baru dari awal dan akhir dari isi dari etiket ``{% blocktrans %}``, ganti setiap ruang kosong pada awal dan akhir dari sebuah baris dan menggabungkan semua baris kedalam satu menggunakan karakter ruang kosong untuk memisahkan mereka. Ini sangat berguna untuk melekukkan isi dari etiket ``{% blocktrans %}`` tanpa memiliki karakter lekukan terakhir di masukan yang sesuai di berkas PO, yang membuat pengolahan terjemahan lebih mudah.

source: For instance, the following ``{% blocktrans %}`` tag::
id: Untuk contoh, etiket ``{% blocktrans %}`` berikut::

source: Comments for translators in templates
id: Komentar untuk penterjemah dalam cetakan

source: Just for completeness, these are the corresponding fragments of the resulting ``.po`` file:
id: Hanya untuk kelengkapan, ini semua adalah fragmen sesuai dari menghasikan berkas ``.po``:

source: Switching language in templates
id: Mengganti bahasa dalam cetakan

source: If you want to select a language within a template, you can use the ``language`` template tag:
id: Jika anda ingin memilih sebuah bahasa dalam sebuah cetakan, anda dapat menggunakan etiket cetakan ``language``:

source: Other tags
id: Etiket lain

source: These tags also require a ``{% load i18n %}``.
id: Etiket ini juga membutuhkan sebuah ``{% memuat i18n %}``.

source: You can then access the information::
id: Anda dapat kemudian mengakses informasi::

source: In addition to :setting:`LANGUAGES` style list of tuples, ``{% get_language_info_list %}`` supports simple lists of language codes. If you do this in your view:
id: Dalam tambahan pada daftar gaya :setting:`LANGUAGES` dari tuple, ``{% get_language_info_list %}`` mendukung daftar sederhana dari kode bahasa. Jika anda melakukan ini dalam tampilan anda:

source: you can iterate over those languages in the template::
id: anda dapat mengulangi terhadap bahasa-bahasa tersebut dalam cetakan::

source: ``{{ LANGUAGE_CODE|language_name_translated }}`` ("nmecky", when active language is Czech)
id: ``{{ LANGUAGE_CODE|language_name_translated }}`` ("nmecky", ketika bahasa aktif adalah Ceko)

source: Internationalization: in JavaScript code
id: Internasionalisasi: dalam kode JavaScript

source: Adding translations to JavaScript poses some problems:
id: Menambahkan terjemahan ke JavaScript menimbulkan beberapa masalah:

source: JavaScript code doesn't have access to a ``gettext`` implementation.
id: Kode JavaScript tidak mempunyai akses ke penerapan ``gettext``.

source: JavaScript code doesn't have access to ``.po`` or ``.mo`` files; they need to be delivered by the server.
id: Kode JavaScript tidak mempunyai akses ke berkas ``.po`` or ``.mo``; mereka butuh untuk dikirimkan oleh peladen.

source: The translation catalogs for JavaScript should be kept as small as possible.
id: Katalog terjemahan untuk JavaScript harus disimpan sekecil mungkin.

source: The ``JavaScriptCatalog`` view
id: Tampilan ``JavaScriptCatalog``

source: Using the JavaScript translation catalog
id: Menggunakan katalog terjemahan JavaScript

source: To use the catalog, just pull in the dynamically generated script like this:
id: Untuk menggunakan katalog, cukup tarik di tulisan dibangkitkan dinamis seperti ini:

source: Positional interpolation: ``obj`` contains a JavaScript Array object whose elements values are then sequentially interpolated in their corresponding ``fmt`` placeholders in the same order they appear. For example::
id: Penempatan penambahan: ``obj`` mengandung obyek Senarai JavaScript yang unsur-unsurnya kemudian berurutan ditambahkan dalam palceholder ``fmt`` mereka yang sesuai dalam urutan sama mereka muncul. Sebagai contoh::

source: The ``get_format`` function has access to the configured i18n formatting settings and can retrieve the format string for a given setting name::
id: Fungsi ``get_format`` mempunyai akses ke pengaturan pembentukan i18n terkonfigurasi dan dapat mengambil bentuk string untuk nama pengaturan yang diberikan::

source: It has access to the following settings:
id: Itu mempunyai akses pada pengaturan berikut:

source: This is useful for maintaining formatting consistency with the Python-rendered values.
id: Ini berguna untuk merawat ketetapan pembentukan dengan nilai-nilai dibangun-Python.

source: This emulates the ``gettext`` function but does nothing, returning whatever is passed to it::
id: Ini menandingin fungsi ``gettext`` tetapi tidak melakukan apapun, mengembalikan apapun dilewatkan ke itu::

source: This is useful for stubbing out portions of the code that will need translation in the future.
id: Ini adalah berguna untuk memberhentikan bagian-bagian dari kode akan butuh diterjemahkan di masa akan datang.

source: The ``pgettext`` function behaves like the Python variant (:func:`~django.utils.translation.pgettext()`), providing a contextually translated word::
id: Fungsi ``pgettext`` berperilaku seperti ragam Python (:func:`~django.utils.translation.pgettext()`),menyediakan kata terjemahan kontekstual::

source: The ``npgettext`` function also behaves like the Python variant (:func:`~django.utils.translation.npgettext()`), providing a **pluralized** contextually translated word::
id: Fungsi ``npgettext`` juga berperilaku seperti ragam Python (:func:`~django.utils.translation.npgettext()`), menyediakan **menjamakkan** kata terjemahan kontekstual::

source: The ``pluralidx`` function works in a similar way to the :tfilter:`pluralize` template filter, determining if a given ``count`` should use a plural form of a word or not::
id: Fungsi ``pluralidx`` bekerja dalam cara sama pada penyaring cetakan :tfilter:`pluralize`, menentukan jika ``count`` diberikan harus menggunakan bentuk jamak dari sebuah kata atau tidak::

source: In the simplest case, if no custom pluralization is needed, this returns ``false`` for the integer ``1`` and ``true`` for all other numbers.
id: Dalam kasis paling sederhana, jika tidak ada penyesuaian penjamakan dibutuhkan, ini mengembalikan ``false`` untuk integer ``1`` dan ``true`` untuk semua angka-angka lain.

source: However, pluralization is not this simple in all languages. If the language does not support pluralization, an empty value is provided.
id: Bagaimanapun, penjamakan tidak sesederhana ini dalam semua bahasa. Jika bahasa tidak mendukung penjamakan, sebuah nilai kosong disediakan.

source: Additionally, if there are complex rules around pluralization, the catalog view will render a conditional expression. This will evaluate to either a ``true`` (should pluralize) or ``false`` (should **not** pluralize) value.
id: Tambahannya, jika ada aturan-aturan rumit sekitar penjamakan, tampilan katalog akan membangun sebuah penyataan bersyarat. Ini akan menilai salah satu nilai ``True`` (harus jamak) atau ``false`` (harus **tidak** jamak).

source: The ``JSONCatalog`` view
id: Tampilan ``JSONCatalog``

source: In order to use another client-side library to handle translations, you may want to take advantage of the ``JSONCatalog`` view. It's similar to :class:`~django.views.i18n.JavaScriptCatalog` but returns a JSON response.
id: Untuk menggunakan pustaka sisi-klien lain untuk menangani terjemahan, anda mungkin ingin mengambil keuntungan dari tampilan ``JSONCatalog``. Itu mirip pada :class:`~django.views.i18n.JavaScriptCatalog`tetapi mengembalikan sebuah tanggapan JSON.

source: See the documentation for :class:`~django.views.i18n.JavaScriptCatalog` to learn about possible values and use of the ``domain`` and ``packages`` attributes.
id: Lihat dokumentasi untuk :class:`~django.views.i18n.JavaScriptCatalog` untuk belajar tentang kemungkinan nilai-nilai dan penggunaan dari atribut-atribut ``domain`` dan ``packages``.

source: The response format is as follows:
id: Bentuk tanggapan sebagai berikut:

source: Note on performance
id: Catatan pada penampilan

source: The various JavaScript/JSON i18n views generate the catalog from ``.mo`` files on every request. Since its output is constant, at least for a given version of a site, it's a good candidate for caching.
id: Tampilan beragam i18n JavaScript/JSON membangkitkan katalog dari berkas-berkas ``.mo`` pada setiap permintaan. Sejak itu mengeluarkan sebuah ketetapan, setidaknya untuk versi diberikan dari sebuah situs, itu adalah calon bagus untuk caching.

source: Server-side caching will reduce CPU load. It's easily implemented with the :func:`~django.views.decorators.cache.cache_page` decorator. To trigger cache invalidation when your translations change, provide a version-dependent key prefix, as shown in the example below, or map the view at a version-dependent URL::
id: Caching sisi-peladen akan mengurangi beban CPU. Itu sangat mudah diterapkan dengan penghias :func:`~django.views.decorators.cache.cache_page`. Untuk memicu ketidakabsahan cache ketika terjemahan anda berubah, sediakan awalan kunci versi-berdiri-sendiri, seperti ditunjukkan dalam contoh dibawah atau tampilan peta pada URL versi-berdiri-sendiri::

source: Client-side caching will save bandwidth and make your site load faster. If you're using ETags (:class:`~django.middleware.http.ConditionalGetMiddleware`), you're already covered. Otherwise, you can apply :ref:`conditional decorators <conditional-decorators>`. In the following example, the cache is invalidated whenever you restart your application server::
id: Caching sisi-klien akan menyimpan lebar pita dan membuat situs anda dimuat lebih cepat. Jika anda sedang menggunakan ETag (:class:`~django.middleware.http.ConditionalGetMiddleware`),anda siap dicakupi. Sebaliknya, anda dapat memberlakukan :ref:`conditional decorators 1`. Dalam contoh berikut, cache tidak berlaku ketika anda memulai kembali peladen aplikasi anda::

source: You can even pre-generate the JavaScript catalog as part of your deployment procedure and serve it as a static file. This radical technique is implemented in django-statici18n_.
id: Anda dapat bahkan pra-membangkitkan katalog JavaScript sebagai bagian dari prosedur pegembangan anda dan melayani itu sebagai berkas tetap. Teknik radikal ini adalah diterapkan dalam django-statici18n_.

source: Internationalization: in URL patterns
id: Internasionalisasi: dalam pola URL

source: Django provides two mechanisms to internationalize URL patterns:
id: Django menyediakan dua mekanisme pada pola URL internasionalisasi:

source: Adding the language prefix to the root of the URL patterns to make it possible for :class:`~django.middleware.locale.LocaleMiddleware` to detect the language to activate from the requested URL.
id: Menambahkan awalan bahasa pada akar dari pola URL untuk membuat itu memungkinkan untuk :class:`~django.middleware.locale.LocaleMiddleware`untuk mengenali bahasa untuk diaktifkan dari URL diminta.

source: Making URL patterns themselves translatable via the :func:`django.utils.translation.gettext_lazy()` function.
id: Membuat pola URL mereka sendiri dapat diterjemahkan melalui fungsi :func:`django.utils.translation.gettext_lazy()`.

source: Using either one of these features requires that an active language be set for each request; in other words, you need to have :class:`django.middleware.locale.LocaleMiddleware` in your :setting:`MIDDLEWARE` setting.
id: Menggunakan salah satu dari fitur-fitur ini membutuhkan itu sebuah bahasa aktif untuk disetel untuk setiap permintaan; dengan kata lain, anda butuh harus :class:`django.middleware.locale.LocaleMiddleware` dalam pengaturan :setting:`MIDDLEWARE` setting anda.

source: Language prefix in URL patterns
id: Awalan bahasa dalam pola URL

source: This function can be used in a root URLconf and Django will automatically prepend the current active language code to all URL patterns defined within :func:`~django.conf.urls.i18n.i18n_patterns`.
id: Fungsi ini dapat digunakan dalam URLconf akar dan Django akan otomatis menambahkan kode bahasa aktif saat ini pada semua pola URL ditentukan dalam :func:`~django.conf.urls.i18n.i18n_patterns`.

source: Setting ``prefix_default_language`` to ``False`` removes the prefix from the default language (:setting:`LANGUAGE_CODE`). This can be useful when adding translations to existing site so that the current URLs won't change.
id: Mengatur ``prefix_default_language`` menjadi ``False`` memindahkan awalan dari bahasa awalan (:setting:`LANGUAGE_CODE`).Ini dapat berguna ketika menambahkan terjemahan pada situs yang ada sehingga URL saat ini tidak akan berubah.

source: Example URL patterns::
id: Contoh pola URL::

source: After defining these URL patterns, Django will automatically add the language prefix to the URL patterns that were added by the ``i18n_patterns`` function. Example::
id: Setelah menentukan pola URL ini, Django akan otomatis menambahkan awalan bahasa ke pola URL yang telah ditambahkan oleh fungsi ``i18n_patterns``. Contoh::

source: With ``prefix_default_language=False`` and ``LANGUAGE_CODE='en'``, the URLs will be::
id: Dengan ``prefix_default_language=False`` dan ``LANGUAGE_CODE='en'``, URL akan menjadi::

source: :func:`~django.conf.urls.i18n.i18n_patterns` is only allowed in a root URLconf. Using it within an included URLconf will throw an :exc:`~django.core.exceptions.ImproperlyConfigured` exception.
id: :func:`~django.conf.urls.i18n.i18n_patterns` hanya diizinkan dalam akar URLconf. Menggunakan itu dalam sebuah URLconf disertakan akan melempar pengecualian :exc:`~django.core.exceptions.ImproperlyConfigured`.

source: Ensure that you don't have non-prefixed URL patterns that might collide with an automatically-added language prefix.
id: Memastikan bahwa anda tidak mempunyai pola URL bukan-awalan yang mungkin bertabrakan dengan awalan bahasa otomatis-ditambahkan.

source: Translating URL patterns
id: Menterjemahkan pola URL

source: URL patterns can also be marked translatable using the :func:`~django.utils.translation.gettext_lazy` function. Example::
id: Pola URL dapat juga ditandai dapat diterjemahkan menggunakan fungsi :func:`~django.utils.translation.gettext_lazy`. Contoh::

source: After you've created the translations, the :func:`~django.urls.reverse` function will return the URL in the active language. Example::
id: Setelah anda telah membuat terjemahan, fungsi :func:`~django.urls.reverse` akan mengembalikan URL dalam bahasa aktif. Contoh::

source: Reversing in templates
id: Membalikkan dalam cetakan-cetakan

source: If localized URLs get reversed in templates they always use the current language. To link to a URL in another language use the :ttag:`language` template tag. It enables the given language in the enclosed template section:
id: Jika URL lokal mendapatkan terbalik dalam cetakan mereka selalu menggunakan bahasa saat ini. Untuk menautkan ke sebuah URL dalam bahasa lain gunakan etiket cetakan :ttag:`language`. Itu mengadakan bahasa yang diberikan dalam bagian cetakan tertutup:

source: The :ttag:`language` tag expects the language code as the only argument.
id: Etiket :ttag:`language` mengharapkan kode bahasa sebagai hanya argumen.

source: Localization: how to create language files
id: Lokalisasi: bagaimana membuat berkas-berkas bahasa

source: Once the string literals of an application have been tagged for later translation, the translation themselves need to be written (or obtained). Here's how that works.
id: Setelah harfiah string dari sebuah aplikasi telah dietiketkan untuk terjemahan akhir, terjemahan itu sendiri butuh ditulis (atau diambil). Ini adalah bagaimana itu bekerja.

source: Message files
id: Berkas pesan

source: The first step is to create a :term:`message file` for a new language. A message file is a plain-text file, representing a single language, that contains all available translation strings and how they should be represented in the given language. Message files have a ``.po`` file extension.
id: langkah pertama adalah membuat sebuah :term:`message file`untuk bahasa baru. Sebuah berkas pesan adalah sebuah berkas teks-polos, mewakili bahasa tunggal, yang mengandung semua string terjemahan tersedia dan bagaimana mereka harus dibawakan dalam bahasa diberikan. Berkas-berkas pesan mempunyai ekstensi berkas ``.po``.

source: Django comes with a tool, :djadmin:`django-admin makemessages <makemessages>`, that automates the creation and upkeep of these files.
id: Django datang dengan sebuah alat, :djadmin:`django-admin makemessages 1`,yang mengotomatiskan pembuatan dan perawatan dari berkas-berkas ini.

source: Gettext utilities
id: Utilitas gettext

source: The ``makemessages`` command (and ``compilemessages`` discussed later) use commands from the GNU gettext toolset: ``xgettext``, ``msgfmt``, ``msgmerge`` and ``msguniq``.
id: Perintah ``makemessages`` (dan ``compilemessages``diobrolkan kemudian) menggunakan perintah dari kumpulan alat gettext GNU: ``xgettext``, ``msgfmt``, ``msgmerge`` dan ``msguniq``.

source: The minimum version of the ``gettext`` utilities supported is 0.15.
id: Versi minimal dari utilitas ``gettext`` didukung adalah 0.15.

source: To create or update a message file, run this command::
id: Untuk membuat atau memperbaharui sebuah berkas pesan, jalankan perintah ini::

source: ...where ``de`` is the :term:`locale name` for the message file you want to create. For example, ``pt_BR`` for Brazilian Portuguese, ``de_AT`` for Austrian German or ``id`` for Indonesian.
id: ...dimana ``de`` adalah :term:`locale name` untuk berkas pesan anda ingin buat. Sebagai contoh, ``pt_BR`` untuk Brasil Portugis, ``de_AT``untuk Austria Jerman atau ``id`` untuk Indonesia.

source: The script should be run from one of two places:
id: Tulisan ini harus berjalan dari satu atau dua tempat:

source: The root directory of your Django project (the one that contains ``manage.py``).
id: Direktori akar untuk proyek Django anda (satu yang mengandung ``manage.py``).

source: The root directory of one of your Django apps.
id: Direktori akar dari satu dari aplikasi Django anda.
