Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Also, be aware that there is some (small extra) overhead incurred inside Django when constructing a model with deferred fields. Don't be too aggressive in deferring fields without profiling as the database has to read most of the non-text, non-VARCHAR data from the disk for a single row in the results, even if it ends up only using a few columns. The ``defer()`` and ``only()`` methods are most useful when you can avoid loading a lot of text data or for fields that might take a lot of processing to convert back to Python. As always, profile first, then optimize.
id: Juga, waspada bahwa ada beberapa (sedikit tambahan) overhead terjadi didalam Django ketika membangun model dengan bidang-bidang yang ditangguhkan. Jangan terlalu agresif dalam menangguhkan bidang-bidang tanpa memprofilkan sebagai basisdata harus membaca kebanyakan bukan-teks, data bukan-VARCHAR dari cakram untuk baris tunggal dalam hasil, bahkan jika itu berakhir hanya menggunakan sedikit kolom. Metode ``defer()`` dan ``only()`` paling berguna ketika anda dapat menghindari memuat banyak data teks atau untuk bidang yang mungkin mengambil banyak pengolahan untuk merubah kembali ke Python. Seperti biasanya, profilkan dahulu, kemudian optimalkan.

source: Use ``QuerySet.count()``
id: Gunakan ``QuerySet.count()``

source: ...if you only want the count, rather than doing ``len(queryset)``.
id: ..jika anda hanya ingin menghitung, daripada melakukan ``len(queryset)``.

source: Use ``QuerySet.exists()``
id: Gunakan ``QuerySet.exists()``

source: ...if you only want to find out if at least one result exists, rather than ``if queryset``.
id: ...jika anda hanya ingin menemukan jika setidaknya satu hasil ada, daripada ``if queryset``.

source: But:
id: Tetapi:

source: Don't overuse ``count()`` and ``exists()``
id: Jangan berlebihan ``count()`` dan ``exists()``

source: If you are going to need other data from the QuerySet, just evaluate it.
id: Jika anda akan butuh data lain dari QuerySet, cukup nilai itu.

source: For example, assuming an Email model that has a ``body`` attribute and a many-to-many relation to User, the following template code is optimal:
id: Sebagai contoh, menganggap sebuah model Email yang mempunyai atribut ``body`` dan hubungan many-to-many pada User, kode cetakan berikut adalah optimal:

source: It is optimal because:
id: DIa optimal karena:

source: Since QuerySets are lazy, this does no database queries if 'display_inbox' is False.
id: Sejak QuerySet adalah lazy,ini tidak melakukan permintaan basisdata jika 'display_inbox' adalah False.

source: Use of :ttag:`with` means that we store ``user.emails.all`` in a variable for later use, allowing its cache to be re-used.
id: Penggunaan :ttag:`with` berarti bahwa kami menyimpan ``user.emails.all`` dalam sebuah variabel untuk penggunaan akhir, mengizinkan cache itu untuk digunakan-kembali.

source: The line ``{% if emails %}`` causes ``QuerySet.__bool__()`` to be called, which causes the ``user.emails.all()`` query to be run on the database, and at the least the first line to be turned into an ORM object. If there aren't any results, it will return False, otherwise True.
id: Baris ``{% if emails %}`` menyebabkan ``QuerySet.__bool__()`` dipanggil, yang menyebabkan permintaan ``user.emails.all()`` dijalankan pada basisdata, dan setidaknya baris pertama dirubah menjadi obyek ORM. Jika tidak ada hasil apapun, itu akan mengembalikan False, sebaliknya True.

source: The use of ``{{ emails|length }}`` calls ``QuerySet.__len__()``, filling out the rest of the cache without doing another query.
id: Penggunaan ``{{ emails|length }}`` memanggil ``QuerySet.__len__()``, mengisi sisa dari cache tanpa melakukan permintaan lain.

source: The :ttag:`for` loop iterates over the already filled cache.
id: Putaran :ttag:`for` berulang terhadap cache sudah diisi.

source: In total, this code does either one or zero database queries. The only deliberate optimization performed is the use of the :ttag:`with` tag. Using ``QuerySet.exists()`` or ``QuerySet.count()`` at any point would cause additional queries.
id: Dalam jumlah, kode ini melakukan baik satu atau nol permintaan basisdata. Satu-satunya optimalisasi kesengajaan dilakukan adalah menggunakan etiket :ttag:`with`. Menggunakan ``QuerySet.exists()`` atau ``QuerySet.count()`` pada titik apapun akan menyebabkan tambahan permintaan.

source: Use ``QuerySet.update()`` and ``delete()``
id: Gunakan ``QuerySet.update()`` dan ``delete()``

source: Rather than retrieve a load of objects, set some values, and save them individual, use a bulk SQL UPDATE statement, via :ref:`QuerySet.update() <topics-db-queries-update>`. Similarly, do :ref:`bulk deletes <topics-db-queries-delete>` where possible.
id: Daripada mengambil memuat obyek, setel beberapa nilai, dan simpan mereka masing-masing, gunakan pernyataan SQL UPDATE dalam jumlah besar, melalui :ref:`QuerySet.update() 1`. Demikian pula, lakukan :ref:`bulk deletes 2` dimana memungkinkan.

source: Note, however, that these bulk update methods cannot call the ``save()`` or ``delete()`` methods of individual instances, which means that any custom behavior you have added for these methods will not be executed, including anything driven from the normal database object :doc:`signals </ref/signals>`.
id: Catat, bagaimanapun, metode pembaharuan jumlah besar ini tidak dapat memanggil metode ``save()`` atau ``delete()`` dari masing-masing instance, yang berarti bahwa perilaku penyesuaian apapun anda telah tambahkan untuk metode-metode ini tidak akan dijalankan, termasuk apapun didorong dari obyek basisdata biasa :doc:`signals 1`.

source: Use foreign key values directly
id: Menggunakan nilai foreign key secara langsung

source: If you only need a foreign key value, use the foreign key value that is already on the object you've got, rather than getting the whole related object and taking its primary key. i.e. do::
id: Jika anda hanya butuh nilai foreign key, gunakan nilai foreign key yang sudah pada obyek anda telah dapatkan, daripada mendapatkan keseluruhan obyek terkait dan mengambil primary key nya, yaitu. lakukan::

source: instead of::
id: dari pada::

source: Don't order results if you don't care
id: Jangan urutkan hasil jika anda tidak peduli

source: Ordering is not free; each field to order by is an operation the database must perform. If a model has a default ordering (:attr:`Meta.ordering <django.db.models.Options.ordering>`) and you don't need it, remove it on a ``QuerySet`` by calling :meth:`~django.db.models.query.QuerySet.order_by()` with no parameters.
id: Pengurutan tidak bebas; setiap bidang yang diurutkan adalah sebuah operai basisdata harus dilakukan. Jika sebuah model awal mengurutkan (:attr:`Meta.ordering <django.db.models.Options.ordering>`) dan anda tidak membutuhkannya, pindahkan dia pada ``QuerySet`` dengan memanggil :meth:`~django.db.models.query.QuerySet.order_by()` dengan tidak ada parameter.

source: Adding an index to your database may help to improve ordering performance.
id: Menambahkan indeks ke basisdata anda mungkin membantu meningkatkan penampilan pengurutan.

source: Insert in bulk
id: Masuk dalam bulk

source: When creating objects, where possible, use the :meth:`~django.db.models.query.QuerySet.bulk_create()` method to reduce the number of SQL queries. For example::
id: Ketika membuat obyek-obyek, dimana memungkinkan, gunakan metode :meth:`~django.db.models.query.QuerySet.bulk_create()`untuk mengurangi sejumlah permintaan SQL. Sebagai contoh::

source: ...is preferable to::
id: ...adalah lebih baik untuk::

source: Note that there are a number of :meth:`caveats to this method <django.db.models.query.QuerySet.bulk_create>`, so make sure it's appropriate for your use case.
id: Catat bahwa ada angka dari :meth:`caveats to this method <django.db.models.query.QuerySet.bulk_create>`, jadi pastikan dia sesuai untuk kasus digunakan anda.

source: This also applies to :class:`ManyToManyFields <django.db.models.ManyToManyField>`, so doing::
id: Ini juga berlaku pada :class:`ManyToManyFields <django.db.models.ManyToManyField>`, demikian::

source: ...where ``Bands`` and ``Artists`` have a many-to-many relationship.
id: ...dimana ``Bands`` dan ``Artists``mempunyai hubungan many-to-many.

source: Making queries
id: Membuat query

source: Once you've created your :doc:`data models </topics/db/models>`, Django automatically gives you a database-abstraction API that lets you create, retrieve, update and delete objects. This document explains how to use this API. Refer to the :doc:`data model reference </ref/models/index>` for full details of all the various model lookup options.
id: Sekali anda telah membuat :doc:`data models 1` anda, Django otomatis memberikan anda pemisahan API yang membuat anda membuat, mengambil, memperbaharui dan menghapus obyek. Dokumen ini menjelaskan bagaimana menggunakan API ini. mengacu pada :doc:`data model reference 2`untuk rincian penuh dari beragam pilihan pencarian model.

source: Throughout this guide (and in the reference), we'll refer to the following models, which comprise a Weblog application:
id: Sepanjang panduan ini (dan dalam acuan), kami akan mengacu ke model-model berikut, yang meliputi aplikasi Weblog:

source: Creating objects
id: Membuat obyek

source: To represent database-table data in Python objects, Django uses an intuitive system: A model class represents a database table, and an instance of that class represents a particular record in the database table.
id: Untuk mewakili data tabel-basisdata dalam obyek Python, Django menggunakan sistem intuitif: Sebuah kelas model mewakili sebuah tabel basisdata, dan sebuah instance dari kelas itu mewakili rekaman tertentu dalam tabel basisdata.

source: To create an object, instantiate it using keyword arguments to the model class, then call :meth:`~django.db.models.Model.save` to save it to the database.
id: Untuk membuat sebuah obyek, instansiasi itu menggunakan argumen katakunci pada kelas model, kemudian memanggil :meth:`~django.db.models.Model.save` untuk menyimpan itu ke basisdata.

source: Assuming models live in a file ``mysite/blog/models.py``, here's an example::
id: Menganggap model tinggal di berkas ``mysite/blog/models.py``, ini adalah sebuah contoh::

source: This performs an ``INSERT`` SQL statement behind the scenes. Django doesn't hit the database until you explicitly call :meth:`~django.db.models.Model.save`.
id: Ini melakukan pernyataan SQL ``INSERT`` dibelakang layar. Django tidak mengenai basisdata sampai anda secara jelas memanggil :meth:`~django.db.models.Model.save`.

source: The :meth:`~django.db.models.Model.save` method has no return value.
id: Cara :meth:`~django.db.models.Model.save` tidak mempunyai nilai kembalian.

source: :meth:`~django.db.models.Model.save` takes a number of advanced options not described here. See the documentation for :meth:`~django.db.models.Model.save` for complete details.
id: :meth:`~django.db.models.Model.save` mengambil sejumalh pilihan keuntungan tidak digambarkan disini. Lihat dokumentasi untuk :meth:`~django.db.models.Model.save` untuk rincian lengkap.

source: To create and save an object in a single step, use the :meth:`~django.db.models.query.QuerySet.create()` method.
id: Untuk membuat dan menyimpan sebuah obyek dalam langkah tunggal, gunakan cara :meth:`~django.db.models.query.QuerySet.create()`.

source: Saving changes to objects
id: Menyimpan perubahan ke obyek

source: To save changes to an object that's already in the database, use :meth:`~django.db.models.Model.save`.
id: Untuk menyimpan perubahan ke sebuah obyek yang sudah ada di basisdata gunakan :meth:`~django.db.models.Model.save`.

source: Given a ``Blog`` instance ``b5`` that has already been saved to the database, this example changes its name and updates its record in the database::
id: Diberikan instance ``Blog`` ``b5`` yang telah disimpan ke basisdata, contoh ini merubah namanya dan memperbaharui rekamannya dalam basisdata::

source: This performs an ``UPDATE`` SQL statement behind the scenes. Django doesn't hit the database until you explicitly call :meth:`~django.db.models.Model.save`.
id: Ini melakukan pernyataan SQL ``UPDATE`` dibelakang layar. Django tidak mengenai basisdata sampai anda secara jelas memanggil :meth:`~django.db.models.Model.save`.

source: Saving ``ForeignKey`` and ``ManyToManyField`` fields
id: Menyimpan bidang ``ForeignKey`` dan ``ManyToManyField``

source: Updating a :class:`~django.db.models.ForeignKey` field works exactly the same way as saving a normal field -- simply assign an object of the right type to the field in question. This example updates the ``blog`` attribute of an ``Entry`` instance ``entry``, assuming appropriate instances of ``Entry`` and ``Blog`` are already saved to the database (so we can retrieve them below)::
id: Memperbaharui bidang :class:`~django.db.models.ForeignKey` bekerja tepat cara sama ketika menyimpan bidang biasa -- cukup menugaskan sebuah obyek dari jenis yang benar pada bidang dalam pertanyaan. Contoh ini memperbaharui atribut ``blog`` dari sebuah instance ``Entry``, menganggap instance-instance sesuai dari ``Entry`` dan ``Blog`` sudah disimpan ke basisdata (jadi kami dapat mengambil mereka dibawah)::

source: Updating a :class:`~django.db.models.ManyToManyField` works a little differently -- use the :meth:`~django.db.models.fields.related.RelatedManager.add` method on the field to add a record to the relation. This example adds the ``Author`` instance ``joe`` to the ``entry`` object::
id: Memperbaharui sebuah :class:`~django.db.models.ManyToManyField`bekerja sedikit berbeda -- gunakan metode :meth:`~django.db.models.fields.related.RelatedManager.add`pada bidang untuk menambahkan rekaman ke hubungan. Contoh ini menambahkan instance ``Author`` ``joe`` ke obyek ``entry``::

source: To add multiple records to a :class:`~django.db.models.ManyToManyField` in one go, include multiple arguments in the call to :meth:`~django.db.models.fields.related.RelatedManager.add`, like this::
id: Untuk menambahkan banyak rekaman pada :class:`~django.db.models.ManyToManyField`dalam sekali pergi, sertakan banyak argumen dalam panggilan pada :meth:`~django.db.models.fields.related.RelatedManager.add`, seperti ini::

source: Django will complain if you try to assign or add an object of the wrong type.
id: Django akan mengeluh jika anda mencoba memberikan atau menambahkan sebuah obyek dari jenis salah.

source: Retrieving objects
id: Mengambil obyek

source: To retrieve objects from your database, construct a :class:`~django.db.models.query.QuerySet` via a :class:`~django.db.models.Manager` on your model class.
id: Untuk mengambil obyek-obyek dari basisdata anda, bangun sebuah :class:`~django.db.models.query.QuerySet`melalui :class:`~django.db.models.Manager` pada kelas model anda.

source: A :class:`~django.db.models.query.QuerySet` represents a collection of objects from your database. It can have zero, one or many *filters*. Filters narrow down the query results based on the given parameters. In SQL terms, a :class:`~django.db.models.query.QuerySet` equates to a ``SELECT`` statement, and a filter is a limiting clause such as ``WHERE`` or ``LIMIT``.
id: Sebuah :class:`~django.db.models.query.QuerySet` mewakili sebuah kumpulan dari ibyek-obyek dari basisdata anda. itu dapat memiliki nol, satu atau banyak *penyaring*. Penyaring mempersempit hasil permintaan berdasarkan pada parameter yang diberikan. Dalam istilah SQL, :class:`~django.db.models.query.QuerySet`menyamakan pada pernyataan ``SELECT``, dan penyaring membatasi klausa seperti ``WHERE`` atau ``LIMIT``.

source: You get a :class:`~django.db.models.query.QuerySet` by using your model's :class:`~django.db.models.Manager`. Each model has at least one :class:`~django.db.models.Manager`, and it's called :attr:`~django.db.models.Model.objects` by default. Access it directly via the model class, like so::
id: Anda mendapatkan :class:`~django.db.models.query.QuerySet`dengan menggunakan :class:`~django.db.models.Manager` model anda. Setiap model mempunyai setidaknya satu :class:`~django.db.models.Manager`,dan itu memanggil :attr:`~django.db.models.Model.objects` secara awalan. Akses itu langsung melalui kelas model, seperti itu::

source: ``Managers`` are accessible only via model classes, rather than from model instances, to enforce a separation between "table-level" operations and "record-level" operations.
id: ``Managers`` dapat diakses hanya melalui kelas-kelas model, daripada dari instance model, untuk melaksanakan pemisahan diantara tindakan "tingkat-tabel" dan tindakan "tingkat-rekam".

source: The :class:`~django.db.models.Manager` is the main source of ``QuerySets`` for a model. For example, ``Blog.objects.all()`` returns a :class:`~django.db.models.query.QuerySet` that contains all ``Blog`` objects in the database.
id: :class:`~django.db.models.Manager` adalah sumber utama dari ``QuerySets`` untuk sebuah model. Sebagai contoh, ``Blog.objects.all()``mengembalikan :class:`~django.db.models.query.QuerySet`yang mengandung semua obyek ``Blog`` dalam basisdata.

source: Retrieving all objects
id: Mengambil semua obyek

source: The simplest way to retrieve objects from a table is to get all of them. To do this, use the :meth:`~django.db.models.query.QuerySet.all` method on a :class:`~django.db.models.Manager`::
id: Cara termudah untuk mengambil obyek dari sebuah tabel adalah mendapatkan semua dari mereka. Untuk melakukan ini, gunakan metode :meth:`~django.db.models.query.QuerySet.all` pada sebuah :class:`~django.db.models.Manager`::

source: The :meth:`~django.db.models.query.QuerySet.all` method returns a :class:`~django.db.models.query.QuerySet` of all the objects in the database.
id: Metode :meth:`~django.db.models.query.QuerySet.all` mengembalikan semua :class:`~django.db.models.query.QuerySet` dari semua obyek dalam basisdata.

source: Retrieving specific objects with filters
id: Mengambil obyek spesifik dengan menyaring

source: The :class:`~django.db.models.query.QuerySet` returned by :meth:`~django.db.models.query.QuerySet.all` describes all objects in the database table. Usually, though, you'll need to select only a subset of the complete set of objects.
id: :class:`~django.db.models.query.QuerySet` dibalikkan oleh :meth:`~django.db.models.query.QuerySet.all` menggambarkan semua obyek-obyek dalam tabel basisdata. Biasanya, meskipun, anda akan butuh memilih hanya sub kumpulan dari kumpulan lengkap dari obyek.

source: To create such a subset, you refine the initial :class:`~django.db.models.query.QuerySet`, adding filter conditions. The two most common ways to refine a :class:`~django.db.models.query.QuerySet` are:
id: Untuk membuat semacam sub kumpulan, anda menyaring :class:`~django.db.models.query.QuerySet` awalan, menambahkan kondisi penyaringan. Dua cara paling umum untuk menyaring :class:`~django.db.models.query.QuerySet`adalah:

source: Returns a new :class:`~django.db.models.query.QuerySet` containing objects that match the given lookup parameters.
id: Mengembalikan :class:`~django.db.models.query.QuerySet`baru mengandung obyek-obyek yang cocok dari parameter pencarian yang diberikan.

source: Returns a new :class:`~django.db.models.query.QuerySet` containing objects that do *not* match the given lookup parameters.
id: Mengembalikan :class:`~django.db.models.query.QuerySet`baru mengandung obyek-obyek yang *tidak* cocok dari parameter pencarian yang diberikan.

source: The lookup parameters (``**kwargs`` in the above function definitions) should be in the format described in `Field lookups`_ below.
id: Parameter pencarian (``**kwargs`` dalam penertian fungsi diatas) harus berupa dalam bentuk digambarkan dalam `Field lookups`_ dibawah.

source: For example, to get a :class:`~django.db.models.query.QuerySet` of blog entries from the year 2006, use :meth:`~django.db.models.query.QuerySet.filter` like so::
id: Sebagai contoh, untuk mendapatkan :class:`~django.db.models.query.QuerySet`dari masukan blog dari tahun 2006, gunakan :meth:`~django.db.models.query.QuerySet.filter`seperti itu::

source: With the default manager class, it is the same as::
id: Dengan kelas pengelola awalan, itu adalah sama seperti::

source: Chaining filters
id: Menambatkan penyaringan

source: The result of refining a :class:`~django.db.models.query.QuerySet` is itself a :class:`~django.db.models.query.QuerySet`, so it's possible to chain refinements together. For example::
id: Hasil dari pengilangan :class:`~django.db.models.query.QuerySet` adalah itu sendiri :class:`~django.db.models.query.QuerySet`,jadi itu mungkin menambatkan pengilangan bersama-sama. Sebagai contoh::

source: This takes the initial :class:`~django.db.models.query.QuerySet` of all entries in the database, adds a filter, then an exclusion, then another filter. The final result is a :class:`~django.db.models.query.QuerySet` containing all entries with a headline that starts with "What", that were published between January 30, 2005, and the current day.
id: Ini mengambil awal :class:`~django.db.models.query.QuerySet`dari semua masukan dalam basisdata, tambah sebuah penyaring, kemudian sebuah pengecualian, kemudian penyaring lain. Hasil akhir adalah sebuah :class:`~django.db.models.query.QuerySet`mengandung semua masukan dengan judul yang mulai dengan "What", yang diterbitkan diantara 30 Januari 2005, dan hari saat ini.

source: Filtered ``QuerySet``\s are unique
id: Disaring ``QuerySet`` adalah unik

source: Each time you refine a :class:`~django.db.models.query.QuerySet`, you get a brand-new :class:`~django.db.models.query.QuerySet` that is in no way bound to the previous :class:`~django.db.models.query.QuerySet`. Each refinement creates a separate and distinct :class:`~django.db.models.query.QuerySet` that can be stored, used and reused.
id: Setiap kali anda menyaring sebuah :class:`~django.db.models.query.QuerySet`, anda mendapatkan :class:`~django.db.models.query.QuerySet` merek-baru yaitu tidak ada cara mengikat ke :class:`~django.db.models.query.QuerySet` sebelumnya. Setiap penyaringan membuat :class:`~django.db.models.query.QuerySet` terpisah dan berbeda yang dapat disimpan, digunakan dan digunakan kembali.

source: These three ``QuerySets`` are separate. The first is a base :class:`~django.db.models.query.QuerySet` containing all entries that contain a headline starting with "What". The second is a subset of the first, with an additional criteria that excludes records whose ``pub_date`` is today or in the future. The third is a subset of the first, with an additional criteria that selects only the records whose ``pub_date`` is today or in the future. The initial :class:`~django.db.models.query.QuerySet` (``q1``) is unaffected by the refinement process.
id: Ketiga ``QuerySets`` ini terpisah. Pertama adalah dasar :class:`~django.db.models.query.QuerySet`mengandung semua masukan yang mengandung judul dimulai dengan "What". kedua adalah sub kumpulan dari pertama, dengan sebuah tambahan kriteria yang tidak menyertakan rekaman yang ``pub_date`` adalah hari ini atau di masa depan. Ketiga adalah sub kumpulan dari pertama, dengan tambahan kriteria yang hanya memilih rekaman yang ``pub_date`` adalah hari ini atau di masa depan. Awalan :class:`~django.db.models.query.QuerySet` (``q1``)tidak terpengaruh dengan pengolahan penyaringan.

source: ``QuerySet``\s are lazy
id: ``QuerySet`` adalah lazy
