Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Django's built-in class-based views provide a lot of functionality, but some of it you may want to use separately. For instance, you may want to write a view that renders a template to make the HTTP response, but you can't use :class:`~django.views.generic.base.TemplateView`; perhaps you need to render a template only on ``POST``, with ``GET`` doing something else entirely. While you could use :class:`~django.template.response.TemplateResponse` directly, this will likely result in duplicate code.
id: Tampilan berdasarkan-kelas siap-pakai Django menyediakan banyak fungsionalitas, tetapi beberapa dari itu anda mungkin ingin menggunakannya terpisah. Sebagai contoh, anda mungkin ingin menulis sebuah tampilan yang membangun cetakan untuk membuat tanggapan HTTP, tetapi anda tidak dapat menggunakan :class:`~django.views.generic.base.TemplateView`; mungkin anda butuh membangun cetakan hanya pada ``POST``, dengan ``GET`` melakukan sesuatu lain seluruhnya. Selagi anda dapat menggunakan :class:`~django.template.response.TemplateResponse` langsung, ini akan kemungkinan hasil di kode ganda.

source: For this reason, Django also provides a number of mixins that provide more discrete functionality. Template rendering, for instance, is encapsulated in the :class:`~django.views.generic.base.TemplateResponseMixin`. The Django reference documentation contains :doc:`full documentation of all the mixins</ref/class-based-views/mixins>`.
id: Untuk alasan ini, Django juga menyediakan sejumlah mixin yang menyediakan fungsionalitas diskrit lebih. Pembangunan cetakan, sebagai contoh, dienkapsulasi di :class:`~django.views.generic.base.TemplateResponseMixin`. Dokumentasi acuan Django mengandung :doc:`full documentation of all the mixins</ref/class-based-views/mixins>`.

source: Context and template responses
id: Tanggapan koteks dan cetakan

source: Two central mixins are provided that help in providing a consistent interface to working with templates in class-based views.
id: Dua mixin pusat disediakan yang membantu dalam antarmuka tetap untuk bekerja dengan cetakan di tampilan berdasarkan-kelas.

source: Every built in view which returns a :class:`~django.template.response.TemplateResponse` will call the :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` method that ``TemplateResponseMixin`` provides. Most of the time this will be called for you (for instance, it is called by the ``get()`` method implemented by both :class:`~django.views.generic.base.TemplateView` and :class:`~django.views.generic.detail.DetailView`); similarly, it's unlikely that you'll need to override it, although if you want your response to return something not rendered via a Django template then you'll want to do it. For an example of this, see the :ref:`JSONResponseMixin example <jsonresponsemixin-example>`.
id: Setiap tampilan siap pakai yang mengembalikan :class:`~django.template.response.TemplateResponse` akan memanggil metode :meth:`~django.views.generic.base.TemplateResponseMixin.render_to_response()` yang ``TemplateResponseMixin`` sediakan. Kebanyakan dari waktu ini akan dipanggil untuk anda (sebagai contoh, itu dipanggil oleh metode ``get()`` diterapkan oleh kedua :class:`~django.views.generic.base.TemplateView` and :class:`~django.views.generic.detail.DetailView`); demikian pula, itu tidak mungkin anda butuh menimpa itu, meskipun jika anda ingin tanggapan anda mengembalikan sesuatu tidak dibangun melalui cetakan Django kemudian anda akan ingin melakukan itu. Sebagai contoh dari ini, lihat :ref:`JSONResponseMixin example <jsonresponsemixin-example>`.

source: ``render_to_response()`` itself calls :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names`, which by default will just look up :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` on the class-based view; two other mixins (:class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` and :class:`~django.views.generic.list.MultipleObjectTemplateResponseMixin`) override this to provide more flexible defaults when dealing with actual objects.
id: ``render_to_response()`` itu sendiri memanggil :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names`, yang secara awalan akan hanya mencari :attr:`~django.views.generic.base.TemplateResponseMixin.template_name` pada tampilan berdasarkan-kelas; dua mixin lainnya (:class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` dan :class:`~django.views.generic.list.MultipleObjectTemplateResponseMixin`) menimpa ini untuk menyediakan awalan lebih elastis ketika berurusan dengan obyek sebenarnya.

source: Every built in view which needs context data, such as for rendering a template (including ``TemplateResponseMixin`` above), should call :meth:`~django.views.generic.base.ContextMixin.get_context_data()` passing any data they want to ensure is in there as keyword arguments. ``get_context_data()`` returns a dictionary; in ``ContextMixin`` it simply returns its keyword arguments, but it is common to override this to add more members to the dictionary. You can also use the :attr:`~django.views.generic.base.ContextMixin.extra_context` attribute.
id: Setiap tampilan siap pakai uang butuh data konteks, seperti membangun sebuah cetakan (termasuk ``TemplateResponseMixin``diatas), harus memanggil :meth:`~django.views.generic.base.ContextMixin.get_context_data()` melewatkan data apapun mereka ingin pastikan ada disana sebagai argumen kata kunci. ``get_context_data()`` mengembalikan sebuah dictionary; di ``ContextMixin`` itu cukup mengembalikan argumen kata kunci nya, tetapi itu adalah umum untuk menimpa ini untuk menambahkan anggota lagi ke dictionary. Anda dapat juga menggunakan atribut :attr:`~django.views.generic.base.ContextMixin.extra_context`.

source: Building up Django's generic class-based views
id: Membangun tampilan berdasarkan-kelas umum Django

source: Let's look at how two of Django's generic class-based views are built out of mixins providing discrete functionality. We'll consider :class:`~django.views.generic.detail.DetailView`, which renders a "detail" view of an object, and :class:`~django.views.generic.list.ListView`, which will render a list of objects, typically from a queryset, and optionally paginate them. This will introduce us to four mixins which between them provide useful functionality when working with either a single Django object, or multiple objects.
id: Mari kita lihat bagaimana tampilan berdasarkan-kelas umum Django adalah membangun dari mixin disediakan fungsionalitas diskrit. Kami akan mempertimbangkan :class:`~django.views.generic.detail.DetailView`, yang membangun tampilan "detail" dari sebuah obyek, dan :class:`~django.views.generic.list.ListView`, yang akan membangun sebuah daftar dari obyek, khususnya dari queryset, dan pilihannya memberi nomor mereka. Ini akan memperkenalkan kita untuk empat mixin yang diantara mereka menyediakan fungsionalitas berguna dengan antara obyek Django tunggal, atau banyak obyek.

source: There are also mixins involved in the generic edit views (:class:`~django.views.generic.edit.FormView`, and the model-specific views :class:`~django.views.generic.edit.CreateView`, :class:`~django.views.generic.edit.UpdateView` and :class:`~django.views.generic.edit.DeleteView`), and in the date-based generic views. These are covered in the :doc:`mixin reference documentation</ref/class-based-views/mixins>`.
id: Ada juga mixin terlibat di tampilan sunting umum (:class:`~django.views.generic.edit.FormView`, dan tampilan model-tertentu :class:`~django.views.generic.edit.CreateView`, :class:`~django.views.generic.edit.UpdateView` dan :class:`~django.views.generic.edit.DeleteView`), dan di tampilan umum berdasarkan-tanggal. Ini dicakupi di :doc:`mixin reference documentation</ref/class-based-views/mixins>`.

source: ``DetailView``: working with a single Django object
id: ``DetailView``: bekerja dengan obyek tunggal Django

source: To show the detail of an object, we basically need to do two things: we need to look up the object and then we need to make a :class:`~django.template.response.TemplateResponse` with a suitable template, and that object as context.
id: Untuk menunjukkan rincian dari sebuah obyek, kami dasarnya butuh melakukan dua hal: kami butuh mencari obyek dan kemudian kami butuh membuat :class:`~django.template.response.TemplateResponse` dengan cetakan yang cocok, dan obyek itu sebagai konteks.

source: To get the object, :class:`~django.views.generic.detail.DetailView` relies on :class:`~django.views.generic.detail.SingleObjectMixin`, which provides a :meth:`~django.views.generic.detail.SingleObjectMixin.get_object` method that figures out the object based on the URL of the request (it looks for ``pk`` and ``slug`` keyword arguments as declared in the URLConf, and looks the object up either from the :attr:`~django.views.generic.detail.SingleObjectMixin.model` attribute on the view, or the :attr:`~django.views.generic.detail.SingleObjectMixin.queryset` attribute if that's provided). ``SingleObjectMixin`` also overrides :meth:`~django.views.generic.base.ContextMixin.get_context_data()`, which is used across all Django's built in class-based views to supply context data for template renders.
id: Untuk mendapatkan obyek, :class:`~django.views.generic.detail.DetailView` bergantung pada :class:`~django.views.generic.detail.SingleObjectMixin`, yang menyediakan sebuah metode :meth:`~django.views.generic.detail.SingleObjectMixin.get_object` yang mencari tahu berdasarkan obyek pada URL dari permintaan (itu sepertinya untuk argumen kata kunci ``pk`` dan ``slug`` seperti dinyatakan di URLConf, dan mencari obyek antara dari atribut :attr:`~django.views.generic.detail.SingleObjectMixin.model` pada tampilan, atau atribut :attr:`~django.views.generic.detail.SingleObjectMixin.queryset` jika itu disediakan). ``SingleObjectMixin`` juga menimpa :meth:`~django.views.generic.base.ContextMixin.get_context_data()`, yang digunakan terhadap semua tampilan siap-pakai Django untuk memasok data konteks untuk membangun cetakan.

source: To then make a :class:`~django.template.response.TemplateResponse`, :class:`DetailView` uses :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin`, which extends :class:`~django.views.generic.base.TemplateResponseMixin`, overriding :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()` as discussed above. It actually provides a fairly sophisticated set of options, but the main one that most people are going to use is ``<app_label>/<model_name>_detail.html``. The ``_detail`` part can be changed by setting :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` on a subclass to something else. (For instance, the :doc:`generic edit views<generic-editing>` use ``_form`` for create and update views, and ``_confirm_delete`` for delete views.)
id: Untuk kemudian sebuah :class:`~django.template.response.TemplateResponse`, :class:`DetailView` menggunakan :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin`, yang memperpanjang :class:`~django.views.generic.base.TemplateResponseMixin`, menimpa :meth:`~django.views.generic.base.TemplateResponseMixin.get_template_names()` seperti diobrolkan diatas. Itu sebenarnya menyediakan kumpulan cukup canggih pilihan, tetapi satu utama yang paling orang akan gunakan adalah ``<app_label>/<model_name>_detail.html``. Bagian ``_detail`` dapat dirubah dengan mengatur :attr:`~django.views.generic.detail.SingleObjectTemplateResponseMixin.template_name_suffix` pada subkelas atau sesuatu lain. (Sebagai contoh, :doc:`generic edit views<generic-editing>` menggunakan ``_form`` untuk membuat dan memperbaharui tampilan, dan ``_confirm_delete`` untuk tampilan menghapus.)

source: ``ListView``: working with many Django objects
id: ``ListView``: bekerja dengan banyak obyek Django

source: Lists of objects follow roughly the same pattern: we need a (possibly paginated) list of objects, typically a :class:`~django.db.models.query.QuerySet`, and then we need to make a :class:`~django.template.response.TemplateResponse` with a suitable template using that list of objects.
id: Daftar dari obyek mengikuti kurang lebih pola sama: kami butuh sebuah (kemungkinan diberikan nomor) daftar obyek, khususnya sebuah :class:`~django.db.models.query.QuerySet`, dan kemudian kami butuh membuat sebuah :class:`~django.template.response.TemplateResponse` dengan cetakan cocok menggunakan daftar itu dari obyek.

source: To get the objects, :class:`~django.views.generic.list.ListView` uses :class:`~django.views.generic.list.MultipleObjectMixin`, which provides both :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` and :meth:`~django.views.generic.list.MultipleObjectMixin.paginate_queryset`. Unlike with :class:`~django.views.generic.detail.SingleObjectMixin`, there's no need to key off parts of the URL to figure out the queryset to work with, so the default just uses the :attr:`~django.views.generic.list.MultipleObjectMixin.queryset` or :attr:`~django.views.generic.list.MultipleObjectMixin.model` attribute on the view class. A common reason to override :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` here would be to dynamically vary the objects, such as depending on the current user or to exclude posts in the future for a blog.
id: Untuk mendapatkan obyek, :class:`~django.views.generic.list.ListView` menggunakan :class:`~django.views.generic.list.MultipleObjectMixin`, yang menyediakan kedua :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` dan :meth:`~django.views.generic.list.MultipleObjectMixin.paginate_queryset`. Tidak seperti dengan :class:`~django.views.generic.detail.SingleObjectMixin`, tidak perlu key off bagian dari URL untuk mencari tahu queryset bekerja, jadi awalan hanya menggunakan atribut :attr:`~django.views.generic.list.MultipleObjectMixin.queryset` atau :attr:`~django.views.generic.list.MultipleObjectMixin.model` pada kelas tampilan. Sebuah alasan umum untun menimpa :meth:`~django.views.generic.list.MultipleObjectMixin.get_queryset` disini akan menjadi secara dinamis beragam obyek, seperti bergantung pada pengguna saat ini atau mengeluarkan penempatan di masa depan untuk sebuah blog.

source: :class:`~django.views.generic.list.MultipleObjectMixin` also overrides :meth:`~django.views.generic.base.ContextMixin.get_context_data()` to include appropriate context variables for pagination (providing dummies if pagination is disabled). It relies on ``object_list`` being passed in as a keyword argument, which :class:`ListView` arranges for it.
id: :class:`~django.views.generic.list.MultipleObjectMixin` juga menimpa :meth:`~django.views.generic.base.ContextMixin.get_context_data()` untuk menyertakan variabel konteks sesuai untuk penomoran halaman (menyediakan contoh jika penomoran halaman ditiadakan). Itu bergantung pada 11object_list`` dilewatkan di sebuah argumen kata kunci, yang :class:`ListView` mengatur untuk itu.

source: To make a :class:`~django.template.response.TemplateResponse`, :class:`ListView` then uses :class:`~django.views.generic.list.MultipleObjectTemplateResponseMixin`; as with :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` above, this overrides ``get_template_names()`` to provide :meth:`a range of options <django.views.generic.list.MultipleObjectTemplateResponseMixin>`, with the most commonly-used being ``<app_label>/<model_name>_list.html``, with the ``_list`` part again being taken from the :attr:`~django.views.generic.list.MultipleObjectTemplateResponseMixin.template_name_suffix` attribute. (The date based generic views use suffixes such as ``_archive``, ``_archive_year`` and so on to use different templates for the various specialized date-based list views.)
id: Untuk membuat sebuah :class:`~django.template.response.TemplateResponse`, :class:`ListView` kemudian menggunakan :class:`~django.views.generic.list.MultipleObjectTemplateResponseMixin`; seperti :class:`~django.views.generic.detail.SingleObjectTemplateResponseMixin` diatas, ini menimpa ``get_template_names()`` untuk menyediakan :meth:`a range of options <django.views.generic.list.MultipleObjectTemplateResponseMixin>`, yang paling digunakan-umum berwujud ``<app_label>/<model_name>_list.html``, dengan bagian ``_list`` kembali diambil dari atribut :attr:`~django.views.generic.list.MultipleObjectTemplateResponseMixin.template_name_suffix`. (Tampilan umum berdasarkan tanggal menggunakan akhiran seperti ``_archive``, ``_archive_year`` dan sebagainya untuk menggunakan cetakan berbeda untuk beragam tampilan daftar berdasarkan-tanggal khusus.)

source: Using Django's class-based view mixins
id: Menggunakan mixin tampilan berdasarkan-kelas Django

source: Now we've seen how Django's generic class-based views use the provided mixins, let's look at other ways we can combine them. Of course we're still going to be combining them with either built-in class-based views, or other generic class-based views, but there are a range of rarer problems you can solve than are provided for by Django out of the box.
id: Sekarang kami telah melihat bagaimana tampilan berdasarkan-kelas umum Django menggunakan mixin disediakan, mari kita melihat pada cara lain kami dapat padukan mereka. Tentu saja kami masih akan memadukan mereka dengan tampulan berdasarkan-kelas siap-pakai, atau tampilan berdasarkan-kelas umum, tetapi ada jangkauan dari masalah jarang anda dapat selesaikan daripada disediakan untuk Django keluar dari kotak.

source: Not all mixins can be used together, and not all generic class based views can be used with all other mixins. Here we present a few examples that do work; if you want to bring together other functionality then you'll have to consider interactions between attributes and methods that overlap between the different classes you're using, and how `method resolution order`_ will affect which versions of the methods will be called in what order.
id: Tidak semua mixin dapat digunakan bersama-sama, dan tidak semua tampilan berdasarkan kelas umum dapat digunakan dengan semua mixin lain. Disini kami menghadirkan beberapa contoh yang melakukan pekerjaan; jika anda ingin membawa bersama-sama fungsionalitas lain kemudian anda akan harus mempertimbangkan interaksi diantara atribut dan metode yang tumpang tindih diantara kelas-kelas berbeda anda sedang gunakan, dan bagaimana `method resolution order`_ akan mempengaruhi versi mana dari metode akan dipanggil di urutan apa.

source: The reference documentation for Django's :doc:`class-based views</ref/class-based-views/index>` and :doc:`class-based view mixins</ref/class-based-views/mixins>` will help you in understanding which attributes and methods are likely to cause conflict between different classes and mixins.
id: Acuan dokumentasi untuk :doc:`class-based views</ref/class-based-views/index>` dan :doc:`class-based view mixins</ref/class-based-views/mixins>` Django akan membantu anda dalam memahami atribut dan metode mana mungkin menyebabkan pertentangan diantara kelas dan mixin berbeda.

source: If in doubt, it's often better to back off and base your work on :class:`View` or :class:`TemplateView`, perhaps with :class:`~django.views.generic.detail.SingleObjectMixin` and :class:`~django.views.generic.list.MultipleObjectMixin`. Although you will probably end up writing more code, it is more likely to be clearly understandable to someone else coming to it later, and with fewer interactions to worry about you will save yourself some thinking. (Of course, you can always dip into Django's implementation of the generic class-based views for inspiration on how to tackle problems.)
id: Jika ragu, itu sering lebih baik mundur dan dasarkan pekerjaan anda pada :class:`View` atau :class:`TemplateView`, mungkin dengan :class:`~django.views.generic.detail.SingleObjectMixin` dan :class:`~django.views.generic.list.MultipleObjectMixin`. Meskipun anda akan mungkin mengakhiri menulis kode lebih, itu lebih mungkin jelas dapat dimengerti pada seseorang lain datang ke itu kemudian, dan dengan sedikit interaksi untuk khawatir tentang anda akan menyimpan beberapa pemikiran anda sendiri. (Tentu saja, anda dapat selalu mempelajari kedalam penerapan Django dari tampilan berdasarkan-kelas umum untuk ilham pada bagaimana memecahkan masalah.)

source: Using ``SingleObjectMixin`` with View
id: Menggunakan ``SingleObjectMixin`` dengan View

source: If we want to write a simple class-based view that responds only to ``POST``, we'll subclass :class:`~django.views.generic.base.View` and write a ``post()`` method in the subclass. However if we want our processing to work on a particular object, identified from the URL, we'll want the functionality provided by :class:`~django.views.generic.detail.SingleObjectMixin`.
id: Jika kami ingin menulis tampilan berdasarkan-kelas sederhana yang menanggapi hanya pada ``POST``, kami akan mensubkelaskan :class:`~django.views.generic.base.View` dan menulis sebuah metode ``post()`` di subkelas. Bagaimanapun jika kami ingin pengolahan kami bekerja pada obyek tertentu, cirikan dari URL, kami akan ingin fungsionalitas disediakan oleh :class:`~django.views.generic.detail.SingleObjectMixin`.

source: We'll demonstrate this with the ``Author`` model we used in the :doc:`generic class-based views introduction<generic-display>`.
id: Kami akan mempertunjukkan ini dengan model ``Author`` kami gunakan di :doc:`generic class-based views introduction<generic-display>`.

source: In practice you'd probably want to record the interest in a key-value store rather than in a relational database, so we've left that bit out. The only bit of the view that needs to worry about using :class:`~django.views.generic.detail.SingleObjectMixin` is where we want to look up the author we're interested in, which it just does with a simple call to ``self.get_object()``. Everything else is taken care of for us by the mixin.
id: Dalam praktiknya anda mungkin ingin merekam ketertarikan dalam penyimpanan kunci-nilai daripada ddi basisdata hubungan, jadi kami telah meninggalkan sedikit. Hanya sedikit dari tampilan yang butuh dikhawatirkan tentang menggunakan :class:`~django.views.generic.detail.SingleObjectMixin` adalah dimana kami ingin mencari penulis kami tertarik, yang itu hanya dilakukan dengan panggulan sederhana pada ``self.get_object()``. Yang lainnya diurus untuk kami oleh mixin.

source: We can hook this into our URLs easily enough:
id: Kami dapat menghubungkan kedalam URL kami dengan cukup mudah:

source: Note the ``pk`` named group, which :meth:`~django.views.generic.detail.SingleObjectMixin.get_object` uses to look up the ``Author`` instance. You could also use a slug, or any of the other features of :class:`~django.views.generic.detail.SingleObjectMixin`.
id: Catat kelompok bernama ``pk``, yang :meth:`~django.views.generic.detail.SingleObjectMixin.get_object` menggunakan untuk mencari instance ``Author``. Anda dapat juga menggunakan sebuah keong, atau apapun dari fitur-fitur lain dari :class:`~django.views.generic.detail.SingleObjectMixin`.

source: Using ``SingleObjectMixin`` with ``ListView``
id: Menggunakan ``SingleObjectMixin`` dengan ``ListView``

source: :class:`~django.views.generic.list.ListView` provides built-in pagination, but you might want to paginate a list of objects that are all linked (by a foreign key) to another object. In our publishing example, you might want to paginate through all the books by a particular publisher.
id: :class:`~django.views.generic.list.ListView` menyediakan penomoran siap-pakai, tetapi anda mungkin ingin memberi nomor daftar dari obyek yang semua terkait (oleh foreign key) ke obyek lain. Di contoh penerbitan kami, anda mungkin ingin memberi nomor melalui semua buku-buku oleh penerbit tertentu.
