Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: creates a savepoint when entering an inner ``atomic`` block;
id: membuat titik simpan ketika memasukkan blok ``atomic`` sebelah dalam;

source: releases or rolls back to the savepoint when exiting an inner block;
id: melepaskan atau digulung kembali ke titik simpan ketika keluar blok paling dalam;

source: commits or rolls back the transaction when exiting the outermost block.
id: menyerahkan atau gulung kembali transaksi ketika keluar blok paling luar

source: You can disable the creation of savepoints for inner blocks by setting the ``savepoint`` argument to ``False``. If an exception occurs, Django will perform the rollback when exiting the first parent block with a savepoint if there is one, and the outermost block otherwise. Atomicity is still guaranteed by the outer transaction. This option should only be used if the overhead of savepoints is noticeable. It has the drawback of breaking the error handling described above.
id: Anda dapat meniadakan pembuatan dari titik simpan untuk blok sebelah dalam dengan mengatur argumen ``savepoint`` ke ``False``. Jika sebuah pengecualian muncul, Django akan melakukan gulunh kembali ketika keluar blok induk pertama dengan sebuah titik simpan jika ada, dan blok paling luar jika tidak. Atomicity masih dijamin oleh transaksi paling luar. Pilihan ini harus hanya digunakan jika kelebihan dari titik simpan dapat dilihat. Itu mempunyai kekurangan dari memecahkan penanganan kesalahan yang digambarkan diatas.

source: You may use ``atomic`` when autocommit is turned off. It will only use savepoints, even for the outermost block.
id: Anda dapat menggunakan ``atomic`` ketika penyerahan otomatis dimatikan. Itu akan hanya menggunakan titik simpan, bahkan untuk blok paling luar.

source: Performance considerations
id: Pertimbangan penampilan

source: Open transactions have a performance cost for your database server. To minimize this overhead, keep your transactions as short as possible. This is especially important if you're using :func:`atomic` in long-running processes, outside of Django's request / response cycle.
id: Transaksi-transaksi terbuka mempunyai biaya penampilan untuk peladen basisdata anda. Untuk meminimalkan overhead ini, jaga transaksi-transaksi anda sependek mungkin. Ini adalah khususnya penting jika anda sedang menggunakan :func:`atomic`dalamn pengolahan berjalan-panjang, diluar permintaan Django / siklus tanggapan.

source: Autocommit
id: Penyerahan otomatis

source: Why Django uses autocommit
id: Kenapa Django menggunakan penyerahan otomatis

source: In the SQL standards, each SQL query starts a transaction, unless one is already active. Such transactions must then be explicitly committed or rolled back.
id: Dalam standar SQL, setiap permintaan SQL memulai sebuah transaksi, meskipun satu sudah aktif. Transaksi tersebut harus secara eksplisit diserahkan dan digulung kembali.

source: This isn't always convenient for application developers. To alleviate this problem, most databases provide an autocommit mode. When autocommit is turned on and no transaction is active, each SQL query gets wrapped in its own transaction. In other words, not only does each such query start a transaction, but the transaction also gets automatically committed or rolled back, depending on whether the query succeeded.
id: Ini tidak selalu mudah untuk pengembang aplikasi. Untuk meredakan masalah ini, kebanyakan basisdata menyediakan sebuah suasana penyerahan otomatis. Ketika penyerahan otomatis dinayalan dan tidak ada transaksi aktif, setiap permintaan SQL dibungkus dalam transaksinya sendiri. Dengan kata lain, bukan hanya melakukan setiap permintaan tersebut mulai sebuah transaksi, tetapi transaksi juga mendapatkan otomatis diserahkan atau digulung kembali, tergandunt pada apakah permintaan berhasil.

source: :pep:`249`, the Python Database API Specification v2.0, requires autocommit to be initially turned off. Django overrides this default and turns autocommit on.
id: :pep:`249`, Spesifikasi API Basisdata Python v2.0, membutuhkan penjalanan otomatis untuk diawalkan dimatikan. Django menimpa awalan ini dan menyalakan penjalanan otomatis.

source: To avoid this, you can :ref:`deactivate the transaction management <deactivate-transaction-management>`, but it isn't recommended.
id: Untuk menghindari ini, anda dapat :ref:`menonaktifkan pengelolaan transaksi <deactivate-transaction-management>`, tetapi itu sangat tidak dianjurkan.

source: Deactivating transaction management
id: Menonaktifkan pengelolaan transaksi

source: You can totally disable Django's transaction management for a given database by setting :setting:`AUTOCOMMIT <DATABASE-AUTOCOMMIT>` to ``False`` in its configuration. If you do this, Django won't enable autocommit, and won't perform any commits. You'll get the regular behavior of the underlying database library.
id: Anda dapat sama sekali meniadakan pengelolaan transaksi Django untuk basis data diberikan dengan mengatur :setting:`AUTOCOMMIT 1` menjadi ``False``dalam konfigurasinya. Jika anda melakukan ini, Django tidak akan mengadakan autocommit, dan tidak akan melakukan penjalanan apapun. Anda akan mendapatkan perilaku biasa dari pustaka basisdata pokok.

source: This requires you to commit explicitly every transaction, even those started by Django or by third-party libraries. Thus, this is best used in situations where you want to run your own transaction-controlling middleware or do something really strange.
id: Ini membutuhkan anda untuk menyerahkan secara eksplisit setiap transaksi, bahkan yang dimulai oleh Django atau oleh pustaka pihak ketiga. Jadi, ini adalah penggunaan terbaik dalam keadaan dimana anda ingin menjalankan middleware pengendalian transaksi milik anda atau melakukan sesuatu yang sangat aneh.

source: Performing actions after commit
id: Melakukan tindakan setelah penyerahan

source: Sometimes you need to perform an action related to the current database transaction, but only if the transaction successfully commits. Examples might include a `Celery`_ task, an email notification, or a cache invalidation.
id: Terkadang anda butuh melakukan sebuah tindakan terkait pada transaksi basisdata saat ini, tetapi hanya jika transaksi berhasil diserahkan. Contoh mungkin termasuk tugas `Celery`_, sebuah pemberitahuan surel, atau penghapusan tembolok

source: Django provides the :func:`on_commit` function to register callback functions that should be executed after a transaction is successfully committed:
id: Django menyediakan fungsi :func:`on_commit` untuk mendaftarkan fungsi panggil kembali yang harusnya dijalankan setelah transaksi berhasil diserahkan:

source: Pass any function (that takes no arguments) to :func:`on_commit`::
id: Lewati fungsi apapun (yang tidak mengambil argumen) ke :func:`on_commit`::

source: You can also wrap your function in a lambda::
id: Anda dapat juga membungkus fungsi anda dalam lambda::

source: The function you pass in will be called immediately after a hypothetical database write made where ``on_commit()`` is called would be successfully committed.
id: Fungsi anda lewati akan dipanggil segera setelah hipotetis penulisan basisdata dibuat dimana ``on_commit()`` dipanggil akan berhasil diserahkan.

source: If you call ``on_commit()`` while there isn't an active transaction, the callback will be executed immediately.
id: Jika anda memanggil ``on_commit()`` selagi tidak ada sebiah transaksi aktif, panggil kembali akan dijalankan segera.

source: If that hypothetical database write is instead rolled back (typically when an unhandled exception is raised in an :func:`atomic` block), your function will be discarded and never called.
id: Jika hipotetis penulisan basisdata itu bukannya digulung kembali (khususnya ketika sebuah pengecualian tidak tertangani dimunculkan dalam sebuah blok :func:`atomic`), fungsi anda akan disingkirkan dan tidak pernah dipanggil.

source: Savepoints
id: Savepoint

source: Savepoints (i.e. nested :func:`atomic` blocks) are handled correctly. That is, an :func:`on_commit` callable registered after a savepoint (in a nested :func:`atomic` block) will be called after the outer transaction is committed, but not if a rollback to that savepoint or any previous savepoint occurred during the transaction::
id: Titik simpan (yaitu blok :func:`atomic` bersarang) ditangani dengan benar. Yaitu, sebuah :func:`on_commit` callable terdaftar setelah sebuah titik simpan (dalam blok :func:`atomic` bersarang) akan dipanggil setelah transaksi paling luar diserahkan, tetapi tidak jika disimpan kembali ke titik simpan tersebut atau titik simpan sebelumnya yang muncul selama transaksi::

source: On the other hand, when a savepoint is rolled back (due to an exception being raised), the inner callable will not be called::
id: Pada sisi lain, ketika sebuah titik simpan disimpan kembali (karena sebuah pengecualian telah dimunculkan), sebe;ah dalam dapat dipanggil tidak akan dipanggil::

source: Order of execution
id: Urutan pelaksanaan

source: Exception handling
id: Penanganan pengecualian

source: Timing of execution
id: Waktu pelaksanaan

source: Your callbacks are executed *after* a successful commit, so a failure in a callback will not cause the transaction to roll back. They are executed conditionally upon the success of the transaction, but they are not *part* of the transaction. For the intended use cases (mail notifications, Celery tasks, etc.), this should be fine. If it's not (if your follow-up action is so critical that its failure should mean the failure of the transaction itself), then you don't want to use the :func:`on_commit` hook. Instead, you may want `two-phase commit`_ such as the `psycopg Two-Phase Commit protocol support`_ and the `optional Two-Phase Commit Extensions in the Python DB-API specification`_.
id: Gulungan kembali anda dijalankan *setelah* penyerahan berhasil, jadi sebuah kegagalan dalam gulung kembali tidak akan menyebabkan transaksi di gulung kembali. Mereka dijalankan kondisional atas transaksi berhasil, tetapi mereka bukan *bagian* dari transaksi. Untuk penggunaan kasus dimaksud (pemberitahuan surat, tugas Celery, dll.), ini harus baik-baik saja. Jika tidak (jika tindakan mengikuti anda juga gawat dimana kegagalan itu harus berarti kegagalan dari transaksi itu sendiri), lalu anda tidak ingin menggunakan hubungan :func:`on_commit`. Sebagai gantinya, anda ingin `two-phase commit`_ seperti `psycopg Two-Phase Commit protocol support`_ dan `optional Two-Phase Commit Extensions in the Python DB-API specification`_.

source: Callbacks are not run until autocommit is restored on the connection following the commit (because otherwise any queries done in a callback would open an implicit transaction, preventing the connection from going back into autocommit mode).
id: Callback tidak berjalan sampai perbaikan otomatis dipulihkan pada hubungan perbaikan berikut (karena sebaliknya apapun permintaan selesai dalam sebuah callback akan membuka sebuah transaksi tersirat, mencegah hubungan dari kembali kedalam suasana perbaikan otomatis).

source: When in autocommit mode and outside of an :func:`atomic` block, the function will run immediately, not on commit.
id: Ketika dalam suasana penjalan otomatis dan diluar dari blok :func:`atomic`, fungsi akan berjalan segera tidak pada penjalanan.

source: Use in tests
id: Digunakan dalam percobaan

source: Django's :class:`~django.test.TestCase` class wraps each test in a transaction and rolls back that transaction after each test, in order to provide test isolation. This means that no transaction is ever actually committed, thus your :func:`on_commit` callbacks will never be run. If you need to test the results of an :func:`on_commit` callback, use a :class:`~django.test.TransactionTestCase` instead.
id: Kelas :class:`~django.test.TestCase` Django membungkus setiap percobaan dalam sebuah transaksi dan memutar kembali transaksi itu setelah setiap pengujian, agar menyediakan pemisahan pengujian. Ini berarti bahwa tidak ada transaksi sebenarnya dilakukan, dengan demikian callback :func:`on_commit` tidak pernah dijalankan. Jika anda butuh menguji hasil dari sebuah callback :func:`on_commit`, gunakan :class:`~django.test.TransactionTestCase` sebagai gantinya.

source: For instance, if your database connection is dropped because your process was killed without a chance to shut down gracefully, your rollback hook will never run.
id: Sebagai contoh, jika hubungan basisdata anda jatuh karena pengolahan anda mati tanpa kesempatan dimatikan dengan anggun, hubungan memutar kembali anda tidak pernah berjalan,

source: The solution is simple: instead of doing something during the atomic block (transaction) and then undoing it if the transaction fails, use :func:`on_commit` to delay doing it in the first place until after the transaction succeeds. It's a lot easier to undo something you never did in the first place!
id: Pemecahannya adalah mudah: daripada melakukan sesuatu selama blok atomic (transaksi) dan kemudian melepaskan itu jika transaksi gagal, gunakan :func:`on_commit` untuk menunda melakukan itu dalam tempat pertama sampai setelah semua transaksi berhasil. Itu lebih mudah melepaskan sesuatu anda tidak pernah lakukan di tempat pertama!

source: Low-level APIs
id: API tingkat-rendah

source: Always prefer :func:`atomic` if possible at all. It accounts for the idiosyncrasies of each database and prevents invalid operations.
id: Selalu memilih :func:`atomic` jika memungkan sama sekali. Itu menghitung untuk keanehan dari setiap basisdata dan mecegah tindakan-tindakan tidak sah.

source: The low level APIs are only useful if you're implementing your own transaction management.
id: API tingkat rendah hanya berguna jika anda sedang menerapkan pengelolaan transaksi anda sendiri.

source: Django provides a straightforward API in the :mod:`django.db.transaction` module to manage the autocommit state of each database connection.
id: Django menyediakan API mudah dalam modul :mod:`django.db.transaction` untuk mengelola keadaan penjalan otomatis dari setiap hubungan basisdata.

source: These functions take a ``using`` argument which should be the name of a database. If it isn't provided, Django uses the ``"default"`` database.
id: Fungsi-fungsi ini mengambil sebuah argumen ``using`` yang harus berupa nama dari basisdata. Jika itu tidak disediakan, Django menggunakan basisdata ``"default"``.

source: Autocommit is initially turned on. If you turn it off, it's your responsibility to restore it.
id: Autocommit awalannya dinyalakan. Jika anda mematikan itu, itu adalah tanggungjawab anda menyimpan itu kembali.

source: Once you turn autocommit off, you get the default behavior of your database adapter, and Django won't help you. Although that behavior is specified in :pep:`249`, implementations of adapters aren't always consistent with one another. Review the documentation of the adapter you're using carefully.
id: Sekali anda mematikan autocommit, anda mendapatkan perilaku awalan dari penyadur basisdata anda, dan Django tidak akan membantu anda. Meskipun perilaku itu adalah ditentukan dalam :pep:`249`,penerapan dari penyadur tidak selalu konsisten dengan satu lainnya. Tinjau kembali dari penyadur anda sedang gunakan secara hati-hati.

source: You must ensure that no transaction is active, usually by issuing a :func:`commit` or a :func:`rollback`, before turning autocommit back on.
id: Anda harus memastikan bahwa tidak ada transaksi aktif, biasanya dengan menerbitkan :func:`commit` or a :func:`rollback`,sebelum menyalakan penjalanan otomatis.

source: Django will refuse to turn autocommit off when an :func:`atomic` block is active, because that would break atomicity.
id: Django akan menolak mematikan autocommit ketika blok :func:`atomic` aktif, karena itu akan merusak atomicity.

source: Transactions
id: Transaksi

source: A transaction is an atomic set of database queries. Even if your program crashes, the database guarantees that either all the changes will be applied, or none of them.
id: Sebuah transaksi adalah atomic kumpulan dari permintaan basisdata. Bahkan jika program anda tabrakan, basisdata menjamin bahwa baik semua perubahan akan diberlakukan, atau tidak dari mereka.

source: Django doesn't provide an API to start a transaction. The expected way to start a transaction is to disable autocommit with :func:`set_autocommit`.
id: Django tidak menyediakan sebuah API untuk memulai sebuah transaksi. Cara diharapkan memulai sebuah transaksi adalah meniadakan autocommit dengan :func:`set_autocommit`.

source: Once you're in a transaction, you can choose either to apply the changes you've performed until this point with :func:`commit`, or to cancel them with :func:`rollback`. These functions are defined in :mod:`django.db.transaction`.
id: Sekali anda berada dalam transaksi, anda dapat memilih antara memberlakukan perubahan anda telah lakukan sampai titik ini dengan :func:`commit`,atau mmebatalkan mereka dengan :func:`rollback`. Fungsi-fungsi ini ditentukan dalam :mod:`django.db.transaction`.

source: Django will refuse to commit or to rollback when an :func:`atomic` block is active, because that would break atomicity.
id: Django menolak commit atau rollback ketika sebuah blok :func:`atomic` aktif, karena itu akan merusak atomicity.

source: Savepoints aren't especially useful if you are using autocommit, the default behavior of Django. However, once you open a transaction with :func:`atomic`, you build up a series of database operations awaiting a commit or rollback. If you issue a rollback, the entire transaction is rolled back. Savepoints provide the ability to perform a fine-grained rollback, rather than the full rollback that would be performed by ``transaction.rollback()``.
id: Savepoint bukanlah khususnya berguna jika anda sedang menggunakan autocommit, perilaku kebiasaan dari Django. Bagaimanapun, sekali anda membuka sebuah transaksi dengan :func:`atomic`,anda membangun deretan tindakan-tindakan basisdata menunggu sebuah commit atau rollback. Jika anda menerbitkan sebuah rollback, transaksi keseluruhan diputar kembali yang akan dilakukan dengan ``transaction.rollback()``.

source: When the :func:`atomic` decorator is nested, it creates a savepoint to allow partial commit or rollback. You're strongly encouraged to use :func:`atomic` rather than the functions described below, but they're still part of the public API, and there's no plan to deprecate them.
id: Ketika penghias :func:`atomic` bersarang, itu membuat sebuah savepoint untuk mengizinkan commit atau rollback sebagian. Anda sangat dianjurkan menggunakan :func:`atomic`daripada fungsi-fungsi digambarkan dibawah, tetapi mereka adalah masih bagian dari API umum, dan tidak ada rencana mengusangkan mereka.

source: Each of these functions takes a ``using`` argument which should be the name of a database for which the behavior applies. If no ``using`` argument is provided then the ``"default"`` database is used.
id: Setiap fungsi-fungsi ini mengambil argumen ``using`` yang harus dinamai dari basisdata untuk dimana perilaku diberlakukan. Jika tidak ada argumen ``using`` disediakan kemudian basisdata ``"default"`` digunakan.

source: Savepoints are controlled by three functions in :mod:`django.db.transaction`:
id: Savepoint dikendalikan oleh tiga fungsi dalam :mod:`django.db.transaction`:

source: Creates a new savepoint. This marks a point in the transaction that is known to be in a "good" state. Returns the savepoint ID (``sid``).
id: Membuat sebuah savepoint baru. Ini menandai sebuah titik dalam transaksi yang dikenal sebagai keadaan "good". Mengembalikan ID savepoint (``sid``).

source: Releases savepoint ``sid``. The changes performed since the savepoint was created become part of the transaction.
id: Bebaskan savepoint ``sid``. Perubahan dilakukan sejak savepoint dibuat menjadi bagian dari transaksi.

source: Rolls back the transaction to savepoint ``sid``.
id: Memutar kembali transaksi pada savepoint ``sid``.

source: These functions do nothing if savepoints aren't supported or if the database is in autocommit mode.
id: Fungsi-fungsi ini tidak melakukan apapun jika savepoint tidak didukung atau jika basisdata dalam suasana penjalanan otomatis.

source: In addition, there's a utility function:
id: Sebagai tambahan, ada fungsi kegunaan:

source: Resets the counter used to generate unique savepoint IDs.
id: Setel kembali penghitung digunakan untuk membangkitkan ID savepoint unik.

source: The following example demonstrates the use of savepoints::
id: Contoh berikut mempertunjukkan penggunaan dari savepoint::

source: Savepoints may be used to recover from a database error by performing a partial rollback. If you're doing this inside an :func:`atomic` block, the entire block will still be rolled back, because it doesn't know you've handled the situation at a lower level! To prevent this, you can control the rollback behavior with the following functions.
id: Savepoint dapat digunakan untuk memulihkan dari kesalahan basisdata dengan melakukan rollback sebagian. Jika anda sedang melakukan ini didalam sebuah blok :func:`atomic`, keseluruhan blok akan masih dapat di rollback, karena itu tidak mengetahui anda telah menangani keadaan pada tingkatan terendah! Untuk mencegah ini, anda dapat mengendalikan perilaku rollback dengan fungsi-fungsi berikut.

source: Setting the rollback flag to ``True`` forces a rollback when exiting the innermost atomic block. This may be useful to trigger a rollback without raising an exception.
id: Setel bendera rollback menjadi ``True`` memaksa sebuah rollback ketika keluar blok atomik paling sebelah dalam. Ini mungkin berguna untuk memicu sebuah rollback tanpa memunculkan sebuah pengecualian.

source: Setting it to ``False`` prevents such a rollback. Before doing that, make sure you've rolled back the transaction to a known-good savepoint within the current atomic block! Otherwise you're breaking atomicity and data corruption may occur.
id: Setel itu menjadi ``False`` mencegah rollback seperti itu. Sebelum melakukan itu, pastikan anda telah rollback transaksi pada savepoint dikenal-baik dalam blok atomic saat ini! Sebaliknya anda sedang merusak atomic dan kerusakan data mungkin muncul.

source: Database-specific notes
id: Catatan khusus-basisdata

source: Savepoints in SQLite
id: Savepoint di SQLite

source: When autocommit is enabled, savepoints don't make sense. When it's disabled, :mod:`sqlite3` commits implicitly before savepoint statements. (In fact, it commits before any statement other than ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` and ``REPLACE``.) This bug has two consequences:
id: Ketika autocommit diadakan, savepoint tidak masuk akal. Ketika itu ditiadakan, :mod:`sqlite3`commit secara mutlak sebelum pernyataan savepoint. (Dalam faktanya, itu commit sebelum pernyataan apapun selain dari ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` dan ``REPLACE``.) Kesalahan ini memiliki dua konsekuensi:

source: The low level APIs for savepoints are only usable inside a transaction ie. inside an :func:`atomic` block.
id: API tingkat rendah untuk savepoint hanya berguna didalam transaksi yaitu didalam blok :func:`atomic`.

source: It's impossible to use :func:`atomic` when autocommit is turned off.
id: Sangat tidak mungkin menggunakan :func:`atomic` ketika penjalan otomatis dimatikan.

source: Transactions in MySQL
id: Transaksi di MySQL
