Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The column type, which tells the database what kind of data to store (e.g. ``INTEGER``, ``VARCHAR``, ``TEXT``).
id: Jenis kolom, yang memberitahu basisdata maca apa dari data disimpan (sebagai contoh ``INTEGER``, ``VARCHAR``, ``TEXT``).

source: The default HTML :doc:`widget </ref/forms/widgets>` to use when rendering a form field (e.g. ``<input type="text">``, ``<select>``).
id: HTML awalan :doc:`widget </ref/forms/widgets>` untuk digunakan ketika membangun sebuah bidang formulir (sebagai contoh ``<input type="text">``, ``<select>``).

source: The minimal validation requirements, used in Django's admin and in automatically-generated forms.
id: Persyaratan pengesahan minimal, digunakan di admin Django dan di formulir dibangkitkan-otomatis.

source: Django ships with dozens of built-in field types; you can find the complete list in the :ref:`model field reference <model-field-types>`. You can easily write your own fields if Django's built-in ones don't do the trick; see :doc:`/howto/custom-model-fields`.
id: Django dibekali dengan lusinan dari jenis-jenis siap pakai; anda dapat menemukan daftar lengkap dalam :ref:`model field reference <model-field-types>`. Anda dapat dengan mudah menulis bidang-bidang anda sendiri jika satu siap-pakai Django tidak melakukan trik; lihat :doc:`/howto/custom-model-fields`.

source: Field options
id: Pilihan bidang

source: Each field takes a certain set of field-specific arguments (documented in the :ref:`model field reference <model-field-types>`). For example, :class:`~django.db.models.CharField` (and its subclasses) require a :attr:`~django.db.models.CharField.max_length` argument which specifies the size of the ``VARCHAR`` database field used to store the data.
id: Setiap bidang-bidang mengambil kumpulan tertentu dari argumen bidang-tertentu (didokumentasikan dalam :ref:`model field reference <model-field-types>`). Sebagai contoh, :class:`~django.db.models.CharField` (dan subkelasnya) membutuhkan sebuah argumen :attr:`~django.db.models.CharField.max_length` yang menentukan ukuran dari bidang basisdata ``VARCHAR`` digunakan untuk menyimpan data.

source: There's also a set of common arguments available to all field types. All are optional. They're fully explained in the :ref:`reference <common-model-field-options>`, but here's a quick summary of the most often-used ones:
id: Ada juga sekumpulan dari argumen umum tersedia pada semua jenis bidang. Semua adalah pilihan. Mereka sepenuhnya dijelaskan dalam :ref:`reference <common-model-field-options>`, tetapi ini adalah ringkasan cepat dari satu kebanyakan sering-digunakan:

source: If ``True``, Django will store empty values as ``NULL`` in the database. Default is ``False``.
id: Jika ``True``, Django akan menyimpan nilai-nilai kosong sebagai ``NULL`` di basisdata. Awalan adalah ``False``.

source: If ``True``, the field is allowed to be blank. Default is ``False``.
id: Jika ``True``, bidang diizinkan menjadi kosong. Awalan adalah ``False``.

source: Note that this is different than :attr:`~Field.null`. :attr:`~Field.null` is purely database-related, whereas :attr:`~Field.blank` is validation-related. If a field has :attr:`blank=True <Field.blank>`, form validation will allow entry of an empty value. If a field has :attr:`blank=False <Field.blank>`, the field will be required.
id: Catat bahwa ini berbeda dari :attr:`~Field.null`. :attr:`~Field.null`murni basisdata-terkait, dimana attr:`~Field.blank` adalah pengesahan-terkait. Jika sebuah bidang mempunyai :attr:`blank=True <Field.blank>`, pengesahan formulir akan mengizinkan masukan dari sebuah nilai kosong. Jika sebuah bidang mempunyai :attr:`blank=False <Field.blank>`, bidang akan diwajibkan.

source: An iterable (e.g., a list or tuple) of 2-tuples to use as choices for this field. If this is given, the default form widget will be a select box instead of the standard text field and will limit choices to the choices given.
id: Sebuah perulangan (yaitu, sebuah daftar atau tuple) dari 2-tuple digunakan sebagai pilihan untuk bidang ini. Jika ini diberikan, widget formulir awalan akan berupa kotak pilih daripada bidang teks standar dan akan membatasi pilihan pada pilihan diberikan.

source: A choices list looks like this::
id: Daftar pilihan kelihatan seperti ini::

source: The first element in each tuple is the value that will be stored in the database. The second element is displayed by the field's form widget.
id: Unsur pertama dalam setiap tuple adalah nilaiyang akan disimpan dalam basisdata. Unsur kedua ditampilkan oleh widget formulir bidang.

source: Given a model instance, the display value for a field with ``choices`` can be accessed using the :meth:`~django.db.models.Model.get_FOO_display` method. For example::
id: Diberikan sebuah instance model, nilai tampilan untuk sebuah bidang dengan ``choices`` dapat diakses menggunakan metode :meth:`~django.db.models.Model.get_FOO_display`. Sebagai contoh::

source: The default value for the field. This can be a value or a callable object. If callable it will be called every time a new object is created.
id: Nilai awalan untuk bidang. Ini dapat berupa nilai atau obyek callable. Jika callable itu akan diapnggil setiap waktu obyek baru dibuat.

source: Extra "help" text to be displayed with the form widget. It's useful for documentation even if your field isn't used on a form.
id: Teks "help" tambahan untuk ditampilkan dengan widget formulir. Itu sangat berguna untuk dokumentasi bahkan jika bidang anda tidak digunakan pada formulir.

source: If ``True``, this field is the primary key for the model.
id: Jika ``True``, bidang ini adalah primary key untuk model.

source: If you don't specify :attr:`primary_key=True <Field.primary_key>` for any fields in your model, Django will automatically add an :class:`IntegerField` to hold the primary key, so you don't need to set :attr:`primary_key=True <Field.primary_key>` on any of your fields unless you want to override the default primary-key behavior. For more, see :ref:`automatic-primary-key-fields`.
id: Jika anda tidak menentukan :attr:`primary_key=True <Field.primary_key>` untuk tiap bidang di model anda, Django akan otomatis menambahkan sebuah :class:`IntegerField` untuk menahan primary key, jadi anda tidak butuh menyetel :attr:`primary_key=True <Field.primary_key>` pada tiap bidang anda meskipun anda ingin menimpa kebiasaan primary-key awalan. Untuk lebih, lihat :ref:`automatic-primary-key-fields`.

source: The primary key field is read-only. If you change the value of the primary key on an existing object and then save it, a new object will be created alongside the old one. For example::
id: Bidang kunci utama adalah hanya-baca. Jika anda merubah nilai dari primaru key pada sebuah obyek yang ada dan kemudian menyimpan itu, sebuah obyek baru akan dibuat bersama satu yang lama. Sebagai contoh::

source: If ``True``, this field must be unique throughout the table.
id: Jika ``True``, bidang ini harus unik diseluruh tabel.

source: Again, these are just short descriptions of the most common field options. Full details can be found in the :ref:`common model field option reference <common-model-field-options>`.
id: Lagi, ini hanya gambaran pendek dari kebanyakan pilihan bidang umum. Rincian penuh dapat ditemukan di :ref:`common model field option reference <common-model-field-options>`.

source: Automatic primary key fields
id: Bidang primary key otomatis

source: By default, Django gives each model the following field::
id: Secara awal, Django memberikan setiap model bidang berikut::

source: This is an auto-incrementing primary key.
id: Ini adalah primary key peningkatan-otomatis.

source: If you'd like to specify a custom primary key, just specify :attr:`primary_key=True <Field.primary_key>` on one of your fields. If Django sees you've explicitly set :attr:`Field.primary_key`, it won't add the automatic ``id`` column.
id: Jika anda suka menentukan primary key penyesuaian, cukup tentukan :attr:`primary_key=True <Field.primary_key>` pada satu dari bidang-bdiang anda. Jika Django melihat anda telah jelas menyetel :attr:`Field.primary_key`, itu tidak akan menambahkan kolom ``id`` otomatis.

source: Each model requires exactly one field to have :attr:`primary_key=True <Field.primary_key>` (either explicitly declared or automatically added).
id: Setiap model membutuhkan setidaknya satu bidang untuk memiliki :attr:`primary_key=True <Field.primary_key>` (antara dinyatakan jelas atau ditambahkan otomatis).

source: Verbose field names
id: Nama-nama bidang bertele-tele

source: Each field type, except for :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` and :class:`~django.db.models.OneToOneField`, takes an optional first positional argument -- a verbose name. If the verbose name isn't given, Django will automatically create it using the field's attribute name, converting underscores to spaces.
id: Setiap jenis bidang, kecuali untuk :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` dan :class:`~django.db.models.OneToOneField`, mengambil sebuah pilihan argumen penempatan pertama -- sebuah nama bertele-tele. Jika nama bertele-tele tidak diberikan, DJango akan otomatis membuat itu menggunakan nama atribut bidang, merubah garis bawah menjadi ruang.

source: In this example, the verbose name is ``"person's first name"``::
id: Dalam contoh ini, nama bertele-tele adalah ``"person's first name"``::

source: In this example, the verbose name is ``"first name"``::
id: Dalam contoh ini, nama bertele-tele adalah ``"first name"``::

source: :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` and :class:`~django.db.models.OneToOneField` require the first argument to be a model class, so use the :attr:`~Field.verbose_name` keyword argument::
id: :class:`~django.db.models.ForeignKey`, :class:`~django.db.models.ManyToManyField` dan :class:`~django.db.models.OneToOneField` membutuhkan argumen pertama untuk jadi kelas model, jadi gunakan argumen kata kunci :attr:`~Field.verbose_name`::

source: The convention is not to capitalize the first letter of the :attr:`~Field.verbose_name`. Django will automatically capitalize the first letter where it needs to.
id: Kebiasaan tidak menghuruf besarkan huruf pertama dari :attr:`~Field.verbose_name`. Django akan otomatis menghuruf besarkan huruf pertama dimana itu dibutuhkan.

source: Relationships
id: Hubungan

source: Clearly, the power of relational databases lies in relating tables to each other. Django offers ways to define the three most common types of database relationships: many-to-one, many-to-many and one-to-one.
id: Jelas, kekuatan dari hubungan basisdata bergantung dalam tabel berkaitan ke setiap lainnya. Django menawarkan cara menentukan tiga jenis paling umum dari hubungan basisdata: many-to-one, many-to-many dan one-to-one.

source: To define a many-to-one relationship, use :class:`django.db.models.ForeignKey`. You use it just like any other :class:`~django.db.models.Field` type: by including it as a class attribute of your model.
id: Untuk menentukan hubungan many-to-one, gunakan :class:`~django.db.models.ForeignKey`. Anda menggunakan itu seperti jenis :class:`~django.db.models.Field` lainnya: dengan menyertakan itu sebagai sebuah atribut kelas dari model anda.

source: :class:`~django.db.models.ForeignKey` requires a positional argument: the class to which the model is related.
id: :class:`~django.db.models.ForeignKey` membutuhkan sebuah argumen penempatan: kelas dimana model terkait.

source: For example, if a ``Car`` model has a ``Manufacturer`` -- that is, a ``Manufacturer`` makes multiple cars but each ``Car`` only has one ``Manufacturer`` -- use the following definitions::
id: Sebagai contoh, jika sebuah model ``Car`` mempunyai ``Manufacturer`` -- yaitu, ``Manufacturer`` membuat banyak mobil tetapi setiap ``car`` hanya mempunyai satu ``Manufacturer`` -- gunakan pengertian berikut::

source: You can also create :ref:`recursive relationships <recursive-relationships>` (an object with a many-to-one relationship to itself) and :ref:`relationships to models not yet defined <lazy-relationships>`; see :ref:`the model field reference <ref-foreignkey>` for details.
id: Anda dapat juga membuat :ref:`recursive relationships <recursive-relationships>` (sebuah obyek dengan hubungan many-to-one ke diri sendiri) dan :ref:`relationships to models not yet defined <lazy-relationships>`; lihat :ref:`the model field reference <ref-foreignkey>` untuk rincian.

source: It's suggested, but not required, that the name of a :class:`~django.db.models.ForeignKey` field (``manufacturer`` in the example above) be the name of the model, lowercase. You can, of course, call the field whatever you want. For example::
id: Disarankan, tetapi tidak wajib, bahwa nama dari bidang :class:`~django.db.models.ForeignKey` (``manufacturer`` dalam contoh diatas) menjadi nama dari model, huruf kecil. Anda dapat, tentu saja, memanggil bidang apapun kamu ingin. Sebagai contoh::

source: :class:`~django.db.models.ForeignKey` fields accept a number of extra arguments which are explained in :ref:`the model field reference <foreign-key-arguments>`. These options help define how the relationship should work; all are optional.
id: Bidang :class:`~django.db.models.ForeignKey` menerima sejumlah dari argumen tambahan yang dijelaskan dalam :ref:`the model field reference <foreign-key-arguments>`. Pilihan-pilihan ini membantu menentukan bagaimana hubungan harus bekerja; semua adalah pilihan.

source: For details on accessing backwards-related objects, see the :ref:`Following relationships backward example <backwards-related-objects>`.
id: Untuk rincian pada mengakses obyek terkait-kebelakang, lihat :ref:`Following relationships backward example <backwards-related-objects>`.

source: For sample code, see the :doc:`Many-to-one relationship model example </topics/db/examples/many_to_one>`.
id: Untuk kode contoh, lihat :doc:`Many-to-one relationship model example </topics/db/examples/many_to_one>`.

source: To define a many-to-many relationship, use :class:`~django.db.models.ManyToManyField`. You use it just like any other :class:`~django.db.models.Field` type: by including it as a class attribute of your model.
id: Untuk menentukan hubungan many-to-many, gunakan :class:`~django.db.models.ManyToManyField`. Anda menggunakan itu seperti jenis :class:`~django.db.models.Field` lainnya: dengan menyertakan itu sebagai sebuah atribut kelas dari model anda.

source: :class:`~django.db.models.ManyToManyField` requires a positional argument: the class to which the model is related.
id: :class:`~django.db.models.ManyToManyField` membutuhkan argumen penempatan: kelas pada yang model yang terkait.

source: For example, if a ``Pizza`` has multiple ``Topping`` objects -- that is, a ``Topping`` can be on multiple pizzas and each ``Pizza`` has multiple toppings -- here's how you'd represent that::
id: Sebagai contoh, jika ``Pizza`` mempunyai banyak obyek ``Topping``--yaitu, sebuah ``Topping`` dapat berupa pada banyak pizza dan setiap ``Pizza`` mempunyai banyak taburan -- ini adalah bagaimana anda mewakili itu::

source: As with :class:`~django.db.models.ForeignKey`, you can also create :ref:`recursive relationships <recursive-relationships>` (an object with a many-to-many relationship to itself) and :ref:`relationships to models not yet defined <lazy-relationships>`.
id: Seperti :class:`~django.db.models.ForeignKey`, anda dapat juga membuat :ref:`recursive relationships <recursive-relationships>` (sebuah obyek dengan hubungan many-to-many ke itu sendiri) dan :ref:`relationships to models not yet defined <lazy-relationships>`.

source: It's suggested, but not required, that the name of a :class:`~django.db.models.ManyToManyField` (``toppings`` in the example above) be a plural describing the set of related model objects.
id: Disarankan, tetapi tidak wajib, bahwa nama dari sebuah :class:`~django.db.models.ManyToManyField` (``toppings`` dalam contoh diatas) menjadi plural menggambarkan kumpulan dari obyek model terkait.

source: It doesn't matter which model has the :class:`~django.db.models.ManyToManyField`, but you should only put it in one of the models -- not both.
id: Itu tidak masalah model mana mempunyai :class:`~django.db.models.ManyToManyField`, tetapi anda harus menaruh itu dalam satu dari model - tidak keduanya.

source: Generally, :class:`~django.db.models.ManyToManyField` instances should go in the object that's going to be edited on a form. In the above example, ``toppings`` is in ``Pizza`` (rather than ``Topping`` having a ``pizzas`` :class:`~django.db.models.ManyToManyField` ) because it's more natural to think about a pizza having toppings than a topping being on multiple pizzas. The way it's set up above, the ``Pizza`` form would let users select the toppings.
id: Umumnya, instance :class:`~django.db.models.ManyToManyField` harus pergi ke obyek yang akan disunting pada sebuah formulir. Dalam contoh diatas, ``toppings``berada dalam ``Pizza`` (daripada ``toppings`` memiliki ``Pizza`` :class:`~django.db.models.ManyToManyField` ) karena itu lebih alami untuk berpikir tentang sebuah pizza mempunyai taburan berada pada banyak pizza. Cara itu menyetel diatas, formulir ``Pizza`` akan membiarkan pengguna memilih taburan.

source: See the :doc:`Many-to-many relationship model example </topics/db/examples/many_to_many>` for a full example.
id: Lihat :doc:`Many-to-many relationship model example </topics/db/examples/many_to_many>` untuk contoh penuh.

source: :class:`~django.db.models.ManyToManyField` fields also accept a number of extra arguments which are explained in :ref:`the model field reference <manytomany-arguments>`. These options help define how the relationship should work; all are optional.
id: Bidang :class:`~django.db.models.ManyToManyField` juga menerima sejumlah dari argumen tambahan yang dijelaskan dalam :ref:`the model field reference <manytomany-arguments>`. Pilihan-pilihan ini membantu menentukan bagaimana hubungan harus bekerja; semua adalah pilihan.

source: Extra fields on many-to-many relationships
id: Bidang tambahan pada hubungan many-to-many

source: When you're only dealing with simple many-to-many relationships such as mixing and matching pizzas and toppings, a standard :class:`~django.db.models.ManyToManyField` is all you need. However, sometimes you may need to associate data with the relationship between two models.
id: Jika anda hanya berurusan dengan hubungan many-to-many sederhana seperti mixin dan mencocokkan pizza dan taburan, sebuah :class:`~django.db.models.ManyToManyField` standar adalah semua yang anda butuhkan. Bagaimanapun, terkadang anda mungkin butuh mengkaitkan data dengan hubungan diantara dua model.

source: For example, consider the case of an application tracking the musical groups which musicians belong to. There is a many-to-many relationship between a person and the groups of which they are a member, so you could use a :class:`~django.db.models.ManyToManyField` to represent this relationship. However, there is a lot of detail about the membership that you might want to collect, such as the date at which the person joined the group.
id: Sebagai contoh, pertimbangkan kasus dari sebuah aplikasi melacak kelompok musikal yang milik pemusik. Ada hubungan many-to-many diantara seorang dan kelompok yang mereka adalah anggota, jadi anda dapat menggunakan sebuah :class:`~django.db.models.ManyToManyField` untuk mewakili hubungan ini. Bagaimanapun, ada banyak dari rincian tentang keanggotaan yang mungkin ingin dikumpulkan, seperti tanggal dimana seseorang bergabung kelompok.

source: For these situations, Django allows you to specify the model that will be used to govern the many-to-many relationship. You can then put extra fields on the intermediate model. The intermediate model is associated with the :class:`~django.db.models.ManyToManyField` using the :attr:`through <ManyToManyField.through>` argument to point to the model that will act as an intermediary. For our musician example, the code would look something like this::
id: Untuk keadaan ini, Django mengizinkan anda menentukan model yang akan digunakan untuk menentukan hubungan many-to-many. Anda dapat kemudian menaruh bidang-bidang tambahan pada model menengah. Model menengah dikaitkan dengan :class:`~django.db.models.ManyToManyField` menggunakan argumen :attr:`through <ManyToManyField.through>` untuk menunjuk model yang akan bertindak sebagai sebuah perantara. Untuk contoh pemusik kami, kode akan terlihat sesuatu seperti ini::

source: When you set up the intermediary model, you explicitly specify foreign keys to the models that are involved in the many-to-many relationship. This explicit declaration defines how the two models are related.
id: Ketika anda menyetel model perantara, anda jelas menentukan foreign key pada model-model yang terlibat dalam hubungan many-to-many. Pernyataan jelas ini menentukan bagaimana dua model terkait.

source: There are a few restrictions on the intermediate model:
id: Ada beberapa batasan pada model menengah:

source: Your intermediate model must contain one - and *only* one - foreign key to the source model (this would be ``Group`` in our example), or you must explicitly specify the foreign keys Django should use for the relationship using :attr:`ManyToManyField.through_fields <ManyToManyField.through_fields>`. If you have more than one foreign key and ``through_fields`` is not specified, a validation error will be raised. A similar restriction applies to the foreign key to the target model (this would be ``Person`` in our example).
id: Model perantara anda harus mengandung satu - dan *hanya` satu - foreign key pada model sumber (ini akan berupa ``Group`` dalam contoh kami), atau anda harus menentukan jelas foreign key Django harus gunakan untuk hubungan menggunakan :attr:`ManyToManyField.through_fields <ManyToManyField.through_fields>`. Jika anda mempunyai lebih dari satu foreign key dan ``through_fields`` tidak ditentukan, kesalahan pengesahan akan dimunculkan. Pembatasan yang mirip berlaku pada foreign key ke model sasaran (ini akan berupa ``Person`` dalam contoh kami).

source: For a model which has a many-to-many relationship to itself through an intermediary model, two foreign keys to the same model are permitted, but they will be treated as the two (different) sides of the many-to-many relationship. If there are *more* than two foreign keys though, you must also specify ``through_fields`` as above, or a validation error will be raised.
id: Untuk sebuah model yang mempunyai hubungan many-to-many ke itu sendiri melalui sebuah model perantara, dua foreign key pada model sama diizinkan, tetapi mereka akan diperlakukan sebagai dua sisi (berbeda) dari hubungan many-to-many. Jika ada *lebih* dari dua foreign key, anda harus juga menentukan ``through_fields`` seperti diatas, atau sebuah kesalahan pengesahan akan dimunculkan.

source: When defining a many-to-many relationship from a model to itself, using an intermediary model, you *must* use :attr:`symmetrical=False <ManyToManyField.symmetrical>` (see :ref:`the model field reference <manytomany-arguments>`).
id: Ketika menentukan hubungan many-to-many dari model kepada itu sendiri, menggunakan model perantara, anda *harus* menggunakan :attr:`symmetrical=False <ManyToManyField.symmetrical>` (lihat :ref:`the model field reference <manytomany-arguments>`).
