Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The ``Student`` model will have three fields: ``name``, ``age`` and ``home_group``. The ``CommonInfo`` model cannot be used as a normal Django model, since it is an abstract base class. It does not generate a database table or have a manager, and cannot be instantiated or saved directly.
id: Model ``Student`` akan mempunyai tiga bidang: ``name``, ``age`` dan ``home_group``. Model ``CommonInfo`` tidak dapat digunakan sebagai model Django biasa, sejak itu adalah sebuah kelas dasar abstrak. Itu tidak membangkitkan sebuah tabel basisdata atau mempunyai sebuah pengelola, dan tidak dapat di instansiasikan atau disimpan langsung.

source: For many uses, this type of model inheritance will be exactly what you want. It provides a way to factor out common information at the Python level, while still only creating one database table per child model at the database level.
id: Untuk banyak penggunaan, jenis ini dari warisan model akan tepatnya apa yang anda inginkan. Itu menyediakan sebuah cara untuk faktor luar informasi umum pada tingkat Python, selagi masih hanya membuat satu tabel basisdata per model anak pada tingkat basisdata.

source: ``Meta`` inheritance
id: ``Meta`` warisan

source: When an abstract base class is created, Django makes any :ref:`Meta <meta-options>` inner class you declared in the base class available as an attribute. If a child class does not declare its own :ref:`Meta <meta-options>` class, it will inherit the parent's :ref:`Meta <meta-options>`. If the child wants to extend the parent's :ref:`Meta <meta-options>` class, it can subclass it. For example::
id: Ketika sebuah kelas dasar abstrak dibuat, Django membuat kelas sebelah dalam :ref:`Meta <meta-options>` apapun anda nyatakan di kelas dasar tersedia sebagai sebuah atribut. Jika sebuah kelas anak tidak menyatakan kelas :ref:`Meta <meta-options>` nya sendiri, itu akan mewarisi :ref:`Meta <meta-options>` induk. Jika anak ingin memperpanjang kelas :ref:`Meta <meta-options>` induk, itu dapat mensubkelaskan itu. Sebagai contoh::

source: Django does make one adjustment to the :ref:`Meta <meta-options>` class of an abstract base class: before installing the :ref:`Meta <meta-options>` attribute, it sets ``abstract=False``. This means that children of abstract base classes don't automatically become abstract classes themselves. Of course, you can make an abstract base class that inherits from another abstract base class. You just need to remember to explicitly set ``abstract=True`` each time.
id: Django membuat satu penyesuaian pada kelas :ref:`Meta <meta-options>` dari kelas dasar abstrak: sebelum memasang atribut :ref:`Meta <meta-options>`, itu menyetel ``abstract=False``. Ini berarti bahwa anak dari kelas-kelas dasar abstrak tidak otomatis menjadi kelas-kelas abstrak mereka sendiri. Tentu saja, anda dapat membuat sebuah kelas dasar abstrak yang mewarisi dari kelas dasar abstrak lain. Anda hanya butuh mengingat untuk menjelaskan menyetel ``abstract=True`` setiap kali.

source: Some attributes won't make sense to include in the :ref:`Meta <meta-options>` class of an abstract base class. For example, including ``db_table`` would mean that all the child classes (the ones that don't specify their own :ref:`Meta <meta-options>`) would use the same database table, which is almost certainly not what you want.
id: Beberapa atribut tidak akan masuk akal untuk disertakan dalam kelas :ref:`Meta <meta-options>` dari sebuah kelas dasar abstrak. Sebagai coontoh, menyertakan ``db_table`` akan berarti bahwa semua kelas-kelas anak (satu yang tidak menentukan milik mereka :ref:`Meta <meta-options>`) akan menggunakan tabel basisdata sama, yang hampir pasti bukan yang anda inginkan.

source: Be careful with ``related_name`` and ``related_query_name``
id: Hati-hati dengan ``related_name`` dan ``related_query_name``

source: If you are using :attr:`~django.db.models.ForeignKey.related_name` or :attr:`~django.db.models.ForeignKey.related_query_name` on a ``ForeignKey`` or ``ManyToManyField``, you must always specify a *unique* reverse name and query name for the field. This would normally cause a problem in abstract base classes, since the fields on this class are included into each of the child classes, with exactly the same values for the attributes (including :attr:`~django.db.models.ForeignKey.related_name` and :attr:`~django.db.models.ForeignKey.related_query_name`) each time.
id: Jika anda sedang menggunakan :attr:`~django.db.models.ForeignKey.related_name` atau :attr:`~django.db.models.ForeignKey.related_query_name` pada ``ForeignKey`` atau ``ManyToManyField``, anda harus selalu menentukan *unik* membalikkan nama dan permintaan nama untuk bidang. Ini akan biasanya menyebabkan sebuah masalah dalam kelas-kelas berdasarkan abstrak, sejak bidang-bidang pada kelas ini disertakan kedalam setiap kelas-kelas anak, yang tepatnya nilai-nilai sama untuk atribut-atribut (termasuk :attr:`~django.db.models.ForeignKey.related_name` dan :attr:`~django.db.models.ForeignKey.related_query_name`) setiap kali.

source: To work around this problem, when you are using :attr:`~django.db.models.ForeignKey.related_name` or :attr:`~django.db.models.ForeignKey.related_query_name` in an abstract base class (only), part of the value should contain ``'%(app_label)s'`` and ``'%(class)s'``.
id: Untuk pemecahan masalah ini, ketika anda sedang menggunakan :attr:`~django.db.models.ForeignKey.related_name` atau :attr:`~django.db.models.ForeignKey.related_query_name` dalam sebuah kelas dasar abstrak (hanya) bagian dari nilai harus mengandung ``'%(app_label)s'`` dan ``'%(class)s'``.

source: ``'%(class)s'`` is replaced by the lower-cased name of the child class that the field is used in.
id: ``'%(class)s'`` diganti oleh nama berhuruf-kecil dari kelas anak yang bidang digunakan.

source: ``'%(app_label)s'`` is replaced by the lower-cased name of the app the child class is contained within. Each installed application name must be unique and the model class names within each app must also be unique, therefore the resulting name will end up being different.
id: ``'%(app_label)s'`` diganti oleh nama berhuruf-kecil dari aplikasi kelas anak yang terkandung didalam. Setiap nama aplikasi terpasang harus unik dan nama-nama kelas model dalam setiap aplikasi harus juga unik, karena itu nama dihasilkan akan berakhir menjadi berbeda.

source: For example, given an app ``common/models.py``::
id: Sebagai contoh, diberikan sebuah aplikasi ``common/models.py``::

source: Along with another app ``rare/models.py``::
id: Bersama dengan aplikasi lainnya ``rare/models.py``::

source: The reverse name of the ``common.ChildA.m2m`` field will be ``common_childa_related`` and the reverse query name will be ``common_childas``. The reverse name of the ``common.ChildB.m2m`` field will be ``common_childb_related`` and the reverse query name will be ``common_childbs``. Finally, the reverse name of the ``rare.ChildB.m2m`` field will be ``rare_childb_related`` and the reverse query name will be ``rare_childbs``. It's up to you how you use the ``'%(class)s'`` and ``'%(app_label)s'`` portion to construct your related name or related query name but if you forget to use it, Django will raise errors when you perform system checks (or run :djadmin:`migrate`).
id: Membalikkan nama dari bidang ``common.ChildA.m2m`` akan menjadi ``common_childa_related`` dan membalikkan permintaan nama akan menjadi ``common_childas``. Membalikkan nama dari bidang ``common.ChildB.m2m`` akan menjadi ``common_childb_related`` dan membalikkan permintaan nama akan menjadi ``common_childbs``. Akhirnya, membalikkan nama dari bidang ``rare.ChildB.m2m`` akan menjadi ``rare_childb_related`` dan membalikkan permintaan nama akan menjadi ``rare_childbs``. Itu terserah anda bagaimana anda menggunakan bagian ``'%(class)s'`` dan ``'%(app_label)s'`` untuk membangun nama terhubung anda atau permintaan nama terhubung tetapi jika anda lupa menggunakan itu, Django akan memunculkan kesalahan-kesalahan ketika anda melalukan pemeriksaan sistem (atau menjalankan :djadmin:`migrate`).

source: If you don't specify a :attr:`~django.db.models.ForeignKey.related_name` attribute for a field in an abstract base class, the default reverse name will be the name of the child class followed by ``'_set'``, just as it normally would be if you'd declared the field directly on the child class. For example, in the above code, if the :attr:`~django.db.models.ForeignKey.related_name` attribute was omitted, the reverse name for the ``m2m`` field would be ``childa_set`` in the ``ChildA`` case and ``childb_set`` for the ``ChildB`` field.
id: Jika anda tidak menentukan sebuah atribut :attr:`~django.db.models.ForeignKey.related_name` untuk sebuah bidang dalam kelas dasar abstrak, membalikkan nama awalan akan menjadi nama dari kelas anak diikuti oleh ``'_set'``, seperti itu biasanya akan menjadi jika anda telah menyatakan bidang langsung pada kelas anak. Sebagai contoh, dalam kode diatas, jika atribut :attr:`~django.db.models.ForeignKey.related_name` dihilangkan, membalikkan nama untuk bidang ``m2m`` kan menjadi ``childa_set`` dalam kasus ``ChildA`` dan ``childb_set`` untuk bidang ``ChildB``.

source: Multi-table inheritance
id: Warisan banyak-tabel

source: The second type of model inheritance supported by Django is when each model in the hierarchy is a model all by itself. Each model corresponds to its own database table and can be queried and created individually. The inheritance relationship introduces links between the child model and each of its parents (via an automatically-created :class:`~django.db.models.OneToOneField`). For example::
id: Jenis kedua dari warisan model didukung oleh Django adalah ketika setiap model dalam hirarki adalah sebuah model semua oleh itu sendiri. Setiap model berhubungan ke tabel basisdata itu sendiri dan dapat diminta dan dibuat sendiri-sendiri. Hubungan warisan memperkenalkan tautan diantara model anak dan setiap dari induknya (melalui dibuat-otomatis :class:`~django.db.models.OneToOneField`). Sebagai contoh::

source: All of the fields of ``Place`` will also be available in ``Restaurant``, although the data will reside in a different database table. So these are both possible::
id: Semua dari bidang-bidang dari ``Place`` akan juga tersedia dalam ``Restaurant``, meskipun data akan tinggal dalam tabel basisdata berbeda. Jadi kedua ini memungkinkan::

source: If you have a ``Place`` that is also a ``Restaurant``, you can get from the ``Place`` object to the ``Restaurant`` object by using the lower-case version of the model name::
id: Jika anda mempunyai sebuah ``Place`` yang juga sebuah ``Restaurant``, anda dapat ambil dari obyek ``Place`` ke obyek ``Restaurant`` dengan menggunakan versi huruf-kecil dari nama model::

source: However, if ``p`` in the above example was *not* a ``Restaurant`` (it had been created directly as a ``Place`` object or was the parent of some other class), referring to ``p.restaurant`` would raise a ``Restaurant.DoesNotExist`` exception.
id: Bagaimanapun, jika ``p`` dalam contoh-contoh diatas *bukan* sebuah ``Restaurant`` (itu telah dibuat langsung sebagai sebuah obyek ``Place`` atau induk dari beberapa kelas lain(, mengacu pada ``p.restaurant`` akan memunculkan sebuah pengecualian ``Restaurant.DoesNotExist``.

source: The automatically-created :class:`~django.db.models.OneToOneField` on ``Restaurant`` that links it to ``Place`` looks like this::
id: :class:`~django.db.models.OneToOneField` dibuat-otomatis pada ``Restaurant`` yang mengkaitkan itu ke ``Place`` terlihat seperti ini::

source: You can override that field by declaring your own :class:`~django.db.models.OneToOneField` with :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` on ``Restaurant``.
id: Anda dapat menimpa bidang itu dengan menyatakan :class:`~django.db.models.OneToOneField`anda sendiri dengan :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` pada ``Restaurant``.

source: ``Meta`` and multi-table inheritance
id: ``Meta`` dan warisan banyak-tabel

source: In the multi-table inheritance situation, it doesn't make sense for a child class to inherit from its parent's :ref:`Meta <meta-options>` class. All the :ref:`Meta <meta-options>` options have already been applied to the parent class and applying them again would normally only lead to contradictory behavior (this is in contrast with the abstract base class case, where the base class doesn't exist in its own right).
id: Dalam keadaan warisan banyak-tabel, itu tidak masuk akal untuk sebuah kelas anak mewarisi dari kelas :ref:`Meta <meta-options>` induknya. Semua pilihan :ref:`Meta <meta-options>` telah diberlakukan ke kelas induk dan memberlakukan mereka kembali akan biasanya hanya membawa ke perilaku bertentangan (ini adalah berlawanan dengan kasus kelas dasar abstrak, dimana kelas dasar tidak ada dalam hak itu sendiri).

source: So a child model does not have access to its parent's :ref:`Meta <meta-options>` class. However, there are a few limited cases where the child inherits behavior from the parent: if the child does not specify an :attr:`~django.db.models.Options.ordering` attribute or a :attr:`~django.db.models.Options.get_latest_by` attribute, it will inherit these from its parent.
id: Jadi sebuah model anak tidak mempunyai akses ke kelas :ref:`Meta <meta-options>` induknya. Bagaimanapun, ada sedikit kasus terbatas ketika anak mewarisi perilaku dari induk: jika anak tidak menentukan sebuah atribut :attr:`~django.db.models.Options.ordering` atau sebuah atribut :attr:`~django.db.models.Options.get_latest_by`, itu akan mewarisi ini dari induknya.

source: If the parent has an ordering and you don't want the child to have any natural ordering, you can explicitly disable it::
id: Jika induk mempunyai sebuah pengurutan dan anda tidak ingin anak mempunyai pengurutan alami, anda dapat jelas meniadakan itu::

source: Inheritance and reverse relations
id: Mewarisi dan membalikkan hubungan

source: Because multi-table inheritance uses an implicit :class:`~django.db.models.OneToOneField` to link the child and the parent, it's possible to move from the parent down to the child, as in the above example. However, this uses up the name that is the default :attr:`~django.db.models.ForeignKey.related_name` value for :class:`~django.db.models.ForeignKey` and :class:`~django.db.models.ManyToManyField` relations. If you are putting those types of relations on a subclass of the parent model, you **must** specify the :attr:`~django.db.models.ForeignKey.related_name` attribute on each such field. If you forget, Django will raise a validation error.
id: Karena warisan banyak-tabel menggunakan sebuah :class:`~django.db.models.OneToOneField` ersirat pada tautan anak dan induk, itu memungkinkan memindahkan dari induk turun ke anak, seperti dalam contoh diatas. Bagaimanapun, ini menggunakan nama yang nilai :attr:`~django.db.models.ForeignKey.related_name` awalannya untuk hubungan :class:`~django.db.models.ForeignKey` dan :class:`~django.db.models.ManyToManyField`. Jika anda sedang menaruh jenis itu dari hubungan pada sebuah subkelas dari model induk, anda **harus** menentukan atribut :attr:`~django.db.models.ForeignKey.related_name` pada setiap bidang itu. Jika anda lupa, Django akan memunculkan sebuah kesalahan pengesahan.

source: For example, using the above ``Place`` class again, let's create another subclass with a :class:`~django.db.models.ManyToManyField`::
id: Sebagai contoh, menggunakan kelas ``Place`` diatas lagi, mari kita membuat subkelas lain dengan sebuah :class:`~django.db.models.ManyToManyField`::

source: This results in the error::
id: Ini hasil di kesalahan::

source: Adding ``related_name`` to the ``customers`` field as follows would resolve the error: ``models.ManyToManyField(Place, related_name='provider')``.
id: Menambahkan ``related_name`` ke bidang ``customers`` seperti berikut akan menyelesaikan kesalahan: ``models.ManyToManyField(Place, related_name='provider')``.

source: Specifying the parent link field
id: Menentukan bidang tautan induk

source: As mentioned, Django will automatically create a :class:`~django.db.models.OneToOneField` linking your child class back to any non-abstract parent models. If you want to control the name of the attribute linking back to the parent, you can create your own :class:`~django.db.models.OneToOneField` and set :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` to indicate that your field is the link back to the parent class.
id: Sebagai disebutkan, Django akan otomatis membuat sebuah :class:`~django.db.models.OneToOneField` menghubungkan ke kelas anak anda kembali ke model induk bukan-abtrak apapun. Jika anda ingin mengendalikan nama dari atribut menghubungkan kembali ke induk, anda dapat membuat :class:`~django.db.models.OneToOneField` anda sendiri dan menyetel :attr:`parent_link=True <django.db.models.OneToOneField.parent_link>` untuk menunjukkan bahwa bidang anda menghubungkan kembali ke kelas induk.

source: Proxy models
id: Model proxy

source: When using :ref:`multi-table inheritance <multi-table-inheritance>`, a new database table is created for each subclass of a model. This is usually the desired behavior, since the subclass needs a place to store any additional data fields that are not present on the base class. Sometimes, however, you only want to change the Python behavior of a model -- perhaps to change the default manager, or add a new method.
id: Ketika menggunakan :ref:`multi-table inheritance <multi-table-inheritance>`, tabel basisdata baru dibuat untuk setiap subkelas dari model. Ini biasanya keinginan kebiasaan, sejak subkelas butuh tempar menyimpan bidang data tambahan apapun yang tidak hadir pada kelas dasar. Terkadang, bagaimanapun, anda hanya ingin merubah kebiasaan Python dari model -- mungkin merubah pengelola awalan, atau menambah metode baru.

source: This is what proxy model inheritance is for: creating a *proxy* for the original model. You can create, delete and update instances of the proxy model and all the data will be saved as if you were using the original (non-proxied) model. The difference is that you can change things like the default model ordering or the default manager in the proxy, without having to alter the original.
id: Ini adalah kegunaan warisan model proxy: membuat sebuah *proxy* untuk model asli. Anda dapat membuat, menghapus dan memperbaharui instance-instance dari model proxy dan semua data akan disimpan seperti jika anda sedang menggunakan model (bukan-proxy) asli. Perbedaannya adalah bahwa anda dapat merubah hal-hal seperti pengurutan model awalan atau pengelola awalan dalam proxy, tanpa harus merubah aslinya.

source: Proxy models are declared like normal models. You tell Django that it's a proxy model by setting the :attr:`~django.db.models.Options.proxy` attribute of the ``Meta`` class to ``True``.
id: Model proxy dinyatakan seperti model-model biasa. Anda memberitahu Django bahwa model proxynya dengan mengatur atribut :attr:`~django.db.models.Options.proxy` dari kelas ``Meta`` menjadi ``False``.

source: For example, suppose you want to add a method to the ``Person`` model. You can do it like this::
id: Sebagai contoh, misalnya anda ingin menambahkan sebuah metode ke model ``Person``. Anda dapat melakukannya seperti ini::

source: The ``MyPerson`` class operates on the same database table as its parent ``Person`` class. In particular, any new instances of ``Person`` will also be accessible through ``MyPerson``, and vice-versa::
id: Kelas ``MyPerson`` berjalan pada tabel basisdata sama seperti induknya kelas ``Person``. Khususnya, instance baru apapun dari ``Person`` akan juga diakses melalui ``MyPerson``, dan sebaliknya::

source: You could also use a proxy model to define a different default ordering on a model. You might not always want to order the ``Person`` model, but regularly order by the ``last_name`` attribute when you use the proxy. This is easy::
id: Anda dapat juga menggunakan sebuah model proxy untuk menentukan pengurutan awalan berbeda pada sebuah model. Anda mungkin tidak inging mengurutkan model ``Person``, tetapi umumnya pengurutan oleh atribut ``last_name`` ketika anda menggunakan proxy. Ini adalah mudah::

source: Now normal ``Person`` queries will be unordered and ``OrderedPerson`` queries will be ordered by ``last_name``.
id: Sekarang permintaan ``Person`` biasa akan tidak diurutkan dan permintaan ``OrderedPerson`` akan diurutkan berdasarkan ``last_name``.

source: Proxy models inherit ``Meta`` attributes :ref:`in the same way as regular models <meta-and-multi-table-inheritance>`.
id: Model-model proxy mewarisi atribut ``Meta`` :ref:`in the same way as regular models <meta-and-multi-table-inheritance>`.

source: ``QuerySet``\s still return the model that was requested
id: ``QuerySet`` masih mengembalikan model yang telah diminta

source: There is no way to have Django return, say, a ``MyPerson`` object whenever you query for ``Person`` objects. A queryset for ``Person`` objects will return those types of objects. The whole point of proxy objects is that code relying on the original ``Person`` will use those and your own code can use the extensions you included (that no other code is relying on anyway). It is not a way to replace the ``Person`` (or any other) model everywhere with something of your own creation.
id: Tidak ada jalan Django kembali, katakan, sebuah obyek ``MyPerson`` kapanpun anda meminta untuk obyek ``Person``. Sebuah queryset untuk obyek ``Person`` akan mengembalikan jenis-jenis itu dari obyek. Titik keseluruhan dari obyek proxy adalah bahwa kode bergantung pada ``Person`` asli akan menggunakan itu dan kode anda sendiri dapat menggunakan perpanjangan anda sertakan (yang tidak ada kode lain bergantung bagaimanapun) Itu bukan sebuah cara mengganti ``Person`` (atau model lain) dimanapun dengan sesuatu dari pembuatan anda sendiri.

source: Base class restrictions
id: Batasan kelas dasar

source: A proxy model must inherit from exactly one non-abstract model class. You can't inherit from multiple non-abstract models as the proxy model doesn't provide any connection between the rows in the different database tables. A proxy model can inherit from any number of abstract model classes, providing they do *not* define any model fields. A proxy model may also inherit from any number of proxy models that share a common non-abstract parent class.
id: Sebuah model proxy harus mewarisi dari tepatnya satu kelas model bukan-abstrak. Anda tidak dapat mewarisi dari banyak model bukan-abstrak sebagai model proxy tidak menyediakan hubungan apapun diantara baris-baris dalam tabel-tabel basisdata berbeda. Sebuah model proxy dapat mewarisi dari angka apapun dari kelas-kelas model abstrak, menyediakan mereka *tidak* menentukan bidang-bidang model apapun. Sebuah model proxy mungkin juga mewarisi dari angka apapun dari model-model proxy yang berbagi kelas induk bukan-abstrak umum.

source: Proxy model managers
id: Pengelola model proxy

source: If you don't specify any model managers on a proxy model, it inherits the managers from its model parents. If you define a manager on the proxy model, it will become the default, although any managers defined on the parent classes will still be available.
id: Jika anda tidak menentukan pengelola model apapun pada model proxy, itu mewarisi pengelola dari induk modelnya. Jika anda menentukan sebuah pengelola pada model proxy, itu akan menjadi awalan, meskipun pengelola apapun ditentukan pada kelas-kelas induk akan masih tersedia.

source: Continuing our example from above, you could change the default manager used when you query the ``Person`` model like this::
id: Melanjutkan contoh kami dari atas, anda dapat merubah pengelola awalan digunakan ketika anda meminta model ``Person`` seperti ini::
