Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Now that you have set up your :class:`~django.db.models.ManyToManyField` to use your intermediary model (``Membership``, in this case), you're ready to start creating some many-to-many relationships. You do this by creating instances of the intermediate model::
id: Sekarang yang anda telah menyetel :class:`~django.db.models.ManyToManyField` anda untuk menggunakan model pertengangan kami (``Membership``, dalam kasus ini), anda siap mulai membuat beberapa hubungan many-to-many. Anda melakukan ini dengan membuat instance-instance dari model pertengahan::

source: Unlike normal many-to-many fields, you *can't* use ``add()``, ``create()``, or ``set()`` to create relationships::
id: Tidak seperti bidang many-to-many biasa, anda *tidak dapat* menggunakan ``add()``, ``create()``, atau ``set()`` untuk membuat hubungan::

source: Why? You can't just create a relationship between a ``Person`` and a ``Group`` - you need to specify all the detail for the relationship required by the ``Membership`` model. The simple ``add``, ``create`` and assignment calls don't provide a way to specify this extra detail. As a result, they are disabled for many-to-many relationships that use an intermediate model. The only way to create this type of relationship is to create instances of the intermediate model.
id: MEngapa? anda tidak dapat membuat sebuah hubungan diantara ``Person`` dan ``Group`` - anda butuh menentukan semua rincian untuk hubungan diwajibkan oleh model ``Membership``. Panggilan ``add``, ``create`` dan penugasan tidak menyediakan sebuah cara untuk menentukan rincian tambahan ini. Sebagai sebuah hasil, mereka ditiadakan untuk hubungan many-to-many yang menggunakan sebuah model pertengahan. Cara satu-satunya untuk membuat jenis ini dari hubungan adalah membuat instance-instance dari model pertengahan.

source: The :meth:`~django.db.models.fields.related.RelatedManager.remove` method is disabled for similar reasons. For example, if the custom through table defined by the intermediate model does not enforce uniqueness on the ``(model1, model2)`` pair, a ``remove()`` call would not provide enough information as to which intermediate model instance should be deleted::
id: Metode :meth:`~django.db.models.fields.related.RelatedManager.remove` ditiadakan untuk alasan mirip. Sebagai contoh, jika penyesuaian melalui tabel ditentukan oleh model pertengahan tidak melaksanakan keunikan pada pasangan ``(model1, model2)``, panggilan ``remove()`` tidak akan cukup menyediakan informasi untuk yang instance model pertengahan harus dihapus::

source: However, the :meth:`~django.db.models.fields.related.RelatedManager.clear` method can be used to remove all many-to-many relationships for an instance::
id: Bagaimanapun, metode :meth:`~django.db.models.fields.related.RelatedManager.clear` dapat digunakan untuk memindahkan semua hubungan many-to-many untuk sebuah contoh::

source: Once you have established the many-to-many relationships by creating instances of your intermediate model, you can issue queries. Just as with normal many-to-many relationships, you can query using the attributes of the many-to-many-related model::
id: Sekali anda telah membangun hubungan many-to-many dengan membuat instance-instance dari model pertengahan anda, anda dapat menerbitkan permintaan-permintaan. Seperti dengan hubungan biasa many-to-many, anda dapat meminta menggunakan atribut-atribut dari model hubungan-many-to-many::

source: As you are using an intermediate model, you can also query on its attributes::
id: Ketika anda sedang menggunakan model menengah, anda dapat juga meminta pada atributnya::

source: If you need to access a membership's information you may do so by directly querying the ``Membership`` model::
id: Jika anda butuh mengakses informasi keanggotaan anda mungkin melakukan itu dengan langsung meminta model ``Membership``::

source: Another way to access the same information is by querying the :ref:`many-to-many reverse relationship<m2m-reverse-relationships>` from a ``Person`` object::
id: cara lain mengakses informasi sama adalah dengan meminta :ref:`many-to-many reverse relationship<m2m-reverse-relationships>` dari obyek ``Person``::

source: To define a one-to-one relationship, use :class:`~django.db.models.OneToOneField`. You use it just like any other ``Field`` type: by including it as a class attribute of your model.
id: Untuk menentukan hubungan one-to-one, gunakan :class:`~django.db.models.OneToOneField`. Anda dapat menggunakan itu hanya seperti jenis ``Field`` lainnya: dengan menyertakan itu sebagai sebuah atribut kelas dari model anda.

source: This is most useful on the primary key of an object when that object "extends" another object in some way.
id: Ini adalah paling berguna pada primaty key dari sebuah obyek ketika obyek itu "extends" obyek lain di beberapa cara.

source: :class:`~django.db.models.OneToOneField` requires a positional argument: the class to which the model is related.
id: :class:`~django.db.models.OneToOneField` membutuhkan argumen penempatan: kelas dimana model yang terkait.

source: For example, if you were building a database of "places", you would build pretty standard stuff such as address, phone number, etc. in the database. Then, if you wanted to build a database of restaurants on top of the places, instead of repeating yourself and replicating those fields in the ``Restaurant`` model, you could make ``Restaurant`` have a :class:`~django.db.models.OneToOneField` to ``Place`` (because a restaurant "is a" place; in fact, to handle this you'd typically use :ref:`inheritance <model-inheritance>`, which involves an implicit one-to-one relation).
id: Sebagai contoh, jika anda sedang membangun sebuah basisdata dari "places", anda akan membangun hal yang cukup standar seperti alamat, nomor telepon, dll dalam basisdata. Kemudian, jika anda ingin membangun sebuah basisdata restoran di atas tempat-tempat, daripada mengulangi anda sendiri dan meniru bidang-bidang tersebut dalam model ``Restaurant``, anda dapat membuat ``Restaurant`` memiliki kelas :class:`~django.db.models.OneToOneField` pada ``Place`` (karena sebuah restauran "adalah sebuah" tempat; faktanya, untuk menangani ini anda biasanya menggunakan :ref:`inheritance <model-inheritance>`, yang melibatkan sebuah hubungan jelas one-to-one).

source: As with :class:`~django.db.models.ForeignKey`, a :ref:`recursive relationship <recursive-relationships>` can be defined and :ref:`references to as-yet undefined models <lazy-relationships>` can be made.
id: Seperti :class:`~django.db.models.ForeignKey`, :ref:`recursive relationship <recursive-relationships>` dapat ditentukan dan :ref:`references to as-yet undefined models <lazy-relationships>` dapat dibuat.

source: See the :doc:`One-to-one relationship model example </topics/db/examples/one_to_one>` for a full example.
id: Lihat :doc:`One-to-one relationship model example </topics/db/examples/one_to_one>` untuk contoh penuh.

source: :class:`~django.db.models.OneToOneField` fields also accept an optional :attr:`~django.db.models.OneToOneField.parent_link` argument.
id: Bidang :class:`~django.db.models.OneToOneField` juga menerima sebuah argumen pilihan :attr:`~django.db.models.OneToOneField.parent_link`.

source: :class:`~django.db.models.OneToOneField` classes used to automatically become the primary key on a model. This is no longer true (although you can manually pass in the :attr:`~django.db.models.Field.primary_key` argument if you like). Thus, it's now possible to have multiple fields of type :class:`~django.db.models.OneToOneField` on a single model.
id: :class:`~django.db.models.OneToOneField` digunakan untuk otomatis menjadi primary key pada model. Ini tidak lagi benar (meskipun anda dapat manual melewatkan dalam argumen :attr:`~django.db.models.Field.primary_key` jika anda suka). Dengan demikian, itu sekarang memungkinkan memiliki banyak bidang dari jenis :class:`~django.db.models.OneToOneField` pada model tunggal.

source: Models across files
id: Model-model lintas berkas-berkas

source: It's perfectly OK to relate a model to one from another app. To do this, import the related model at the top of the file where your model is defined. Then, just refer to the other model class wherever needed. For example::
id: Ini sangat OKE untuk menghubungkan model ke satu dari aplikasi lain. Untuk melakukan ini, impor model terkait pada atas dari berkas dimana model anda ditentukan. Kemudian, cukup mengacu ke kelas model lain dimana dibutuhkan. Sebagai contoh::

source: Field name restrictions
id: Batasan bidang nama

source: Django places only two restrictions on model field names:
id: Django menempatkan hanya dua batasan pada model nama bidang:

source: A field name cannot be a Python reserved word, because that would result in a Python syntax error. For example::
id: Sebuah nama bidang tidak dapat berupa sebuah kata cadangan Python, karena itu akan menghasilkan dalam kesalahan sintaksis. Sebagai contoh::

source: A field name cannot contain more than one underscore in a row, due to the way Django's query lookup syntax works. For example::
id: Sebuah nama bidang tidak dapat mengandung lebih dari satu garis bawah dalam sebuah baris, karena cara bekerja sintaksis pencarian permintaan Django. Sebagai contoh::

source: These limitations can be worked around, though, because your field name doesn't necessarily have to match your database column name. See the :attr:`~Field.db_column` option.
id: Batasan-batasan ini dapat dipecahkan, meskipun, karena nama bidang anda tidak butuh harus cocok nama kolom basisdata anda. Lihat pilihan :attr:`~Field.db_column` .

source: SQL reserved words, such as ``join``, ``where`` or ``select``, *are* allowed as model field names, because Django escapes all database table names and column names in every underlying SQL query. It uses the quoting syntax of your particular database engine.
id: Kata-kata pemesan SQL, seperti ``join``, ``where`` atau ``select``, *adalah* diizinkan sebagai nama bidang model, karena Django meloloskan semua nama-nama tabel basisdata dan nama-nama kolom di setiap permintaan SQL pokok. Itu menggunakan sintaksis mengutip dari mesin basisdata tertentu anda.

source: Custom field types
id: Jenis bidang penyesuaian

source: If one of the existing model fields cannot be used to fit your purposes, or if you wish to take advantage of some less common database column types, you can create your own field class. Full coverage of creating your own fields is provided in :doc:`/howto/custom-model-fields`.
id: Jika satu dari bidang-bidang model yang ada tidak dapat digunakan untuk memenuhi tujuan anda, atau jika anda berharap mengambil keuntungan dari beberapa jenis kolom basisdata kurang umum, anda dapat membuat kelas bidang anda sendiri. Cakupan penuh dari membuat bidang-bidang anda sendiri disediakan dalam :doc:`/howto/custom-model-fields`.

source: ``Meta`` options
id: Pilihan ``Meta``

source: Give your model metadata by using an inner ``class Meta``, like so::
id: Memberikan model anda metadata dengan menggunakan ``class Meta`` sebelah dalam, seperti begitu::

source: Model metadata is "anything that's not a field", such as ordering options (:attr:`~Options.ordering`), database table name (:attr:`~Options.db_table`), or human-readable singular and plural names (:attr:`~Options.verbose_name` and :attr:`~Options.verbose_name_plural`). None are required, and adding ``class Meta`` to a model is completely optional.
id: Metadata model adalah "apapun yang bukan sebuah bidang", seperti pilihan pengurutan (:attr:`~Options.ordering`), nama tabel basisdata (:attr:`~Options.db_table`), atau nama-nama tunggal dan jamal dapat-dibaca-manusia (:attr:`~Options.verbose_name` dan :attr:`~Options.verbose_name_plural`). Tidak satupun diwajibkan, dan menambahkan ``class Meta`` pada sebuah model adalah sepenuhnya pilihan.

source: A complete list of all possible ``Meta`` options can be found in the :doc:`model option reference </ref/models/options>`.
id: Daftar lengkap dar semua kemungkinan pilihan ``Meta`` dapat ditemukan dalam :doc:`model option reference </ref/models/options>`.

source: Model attributes
id: Atribut model

source: The most important attribute of a model is the :class:`~django.db.models.Manager`. It's the interface through which database query operations are provided to Django models and is used to :ref:`retrieve the instances <retrieving-objects>` from the database. If no custom ``Manager`` is defined, the default name is :attr:`~django.db.models.Model.objects`. Managers are only accessible via model classes, not the model instances.
id: Atribut paling penting dari sebuah model adalah :class:`~django.db.models.Manager`. Itu adalah antarmuka melalui tindakan permintaan basisdata mana yang disediakan pada model-model dan digunakan pada :ref:`retrieve the instances <retrieving-objects>` dari basisdata. Jika tidak ada penyesuaian ``Manager`` ditentukan, nama awalan adalah :attr:`~django.db.models.Model.objects`. Pengelola hanya dapat diakses melalui kelas-kelas model, bukan instance-instance model.

source: Model methods
id: Cara model

source: Define custom methods on a model to add custom "row-level" functionality to your objects. Whereas :class:`~django.db.models.Manager` methods are intended to do "table-wide" things, model methods should act on a particular model instance.
id: Tentukan metode penyesuaian pada sebuah model untuk menambah fungsionalitas "tingkat-baris" pada obyek-obyek anda. Sedangkan metode :class:`~django.db.models.Manager` dimaksudkan melakukan hal-hal "lebar-tabel", metode model harus bertindak pada instance model tertentu.

source: This is a valuable technique for keeping business logic in one place -- the model.
id: Ini adalah teknik bernilai untuk menjaga logika bisnis dalam satu tempat -- model.

source: For example, this model has a few custom methods::
id: Sebagai contoh, model ini mempunyai beberapa cara penyesuaian::

source: The last method in this example is a :term:`property`.
id: Cara terakhir di contoh ini adalah :term:`property`.

source: The :doc:`model instance reference </ref/models/instances>` has a complete list of :ref:`methods automatically given to each model <model-instance-methods>`. You can override most of these -- see `overriding predefined model methods`_, below -- but there are a couple that you'll almost always want to define:
id: :doc:`model instance reference </ref/models/instances>` mempunyai daftar lengkap dari :ref:`methods automatically given to each model <model-instance-methods>`. Anda dapat menimpa kebanyakan dari ini -- lihat `overriding predefined model methods`_, dibawah -- tetapi ada sepasang yang anda akan hampir selalu ingin tentukan:

source: A Python "magic method" that returns a string representation of any object. This is what Python and Django will use whenever a model instance needs to be coerced and displayed as a plain string. Most notably, this happens when you display an object in an interactive console or in the admin.
id: "magic methode" Python yang mengembalikan sebuah string mewakili obyek apapun. Ini adalah apa Python dan Django akan gunakan ketika sebuah instance model butuh dipaksa dan ditampilkan sebagai sebuah string kosong. Kebanyakan terutama, ini terjadi ketika anda menampilkan sebuah obyek dalam sebuah konsol interaktif atau dalam admin.

source: You'll always want to define this method; the default isn't very helpful at all.
id: Anda akan selalu ingin menentukan cara ini; cara awal tidak membantu sama sekali.

source: This tells Django how to calculate the URL for an object. Django uses this in its admin interface, and any time it needs to figure out a URL for an object.
id: Ini memberitahu Django bagaimana menghitung URL untuk sebuah obyek. Django menggunakan ini dalam antarmuka adminnya, dan kapan pun itu butuh mencari tahu untuk sebuah obyek.

source: Any object that has a URL that uniquely identifies it should define this method.
id: Obyek apapun yang mempunyai sebuah URL yang unik mencirikan itu harus menentukan metode ini.

source: Overriding predefined model methods
id: Menimpa metode model yang detetapkan

source: There's another set of :ref:`model methods <model-instance-methods>` that encapsulate a bunch of database behavior that you'll want to customize. In particular you'll often want to change the way :meth:`~Model.save` and :meth:`~Model.delete` work.
id: Ada kumpulan lain dari :ref:`model methods <model-instance-methods>` yang mengenkapsulasi sekolompok perilaku basisdata yang anda akan ingin sesuaikan. Khususnya anda akan sering ingin dirubah merubah cara :meth:`~Model.save` dan :meth:`~Model.delete` bekerja.

source: You're free to override these methods (and any other model method) to alter behavior.
id: Anda bebas untuk menimpa metode ini (dan cara model lainnya) untuk merubah perilaku.

source: A classic use-case for overriding the built-in methods is if you want something to happen whenever you save an object. For example (see :meth:`~Model.save` for documentation of the parameters it accepts)::
id: Sebuah penggunaan-kasus klasik untuk menimpa metode-metode siap pakai jika anda ingin sesuatu terjadi ketika anda menyimpan sebuah obyek. Sebagai contoh (lihat :meth:`~Model.save` untuk dokumentasi dari parameter-parameter itu terima)::

source: You can also prevent saving::
id: Anda dapat juga mencegah mengatakan::

source: It's important to remember to call the superclass method -- that's that ``super().save(*args, **kwargs)`` business -- to ensure that the object still gets saved into the database. If you forget to call the superclass method, the default behavior won't happen and the database won't get touched.
id: Itu adalah penting diingat untuk memanggil metode super kelas -- yaitu bahwa bisnis ``super().save(*args, **kwargs)`` -- memastikan bahwa obyek masih mendapatkan tersimpan kedalam basisdata. Jika anda lupa memanggil metode superkelas, perilaku awalan tidak akan terjadi dan basisdata tidak akan disentuh.

source: It's also important that you pass through the arguments that can be passed to the model method -- that's what the ``*args, **kwargs`` bit does. Django will, from time to time, extend the capabilities of built-in model methods, adding new arguments. If you use ``*args, **kwargs`` in your method definitions, you are guaranteed that your code will automatically support those arguments when they are added.
id: Itu juga penting bahwa anda melewati argumen yang dapat diloloskan ke metode model -- yaitu apa ``*args, **kwargs`` sedikit lakukan, Django akan, dari waktu ke waktu, memperpanjang kemampuan metode model siap-pakai, menambahkan argumen-argumen baru. Jika anda menggunakan ``*args, **kwargs`` dalam pengertian metode anda, anda dijamin bahwa kode anda akan otomatis mendukung argumen-argumen tersebut ketika mereka ditambahkan.

source: Overridden model methods are not called on bulk operations
id: Menimpa metode-metode model tidak dipanggil pada tindakan massal

source: Note that the :meth:`~Model.delete()` method for an object is not necessarily called when :ref:`deleting objects in bulk using a QuerySet <topics-db-queries-delete>` or as a result of a :attr:`cascading delete <django.db.models.ForeignKey.on_delete>`. To ensure customized delete logic gets executed, you can use :data:`~django.db.models.signals.pre_delete` and/or :data:`~django.db.models.signals.post_delete` signals.
id: Catat bahwa metode :meth:`~Model.delete()` untuk sebuah obyej tidak dibutuhkan dipanggil ketika :ref:`deleting objects in bulk using a QuerySet <topics-db-queries-delete>` atau sebagai sebuah hasil dari sebuah :attr:`cascading delete <django.db.models.ForeignKey.on_delete>`. Untuk memastikan penyesuaian logika hapus dijalankan, anda dapat menggunakan sinyal :data:`~django.db.models.signals.pre_delete` dan/atau :data:`~django.db.models.signals.post_delete`.

source: Unfortunately, there isn't a workaround when :meth:`creating<django.db.models.query.QuerySet.bulk_create>` or :meth:`updating<django.db.models.query.QuerySet.update>` objects in bulk, since none of :meth:`~Model.save()`, :data:`~django.db.models.signals.pre_save`, and :data:`~django.db.models.signals.post_save` are called.
id: Sayangnya tidak ada pemecahan ketika obyek :meth:`creating<django.db.models.query.QuerySet.bulk_create>` atau :meth:`updating<django.db.models.query.QuerySet.update>` dalam jumlah besar, sejak tidak satupun dari :meth:`~Model.save()`, :data:`~django.db.models.signals.pre_save`, dan :data:`~django.db.models.signals.post_save` dipanggil.

source: Executing custom SQL
id: Menjalankan penyesuaian SQL

source: Another common pattern is writing custom SQL statements in model methods and module-level methods. For more details on using raw SQL, see the documentation on :doc:`using raw SQL</topics/db/sql>`.
id: Pola umum lain sdang menulis pernyataan SQL penyesuaian dalam metode-metode model dan metode-metode tingkat-modul. Untuk rincian lebih pada menggunakan SQL mentah, lihat dokumentasi pada :doc:`using raw SQL</topics/db/sql>`.

source: Model inheritance
id: Model warisan

source: Model inheritance in Django works almost identically to the way normal class inheritance works in Python, but the basics at the beginning of the page should still be followed. That means the base class should subclass :class:`django.db.models.Model`.
id: Warisan model dalam Django bekerja hampir sama pada cara biasa warisan kelas bekerja dalam Python, tetapi dasar-dasar pada permulaan dari halaman harus masih diikuti. Itu berarti kelas dasar harus mensubkelaskan :class:`django.db.models.Model`.

source: The only decision you have to make is whether you want the parent models to be models in their own right (with their own database tables), or if the parents are just holders of common information that will only be visible through the child models.
id: Satu-satunya keputusan yang anda punya untuk membuat apakah anda ingin model-model induk menjadi model-model dalam hak mereka sendiri (dengan tabel-tabel basisdata mereka sendiri), atau jika induk hanya menampung dari informasi umum yang akan hanya nampak melalui model-model anak.

source: There are three styles of inheritance that are possible in Django.
id: Ada tiga gaya warisan yang mungkin di Django.

source: Often, you will just want to use the parent class to hold information that you don't want to have to type out for each child model. This class isn't going to ever be used in isolation, so :ref:`abstract-base-classes` are what you're after.
id: Sering, anda akan hanya ingin menggunakan kelas induk untuk menampung informasi yang anda tidak ingin miliki untuk mengetikkan setiap model anak. Kelas ini tidak akan pernah digunakan dalam pengasingan, jadi :ref:`abstract-base-classes` adalah apa yang anda kejar.

source: If you're subclassing an existing model (perhaps something from another application entirely) and want each model to have its own database table, :ref:`multi-table-inheritance` is the way to go.
id: Jika anda sedang mensubkelaskan sebuah model yang ada (mungkin sesuatu dari aplikasi lain seluruhnya) dan ingin setiap model memiliki tabel basisdata itu sendiri, :ref:`multi-table-inheritance` adalah cara untuk pergi.

source: Finally, if you only want to modify the Python-level behavior of a model, without changing the models fields in any way, you can use :ref:`proxy-models`.
id: Akhirnya, jika anda hanya ingin merubah perilaku tingkat-Python dari sebuah model, tanpa merubah bidang-bidang model dalam cara apapun, anda dapat menggunakan :ref:`proxy-models`.

source: Abstract base classes
id: Kelas-kelas dasar abstrak

source: An example::
id: Sebuah contoh::
