Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The :setting:`settings.LOGIN_URL <LOGIN_URL>` also accepts view function names and :ref:`named URL patterns <naming-url-patterns>`. This allows you to freely remap your login view within your URLconf without having to update the setting.
id: :setting:`settings.LOGIN_URL <LOGIN_URL>` juga menerima nama-nama fungsi tampilan dan :ref:`named URL patterns <naming-url-patterns>`. Ini mengizinkan anda secara bebas memetakan kembali ke tampilan masuk anda dalam URLconf tanpa harus memperbaharui pengaturan.

source: The ``login_required`` decorator does NOT check the ``is_active`` flag on a user, but the default :setting:`AUTHENTICATION_BACKENDS` reject inactive users.
id: Penghias ``login_required`` TIDAK memeriksa bendera ``is_active`` pada pengguna, tetapi awalan :setting:`AUTHENTICATION_BACKENDS` menolak pengguna tidak aktif.

source: If you are writing custom views for Django's admin (or need the same authorization check that the built-in views use), you may find the :func:`django.contrib.admin.views.decorators.staff_member_required` decorator a useful alternative to ``login_required()``.
id: Jika anda sedang menulis tampilan penyesuaian untuk Django admin (atau butuh pemeriksaan otorisasi sama bahwa tampilan pasang-tetap digunakan), anda mungkin menemukan penghias :func:`django.contrib.admin.views.decorators.staff_member_required` cara lain yang berguna pada ``login_required()``.

source: The ``LoginRequired`` mixin
id: Mixin ``LoginRequired``

source: When using :doc:`class-based views </topics/class-based-views/index>`, you can achieve the same behavior as with ``login_required`` by using the ``LoginRequiredMixin``. This mixin should be at the leftmost position in the inheritance list.
id: Ketika menggunakan :doc:`class-based views </topics/class-based-views/index>`, anda dapat mencapai kebiasaan lama seperti dengan ``login_required`` dengan menggunakan ``LoginRequiredMixin``. Mixin harus di tempat paling kanan di daftar warisan.

source: If a view is using this mixin, all requests by non-authenticated users will be redirected to the login page or shown an HTTP 403 Forbidden error, depending on the :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception` parameter.
id: Jika sebuah tampilan menggunakan mixin ini, semua permintaan oleh pengguna bukan-terotentifikasi akan dialihkan ke halaman masuk atau menampilkan kesalahan HTTP 403 Forbidden, tergantung pada parameter :attr:`~django.contrib.auth.mixins.AccessMixin.raise_exception`.

source: You can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users::
id: Anda dapat menyetel tiap dari parameter dari :class:`~django.contrib.auth.mixins.AccessMixin` untuk menyesuaikan menangani dari pengguna tidak sah::

source: Just as the ``login_required`` decorator, this mixin does NOT check the ``is_active`` flag on a user, but the default :setting:`AUTHENTICATION_BACKENDS` reject inactive users.
id: Seperti penghias ``login_required`` mixin ini TIDAK memeriksa bendera ``is_active`` pada pengguna, tetapi awalan :setting:`AUTHENTICATION_BACKENDS` menolak pengguna tidak aktif.

source: Limiting access to logged-in users that pass a test
id: Membatasi akses ke pengguna masuk yang melewatkan percobaan

source: To limit access based on certain permissions or some other test, you'd do essentially the same thing as described in the previous section.
id: Untuk membatasi akses berdasarkan pada perizinan tertentu atau beberapa percobaan lain, anda akan melakukan pada dasarnya hal sama seperti digambarkan di bagian sebelumnya.

source: The simple way is to run your test on :attr:`request.user <django.http.HttpRequest.user>` in the view directly. For example, this view checks to make sure the user has an email in the desired domain and if not, redirects to the login page::
id: Cara termudah untuk menjalankan percobaan anda pada :attr:`request.user <django.http.HttpRequest.user>` di tampilan secara langsung. Sebagai contoh, tampilan ini memeriksa untuk memastikan pengguna mempunyai sebuah surel di ranah yang diinginkan dan jika tidak, dialihkan ke halaman masuk::

source: As a shortcut, you can use the convenient ``user_passes_test`` decorator which performs a redirect when the callable returns ``False``::
id: Sebagai sebuah jalan pintas, anda dapat menggunakan penghias ``user_passes_test`` yang cocok yang melakukan sebuah pengalihan ketika callable mengembalikan ``False``::

source: :func:`~django.contrib.auth.decorators.user_passes_test` takes a required argument: a callable that takes a :class:`~django.contrib.auth.models.User` object and returns ``True`` if the user is allowed to view the page. Note that :func:`~django.contrib.auth.decorators.user_passes_test` does not automatically check that the :class:`~django.contrib.auth.models.User` is not anonymous.
id: :func:`~django.contrib.auth.decorators.user_passes_test` mengambil argumen wajib: sebuah callable yang mengambil obyek :class:`~django.contrib.auth.models.User` dan mengembalikan ``True`` jika pengguna diizinkan melihat halaman. Catat bahwa :func:`~django.contrib.auth.decorators.user_passes_test` tidak secara otomatis memeriksa bahwa the :class:`~django.contrib.auth.models.User` bukan anonim.

source: :func:`~django.contrib.auth.decorators.user_passes_test` takes two optional arguments:
id: :func:`~django.contrib.auth.decorators.user_passes_test` mengambil dua argumen pilihan:

source: Lets you specify the URL that users who don't pass the test will be redirected to. It may be a login page and defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>` if you don't specify one.
id: Biarkan anda menentukan URL yang pengguna tidak melewati percobaan akan dialihkan. Itu mungkin halaman masuk dan awalan ke :setting:`settings.LOGIN_URL <LOGIN_URL>` jika anda tidak menentukan satu.

source: Same as for :func:`~django.contrib.auth.decorators.login_required`. Setting it to ``None`` removes it from the URL, which you may want to do if you are redirecting users that don't pass the test to a non-login page where there's no "next page".
id: Sama seperti :func:`~django.contrib.auth.decorators.login_required`. Atur itu ke ``None`` memindahkannya dari URL, yang anda mungkin ingin melakukannya jika anda mengalihkan pengguna yang tidak melewati percobaan ke halaman bukan-masuk dimana tidak ada "next page".

source: For example::
id: Sebagai contoh::

source: When using :doc:`class-based views </topics/class-based-views/index>`, you can use the ``UserPassesTestMixin`` to do this.
id: Ketika menggunakan :doc:`class-based views </topics/class-based-views/index>`, anda dapat menggunakan ``UserPassesTestMixin`` untuk melakukan ini.

source: You have to override the ``test_func()`` method of the class to provide the test that is performed. Furthermore, you can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users::
id: Anda harus menimpa metode ``test_func()`` dari kelas untuk menyediakan percobaan yang dilakukan. Lebih lanjut, anda dapat menyetel tiap parameter dari :class:`~django.contrib.auth.mixins.AccessMixin` untuk menyesuaikan penangangan dari pengguna tidak sah::

source: You can also override the ``get_test_func()`` method to have the mixin use a differently named function for its checks (instead of :meth:`test_func`).
id: Anda dapat juga menimpa metode ``get_test_func()`` untuk memiliki penggunaan mixin fungsi bernama berbeda untuk pemeriksaannya (sebagai ganti :meth:`test_func`).

source: Stacking ``UserPassesTestMixin``
id: Menumpuk ``UserPassesTestMixin``

source: Due to the way ``UserPassesTestMixin`` is implemented, you cannot stack them in your inheritance list. The following does NOT work::
id: Diakrenakan cara ``UserPassesTestMixin`` diterapkan, anda tida dapat menumpuk mereka di daftar warisan anda. Berikut TIDAK bekerja::

source: If ``TestMixin1`` would call ``super()`` and take that result into account, ``TestMixin1`` wouldn't work standalone anymore.
id: Jika ``TestMixin1`` akan memanggil ``super()`` dan mengambil hasi itu kedalam akun, ``TestMixin1`` tidak akan bekerja berdiri sendiri lagi.

source: The ``permission_required`` decorator
id: Penghias ``permission_required``

source: It's a relatively common task to check whether a user has a particular permission. For that reason, Django provides a shortcut for that case: the :func:`~django.contrib.auth.decorators.permission_required()` decorator.::
id: Itu adalah cara lain tugas umum untuk memeriksa apakah seorang pengguna mempunyai perizinan khusus. Untuk alasan tersebut, Django menyediakan jalan pintas untuk kasus itu: penghias the :func:`~django.contrib.auth.decorators.permission_required()`.::

source: Just like the :meth:`~django.contrib.auth.models.User.has_perm` method, permission names take the form ``"<app label>.<permission codename>"`` (i.e. ``polls.can_vote`` for a permission on a model in the ``polls`` application).
id: Sama seperti metode :meth:`~django.contrib.auth.models.User.has_perm`, nama-nama perizinan mengambil formulir ``"<app label>.<permission codename>"`` (yaitu ``polls.can_vote`` untuk perizinan pada model di apliaksi ``polls``).

source: The decorator may also take an iterable of permissions, in which case the user must have all of the permissions in order to access the view.
id: Penghias mungkin juga mengambil perizinan berulang, dalam hal ini pengguna harus memiliki semua perizinan untuk mengakses tampilan.

source: Note that :func:`~django.contrib.auth.decorators.permission_required()` also takes an optional ``login_url`` parameter::
id: Catat bahwa :func:`~django.contrib.auth.decorators.permission_required()` juga mengambil sebuah pilihan parameter ``login_url``::

source: As in the :func:`~django.contrib.auth.decorators.login_required` decorator, ``login_url`` defaults to :setting:`settings.LOGIN_URL <LOGIN_URL>`.
id: Ketika di penghias :func:`~django.contrib.auth.decorators.login_required`, awalan ``login_url`` ke :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: If the ``raise_exception`` parameter is given, the decorator will raise :exc:`~django.core.exceptions.PermissionDenied`, prompting :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` instead of redirecting to the login page.
id: Jika parameter ``raise_exception`` diberikan, penghias akan memunculkan :exc:`~django.core.exceptions.PermissionDenied`, mendorong :ref:`the 403 (HTTP Forbidden) view<http_forbidden_view>` daripada mengalihkan ke halaman masuk.

source: If you want to use ``raise_exception`` but also give your users a chance to login first, you can add the :func:`~django.contrib.auth.decorators.login_required` decorator::
id: Jika anda ingin menggunakan ``raise_exception`` tetapi juga memberikan pengguna anda kesempatan untuk masuk terlebih dahulu, anda dapat menambahkan penghias :func:`~django.contrib.auth.decorators.login_required`::

source: The ``PermissionRequiredMixin`` mixin
id: Mixin ``PermissionRequiredMixin``

source: To apply permission checks to :doc:`class-based views </ref/class-based-views/index>`, you can use the ``PermissionRequiredMixin``:
id: Untuk memberlakukan pemeriksaan perizinan pada :doc:`class-based views </ref/class-based-views/index>`, anda dapat menggunakan ``PermissionRequiredMixin``:

source: This mixin, just like the ``permission_required`` decorator, checks whether the user accessing a view has all given permissions. You should specify the permission (or an iterable of permissions) using the ``permission_required`` parameter::
id: Mixin ini, seperti penghias ``permission_required``, memeriksa apakah pengguna mengakses sebuah tampilan mempunyai semua perizinan yang diberikan. Anda harus menentukan perizinan (atau perulangan dari perizinan) menggunakan parameter ``permission_required``::

source: You can set any of the parameters of :class:`~django.contrib.auth.mixins.AccessMixin` to customize the handling of unauthorized users.
id: Anda dapat menyetel tiap dari parameter dari :class:`~django.contrib.auth.mixins.AccessMixin` untuk menyesuaikan menangani dari pengguna tidak sah.

source: You may also override these methods:
id: Anda dapat juga menimpa metode ini:

source: Returns an iterable of permission names used by the mixin. Defaults to the ``permission_required`` attribute, converted to a tuple if necessary.
id: Mengembalikan perulangan dari nama perizinan digunakan oleh mixin. Awalan pada atribut ``permission_required``, dirubah ke sebuah tuple juka memungkinkan.

source: Returns a boolean denoting whether the current user has permission to execute the decorated view. By default, this returns the result of calling :meth:`~django.contrib.auth.models.User.has_perms()` with the list of permissions returned by :meth:`get_permission_required()`.
id: Mengembalikan sebuah boolean menunjukkan apakah pengguna saat ini mempunyai perizinan untuk menjalankan tampilan dihiasi. Secara awalan, ini mengembalikan hasil dari memanggil :meth:`~django.contrib.auth.models.User.has_perms()` dengan daftar perizinan dikembalikan oleh :meth:`get_permission_required()`.

source: Redirecting unauthorized requests in class-based views
id: Mengalihkan permintaan tidak sah di tampilan berdasarkan-kelas

source: Default return value for :meth:`get_login_url`. Defaults to ``None`` in which case :meth:`get_login_url` falls back to :setting:`settings.LOGIN_URL <LOGIN_URL>`.
id: Nilai balik awalan untuk :meth:`get_login_url`. Awalan pada ``None`` dalam hal ini :meth:`get_login_url` jatuh kebelakang untuk :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: Default return value for :meth:`get_permission_denied_message`. Defaults to an empty string.
id: Nilai balik awalan untuk :meth:`get_permission_denied_message`. Awalan pada sebuah deretan karakter kosong.

source: Default return value for :meth:`get_redirect_field_name`. Defaults to ``"next"``.
id: Nilai balikan awalan untuk :meth:`get_redirect_field_name`. Awalan ke ``"next"``.

source: Returns the URL that users who don't pass the test will be redirected to. Returns :attr:`login_url` if set, or :setting:`settings.LOGIN_URL <LOGIN_URL>` otherwise.
id: Mengembalikan URL yang pengguna tidak melewati percobaan akan dialihkan. Mengembalikan :attr:`login_url` jika disetel, atau sebaliknya :setting:`settings.LOGIN_URL <LOGIN_URL>`.

source: When :attr:`raise_exception` is ``True``, this method can be used to control the error message passed to the error handler for display to the user. Returns the :attr:`permission_denied_message` attribute by default.
id: Ketika :attr:`raise_exception` adalah ``True``, metode ini dapat digunakan untuk mengendalikan pesan kesalahan dilewatkan ke penangan kesalahan untuk menampilkan ke pengguna. Mengembalikan atribut :attr:`permission_denied_message` secara awalan.

source: Returns the name of the query parameter that will contain the URL the user should be redirected to after a successful login. If you set this to ``None``, a query parameter won't be added. Returns the :attr:`redirect_field_name` attribute by default.
id: Mengembalikan nama dari permintaan parameter yang akan mengandung URL pengguna harus dialihkan setelah berhasil masuk. Jika anda menyetel ini ke ``None``, sebuah permintaan parameter tidak akan ditambahkan. Mengembalikan atribut :attr:`redirect_field_name` secara awalan.

source: Depending on the value of ``raise_exception``, the method either raises a :exc:`~django.core.exceptions.PermissionDenied` exception or redirects the user to the ``login_url``, optionally including the ``redirect_field_name`` if it is set.
id: Tergantung pada nilai dari ``raise_exception``, metode antara memunculkan pengecualian :exc:`~django.core.exceptions.PermissionDenied` atau mengalihkan pengguna ke ``login_url``, secara pilihan menyertakan ``redirect_field_name`` jika itu disetel.

source: Session invalidation on password change
id: Penghapusan sesi pada perubahan sandi

source: If your :setting:`AUTH_USER_MODEL` inherits from :class:`~django.contrib.auth.models.AbstractBaseUser` or implements its own :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` method, authenticated sessions will include the hash returned by this function. In the :class:`~django.contrib.auth.models.AbstractBaseUser` case, this is an HMAC of the password field. Django verifies that the hash in the session for each request matches the one that's computed during the request. This allows a user to log out all of their sessions by changing their password.
id: Jika :setting:`AUTH_USER_MODEL` anda warisan dari :class:`~django.contrib.auth.models.AbstractBaseUser` atau menerapkan metode :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` miliknya, sesi terotentifikasi akan menyertakan campuran dikembalikan oleh fungsi ini. Di kasus :class:`~django.contrib.auth.models.AbstractBaseUser`, ini adalah HMAC dari bidang sandi. Django memeriksa bahwa campuran di sesi untuk setiap permintaan cocok satu yang dihitung selama permintaan. Ini mengizinkan pengguna untuk keluar dari sesi mereka dengan merubah sandi mereka.

source: The default password change views included with Django, :class:`~django.contrib.auth.views.PasswordChangeView` and the ``user_change_password`` view in the :mod:`django.contrib.auth` admin, update the session with the new password hash so that a user changing their own password won't log themselves out. If you have a custom password change view and wish to have similar behavior, use the :func:`update_session_auth_hash` function.
id: Tampilan rubah sandi awalan disertakan dengan Django, tampilan :class:`~django.contrib.auth.views.PasswordChangeView` dan the ``user_change_password`` dalam admin :mod:`django.contrib.auth`, perbaharui sesi dengan campuran sandi baru sehingga pengguna merubah sandi mereka sendiri tidak keluar. Jika anda mempunyai tampilan rubah sandi penyesuaian dan berharap memiliki perilaku sama, gunakan fungsi :func:`update_session_auth_hash`.

source: This function takes the current request and the updated user object from which the new session hash will be derived and updates the session hash appropriately. It also rotates the session key so that a stolen session cookie will be invalidated.
id: Fungsi ini mengambil permintaan saat ini dan memperbaharui obyek user dari dimana campuran sesi baru akan berasal dan memperbaharui campuran sesi dengan benar. Itu juga memutar kunci sesi sehingga kue sesi tercuri akan menjadi tidak sah.

source: Example usage::
id: Contoh penggunaan:

source: Since :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` is based on :setting:`SECRET_KEY`, updating your site to use a new secret will invalidate all existing sessions.
id: Sejak :meth:`~django.contrib.auth.models.AbstractBaseUser.get_session_auth_hash()` adalah berdasarkan pada :setting:`SECRET_KEY`, memperbaharui situs anda untuk menggunakan rahasia baru akan menghapus semua sesi yang ada.

source: Authentication Views
id: Tampilan Otentifikasi

source: Django provides several views that you can use for handling login, logout, and password management. These make use of the :ref:`stock auth forms <built-in-auth-forms>` but you can pass in your own forms as well.
id: Django menyediakan beberapa tampilan yang anda dapat gunakan untuk menangani masuk, keluarm dan pengelolaan sandi. Ini menggunakan dari :ref:`stock auth forms <built-in-auth-forms>` tetapi anda dapat melewatkan nya ke dalam formulir anda sendiri juga.

source: Django provides no default template for the authentication views. You should create your own templates for the views you want to use. The template context is documented in each view, see :ref:`all-authentication-views`.
id: Django menyediakan tidak ada awalan cetakan untuk tampilan otentifikasi. Anda harus membuat cetakan anda sendiri untuk tampilan anda ingin gunakan. Konteks cetakan adalah terdokumentasi di setiap tampilan, lihat :ref:`all-authentication-views`.

source: Using the views
id: Menggunakan tamplian

source: There are different methods to implement these views in your project. The easiest way is to include the provided URLconf in ``django.contrib.auth.urls`` in your own URLconf, for example::
id: Ada perbedaan metode untuk menerapkan tampilan ini di proyek anda. Cara termudah adalah menyertakan URLconf yang disediakan di ``django.contrib.auth.urls`` dalam URLConf anda sendiri, sebagai contoh::

source: This will include the following URL patterns::
id: Ini akan menyertakan pola URL berikut::

source: The views provide a URL name for easier reference. See :doc:`the URL documentation </topics/http/urls>` for details on using named URL patterns.
id: Tampilan menyediakan nama URL untuk acuan lebih mudah. Lihat :doc:`the URL documentation </topics/http/urls>` untuk rincian pada menggunakan corak URL bernama.

source: If you want more control over your URLs, you can reference a specific view in your URLconf::
id: Jika anda ingin kendali lebih terhadap URL anda, anda dapat mengacu tampilan khusus di URLconf::

source: The views have optional arguments you can use to alter the behavior of the view. For example, if you want to change the template name a view uses, you can provide the ``template_name`` argument. A way to do this is to provide keyword arguments in the URLconf, these will be passed on to the view. For example::
id: Tampilan mempunyai argumen pilihan anda dapat gunakan untuk merubah kebiasaan dari tampilan. Sebagai contoh, jika anda ingin merubah nama cetakan tampilan kegunaan, anda dapat menyediakan argumen ``template_name``. Sebuah cara untuk melakukan ini adalah menyediakan argumen kata kunci dalam URLconf, ini akan dilewatkan ke tampilan. Sebagai contoh::

source: All views are :doc:`class-based </topics/class-based-views/index>`, which allows you to easily customize them by subclassing.
id: Semua tampilan adalah :doc:`class-based </topics/class-based-views/index>`, yang mengizinkan anda dengan mudah menyesuaikan mereka dengan mensubkelaskan.

source: All authentication views
id: Semua tempilan otentifikasi

source: This is a list with all the views ``django.contrib.auth`` provides. For implementation details see :ref:`using-the-views`.
id: Ini adalah daftar dengan semua tamilan ``django.contrib.auth`` sediakan. Untuk penerapan rincian lihat :ref:`using-the-views`.

source: **URL name:** ``login``
id: **Nama URL:** ``masuk``

source: See :doc:`the URL documentation </topics/http/urls>` for details on using named URL patterns.
id: Lihat :doc:`the URL documentation </topics/http/urls>` untuk rincian pada menggunakan corak URL bernama.

source: **Attributes:**
id: **Atribut**

source: ``template_name``: The name of a template to display for the view used to log the user in. Defaults to :file:`registration/login.html`.
id: ``template_name``: Nama dari cetakan untuk ditampilkan untuk tampilan digunakan untuk pengguna masuk. Awalan ke :file:`registration/login.html`.

source: ``redirect_field_name``: The name of a ``GET`` field containing the URL to redirect to after login. Defaults to ``next``.
id: ``redirect_field_name``: Nama dari bidang ``GET`` mengandung URL untuk mengalihkan setelah masuk. Awalan ke ``next``.

source: ``authentication_form``: A callable (typically just a form class) to use for authentication. Defaults to :class:`~django.contrib.auth.forms.AuthenticationForm`.
id: ``authentication_form``:Sebuah callable (khususnya hanya kelas formulir) untuk menggunakan otentifikasi. Awalan pada :class:`~django.contrib.auth.forms.AuthenticationForm`.

source: ``extra_context``: A dictionary of context data that will be added to the default context data passed to the template.
id: ``extra_context``: Sebuah kamus dari data konteks yang akan ditambahkan ke data konteks awalan dilewatkan ke cetakan.
