Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Customizing authentication in Django
id: Mengkostumisasi autentikasi di Django

source: The authentication that comes with Django is good enough for most common cases, but you may have needs not met by the out-of-the-box defaults. Customizing authentication in your projects requires understanding what points of the provided system are extensible or replaceable. This document provides details about how the auth system can be customized.
id: Autentikasi yang telah disediakan Django sudah cukup baik untuk kasus-kasus pada umumnya, tetapi Anda mungkin memiliki kebutuhan yang tidak dipenuhi oleh fitur bawaan. Mengkostumisasi otentikasi pada proyek-proyek anda membutuhkan pengertian atas bagian-bagian tersedia yang dapat diturunkan atau diubah. Dokumen ini menyediakan detil tentang bagaimana sitem otentikasi dapat dikostumisasi.

source: :ref:`Authentication backends <authentication-backends>` provide an extensible system for when a username and password stored with the user model need to be authenticated against a different service than Django's default.
id: :ref:`Authentication backends <authentication-backends>` menyediakan sebuah sistem yang dapat diperpanjang untuk ketika nama pengguna dan sandi disimpan dengan model pengguna butuh untuk diotentifikasi terhadap layanan berbeda dari awalan Django.

source: You can give your models :ref:`custom permissions <custom-permissions>` that can be checked through Django's authorization system.
id: Anda dapat memberikan model anda perizinan :ref:`custom permissions <custom-permissions>` yang dapat diperiksa melalui sistem otorisasi Django.

source: You can :ref:`extend <extending-user>` the default ``User`` model, or :ref:`substitute <auth-custom-user>` a completely customized model.
id: Anda dapat :ref:`extend <extending-user>` awalan model ``User``, atau :ref:`substitute <auth-custom-user>` sepenuhnya model disesuaikan.

source: Other authentication sources
id: Sumber pembuktian keaslian lain

source: There may be times you have the need to hook into another authentication source -- that is, another source of usernames and passwords or authentication methods.
id: Mungkin ada kali anda harus butuh mengait ke dalam sumber pembuktian keaslian lain -- yaitu, sumber lain dari nama pengguna dan sandi atau metode pembuktian keaslian.

source: For example, your company may already have an LDAP setup that stores a username and password for every employee. It'd be a hassle for both the network administrator and the users themselves if users had separate accounts in LDAP and the Django-based applications.
id: Sebagai contoh, perusahaan anda mungkin sudah mempunyai pengaturan LDAP yang menyimpan nama pengguna dan sandi untuk setiap karyawan. Itu akan menjadi cekcok untuk kedua administrator jaringan dan pengguna nya sendiri jika pengguna mempunyai akun terpisah di LDAP dan aplikasi berbasis-Django.

source: So, to handle situations like this, the Django authentication system lets you plug in other authentication sources. You can override Django's default database-based scheme, or you can use the default system in tandem with other systems.
id: Jadi, untuk menangani keadaan seperti ini, sistem pembuktian keaslian Django membiarkan anda memasang sumber pembuktian keaslian lain. Anda dapat menimpa skema berbasis-basisdata awal Django, atau anda dapat menggunakan sistem awal untuk dipasangkan dengan sistem lain.

source: See the :ref:`authentication backend reference <authentication-backends-reference>` for information on the authentication backends included with Django.
id: Lihat :ref:`authentication backend reference <authentication-backends-reference>` untuk informasi pada backend otentifikasi yang disertakan dengan Django.

source: Specifying authentication backends
id: Menentukan backend pembuktian keaslian

source: Behind the scenes, Django maintains a list of "authentication backends" that it checks for authentication. When somebody calls :func:`django.contrib.auth.authenticate()` -- as described in :ref:`How to log a user in <how-to-log-a-user-in>` -- Django tries authenticating across all of its authentication backends. If the first authentication method fails, Django tries the second one, and so on, until all backends have been attempted.
id: Dibelakang layar, Django merawat daftar "backend pembuktian keaslian" yang dia periksa untuk pembuktian keaslian. Ketika seseorang memanggil :func:`django.contrib.auth.authenticate()` -- seperti digambarkan di :ref:`How to log a user in <how-to-log-a-user-in>` -- Django mencoba membuktikan keaslian disemua bakcend pembuktian keaslian itu. Jika metode pembuktian keaslian pertama gagal, Django mencoba yang kedua, dan selanjutnya, sampai semua backend telah dicoba.

source: The list of authentication backends to use is specified in the :setting:`AUTHENTICATION_BACKENDS` setting. This should be a list of Python path names that point to Python classes that know how to authenticate. These classes can be anywhere on your Python path.
id: Daftar backend pembuktian keaslian untuk digunakan ditentukan dalam pengaturan :setting:`AUTHENTICATION_BACKENDS`. Ini seharusnya daftar nama jalur Python yang menunjuk ke kelas Python yang mengetahui bagaimana membuktikan keaslian. Kelas ini dapat berada dimanapun di jalur Python anda.

source: By default, :setting:`AUTHENTICATION_BACKENDS` is set to::
id: Secara awal, :setting:`AUTHENTICATION_BACKENDS` disetel ke::

source: That's the basic authentication backend that checks the Django users database and queries the built-in permissions. It does not provide protection against brute force attacks via any rate limiting mechanism. You may either implement your own rate limiting mechanism in a custom auth backend, or use the mechanisms provided by most Web servers.
id: Itu adalah backend pembuktian keaslian dasar yang memeriksa basisdata pengguna Django dan permintaan perizinan siap-pakai. Dia tidak menyediakan perlindungan terhadap serangan paksa brutal melalui mekanisme pembatasan apapun. Anda dapat salah satu menerapkan mekanisme pembatasan laju anda sendiri di backend pembuktian keaslian penyesuaian, atau menggunakan mekanisme yang disediakan oleh kebanyakan peladen Jaringan.

source: The order of :setting:`AUTHENTICATION_BACKENDS` matters, so if the same username and password is valid in multiple backends, Django will stop processing at the first positive match.
id: Urutan masalah :setting:`AUTHENTICATION_BACKENDS`, jadi jika nama pengguna dan sandi sama adalah sah di banyak backend, Django akan menghentikan pengolahan pada pertama yang positif cocok.

source: If a backend raises a :class:`~django.core.exceptions.PermissionDenied` exception, authentication will immediately fail. Django won't check the backends that follow.
id: Jika backend memunculkan pengecualian :class:`~django.core.exceptions.PermissionDenied`, pembuktian keaslian akan segera gagal. Django tidak akan memeriksa backend yang mengikuti.

source: Once a user has authenticated, Django stores which backend was used to authenticate the user in the user's session, and re-uses the same backend for the duration of that session whenever access to the currently authenticated user is needed. This effectively means that authentication sources are cached on a per-session basis, so if you change :setting:`AUTHENTICATION_BACKENDS`, you'll need to clear out session data if you need to force users to re-authenticate using different methods. A simple way to do that is simply to execute ``Session.objects.all().delete()``.
id: Sekali pengguna telah dibuktikan keasliannya, Django menyimpan backend mana yang telah digunakan untuk membuktikan keaslian pengguna di sesi pengguna, dan menggunakan kembali backend sama untuk lamanya sesi tersebut bilamana mengakses ke pengguna dibuktikan keasliannya saat ini dibutuhkan. Ini secara efektif berarti bahwa sumber pembuktian keaslian disimpan pada per sesi, jadi jika anda merubah :setting:`AUTHENTICATION_BACKENDS`, anda akan butuh membersihkan data sesi jika anda butuh memaksa pengguna membuktikan keaslian kembali menggunakan model berbeda. Cara sederhana untuk melakukan itu adalah mengjalankan ``Session.objects.all().delete()``.

source: Writing an authentication backend
id: Menulis backend pembuktian keaslian

source: An authentication backend is a class that implements two required methods: ``get_user(user_id)`` and ``authenticate(request, **credentials)``, as well as a set of optional permission related :ref:`authorization methods <authorization_methods>`.
id: Sebuah backend autentifikasi adalah sebuah kelas yang menerapkan dua metode wajib: ``get_user(user_id)`` dan ``authenticate(request, **credentials)``, dan juga kumpulan dari pilihan perizinan terhubung :ref:`authorization methods <authorization_methods>`.

source: The ``get_user`` method takes a ``user_id`` -- which could be a username, database ID or whatever, but has to be the primary key of your user object -- and returns a user object.
id: Metode ``get_user`` mengambil sebuah ``user_id`` -- yang dapat berupa nama pengguna, ID basisdata atau apapun, tetapi harus primary key dari obyek pengguna anda -- dan mengembalikan sebuah obyek pengguna.

source: The ``authenticate`` method takes a ``request`` argument and credentials as keyword arguments. Most of the time, it'll just look like this::
id: Metode ``authenticate`` mengambil argumen ``request`` dan mandat sebagai kata kunci. Kebanyakan dari waktu, dia akan kelihatan seperti ini::

source: But it could also authenticate a token, like so::
id: Tetapi itu dapat juga membuktikan keaslian sebuah token, seperti begitu::

source: Either way, ``authenticate()`` should check the credentials it gets and return a user object that matches those credentials if the credentials are valid. If they're not valid, it should return ``None``.
id: Salah satu cara, ``authenticate()`` harus memeriksa mandat yang dia dapatkan, dan dia harus mengembalikan obyek user yang cocok dengan mandat, jika mandat sah. Jika mereka tidak sah, dia harus mengembalikan ``None``.

source: ``request`` is an :class:`~django.http.HttpRequest` and may be ``None`` if it wasn't provided to :func:`~django.contrib.auth.authenticate` (which passes it on to the backend).
id: ``request`` adalah sebuah :class:`~django.http.HttpRequest` dan mungkin berupa ``None`` jika itu tidak disediakan pada :func:`~django.contrib.auth.authenticate` (yang melewatkan itu ke backend).

source: The Django admin is tightly coupled to the Django :ref:`User object <user-objects>`. The best way to deal with this is to create a Django ``User`` object for each user that exists for your backend (e.g., in your LDAP directory, your external SQL database, etc.) You can either write a script to do this in advance, or your ``authenticate`` method can do it the first time a user logs in.
id: Admin Django erat ke Django :ref:`User object <user-objects>`. Cara terbaik berurusan dengna ini adalah membuat obyek ``user`` Django untuk setiap pengguna yang ada untuk backend anda (sebagai contoh dalam direktori LDAP, basisdata SQL eksternal anda, dll.) Anda dapat salah satu menulis tulisan untuk melakukannya terlebih dahulu, atau metode ``authenticate`` anda dapat melakukannya pertama kali pengguna masuk.

source: Here's an example backend that authenticates against a username and password variable defined in your ``settings.py`` file and creates a Django ``User`` object the first time a user authenticates::
id: Ini adalah sebuah contoh yang membuktikan keaslian variabel terhdap nama pengguna dan sandi ditentukan dalam berkas ``settings.py`` anda dan membuat sebuah obyek ``User`` Django pertama kali pengguna dibuktikan keaslian:

source: Handling authorization in custom backends
id: Menangani otorisasi dalam backend penyesuaian

source: Custom auth backends can provide their own permissions.
id: Penyesuaian backend sah dapat menyediakan perizinan mereka sendiri.

source: The user model will delegate permission lookup functions (:meth:`~django.contrib.auth.models.User.get_group_permissions()`, :meth:`~django.contrib.auth.models.User.get_all_permissions()`, :meth:`~django.contrib.auth.models.User.has_perm()`, and :meth:`~django.contrib.auth.models.User.has_module_perms()`) to any authentication backend that implements these functions.
id: Model pengguna akan mengutus perizinan fungsi pencaian (:meth:`~django.contrib.auth.models.User.get_group_permissions()`, :meth:`~django.contrib.auth.models.User.get_all_permissions()`, :meth:`~django.contrib.auth.models.User.has_perm()`, dan :meth:`~django.contrib.auth.models.User.has_module_perms()`) ke backend pembuktian keaslian apapun yang menerapkan fungsi ini.

source: The permissions given to the user will be the superset of all permissions returned by all backends. That is, Django grants a permission to a user that any one backend grants.
id: Perizinan diberikan ke pengguna akan menjadi duperset dari semua perizinan dikembalikan oleh semua backend. Yaitu, Django menghadiahkan sebuah perizinan kepada pengguna bahwa tiap satu hadiah backend.

source: If a backend raises a :class:`~django.core.exceptions.PermissionDenied` exception in :meth:`~django.contrib.auth.models.User.has_perm()` or :meth:`~django.contrib.auth.models.User.has_module_perms()`, the authorization will immediately fail and Django won't check the backends that follow.
id: Jika backend memunculkan pengecualian :class:`~django.core.exceptions.PermissionDenied` di :meth:`~django.contrib.auth.models.User.has_perm()` atau :meth:`~django.contrib.auth.models.User.has_module_perms()`, otorisasi akan segera gagal dan Django tidak akan memeriksa backend yang mengikutinya.

source: The simple backend above could implement permissions for the magic admin fairly simply::
id: Backend sederhana diatas dapat menerapkan periznan untuk admin ajaib cukup sederhana::

source: This gives full permissions to the user granted access in the above example. Notice that in addition to the same arguments given to the associated :class:`django.contrib.auth.models.User` functions, the backend auth functions all take the user object, which may be an anonymous user, as an argument.
id: Ini memberikan perizinan penuh kepada pengguna yang diberikan akses di contoh diatas. Perhatikan bahwa di penambahan ke argumen sama diberikan ke fungsi :class:`django.contrib.auth.models.User` terkait, fungsi pembuktian keaslian backend semua mengambil obyek pengguna, yang mungkin menjadi pengguna anonim, sebagai sebuah argumen.

source: A full authorization implementation can be found in the ``ModelBackend`` class in `django/contrib/auth/backends.py`_, which is the default backend and queries the ``auth_permission`` table most of the time. If you wish to provide custom behavior for only part of the backend API, you can take advantage of Python inheritance and subclass ``ModelBackend`` instead of implementing the complete API in a custom backend.
id: Penerapan otorisasi penuh dapat ditemukan dalam kelas ``ModelBackend`` di `django/contrib/auth/backends.py`_, yang merupakan backend awal dan meminta tabel ``auth_permission`` kebanyakan waktu. Jika anda berharap untuk menyediakan kebiasaan penyesuaian untuk hanya bagian dari API backend, anda dapat mengambil keuntungan dari warisan Python dan subkelas ``ModelBackend`` dari menerapkan API lengkap di backend penyesuaian.

source: Authorization for anonymous users
id: Otorisasi untuk pengguna anonim

source: An anonymous user is one that is not authenticated i.e. they have provided no valid authentication details. However, that does not necessarily mean they are not authorized to do anything. At the most basic level, most websites authorize anonymous users to browse most of the site, and many allow anonymous posting of comments etc.
id: Sebuah pengguna anonim adalah satu yang tidak dibuktikan keaslian yaitu mereka menyediakan rincian pembuktian keaslian yang tidak sah. Bagaimanapun, itu tidak dibutuhkan berarti mereka tidak diotorisasikan melakukan apapun. Pada kebanyakan tingkatan dasar, kebanyakan situs jaringan mengotorisasi pengguna anonim untuk menjelajahi kebanyakan situs, dan banyak mengizinkan pengguna memasang komentar dll.

source: Django's permission framework does not have a place to store permissions for anonymous users. However, the user object passed to an authentication backend may be an :class:`django.contrib.auth.models.AnonymousUser` object, allowing the backend to specify custom authorization behavior for anonymous users. This is especially useful for the authors of re-usable apps, who can delegate all questions of authorization to the auth backend, rather than needing settings, for example, to control anonymous access.
id: Kerangka perizinan Django tidak mempunyai tempat untuk menyimpan perizinan untuk pengguna anonim. Bagaimanapun, obyek pengguna melewati backend pembuktian keaslian mungkin obyek :class:`django.contrib.auth.models.AnonymousUser`, mengizinkan backend untuk menentukan kebiasaan otorisasi penyesuaian untuk pengguna anonim. Ini khususnya berguna untuk penulis dari aplikasi digunakan kembali, yang dapat menugaskan semua pertanyaan dan otorisasi ke backend pembuktian keaslian, daripada membutuhkan pengaturan, sebagai contoh, untuk mengendalikan akses anonim.

source: Authorization for inactive users
id: Otorisasi untuk pengguna tidak aktif

source: An inactive user is one that has its :attr:`~django.contrib.auth.models.User.is_active` field set to ``False``. The :class:`~django.contrib.auth.backends.ModelBackend` and :class:`~django.contrib.auth.backends.RemoteUserBackend` authentication backends prohibits these users from authenticating. If a custom user model doesn't have an :attr:`~django.contrib.auth.models.CustomUser.is_active` field, all users will be allowed to authenticate.
id: Seorang pengguna tidak aktif adalah satu yang mempunyai bidang :attr:`~django.contrib.auth.models.User.is_active` nya disetel menjadi ``False``. Backend otentifikasi :class:`~django.contrib.auth.backends.ModelBackend` dan :class:`~django.contrib.auth.backends.RemoteUserBackend` melarang pengguna ini dari otentifikasi. Jika model pengguna penyesuaian tidak mempunyai bidang :attr:`~django.contrib.auth.models.CustomUser.is_active`, semua pengguna akan diizinkan untuk otentifikasi.

source: You can use :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` or :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` if you want to allow inactive users to authenticate.
id: Anda dapat menggunakan :class:`~django.contrib.auth.backends.AllowAllUsersModelBackend` atau :class:`~django.contrib.auth.backends.AllowAllUsersRemoteUserBackend` jika anda ingin mengizinkan pengguna tidak aktif untuk diotentifikasi.

source: The support for anonymous users in the permission system allows for a scenario where anonymous users have permissions to do something while inactive authenticated users do not.
id: Dukungan untuk pengguna anonim di sistem perizinan mengizinkan untuk sebuah skenaria dimana pengguna anonim mempunyai perizinan untuk melakukan sesuatu selama pengguna dibuktikan keaslian tidak aktif tidak.

source: Do not forget to test for the ``is_active`` attribute of the user in your own backend permission methods.
id: Jangan lupa untuk mencoba untuk atribut ``is_active`` dari pengguna di cara perizinan backend anda sendiri.

source: Handling object permissions
id: Penanganan perizinan obyek

source: Django's permission framework has a foundation for object permissions, though there is no implementation for it in the core. That means that checking for object permissions will always return ``False`` or an empty list (depending on the check performed). An authentication backend will receive the keyword parameters ``obj`` and ``user_obj`` for each object related authorization method and can return the object level permission as appropriate.
id: Kerangka perizinan Django mempunyai sebuahyayasan untuk perizinan obyek, meskipun tidak ada penerapa untuknya didalam inti. Hal ini berarti bahwa memeriksa untuk perizinan obyek akan selalu mengembalikan ``False`` atau daftar kosong (tergantung pada penampilan pemeriksaan). Sebuah backend pembuktian keaslian akan menerima parameter katakunci ``obj`` dan ``user_obj`` untuk setiap obyek terkait cara otorisasi dan dapat mengembalikan tingkat perizinan obyek sewajarnya.

source: Custom permissions
id: Penyesuaian perizinan

source: To create custom permissions for a given model object, use the ``permissions`` :ref:`model Meta attribute <meta-options>`.
id: Untuk membuat perizinan penyesuaian untuk obyek model yang diberikan, gunakan ``permissions`` :ref:`model Meta attribute <meta-options>`.

source: Extending the existing ``User`` model
id: Memperpanjang model ``User`` yang ada

source: There are two ways to extend the default :class:`~django.contrib.auth.models.User` model without substituting your own model. If the changes you need are purely behavioral, and don't require any change to what is stored in the database, you can create a :ref:`proxy model <proxy-models>` based on :class:`~django.contrib.auth.models.User`. This allows for any of the features offered by proxy models including default ordering, custom managers, or custom model methods.
id: Terdapat dua jalan untuk memperpanjang model :class:`~django.contrib.auth.models.User` awal tanpa mengganti model milik anda. Jika perubahan anda butuhkan murni kebiasaan, dan tidak membutuhkan perubahan apapun ke apa ang disimpan di basisdata, anda dapat membuat :ref:`proxy model <proxy-models>` berdasarkan pada :class:`~django.contrib.auth.models.User`. Ini mengizinkan fitur apapun ditawarkan oleh model proxy termasuk pemesanan awal, pengelola penyesuaian, atau cara model penyesuaian.

source: If you wish to store information related to ``User``, you can use a :class:`~django.db.models.OneToOneField` to a model containing the fields for additional information. This one-to-one model is often called a profile model, as it might store non-auth related information about a site user. For example you might create an Employee model::
id: Jika anda berharap menyimpan informasi terkait ke ``User``, anda dapat menggunakan :class:`~django.db.models.OneToOneField` pada sebuah model mengandung bidang untuk informasi tambahan. Ini model satu-ke-satu selalu memanggil model profil, karena dia akan menyimpan informasi terkait bukan-asli tentang pengguna situs. Sebagai contoh anda mungkin membuat sebuah model Employee::

source: Assuming an existing Employee Fred Smith who has both a User and Employee model, you can access the related information using Django's standard related model conventions::
id: Mengganggap Pegawai Fred Smith yang ada yang mempunyai kedua model User dan Employee, anda dapat mengakses informasi terkait menggunakan standar Django ketentuan model terkait::

source: To add a profile model's fields to the user page in the admin, define an :class:`~django.contrib.admin.InlineModelAdmin` (for this example, we'll use a :class:`~django.contrib.admin.StackedInline`) in your app's ``admin.py`` and add it to a ``UserAdmin`` class which is registered with the :class:`~django.contrib.auth.models.User` class::
id: Untuk menambahkan profil bidang model ke halaman pengguna dalam admin, tentukan sebuah class:`~django.contrib.admin.InlineModelAdmin` (untuk contoh ini, kami akan menggunakan :class:`~django.contrib.admin.StackedInline`) di ``admin.py`` aplikasi anda dan menambahkannya ke kelas ``UserAdmin`` yang terdaftar dengan kelas :class:`~django.contrib.auth.models.User`::
