Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: If you're using MySQL, your tables may or may not support transactions; it depends on your MySQL version and the table types you're using. (By "table types," we mean something like "InnoDB" or "MyISAM".) MySQL transaction peculiarities are outside the scope of this article, but the MySQL site has `information on MySQL transactions`_.
id: Jika anda sedang menggunakan MySQL, tabel-tabel anda mungkin atau mungkin tidak mendukung transaksi; itu tergantung pada versi MySQL anda dan jenis-jenis tabel anda sedang gunakan. (Berdasarkan "table types,"kami artikan sesuatu seperti "InnoDB" or "MyISAM".) Kekhasan transaksi MySQL adalah diluar cakupan dari artikel ini, tetapi situs MySQL mempunyai `information on MySQL transactions`_.

source: If your MySQL setup does *not* support transactions, then Django will always function in autocommit mode: statements will be executed and committed as soon as they're called. If your MySQL setup *does* support transactions, Django will handle transactions as explained in this document.
id: Jika pengaturan MySQL anda *tidak* mendukung transaksi, kemudian Django akan selalu menggunakan suasana penjalan otomatis: pernyataan-pernyataan akan dijalankan dan diperlakukan segera mereka dipanggil. Jika pengaturan MySQL anda *melakukan* mendukung transaksi, Django akan menangani transaksi-transaksi seperti dijelaskan dalam dokumen ini.

source: Handling exceptions within PostgreSQL transactions
id: Penanganan pengecualian dalam transaksi PostgreSQL

source: This section is relevant only if you're implementing your own transaction management. This problem cannot occur in Django's default mode and :func:`atomic` handles it automatically.
id: Bagian ini hanya bersangkut paut hanya jika anda sedang menerapkan pengelolaan transaksi anda sendiri. Masalah ini tidak dapat muncul dalam keadaan awalan Django dan :func:`atomic` menangani itu otomatis.

source: Inside a transaction, when a call to a PostgreSQL cursor raises an exception (typically ``IntegrityError``), all subsequent SQL in the same transaction will fail with the error "current transaction is aborted, queries ignored until end of transaction block". While simple use of ``save()`` is unlikely to raise an exception in PostgreSQL, there are more advanced usage patterns which might, such as saving objects with unique fields, saving using the force_insert/force_update flag, or invoking custom SQL.
id: Didalam sebuah transaksi, ketika sebuah panggilan pada kursor PostgreSQLmemunculkan sebuah pengecualian (khususnya ``IntegrityError``), semua SQL selanjutnya dalam transaksi sama akan gagal dengan kesalahan "transaksi saat ini dibatalkan, permintaan diabaikan sampai akhir dari blok transakai" Selagi cukup gunakan ``save()`` tidak sepertinya memunculkan sebuah pengecualian dalam PostgreSQL,ada pola penggunaan lebih tinggi yang mungkin, seperti menyimpan obyek-obyek dengan bidang-bidang unik, menyimpan menggunakan bendera force_insert/force_update, atau meminta SQL penyesuaian.

source: There are several ways to recover from this sort of error.
id: Ada beberapa cara memulihkan dari urutan kesalahan ini.

source: Transaction rollback
id: Gulung kembali transaksi

source: The first option is to roll back the entire transaction. For example::
id: Pilihan pertama adalah memutar kembali transaksi keseluruhan. Sebagai contoh::

source: Calling ``transaction.rollback()`` rolls back the entire transaction. Any uncommitted database operations will be lost. In this example, the changes made by ``a.save()`` would be lost, even though that operation raised no error itself.
id: Memanggil memutar kembali ``transaction.rollback()`` keseluruhan transaksi. Apapun tindakan basisdata tidak di commit akan hilang. Dalam contoh ini, perubahan dibuat oleh ``a.save()``akan hilang, meski pekerjaan itu tidak memunculkan kesalahan itu sendiri.

source: Savepoint rollback
id: Memutar kembali savepoint

source: You can use :ref:`savepoints <topics-db-transactions-savepoints>` to control the extent of a rollback. Before performing a database operation that could fail, you can set or update the savepoint; that way, if the operation fails, you can roll back the single offending operation, rather than the entire transaction. For example::
id: Anda dapat menggunakan :ref:`savepoints 1` untuk mengendalikan tingkat dari memutar kembali. Sebelum melakukan tindakan basisdata yang dapat gagal, anda dapat menyetel atau memperbaharui savepoint; cara itu, jika tindakan gagal, anda dapat memutar kembali tindakan tunggal menyinggung, daripada transaksi keseluruhan. Sebagai contoh::

source: In this example, ``a.save()`` will not be undone in the case where ``b.save()`` raises an exception.
id: Dalam contoh ini, ``a.save()`` tidak akan dilepas dalam kasus dimana ``b.save()`` memunculkan sebuah pengecualian.

source: Sending email
id: Mengirim surel

source: Although Python makes sending email relatively easy via the :mod:`smtplib` module, Django provides a couple of light wrappers over it. These wrappers are provided to make sending email extra quick, to make it easy to test email sending during development, and to provide support for platforms that can't use SMTP.
id: Meskipun Python membuat mengirim surel cenderung mudah melalui modul :mod:`smtplib`, Django menyediakan salinan ringan yang membungkusnya. Pembungkus ini disediakan untuk membuat pengiriman surel ekstra cepat, untuk membuatnya mudah mengirim surel selama pengembangan, dan untuk menyediakan dukungan untuk serambi yang tidak dapat menggunakan SMTP.

source: The code lives in the ``django.core.mail`` module.
id: Kode tinggal dalam modul ``django.core.mail``.

source: In two lines::
id: Dalam dua baris::

source: Mail is sent using the SMTP host and port specified in the :setting:`EMAIL_HOST` and :setting:`EMAIL_PORT` settings. The :setting:`EMAIL_HOST_USER` and :setting:`EMAIL_HOST_PASSWORD` settings, if set, are used to authenticate to the SMTP server, and the :setting:`EMAIL_USE_TLS` and :setting:`EMAIL_USE_SSL` settings control whether a secure connection is used.
id: Surat dikirim menggunakan rumah SMTP dan port ditentukan dalam pengaturan :setting:`EMAIL_HOST` dan :setting:`EMAIL_PORT`. Pengaturan :setting:`EMAIL_HOST_USER` dan :setting:`EMAIL_HOST_PASSWORD` settings, jika disetel, digunakan untuk mengotentifikasi pada peladen SMTP, dan pengaturan :setting:`EMAIL_USE_TLS` dan :setting:`EMAIL_USE_SSL` mengendalikan apakah hubungan aman digunakan.

source: The character set of email sent with ``django.core.mail`` will be set to the value of your :setting:`DEFAULT_CHARSET` setting.
id: Kumpulan karakter dari surel dikirim dengan ``django.core.mail`` akan disetel ke nilai dari pengaturan :setting:`DEFAULT_CHARSET` anda.

source: The simplest way to send email is using ``django.core.mail.send_mail()``.
id: Cara termudah mengirim surel adalah menggunakan ``django.core.mail.send_mail()``.

source: The ``subject``, ``message``, ``from_email`` and ``recipient_list`` parameters are required.
id: Parameter ``subject``, ``message``, ``from_email`` dan ``recipient_list`` dibutuhkan.

source: ``subject``: A string.
id: ``subject``: Sebuah string.

source: ``message``: A string.
id: ``message``: Sebuah string.

source: ``from_email``: A string.
id: ``from_email``: Sebuah string.

source: ``recipient_list``: A list of strings, each an email address. Each member of ``recipient_list`` will see the other recipients in the "To:" field of the email message.
id: ``recipient_list``: Sebuah daftar dari string, setiap alamat surel. Setiap anggota dari ``recipient_list`` akan melihat penerima lain dalam bidang "To:" dari pesan surel.

source: ``auth_user``: The optional username to use to authenticate to the SMTP server. If this isn't provided, Django will use the value of the :setting:`EMAIL_HOST_USER` setting.
id: ``auth_user``: Pilihan nama pengguna untuk digunakan mengautentifikasi ke peladen SMTP. Jika ini tidak disediakan, Django akan menggunakan nilai dari pengaturan :setting:`EMAIL_HOST_USER`.

source: ``auth_password``: The optional password to use to authenticate to the SMTP server. If this isn't provided, Django will use the value of the :setting:`EMAIL_HOST_PASSWORD` setting.
id: ``auth_password``: Sandi pilihan digunakan untuk mengautentifikasi ke peladen SMTP. Jika ini tidak disediakan, Django akan menggunakan nilai dari pengaturan :setting:`EMAIL_HOST_PASSWORD`

source: ``connection``: The optional email backend to use to send the mail. If unspecified, an instance of the default backend will be used. See the documentation on :ref:`Email backends <topic-email-backends>` for more details.
id: ``connection``: Backend surel pilihan digunakan untuk mengirim surat. Jika tidak ditentukan, sebuah instance dari backend awalan akan digunakan. Lihat dokumentasi pada :ref:`Email backends 1` untuk rincian lebih.

source: ``html_message``: If ``html_message`` is provided, the resulting email will be a :mimetype:`multipart/alternative` email with ``message`` as the :mimetype:`text/plain` content type and ``html_message`` as the :mimetype:`text/html` content type.
id: ``html_message``: Jika ``html_message`` disediakan, surel dihasilkan akan berupa surel :mimetype:`multipart/alternative` dengan ``message`` sebagai jenis isi :mimetype:`text/plain` dan ``html_message`` sebagai jenis isi :mimetype:`text/html`.

source: The return value will be the number of successfully delivered messages (which can be ``0`` or ``1`` since it can only send one message).
id: Nilai kembalian akan berupa angka dari pesan terkirim yang berhasil (yang dapat berupa ``0`` atau ``1`` sejak itu hanya daoat mengirim satu pesan).

source: ``django.core.mail.send_mass_mail()`` is intended to handle mass emailing.
id: ``django.core.mail.send_mass_mail()`` diperuntukkan untuk menangani penyuratan elektronik masal.

source: ``datatuple`` is a tuple in which each element is in this format::
id: ``datatuple`` adalah sebuah tuple yang setiap unsur adalah dalam bentuk ini::

source: ``fail_silently``, ``auth_user`` and ``auth_password`` have the same functions as in :meth:`~django.core.mail.send_mail()`.
id: ``fail_silently``, ``auth_user`` dan ``auth_password`` mempunyai fungsi sama seperti dalam :meth:`~django.core.mail.send_mail()`.

source: Each separate element of ``datatuple`` results in a separate email message. As in :meth:`~django.core.mail.send_mail()`, recipients in the same ``recipient_list`` will all see the other addresses in the email messages' "To:" field.
id: Setiap unsur terpisah dari ``datatuple`` menghasilkan dalam pesan surel terpisah. Seperti dalam :meth:`~django.core.mail.send_mail()`,penerima dalam ``recipient_list``sama akan semua melihat alamat-alamat lain dalam pesan surel' bidang "To:".

source: For example, the following code would send two different messages to two different sets of recipients; however, only one connection to the mail server would be opened::
id: Sebagai contoh, kode berikut akan mengirim dua pesan berbeda pada dua kumpulan berbeda dari penerima; bagaimanapun, hanya satu hubungan ke peladen surat akan dibuka::

source: The return value will be the number of successfully delivered messages.
id: Nilai kembalian akan berupa angka dari pesan terkirim berhasil.

source: ``send_mass_mail()`` vs. ``send_mail()``
id: ``send_mass_mail()`` x ``send_mail()``

source: The main difference between :meth:`~django.core.mail.send_mass_mail()` and :meth:`~django.core.mail.send_mail()` is that :meth:`~django.core.mail.send_mail()` opens a connection to the mail server each time it's executed, while :meth:`~django.core.mail.send_mass_mail()` uses a single connection for all of its messages. This makes :meth:`~django.core.mail.send_mass_mail()` slightly more efficient.
id: Perbedaan utama diantara :meth:`~django.core.mail.send_mass_mail()` dan :meth:`~django.core.mail.send_mail()`adalah bahwa :meth:`~django.core.mail.send_mail()` membuka sebuah hubungan ke peladen surel setiap itu dijalankan, selagi :meth:`~django.core.mail.send_mass_mail()` menggunakan hubungan tunggal untuk semua pesan-pesannya. Ini membuat :meth:`~django.core.mail.send_mass_mail()`sedikit lebih efesien.

source: ``django.core.mail.mail_admins()`` is a shortcut for sending an email to the site admins, as defined in the :setting:`ADMINS` setting.
id: ``django.core.mail.mail_admins()`` adalah jalan pintas untuk mengirim sebuah surel pada admin situs, seperti ditentukan dalam pengaturan :setting:`ADMINS`.

source: ``mail_admins()`` prefixes the subject with the value of the :setting:`EMAIL_SUBJECT_PREFIX` setting, which is ``"[Django] "`` by default.
id: ``mail_admins()``mengawali subyek dengan nilai dari pengaturan :setting:`EMAIL_SUBJECT_PREFIX`, yaitu ``"[Django] "`` secara awalan.

source: The "From:" header of the email will be the value of the :setting:`SERVER_EMAIL` setting.
id: Kepala "From:" dari surel akan berupa nilai dari pengaturan :setting:`SERVER_EMAIL`.

source: This method exists for convenience and readability.
id: Metode ini ada untuk kenyamanan dan kesiapan.

source: If ``html_message`` is provided, the resulting email will be a :mimetype:`multipart/alternative` email with ``message`` as the :mimetype:`text/plain` content type and ``html_message`` as the :mimetype:`text/html` content type.
id: Jika ``html_message`` disediakan, surel dihasilkan akan berupa surel :mimetype:`multipart/alternative` dengan ``message`` seperti jenis isi :mimetype:`text/plain` dan ``html_message`` seperti jenis isi :mimetype:`text/html`.

source: ``django.core.mail.mail_managers()`` is just like ``mail_admins()``, except it sends an email to the site managers, as defined in the :setting:`MANAGERS` setting.
id: ``django.core.mail.mail_managers()`` seperti ``mail_admins()``, kecuali itu mengirim sebuah surel ke pengelola situs, seperti ditentukan dalam pengaturan :setting:`MANAGERS`.

source: Examples
id: Contoh

source: This sends a single email to john@example.com and jane@example.com, with them both appearing in the "To:"::
id: Ini mengirim surel tunggal kepada john@example.com dan jane@example.com, dengan keduanya mereka muncul dalam "To:"::

source: This sends a message to john@example.com and jane@example.com, with them both receiving a separate email::
id: Ini mengirim sebuah pesan ke john@example.com dan jane@example.com, dengan keduanya menerima surel terpisah::

source: Preventing header injection
id: Mencegah penyuntikan kepala

source: `Header injection`_ is a security exploit in which an attacker inserts extra email headers to control the "To:" and "From:" in email messages that your scripts generate.
id: `Header injection`_ adalah memanfaatkan keamanan dimana seorang penyerang memasukkan kepala surel tambahan untuk mengendalikan "To:" dan "From:" dalam pesan-pesan surel yang tulisan-tulisan anda dibangkitkan.

source: The Django email functions outlined above all protect against header injection by forbidding newlines in header values. If any ``subject``, ``from_email`` or ``recipient_list`` contains a newline (in either Unix, Windows or Mac style), the email function (e.g. :meth:`~django.core.mail.send_mail()`) will raise ``django.core.mail.BadHeaderError`` (a subclass of ``ValueError``) and, hence, will not send the email. It's your responsibility to validate all data before passing it to the email functions.
id: Fungsi-fungsi surel Django diuraikan diatas semua dilindungi terhadap suntukan kepala dengan melarang baris baru dalam nilai kepala. Jika ada ``subject``, ``from_email`` atau ``recepient_list`` mengandung sebuah baris baru (dalam salah satu gaya Unix, Windows, atau Mac), fungsi surel (sebagai contoh :meth:`~django.core.mail.send_mail()`)akan memunculkan ``django.core.mail.BadHeaderError`` (sebuah subkelas dari ``ValueError``)dan, karenanya, tidak akan mengirim surel. Itu adalah tanggung jawab anda untuk mengesahkan semua data sebelum melewatkan itu ke fungsi-fungsi surel.

source: If a ``message`` contains headers at the start of the string, the headers will simply be printed as the first bit of the email message.
id: Jika sebuah ``message`` mengandung kepala-kepala pada awal dari string, kepala-kepala akan cukup dicetak sebagai bit pertama dari pesan surel.

source: Here's an example view that takes a ``subject``, ``message`` and ``from_email`` from the request's POST data, sends that to admin@example.com and redirects to "/contact/thanks/" when it's done::
id: Ini adalah sebuah contoh tampilan yang mengambil ``subject``, ``message`` dan ``from_email`` dari data POST permintaan, mengirim itu ke admin@example.com dan mengalihkan ke "/contact/thanks/" ketika itu selesai::

source: The ``EmailMessage`` class
id: Kelas ``EmailMessage``

source: Django's :meth:`~django.core.mail.send_mail()` and :meth:`~django.core.mail.send_mass_mail()` functions are actually thin wrappers that make use of the :class:`~django.core.mail.EmailMessage` class.
id: Fungsi-fungsi :meth:`~django.core.mail.send_mail()` dan :meth:`~django.core.mail.send_mass_mail()`sebenarnya pembungkus kecil yang memanfaatkan dari kelas :class:`~django.core.mail.EmailMessage`.

source: Not all features of the :class:`~django.core.mail.EmailMessage` class are available through the :meth:`~django.core.mail.send_mail()` and related wrapper functions. If you wish to use advanced features, such as BCC'ed recipients, file attachments, or multi-part email, you'll need to create :class:`~django.core.mail.EmailMessage` instances directly.
id: Tidak semua fitur dari kelas :class:`~django.core.mail.EmailMessage`tersedia melalui :meth:`~django.core.mail.send_mail()` dan fungsi-fungsi pembungkus terkait. Jika anda menginginkan menggunakan fitur-fitur lanjutan, seperti penerima BCC, lampiran berkas, atau banyak-bagian surel, anda akan butuh membuat instance :class:`~django.core.mail.EmailMessage` langsung.

source: This is a design feature. :meth:`~django.core.mail.send_mail()` and related functions were originally the only interface Django provided. However, the list of parameters they accepted was slowly growing over time. It made sense to move to a more object-oriented design for email messages and retain the original functions only for backwards compatibility.
id: Ini adalah fitur rancangan. :meth:`~django.core.mail.send_mail()`dan fungsi-fungsi terkait aslinya hanya antarmuka Django sediakan. Bagaimanapun, daftar dari parameter mereka terima pelan-pelan tumbuh terhadap waktu. Itu masuk akal memindahkan rancangan berorientasi-obyek untuk pesan-pesan surel dan memelihara fungsi-fungsi asli hanya untuk kesesuaian kebelakang.

source: :class:`~django.core.mail.EmailMessage` is responsible for creating the email message itself. The :ref:`email backend <topic-email-backends>` is then responsible for sending the email.
id: :class:`~django.core.mail.EmailMessage` bertanggungjawab untuk membuat pesan surel itu sendiri. :ref:`email backend 1` kemudian bertanggungjawab untuk mengirim surel.

source: For convenience, :class:`~django.core.mail.EmailMessage` provides a simple ``send()`` method for sending a single email. If you need to send multiple messages, the email backend API :ref:`provides an alternative <topics-sending-multiple-emails>`.
id: Untuk kenyamanan, :class:`~django.core.mail.EmailMessage` menyediakan metode ``send()`` sederhana untuk mengirim surel tunggal. Jika anda butuh mengirim banyak pesan, API backend surel :ref:`provides an alternative 1`.

source: ``EmailMessage`` Objects
id: Obyek ``EmailMessage``

source: The :class:`~django.core.mail.EmailMessage` class is initialized with the following parameters (in the given order, if positional arguments are used). All parameters are optional and can be set at any time prior to calling the ``send()`` method.
id: Kelas :class:`~django.core.mail.EmailMessage` diawalkan dengan parameter-parameter berikut (dalam urutan diberikan, jika penempatan argumen-argumen digunakan). Semua parameter adalah pilihan dan dapat disetel pada waktu kapanpun sebelum memanggil metode ``send()``.

source: ``subject``: The subject line of the email.
id: ``subject``: Pokok baris dari surel.

source: ``body``: The body text. This should be a plain text message.
id: ``body``: Teks badan. Ini harus berupa pesan teks polos.

source: ``from_email``: The sender's address. Both ``fred@example.com`` and ``Fred <fred@example.com>`` forms are legal. If omitted, the :setting:`DEFAULT_FROM_EMAIL` setting is used.
id: ``from_email``: Alamat pengirim. Kedua bentuk ``fred@example.com`` dan ``Fred <fred@example.com>`` adalah sah. Jika dihilangkan, pengaturan :setting:`DEFAULT_FROM_EMAIL` digunakan.

source: ``to``: A list or tuple of recipient addresses.
id: ``to``: Sebuah list atau tuple dari alamat-alamat penerima.

source: ``bcc``: A list or tuple of addresses used in the "Bcc" header when sending the email.
id: ``bcc``: Sebuah list atau tuple dari alamat-alamat digunakan dalam kepala "Bcc" ketika mengirim surel.

source: ``connection``: An email backend instance. Use this parameter if you want to use the same connection for multiple messages. If omitted, a new connection is created when ``send()`` is called.
id: ``connection``: Sebuah instance backend surel. Gunakan parameter ini jika anda ingin menggunakan hubungan sama untuk banyak pesan-pesan. Jika dihilangkan, hubungan baru dibuat ketika ``send()`` dipanggil.

source: ``headers``: A dictionary of extra headers to put on the message. The keys are the header name, values are the header values. It's up to the caller to ensure header names and values are in the correct format for an email message. The corresponding attribute is ``extra_headers``.
id: ``header``: Sebuah dictionary dari kepala tambahan untuk menaruh pesan. Kunci-kunci adalah nama kepala, nilai-nilai adalah nilai-nilai kepala. Itu terserah pada pemanggil untuk memastikan nama=nama dan nilai-nilai dalam bentuk benar untuk pesan surel. Atribut sesuai adalah ``extra_headers``.

source: ``cc``: A list or tuple of recipient addresses used in the "Cc" header when sending the email.
id: ``cc``: Sebuah list atau tuple dari alamat-alamat penerima digunakan dalam kepala "Cc" ketika mengirim surel.

source: ``reply_to``: A list or tuple of recipient addresses used in the "Reply-To" header when sending the email.
id: ``reply_to``: Sebuah list atau tuple dari alamat-alamat penerima dalam kepala "Reply-To" ketika mengirim surel.

source: The class has the following methods:
id: Kelas mempunyai cara berikut:

source: ``send(fail_silently=False)`` sends the message. If a connection was specified when the email was constructed, that connection will be used. Otherwise, an instance of the default backend will be instantiated and used. If the keyword argument ``fail_silently`` is ``True``, exceptions raised while sending the message will be quashed. An empty list of recipients will not raise an exception.
id: ``send(fail_silently=False)`` mengirim pesan. Jika hubungan telah ditentukan ketika surel dibangun, hubungan itu akan digunakan. Sebalinya, sebuah instance dari backend awalan akan diinstasiasikan dan digunakan. Jika argumen kata kunci `fail_silently`` adalah ``True``,pengecualian dimunculkan ketika mengirim pesan akan dibatalkan. Sebuah daftar kosong dari penerima tidak akan memunculkan sebuah pengecualian.
