Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: When specifying the field to be aggregated in an aggregate function, Django will allow you to use the same :ref:`double underscore notation <field-lookups-intro>` that is used when referring to related fields in filters. Django will then handle any table joins that are required to retrieve and aggregate the related value.
id: Ketika anda menentukan bidang untuk dikumpulkan dalam sebuah fungsi pengumpulan, Django akan mengizinkan anda menggunakan :ref:`double underscore notation <field-lookups-intro>` sama yang digunakan ketika mengacu ke bidang terkait dalam penyaring. Django akan kemudian menangani gabungan table apapun yang dibutuhkan untuk mengambil dan mengumpulkan nilai terkait.

source: For example, to find the price range of books offered in each store, you could use the annotation::
id: Sebagai contoh, untuk menemukan jangkauan harga dari buku ditawarkan disetiap toko, anda dapat menggunakan catatan::

source: This tells Django to retrieve the ``Store`` model, join (through the many-to-many relationship) with the ``Book`` model, and aggregate on the price field of the book model to produce a minimum and maximum value.
id: Ini memberitahu Django untuk mengambil model ``Store``, gabung (melalui hubungan many-to-many) dengan model ``Book``, dan dikumpulkan pada bidang harga dari model buku untuk menghasilkan sebuah nilai minimal dan maksimal.

source: The same rules apply to the ``aggregate()`` clause. If you wanted to know the lowest and highest price of any book that is available for sale in any of the stores, you could use the aggregate::
id: Aturan sama berlaku pada klausa ``aggregate()``. Jika anda ingin mengetahui harga terendah dan tertinggi dari buku apapun yang tersedia untuk dijual di toko apapun, anda dapat menggunakan pengumpulan::

source: Join chains can be as deep as you require. For example, to extract the age of the youngest author of any book available for sale, you could issue the query::
id: Ikatan join dapat sedalam seperti anda minta. Sebagai contoh, untuk mengeluarkan umur dari penulis termuda dari buku apapun yang tersedia untuk dijual, anda dapat menerbitkan permintaan::

source: Following relationships backwards
id: Mengikuti hubungan kebelakang

source: In a way similar to :ref:`lookups-that-span-relationships`, aggregations and annotations on fields of models or models that are related to the one you are querying can include traversing "reverse" relationships. The lowercase name of related models and double-underscores are used here too.
id: Dalam sebuah cara mirip pada :ref:`lookups-that-span-relationships`, pengumpulan dan catatan pada bidang dari model atau model yang terkait ke satu anda sedang meminta dapat menyertakan lintasan hubungan "reverse". Nama huruf kecil dari model terkait dan garis bawah ganda digunakan disini juga.

source: For example, we can ask for all publishers, annotated with their respective total book stock counters (note how we use ``'book'`` to specify the ``Publisher`` -> ``Book`` reverse foreign key hop)::
id: Sebagai contoh, kami dapat meminta untuk semua penerbit, dicatat dengan masing-masing jumlah penghitung stok buku (catat bahwa kami menggunakan ``'book'`` untuk menentukan ``Publisher`` -> ``Book`` membalikkan lompatan foreign key)::

source: (Every ``Publisher`` in the resulting ``QuerySet`` will have an extra attribute called ``book__count``.)
id: (Setiap ``Publisher`` dalam menghasilkan ``QuerySet`` akan mempunyai sebuah atribut tambahan disebut ``book__count``.)

source: We can also ask for the oldest book of any of those managed by every publisher::
id: Kami dapat juga meminta untuk buku tertua dari setiap dari itu dikelola oleh setiap penerbit::

source: (The resulting dictionary will have a key called ``'oldest_pubdate'``. If no such alias were specified, it would be the rather long ``'book__pubdate__min'``.)
id: (Hasil kamus akan mempunyai sebuah kunci dipanggil ``'oldest_pubdate'``. Jika tidak ada nama lain seperti itu telah ditentukan, itu akan agak panjang ``'book__pubdate__min'``.)

source: This doesn't apply just to foreign keys. It also works with many-to-many relations. For example, we can ask for every author, annotated with the total number of pages considering all the books the author has (co-)authored (note how we use ``'book'`` to specify the ``Author`` -> ``Book`` reverse many-to-many hop)::
id: Ini tidak berlaku hanya pada foreign key. Itu juga bekerja dengan hubungan many-to-many. Sebagai contoh, kami dapat meminta untuk setiap penulis, dicatat dengan jumlah nomor dari halaman mempertimbangkan semua buku penulis mempunyai penulis(-bersama) (catat bagaimana menggunakan ``'book'`` untuk menentukan ``Author`` -> ``Book`` membalikkan lompatan many-to-many)::

source: (Every ``Author`` in the resulting ``QuerySet`` will have an extra attribute called ``total_pages``. If no such alias were specified, it would be the rather long ``book__pages__sum``.)
id: (Setiap ``Author`` dalam menghasilkan ``QuerySet`` akan mempunyai sebuah atribut tambahan dipanggil ``total_pages``. Jika tidak ada nama lain itu, itu akan menjadi agak panjang ``book__pages__sum``.)

source: Or ask for the average rating of all the books written by author(s) we have on file::
id: Atau minta untuk penilaian rata-rata dari semua buku ditulis oleh penulis kami punyai pada berkas::

source: (The resulting dictionary will have a key called ``'average_rating'``. If no such alias were specified, it would be the rather long ``'book__rating__avg'``.)
id: (Hasil kamus akan mempunyai sebuah kunci dipanggil ``'average_rating'``. Jika tidak ada nama lain seperti itu telah ditentukan, itu akan agak panjang ``'book__rating__avg'``.)

source: Aggregations and other ``QuerySet`` clauses
id: Pengumpulan dan klausa ``QuerySet`` lain

source: ``filter()`` and ``exclude()``
id: ``filter()`` dan ``exclude()``

source: Aggregates can also participate in filters. Any ``filter()`` (or ``exclude()``) applied to normal model fields will have the effect of constraining the objects that are considered for aggregation.
id: Pengumpulan dapat juga ikut serta dalam penyaring. ``filter()`` (atau``exclude()``) apapun berlaku pada bidang model biasa akan mempunyai pengaruh dari membatasi obyek yang dianggap untuk pengumpulan.

source: When used with an ``annotate()`` clause, a filter has the effect of constraining the objects for which an annotation is calculated. For example, you can generate an annotated list of all books that have a title starting with "Django" using the query::
id: Ketika digunakan dengan sebuah klausa ``annotate()``, sebuah penyaring mempunyai pengaruh dari membatasi obyek untuk dimana sebuah catatan dihitung. Sebagai contoh, anda dapat membangkitkan daftar dari semua buku yang mempunyai sebuah judul dimulai dengan "Django"" menggunakan permintaan::

source: When used with an ``aggregate()`` clause, a filter has the effect of constraining the objects over which the aggregate is calculated. For example, you can generate the average price of all books with a title that starts with "Django" using the query::
id: Ketika digunakan dengan sebuah klausa ``aggregate()``, sebuah penyaring mempunyai pengaruh dari membatasi obyek untuk dimana sebuah pengumpulan dihitung. Sebagai contoh, anda dapat membangkitkan rata-rata harga dari semua buku yang mempunyai sebuah judul dimulai dengan "Django"" menggunakan permintaan::

source: Filtering on annotations
id: Penyaringan pada keterangan

source: Annotated values can also be filtered. The alias for the annotation can be used in ``filter()`` and ``exclude()`` clauses in the same way as any other model field.
id: Nilai dicatat dapat juga disaring. Nama lain untuk catatan dapat digunaan dalam klausa ``filter()`` dan ``exclude()`` di cara sama seperti bidang model lainnya apapun.

source: For example, to generate a list of books that have more than one author, you can issue the query::
id: Sebagai contoh, untuk membangkitkan sebuah daftar buku yang mempunyai lebih dari satu penulis, anda dapat menerbitkan permintaan::

source: This query generates an annotated result set, and then generates a filter based upon that annotation.
id: Permintaan ini membangkitkan sebuah kumpulan hasil keterangan, dan kemudian membangkitkan sebuah penyaring berdasarkan pada keterangan itu.

source: If you need two annotations with two separate filters you can use the ``filter`` argument with any aggregate. For example, to generate a list of authors with a count of highly rated books::
id: Jika anda butuh dua keterangan dengan dua penyaring terpisah anda dapat menggunakan argumen ``filter`` dengan pengumpulan apapun. Sebagai contoh, untuk membangkitkan daftar dari penulis dengan jumlah peringkat buku tertinggi::

source: Each ``Author`` in the result set will have the ``num_books`` and ``highly_rated_books`` attributes.
id: Setiap ``Author``dalam kumpulan hasil akan memiliki atribut-atribut ``num_books`` dan ``highly_rated_books``.

source: Choosing between ``filter`` and ``QuerySet.filter()``
id: Memilih diantara ``filter`` dan ``QuerySet.filter()``

source: Avoid using the ``filter`` argument with a single annotation or aggregation. It's more efficient to use ``QuerySet.filter()`` to exclude rows. The aggregation ``filter`` argument is only useful when using two or more aggregations over the same relations with different conditionals.
id: Hidnari menggunakan argumen ``filter`` dengan keterangan atau pengumpulan tunggal. Itu lebih efesien menggunakan ``QuerySet.filter()`` untuk tidak menyertakan baris. Argumen pengumpulan ``filter`` hanya berguna ketika menggunakan dua atau lebih pengumpulan terhadap hubungan sama dengan keadaan berbeda.

source: The ``filter`` argument was added to aggregates.
id: Argumen ``filter`` telah ditambahkan pada pengumpulan.

source: Order of ``annotate()`` and ``filter()`` clauses
id: Urutan dari klausa ``annotate()`` dan ``filter()``

source: When developing a complex query that involves both ``annotate()`` and ``filter()`` clauses, pay particular attention to the order in which the clauses are applied to the ``QuerySet``.
id: Ketika mengembangkan sebuah permintaan rumit yang melibatkan kedua klausa ``annotate()`` dan ``filter()``, berikan perhatian khusus pada urutan dimana klausa diberlakukan pada ``QuerySet``.

source: When an ``annotate()`` clause is applied to a query, the annotation is computed over the state of the query up to the point where the annotation is requested. The practical implication of this is that ``filter()`` and ``annotate()`` are not commutative operations.
id: Ketika sebuah klausa ``annotate()`` diberlakukan pada sebuah permintaan, catatan dihitung terhadap keadaan dari permintaan sampai titik dimana catatan diminta. Impliaksi praktik dari ini adalah bahwa ``filter()`` dan ``annotate()`` bukan operasi komutatif.

source: Given:
id: Diberikan:

source: Publisher A has two books with ratings 4 and 5.
id: Penerbit A mempunyai dua buku dengan nilai 4 dan 5.

source: Publisher B has two books with ratings 1 and 4.
id: Penerbit B mempunyai dua buku dengan nilai 1 dan 4.

source: Publisher C has one book with rating 1.
id: Penerbit C mempunyai satu buku dengan penilaian 1.

source: Here's an example with the ``Count`` aggregate::
id: Ini adalah sebuah contoh dengan pengumpulan ``Count``::

source: Both queries return a list of publishers that have at least one book with a rating exceeding 3.0, hence publisher C is excluded.
id: Kedua permintaan mengembalikan sebuah daftar dari penerbit yang mempunyai setidaknya satu buku dengan penilaian melebihi 3.0, karenanya penerbit C tidak disertakan.

source: In the first query, the annotation precedes the filter, so the filter has no effect on the annotation. ``distinct=True`` is required to avoid a :ref:`query bug <combining-multiple-aggregations>`.
id: Dalam permintaan pertama, catatan mendahului penyaring, jadi penyaring tidak mempunyai pengaruh pada catatan. ``distinct=True`` dibutuhkan untuk menghindari :ref:`query bug <combining-multiple-aggregations>`.

source: The second query counts the number of books that have a rating exceeding 3.0 for each publisher. The filter precedes the annotation, so the filter constrains the objects considered when calculating the annotation.
id: Permintaan kedua menghitung jumlah buku yang mempunyai nilai melebihi 3.0 untuk setiap penerbit. Penyaring ini mendahului catatan, jadi batasan penyaring obyek dianggap ketika menghitung catatan.

source: Here's another example with the ``Avg`` aggregate::
id: Ini adalah sebuah contoh lain dengan pengumpulan ``Avg``::

source: The first query asks for the average rating of all a publisher's books for publisher's that have at least one book with a rating exceeding 3.0. The second query asks for the average of a publisher's book's ratings for only those ratings exceeding 3.0.
id: Permintaan pertama meminta untuk rata-rata penilaian dari semua penerbit buku untuk penerbit yang mempunyai setidaknya satu buku ketika penilaian melebihi 3.0. Permintaan kedua meminta untuk rata-rata dari penilaian buku penerbit untuk hanya mereka penilaian melebihi 3.0.

source: It's difficult to intuit how the ORM will translate complex querysets into SQL queries so when in doubt, inspect the SQL with ``str(queryset.query)`` and write plenty of tests.
id: Itu adalah sangat sulit memahami bahwa ORM akan menterjemahkan queryset rumit kedalam permintaan SQL ketika dalam keraguan, periksa SQL dengan ``str(queryset.query)`` dan tulis jumlah besar percobaan.

source: Annotations can be used as a basis for ordering. When you define an ``order_by()`` clause, the aggregates you provide can reference any alias defined as part of an ``annotate()`` clause in the query.
id: Catatan dapat digunakan sebagai dasar untuk pengurutan. Ketika anda menentukan sebuah klausa ``order_by()``, pengumpulan anda sediakan dapat mengacu nama lain apapun ditentukan sebagai bagian dari sebuah klausa ``annotate()`` dalam permintaan.

source: For example, to order a ``QuerySet`` of books by the number of authors that have contributed to the book, you could use the following query::
id: Sebagai contoh, untuk mengurutkan ``QuerySet`` dari buku dengan jumlah dari pengarang yang memiliki bantuan pada buku, anda dapat menggunakan permintaan berikut::

source: Ordinarily, annotations are generated on a per-object basis - an annotated ``QuerySet`` will return one result for each object in the original ``QuerySet``. However, when a ``values()`` clause is used to constrain the columns that are returned in the result set, the method for evaluating annotations is slightly different. Instead of returning an annotated result for each result in the original ``QuerySet``, the original results are grouped according to the unique combinations of the fields specified in the ``values()`` clause. An annotation is then provided for each unique group; the annotation is computed over all members of the group.
id: Biasanya, catatan dibangkitkan pada dasar per-obyek - sebuah ``QuerySet`` dicatat akan mengembalikan satu hasil untuk setiap obyek dalam ``QuerySet`` asli. Bagaimanapun, ketika sebuah klausa ``values()`` digunakan untuk membatasi kolom yang dikembalikan dalam kumpulan hasil, metode untuk menilai catatan adak sedikit berbeda. Sebagai gantinya mengembalikan sebuah hasil dicatat untuk setiap hasil dalam ``QuerySet`` asli, hasil asli dikelompokkan menurut pada perpaduan unik dari bidang-bidang ditentukan dalam klausa ``values()``. Sebuah catatam kemudian disediakan untuk setiap kelompok unik; catatan dihitung terhadap semua anggota dari kelompok.

source: For example, consider an author query that attempts to find out the average rating of books written by each author:
id: Untuk setiap contoh, pertimbangkan sebuah permintaan penulis yang berusaha menemukan rata-rata penilaian dari buku ditulis oleh setiap penulis.

source: This will return one result for each author in the database, annotated with their average book rating.
id: Ini akan mengembalikan satu hasil untuk setiap penulis di basisdata, diberikan keterangan dengan nilai buku rata-rata mereka.

source: However, the result will be slightly different if you use a ``values()`` clause::
id: Bagaimanapun, hasil akan sedikit berbeda jika anda menggunakan kalusa ``values()``::

source: In this example, the authors will be grouped by name, so you will only get an annotated result for each *unique* author name. This means if you have two authors with the same name, their results will be merged into a single result in the output of the query; the average will be computed as the average over the books written by both authors.
id: Dalam contoh ini, penulis akan dikelompokkan berdasarkan nama, jadi anda akan hanya mendapatkan sebuah hasil dicatata untuk setiap nama penulis *unik*. Ini berarti jika anda mempunyai dua penulis dengan nama sama, hasil mereka akan digabung kedalam hasil tunggal di keluaran dari permintaan; rata-rata akan dihitung sebagai rata-rata terhadap buku ditulis oleh kedua penulis.

source: Order of ``annotate()`` and ``values()`` clauses
id: Urutan dari klausa ``annotate()`` dan ``values()``

source: As with the ``filter()`` clause, the order in which ``annotate()`` and ``values()`` clauses are applied to a query is significant. If the ``values()`` clause precedes the ``annotate()``, the annotation will be computed using the grouping described by the ``values()`` clause.
id: Seperti klausa ``filter()``, urutan dimana klausa ``annotate()`` dan ``values()`` diberlakukan pada sebuah permintaan adalah signifikan. Jika klausa ``values()`` mendahului ``annotated()``, catatan akan dihitung menggunakan pengelomppokan digambarkan oleh klausa ``values()``.

source: However, if the ``annotate()`` clause precedes the ``values()`` clause, the annotations will be generated over the entire query set. In this case, the ``values()`` clause only constrains the fields that are generated on output.
id: Bagaimanapun, jika klausa ``annotate()`` mendahului klausa ``values()``, catatan akan dibangkitkan terhadap keseluruhan kumpulan permintaan. Dalam kasus ini, klausa ``values()`` hanya membatasi bidang yang dibangkitkan pada keluaran.

source: For example, if we reverse the order of the ``values()`` and ``annotate()`` clause from our previous example::
id: Sebagai contoh, jika kami membalikkan urutan dari klausa ``values()`` dan ``annotate()`` dari contoh kami sebelumnya::

source: This will now yield one unique result for each author; however, only the author's name and the ``average_rating`` annotation will be returned in the output data.
id: Ini akan sekarang menghasilkan hasil unik untuk setiap penulis; bagaimanapun, hanya nama penulis dan catatan ``average_rating`` akan dikembalikan dalam data keluaran.

source: You should also note that ``average_rating`` has been explicitly included in the list of values to be returned. This is required because of the ordering of the ``values()`` and ``annotate()`` clause.
id: Anda harus juga catat bahwa ``average_rating`` telah jelas disertakan dalam daftar dari nilai-nilai untuk dikembalikan. Ini dibutuhkan karena dari urutan dari klausa ``values()`` dan ``annotate()``.

source: If the ``values()`` clause precedes the ``annotate()`` clause, any annotations will be automatically added to the result set. However, if the ``values()`` clause is applied after the ``annotate()`` clause, you need to explicitly include the aggregate column.
id: Jika klausa ``values()`` mendahului klausa ``annotate()``, setiap catatan akan otomatis ditambahkan ke kumpulan hasil. Bagaimanapun, jika klausa ``values()`` diberlakukan setelah klausa ``annotate()``, anda butuh jelas menyertakan kolom pengumpulan.

source: Interaction with default ordering or ``order_by()``
id: Interaksi dengan pengurutan awalan atau ``order_by()``

source: Fields that are mentioned in the ``order_by()`` part of a queryset (or which are used in the default ordering on a model) are used when selecting the output data, even if they are not otherwise specified in the ``values()`` call. These extra fields are used to group "like" results together and they can make otherwise identical result rows appear to be separate. This shows up, particularly, when counting things.
id: Bidang-bidang yang disebut di bagian ``order_by()`` dari sebuah queryset (atau yang digunakan di pengurutan awalan pada sebuah model) digunakan ketika memilih data keluaran, bahkan jika mereka tidak sebaliknya ditentukan di panggilan ``values()``. Bidang tambahan ini digunakan untuk mengelompokkan hasil "like" bersama-sama dan mereka dapat membuat sebaliknya baris hasil mirip muncul untuk dipesahkan. Ini menunjukkan, khususnya, ketika menghitung hal-hal.

source: By way of example, suppose you have a model like this::
id: Berdasarkan cara contoh, seharusnya anda mempunyai model seperti ini::

source: The important part here is the default ordering on the ``name`` field. If you want to count how many times each distinct ``data`` value appears, you might try this::
id: Bagian terpenfting disini adalah pengurutan awalan pada bidang ``name``. Jika anda ingin menghitung seberapa banyak kali setiap perbedaan nilai ``data`` muncul, anda mungkin mencoba ini::

source: ...which will group the ``Item`` objects by their common ``data`` values and then count the number of ``id`` values in each group. Except that it won't quite work. The default ordering by ``name`` will also play a part in the grouping, so this query will group by distinct ``(data, name)`` pairs, which isn't what you want. Instead, you should construct this queryset::
id: ...yang akan mengelompokkan obyek ``Item`` berdasarkan nilai-nilai ``data`` umum mereka dan menghitung nomro dari nilai-nilai ``id`` dalam setiap kelompok, Kecuali itu tidak akan bekerja. Pengurutan awalan oleh ``name`` akan juga bermain bagian dalam pengelompokan, jadi permintaan ini akan dikelompokkan berdasarkan perbedaan pasangan ``(data, name)``, yang tidak apa anda inginkan. Malahan, anda harus membangun queryset ini::

source: ...clearing any ordering in the query. You could also order by, say, ``data`` without any harmful effects, since that is already playing a role in the query.
id: ...membersihkan pengurutan apapun di permintaan. Anda dapat juga mengurutkan berdasarkan, katakan, ``data`` tanpa pengaruh berbahaya apapun, sejak itu sudah bermain sebuah peran dalam permintaan.

source: This behavior is the same as that noted in the queryset documentation for :meth:`~django.db.models.query.QuerySet.distinct` and the general rule is the same: normally you won't want extra columns playing a part in the result, so clear out the ordering, or at least make sure it's restricted only to those fields you also select in a ``values()`` call.
id: Perilaku ini adalah sama seperti dicatat dalam dokumentasi queryset untuk :meth:`~django.db.models.query.QuerySet.distinct` dan aturan umum adalah sama: biasanya anda tidak ingin kolom tambahan bermain bagian dalam hasil, jadi bersihkan pengurutan, atau setidaknya pastikan itu terbatas hanya bidang-bidang tersebut anda juga pilih dalam sebuah panggilan ``values()``.

source: You might reasonably ask why Django doesn't remove the extraneous columns for you. The main reason is consistency with ``distinct()`` and other places: Django **never** removes ordering constraints that you have specified (and we can't change those other methods' behavior, as that would violate our :doc:`/misc/api-stability` policy).
id: Anda mungkin layak bertanya mengapa Django tidak memidnahkan kolom tidak ada hubungannya untuk anda. Alasan utama adalah ketetapan dengan distinct()`` dan tempat lain: Django *tidak pernah* memindahkan pengurutan yang anda telah tentukan (dan kami tidak dapat merubah perilaku metode lain tersebut, ketika itu akan melanggar kebijakan :doc:`/misc/api-stability` kami).
