Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: We'll refer to the same models used in :doc:`/topics/db/queries`.
id: Kita akan mengacu model sama digunakan dalam :doc:`/topics/db/queries`.

source: Use Cases
id: Kasus Penggunaan

source: Standard textual queries
id: Standar permintaan kata demi kata

source: Text-based fields have a selection of simple matching operations. For example, you may wish to allow lookup up an author like so::
id: Bidang-bidang berdasarkan-teks mempunyai pilihan dari tindakan pencocokan sederhana. Sebagai contoh, anda mungkin ingin mengizinkan pencarian seorang penulis seperti itu::

source: This is a very fragile solution as it requires the user to know an exact substring of the author's name. A better approach could be a case-insensitive match (:lookup:`icontains`), but this is only marginally better.
id: Ini adalah pemecahan sangat rapuh ketika itu membutuhkan pengguna mengetahui substring tepat dari nama penulis. Pendekatan terbaik berupa pencocokan kasus-tidak-peka (:lookup:`icontains`), tetapi ini hanya sedikti lebih baik.

source: A database's more advanced comparison functions
id: Fungsi-fungsi perbandingan tingkat lanjut lebih banyak basisdata

source: If you're using PostgreSQL, Django provides :doc:`a selection of database specific tools </ref/contrib/postgres/search>` to allow you to leverage more complex querying options. Other databases have different selections of tools, possibly via plugins or user-defined functions. Django doesn't include any support for them at this time. We'll use some examples from PostgreSQL to demonstrate the kind of functionality databases may have.
id: Jika anda sedang menggunakan PostgreSQL, Django menyediakan :doc:`a selection of database specific tools 1` untuk mengizinkan anda mengungkit lebih rumit pilihan permintaan. Basisdata lain mempunyai pemilihan berbeda dari alat-alat, kemungkinan melalui plugin atau fungsi ditentukan-pengguna. Django tidak menyertakan dukungan apapun untuk mereka pada saat ini. Kami akan menggunakan beberapa contoh dari PostgreSQL untuk menunjukkan hal dari kegunaan basisdata mungkin dimiliki.

source: Searching in other databases
id: Pencarian dalam basisdata lain

source: All of the searching tools provided by :mod:`django.contrib.postgres` are constructed entirely on public APIs such as :doc:`custom lookups </ref/models/lookups>` and :doc:`database functions </ref/models/database-functions>`. Depending on your database, you should be able to construct queries to allow similar APIs. If there are specific things which cannot be achieved this way, please open a ticket.
id: Semua alat-alat pencarian disediakan oleh :mod:`django.contrib.postgres`dibangun seluruhnya pada API umum seperti :doc:`custom lookups 1` dan :doc:`database functions 2`.Bergantung pada basisdata anda, anda harus dapat membangun permintaan untuk mengizinkan API yang mirip. Jika ada hal-hal khususyang tidak dapat dicapai cara ini, harap buka sebuah tiket.

source: In the above example, we determined that a case insensitive lookup would be more useful. When dealing with non-English names, a further improvement is to use :lookup:`unaccented comparison <unaccent>`::
id: Dalam contoh diatas, kami menentukan bahwa pencarian kasus-tidak-peka akan lebih berguna. Ketika berurusan dengan nama-nama bukan-Inggris, perbaikan lebih lanjut adalah menggunakan :lookup:`unaccented comparison 1`::

source: This shows another issue, where we are matching against a different spelling of the name. In this case we have an asymmetry though - a search for ``Helen`` will pick up ``Helena`` or ``Hlne``, but not the reverse. Another option would be to use a :lookup:`trigram_similar` comparison, which compares sequences of letters.
id: Ini menunjukkan masalah lain, dimana kami sedang mencocokkan terhadap pengejaan berbeda dari nama. Dalam kasus ini kami mempunyai asimetris sekalipun - sebuah pencarian untuk ``Helen`` akan mengambil ``Helena`` atau ``Hlne``,tetapi bukan kebalikannya. Pilihan lain akan menggunakan perbandingan :lookup:`trigram_similar`, yang membandingkan urutan huruf.

source: Now we have a different problem - the longer name of "Helena Bonham Carter" doesn't show up as it is much longer. Trigram searches consider all combinations of three letters, and compares how many appear in both search and source strings. For the longer name, there are more combinations which appear in the source string so it is no longer considered a close match.
id: Sekarang kami mempunyai masalah berbeda - nama panjang dari "Helena Bonham Carter"tidak menampilan seperti itu lebih panjang. Pencarian Trigram mempertimbangkan semua perpaduan dari tiga huruf, dan membandingkan seberapa banyak muncul dalam kedua pencarian dan sumber string. Untuk nama terpanjang, ada perpaduan lebih yang muncul dalam string sumber jadi itu tidak lagi dipertimbangkan pencocokan tertutup.

source: The correct choice of comparison functions here depends on your particular data set, for example the language(s) used and the type of text being searched. All of the examples we've seen are on short strings where the user is likely to enter something close (by varying definitions) to the source data.
id: Pilihan benar dari fungsi perbandingan disini tergantung pada kumpulan data tertentu anda, sebagai contoh bahasa digunakan dan jenis dari teks sedang diari Semua contoh-contoh kami telah lihat adalah pada string pendek dimana pengguna mungkin memasukkan sesuatu mendekatkan (dengan meragamkan pengertian) pada sumber data.

source: Document-based search
id: Pencarian berdasarkan-dokumen

source: Simple database operations are too simple an approach when you start considering large blocks of text. Whereas the examples above can be thought of as operations on a string of characters, full text search looks at the actual words. Depending on the system used, it's likely to use some of the following ideas:
id: Tindakan basisdata sederhana adalah terlalu sederhana pada pendekatan ketika anda mulai mempertimbangkan blok-blok besar dari teks. Dimana contoh-contoh diatas dapat dipikirkan sebagai tindakan-tindakan pada string dari karakter, pencarian teks penuh mencari kata sebenarnya. Tergantung pada sistem digunakan, itu mungkin menggunakan beberapa dari ide-ide berikut:

source: Ignoring "stop words" such as "a", "the", "and".
id: Mengabaikan "kata berhenti" seperti "a", "the", "and".

source: Stemming words, so that "pony" and "ponies" are considered similar.
id: Menghentikan kata-kata, sehingga "pony" dan "ponies" dianggap sama.

source: Weighting words based on different criteria such as how frequently they appear in the text, or the importance of the fields, such as the title or keywords, that they appear in.
id: Bobot kata-kata berdasarkan pada kriteria berbeda seperti sebagaimana sering mereka muncul dalam teks, atau kepentingan dari bidang-bidang, seperti judul atau katakunci, yang mereka muncul.

source: There are many alternatives for using searching software, some of the most prominent are Elastic_ and Solr_. These are full document-based search solutions. To use them with data from Django models, you'll need a layer which translates your data into a textual document, including back-references to the database ids. When a search using the engine returns a certain document, you can then look it up in the database. There are a variety of third-party libraries which are designed to help with this process.
id: Ada banyak cara lain untuk menggunakan perangkat lunak pencarian, beberapa dari paling terkemuka adalah Elastic_ dan Solr_.Ini adalah pemecahan pencarian berdasarkan-dokumen penuh. Untuk menggunakan mereka dengan data dari model-model Django, anda akan butuh lapisan yang menterjemahkan data anda kedalam dokumen tekstual, termasuk acuan-kembali ke id basisdata. Ketika sebuah pencarian menggunakan mesin mengembalikan dokumen tertentu, anda dapat kemudian melihat itu dalam basisdata. Ada beragam pustaka-pustaka pihak-ketiga yang dirancang membantu dengan pengolahan ini.

source: PostgreSQL support
id: Dukungan PostgreSQL

source: PostgreSQL has its own full text search implementation built-in. While not as powerful as some other search engines, it has the advantage of being inside your database and so can easily be combined with other relational queries such as categorization.
id: PostgreSQL mempunyai penerapan pencarian teks penuh siap pakai sendiri. Selagi tidak sekuat beberapa mesin pencari lain, itu mempunyai keuntungan dari menjadi didalam basisdata anda dan sehingga dapat dengan mudah dipadukan dengan permintaan penghubung lain seperti kategorisasi.

source: The :mod:`django.contrib.postgres` module provides some helpers to make these queries. For example, a simple query might be to select all the blog entries which mention "cheese"::
id: Modul :mod:`django.contrib.postgres`menyediakan beberapa pembantu untuk membuat perubahan permintaan ini. Sebagai contoh, permintaan sederhana mungkin memilih semua masukan blog yang menyebut "cheese"::

source: You can also filter on a combination of fields and on related models::
id: Anda dapat juga menyaring pada perpaduan pada bidang dan pada model terkait::

source: See the ``contrib.postgres`` :doc:`/ref/contrib/postgres/search` document for complete details.
id: Lihat dokumen ``contrib.postgres`` :doc:`/ref/contrib/postgres/search` untuk rincian lengkap.

source: Performing raw SQL queries
id: Melakukan permintaan SQL mentah

source: When the :doc:`model query APIs </topics/db/queries>` don't go far enough, you can fall back to writing raw SQL. Django gives you two ways of performing raw SQL queries: you can use :meth:`Manager.raw()` to `perform raw queries and return model instances`__, or you can avoid the model layer entirely and `execute custom SQL directly`__.
id: Ketika :doc:`model query APIs 1` tidak pergi jauh, anda dapat kembali menulis SQL mentah. Django memberikan anda dua cara dari melaksanakan permintaan SQL mentah: anda dapat menggunakan :meth:`Manager.raw()`untuk `perform raw queries and return model instances`__,atau anda dapat menghindari lapisan model seluruhnya dan `execute custom SQL directly`__.

source: You should be very careful whenever you write raw SQL. Every time you use it, you should properly escape any parameters that the user can control by using ``params`` in order to protect against SQL injection attacks. Please read more about :ref:`SQL injection protection <sql-injection-protection>`.
id: Anda harus berhati-hati ketika anda menulis SQL mentah. Setiap kali anda menggunakan itu, anda harus dengan benar meloloskan parameter apapun yang pengguna dapat mengendalikan menggunakan ``params`` untuk melindungi terhadap serangan SQL injection. Harap membaca lebih tentang :ref:`SQL injection protection 1`.

source: Performing raw queries
id: Melakukan permintaan mentah

source: The ``raw()`` manager method can be used to perform raw SQL queries that return model instances:
id: Metode pengelola ``raw()`` dapat digunakan untuk melakukan permintaan SQL mentah yang mengembalikan instance model:

source: This method takes a raw SQL query, executes it, and returns a ``django.db.models.query.RawQuerySet`` instance. This ``RawQuerySet`` instance can be iterated over just like a normal :class:`~django.db.models.query.QuerySet` to provide object instances.
id: Metode ini mengambil sebuah permintaan SQL mentah, menjalankan itu, dan mengembalikan sebuah instance ``django.db.models.query.RawQuerySet``. Instance ``RawQuerySet`` ini dapat diulang terhadap seperti :class:`~django.db.models.query.QuerySet` biasa untuk menyediakan instance-instance obyek.

source: This is best illustrated with an example. Suppose you have the following model::
id: Ini adalah terbaik digambarkan dengan sebuah contoh. Kiranya anda mempunyai model berikut::

source: You could then execute custom SQL like so::
id: Anda dapat kemudian menjalankan SQL penyesuaian seperti itu::

source: Of course, this example isn't very exciting -- it's exactly the same as running ``Person.objects.all()``. However, ``raw()`` has a bunch of other options that make it very powerful.
id: Tentu saja, contoh ini tidak sangat menarik -- itu tepatnya sama seperti menjalankan ``Person.objects.all()``. Bagaimanapun, ``raw()`` mempuyai banyak dari pilihan lain yang memuat itu lebih bertenaga.

source: Model table names
id: Nama tabel model

source: Where did the name of the ``Person`` table come from in that example?
id: Dimana nama dari tabel ``Person`` datang dalam contoh itu?

source: By default, Django figures out a database table name by joining the model's "app label" -- the name you used in ``manage.py startapp`` -- to the model's class name, with an underscore between them. In the example we've assumed that the ``Person`` model lives in an app named ``myapp``, so its table would be ``myapp_person``.
id: Secara awalan, Django mencari tahu nama tabel basisdata dengan menggabungkan "app label" model -- nama anda gunakan dalam ``manage.py startapp`` -- pada nama kelas model, dengan sebuah garis bawah diantara mereka. Dalam contoh kami telah menganggap bahwa model ``Person`` tinggal dalam sebuah aplikasi bernama ``myapp``, jadi tabelnya akan berupa ``myapp_person``.

source: For more details check out the documentation for the :attr:`~Options.db_table` option, which also lets you manually set the database table name.
id: Untuk rincian lebih periksa dokumentasi untuk pilihan :attr:`~Options.db_table`, yang juga membiarkan anda secara manual menyetel nama tabel basisdata.

source: No checking is done on the SQL statement that is passed in to ``.raw()``. Django expects that the statement will return a set of rows from the database, but does nothing to enforce that. If the query does not return rows, a (possibly cryptic) error will result.
id: Tidak ada pemeriksaan selesai pada pernyataan SQL yang dilewatkan ke ``.raw()``. Django mengharapkan pernyataan itu akan mengembalikan sekumpulan baris dari basisdata, tetapi tidak melakukan apapun untuk memaksa itu. Jika permintaan tidak mengembalikan baris, sebuah (kemungkinan samar) kesalahan akan menghasilkan.

source: If you are performing queries on MySQL, note that MySQL's silent type coercion may cause unexpected results when mixing types. If you query on a string type column, but with an integer value, MySQL will coerce the types of all values in the table to an integer before performing the comparison. For example, if your table contains the values ``'abc'``, ``'def'`` and you query for ``WHERE mycolumn=0``, both rows will match. To prevent this, perform the correct typecasting before using the value in a query.
id: Jika anda sedang melakukan permintaan pada MySQL, catat bahwa paksaan jenis diam MySQL mungkin menyebabkan hasil tidak diharapkan ketika mencampur jenis. Jika anda meminta pada sebuah kolom jenis string, tetapi dengan sebuah nilai integer, MySQL akan memaksa jenis-jenis dari semua nilai dalam tabel ke integer sebelum melakukan perbandingan. Sebagai contoh, jika tabel anda mengandung nilai-nilai ``'abc'``, ``'def'`` dan anda meminta untuk ``WHERE mycolumn=0``, kedua baris akan cocok. Untuk mencegah ini, lakukan pembenaran typecast sebelum menggunakan nilai dalam sebuah permintaan.

source: Mapping query fields to model fields
id: Memetakan bidang permintaan ke bidang model

source: ``raw()`` automatically maps fields in the query to fields on the model.
id: ``raw()`` secara otomatis memetakan bidang-bidang dalam permintaan ke bidang pada model.

source: The order of fields in your query doesn't matter. In other words, both of the following queries work identically::
id: Urutan dari bidang-bidang daam permintaan anda tidak masalah. Dengan kata lain, kedua dari permintaan berikut bekerja mirip::

source: Matching is done by name. This means that you can use SQL's ``AS`` clauses to map fields in the query to model fields. So if you had some other table that had ``Person`` data in it, you could easily map it into ``Person`` instances::
id: Pencocokan selesai berdasarkan nama. Ini berarti bahwa anda dapat menggunakan klausa ``AS`` SQL untuk memetakan bidang-bidang dalam permintaan ke bidang-bidang model. Jadi jika anda mempunyai beberapa tabel lain yang mempunyai data ``Person`` dalam nya, anda dapat dengan mudah memetakan itu menjadi instance ``Person``::

source: As long as the names match, the model instances will be created correctly.
id: Selama nama-nama cocok, instance model akan dibuat dengan benar.

source: Alternatively, you can map fields in the query to model fields using the ``translations`` argument to ``raw()``. This is a dictionary mapping names of fields in the query to names of fields on the model. For example, the above query could also be written::
id: Kalau tidak, anda dapat memetakan bidang-bidang dalam permintaan ke bidang-bidang model menggunakan argumen ``translations`` pada ``raw()``. Ini adalah nama-nama pemetaan dictionary dalam permintaan pada nama-nama dari bidang pada model. Sebagai contoh, permintaan diatas dapat juga ditulis::

source: Index lookups
id: Pencarian indeks

source: ``raw()`` supports indexing, so if you need only the first result you can write::
id: ``raw()`` mendukung pengindeksan, jadi jika anda butuh hanya hasil pertama anda dapat menulis::

source: However, the indexing and slicing are not performed at the database level. If you have a large number of ``Person`` objects in your database, it is more efficient to limit the query at the SQL level::
id: Bagaimanapun, pengindeksan dan pemotongan tidak dilakukan pada tingkat basisdata. Jika anda mempunyai sejumlah besar obyek ``Person`` dalam basisdata anda, itu lebih efesien membatasi permintaan pada tingkat SQL::

source: Deferring model fields
id: Menangguhkan bidang-bidang model

source: Fields may also be left out::
id: Bidang-bidang mungkin juga ditiadakan::

source: The ``Person`` objects returned by this query will be deferred model instances (see :meth:`~django.db.models.query.QuerySet.defer()`). This means that the fields that are omitted from the query will be loaded on demand. For example::
id: Obyek ``Person`` dikembalikan oleh permintaan ini akan meniadakan instance-instance model (lihat :meth:`~django.db.models.query.QuerySet.defer()`).Ini berarti bahwa bidang-bidang yang dihilangkan dari permintaan akan dimuat pada permintaan. Sebagai contoh::

source: From outward appearances, this looks like the query has retrieved both the first name and last name. However, this example actually issued 3 queries. Only the first names were retrieved by the raw() query -- the last names were both retrieved on demand when they were printed.
id: Dari penampilan luar, ini terlihat seperti permintaan telah mengambil kedua nama pertama dan nama terakhir. Bagaimanapun, contoh ini sebenarnya menerbitkan 3 permintaan. Hanya nama pertama yang diambil oleh permintaan raw() -- nama terakhir keduanya diambil pada permintaan mereka telah cetak.

source: There is only one field that you can't leave out - the primary key field. Django uses the primary key to identify model instances, so it must always be included in a raw query. An ``InvalidQuery`` exception will be raised if you forget to include the primary key.
id: Hanya ada sat bidang yang anda tidak dapat tinggalkan - bidang primary key. Django menggunakan primary key untuk mencirikan instance-instance model, jadi itu harus selalu disertakan dalam permintaan mentah. Sebuah pengecualian ``InvalidQuery``akan dimunculkan jika anda lupa menyertakan primary key.

source: Adding annotations
id: Menambahkan keterangan

source: You can also execute queries containing fields that aren't defined on the model. For example, we could use `PostgreSQL's age() function`__ to get a list of people with their ages calculated by the database::
id: Anda dapat juga menjalankan permintaan mengandung bidang-bidang yang tidak ditentukan pada model. Sebagai contoh, kami dapat menggunakan `PostgreSQL's age() function`__untuk mendapatkan daftar orang dengan umur mereka dihitung oleh basisdata::

source: Passing parameters into ``raw()``
id: Melewati parameter kedalam ``raw()``

source: If you need to perform parameterized queries, you can use the ``params`` argument to ``raw()``::
id: Jika anda butuh melakukan permintaan gambaran parameter, anda dapat menggunakan argumen ``params`` pada ``raw()``::

source: ``params`` is a list or dictionary of parameters. You'll use ``%s`` placeholders in the query string for a list, or ``%(key)s`` placeholders for a dictionary (where ``key`` is replaced by a dictionary key, of course), regardless of your database engine. Such placeholders will be replaced with parameters from the ``params`` argument.
id: ``params`` adalah sebuah parameter list atau dictionary. Anda akan menggunakan palceholder ``%s``dalam string permintaan untuk daftar, atau placeholder ``%(key)s`` untuk sebuah dictionary (dimana ``key`` diganti oleh kunci dictionary, tentu saja), tidak peduli dari mesin basisdata anda. Placeholder itu akan diganti dengan parameter dari argumen ``params``.

source: Dictionary params are not supported with the SQLite backend; with this backend, you must pass parameters as a list.
id: Parameter dictionary tidak didukung dengan backend SQLite; dengan backend ini, anda harus melewatkan parameter sebagai sebuah list.

source: **Do not use string formatting on raw queries or quote placeholders in your SQL strings!**
id: **Jangan menggunakan string berbentuk pada permintaan mentah atau mengutip placeholder dalam string-string SQL anda !**

source: It's tempting to write the above query as::
id: Itu sangat menggoda menulis permintaan diatas sebagai::

source: You might also think you should write your query like this (with quotes around ``%s``)::
id: Anda mungkin juga berpikir anda harus menulis permintaan anda seperti ini (dengan kutipan disekitar ``%s``)::

source: **Don't make either of these mistakes.**
id: **Jangan membuat salah satu dari kesalahan-kesalahan ini.**

source: As discussed in :ref:`sql-injection-protection`, using the ``params`` argument and leaving the placeholders unquoted protects you from `SQL injection attacks`__, a common exploit where attackers inject arbitrary SQL into your database. If you use string interpolation or quote the placeholder, you're at risk for SQL injection.
id: Seperti diobrolkan dalam :ref:`sql-injection-protection`, menggunakan argumen ``params`` dan membiarkan placeholder tidak dikutip melindungi anda dari `SQL injection attacks`__, pemanfaatan umum dimana penyerang memasukkan SQL berubah-ubah kedalam basisdata anda. Jika adan menggunakan penyisipan string atau mengutip placeholder, anda sedang pada resiko untuk penyisipan SQL.

source: Executing custom SQL directly
id: Menjalankan penyesuaian SQL langsung

source: Sometimes even :meth:`Manager.raw` isn't quite enough: you might need to perform queries that don't map cleanly to models, or directly execute ``UPDATE``, ``INSERT``, or ``DELETE`` queries.
id: Terkadang bahkan :meth:`Manager.raw`tidak cukup: anda mungkin butuh melakukan permintaan yang tidak memetakan dengan bersih pada model, atau langsung menjalankan permintaan ``UPDATE``, ``INSERT``, atau ``DELETE``.

source: In these cases, you can always access the database directly, routing around the model layer entirely.
id: Dalam kasus-kasus ini, anda dapat selalu mengakses basisdata secara langsung, fungsi disekitar lapisan model sepenuhnya.
