Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: ``cache_page`` can also take an optional keyword argument, ``cache``, which directs the decorator to use a specific cache (from your :setting:`CACHES` setting) when caching view results. By default, the ``default`` cache will be used, but you can specify any cache you want::
id: ``cache_page`` dapat juga mengambil sebuah argumen kata kunci pilihan, ``cache``, yang akan mengalihkan penghias menggunakan cache khusus (dari pengaturan :setting:`CACHES` anda) ketika cache menampilkan hasil. Secara awalan, cache ``default`` akan digunakan, tetapi anda dapat menentukan cache apapun anda inginkan::

source: You can also override the cache prefix on a per-view basis. ``cache_page`` takes an optional keyword argument, ``key_prefix``, which works in the same way as the :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` setting for the middleware. It can be used like this::
id: Anda dapat juga menimpa awalan tembolok pada berdasarkan per-tampilan. ``cache_page`` mengambil sebuah pilihan argumen kata kunci, ``key_prefix``, yang bekerja di cara yang sama seperti pengaturan :setting:`CACHE_MIDDLEWARE_KEY_PREFIX` untuk middleware. Itu dapat digunakan seperti ini::

source: The ``key_prefix`` and ``cache`` arguments may be specified together. The ``key_prefix`` argument and the :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` specified under :setting:`CACHES` will be concatenated.
id: Argumen ``key_prefix`` dan ``cache`` mungkin ditentukan bersama-sama. Argumen ``key_prefix`` dan :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` ditentukan dibawah :setting:`CACHES` akan digabungkan.

source: Specifying per-view cache in the URLconf
id: Menentukan cache per-tampilan di URLconf

source: The examples in the previous section have hard-coded the fact that the view is cached, because ``cache_page`` alters the ``my_view`` function in place. This approach couples your view to the cache system, which is not ideal for several reasons. For instance, you might want to reuse the view functions on another, cache-less site, or you might want to distribute the views to people who might want to use them without being cached. The solution to these problems is to specify the per-view cache in the URLconf rather than next to the view functions themselves.
id: Contoh-contoh di bagian sebelumnya telah di kode-keraskan fakta yang tampilan di cache, karena ``cache_page`` merubah fungsi ``my_view`` di tempat. Pendakan ini memasangkan tampilan anda ke sistem cache, yang tidak sesuai untuk beberapa alasan. Sebagai contoh, anda mungkin ingin menggunakan kembali fungsi tampilan pada lainnya, situs tidak-cache, atau anda mungkin ingin menyebarkan tampilan pada orang yang mungkin ingin menggunakan mereka tanpa sedang di cache. Pemecahan pada masalah ini adalah menentukan cache per-tampilan di URLconf daripada dekat ke fungsi tampilan mereka sendiri.

source: Doing so is easy: simply wrap the view function with ``cache_page`` when you refer to it in the URLconf. Here's the old URLconf from earlier::
id: Melakukannya sangat mudah: cukup membungkus fungsi tampilan dengan ``cache_page`` ketika anda mengacu ke itu di URLconf. Ini adalah URLconf lama dari sebelumnya::

source: Here's the same thing, with ``my_view`` wrapped in ``cache_page``::
id: Ini adalah hal yang sama, dengan ``my_view`` dibungkus di ``cache_page``::

source: Template fragment caching
id: Cache bgian cetakan

source: If you're after even more control, you can also cache template fragments using the ``cache`` template tag. To give your template access to this tag, put ``{% load cache %}`` near the top of your template.
id: Jika anda sedang mengejar lebih kendali, anda dapat juga cache fragmen cetakan menggunakan etiket cetakan ``cache``. Untuk memberikan akses cetakan anda ke etiket ini, taruh ``{% load cache %}`` dekat atas dari cetakan anda.

source: The ``{% cache %}`` template tag caches the contents of the block for a given amount of time. It takes at least two arguments: the cache timeout, in seconds, and the name to give the cache fragment. The fragment is cached forever if timeout is ``None``. The name will be taken as is, do not use a variable. For example:
id: Etiket cetakan ``{% cache %}`` menyimpan isi dari blok untuk sejumlah waktu yang diberikan. Itu mengambil setidaknya dua argumen: waktu habis cache, dalam detik, dan nama untuk memberikan bagian cache. Bagian di simpan selamanya jika waktu habis adalah ``None``. Nama akan diambil dengan adanya, jangan menggunakan sebuah variabel. Sebagai contoh:

source: Older versions don't allow a ``None`` timeout.
id: Versi-versi terlama tidak mengizinkan waktu habis ``None``.

source: Sometimes you might want to cache multiple copies of a fragment depending on some dynamic data that appears inside the fragment. For example, you might want a separate cached copy of the sidebar used in the previous example for every user of your site. Do this by passing one or more additional arguments, which may be variables with or without filters, to the ``{% cache %}`` template tag to uniquely identify the cache fragment:
id: Terkadang anda mungkin ingin menyimpan banyak salinan dari bagian tergantung pada beberapa dinamis data yang muncul didalam bagian. Sebagai contoh, anda mungkin ingin memisahkan salinan tersimpan dari batang sisi digunakan dalam contoh sebelumnya untuks etiap pengguna dari situs anda. Lakukan ini dengan melewatkan satu atau lebih argumen tambahan, yang mungkin berupa variabel dengan atau tanpa penyaring, pada etiket cetakan ``{% cache %}`` pada mencirikan secara unik bagian cache:

source: If :setting:`USE_I18N` is set to ``True`` the per-site middleware cache will :ref:`respect the active language<i18n-cache-key>`. For the ``cache`` template tag you could use one of the :ref:`translation-specific variables<template-translation-vars>` available in templates to achieve the same result:
id: Jika :setting:`USE_I18N` disetel menjadi ``True`` cache middleware per-situs akan :ref:`respect the active language<i18n-cache-key>`. Untuk etiket cetakan ``cache`` anda dapat menggunakan satu dari :ref:`translation-specific variables<template-translation-vars>` tersedia di cetakan untuk mencapai hasil sama:

source: The cache timeout can be a template variable, as long as the template variable resolves to an integer value. For example, if the template variable ``my_timeout`` is set to the value ``600``, then the following two examples are equivalent:
id: Cache waktu habis dapat berupa sebuah variabel cetakan, selama variabel cetakan mengatasi nilai integer. Sebagai contoh, jika variabel cetakan ``my_timeout`` disetel menjadi nilai ``600``, kemudian dua contoh berikut adalah setara:

source: This feature is useful in avoiding repetition in templates. You can set the timeout in a variable, in one place, and just reuse that value.
id: Fitur ini berguna dalam menghindari perulangan di cetakan. Anda dapat menyetel waktu habis di sebuah variabel, dalam satu tempat, dan hanya menggunakan nilai itu.

source: By default, the cache tag will try to use the cache called "template_fragments". If no such cache exists, it will fall back to using the default cache. You may select an alternate cache backend to use with the ``using`` keyword argument, which must be the last argument to the tag.
id: Secara awalan, etiket cache akan mencoba menggunakan cache dipanggil "template_fragments". Jika tidak ada cache seperti itu ada, itu akan kembali menggunakan cache awalan. Anda mungkin memilih sebuah backend cache bergantian untuk digunakan dengan argumen kata kunci ``using``, yang harus berupa argumen terakhir ke etiket.

source: It is considered an error to specify a cache name that is not configured.
id: Itu adalah dianggap sebuah kesalahan untuk menentukan sebuah nama cache yang tidak dikonfigurasi.

source: If you want to obtain the cache key used for a cached fragment, you can use ``make_template_fragment_key``. ``fragment_name`` is the same as second argument to the ``cache`` template tag; ``vary_on`` is a list of all additional arguments passed to the tag. This function can be useful for invalidating or overwriting a cached item, for example:
id: Jika anda ingin mengambil kunci cache digunakan untuk cache bagian, anda dapat menggunakan ``make_template_fragment_key``. ``fragment_name`` adalah sama sebagai argumen kedua pada etiket cetakan ``cache``; ``vary_on`` adalah sebuah daftar dari semua argumen tambahan dilewatkan etiket. Fungsi ini dapat berguna untuk membatalkan atau menimpa cache barang, sebagai contoh:

source: The low-level cache API
id: API cache tingkat-bawah

source: Sometimes, caching an entire rendered page doesn't gain you very much and is, in fact, inconvenient overkill.
id: Terkadang, cache sebuah seluruhnya halaman dibangun tidak mendapatkan anda sangat banyak, faktanya, nyaman berlebihan.

source: Perhaps, for instance, your site includes a view whose results depend on several expensive queries, the results of which change at different intervals. In this case, it would not be ideal to use the full-page caching that the per-site or per-view cache strategies offer, because you wouldn't want to cache the entire result (since some of the data changes often), but you'd still want to cache the results that rarely change.
id: Mungkin, sebagai contoh, situs anda menyertakan sebuah tampilan yang hasilnya bergantung pada beberpa permintaan mahal, hasil dari yang berubah pada rentang berbeda. Dalam kasus ini, itu akan tidak sesuai menggunakan cache halaman-penuh yang strategi cache per-situs atau per-tampilan tawarkan, karena anda tidak ingin cache keseluruhan hasil (sejak beberapa data sering berubah), tetapi anda akan masih ingin cache hasil yang jarang berubah.

source: For cases like this, Django exposes a simple, low-level cache API. You can use this API to store objects in the cache with any level of granularity you like. You can cache any Python object that can be pickled safely: strings, dictionaries, lists of model objects, and so forth. (Most common Python objects can be pickled; refer to the Python documentation for more information about pickling.)
id: Untuk kasus-kasus seperti ini, Django mengeluarkan sederhana, API cache tingkat-bawah. Anda dapat menggunakan API ini untuk menyimpan obyek-obyek di cache dengan tingkatan apapun lebih rinci anda suka. Anda dapat cache obyek Python apapun yang dapat di pickle dengan aman: string, kamus, daftar dari obyek model, dan sebagainya. (Kebanyakan obyek-pbyek Python umum dapat di pickle; mengacu pada dokumentasi Python untuk informasi lebih mengenai pickle.)

source: Accessing the cache
id: Mengakses cache

source: You can access the caches configured in the :setting:`CACHES` setting through a dict-like object: ``django.core.cache.caches``. Repeated requests for the same alias in the same thread will return the same object.
id: Anda dapat mengakses cache dikonfigurasikan di pengaturan :setting:`CACHES` melalui obyek seperti-kamus: ``django.core.cache.caches``. Permintaan berulang untuk nama lain sama di thread sama akan mengembalikab obyek sama.

source: If the named key does not exist, ``InvalidCacheBackendError`` will be raised.
id: Jika kunci yang dinamai tidak ada, ``InvalidCacheBackendError`` akan muncul.

source: To provide thread-safety, a different instance of the cache backend will be returned for each thread.
id: Untuk menyediakan thread-safety, sebuah instance berbeda dari backend cache akan dikembalikan untuk setiap thread.

source: As a shortcut, the default cache is available as ``django.core.cache.cache``::
id: Sebagai sebuah jalan pintas, cache awalan tersedia sebagai ``django.core.cache.cache``::

source: This object is equivalent to ``caches['default']``.
id: Obyek ini setara terhadap ``caches['default']``.

source: Basic usage
id: Penggunaan dasar

source: The basic interface is ``set(key, value, timeout)`` and ``get(key)``::
id: Antarmuka dasar adalah ``set(key, value, timeout)`` dan ``get(key)``::

source: ``key`` should be a ``str``, and ``value`` can be any picklable Python object.
id: ``key`` harus berupa sebuah ``str``, dan ``value`` dapat berupa obyek Python picklable.

source: The ``timeout`` argument is optional and defaults to the ``timeout`` argument of the appropriate backend in the :setting:`CACHES` setting (explained above). It's the number of seconds the value should be stored in the cache. Passing in ``None`` for ``timeout`` will cache the value forever. A ``timeout`` of ``0`` won't cache the value.
id: Argumen ``timeout`` adalah pilihan dan awalan pada argumen ``timeout`` dari backend sesuai di pengaturan :setting:`CACHES` (dijelaskan diatas). Itu adalah jumlah nilai kedua harus disimpan di cache. Melewatkan di ``None`` untuk ``timeout`` akan cache nilai selamanya. Sebuah ``timeout`` dari ``0`` tidak akan cache nilai.

source: If the object doesn't exist in the cache, ``cache.get()`` returns ``None``::
id: Jika obyek tidak ada di cache, ``cache.get()`` mengembalikan ``None``::

source: We advise against storing the literal value ``None`` in the cache, because you won't be able to distinguish between your stored ``None`` value and a cache miss signified by a return value of ``None``.
id: Kami menyarankan terhadap menyimpan nilai harfiah ``None`` di cache, karena anda tidak akan dapat membedakan diantara nilai ``None`` disimpan anda dan kehilangan sebuah cache ditunjukkan oleh nilai kembalian dari ``None``.

source: ``cache.get()`` can take a ``default`` argument. This specifies which value to return if the object doesn't exist in the cache::
id: ``cache.get()`` dapat mengambil sebuah argumen ``default``. Ini menentukan nilai mana untuk dikembalikan jika obyek tidak ada di cache::

source: To add a key only if it doesn't already exist, use the ``add()`` method. It takes the same parameters as ``set()``, but it will not attempt to update the cache if the key specified is already present::
id: Untuk menambahkan sebuah kunci hanya jika itu tidak ada, gunakan metode ``add()``. Itu mengambil parameter sama seperti ``set()``, tetapi itu tidak akan mencoba memperbaharui cache jika kunci ditentukan sudah ada::

source: If you need to know whether ``add()`` stored a value in the cache, you can check the return value. It will return ``True`` if the value was stored, ``False`` otherwise.
id: Jika anda butuh mengetahui apakah ``add()`` menyimpan sebuah nilai di cache, anda dapat memeriksa nilai kembalian. Itu akan mengembalikan ``True`` jika nilai telah disimpan, ``False`` sebaliknya.

source: If you want to get a key's value or set a value if the key isn't in the cache, there is the ``get_or_set()`` method. It takes the same parameters as ``get()`` but the default is set as the new cache value for that key, rather than simply returned::
id: Jika anda ingin mendapatkan nilai kunci atau sekumpulan nilai jika kunci tidak di cache, ada metode ``get_or_set()``. Itu mengambil parameter sama seperti ``get()`` tetapi awalan disetel sebagai nilai cache baru untuk kunci itu, daripada hanya dikembalikan::

source: You can also pass any callable as a *default* value::
id: Anda dapat juga melewatkan callable apapun sebagai nilai *awalan*::

source: There's also a ``get_many()`` interface that only hits the cache once. ``get_many()`` returns a dictionary with all the keys you asked for that actually exist in the cache (and haven't expired)::
id: Ada juga sebuah antarmuka ``get_many()`` yang hanya mengenai cache sekali. ``get_many()`` megnembalikan sebuah kamus dengan semua kunc-i-kunci anda minta untuk yang sebenarnya ada di cache (dan belum kadaluarsa)::

source: To set multiple values more efficiently, use ``set_many()`` to pass a dictionary of key-value pairs::
id: Untuk menyetel banyak nilai lebih efesien, gunakan ``set_many()`` untuk melewatkan sebuah kamus dari pasangan kunci-nilai::

source: Like ``cache.set()``, ``set_many()`` takes an optional ``timeout`` parameter.
id: Seperti ``cache.set()``, ``set_many()`` mengambil sebuah pilihan parameter ``timeout``.

source: On supported backends (memcached), ``set_many()`` returns a list of keys that failed to be inserted.
id: Pada backend didukung (memcached), ``set_many()`` megnembalikan sebuah daftar dari kunci-kunci yang gagal dimasukkan.

source: The return value containing list of failing keys was added.
id: Nilai kembalian mengandung daftar dari kunci-kunci gagal telah ditambahkan.

source: You can delete keys explicitly with ``delete()``. This is an easy way of clearing the cache for a particular object::
id: Anda dapat menghapus kunci-kunci dengan jelas dengan ``delete()``. Ini adalah cara mudah dari membersihkan cache untuk obyek tertentu::

source: If you want to clear a bunch of keys at once, ``delete_many()`` can take a list of keys to be cleared::
id: Jika anda ingin membersihkan seikat kunci sekaligus, ``delete_many()`` dapat mengambil sebuah daftar dari kunci untuk dibersihkan::

source: Finally, if you want to delete all the keys in the cache, use ``cache.clear()``. Be careful with this; ``clear()`` will remove *everything* from the cache, not just the keys set by your application. ::
id: Akhirnya, jika anda ingin menghapus semua kunci di cache, gunakan ``cache.clear()``. Hati-hatilah dengan ini; ``clear()`` akan memindahkan *semua* dari cache, bukan hanya kunci disetel oleh aplikasi anda. ::

source: You can also increment or decrement a key that already exists using the ``incr()`` or ``decr()`` methods, respectively. By default, the existing cache value will be incremented or decremented by 1. Other increment/decrement values can be specified by providing an argument to the increment/decrement call. A ValueError will be raised if you attempt to increment or decrement a nonexistent cache key.::
id: Anda juga dapat menaikkan atau menurunkan kunci yang sudah ada menggunakan metode ``incr()`` atau ``decr()``, masing-masing. Secara awalan, nilai cache yang ada akan dinaikkan atau diturunkan oleh 1. Nilai-nilai menaikkan/menurunkan lain dapat ditentukan dengan menyediakan sebuah argumen pada panggilan menaik/menurun. Sebuah ValueError akan dimuncukan untuk menaik atau menurun kunci cache tidak ada.::

source: ``incr()``/``decr()`` methods are not guaranteed to be atomic. On those backends that support atomic increment/decrement (most notably, the memcached backend), increment and decrement operations will be atomic. However, if the backend doesn't natively provide an increment/decrement operation, it will be implemented using a two-step retrieve/update.
id: Metide ``incr()``/``decr()`` tidak menjamin menjadi atom, Pada backend itu yang mendukung penaikan/penurunan atom (kebanyakan terutama backend memcache), penaikan dan penurunan akan menjadi atom. Bagaimanapun, jika backend tidak asli menyediakan sebuah tindakan penaikan/penurunan, itu akan diterapkan menggunakan dua-langkah mengambil/memperbaharui.

source: You can close the connection to your cache with ``close()`` if implemented by the cache backend.
id: Anda dapat menutup hubungan ke cache anda dengan ``close()`` jika diterapkan oleh backend cache.

source: For caches that don't implement ``close`` methods it is a no-op.
id: Untuk cache yang tidak menerapkan metode ``close`` itu adalah no-op.

source: Cache key prefixing
id: Awalan kunci cache

source: If you are sharing a cache instance between servers, or between your production and development environments, it's possible for data cached by one server to be used by another server. If the format of cached data is different between servers, this can lead to some very hard to diagnose problems.
id: Jika anda sedang berbagi sebuah instance cache diantara peladen, atau diantara lingkungan produksi dan pengembangan anda, itu memungkinkan untuk data cache oleh satu peladen untuk digunakan oleh peladen lain. Jika bentuk dari data cache berbeda diantara peladen, ini dapat membawa ke sangat keras dari mengenal masalah-masalah.

source: To prevent this, Django provides the ability to prefix all cache keys used by a server. When a particular cache key is saved or retrieved, Django will automatically prefix the cache key with the value of the :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` cache setting.
id: Untuk mencegah ini, Django menyediakan kemampuan untuk mengawali semua kunci cache digunakan oleh peladen. Ketika kunci cacge tertentu disimpan atau diambil, Django akan secara otomatis mengawali kunci cache dengan nilai dari pengaturan cache :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`.

source: By ensuring each Django instance has a different :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>`, you can ensure that there will be no collisions in cache values.
id: Dengan memastikan setiap instance Django mempunyai :setting:`KEY_PREFIX <CACHES-KEY_PREFIX>` berbeda, anda dapat memastikan bahwa akan tidak ada tubrukan di nilai-nilai cache.

source: Cache versioning
id: Memversikan cache

source: When you change running code that uses cached values, you may need to purge any existing cached values. The easiest way to do this is to flush the entire cache, but this can lead to the loss of cache values that are still valid and useful.
id: Ketika anda merubah menjalankan kode yang menggunakan nilai cache, anda mungkin butuh membersihkan nilai-nilai cache yang ada. Cara termudah melakukan ini adalah membilas keseluruhan cache, tetapi ini dapat membawa ke kehilangan nilai cache yang masih sah dan berguna.

source: Django provides a better way to target individual cache values. Django's cache framework has a system-wide version identifier, specified using the :setting:`VERSION <CACHES-VERSION>` cache setting. The value of this setting is automatically combined with the cache prefix and the user-provided cache key to obtain the final cache key.
id: Django menyediakan cara terbaik pada nilai-nilai cache masing-masing sasaran. Kerangka kerja cache Django mempunyai penciri versi lebar-sistem, ditentukan menggunakan pengaturan cache :setting:`VERSION <CACHES-VERSION>`. Nilai dari pengaturan ini secara otomatis dipadukan dengan awalan cache dan kunci cache disediakan-pengguna untuk mendapatkan kunci cache akhir.

source: By default, any key request will automatically include the site default cache key version. However, the primitive cache functions all include a ``version`` argument, so you can specify a particular cache key version to set or get. For example::
id: Secara awalan, apapun permintaan kunci akan secara otomaris menyertakan versi kunci cache awalan situs. Bagaimanapun, fungsi cache primitif semua menyertakan sebuah argumen ``version``, jadi anda dapt menentukan versi kunci cache tertentu untuk disetel atau didapatkan. Sebagai contoh::

source: The version of a specific key can be incremented and decremented using the ``incr_version()`` and ``decr_version()`` methods. This enables specific keys to be bumped to a new version, leaving other keys unaffected. Continuing our previous example::
id: Versi dari kunci tertentu ini dapat dinaikkan dan diturunkan menggunakan metode ``incr_version()`` dan ``decr_version()`` Ini mengadakan kunci-kunci tertentu untuk bertemu ke versi baru, meminggalkan kunci-kunci lain tidak terpengaruh. Melanjutkan contoh sebelumnya kami::

source: Cache key transformation
id: Perubahan kunci cache

source: As described in the previous two sections, the cache key provided by a user is not used verbatim -- it is combined with the cache prefix and key version to provide a final cache key. By default, the three parts are joined using colons to produce a final string::
id: Seperti digambarkan di dua bagian sebelumnya, kunci cache disediakan oleh seorang pengguna tidak digunakan secara harfiah -- itu dipadukan dengan awalan cache dan versi kunci untuk menyediakan kunci cache akhir. Secara awalan, tiga bagian digabungkan menggunakan titik dua untuk menghasilkan string akhir::
