Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: They look like this::
id: Mereka kelihatan seperti ini::

source: Some filters take an argument::
id: Beberapa saringan mengambil sebuah argumen::

source: Comments look like this::
id: Komentar kelihatan seperti ini::

source: Components
id: Komponen

source: Engine
id: Mesin

source: Template
id: Cetakan

source: Context
id: Konteks

source: Loaders
id: Pemuat

source: Controlling creation order for test databases
id: Mengendalikan pembuatan urutan untuk basisdata percobaan

source: Advanced features of ``TransactionTestCase``
id: Fitus-fitur lanjutan dari ``TransactionTestCase``

source: This attribute is a private API. It may be changed or removed without a deprecation period in the future, for instance to accommodate changes in application loading.
id: Atribut ini adalah API pribadi. Itu mungkin berubah atau dipindahkan tanpa masa pengusangan di masa datang, sebagai contoh untuk menampung perubahan-perubahan dalam memuat aplikasi.

source: It's used to optimize Django's own test suite, which contains hundreds of models but no relations between models in different applications.
id: Itu digunakan untuk memaksimalkan deretan percobaan sendiri Djangom, yang mengandung ratusan dari model-model tetapi tidak ada hubungan diantara model-model dalam aplikasi berbeda.

source: :data:`~django.db.models.signals.post_migrate` is fired before each test to create the content types and permissions for each model in available apps, in case they're missing.
id: :data:`~django.db.models.signals.post_migrate` dinyalakan sebelum setiap percobaan membuat jenis-jenis isi dan perizinan untuk setiap model dalam aplikasi tersedia, dalam kasus mereka hilang.

source: After each test, Django empties only tables corresponding to models in available apps. However, at the database level, truncation may cascade to related models in unavailable apps. Furthermore :data:`~django.db.models.signals.post_migrate` isn't fired; it will be fired by the next ``TransactionTestCase``, after the correct set of applications is selected.
id: Setelah setiap percobaan, Django mengkosongkan hanya tabel-tabel sesuai ke model dalam aplikasi tersedia. Bagaimanapun, pada tingkat basisdata, pemotongan mungkin menurun pada model-model terkait dalam aplikasi tidak tersedia. Lebih lanjut :data:`~django.db.models.signals.post_migrate` tidak dinyalakan. Itu akan dinyalakan oleh ``TransactionTestCase`` selanjutnya, setelah kumpulan benar dari aplikasi-aplikasi dipilih.

source: ``available_apps`` is mandatory in Django's own test suite.
id: ``available_apps`` adalah wajib dalam deretan percobaan Django sendiri.

source: This file contains the :doc:`Django settings </topics/settings>` required to run your app's tests.
id: Berkas ini mengandung :doc:`Django settings </topics/settings>` dibutuhkan untuk menjalankan aplikasi percobaan anda.

source: Again, this is a minimal example; your tests may require additional settings to run.
id: Kembali, ini adalah cotoh minimal; percobaan anda mungkin membutuhkan pengaturan tambahan untuk berjalan.

source: Using different testing frameworks
id: Menggunakan kerangka percobaan berbeda

source: Creating the test databases.
id: Membuat basisdata percobaan.

source: Running the :doc:`system checks </topics/checks>`.
id: Menjalankan :doc:`system checks </topics/checks>`.

source: Running the tests that were found.
id: Menjalankan percobaan yang ditemukan.

source: Destroying the test databases.
id: Menghancurkan basisdata percobaan.

source: Run the test suite.
id: Jalankan deretan percobaan.

source: This method should return the number of tests that failed.
id: Cara ini harus mengembalikan angka dari percobaan yang gagal.

source: Constructs a test suite that matches the test labels provided.
id: Membangun rangkaian percobaan yang cocok dengan label percobaan disediakan.

source: ``test_labels`` is a list of strings describing the tests to be run. A test label can take one of four forms:
id: ``test_labels`` adalah daftar dari string menggambarkan percobaan untuk dijalankan. Sebuah label percobaan dapat mengambil satu dari empat bentuk:

source: ``path.to.test_module.TestCase.test_method`` -- Run a single test method in a test case.
id: ``path.to.test_module.TestCase.test_method`` -- Jalankan metode percobaan tunggal dalam kasus percobaan.

source: ``path.to.test_module.TestCase`` -- Run all the test methods in a test case.
id: ``path.to.test_module.TestCase`` -- Jalankan semua metode percobaan dalam kasus percobaan.

source: ``path.to.module`` -- Search for and run all tests in the named Python package or module.
id: ``path.to.module`` -- Cari dan jalankan semua percobaan yang bernama paket atau modul Python.

source: ``path/to/directory`` -- Search for and run all tests below the named directory.
id: ``path/to/directory`` -- Cari dan jalankan semua percobaan dibawan direktori dinamai.

source: Returns a ``TestSuite`` instance ready to be run.
id: Mengembalikan sebuah instance ``TestSuite``untuk dijalankan.

source: Creates the test databases by calling :func:`~django.test.utils.setup_databases`.
id: Membuat basisdata percobaan dengan memanggil :func:`~django.test.utils.setup_databases`.

source: Runs the :doc:`system checks </topics/checks>`.
id: Menjalankan :doc:`system checks </topics/checks>`.

source: Runs the test suite.
id: Jalankan deretan percobaan.

source: Returns the result produced by the running the test suite.
id: Mengembalikan hasil dihasilkan dari menjalankan deretan percobaan.

source: Returns the keyword arguments to instantiate the ``DiscoverRunner.test_runner`` with.
id: Mengembalikan argumen kata kunci untuk menginstansiasi dengan ``DiscoverRunner.test_runner``.

source: Destroys the test databases, restoring pre-test conditions by calling :func:`~django.test.utils.teardown_databases`.
id: Menghancurkan basisdata percobaan, menyimpan kembali keadaan pra-percobaan dengan memanggil :func:`~django.test.utils.teardown_databases`.

source: Restores the pre-test environment.
id: Menyimpan kembali lingkungan pra-percobaan.

source: Computes and returns a return code based on a test suite, and the result from that test suite.
id: Menghitung dan mengembalikan kode balikan berdasarkan pada deretan percobaan, dan hasil dari deretan percobaan itu.

source: Testing utilities
id: Percobaan keperluan

source: To assist in the creation of your own test runner, Django provides a number of utility methods in the ``django.test.utils`` module.
id: Untuk membantu dalam pembuatan dari pejalan percobaan anda sendiri, Django menyediakan sejumlah metode utilitas dalam modul ``django.test.utils``.

source: If ``debug`` isn't ``None``, the :setting:`DEBUG` setting is updated to its value.
id: Jika ``debug`` bukan ``None``, pengaturan :setting:`DEBUG` diperbaharui pada nilainya.

source: Creates the test databases.
id: Membuat basisdata percobaan.

source: Destroys the test databases, restoring pre-test conditions.
id: Menghancurkan basisdata percobaan, menyimpan kembali keadaan pra-pengujian.

source: ``old_config`` is a data structure defining the changes in the database configuration that need to be reversed. It's the return value of the :meth:`setup_databases` method.
id: ``old_config`` adalah struktur data menentukan peribahan dalam konfigurasi basisdata yang butuh di balik. Nilai kembaliannya dari metode :meth:`setup_databases`.

source: Creates a new test database and runs ``migrate`` against it.
id: Membuat percobaan basisdata baru dan menjalankan ``migrate`` terhadapnya.

source: ``verbosity`` has the same behavior as in ``run_tests()``.
id: ``verbosity`` mempunyai perilaku sama seperti dalam ``run_tests()``.

source: ``serialize`` determines if Django serializes the database into an in-memory JSON string before running tests (used to restore the database state between tests if you don't have transactions). You can set this to ``False`` to speed up creation time if you don't have any test classes with :ref:`serialized_rollback=True <test-case-serialized-rollback>`.
id: ``serialize`` menentukan jika Django serialkan basisdata menjadi sebuah string JSON dalam-memori sebelum menjalankan percobaan (digunakan untuk menyimpan kembali keadaan basisdata jika anda tidak mempunyai transaksi). Anda dapat menyetel ini menjadi ``False`` untuk mempercepat waktu pembuatan jika anda tidak mempunyai kelas-kelas percobaan dengan :ref:`serialized_rollback=True 1`.

source: Returns the name of the test database that it created.
id: Mengembalikan nama dari basisdata percobaan yang dia buat.

source: Integration with ``coverage.py``
id: Perpaduan dengan ``coverage.py``

source: Note that some Django code was executed while running tests, but it is not listed here because of the ``source`` flag passed to the previous command.
id: Catat bahwa beberapa kode Django telah dijalankan selagi menjalankan percobaan, tetapi itu tidak didaftarkan disini karena bendera ``source`` dilewatkan ke perintah sebelumnya.

source: Testing in Django
id: Percobaan di Django

source: When you're writing new code, you can use tests to validate your code works as expected.
id: Ketika anda sedang menulis kode baru, anda dapat menggunakan percobaan untuk memeriksa kode anda bekerja sesuai harapan.

source: The best part is, it's really easy.
id: Bagian terbaiknya adalah, dia sangat mudah.

source: Writing and running tests
id: Menulis dan menjalankan percobaan

source: The :doc:`testing tutorial </intro/tutorial05>`, the :doc:`testing tools reference </topics/testing/tools>`, and the :doc:`advanced testing topics </topics/testing/advanced>`.
id: :doc:`testing tutorial </intro/tutorial05>`, the :doc:`testing tools reference </topics/testing/tools>`, dan :doc:`advanced testing topics </topics/testing/advanced>`.

source: This document is split into two primary sections. First, we explain how to write tests with Django. Then, we explain how to run them.
id: Dokumen ini dipisah menjadi dua bagian utama. Pertama, kami menjelaskan bagaimana menulis percobaan dengan Django. Kemudian, kami menjelaskan bagaimana menjalankan mereka.

source: For more details about :mod:`unittest`, see the Python documentation.
id: Untuk lebih rinci tentang :mod:`unittest`, lihat dokumentasi Python.

source: Where should the tests live?
id: Dimana seharusnya percobaan berada?

source: See also :ref:`testing-reusable-applications`.
id: Lihat juga :ref:`testing-reusable-applications`.

source: Running tests
id: Menjalankan percobaan

source: You can also provide a path to a directory to discover tests below that directory::
id: Anda dapat juga menyediakan jalur ke direktori untuk menemukan percobaan dibawah direktori itu::

source: Test with warnings enabled
id: Percobaan dengan peringatan diadakan

source: The test database
id: Basisdata percobaan

source: Finding data from your production database when running tests?
id: Menemukan data dari basisdata produksi anda ketika menjalankan percobaan?

source: This also applies to customized implementations of :meth:`~django.apps.AppConfig.ready()`.
id: Ini juga berlaku pada penerapan disesuaikan dari :meth:`~django.apps.AppConfig.ready()`.

source: The :ref:`advanced multi-db testing topics <topics-testing-advanced-multidb>`.
id: :ref:`advanced multi-db testing topics <topics-testing-advanced-multidb>`.

source: Order in which tests are executed
id: Urutkan dimana percobaan dijalankan

source: All :class:`~django.test.TestCase` subclasses are run first.
id: Semua subkelas :class:`~django.test.TestCase` berjalan pertama.

source: Other test conditions
id: Kondisi percobaan lain

source: Understanding the test output
id: Memahami keluaran percobaan

source: Once the test database has been created, Django will run your tests. If everything goes well, you'll see something like this::
id: Sekali basisdata telah dibuat, Django akan menjalankan percobaan anda. Jika semuanya berjalan baik, anda akan melihat sesuatu seperti ini::

source: If there are test failures, however, you'll see full details about which tests failed::
id: Jika ada kegagalan percobaan, bagaimanapun, anda akan melihat rincian penuh tetnang percobaan mana yang gagal::

source: Speeding up the tests
id: Mempercepat percobaan

source: Running tests in parallel
id: Menjalankan percobaan secara sejalan

source: Password hashing
id: Campuran sandi

source: Testing tools
id: Alat percobaan

source: Django provides a small set of tools that come in handy when writing tests.
id: Django menyediakan kumpulan kecil alat yang datang dalam mudah ketika menulis percobaan.

source: The test client
id: Klien percobaan

source: Some of the things you can do with the test client are:
id: Beberapa hal anda dapat lakukan dengan klien percobaan adalah:

source: Overview and a quick example
id: Ikhtisar dan contoh cepat

source: Note a few important things about how the test client works:
id: Catatan sedikit hal-hal penting tentang bagaimana percobaan klien bekerja:

source: This is incorrect::
id: Ini tidak benar::

source: By default, the test client will disable any CSRF checks performed by your site.
id: Secara awalan, klien percobaan akan meniadakan pemeriksaan CSRF apapun dilakukan oleh situs anda.

source: Making requests
id: Membuat permintaan

source: Use the ``django.test.Client`` class to make requests.
id: Gunakan kelas ``django.test.Client`` untuk membuat permintaan.

source: ...with this POST data::
id: ...dengan data POST ini::

source: The ``follow``, ``secure`` and ``extra`` arguments act the same as for :meth:`Client.get`.
id: Argumen-argumen ``follow``, ``secure`` dan ``extra`` bertindak sama seperti :meth:`Client.get`.

source: Finally, you'll need to remember to create user accounts before you can use this method. As we explained above, the test runner is executed using a test database, which contains no users by default. As a result, user accounts that are valid on your production site will not work under test conditions. You'll need to create users as part of the test suite -- either manually (using the Django model API) or with a test fixture. Remember that if you want your test user to have a password, you can't set the user's password by setting the password attribute directly -- you must use the :meth:`~django.contrib.auth.models.User.set_password()` function to store a correctly hashed password. Alternatively, you can use the :meth:`~django.contrib.auth.models.UserManager.create_user` helper method to create a new user with a correctly hashed password.
id: Akhirnya, anda akan butuh mengingat untuk membuat akun pengguna sebelum anda dapat menggunakan cara ini. Seperti kami jelaskan diatas, percobaan pelari dijalankan menggunakan basisdata percobaan, yang mengandung tidak ada pengguna secara awal. Sebagai hasilnya, akun pengguna sah pada situs produksi anda tidak akan bekerja dibawah kondisi percobaan. Anda akan butuh membuat pengguna sebagai bagian dari deretan percobaan -- salah satu secara manual (menggunakan API model Django) atau dengan perbaikan percobaan. Ingat bahwa jika anda ingin percobaan pengguna anda mempunyai sandi, anda tidak dapat mengatur sandi pengguna dengan mengatur atribut sandi secara langsung -- anda harus menggunakan fungsi :meth:`~django.contrib.auth.models.User.set_password()` untuk menyimpan sandi campuran dengan benar. Jalan lain, anda dapat menggunakan cara pembantu :meth:`~django.contrib.auth.models.UserManager.create_user` untuk membuat sebuah pengguna baru dengan sandi campuran dengan benar.

source: If your site uses Django's :doc:`authentication system</topics/auth/index>`, you can use the ``force_login()`` method to simulate the effect of a user logging into the site. Use this method instead of :meth:`login` when a test requires a user be logged in and the details of how a user logged in aren't important.
id: Jika situs anda menggunakan :doc:`sistem pembuktian keaslian</topics/auth/index>` Django, anda dapat menggunakan cara ``force_login()`` untuk menirukan pengaruh dari pengguna masuk kedalam situs. Gunakan cara ini daripada :meth:`login` ketika sebuah percobaan membutuhkan pengguna untuk masuk dan rincian bagaimana sebuah pengguna masuk tidaklah penting.

source: Unlike ``login()``, this method skips the authentication and verification steps: inactive users (:attr:`is_active=False <django.contrib.auth.models.User.is_active>`) are permitted to login and the user's credentials don't need to be provided.
id: Tidak seperti ``login()``, cara ini melewati langkah pembuktian keaslian dan pengecekan: pengguna tidak aktif (:attr:`is_active=False <django.contrib.auth.models.User.is_active>`) diizinkan untuk masuk dan mandat pengguna tidak butuh disediakan.

source: Testing responses
id: Tanggapan percobaan

source: Not using Django templates?
id: Tidak menggunakan cetakan Django?

source: The request data that stimulated the response.
id: Data diminta yang merangsang tanggapan.

source: The HTTP status of the response, as an integer. For a full list of defined codes, see the `IANA status code registry`_.
id: Keadaan HTTP dari tanggapan, sebagai sebuah integer. Untuk daftar penuh dari kode yang ditentukan, lihat `IANA status code registry`_.

source: If the given URL is not found, accessing this attribute will raise a :exc:`~django.urls.Resolver404` exception.
id: Jika URL diberikan tidak ditemukan, mengakses atribut ini akan memunculkan pengecualian :exc:`~django.urls.Resolver404`.

source: Exceptions
id: Pengecualian

source: Persistent state
id: Keadaan gigih

source: Setting the language
id: Mengatur bahasa

source: or by including the ``Accept-Language`` HTTP header in the request::
id: atau dengan menyertakan kepala HTTP ``Accept-Language`` dalam permintaan::

source: More details are in :ref:`how-django-discovers-language-preference`.
id: Lebih rinci adalah dalam :ref:`how-django-discovers-language-preference`.

source: If the middleware isn't enabled, the active language may be set using :func:`.translation.override`::
id: Jika middleware tidak diadakan, bahasa aktif mungkin disetel menggunakan :func:`.translation.override`::

source: More details are in :ref:`explicitly-setting-the-active-language`.
id: Lebih rinci adalah di :ref:`explicitly-setting-the-active-language`.

source: The following is a simple unit test using the test client::
id: Berikut adalah percobaan satuan sederhana menggunakan percobaan klien::

source: Provided test case classes
id: Disediakan kelas-kelas percobaan kasus

source: Hierarchy of Django unit testing classes
id: Susunan dari satuan kelas-kelas percobaan Django

source: A subclass of :class:`unittest.TestCase` that adds this functionality:
id: Sebuah subkelas :class:`unittest.TestCase`yang menambahkan kegunaan ini:

source: Some useful assertions like:
id: Beberapa penegasan berguna seperti:

source: Checking that a callable :meth:`raises a certain exception <SimpleTestCase.assertRaisesMessage>`.
id: Memeriksa bahwa sebuah callable :meth:`raises a certain exception <SimpleTestCase.assertRaisesMessage>`.

source: Testing form field :meth:`rendering and error treatment <SimpleTestCase.assertFieldOutput>`.
id: Menguji bidang formulir :meth:`rendering and error treatment <SimpleTestCase.assertFieldOutput>`.

source: Testing :meth:`HTML responses for the presence/lack of a given fragment <SimpleTestCase.assertContains>`.
id: Menguji :meth:`HTML responses for the presence/lack of a given fragment <SimpleTestCase.assertContains>`.

source: Verifying that a template :meth:`has/hasn't been used to generate a given response content <SimpleTestCase.assertTemplateUsed>`.
id: Memeriksa bahwa sebuah cetakan :meth:`has/hasn't been used to generate a given response content <SimpleTestCase.assertTemplateUsed>`.

source: Robustly testing two :meth:`JSON fragments <SimpleTestCase.assertJSONEqual>` for equality.
id: Sangat kuat mencoba dua :meth:`JSON fragments <SimpleTestCase.assertJSONEqual>` untuk kesetaraan.

source: The ability to run tests with :ref:`modified settings <overriding-settings>`.
id: Kemampuan menjalankan percobaan dengan :ref:`modified settings 1`.

source: Using the :attr:`~SimpleTestCase.client` :class:`~django.test.Client`.
id: Menggunakan :attr:`~SimpleTestCase.client` :class:`~django.test.Client`.

source: ``TransactionTestCase`` inherits from :class:`~django.test.SimpleTestCase` to add some database-specific features:
id: ``TransactionTestCase`` mewarisi dari :class:`~django.test.SimpleTestCase`untuk menambah beberapa fitur-fitur khusus-basisdata:

source: Database :attr:`~TransactionTestCase.fixtures`.
id: Basisdata :attr:`~TransactionTestCase.fixtures`.

source: Test :ref:`skipping based on database backend features <skipping-tests>`.
id: Mencoba :class:`~django.test.SimpleTestCase`

source: Apps :ref:`will not see their data reloaded <test-case-serialized-rollback>`; if you need this functionality (for example, third-party apps should enable this) you can set ``serialized_rollback = True`` inside the ``TestCase`` body.
id: Aplikas-aplikasi :ref:`will not see their data reloaded 1`; jika anda butuh kegunaan ini (sebagai contoh, aplikasi-aplikasi pihak-ketiga harus mengadakan ini) anda dapat mensetel ``serialized_rollback = True`` didalam badan ``TestCase``.

source: It also provides an additional method:
id: Itu juga menyediakan sebuah metode tambahan:

source: The code for this test may look as follows::
id: Kode untuk percobaan ini mungkin terlihat seperti berikut::

source: Finally, you may run the test as follows:
id: Akhirnya, anda dapat menjalankan percobaan sebagai berikut:

source: This example will automatically open Firefox then go to the login page, enter the credentials and press the "Log in" button. Selenium offers other drivers in case you do not have Firefox installed or wish to use another browser. The example above is just a tiny fraction of what the Selenium client can do; check out the `full reference`_ for more details.
id: Contoh ini akan otomatis membuka Firefox kemudian pergi ke halaman masuk, masuk mandat dan tekan tombol "Log in". Selenium menawarkan driver-driver lain dalam kasus anda tidak mempunyai Firefox terpasang atau berharap menggunakan peramban lain. Contoh diatas hanya bagian kecil dari apa klien Selenium dapat lakukan; periksa `full reference`_ untuk rincian lebih.

source: Test cases features
id: Fitur percobaan kasus

source: Default test client
id: Percobaan klien awal

source: ...you can just refer to ``self.client``, like so::
id: ...anda dapat hanya mengacu ke ``self.client``, seperti itu::

source: Customizing the test client
id: Menyesuaian klien percobaan

source: Here's specifically what will happen:
id: Ini adalah secara khusus apa yang akan terjadi:

source: URLconf configuration
id: Konfigurasi URLconf

source: Multi-database support
id: Dukungan banyak-basisdata

source: Django sets up a test database corresponding to every database that is defined in the :setting:`DATABASES` definition in your settings file. However, a big part of the time taken to run a Django TestCase is consumed by the call to ``flush`` that ensures that you have a clean database at the start of each test run. If you have multiple databases, multiple flushes are required (one for each database), which can be a time consuming activity -- especially if your tests don't need to test multi-database activity.
id: Django menyetel basisdata percobaan sesuai pada setiap basisdata yang ditentukan dalam pengertian :setting:`DATABASES`dalam berkas pengaturan anda. Bagaimanapun, bagian besar dari waktu diambil untuk menjalankan Django TestCase diskonsumsi dengan memanggil ``flush`` yang memastikan bahwa anda telah memiliki basisdata bersih pada awal dari setiap percobaan berjalan. Jika anda mempunyai banyak basisdata, banyak flush dibutuhkan (satu untuk setiap basisdata), yang aktiviatsnya dapat memakan waktu -- khususnya jika percobaan anda tidak butuh mencoba aktivitas banyak-basisdata.
