Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: The object ``django.db.connection`` represents the default database connection. To use the database connection, call ``connection.cursor()`` to get a cursor object. Then, call ``cursor.execute(sql, [params])`` to execute the SQL and ``cursor.fetchone()`` or ``cursor.fetchall()`` to return the resulting rows.
id: Obyek ``django.db.connection``mewakili hubungan basisdata awalan. Untuk menggunakan hubungan basisdata, panggil ``connection.cursor()`` untuk mendapatkan obyek kursor. Kemudian, panggil ``cursor.execute(sql, [params])`` untuk menjalankan SQL dan ``cursor.fetchone()`` atau ``cursor.fetchall()`` untuk mengembalikan baris hasil.

source: To protect against SQL injection, you must not include quotes around the ``%s`` placeholders in the SQL string.
id: Untuk melindungi terhadap penyuntikan SQL, anda tidak harus menyertakan kutipan disekitar placeholder ``%s``dalam string SQL.

source: Note that if you want to include literal percent signs in the query, you have to double them in the case you are passing parameters::
id: Catat bahwa jika anda ingin menyertakan harfiah tanda persen dalam permintaan, anda telah menggandakan mereka dalam kasus anda sedang melewatkan parameter::

source: If you are using :doc:`more than one database </topics/db/multi-db>`, you can use ``django.db.connections`` to obtain the connection (and cursor) for a specific database. ``django.db.connections`` is a dictionary-like object that allows you to retrieve a specific connection using its alias::
id: Jika anda sedang menggunakan :doc:`more than one database 1`, anda dapat menggunakan ``django.db.connections`` untuk mengambil hubungan (dan kursor ) untuk basisdata khusus. ``django.db.connections`` adalah obyek seperti-dictionary yang mengizinkan anda mengambil hubungan khusus menggunakan nama lainnya::

source: By default, the Python DB API will return results without their field names, which means you end up with a ``list`` of values, rather than a ``dict``. At a small performance and memory cost, you can return results as a ``dict`` by using something like this::
id: Secara awalan, API DB Python akan mengembalikan hasil tanpa nama-nama bidang mereka, yang berarti anda jadi ``list`` dari nilai, daripada ``dict``. Pada penampilan kecil dan biaya memori, anda dapat mengembalikan hasil sebagai ``dict`` dengan menggunakan sesuatu seperti ini::

source: Another option is to use :func:`collections.namedtuple` from the Python standard library. A ``namedtuple`` is a tuple-like object that has fields accessible by attribute lookup; it's also indexable and iterable. Results are immutable and accessible by field names or indices, which might be useful::
id: Pilihan lain adalah menggunakan :func:`collections.namedtuple` dari pustaka standar Python. Sebuah ``namedtuple`` adalah obyek seperti-tuple yang mempunyai bidang-bidang diakses oleh atribut pencarian; itu juga dapat diindeks dan berulang. Hasilnya adalah tetap dan dapat diakses oleh bidang nama atau indeks, yang mungkin berguna::

source: Here is an example of the difference between the three::
id: Ini adalah sebuah contoh perbedaan diantara tiga::

source: Connections and cursors
id: Hubungan dan kursor

source: ``connection`` and ``cursor`` mostly implement the standard Python DB-API described in :pep:`249` except when it comes to :doc:`transaction handling </topics/db/transactions>`.
id: ``connection`` dan ``cursor`` kebanyakan menerapkan API-DB Python standar digambarkan dalam pep:`249` kecuali ketika itu datang pada :doc:`transaction handling 1`.

source: If you're not familiar with the Python DB-API, note that the SQL statement in ``cursor.execute()`` uses placeholders, ``"%s"``, rather than adding parameters directly within the SQL. If you use this technique, the underlying database library will automatically escape your parameters as necessary.
id: Jika anda akrab dengan DB-API Python, catat bahwa pernyataan SQL dalam ``cursor.execute()`` menggunakan placeholder, ``"%s"``, daripada menambahkan parameter langsung dalam SQL. Jika anda menggunakan teknik ini, pustaka basisdata pokok akan otomatis meloloskan parameter anda seperlunya.

source: Also note that Django expects the ``"%s"`` placeholder, *not* the ``"?"`` placeholder, which is used by the SQLite Python bindings. This is for the sake of consistency and sanity.
id: Juga catat bahwa Django mengharapkan placeholder ``"%s"``, *bukan* placeholder ``"?"``, yang digunakan oleh pengikatan Python SQLite. Ini adalah untuk kebaikan dari ketetapan dan kesegaran.

source: Using a cursor as a context manager::
id: Menggunakan sebuah kursor sebagai pengelola konteks::

source: is equivalent to::
id: setara pada::

source: Calling stored procedures
id: Memanggil prosedur penyimpanan

source: Calls a database stored procedure with the given name. A sequence (``params``) or dictionary (``kparams``) of input parameters may be provided. Most databases don't support ``kparams``. Of Django's built-in backends, only Oracle supports it.
id: Panggilan sebuah store procedure dengan nama diberikan. Sebuah urutan (``params``) atau dictionary (``kparams``) dari parameter masukan mungkin disediakan. Kebanyakan basisdata tidak mendukung ``kparams``. Dari backend siap-pakai Django, hanya Oracle mendukung itu.

source: For example, given this stored procedure in an Oracle database:
id: Sebagai contoh, diberikan ini prosedur penyimpanan dalam sebuah basisdata Oracle:

source: This will call it::
id: Ini akan memanggil itu::

source: The ``kparams`` argument was added.
id: Argumen ``kparams`` telah ditambahkan.

source: A common paradigm for optimizing performance in database systems is the use of `tablespaces`_ to organize disk layout.
id: Contoh umum untuk mengoptimalkan penampilan dalam sistem basisdata adalah menggunakan `tablespaces`_ untuk mengorganisir tata letak cakram.

source: Django does not create the tablespaces for you. Please refer to your database engine's documentation for details on creating and managing tablespaces.
id: Django tidak membuat tablespace untuk anda. Silahkan mengacu ke dokumentasi mesis basisdata anda untuk rincian di membuat dan mengelola tablespace.

source: Declaring tablespaces for tables
id: Mengumumkan tablespace untuk table

source: A tablespace can be specified for the table generated by a model by supplying the :attr:`~django.db.models.Options.db_tablespace` option inside the model's ``class Meta``. This option also affects tables automatically created for :class:`~django.db.models.ManyToManyField`\ s in the model.
id: Sebuah tablespace dapat ditentukan untuk tabel dibangkitkan oleh model dengan menyokong pilihan :attr:`~django.db.models.Options.db_tablespace` didalam ``class Meta`` model. Pilihan ini juga mempengaruhi tabel-tabel otomatis dibuat untuk :class:`~django.db.models.ManyToManyField` dalam model.

source: You can use the :setting:`DEFAULT_TABLESPACE` setting to specify a default value for :attr:`~django.db.models.Options.db_tablespace`. This is useful for setting a tablespace for the built-in Django apps and other applications whose code you cannot control.
id: Anda dapat menggunakan pengaturan :setting:`DEFAULT_TABLESPACE` untuk menentukan nilai untuk :attr:`~django.db.models.Options.db_tablespace`.Ini berguna untuk mengatur tablespace untuk aplikasi Django siap-pakai dan aplikasi lain yang kodenya tidak dapat dikendalikan.

source: Declaring tablespaces for indexes
id: Mengumumkan tablespace untuk indeks

source: You can pass the :attr:`~django.db.models.Index.db_tablespace` option to an ``Index`` constructor to specify the name of a tablespace to use for the index. For single field indexes, you can pass the :attr:`~django.db.models.Field.db_tablespace` option to a ``Field`` constructor to specify an alternate tablespace for the field's column index. If the column doesn't have an index, the option is ignored.
id: Anda dapat melewatkan pilihan :attr:`~django.db.models.Index.db_tablespace`ke sebuah pembangun ``Index`` untuk menentukan nama dari tablespace untuk digunakan untuk indeks. Untuk pengindeksan bidang tunggal, anda dapat melewatkan pilihan :attr:`~django.db.models.Field.db_tablespace` ke sebuah pembangun ``Field`` untuk menentukan sebuah tablespace lain untuk indeks kolom bidang. Jika kolom tidak memiliki sebuah indeks, pilihan diabaikan.

source: You can use the :setting:`DEFAULT_INDEX_TABLESPACE` setting to specify a default value for :attr:`~django.db.models.Field.db_tablespace`.
id: Anda dapat menggunakan pengaturan :setting:`DEFAULT_INDEX_TABLESPACE` untuk menentukan nilai awalan untuk :attr:`~django.db.models.Field.db_tablespace`.

source: If :attr:`~django.db.models.Field.db_tablespace` isn't specified and you didn't set :setting:`DEFAULT_INDEX_TABLESPACE`, the index is created in the same tablespace as the tables.
id: Jika :attr:`~django.db.models.Field.db_tablespace`tidak ditentukan dan anda tidak menyetel :setting:`DEFAULT_INDEX_TABLESPACE`, indeks dibuat dalam tablespace sama seperti tabel-tabel.

source: In this example, the tables generated by the ``TablespaceExample`` model (i.e. the model table and the many-to-many table) would be stored in the ``tables`` tablespace. The index for the name field and the indexes on the many-to-many table would be stored in the ``indexes`` tablespace. The ``data`` field would also generate an index, but no tablespace for it is specified, so it would be stored in the model tablespace ``tables`` by default. The index for the ``shortcut`` field would be stored in the ``other_indexes`` tablespace.
id: Dalam contoh ini, tabel-tabel dibangkitkan oleh model ``TablespaceExample`` (yaitu tabel model dan tabel many-to-many) akan disimpan dalam tablespace ``tables``. Indeks untuk bidang nama dan indeks-indeks pada tabel many-to-many akan disimpan dalam tablespace ``indexes``. Bidang ``data`` akan juga dibangkitkan dalam tablespace model ``tables`` secara awalan. Indeks untuk bidang ``shortcut`` akan disimpan dalam tablespace ``other_indexes``.

source: Database support
id: Dukungan basisdata

source: PostgreSQL and Oracle support tablespaces. SQLite and MySQL don't.
id: PostgreSQL dan Oracle mendukung tablespace. SQLite dan MySQL tidak.

source: When you use a backend that lacks support for tablespaces, Django ignores all tablespace-related options.
id: Ketika anda menggunakan backend yang kekurangan dukungan untuk tablespace, Django mengabaikan semua pilihan terkait-tablespace.

source: Database transactions
id: Transaksi basisdata

source: Django gives you a few ways to control how database transactions are managed.
id: Django memberikan anda sedikit cara mengendalikan bagaimana transaksi basisdata dikelola.

source: Managing database transactions
id: Mengelola transaksi basisdata

source: Django's default transaction behavior
id: Kebiasaan transaksi awal Django

source: Django's default behavior is to run in autocommit mode. Each query is immediately committed to the database, unless a transaction is active. :ref:`See below for details <autocommit-details>`.
id: Kebiasaan awal Django adalah menjalankan suasana penyeraahn otomatis. Setiap query segera diserahkan ke basisdata, meskipun transaksi adalah aktif. :ref:`Lihat dibawah ini untuk rincian <autocommit-details>`.

source: Django uses transactions or savepoints automatically to guarantee the integrity of ORM operations that require multiple queries, especially :ref:`delete() <topics-db-queries-delete>` and :ref:`update() <topics-db-queries-update>` queries.
id: Django menggunakan transaksi atau titiksimpan otomatis untuk menjamin kesatuan dari operasi ORM yang membutuhkan banyak query, khususnya query :ref:`delete() <topics-db-queries-delete>` dan :ref:`update() <topics-db-queries-update>`.

source: Django's :class:`~django.test.TestCase` class also wraps each test in a transaction for performance reasons.
id: Kelas :class:`~django.test.TestCase`Django juga membungkus setiap percobaan dalam sebuah transaksi untuk alasan penampilan.

source: Tying transactions to HTTP requests
id: Mengikat transaksi pada permintaan HTTP

source: A common way to handle transactions on the web is to wrap each request in a transaction. Set :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` to ``True`` in the configuration of each database for which you want to enable this behavior.
id: Cara umum untuk menangani transaksi di jaringan adalah membungkus setiap permintaan di transaksi. Setel :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` ke ``True`` di konfigurasi dari setiap basisdata untuk anda ingin adakan kebiasaan ini.

source: It works like this. Before calling a view function, Django starts a transaction. If the response is produced without problems, Django commits the transaction. If the view produces an exception, Django rolls back the transaction.
id: Itu bekerja seperti ini. Sebelum memanggil fungsi tampilan, Django memulai sebuah transaksi. Jika tanggapan adalah dihasilkan tanpa masalah, Django melakukan transaksi. Jika tampilan menghasilkan sebuah pengecualian, Django memutar kembali transaksi.

source: You may perform subtransactions using savepoints in your view code, typically with the :func:`atomic` context manager. However, at the end of the view, either all or none of the changes will be committed.
id: Anda dapat melakukan subtransaksi menggunakan savepoint dalam kode tampilan anda. khususnya dengan pengelola konteks :func:`atomic`. Bagaimanapun, pada akhir tampilan, baik semua tau tidak satupun perubahan akan di jalankan.

source: While the simplicity of this transaction model is appealing, it also makes it inefficient when traffic increases. Opening a transaction for every view has some overhead. The impact on performance depends on the query patterns of your application and on how well your database handles locking.
id: Selagi kesederhanaan dari model transaksi ini menarik, itu juga membuat itu tidak efesien ketika lalu lintas menarik. Membuka sebuah transaksi untuk setiap tampilan dan beberapa overhead. Dampak pada penampilan bergantingan pada pola permintaan dari aplikasi anda dan pada sebagaimana baik penanganan basisdata anda mengunci.

source: Per-request transactions and streaming responses
id: Transaksi per-permintaan dan mengalirkan tanggapan

source: When a view returns a :class:`~django.http.StreamingHttpResponse`, reading the contents of the response will often execute code to generate the content. Since the view has already returned, such code runs outside of the transaction.
id: Ketika tampilan mengembalikan sebuah :class:`~django.http.StreamingHttpResponse`, membaca isi dari tanggapan akan sering menjalankan kode untuk membangkitkan isi. Sejak tampilan telah dikembalikan, kode seperti itu berjalan diluar transaksi.

source: Generally speaking, it isn't advisable to write to the database while generating a streaming response, since there's no sensible way to handle errors after starting to send the response.
id: Secara umum, itu tidak disarankan menulis ke basisdata selagi membangkitkan aliran tanggapan, sejak tidak ada cara sepaham menangani kesalahan setelah mulai mengirim tanggapan.

source: In practice, this feature simply wraps every view function in the :func:`atomic` decorator described below.
id: Dalam praktiknya, fitur ini cukup membungkus setiap fungsi tampilan dalam penghias :func:`atomic` digambarkan dibawah.

source: Note that only the execution of your view is enclosed in the transactions. Middleware runs outside of the transaction, and so does the rendering of template responses.
id: Catat bahwa hanya penjalanan dari tampilan anda terlampir dalam transaksi, Middleware berjalan diluar transaksi, dan begitu juga membangun tanggapan-tanggapan cetakan.

source: When :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` is enabled, it's still possible to prevent views from running in a transaction.
id: Ketika :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` diadakan, itu masih memungkinkan mencegah tampilan dari berjalan dalam sebuah transaksi.

source: This decorator will negate the effect of :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` for a given view::
id: Penghias ini akan meniadakan pengaruh dari :setting:`ATOMIC_REQUESTS <DATABASE-ATOMIC_REQUESTS>` untuk tampilan yang diberikan::

source: It only works if it's applied to the view itself.
id: Itu hanya bekerja jika itu diberlakukan ke tampilan itu sendiri.

source: Controlling transactions explicitly
id: Mengendalikan transaksi secara eksplisit

source: Django provides a single API to control database transactions.
id: Django menyediakan API tunggal untuk mengendalikan transaksi basisdata.

source: Atomicity is the defining property of database transactions. ``atomic`` allows us to create a block of code within which the atomicity on the database is guaranteed. If the block of code is successfully completed, the changes are committed to the database. If there is an exception, the changes are rolled back.
id: Atomicity adalah penentuan sifat dari transaksi basisdata. ``atomic`` mengizinkan kamu membuat blok dari kode dalam yang atomicity pada basisdata dijaminkan. Jika blok dari kode berhasil lengkap, perubahan di perlakukan ke basisdata. Jika ada sebuah pengecualian, perubahan diputar kembali.

source: ``atomic`` blocks can be nested. In this case, when an inner block completes successfully, its effects can still be rolled back if an exception is raised in the outer block at a later point.
id: Blok ``atomic`` dapat bersarang. Dalam kasus ini, ketika sebuah blok sebelah dalam berhasil terpenuhi, pengaruhnya dapat masih di rollback jika sebuah pengecualian dimunculkan di blok sebelah luar pada titik kemudian.

source: ``atomic`` is usable both as a :py:term:`decorator`::
id: ``atomic`` berguna baik sebagai :py:term:`decorator`::

source: and as a :py:term:`context manager`::
id: dan sebagai :py:term:`context manager`::

source: Wrapping ``atomic`` in a try/except block allows for natural handling of integrity errors::
id: Membungkus ``atomic`` dalam sebuah blok try/except mengizinkan untuk penanganan alami dari kesalahan keutuhan::

source: In this example, even if ``generate_relationships()`` causes a database error by breaking an integrity constraint, you can execute queries in ``add_children()``, and the changes from ``create_parent()`` are still there. Note that any operations attempted in ``generate_relationships()`` will already have been rolled back safely when ``handle_exception()`` is called, so the exception handler can also operate on the database if necessary.
id: Dalam contoh ini, bahkan jika ``generate_relationships()`` menyebabkan kesalahan basisdata dengan merusak batasan kesatuan, anda dapat menjalankan permintaan dalam ``add_children()``, dan perubahan dari ``create_parent()`` masih disana. Catat bahwa tindakan-tindakan apapun diusahakan dalam ``generate_relationships()`` akan sudah diputar kembali dengan aman ketika ``handle_exception()`` dipanggil, jadi penangan pengecualian dapat juga berjalan pada basisdata jika dibutuhkan.

source: Avoid catching exceptions inside ``atomic``!
id: Menghindari menangkap pengecualian didalam ``atomic``!

source: When exiting an ``atomic`` block, Django looks at whether it's exited normally or with an exception to determine whether to commit or roll back. If you catch and handle exceptions inside an ``atomic`` block, you may hide from Django the fact that a problem has happened. This can result in unexpected behavior.
id: Ketika mengeluarkan sebuah blok ``atomic``, Django mencari apakah itu keluar secara biasa atau dengan sebuah pengecualian untuk menentukan apakah memperlakukan atau memutar kembali. Jika anda menangkap dan menangani pengecualian didalam blok ``atomic``, anda mungkin bersembunyi dari Django kenyataan bahwa masalah telah terjadi. Ini dapat menghasilkan perilaku tidak diharapkan.

source: This is mostly a concern for :exc:`~django.db.DatabaseError` and its subclasses such as :exc:`~django.db.IntegrityError`. After such an error, the transaction is broken and Django will perform a rollback at the end of the ``atomic`` block. If you attempt to run database queries before the rollback happens, Django will raise a :class:`~django.db.transaction.TransactionManagementError`. You may also encounter this behavior when an ORM-related signal handler raises an exception.
id: Ini kebanyakan perhatian untuk :exc:`~django.db.DatabaseError` dan subkelas-subkelas nya seperti :exc:`~django.db.IntegrityError`. Setelah kesalahan tersebut, transaksi rusak dan Django akan melakukan memutar kembali pada akhir dari blok ``atomic``. Jika anda berusaha menjalankan permintaan basisdata sebalum memutar kembali terjadi, Django akan memunculkan sebuah :class:`~django.db.transaction.TransactionManagementError`.Anda mungkin juga menghadapi perilaku ini ketika sinyal terkait-ORM memunculkan sebuah pengecualian.

source: The correct way to catch database errors is around an ``atomic`` block as shown above. If necessary, add an extra ``atomic`` block for this purpose. This pattern has another advantage: it delimits explicitly which operations will be rolled back if an exception occurs.
id: Cara benar untuk menangkap kesalahan-kesalahan basisdata disekitar sebuah blok ``atomic`` seperti ditunjukkan diatas. Jika dibutuhkan, tambah sebuah blok ``atomic`` tambahan untuk tujuan ini. Pola ini mempunyai keuntungan lain: itu membatasi jelas tindakan-tindakan maan akan diputar kembali jika sebuah pengecualian muncul.

source: If you catch exceptions raised by raw SQL queries, Django's behavior is unspecified and database-dependent.
id: Jika anda menangkap pengecualian dimunculkan oleh permintaan SQL mentah, perilaku Django tidak ditentukan dan tergantung-basisdata.

source: You may need to manually revert model state when rolling back a transaction.
id: Anda mungkin butuh secara manual merubah keadaan model ketika memutar kembali sebuah transaksi.

source: The values of a model's fields won't be reverted when a transaction rollback happens. This could lead to an inconsistent model state unless you manually restore the original field values.
id: Nilai-nilai dari bidang-bidang model tidak akan dirubah ketika transaksi memutar kembali terjadi. Ini dapat membawa pada keadaan model tidak tetap meskipun anda secara manual menyimpan kembali nilai-nilai bidang asli.

source: For example, given ``MyModel`` with an ``active`` field, this snippet ensures that the ``if obj.active`` check at the end uses the correct value if updating ``active`` to ``True`` fails in the transaction::
id: Sebagai contoh, diberikan ``MyModel`` dengan sebuah bidang ``active``, potongan ini memastikan bahwa ``if obj.active`` memeriksa pada akhir penggunaan nilai benar jika memperbaharui ``active`` menjadi ``True`` gagal dalam transaksi::

source: In order to guarantee atomicity, ``atomic`` disables some APIs. Attempting to commit, roll back, or change the autocommit state of the database connection within an ``atomic`` block will raise an exception.
id: Untuk menjamin atomicity, ``atomic`` meniadakan beberapa API. Berusaha memperlakukan, memutar kembali, atau merubah keadaan penjalanan otomatis dari hubungan basisdata dalam sebuah blok ``atomic`` akan memunculkan sebuah pengecualian.

source: ``atomic`` takes a ``using`` argument which should be the name of a database. If this argument isn't provided, Django uses the ``"default"`` database.
id: ``atomic`` mengambil sebuah argumen ``using`` yang harus berupa nama dari basisdata. Jika argumen ini tidak disediakan, Django menggunakan basisdata ``"default"``.

source: Under the hood, Django's transaction management code:
id: Dibawah tenda, kode pengelolaan transaksi Django:

source: opens a transaction when entering the outermost ``atomic`` block;
id: membuka sebuah transaksi ketika memasukkan blok ``atomic`` paling luar;
