Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: ``QuerySets`` are lazy -- the act of creating a :class:`~django.db.models.query.QuerySet` doesn't involve any database activity. You can stack filters together all day long, and Django won't actually run the query until the :class:`~django.db.models.query.QuerySet` is *evaluated*. Take a look at this example::
id: ``QuerySets`` adalah lazy -- tindakan dari membuat :class:`~django.db.models.query.QuerySet` tidak melibatkan aktifitas basisdata apapun. Anda dapat menumpuk penyaring bersama-sama sepanjang hari, dan Django tidak sebenarnya menjalankan permintaan sampai :class:`~django.db.models.query.QuerySet`*dinilai*. Coba lihat contoh ini::

source: Though this looks like three database hits, in fact it hits the database only once, at the last line (``print(q)``). In general, the results of a :class:`~django.db.models.query.QuerySet` aren't fetched from the database until you "ask" for them. When you do, the :class:`~django.db.models.query.QuerySet` is *evaluated* by accessing the database. For more details on exactly when evaluation takes place, see :ref:`when-querysets-are-evaluated`.
id: Meskipun ini terlihat mengenai basisdata tiga kali, sebenarnya itu mengenai basisdata hanya sekali, pada baris terakhir (``print(q)``).Secara umum, hasil dari :class:`~django.db.models.query.QuerySet` tidak diambil dari basisdata sampai anda "meminta" untuk mereka. Ketika anda melakukan, :class:`~django.db.models.query.QuerySet` *dinilai* dengan mengakses basisdata. Untuk rincian lebih pada sebenarnya ketika penilaian mengambil tempat, lihat :ref:`when-querysets-are-evaluated`.

source: Retrieving a single object with ``get()``
id: Mengambil obyek tunggal dengan ``get()``

source: :meth:`~django.db.models.query.QuerySet.filter` will always give you a :class:`~django.db.models.query.QuerySet`, even if only a single object matches the query - in this case, it will be a :class:`~django.db.models.query.QuerySet` containing a single element.
id: :meth:`~django.db.models.query.QuerySet.filter` akan selalu memberikan anda :class:`~django.db.models.query.QuerySet`,bahkan jika hanya obyek tunggal yang cocok permintaan - dalam kasus ini, itu akan berupa :class:`~django.db.models.query.QuerySet`mengandung unsur tunggal.

source: If you know there is only one object that matches your query, you can use the :meth:`~django.db.models.query.QuerySet.get` method on a :class:`~django.db.models.Manager` which returns the object directly::
id: Jika anda mengetahui hanya ada satu obyek yang cocok permintaan anda, anda dapat menggunakan metode meth:`~django.db.models.query.QuerySet.get` pada sebuah :class:`~django.db.models.Manager` yang mengembalikan obyek secara langsung::

source: You can use any query expression with :meth:`~django.db.models.query.QuerySet.get`, just like with :meth:`~django.db.models.query.QuerySet.filter` - again, see `Field lookups`_ below.
id: Anda dapat menggunakan pernyataan permintaan apapun dengan :meth:`~django.db.models.query.QuerySet.get`, seperti dengan :meth:`~django.db.models.query.QuerySet.filter` - kembali, lihat `Field lookups`_ dibawah.

source: Note that there is a difference between using :meth:`~django.db.models.query.QuerySet.get`, and using :meth:`~django.db.models.query.QuerySet.filter` with a slice of ``[0]``. If there are no results that match the query, :meth:`~django.db.models.query.QuerySet.get` will raise a ``DoesNotExist`` exception. This exception is an attribute of the model class that the query is being performed on - so in the code above, if there is no ``Entry`` object with a primary key of 1, Django will raise ``Entry.DoesNotExist``.
id: Catat bahwa ada perbedaan diantara menggunakan :meth:`~django.db.models.query.QuerySet.get`,dan menggunakan :meth:`~django.db.models.query.QuerySet.filter` dengan potongan ``[0]``. Jika tidak ada hasil yang cocok dengan permintaan, :meth:`~django.db.models.query.QuerySet.get` akan memunculkan pengecualian ``DoesNotExist``. Pengecualian ini adalah sebuah atribut dari kelas model yang permintaan sedang dilakukan - jadi dalam kode diatas, jika tidak ada obyek ``Entry`` dengan primary key dari 1, Django akan memunculkan ``Entry.DoesNotExist``.

source: Similarly, Django will complain if more than one item matches the :meth:`~django.db.models.query.QuerySet.get` query. In this case, it will raise :exc:`~django.core.exceptions.MultipleObjectsReturned`, which again is an attribute of the model class itself.
id: Demikain pula, Django akan mengeluh jika lebih dari satu barang cocok permintaan :meth:`~django.db.models.query.QuerySet.get`. Dalam kasus ini, itu akan memunculkan :exc:`~django.core.exceptions.MultipleObjectsReturned`,yang kembali adalah sebuah atribut dari kelas model itu sendiri.

source: Other ``QuerySet`` methods
id: Cara ``QuerySet`` lain

source: Most of the time you'll use :meth:`~django.db.models.query.QuerySet.all`, :meth:`~django.db.models.query.QuerySet.get`, :meth:`~django.db.models.query.QuerySet.filter` and :meth:`~django.db.models.query.QuerySet.exclude` when you need to look up objects from the database. However, that's far from all there is; see the :ref:`QuerySet API Reference <queryset-api>` for a complete list of all the various :class:`~django.db.models.query.QuerySet` methods.
id: Kebanyakan waktu anda akan gunakan :meth:`~django.db.models.query.QuerySet.all`, :meth:`~django.db.models.query.QuerySet.get`, :meth:`~django.db.models.query.QuerySet.filter` dan :meth:`~django.db.models.query.QuerySet.exclude` ketika anda butuh mencari obyek-obyek dari basisdata. Bagaimanapun, itu jauh dari semua yang ada; lihat :ref:`QuerySet API Reference <queryset-api>` untuk daftar lengkap dari semua ragam metode :class:`~django.db.models.query.QuerySet`.

source: Limiting ``QuerySet``\s
id: Membatasi ``QuerySet``

source: Use a subset of Python's array-slicing syntax to limit your :class:`~django.db.models.query.QuerySet` to a certain number of results. This is the equivalent of SQL's ``LIMIT`` and ``OFFSET`` clauses.
id: Gunakan sub kumpulan dari sintaksis memotong-array Python untuk membatasi :class:`~django.db.models.query.QuerySet` anda pada nomor tertentu dari hasil. Ini adalah setara daro klausa ``LIMIT`` dan ``OFFSET`` SQL.

source: For example, this returns the first 5 objects (``LIMIT 5``)::
id: Sebagai contoh, ini mengembalikan 5 obyek pertama (``LIMIT 5``)::

source: This returns the sixth through tenth objects (``OFFSET 5 LIMIT 5``)::
id: Ini mengembalikan enam dari 10 obyek (``OFFSET 5 LIMIT 5``)::

source: Negative indexing (i.e. ``Entry.objects.all()[-1]``) is not supported.
id: Pengindeksan negatif (yaitu ``Entry.objects.all()[-1]``) tidak didukung.

source: Generally, slicing a :class:`~django.db.models.query.QuerySet` returns a new :class:`~django.db.models.query.QuerySet` -- it doesn't evaluate the query. An exception is if you use the "step" parameter of Python slice syntax. For example, this would actually execute the query in order to return a list of every *second* object of the first 10::
id: Umumnya, memotong :class:`~django.db.models.query.QuerySet` mengembalikan :class:`~django.db.models.query.QuerySet` baru -- itu tidak menilai permintaan. Sebuah pengevualian jika anda menggunakan parameter "step" dari sintaksis potongan Python. Sebagai contoh, ini akan sebenarnya menjalankan permintaan untuk menjalankan daftar dari setiap *detik* obyek dari 10 pertama::

source: Further filtering or ordering of a sliced queryset is prohibited due to the ambiguous nature of how that might work.
id: Penyaring atau pengurut lebih lanjut dari irisan queryset dilarang karena sifat ambigu dari bagaimana itu mungkin bekerja.

source: To retrieve a *single* object rather than a list (e.g. ``SELECT foo FROM bar LIMIT 1``), use a simple index instead of a slice. For example, this returns the first ``Entry`` in the database, after ordering entries alphabetically by headline::
id: Untuk mengambil obyek *tunggal* daripada sebuah list (sebagai contoh ``SELECT foo FROM bar LIMIT 1``),gunakan indeks sederhana sebagai gantinya dari potongan. Sebagai contoh, ini mengembalikan ``Entry`` pertama dalam basisdata, setelah mengurutkan masukan secara alfabet berdasarkan judul::

source: This is roughly equivalent to::
id: Ini kurang lebih setara pada::

source: Note, however, that the first of these will raise ``IndexError`` while the second will raise ``DoesNotExist`` if no objects match the given criteria. See :meth:`~django.db.models.query.QuerySet.get` for more details.
id: Catat, bagaimanapun, yang pertama dari ini akan memunculkan ``IndexError``selagi kedua akan memunculkan ``DoesNotExist``jika tidak ada obyek cocok dari kriteria yang diberikan. Lihat :meth:`~django.db.models.query.QuerySet.get` untuk rincian lebih.

source: Field lookups
id: Bidang pencarian

source: Field lookups are how you specify the meat of an SQL ``WHERE`` clause. They're specified as keyword arguments to the :class:`~django.db.models.query.QuerySet` methods :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude` and :meth:`~django.db.models.query.QuerySet.get`.
id: Pencarian bidang adalah bagaimana anda menentukan isi dari sebuah klausa SQL ``WHERE``. Mereka ditentukan sebagai argumen kata kunci pada :class:`~django.db.models.query.QuerySet` metode metode :meth:`~django.db.models.query.QuerySet.filter`, :meth:`~django.db.models.query.QuerySet.exclude` dan :meth:`~django.db.models.query.QuerySet.get`.

source: Basic lookups keyword arguments take the form ``field__lookuptype=value``. (That's a double-underscore). For example::
id: Argumen kata kunci pencarian dasar mengambil formulir ``field__lookuptype=value``. (Itu adalah garis bawah ganda). Sebagai contoh::

source: translates (roughly) into the following SQL:
id: terjemahan (kurang lebih) ke dalam SQL berikut:

source: How this is possible
id: Bagaimana ini mungkin

source: Python has the ability to define functions that accept arbitrary name-value arguments whose names and values are evaluated at runtime. For more information, see :ref:`tut-keywordargs` in the official Python tutorial.
id: Python mempunyai kemampuan untuk menentukan fungsi-fungsi yang menerima argumen nilai-nama beruubah-ubah yang namanya dan nilainya dinilai pada waktu berjalan. Untuk informasi lebih, lihat :ref:`tut-keywordargs` dalam tutorial Python resmi.

source: The field specified in a lookup has to be the name of a model field. There's one exception though, in case of a :class:`~django.db.models.ForeignKey` you can specify the field name suffixed with ``_id``. In this case, the value parameter is expected to contain the raw value of the foreign model's primary key. For example:
id: Bidang ditentukan dalam pencarian harus berupa nama dari bidang model. meskipun ada satu pengecualian, dalam kasus dari :class:`~django.db.models.ForeignKey` anda dapat menentukan nama bidang akhiran dengan ``_id``. Dalam kasus ini, parameter nilai diharapkan mengandung nilai mentah dari foreign primary key model. Sebagai contoh:

source: If you pass an invalid keyword argument, a lookup function will raise ``TypeError``.
id: Jika anda melewatkan argumen kata kunci tidak sah, fungsi pencarian akan memunculkan ``TypeError``.

source: The database API supports about two dozen lookup types; a complete reference can be found in the :ref:`field lookup reference <field-lookups>`. To give you a taste of what's available, here's some of the more common lookups you'll probably use:
id: API basisdata mendukung sekitar dua lusin jenis pencarian; acuan lengkap dapat ditemukan dalam :ref:`field lookup reference 1`. Untuk memberikan anda selera dari apa yang tersedia, ini adalah beberapa dari pencarian lebih umum anda mungkin gunakan:

source: An "exact" match. For example::
id: Sebuah pencocokan "tepat". Sebagai contoh::

source: Would generate SQL along these lines:
id: Akan membangkitkan SQL bersama baris ini:

source: If you don't provide a lookup type -- that is, if your keyword argument doesn't contain a double underscore -- the lookup type is assumed to be ``exact``.
id: Jika anda tidak menyediakan jenis pencarian -- yaitu, jika argumen kata kunci anda tidak mengandung garis bawah ganda -- jenis pencarian dianggap ``tepat``.

source: For example, the following two statements are equivalent::
id: Sebagai contoh, dua pernyataan berikut adalah setara::

source: This is for convenience, because ``exact`` lookups are the common case.
id: Ini adalah untuk kenyamanan, karena pencarian ``exact`` adalah kasus umum.

source: A case-insensitive match. So, the query::
id: Pencocokan kasus-tidak-peka. Jadi, permintaan::

source: Would match a ``Blog`` titled ``"Beatles Blog"``, ``"beatles blog"``, or even ``"BeAtlES blOG"``.
id: Akan cocok ``Blog`` berjudul ``"Beatles Blog"``, ``"beatles blog"``, atau bahkan ``"BeAtlES blOG"``.

source: Case-sensitive containment test. For example::
id: Percobaan penahanan kasus-peka . Sebagai contoh::

source: Roughly translates to this SQL:
id: Kurang lebih menterjemahkan ke SQL ini:

source: Note this will match the headline ``'Today Lennon honored'`` but not ``'today lennon honored'``.
id: Catat ini akan cocok dengan judul ``'Today Lennon honored'`` tetapi tidak ``'today lennon honored'``.

source: There's also a case-insensitive version, :lookup:`icontains`.
id: Ada juga versi kasus-tidak-peka, :lookup:`icontains`.

source: Starts-with and ends-with search, respectively. There are also case-insensitive versions called :lookup:`istartswith` and :lookup:`iendswith`.
id: Pencarian mulai-dengan dan berakhir-dengan, masing-masing. Ada juga versi kasus-tidak-peka dipanggil :lookup:`istartswith` dan :lookup:`iendswith`.

source: Again, this only scratches the surface. A complete reference can be found in the :ref:`field lookup reference <field-lookups>`.
id: Kembali, ini hanya menggores permukaan. Acuan lengkap dapat ditemukan di :ref:`field lookup reference 1`.

source: Lookups that span relationships
id: Pencarian yang menjangkau hubungan

source: Django offers a powerful and intuitive way to "follow" relationships in lookups, taking care of the SQL ``JOIN``\s for you automatically, behind the scenes. To span a relationship, just use the field name of related fields across models, separated by double underscores, until you get to the field you want.
id: Django menawarkan cara hebat dan intituitif untuk "mengikuti" hubungan dalam pencarian, merawat dari SQL ``JOIN`` untuk anda otomatis, dibelakang layar. Untuk menjangkau hubungan, cukup gunakan nama bidang dari bidang terkait terhadap model, dipisahkan oleh garisbawah ganda, sampai anda mendapatkan bidang anda inginkan.

source: This example retrieves all ``Entry`` objects with a ``Blog`` whose ``name`` is ``'Beatles Blog'``::
id: Contoh ini mengambil semua obyek ``Entry`` dengan ``Blog`` yang ``name`` adalah ``'Beatles Blog'``::

source: This spanning can be as deep as you'd like.
id: Jangkauan ini dapat sedalam anda sukai.

source: It works backwards, too. To refer to a "reverse" relationship, just use the lowercase name of the model.
id: Itu bekerja kebelakang, juga. Untuk mengacu hubungan "reverse", cukup gunakan nama huruf kecil dari model.

source: This example retrieves all ``Blog`` objects which have at least one ``Entry`` whose ``headline`` contains ``'Lennon'``::
id: Contoh ini mengambil semua obyek ``Blog`` yang setidaknya saru ``Entry`` yang ``headline`` mengandung ``'Lennon'``::

source: If you are filtering across multiple relationships and one of the intermediate models doesn't have a value that meets the filter condition, Django will treat it as if there is an empty (all values are ``NULL``), but valid, object there. All this means is that no error will be raised. For example, in this filter::
id: Jika anda menyaring terhadap banyak hubungan dan satu dari model mengengah tidak mempunyai nilai yang memenuhi kondisi penyaring, Django akan memperlakukan itu sebagai jika sebuah kosong (semua nilai adalah ``NULL``), tetapi obyek sah disana. Semua ini berarti bahwa tidak ada kesalahan akan dimunculkan. Sebagi contoh, dalam penyaringan ini::

source: (if there was a related ``Author`` model), if there was no ``author`` associated with an entry, it would be treated as if there was also no ``name`` attached, rather than raising an error because of the missing ``author``. Usually this is exactly what you want to have happen. The only case where it might be confusing is if you are using :lookup:`isnull`. Thus::
id: (jika ada model ``Author`` terkait), jika tidak ada ``author`` terkait dengan sebuah masukan, itu akan diperlakukan seperti jika tidak ada juga ``name`` terlampir, daripada memunculkan kesalahan karena dari ``author`` hilang. Biasanya ini adalah tepatnya apa anda ingin miliki terjadi. Kasus satu-satunya dimana itu mungkin membingungkan adalah jika anda menggunakan :lookup:`isnull`.Jadi::

source: will return ``Blog`` objects that have an empty ``name`` on the ``author`` and also those which have an empty ``author`` on the ``entry``. If you don't want those latter objects, you could write::
id: akan mengembalikan obyek ``Blog`` yang mempunyai ``name`` kosong pada ``author`` dan juga itu yang mempunyai ``author`` kosong pada ``entry``. Jika anda tidak ingin obyek terakhir itu, anda dapat menulis::

source: Spanning multi-valued relationships
id: Membentangkan hubungan banyak-nilai

source: When you are filtering an object based on a :class:`~django.db.models.ManyToManyField` or a reverse :class:`~django.db.models.ForeignKey`, there are two different sorts of filter you may be interested in. Consider the ``Blog``/``Entry`` relationship (``Blog`` to ``Entry`` is a one-to-many relation). We might be interested in finding blogs that have an entry which has both *"Lennon"* in the headline and was published in 2008. Or we might want to find blogs that have an entry with *"Lennon"* in the headline as well as an entry that was published in 2008. Since there are multiple entries associated with a single ``Blog``, both of these queries are possible and make sense in some situations.
id: Ketika anda menyaring sebuah obyek berdasarkan pada sebuah :class:`~django.db.models.ManyToManyField` atau membalikkan :class:`~django.db.models.ForeignKey`, ada dua perbedaan urutan dari penyaringan anda mungkin tertarik. Pertimbangkan hubungan ``Blog``/``Entry`` (``Blog`` pada ``Entry`` adalah hubungan one-to-many). Kami mungkin tertarik dalam menemukan blog yang memiliki sebuah masukan yang mempunyai kedua *"Lennon"* dalam judul dan telah diterbitkan di 2008. Atau kami mungkin ingin menemukan blog yang mempunyai sebuah masukan dengan *"Lennon"* dalam judul sama halnya sebuah masukan yang telah diterbitkan di 2008. Sejak ada banyak masukan terkait dengan ``Blog`` tunggal, kedua dari permintaan ini adalah memungkinkan dan masuk akal dalam beberapa keadaan

source: The same type of situation arises with a :class:`~django.db.models.ManyToManyField`. For example, if an ``Entry`` has a :class:`~django.db.models.ManyToManyField` called ``tags``, we might want to find entries linked to tags called *"music"* and *"bands"* or we might want an entry that contains a tag with a name of *"music"* and a status of *"public"*.
id: Jenis keadaan sama muncul dengan :class:`~django.db.models.ManyToManyField`. Sebagai contoh, jika sebuah ``Entry`` mempunyai :class:`~django.db.models.ManyToManyField` disebut ``tags``, kami mungkin ingin menemukan masukan terkait ke etiket disebut *"music"* dan *"bands"*atau kami mungkin ingin sebuah masukan yang mengandung sebuth etiket dengan nama dari *"music"*dan status dari *"public"*.

source: To handle both of these situations, Django has a consistent way of processing :meth:`~django.db.models.query.QuerySet.filter` calls. Everything inside a single :meth:`~django.db.models.query.QuerySet.filter` call is applied simultaneously to filter out items matching all those requirements. Successive :meth:`~django.db.models.query.QuerySet.filter` calls further restrict the set of objects, but for multi-valued relations, they apply to any object linked to the primary model, not necessarily those objects that were selected by an earlier :meth:`~django.db.models.query.QuerySet.filter` call.
id: Untuk menangani kedua keadan ini, Django mempunyai cari yang cocok dari mengolah panggilan :meth:`~django.db.models.query.QuerySet.filter`. Apapun didalam panggilan :meth:`~django.db.models.query.QuerySet.filter`tunggal diberlakukan secara terus menerus untuk menyaring barang-barang mencocokkan semua lingkungan tersebut. Panggilan :meth:`~django.db.models.query.QuerySet.filter` berturut-turut lebih lanjut membatasi setelan dari obyek, tetapi untuk hubungan banyak-nlai, mereka berlaku ke obyek apapun terkait pada model utama, tidak perlu obyek-obyek itu yang telah dipilih oleh panggilan :meth:`~django.db.models.query.QuerySet.filter` paling awal.

source: That may sound a bit confusing, so hopefully an example will clarify. To select all blogs that contain entries with both *"Lennon"* in the headline and that were published in 2008 (the same entry satisfying both conditions), we would write::
id: Itu mungkin sedikit sedikit membingungkan, jadi semoga sebuah contoh untuk menjelaskan. Untuk memilih semua blog yang mengandungmasukan dengan *"Lennon"*dalam judul dan telah diterbitkan di 2008 (masukan sama memuaskan kedua keadaan), kami akan menulis::

source: To select all blogs that contain an entry with *"Lennon"* in the headline **as well as** an entry that was published in 2008, we would write::
id: Untuk memilih semua blog yang mengandung sebuah masukan dengan *"Lennon"* di judul, **sama halnya** sebuah masukan yang telah diterbitkan di 2008, kami akan menulis::

source: Suppose there is only one blog that had both entries containing *"Lennon"* and entries from 2008, but that none of the entries from 2008 contained *"Lennon"*. The first query would not return any blogs, but the second query would return that one blog.
id: Sekiranya hanya ada satu blog yang mempunyai kedua masukan mengandung *"Lennon"* dan masukan dari 2008 tetapi bahwa tidak satupun dari masukan dari 2008 mengandung *"Lennon"*. Permintaan pertmana tidak akan mengembalikan blog apapun, tetapi kedua permintaan akan mengembalikan itu satu blog.

source: In the second example, the first filter restricts the queryset to all those blogs linked to entries with *"Lennon"* in the headline. The second filter restricts the set of blogs *further* to those that are also linked to entries that were published in 2008. The entries selected by the second filter may or may not be the same as the entries in the first filter. We are filtering the ``Blog`` items with each filter statement, not the ``Entry`` items.
id: Dalam contoh kedua, penyaring pertama membatasi queryset ke semua blog-blog tersebut terkait ke masukan dengan *"Lennon"* di judul. Penyaring kedua membatasi kumpulan blog *further* ke itu yang juga terkait ke masukan yang telah diterbirkan di 2008. Masukan dipilih oleh penyaring kedua mungkin atau mungkin tidak sama seperti masukan di penyaring pertama. Kami sedang menyaring barang-barang ``Blog`` dengan setiap pernyataan penyaring, bukan barang-barang ``Entry``.
