Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: Overriding settings
id: Pengaturan utama

source: Django itself uses this signal to reset various data:
id: Django itu sendiri menggunakan sinyal ini untuk menyetel kembali beragam data:

source: Overridden settings
id: Pengaturan ditimpa

source: Data reset
id: Setel kembali data

source: Databases timezone
id: Zona waktu basisdata

source: Template engines
id: Mesin cetakan

source: Default translation and loaded translations
id: Terjemahan awalan dan terjemahan dimuat

source: Default file storage
id: Penyimpanan berkas awal

source: For more detail on email services during tests, see `Email services`_ below.
id: Untuk lebih rincian pada layanan surel selama percobaan, lihat `Email services`_ dibawah.

source: Assertions
id: Penegasan

source: If only the ``expected_exception`` and ``expected_message`` parameters are given, returns a context manager so that the code being tested can be written inline rather than as a function::
id: Jika hanya parameter ``expected_exception`` dan ``expected_message`` diberikan, mengembalikan sebuah pengelola konteks sehingga kode sedang dicobakan dapat ditulir berderet daripada sebagai sebuah fungsi::

source: the class of the field to be tested.
id: kelas dari bidang yang akan dicoba.

source: the expected clean output for inputs in ``empty_values``.
id: keluaran bersih diharapkan untuk masukan dalam ``empty_values``.

source: ``form`` is the name the ``Form`` instance was given in the template context.
id: ``form`` adalah nama instance ``Form`` telah diberikan dalam konteks cetakan.

source: Set ``html`` to ``True`` to handle ``text`` as HTML. The comparison with the response content will be based on HTML semantics instead of character-by-character equality. Whitespace is ignored in most cases, attribute ordering is not significant. See :meth:`~SimpleTestCase.assertHTMLEqual` for more details.
id: Setel ``html`` menjadi ``True`` untuk menangani ``text`` sebagai HTML. Perbandingan dengan tanggapan isi akan berdasarkan pada semantik HTML dari kesetaraan karakter-demi-karakter. Ruang kosong adalah diabaikan pada banyak kasus, urutan atribut tidak signifikan. Lihat :meth:`~SimpleTestCase.assertHTMLEqual` untuk rincian lebih.

source: Asserts that a ``Response`` instance produced the given ``status_code`` and that ``text`` does *not* appear in the content of the response.
id: Tegaskan bahwa instance ``Response`` menghasilkan ``status_code`` dan ``text``itu diberikan *tidak* muncul dalam isi dari tanggapan.

source: Asserts that the template with the given name was used in rendering the response.
id: Tegaskan bahwa cetakan dengan nama diberikan digunakan dalam membangun tanggapan.

source: The name is a string such as ``'admin/index.html'``.
id: Nama adalah sebuah string seperti ``'admin/index.html'``.

source: The count argument is an integer indicating the number of times the template should be rendered. Default is ``None``, meaning that the template should be rendered one or more times.
id: Argumen hitung adalah sebuah integer menunjukkan sejumlah kali cetakan harus dibangun. Awalan adalah ``None``, berarti bahwa cetakan harus dikirim satu atau beberapa kali.

source: You can use this as a context manager, like this::
id: Anda dapat menggunakan ini sebagai pengelola konteks, seperti ini::

source: Asserts that the template with the given name was *not* used in rendering the response.
id: Tegaskan bahwa cetakan dengan nama diberikan *tidak* digunakan dalam membangun tanggapan.

source: You can use this as a context manager in the same way as :meth:`~SimpleTestCase.assertTemplateUsed`.
id: Anda dapat menggunakan ini sebagai pengelola konteks dalam cara sama seperti :meth:`~SimpleTestCase.assertTemplateUsed`.

source: Asserts that the response returned a ``status_code`` redirect status, redirected to ``expected_url`` (including any ``GET`` data), and that the final page was received with ``target_status_code``.
id: Tegaskan bahwa tanggapan mengembalikan keadaan pengalihan ``status_code``, dialihkan ke ``expected_url``(termasuk data ``GET`` apapun), dan bahwa halaman akhir telah diterima dengan ``target_status_code``.

source: If your request used the ``follow`` argument, the ``expected_url`` and ``target_status_code`` will be the url and status code for the final point of the redirect chain.
id: Jika permintaan anda menggunakan argumen ``follow``, ``expected_url`` dan ``target_status_code``akan berupa url dan kode keadaan untuk titik akhir dari rantai pengalihan.

source: If ``fetch_redirect_response`` is ``False``, the final page won't be loaded. Since the test client can't fetch external URLs, this is particularly useful if ``expected_url`` isn't part of your Django app.
id: Jika ``fetch_redirect_response`` adalah ``False``, halaman akhir tidak akan dimuat. Sejak klien percobaan tidak dapat mengambil URL luar, ini khususnya berguna jika ``expected_url`` bukan bagian dari aplikasi Django anda.

source: Scheme is handled correctly when making comparisons between two URLs. If there isn't any scheme specified in the location where we are redirected to, the original request's scheme is used. If present, the scheme in ``expected_url`` is the one used to make the comparisons to.
id: Skema ditangani dengan benar ketika membuat perbandingan diantara dua URL. Jika tidak ada skema apapun ditentukan dalam tempat dimana kami mengalihkan, skema permintaan asli digunakan. Jika hadir, skema dalam ``expected_url`` adalah satu digunakan untuk membuat perbandingan.

source: Asserts that the strings ``html1`` and ``html2`` are equal. The comparison is based on HTML semantics. The comparison takes following things into account:
id: Tegaskan bahwa string ``html1`` dan ``html2`` adalah sama. Perbandingan berdasarkan pada semantik HTML. Perbandingan mengambil hal-hal berikut kedalam akun:

source: Whitespace before and after HTML tags is ignored.
id: Ruang kosong sebelum dan setelah etiket HTML diabaikan.

source: All types of whitespace are considered equivalent.
id: Semua jenis ruang kosong dianggap setara.

source: All open tags are closed implicitly, e.g. when a surrounding tag is closed or the HTML document ends.
id: Semua etiket buka ditutup mutlak, yaitu ketika sekeliling etiket ditutup atau dokumen HTML berakhir.

source: Empty tags are equivalent to their self-closing version.
id: Etiket kosong adalah setara pada versi penutupan-sendiri mereka.

source: The ordering of attributes of an HTML element is not significant.
id: Urutan dari atribut-atribut dari sebuah unsur HTML tidak signifikan.

source: Attributes without an argument are equal to attributes that equal in name and value (see the examples).
id: Atribut-atribut tanpa sebuah argumen adalah sama pada atribut-atribut yang sama dalam nama dan nilai (lihat contoh-contoh).

source: The following examples are valid tests and don't raise any ``AssertionError``::
id: Contoh-contoh berikut adalah percobaan sah dan tidak memunculkan ``AssertionError`` apapun::

source: ``html1`` and ``html2`` must be valid HTML. An ``AssertionError`` will be raised if one of them cannot be parsed.
id: ``html1`` dan ``html2`` harus berupa HTML sah. Sebuah ``AssertionError`` akan dumunculkan jika satu dari mereka tidak dapat diuraikan.

source: Output in case of error can be customized with the ``msg`` argument.
id: Keluaran dalam rangka kesalahan dapat disesuaikan dengan argumen ``msg``.

source: Asserts that the strings ``html1`` and ``html2`` are *not* equal. The comparison is based on HTML semantics. See :meth:`~SimpleTestCase.assertHTMLEqual` for details.
id: Tegaskan bahwa string ``html1`` dan ``html2`` *tidak* sama. Perbandingan berdasarkan pada semantik HTML. Lihat :meth:`~SimpleTestCase.assertHTMLEqual` untuk rincian.

source: Asserts that the strings ``xml1`` and ``xml2`` are equal. The comparison is based on XML semantics. Similarly to :meth:`~SimpleTestCase.assertHTMLEqual`, the comparison is made on parsed content, hence only semantic differences are considered, not syntax differences. When invalid XML is passed in any parameter, an ``AssertionError`` is always raised, even if both string are identical.
id: Tegaskan bahwa string ``xml1`` dan ``xml2`` adalah sama. Perbandingan berdasarkan pada semantik XML. Mirip pada :meth:`~SimpleTestCase.assertXMLEqual`, perbandingan dibuat pada isi diurai, dengan demikian hanya perbedaan semantik dipertimbangkan, bukan perbedaan sintaksis. Ketika XML tidak sah dilewatkan dalam parameter apapun, sebuah ``AssertionError`` selalu dimunculkan, bahkan jika kedua string adalah mirip.

source: Asserts that the strings ``xml1`` and ``xml2`` are *not* equal. The comparison is based on XML semantics. See :meth:`~SimpleTestCase.assertXMLEqual` for details.
id: Tegaskan bahwa string ``xml1`` dan ``xml2`` adalah *tidak* sama. Perbandingan berdasarkan pada semantik XML. Lihat :meth:`~SimpleTestCase.assertXMLEqual` untuk rincian.

source: Asserts that the HTML fragment ``needle`` is contained in the ``haystack`` one.
id: Tegaskan bahwa bagian HTML ``needle`` dikandung dalam satu di ``haystack``.

source: If the ``count`` integer argument is specified, then additionally the number of ``needle`` occurrences will be strictly verified.
id: Jika argumen integer ``count`` ditentukan, kemudian tambahannya sejumlah dari kejadian ``needle`` akan diperiksa secara ketat.

source: Whitespace in most cases is ignored, and attribute ordering is not significant. The passed-in arguments must be valid HTML.
id: Ruang kosong di banyak kasus diabaikan, dan urutan atribut tidak signifikan. Argumen berlalu harus HTML yang sah.

source: Asserts that the JSON fragments ``raw`` and ``expected_data`` are equal. Usual JSON non-significant whitespace rules apply as the heavyweight is delegated to the :mod:`json` library.
id: Menegaskan bahwa fragmen JSON ``raw`` dan ``expected_data`` adalah setara. Aturan ruang kosong bukan-signifikan JSON biasa berlaku sebagai kelas berat dilimpahkan ke pustaka :mod:`json`.

source: Asserts that a queryset ``qs`` returns a particular list of values ``values``.
id: Tegaskan bahwa sebuah queryset ``qs`` mengembalikan daftar tertentu dari nilai ``values``.

source: Asserts that when ``func`` is called with ``*args`` and ``**kwargs`` that ``num`` database queries are executed.
id: Tegaskan itu ketika ``func`` dipanggil dengan ``*args`` dan ``**kwargs`` yang permintaan basisdata ``num`` dijalankan.

source: You can also use this as a context manager::
id: Anda dapat juga menggunakan ini sebagai pengelola konteks::

source: Tagging tests
id: Percobaan etiket

source: You can tag your tests so you can easily run a particular subset. For example, you might label fast or slow tests::
id: Anda dapat mengetiket percobaan anda sehingga anda dapat dengan mudah menjalankan subset tertentu. Sebagai contoh, anda mungkin melabeli percobaan cepat atau lambat::

source: You can also tag a test case::
id: Anda dapat juga mengetiket sebuah kasus percobaan::

source: Then you can choose which tests to run. For example, to run only fast tests:
id: Kemudian anda dapat memilih percobaan mana dijalankan. Sebagai contoh, untuk hanya menjalankan percobaan cepat:

source: Or to run fast tests and the core one (even though it's slow):
id: Atau untuk menjalankan percobaan cepat dan satu ini (bahkan meskipun itu lambat):

source: You can also exclude tests by tag. To run core tests if they are not slow:
id: Anda dapat juga tidak menyertakan percobaan dengan etiket. Untuk menjalankan percobaan inti jika mereka tidak lambat:

source: Email services
id: Layanan surel

source: Here's an example test that examines ``django.core.mail.outbox`` for length and contents::
id: Ini adalah sebuah contoh percobaan yang menguji ``django.core.mail.outbox`` untuk panjang dan isi::

source: Management Commands
id: Pengelolaan perintah

source: Management commands can be tested with the :func:`~django.core.management.call_command` function. The output can be redirected into a ``StringIO`` instance::
id: Perintah pengelolaan dapat dicobakan dengan fungsi :func:`~django.core.management.call_command`. Keluaran dapat dialihkan kedalam instance ``StringIO`` ::

source: Skipping tests
id: Melewati percobaan

source: To supplement these test skipping behaviors, Django provides two additional skip decorators. Instead of testing a generic boolean, these decorators check the capabilities of the database, and skip the test if the database doesn't support a specific named feature.
id: Untuk melengkapi perilaku melewati percobaan ini, Django menyediakan dua tambahan penghias melewatkan. Daripada mencoba boolean umum, penghias ini memeriksa kemampuan dari basisdata, dan melewati percobaan jika basisdata tidak mendukung fitur bernama khusus.

source: For example, the following test will not be executed if the database supports transactions (e.g., it would *not* run under PostgreSQL, but it would under MySQL with MyISAM tables)::
id: Sebagai contoh, percobaan berikut tidak akan dijalankan jika transaksi dukungan basisdata (sebagai contoh, dia *tidak* akan berjalan dibawah PostgreSQL, tetapi dia dibawah MySQL dengan tabel MyISAM)::

source: Skip the decorated test or ``TestCase`` if any of the named database features are *not* supported.
id: Lewati percobaan penghias atau ``TestCase`` jika salah satu dari fitur basisdata bernama *tidak* didukung.

source: For example, the following test will only be executed if the database supports transactions (e.g., it would run under PostgreSQL, but *not* under MySQL with MyISAM tables)::
id: Sebagai contoh, percobaan berikut hanya akan dijalankan jika transaksi dukungan basisdata (sebagai contoh, dia akan berjalan dibawah PostgreSQL, tetapi *bukan* dibawah MySQL dengan tabel MyISAM)::
