Repository: django/django-docs-translations
Catalog: translations/*/LC_MESSAGES/topics.po
Languages: id

source: ``recipients()`` returns a list of all the recipients of the message, whether they're recorded in the ``to``, ``cc`` or ``bcc`` attributes. This is another method you might need to override when subclassing, because the SMTP server needs to be told the full list of recipients when the message is sent. If you add another way to specify recipients in your class, they need to be returned from this method as well.
id: ``recipients()`` mengembalikan daftar dari semua penerima dari pesan, apakah mereka adalah terekam dalam atribut ``to``, ``cc`` atau ``bcc``. Ini adalah metode lain anda mungkin butuh untuk menimpa ketika mensubkelaskan, karena peladen SMTP butuh diberitahu daftar penuh dari penerima ketika pesan dikirim. Jika anda menambah cara lain untuk menentukan penerima dalam kelas anda, mereka butuh dikembalikan dari metode ini juga.

source: ``attach()`` creates a new file attachment and adds it to the message. There are two ways to call ``attach()``:
id: ``attach()`` membuat lampiran berkas baru dan menambahkan itu ke pesan. Ada dua cara memanggil ``attach()``:

source: Alternatively, you can pass ``attach()`` three arguments: ``filename``, ``content`` and ``mimetype``. ``filename`` is the name of the file attachment as it will appear in the email, ``content`` is the data that will be contained inside the attachment and ``mimetype`` is the optional MIME type for the attachment. If you omit ``mimetype``, the MIME content type will be guessed from the filename of the attachment.
id: Kalau tidak, anda dapat melewatkan tiga argumen ``attach()``: ``filename``, ``content`` dan ``mimetype``. ``filename`` adalah nama dari lampiran berkas ketika itu muncul dalam surel, ``content`` adalah data yang akan di isi didalam lampiran dan ``mimetype`` adalah jenis MIME untuk lampiran. Jika anda menghilangkan ``mimetype``, jenis isi MIME akan ditebak dari nama berkas dari lampiran.

source: If you specify a ``mimetype`` of ``message/rfc822``, it will also accept :class:`django.core.mail.EmailMessage` and :py:class:`email.message.Message`.
id: Jika anda menentukan ``mimetype`` dari ``message/rfc822``, itu juga akan menerima :class:`django.core.mail.EmailMessage` dan :py:class:`email.message.Message`.

source: For a ``mimetype`` starting with ``text/``, content is expected to be a string. Binary data will be decoded using UTF-8, and if that fails, the MIME type will be changed to ``application/octet-stream`` and the data will be attached unchanged.
id: Untuk ``mimetype`` dimulai dengan ``text/``, konteks diharapkan berupa string. Data biner akan disandikan menggunakan UTF-8, dan jka itu gagal, jenis MIME akan dirubah menjadi ``application/octet-stream`` dan data akan dilampirkan tidak berubah.

source: In addition, ``message/rfc822`` attachments will no longer be base64-encoded in violation of :rfc:`2046#section-5.2.1`, which can cause issues with displaying the attachments in `Evolution`__ and `Thunderbird`__.
id: Sebagai tambahan, lampiran-lampiran ``message/rfc822``tidak lama lagi berupa disandi-base64 dalam pelanggaran dari :rfc:`2046#section-5.2.1`, yang dapat menyebabkan masalah-masalah dengan menampilkan lampiran dalam `Evolution`__ dan `Thunderbird`__.

source: ``attach_file()`` creates a new attachment using a file from your filesystem. Call it with the path of the file to attach and, optionally, the MIME type to use for the attachment. If the MIME type is omitted, it will be guessed from the filename. The simplest use would be::
id: ``attach_file()`` membuat sebuah lampiran baru menggunakan sebuah berkas dari sistem berkas anda. Memanggil itu dengan jalur dari berkas untuk melampirkan dan, secara pilihan, jenis MIME untuk digunakan untuk lampiran. Jika jenis MIME dihilangkan, itu akan ditebak dari nama berkas. Penggunaan sederhana berupa::

source: For MIME types starting with ``text/``, binary data is handled as in ``attach()``.
id: Untuk jenis-jenis MIME dimulai dengan ``text/``, data biner ditangani dalam ``attach()``.

source: Sending alternative content types
id: Mengirim pilihan lain jenis isi

source: It can be useful to include multiple versions of the content in an email; the classic example is to send both text and HTML versions of a message. With Django's email library, you can do this using the ``EmailMultiAlternatives`` class. This subclass of :class:`~django.core.mail.EmailMessage` has an ``attach_alternative()`` method for including extra versions of the message body in the email. All the other methods (including the class initialization) are inherited directly from :class:`~django.core.mail.EmailMessage`.
id: Itu dapat sangat berguna untuk menyertakan banyak versi dari isi dalam sebuah surel; contoh klasik adalah mengirimkan kedua versi teks dan HTML dari pesan. Dengan pustaka surel Django, anda dapat melakukan ini menggunakan kelas ``EmailMultiAlternatives``. Subkelas ini dari :class:`~django.core.mail.EmailMessage` mempunyai sebuah metode ``attach_alternative()`` untuk meneyrtakan versi tambahan dari badan pesan dalam surel. Semua metode lainnya (termasuk pengawalan kelas) diwariskan langsung dari :class:`~django.core.mail.EmailMessage`.

source: To send a text and HTML combination, you could write::
id: Untuk mengirim perpaduan teks dan HTML, anda dapat menulis::

source: By default, the MIME type of the ``body`` parameter in an :class:`~django.core.mail.EmailMessage` is ``"text/plain"``. It is good practice to leave this alone, because it guarantees that any recipient will be able to read the email, regardless of their mail client. However, if you are confident that your recipients can handle an alternative content type, you can use the ``content_subtype`` attribute on the :class:`~django.core.mail.EmailMessage` class to change the main content type. The major type will always be ``"text"``, but you can change the subtype. For example::
id: Secara awalan, jenis MIME dari parameter ``body`` dalam sebuah :class:`~django.core.mail.EmailMessage` adalah ``"text/plain"``. Itu adalah praktik bagus untuk meninggalkan ini sendiri, karena itu menjamin penerima manapun akan dapat membaca surel, tidak peduli dari surat klien mereka. Bagaimanapun, jika anda sedang percaya diri bahwa penerima anda dapat menangani sebuah jenis isi lain, anda dapat menggunakan atribut ``content_subtype`` pada kelas :class:`~django.core.mail.EmailMessage` untuk merubah jenis isi utama. Jenis utama akan selalu ``"text"``, tetapi anda dapat merubah subjenis. Sebagai contoh::

source: Email backends
id: Backend email

source: The actual sending of an email is handled by the email backend.
id: Pengiriman sebenarnya dari sebuah surel ditangani oleh backend email.

source: The email backend class has the following methods:
id: Kelas backend surel mempunyai metode-metode berikut:

source: ``close()`` closes the current email-sending connection.
id: ``close()`` menutup hubungan mengirim-surel saat ini.

source: ``send_messages(email_messages)`` sends a list of :class:`~django.core.mail.EmailMessage` objects. If the connection is not open, this call will implicitly open the connection, and close the connection afterwards. If the connection is already open, it will be left open after mail has been sent.
id: ``send_messages(email_messages)`` mengirim daftar dari obyek :class:`~django.core.mail.EmailMessage`. Jika hubungan tidak terbuka, panggilan ini tidak langsung membuka hubungan, dan menutup hubungan setelah itu. Jika hubungan sudah terbuka, itu akan dibiarkan terbuka setelah surat dikirim.

source: It can also be used as a context manager, which will automatically call ``open()`` and ``close()`` as needed::
id: Itu dapat juga digunakan sebagai pengelola konteks, yang akan otomatis memanggil ``open()`` dan ``close()`` sesuai kebutuhan::

source: Obtaining an instance of an email backend
id: Mengambil sebuah instance dari sebuah backend surel.

source: The :meth:`get_connection` function in ``django.core.mail`` returns an instance of the email backend that you can use.
id: Fungsi :meth:`get_connection`dalam ``django.core.mail`` mengembalikan sebuah instance dari backend surel yang anda dapat gunakan.

source: By default, a call to ``get_connection()`` will return an instance of the email backend specified in :setting:`EMAIL_BACKEND`. If you specify the ``backend`` argument, an instance of that backend will be instantiated.
id: Secara awalan, sebuah panggilan pada ``get_connection()`` akan mengembalikan sebuah instance dari backend surel ditentukan dalam :setting:`EMAIL_BACKEND`. Jika anda menentukan argumen ``backend``, sebuah instance dari backend itu akan diinstasiasikan.

source: The ``fail_silently`` argument controls how the backend should handle errors. If ``fail_silently`` is True, exceptions during the email sending process will be silently ignored.
id: Argumen ``fail_silently`` mengendalikan bagaimana backend harus menangani kesalahan. Jika ``fail_silently`` adalah True, pengecualian selama pengolahan mengirim surel akan secara diam diabaikan.

source: All other arguments are passed directly to the constructor of the email backend.
id: Semua argumen lain dilewatkan langsung ke pembangun dari backend surel.

source: Django ships with several email sending backends. With the exception of the SMTP backend (which is the default), these backends are only useful during testing and development. If you have special email sending requirements, you can :ref:`write your own email backend <topic-custom-email-backend>`.
id: Django dikirim dengan beberapa backend pengiriman surel. Dengan pengecualian dari backend SMTP (yaitu awalan), backend ini hanya berguna selama percobaan dan pengembangan. Jika anda mempunyai persyaratan mengirim surel khusus, anda dapat :ref:`write your own email backend <topic-custom-email-backend>`.

source: SMTP backend
id: Backend SMTP

source: This is the default backend. Email will be sent through a SMTP server.
id: Ini adalah backend awalan. Surel akan dikirim melalui peladen SMTP.

source: The value for each argument is retrieved from the matching setting if the argument is ``None``:
id: Nilai untuk setiap argumen diambil dari pencocokan pengaturan jika argumen adalah ``None``:

source: The SMTP backend is the default configuration inherited by Django. If you want to specify it explicitly, put the following in your settings::
id: Backend SMTP adalah konfigurasi awalan diwarisi oleh Django. Jika anda ingin menentukan itu secara jelas, taruh berikut dalam pengaturan anda::

source: If unspecified, the default ``timeout`` will be the one provided by :func:`socket.getdefaulttimeout()`, which defaults to ``None`` (no timeout).
id: Jika tidak ditentukan, ``timeout`` awalan akan berupa satu disediakan oleh :func:`socket.getdefaulttimeout()`,yang awalan pada ``None`` (tidak ada waktu habis).

source: Console backend
id: Backend konsol

source: Instead of sending out real emails the console backend just writes the emails that would be sent to the standard output. By default, the console backend writes to ``stdout``. You can use a different stream-like object by providing the ``stream`` keyword argument when constructing the connection.
id: Daripada mengirim keluar surel asli backend konsol hanya menulis surel yang akan dikirim ke keluaran standar. Secara awalan, backend konsol menulis ke ``stdout``. Anda dapat menggunakan obyek aliran-seperti berbeda dengan menyediakan argumen katakunci ``stream`` ketika membangun hubungan.

source: To specify this backend, put the following in your settings::
id: Untuk menentukan backend ini, taruh berikut dalam pengaturan anda::

source: This backend is not intended for use in production -- it is provided as a convenience that can be used during development.
id: Backend ini tidak diperuntukkan untuk penggunaan dalam produksi -- itu disediakan sebagai kenyamanan yang dapat digunakan selama pengembangan.

source: File backend
id: Backend berkas

source: The file backend writes emails to a file. A new file is created for each new session that is opened on this backend. The directory to which the files are written is either taken from the :setting:`EMAIL_FILE_PATH` setting or from the ``file_path`` keyword when creating a connection with :meth:`~django.core.mail.get_connection`.
id: Backend berkas menulis surel pada sebuah berkas. Sebuah berkas baru dibuat untuk setiap sesi baru yang terbuka pada backend ini. Direktori dimana berkas-berkas ditulis adalah baik diambil dari pengaturan :setting:`EMAIL_FILE_PATH`atau dari katakunci ``file_path`` ketika membuat sebuah hubungan dengan :meth:`~django.core.mail.get_connection`.

source: In-memory backend
id: backend di-memory

source: The ``'locmem'`` backend stores messages in a special attribute of the ``django.core.mail`` module. The ``outbox`` attribute is created when the first message is sent. It's a list with an :class:`~django.core.mail.EmailMessage` instance for each message that would be sent.
id: Backend ``'locmem'`` menyimpan pesan-pesan dalam atribut khusus dari modul ``django.core.mail``. Atribut ``outbox`` dibuat ketika pesan pertama dikirim. Itu adalah daftar dalam sebuah instance :class:`~django.core.mail.EmailMessage` untuk setiap pesan yang akan dikirim.

source: This backend is not intended for use in production -- it is provided as a convenience that can be used during development and testing.
id: Backend ini tidak dimaksudkan untuk digunakan dalam produksi -- itu disediakan sebagai kenyamanan yang dapat digunakan selama pengembangan dan percobaan.

source: Dummy backend
id: Backend tiruan

source: As the name suggests the dummy backend does nothing with your messages. To specify this backend, put the following in your settings::
id: Ketika nama menganjurkan backend tiruan tidak melakukan apapun dengan pesan-pesan anda. Untuk menentukan backend ini, taruh berikut dalam pengaturan anda::

source: Defining a custom email backend
id: Menentukan penyesuaian backend surel

source: If you need to change how emails are sent you can write your own email backend. The :setting:`EMAIL_BACKEND` setting in your settings file is then the Python import path for your backend class.
id: Jika anda butuh merubah bagaimana surel dikirim anda dapat menulis backend surel anda sendiri. Pengaturan :setting:`EMAIL_BACKEND`dalam berkas pengaturan anda adalah kemudian Pythn mengimpor jalur untuk kelas backend anda.

source: Custom email backends should subclass ``BaseEmailBackend`` that is located in the ``django.core.mail.backends.base`` module. A custom email backend must implement the ``send_messages(email_messages)`` method. This method receives a list of :class:`~django.core.mail.EmailMessage` instances and returns the number of successfully delivered messages. If your backend has any concept of a persistent session or connection, you should also implement the ``open()`` and ``close()`` methods. Refer to ``smtp.EmailBackend`` for a reference implementation.
id: Backend surel penyesuaian harus subkelas ``BaseEmailBackend`` yaitu bertempat dalam modul ``django.core.mail.backends.base``. Sebuah backend surel penyesuaian harus menerapkan metode ``send_messages(email_messages)``. Metode ini menerima daftar dari instance :class:`~django.core.mail.EmailMessage` dan mengembalikan sejumlah dari pesan-pesan terkirim. Jika backend anda mempunyai konsep apapun dari sesi atau hubungan yang gigih, anda harus juga menerapkan metode ``open()`` dan ``close()``. Mengacu pada ``smtp.EmailBackend`` untuk penerapan acuan.

source: Sending multiple emails
id: Mengirim banyak surel

source: Establishing and closing an SMTP connection (or any other network connection, for that matter) is an expensive process. If you have a lot of emails to send, it makes sense to reuse an SMTP connection, rather than creating and destroying a connection every time you want to send an email.
id: Membangun dan menutup hubungan SMTP (atau hubungan jaringan lain, untuk masalah itu) adalah sebuah pengolahan yang mahal. Jika anda mempunyai banyak surel untuk dikirim, itu masuk akal menggunakan kembali hubungan SMTP, daripada membuat dan manghancurkan hubungan setiap kali anda ingin mengirim surel.

source: There are two ways you tell an email backend to reuse a connection.
id: Ada dua cara memberitahu sebuah backend surel untuk menggunakan kembali sebuah hubungan.

source: Firstly, you can use the ``send_messages()`` method. ``send_messages()`` takes a list of :class:`~django.core.mail.EmailMessage` instances (or subclasses), and sends them all using a single connection.
id: Pertama-tama, anda dapat menggunakan metode ``send_messages()``. ``send_messages()`` mengambil daftar dari instance :class:`~django.core.mail.EmailMessage` (atau subkelas), dan mengirim mereka semua menggunakan hubungan tunggal.

source: For example, if you have a function called ``get_notification_email()`` that returns a list of :class:`~django.core.mail.EmailMessage` objects representing some periodic email you wish to send out, you could send these emails using a single call to send_messages::
id: Sebagai contoh, jika anda mempunyai sebuah fungsi dipanggil ``get_notification_email()`` yang mengembalikan daftar dari obyek :class:`~django.core.mail.EmailMessage` mewakili beberapa surel berkala anda ingin kirimkan, anda dapat mengirim surel ini menggunakan panggilan tunggal untuk send_messages::

source: In this example, the call to ``send_messages()`` opens a connection on the backend, sends the list of messages, and then closes the connection again.
id: Dalam contoh ini, panggilan pada ``send_messages()`` membuka hubungan pada backend, mengirim daftar pesan-pesan, dan kemudian menutup hubungan kembali.

source: The second approach is to use the ``open()`` and ``close()`` methods on the email backend to manually control the connection. ``send_messages()`` will not manually open or close the connection if it is already open, so if you manually open the connection, you can control when it is closed. For example::
id: Pendekatan kedua adalah menggunakan metode ``open()`` dan ``close()`` pada backend surel untuk secara manual mengendalikan hubungan. ``send_messages()`` tidak akan secara manual membuka atau menutup hubungan jika itu sudah terbuka, jadi jika anda membuka secara munual hubungan, anda dapat mengendalikan ketika itu tertutup. Sebagai contoh::

source: Configuring email for development
id: Konfigurasi surel untuk pengembangan

source: There are times when you do not want Django to send emails at all. For example, while developing a website, you probably don't want to send out thousands of emails -- but you may want to validate that emails will be sent to the right people under the right conditions, and that those emails will contain the correct content.
id: Ada saatnya ketika anda tidak ingn Django mengirim surel sama sekali. Sebagai contoh, selagi mengembangkan sebuah situs jaringan, anda mungkin tidak ingin mengirim ribuan surel -- tetapi anda mungkin ingin mensahkan surel akan dikirim ke orang benar dibawah suasana yang benar, dan surel itu akan mengandung isi benar.

source: The easiest way to configure email for local development is to use the :ref:`console <topic-email-console-backend>` email backend. This backend redirects all email to stdout, allowing you to inspect the content of mail.
id: Cara terbaik untuk mengkonfigurasi surel untuk pengembangan lokal adalah menggunakan :ref:`console <topic-email-console-backend>` backend surel. Backend ini mengalihkan semua surel ke stdout, mengizinkan anda memeriksa isi dari surel.

source: The :ref:`file <topic-email-file-backend>` email backend can also be useful during development -- this backend dumps the contents of every SMTP connection to a file that can be inspected at your leisure.
id: Backend surel :ref:`file <topic-email-file-backend>` dapat berguna selama pengembangan -- backend ini membuang isi dari setiap hubungan SMTP ke sebuah berkas yang dapat diperiksa pada waktu luang anda.

source: This command will start a simple SMTP server listening on port 1025 of localhost. This server simply prints to standard output all email headers and the email body. You then only need to set the :setting:`EMAIL_HOST` and :setting:`EMAIL_PORT` accordingly. For a more detailed discussion of SMTP server options, see the Python documentation for the :mod:`smtpd` module.
id: Perintah ini akan memulai server SMTP sederhana yang berfungsi di port 1025 dari localhost. Server ini berfungsi sesederhana menulis ke standard output semua headers dan badan email. Anda hanya perlu mengubah :setting:`EMAIL_HOST` dan :setting:`EMAIL_PORT` yang sesuai. Untuk diskusi yang lebih detil dari opsi server SMTP, lihat dokumentasi Python untuk modul :mod:`smtpd`.

source: External packages
id: Paket eksternal

source: ``django-localflavor`` is a collection of utilities for particular countries and cultures.
id: ``django-localflavor`` adalah kumpulan dari alat-alat untuk negara dan budaya tertentu.

source: Comments
id: Komentar

source: Formtools
id: Formtool

source: ``django-formtools`` is a collection of assorted utilities to work with forms.
id: ``django-formtools`` adalah kumpulan dari berbagai macam keperluan untuk bekerja dengan formulir.

source: Managing files
id: Mengelola berkas

source: By default, Django stores files locally, using the :setting:`MEDIA_ROOT` and :setting:`MEDIA_URL` settings. The examples below assume that you're using these defaults.
id: Secara awalan, Django menyimpan berkas-berkas secara lokal, menggunakan pengaturan :setting:`MEDIA_ROOT` dan :setting:`MEDIA_URL`. Contoh-contoh dibawah menganggap bahwa anda sedang menggunakan awalan-awalan ini.

source: Using files in models
id: Menggunakan berkas dalam model

source: When you use a :class:`~django.db.models.FileField` or :class:`~django.db.models.ImageField`, Django provides a set of APIs you can use to deal with that file.
id: Ketika anda menggunakan :class:`~django.db.models.FileField` atau :class:`~django.db.models.ImageField`,Django menyediakan sekumpulan dari API anda dapat gunakan untuk berhbungan dengan berkas itu.

source: Consider the following model, using an :class:`~django.db.models.ImageField` to store a photo::
id: Pertimbangkan model berikut, menggunakan :class:`~django.db.models.ImageField` untuk menyimpan sebuah foto::

source: Any ``Car`` instance will have a ``photo`` attribute that you can use to get at the details of the attached photo::
id: Instance ``Car`` apapun akan mempunyai atribut ``photo`` yang anda dapat gunakan untuk mendapatkan rincian dari foto terlampir::

source: This object -- ``car.photo`` in the example -- is a ``File`` object, which means it has all the methods and attributes described below.
id: Obyek ini -- ``car.photo`` dalam contoh -- adalah obyek ``File``, yang berarti itu mempunyai semua metode-metode dan atribut-atribut digambarkan dibawah.

source: The file is saved as part of saving the model in the database, so the actual file name used on disk cannot be relied on until after the model has been saved.
id: Berkas disimpan sebagai bagian dari menyimpan model dalam basisdata, jadi nama berkas sebenarnya digunakan pada cakram tidak dapat bergantung setelah model disimpan.

source: For example, you can change the file name by setting the file's :attr:`~django.core.files.File.name` to a path relative to the file storage's location (:setting:`MEDIA_ROOT` if you are using the default :class:`~django.core.files.storage.FileSystemStorage`)::
id: Sebagai contoh, anda dapat merubah nama berkas dengan mengatur :attr:`~django.core.files.File.name` berkas ke jalur relatif ke tempat penyimpanan berkas (:setting:`MEDIA_ROOT`jika anda sedang menggunakan awalan :class:`~django.core.files.storage.FileSystemStorage`)::

source: The ``File`` object
id: Obyek ``File``
